{
    "rating": 4.3,
    "release_date": "2006-08-11",
    "num_reviews": 142,
    "genres": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "summary": "Former superhero Jack is called back to work to transform an unlikely group of ragtag kids into superheroes at a private academy.",
    "reviews": [
        {
            "review_title": "Oh, for a kid's movie, you need to give it a break",
            "content": "I rented this movie for my cousin, it was his pick and we watched it as soon as we got home, he loved it! I seriously was expecting this big travesty of a film with the way the users are talking about it on IMDb, but I have to honestly say that it wasn't THAT bad, come on, it's a kid's movie, what did you expect? Citizen Kane? For the kids it had a fun plot and cool visuals, yeah, the story was a little lame, but as adults we should know that this movie was not meant for us, so I am going to judge it on being a children's movie.These kids all have super powers, but don't know how to use them effectively, so the program of Zoom is going to help them become super heroes with a man who was a former celebrity type of hero who is now a has-been. They enjoy being kids with each other and learn how to use their powers in the right ways and must destroy Conor, another former super hero who went bad. Together they all must learn to a team and also a family.Like I said, for a kid's movie, it's cute and it really wasn't a BAD movie, I've seen worse, believe me! So don't use most of these comments as your judgment factor, see how the kids react and really judge for yourself, it's a fun little flick that I wouldn't watch again, but I think it will be a fun small classic somewhere down the road for the children.5/10",
            "review_date": "2007-02-27"
        },
        {
            "review_title": "IMDb voters get it wrong on this one",
            "content": "This is a solid KID movie. Our family of five (kids aged 9 to 13) watched the whole thing, no one left or wanted to. My wife kept saying how it was a good movie. I liked it and watched -- much more than I can say for Barnyard.This movie featured Smash Mouth and they did a lot of songs, some their own and some covers. This made the music much better than average.Tim Allen is a very watchable likable guy and here he is no exception.The CGI was above average, making the movie an X-Men for kids. It is also a bit like Spy Kids, only better in my eyes.Courtney Cox was very game, the kids (and The Kid) were just fine but personally, I thought Rip Torn's take on his part was goofy -- but I don't think this will hurt his rating by those aged 12 or under.Frankly I am totally mystified by this film's rating (2.2 as of this writing). All I can think of is Hollywood is afraid on someone in this movie becoming a threat to the elite and wants to sink them (like they did with Costener in Waterworld).",
            "review_date": "2007-03-03"
        },
        {
            "review_title": "Classic slapstick Allen and Chase",
            "content": "I actually watched this movie before I read any of the reviews or comments on this site which is rare for me; I tend to value the reviews and rankings of the other members. This is the first time I am left scratching my head wondering what exact movie did you people watch to give it such low reviews??!! This movie is what it is and a very good job of it. It is a movie that makes fun of super hero movies. Take a bitter misfit ex-superhero who can't be any less interested in training new recruits and make it funny. Zoom has his reasons to be bitter and they are CLEARLY explained, if people don't get the plot, they weren't really paying attention. The acting in this movie is very good by a well collected cast. Allen and Chase deliver slapstick one liners throughout the whole movie that are truly reminiscent of their comedic classic styles. If the one liner isn't enough to make you laugh, add the highly adorable factor from Ryan Newman as Cindy Collins is tops. The rest of the cast works very well together and even though there is a lot of predictability in the movie, it is still very funny and worth the watch. This is not a literary classic brought to life, so don't expect it to be. The negative comments about Allen are unjust, as his character wasn't' that far off from his style in the Santa Clause movies. This movie was enjoyable and I laughed out loud many times and I don't do that often with movies because they just aren't as funny in the same style. If you want to just relax and laugh at a silly movie, the Zoom on over to your video store and pick this one up.",
            "review_date": "2007-02-15"
        },
        {
            "review_title": "Saving the world has never been such a chore",
            "content": "\"Zoom\" is a kids' superhero flick based on the novel \"Zoom's Academy\" written by Jason Lethcoe. In it, Tim Allen stars as a has-been superhero who's tasked to train four young superheroes to battle a nemesis. With that, you pretty much know what to expect. Unfortunately, that's all. While the film has all what comprises a prototype of this milked-dry genre, the experience is overtly familiar and dull.Jack Shephard (Allen... nope, not Matthew Fox) was Captain Zoom, a superhero who can travel at superhuman speeds, and one of the members of the military-sponsored superhero group \"Team Zenith.\" But he has since lost his powers after a military experiment has gone awry that also has his teammates killed. 30 years later Jack is brought back to train four youngsters with superpowers when a new malevolent threat from the past emerges.First of all, the script of Adam Rifkin and David Berenbaum doesn't attain new heights with their blunt dealing of a theme that's been done more excellently with \"The Incredibles\" and \"Sky High.\" And director Peter Hewitt (\"Garfield\"), who clearly isn't exactly a master storyteller himself, has little to work from with such a dull and hollow material. All of the characters are perfunctory parts rather than humans portraying genuine conflicts.Also, for a film that's called \"Zoom,\" the film drags: it lacks a sufficient amount of action. We're supposed to see the kids train, but all we're mostly shown are unfunny attempts at slapstick humor that the filmmakers assume would elicit laughters from the little tots among the audience (uhm, Courteney Cox tripping down and Chevy Chase getting slime on his face, anyone?). What constitutes for training involve at the most paint balls and a drive-thru chaos at a Wendy's restaurant. Yes, there's the climactic fight sequence at the end but it's too quick, unexciting, and not enough by a mile for a film that has terribly dragged along.Ultimately, what transpires is a terribly unfunny movie that wears out its welcome faster than its main character runs.",
            "review_date": "2006-09-27"
        },
        {
            "review_title": "It feels like \"product\"",
            "content": "I have seen a number of movies from Revolution Studios, and with almost all of them I have found them to be souless \"product\" - movies put together with ingredients that seemed to guarantee a big hit, but lacking soul. With movies like this (a box office flop, partly due to the fact it was not screened for critics, a sign audiences know usually means a stinker), it's no wonder that Revolution Studios closed its doors a year later.What went wrong with this movie? The main reasons the movie is a stinker can be traced to the script. We have four youths on the team Allen is leading, and we learn next to nothing about them. They are pretty interchangeable. The rest of the characters are poorly written as well. The bad guy of the movie doesn't appear until the last 15 minutes of the movie, leaving no time to develop him.This poor writing of the characters may explain the awful performances from the adult members of the cast. I agree with the Leonard Maltin movie guide that Allen seems to be phoning it in. He seems to have a contempt for what he is surrounded by, making his character very unlikable. As for Chevy Chase, he doesn't even TRY to be funny.The movie tries to inject emotion by playing popular pop songs on the soundtrack, but it doesn't work. The sets and various indoor and outdoor locations are okay, I guess. But the CGI used is third-rate, giving the movie a cheap look when it occurs. Kids may not mind that. But will they like the rest of the movie? If I saw this as a kid, I probably wouldn't have liked it - the movie lacks spirited characters and a sense of wonder and excitement. There may be some (very) young kinds who might like this movie, but I don't think it will be a movie that they will want to watch again and again.",
            "review_date": "2009-08-08"
        },
        {
            "review_title": "My kids loved it, I wasn't very impressed",
            "content": "My kids thought it was a great show. They ran around for the next week pretending to be really fast/invisible/strong.I wasn't very impressed. As ever the effects were adequate, even the story was good. The character development was lacking and the acting was wooden.The movie has a couple of guys who should be really funny; Tim Allen & Chevy Chase. They just weren't made use of in a funny way. Courtenay Cox was funnier and for her that's saying something.The climax was anticlimactic but I think this links back to poor character development. We just didn't get to know the bad guy enough to really care about him.",
            "review_date": "2006-08-21"
        },
        {
            "review_title": "Peter Hewitt is an awful and lazy director!!!!",
            "content": "Remember how in the 70's you could tell the production value of a film by how often you saw the boom mike fall into view of the actors- well thanks to boom operator Darryl Purdy and the laziness of Peter \"I apparently never watch the dailies\" Hewitt, you can see the boom mike fall into view 3 separate times. That said allow me to point out that the cute little girl who acts as badly as her speech impediment can't save the film in the same way that the Brady Bunch would not have been popular with a the show devoted to Cindy Brady. There was so much wasted possibility showing us the back ground of these characters the over use of montage and collage editing would not have been needed. Also the film has three apparent villains in the film except none of them are bad and we never know why two of them are necessarily considered bad- but that's o.k. because the story was written by someone with ADD or perhaps short term memory loss as significant as the character in \"Memento\".The story has no continuity- Tim Allen hates the kids he plays with the kids he feels sorry for the kids no wait he doesn't understand why he's there to train the kids_ FOR THE LOVE OF GOD MAKE UP YOUR MIND!!! Nothing in this movie fit together- and in the end the super evil villain (whom we have waited 90 minutes to see) gets a scolding in the last 6 minutes of the movie and then it's over. Didn't Peter Hewitt read the script before filming oh no wait this is the same guy that gave us \"Bogus Journey\"- you remember- the sequel that ended the Bill and Ted franchise. Not to mention the Garfield Movie.. a comic strip so revered for 30 years they made it into a Saturday morning cartoon but the movie that couldn't keep the audiences attention for 90 minutes (success based solely on a lack of other children films during its release and parents who grew up with Garfield the previous generation)...WHY DOES PETER HEWITT GET WORK, why?? Afterall,it is the directors responsibility for many things including having a working script and a vision before starting a project ( the exceptions being Andy Warhol who's audience base was too stoned to notice and Francis Ford Coppola with \"Apocalypse Now\" who had several million dollars to keep his dream afloat. Peter Hewitt should be ashamed of himself for this crap.",
            "review_date": "2006-08-16"
        },
        {
            "review_title": "The very young and somewhat older movie fans should get a kick out of this flick",
            "content": "\"Zoom\" is a fun movie for two audiences. It's a comedy sci-fi flick that was made for kids, with a far-out allusion to the super-heroes group from the age of comic books. The humor appeals a little bit to we older movie buffs. But of more interest and entertainment for the older movie crowd are the two characters, Dr. Grant and General Laraby.Chevy Chase is a hoot as the government scientist, Dr. Grant, and Rip Torn is very funny in his frequent role as a cantankerous commander of some sort from films of the past. Tim Allen and the younger cast who play the super heroes are okay and should amuse the younger of the young crowd who follow the superheroes. Of course, once they reach about eight years of age, the kids are no longer dazzled by these more comical, kid-friendly characters. They're ready for the tougher, rougher, more daring super hero flicks. They want the \"real thing\" like the adults. You know, Spiderman, Batman, Superman, Wolverine and Captain America.My grandkids, the youngest ones anyway, get a kick out of flicks like this.",
            "review_date": "2022-01-18"
        },
        {
            "review_title": "Worst movie of 2006!",
            "content": "Zoom will not only be remembered with such dogs as Ishtar, Howard the Duck and Gigli, but also as one of the most blatantly thieving movies of all time. The only way to stay awake while watching Zoom is to count how many scenes, characters and story ideas are stolen from other movies. From X-Men and Sky High to Spy Kids and Fantastic 4, on and on, this movie steals from everyone. And none of it works! The most interesting anomaly is that finally there's a movie with Chevy Chase where the material is worse than he is. (Sorry Chevy, but six or seven movies not withstanding, your career consists of mostly dogs.) But the problem with Zoom is not the actors, it's the script. At least Howard the Duck and Ishtar, garbage that they were, were fairly original. Zoom is recycled, regurgitated crap from uninspired filmmakers, and it's just another nail in the coffin that was once Hollywood.",
            "review_date": "2006-08-15"
        },
        {
            "review_title": "Learn how to watch and rate movies people (rated for balance only)",
            "content": "The people who rated this movie 1-star should get their heads out of their posteriors. Too many movie-goers these days seem to only see movies as either being the best thing ever or the worst thing ever. The only way a movie should get 10 stars is if it would be difficult to improve upon and the only way a movie should get 1 star is if it was absolutely ineptly made on every level, and I assure you this movie doesn't come close to that. Even solely rating on personal taste and ignoring the technical filmmaking and how successfully the movie achieves the filmmakers' apparent intent, this movie could hardly be in the worst 10% of movies for anyone's taste.This movie fails in many respects, but it has some redeeming moments and taken as a movie for small kids, it's not bad. The humor and acting both fall flat or miss the mark about as often as they're on target, but that is a sign of mediocrity, not atrocity.Unfortunately at this point most of the IMDb users seem to think that if they enjoyed a movie they should give it a 10 and if it wasn't all they hoped for they should give it a 1. For instance the Lord of the Rings movies were entertaining, but have no business being rated higher than Citizen Kane or any of the countless classics relegated to lower ranks here. Similarly. Zoom has no business being rated lower than a piece of garbage like I Accuse My Parents which wasn't even watchable when it was skewered on Mystery Science Theater 3000.Remember folks most movies are mediocre. That means a low rating, not the bottom rating. Furthermore, just because a movie is exciting or satisfying doesn't make it a 10. For example, one can love the original Star Wars movies and still realize they have occasional flaws in acting, direction, pacing, or script.Is Zoom a great movie? Absolutely not. Will some children, some parents, and even some adults without children enjoy it? Yes. Will it go down in history for being remarkable in any way? Probably not.",
            "review_date": "2007-02-24"
        },
        {
            "review_title": "Dumber Than a Speeding Bullet.",
            "content": "This movie made me weep with emotion. I had no idea a movie could be THIS FREAKIN' BAD.Oh, of course - Chevy Chase is in it. 'Nuff said.Tim Allen is retired superhero Zoom (think: The Flash as a doughy guy), called back into service by the secret government agency (aren't they all?) that created him - not for his super services but as a consultant, to train a new generation of kid heroes.Courteney Cox is the bespectacled hot chick scientist who is supposedly dorky and not hot because of the spectacles. Chevy Chase is head of the secret government superhero project and doing as inept a job as we would expect him to be doing. That's not a gag when we're referring to his non-existent comedic timing as well.There is a scene where Zoom tells a kid how he has long stopped using his super speed, by vibrating his finger like a, well, a vibrator, and saying, \"There was a time when I could make my whole body do that!\" Courteney Cox just gushed in her lab coat.Zoom's brother, a guy who was originally a part of the super team and went rogue, is on his way back from some other dimension to, we surmise, do Bad Things. And Zoom's new uncooperative team of spoiled brats must be whipped into shape in time to stop him. Zoom rediscovers his superspeed in the process and there is much Disney rejoicing that makes us embarrassed to be alive.Appeals to the teen-and-below market who don't realize this story of self-realization has been told a million times, a billion times better.Cry Chevy and let slip the dogs of bore.--Review by Poffy The Cucumber (for Poffy's Movie Mania).",
            "review_date": "2009-10-13"
        },
        {
            "review_title": "Someone lost the promise",
            "content": "First off, a tiny bit about me. 1) I took my daughters (13 & 10) to this movie. 2) I tend to enjoy children's movies and I love SciFi. 3) My wife & I mostly agreed about the quality of this movie. 4) I've never rated a movie before.Although I agree with many points from the first posting, I do think this movie *had* promise. It seems to me that if all characters were developed properly, that the screenplay had been more carefully thought out, that the technical filming of the show had gone better (boom mic!), that there was cohesiveness to the whole story, and that the actual plot had been more fully developed that this movie could have been spectacular. I was even willing to accept the story line until the kids were mysteriously found dutifully waiting in their room when they were supposed to be hiding. After that, it went downhill quickly for me.I would have liked to see more exemplary development of the kids' powers -- the kind of foreshadowing that is later revealed in how they save the day (ie. A scene of Summer controlling the paint balls would have helped me believe better her focused power use in the end). Why spend all that time watching Cindy throw ton-weights at a target? How did Dylan's ability with the apple help in the end? What did they do with Tucker to help him learn to control his bloating? How is \"mind sight\" related to invisibility? Don't even get me started on Ms. Cox character (which I thought she played well).The pacing and development of the two predictable romances was fair, but why not let Summer have a little tirade with Dylan for knowing he had \"seen\" her dancing? Followed up with Dylan's peace offering of the necklace pendant -- drama & release -- make the relationship grow on us.The human stories here have to do with the kids as outcasts in life. Let's develop that more than the two short bits about the girls and Jack finally relating to Dylan. Zoom needed to grow with each kid to show his own growth and bring out his determination to succeed.Then again, succeed at what? I think Tim Allen does a great job with the \"unknown\" aspect of the plot. He has no motivation, he gives none. But without a believable reason to drive the plot of the kids' training, we get what we saw. Also, there's nothing socially \"dangerous\" about the threat of Concussion - it seems a personal vendetta or overblown fear that Larraby is concerned about -- hardly enough to make me feel for him or his cause, and, unfortunately, the movie.Finally, let's chew on continuity and technical prowess. I was thinking I saw the boom 5 times (but let's not quibble). Aren't people paid to notice these things (the director, even) during production? Let's keep track of where the characters are and give them a reason to go/be somewhere else. Let's give the characters more reason, heck even a strategy, to want to make and close a vortex. Let's see Rip Torn say the line that we watch him ventriloquize {sic}.Would I watch it again? Maybe just to watch Zoom stumble again, see Houdini throw another punch, or see Summer be radiant -- OK, Cindy's got the tough-cute factor that can be enjoyable in moderation (pull up a chair, whydontya).",
            "review_date": "2006-08-16"
        },
        {
            "review_title": "What could possibly be the motivation for making a film like this?",
            "content": "It is conceivable that a movie about four misfit young people turned superheros could have been made into an enjoyable family film, but someone made a serious wrong turn early in the film-making process here. To make matters worse, rather than abandoning this sinking ship early on, or starting over at square one, the filmmakers appear to have blindly moved forward producing what can only be described as a disaster that will quickly find a home among the most poorly rated movies at IMDb and leave theaters quickly.The biggest question I have is why? Why was this movie made? Why was no one minding the store? Why was this screenplay ever permitted to see the light of day? I took my five year-old to the movie because the previews looked okay and we love movies. The fact that it took less than five minutes for him to get fidgety after the movie started was probably a good clue to what was ahead. He never did calm down and I'm not sure he paid attention to more than ten minutes of the whole movie.The script and sets are both beyond ridiculous and rarely make any sense at any time during the movie. Some of the acting is really over the top absurd, Rip Torn and Chevy Chase come to mind. With the exception of Courntey Cox, this film seems like it exists purely to provide a vehicle for over the hill actors to bring in a little up front income. However, since this movie will not turn a profit, it is the studio that will pay price in the end and I suppose they deserve it.There are a few moments in the first 15 minutes of the movie where you have a hope that something good will happen in the movie, but we quickly discover that the purposes behind bringing this group of kids together are entirely unsound and unexplainable and the rest of the movie has been constructed around random events placed in the film for no apparent reason other than to fill the obligatory 90 minutes minimum required for all non-animated movies.Besides all of the rest of what makes this movie rotten, the worst thing of all is that there never turns out to be any plausible reason to have brought these four kids together in the first place to make them superheros.By the time we arrived at the end of the movie, I cared so little about what happened to any of the characters, that I was just bouncing around in my seat, looking over at my wife and child and praying it would end any moment.There are real reasons that this movie is nearly universally hated by professional critics and movie-goers alike and that is that this movie is entirely unoriginal, incoherent and borders on being unwatchable.",
            "review_date": "2006-08-13"
        },
        {
            "review_title": "Painful",
            "content": "It was nothing short of painful.I took an 11 year old to see this movie, and he was actually sore at me for suggesting the movie.The way I see it Peter Hewitt owes me $20 for the movie tickets and 3 hours of my life back (1.5 hr for the movie, 1/2 hr for the drive, and 1 hr for all the time I spent bitching about how awful it really was)!From the boom mic in the shots, to the five minute fight scene at the end, to the terrible acting by the team as a whole, to the total lack of understanding behind the conflict with Chevy Chase and Rip Torn and the team, to Tim Allen's lack of understood emotion, to Courtney Cox's most painful character to date - the movie was just plain awful.",
            "review_date": "2006-08-24"
        },
        {
            "review_title": "great movie",
            "content": "it is a great movie it is a really funny movie i never saw anything like this before it is a funny funny movie you will like this movie a lot Tim Allen is funny and he is really funny on this movie this mate one of the best movies he has been in this is one good movie that the family will enjoy it is one funny movie i never saw anything like this before this movie is a masterpiece it is amazing i like this movie so much you will like this movie a lot make this movie number 1 of the best family films this is one of the best movies i haver ever seen you will like this movie a lot make this movie number 1 movie in the whole world this is a cool movie this is a hoot zoom is a cool movie that you have too see i like this movie so much i never saw anything like this before make this movie a golden mettle i like this movie a lot this is one cool movie that you just have too see",
            "review_date": "2011-12-28"
        },
        {
            "review_title": "ZOOM ZOOM ZOOM \"Galaxy Quest\" part 2, Allen proves yet again that it's for the money",
            "content": "An odd group of super hero misfits must be shaped up by a dimwitted leader Zoom (Money whore Tim Allen). Some of the child actors are okay but their powers and the whole back story is foggy. Despite they need to be trained at the Academy there was, for me, no good reason to care. Allen after doing \"Shaggy Dog\" (another runner up for worst of 06) shows that despite the god awful taste in film selections he is just doing it for the MONEY. So the next Allen flick that comes out don't expect some kind of descent film just expect Tim laughing it up on screen pulling ridiculous stunts like \"Zoom\". Despite the kids, probably who this mess was made for it is regrettable, despicable and down right dimwitted. *1/2",
            "review_date": "2006-08-15"
        },
        {
            "review_title": "Text must not be empty.",
            "content": "The soundtrack having 5 smash mouth songs really fits the tone and overall quality of the movie.",
            "review_date": "2020-03-02"
        },
        {
            "review_title": "Seriously?",
            "content": "The one thing that stuck with me long after watching this movie was the realization that my first impression of Chevy Chase was wrong. When he first appears on screen I was positive he was covered in make up. But as time wore on it became clear that's actually what his head looks like these days. Good Lord...The current state of Chevy Chase's head is actually the most interesting aspect of this movie. The rest of the movie is celluloid child abuse and by that I mean you really need to rethink your parenting skills if you willingly subject your kids to this. It indicates you hate them and punish them severely or you have a desire to warp their minds with absolute crap.Children's movies have a lot of apologists out there. People who will toss out \"it's a kid's movie, what were you expecting?\" or some equally weak line that makes it seem like stories should treat kids like complete idiots and be poorly structure from the beginning, because what do kids know? They're probably stupid enough to buy it.Maybe I was an overly sarcastic child, but I know I would have ripped this movie a new one back in the day, too. It's garbage heaped on garbage.Why does Courtney Cox have pratfalls? Just because Laurel and Hardy haven't done a lot of work lately, there's no need for Courtney Cox to steal their shtick. Nor is there need for her to deliver some of the worst lines in filmed history, but whatever. The writer of this film is a demon that needs to be exorcised by a force far greater than me.What abominably forgetful and unobservant, near-sighted beast edited this thing? Never have I seen such heinous editing in all my life. Montage after montage is tossed at you and in no way do the events portrayed therein reflect the story that exists when the montage stops. It makes no sense at all. You have Tim Allen, just as talentless and unfunny as ever, being crabby and pathetic as the would-be teacher to these kids, then a montage starts and everyone looks like they're having the time of their life, then the montage ends and someone whines about how Tim Allen still isn't doing his job and the kids need him and blah blah. All until the next montage starts when everything seems happy again.But wait, there's more. Smash Mouth? Are you joking? Who thought, in 2006, that a band no one has cared about in 5 years would be good for a soundtrack? A band that has to accompany every single one of the numerous, pointless montages. And to keep things consistent, all the rest of the songs in the movie are also outdated. But...why? Did they get a deal on a NOW CD or something? Why did they cast a kid who isn't fat as a fat kid and then stuff a pillow down his shirt? Why can I see the boom mic? Didn't anyone at all care about how this movie looked? Why do casting directors always look to Tim Allen when they have a horribly unfunny children's movie to make? I get that he's not funny so it stays in the theme but I can't help but think maybe they didn't intentionally set out to make the movie unfunny.When Rip Torn says \"I speak Greek not Geek\" I could almost see all the 4 year olds around the world rolling their eyes as one.I'm going to go out on a limb and suggest the entire end of this movie was improv. It's the only explanation I can think of for why it's so terrible. The entire awful, nonsensical movie builds up to this ending with this super villain whose powers are inexplicably nullified by Tim Allen in an absolutely idiotic body stocking and helmet running around him really fast. Then everything is cool again.In a nutshell, this is a perfect movie if you want to punish your children for some nameless crime, or if you're just an unloving kind of person. For any other reason, I can't imagine anyone needs to watch this. Ever.",
            "review_date": "2007-08-29"
        },
        {
            "review_title": "Better than I thought",
            "content": "This was actually better than I thought it would be. I expected a \"Sky High\" rip off, but was pleasantly surprised that it was not. \"Sky High\" is a better movie but \"Zoom\" is a good movie too. These movies are not meant to be great cinema, but it did what it was intended to do. It transported my mind to another place for an hour and a half. The cast was very likable and funny. It was nice to see Chevy Chase do something decent for a change. I for one got my moneys worth. I went to a showing with a lot of families and the parents had as much fun as the kids.\"Zoom\" will make you smile and laugh and let you escape for a little while.",
            "review_date": "2006-08-11"
        },
        {
            "review_title": "To The Boy Who Wanted To Be A Superhero",
            "content": "I had some tears in my eyes watching Zoom this evening. Not because of the quality of the film which I found good and entertaining. But because it took me back over 10 year to someone who was really into superheroes and the comic books that popularized them.The late Roy Gomez did not have a great time in the brief span he had on Earth. He and his sister were taken from their parents and placed in a group home which he hated his whole life. In the time I knew him, the one thing he always told me was how he wished he had a family. He ran away from the home when he was 16. What his venue of escape from a life that included drug addiction and AIDS were his comic books. He discovered the world of superheroes while in the group home. He knew and followed every one of them. He loved science fiction as well and was as addicted to Star Trek as he was with crack. Every time I see a film involving superheroes with the computer generated special effects that were unheard of in my youth I do think of Roy and how he loved these films. But this one especially got me.It was the way Tim Allen and Courtney Cox created a family like atmosphere for the gifted kids in their charge. They trained them, but also shielded and protected them from those who would exploit them. I thought this was what Roy dreamed about as a kid, someone to take and adopt him into just such a group.Roy died in 1996 at the age of 26. He would have LOVED seeing the film adaptions of The Punisher, The Fantastic Four, the new Superman. But I think he would have really enjoyed this film.So thank you Tim Allen, Courtney Cox and all those involved in the making of Zoom. And Roy, this one was for you.",
            "review_date": "2006-08-17"
        },
        {
            "review_title": "Not bad for a KIDS movie - which is what it was meant to be",
            "content": "This movie was not that bad. My kids loved it and so did all the other kids in the theater. So what if it is a formula movie...it is for children. There is a lot of family moments in this movie. It is geared toward teamwork and thinking about others instead of yourself all the time. It has slapstick humor and some gross adolescent type jokes, but clean language and the kids seem to stand up for each other, which is nice. The little girl does have anger management issues. This is no Academy award winner, but a decent movie for preteen kids. I would say most kids under 13 will like this movie. It's nice not to have to worry about language even if there are some gross special effects... What else is Tim Allen suppose to be in...I don't see Hollywood knocking down his door for serious movies. He's a comedian turned actor and is good for kids movies. I like seeing Courtney Cox in it as well. Maybe she will well in the area of family movies. Better than all that junk Jennifer Aniston is killing us with. Over all I didn't mind this movie which is more than what I could say for some of the other kid movies I've seen and would recommend it to others.",
            "review_date": "2006-09-30"
        },
        {
            "review_title": "Overused Disney superhero formula killed off by bland ZOOM.",
            "content": "My Take: A positively dull family comedy with one pathetic excuse for comedy after another. Not tired by the success of THE INCREDIBLES and SKY HIGH, Disney reuses the tired \"average-ordinary everyday superheroes\" formula once more, this time one time too many. Finally overusing it to the death, Disney's ZOOM is bland, unfunny and totally juvenile excuse for family entertainment which may find audiences in the younger set, but will totally annoy anyone above the age line of ages 1-6. While the presence of Tim Allen and his sarcastic bite of humor lightens things up, the product itself is light enough with a completely empty script, free from any funny or original ideas. It... was just pathetic.Allen plays a retired superhero who is recalled by his associates, a clumsy scientist played by a wasted Chevy Chase, to train a couple of newbie superheroes, including ones that disappears in thin air (Dylan West, played by Michael Cassidy), who can control objects at will (Summer Jones, played by Kate Mara), who can inflate himself to the size of hot-air balloon (Tucker Williams, played by Spencer Breslin) and a little girl with the strength of The Hulk (Cindy Collins, played by Ryan Newman), and you won't like her when she's angry too (as a matter of fact, I didn't like her... at all). First of all, he has to cope with their irregularities and life problems to training them with the use of their powers. But that hardly passes as a screenplay, as the movie not doesn't have any big laughs, but the story and characters are as empty as the entire exhausted enterprise. Allen can do funny, but he's as tired as anyone else in this fabricated mess.If their not tired, their embarrassing, which is twice as worse. Need I mention Courtney Cox in such an embarrassing performance? Need I mention Chevy Chase in a waste role that can be played by anyone... even your grandpa? Or what about that annoying little girl, whom the writers call \"cute\". How does any money-hungry exec at work in this claptrap expect the audience to buy into some theatrical film that would run fine in local cable for cheaper effect. Director Pete Hewitt (director of the similarly dull GARFIELD) seems more suited to local cable, as his project just yells out \"made for TV\" all over. The special effects are not at aplenty, but still awful in every sense. The acting is extremely feeble, but who could blame 'em? The script isn't exactly working class material! On top of it all, it all comes down to the energy. There's no energy, no fun at all to be had in ZOOM, at least not to any older audience. Kids, as usual, will find ZOOM quite a treat. Adults will be forced to find a liking for counting grain when forced to watch this. Don't take the risk! Rating: * out of 5.",
            "review_date": "2008-08-02"
        },
        {
            "review_title": "Wow, this is terrible in every aspect!",
            "content": "I would rather watch just about anything than have to see this absolutely clichéd-wanna-be-superhero flick. It is terrible and pointless as can be. It really is ashame that the adorable (And upcoming star I might add) Kate Mara having to be in this piece of garbage. It is even more sad seeing the once great Chevy Chase in a 8th supporting role and being over-shadowed by... well everything! I don't recommend this to anyone, unless you get it free and want to laugh at all the stupidity involved in it. Maybe it will go down as one of those movies you laugh at because it is so dumb later down the line, but I doubt that happening. I'm actually surprised this isn't even rated lower than what it is rated now. It really makes you wonder how kind of talented people like Tim Allen, Courtney Cox, and the already mentioned (and Lovely I might add) Kate Mara. Here's hoping that this is one of those flicks that gets forgotten. I also hope that it isn't held against any of the kids who were in it either. It gets the rating it gets because the production values are passable, and Courtney Cox still looks great.",
            "review_date": "2007-07-28"
        },
        {
            "review_title": "your kids will probably like this one",
            "content": "i didn't like this movie.i found most the gags fell flat.the plot is lighter than feather.but the worst thing for me was the acting.none of the adult actors really seemed to put any effort into it, although i did notice that Courteney Cox definitely has a gift for physical comedy.i did find her klutzy character amusing,but she was really the only bright spot as far as comedy goes.the kids were the best actors.you could tell they put some effort into it.i especially thought little Ryan Newman was quite good as Cindy Collins/Princess.she seems to have a natural talent.for acting in general and comedy.anyway,i think this movie was supposed to be a comedy but other than Courteney,and Ryan,i just didn't see it.having said all that,though,for most kids,it's sure to be a blast.it's easy to follow,there's nothing offensive that i can recall.parents can set their kids down in front of the TV for 90 minutes,and know they are watching kid friendly content.adults might like it too,if they ca get around how lite it is.for me,though Zoom is a 4/10",
            "review_date": "2007-11-23"
        },
        {
            "review_title": "wonderful movie!",
            "content": "I loved this movie! It's about time that movies start having good messages for children. This one did! I love Tim Allen, and Courtney Cox is wonderful too. If you don't like Tim Allen, then don't even bother, you won't like the film, like I won't go see any sort of Will Ferrell film...it's the same principle. If superhero movies aren't your bag, then don't bother either. But I love both and loved the movie. I went and saw this at a matinée and everyone there seemed to be enjoying themselves. True, you won't grow any brain cells, but since when did going to a simple movie have to be such a cerebral experience? Just sit back and enjoy yourself!",
            "review_date": "2006-08-14"
        },
        {
            "review_title": "What can I say, it sucked!",
            "content": "I seriously had a bad feeling when I hurried to get out of the video store that I had to do a wise pick on a kiddie like movie. I thought when I first rented this movie it would be pretty good and funny since Tim Allen was acting in it. But what can I say when I started watching it, it was to do with four kid super heroes and their leader Zoom from a comic book came to life in such a crude humoured film! I mean I need to say they introduced the characters like the four kids which was a little six year old girl who could lift up to ten pounds of weight, a fat chubby boy who can make his body go even fatter and bigger and can squash anyone in his way, a teenage girl who has the power to stare and control any like object or thing with her eyes and a boy who could turn invisible and use his mind to see things from a far distance. The only thing I liked about this movie was just about the end of the film, where there was quite a impressive battle with Jack's evil brother Conner and he finally showed off his zooming power to plan on making his brother part of his family again. But trust me I'll warn any viewer if you really want to see this movie you likely only need to see it once or even half of it since it's like the worst movie ever created in the history of the universe! Period!",
            "review_date": "2007-09-08"
        },
        {
            "review_title": "Even my 8-year-old was bored.",
            "content": "Zoom is dreck.Granted, it's a kids flick. But the classic kids flicks endure because of quality. There is no quality of any sort in this junk. Of course, when you go to a movie these days and see \"Revolution Studios\" before the credits, you know you're going to end up with brain-numbing rot. (The biggest mistake Sony Pictures ever made was funding Revolution. The best move Sony Pictures ever made was closing the Revolution doors -- so to speak.) Oh...and you know you're in real trouble when this appears in the opening credits: Songs by Smashmouth.Tim Allen, Courtney Cox, Chevy Chase, and poor Rip Torn...ugh. What in the world were they thinking? I know the first three aren't A-listers, but a seeing genuine talent like Torn wasted in slop such as this is depressing. \"Forty Shades of Blue\" one minute, \"Zoom\" the next. Oh well, it pays the bills, I suppose.And my, how Chase has fallen. Every now and then, a spark of his former talented self glimmers through, but mostly he's stuck doing embarrassing schtick. (One scene where his character is stuck in an \"outdoor simulator\" is just awful. He mugs and dances around like a second rate Rip Taylor...without the feminine traits, obviously.)",
            "review_date": "2006-08-12"
        },
        {
            "review_title": "It was alright, but Sky High was better.",
            "content": "I loved The Incredibles(2004),The Fantastic Four(2005), and Sky High(2005). But this movie does not quite match up to those movies. It had amazing effects, and funny performances by Tim Allen and Chevy Chase. I do give Courtney Cox effort for trying. But everything else about this movie is so bland and predicable. I didn't fell we got enough time to know the rest of the characters, they just get thrown in front of us, and that was it. And the movie to me felt like it was on a rushed schedule, like it was all thrown together in a month. There was not much to the story, it felt like a Sky High rip-off despite the fact it was a children's book years before Sky High. Anyway like SharkBoy and LavaGirl expect nothing more or less.",
            "review_date": "2006-08-16"
        },
        {
            "review_title": "I've seen better tampon commercials",
            "content": "Don't waste your time watching this.It's corrosive in every aspect - from the absolutely dreadful voice editing which does not in any respect match with the people's mouth movements to the story of nothing.There is no story here. i don't know where it went or if it ever was. What I see is a big commercial for Wendy's Restaurants and hamburgers.Senseless in so many ways. I would not subject my kids to see this. It's horrible and to have them waste their time on this would make me a very bad parent.There is no funny. There is nothing worth watching - and having the dreadful music play every few minutes just makes it even worse.A big budget flop. I'm sick of watching horrible movies when I realize how much money was invested in them.I expect watching horrible movies with next to no money or resources and I can appreciate those...however this mess was just lazy on all aspects.Film is supposed to be fun - and this isn't.",
            "review_date": "2013-02-04"
        },
        {
            "review_title": "Great Underrated Action/Comedy",
            "content": "No clue why there are so many negative reviews for this film. To put it simply, Zoom is fun and funny from beginning to end. Give it a chance!",
            "review_date": "2021-06-05"
        },
        {
            "review_title": "Great family film-another classic by Tim Allen",
            "content": "Ver good; the audience I was with loved it and applauded loudly when it was over. Lots of funny scenes-Courtney Cox was great as was Tim. If the producer's goal was to make a family movie that was funny and entertaining, he succeeded. Those that didn't like it must have gotten bad popcorn. We'll probably see it again in the theatre, and will certainly buy the DVD! Go see it and have fun. Plot is OK, though Kevin Zegers looked like he wasn't too thrilled to be in the movie. The kids in the movie were all well cast, and did a decent job in their roles. Music was great--they used some current hits to highlight certain scenes, and they worked great. Hope they do good at the box office and make a second one!",
            "review_date": "2006-08-13"
        },
        {
            "review_title": "For a movie called Zoom...",
            "content": "...it really takes it's time.I often hear from people things like, \"oh it's just a kid's movie. It doesn't have to be Citizen Kane! Lighten up!\" when talking about movies like this one. You know the type, they're made with a child audience in mind and since children are stupid then they don't need to put in much effort. So it's okay if the movie is slow, plodding and kinda boring so long as the kids laugh at the pratfalls.When did we get so dismissive of children's entertainment. Like it's okay to be stupid just because it's for kids. Why can't we expect something a little more clever? Or have the story layered. After all the parents are going to have to see this with their kids. Should they not also be entertained or is that asking too much?What we have here is a very paint by numbers story. Tim Allen plays \"Captain Zoom\". He was the leader of a superhero group called \"Zenith team\" but something happened, they all died except for him and he lost his powers in the process. He's now been called back into action to train a new generation of heroes. Cue the laugh track and he lame jokes because we're heading into sitcom territory. Then halfway through the young heroes suddenly discover new things about themselves and their powers. It's like pulling rabbits out of a hat. One of them literally discovers the one power that will help them defeat the baddie. What luck! This just comes out of the blue. A much better storyteller would have found a better way to brig this to light.This movie is bad. And I mean bad. It's boring, it's dull and it moves at a snail's pace. It's got a decent story and in the hands of a better director and writer it could have done much better. But they really dropped the ball on this and just went for the easy jokes and the utter coincidences that are the hallmark of bad and rushed writing.",
            "review_date": "2019-01-28"
        },
        {
            "review_title": "Tim Allen doing his witty sarcasm sans neighbour fast...",
            "content": "For a PG, made-for-kids hero-comedy, it sure has a lot of government secrets exposed! Between Area 51 and spying on us, the nods to WikiLeaks' is astounding!A has-been, Grumpy Old Man that used to be a superhero is rushed back into government hands to train the next batch of specials. He begrudgingly accepts and tries teaching them by being mean and curt. When he offends Brady Bunch's Cindy lookalike, he takes a leaf from To Sir, With Love and inspires a team.The foe is not a big plot carrot through the various musical montages, and surfaces near the film's end with a jolt. I was waiting for them to do a closing number routine montage by then!Quite some funny moments about bullying disguised as The Breakfast Club banter, and other moments of prat-falls! And instead of the eyes and forehead with hat of his neighbour, Tim seems to be rambling to us- into camera! He seems lost halfway through, like a badly rehearsed stand-up act, but luckily the Special Effects & CGI coast him through the third, and final act.It's questionable, after rewatching it today, whether it has aged well. Maybe it's a window of where we came from, or a warning when it was made. And maybe when I rewatch it in 10 years it'll have a different substory than today!An enjoyable romp if not looked at too deeply.",
            "review_date": "2022-04-29"
        },
        {
            "review_title": "Needed to be about the kids",
            "content": "Jack Shepard (Tim Allen) is disillusioned bitter former super-speed superhero and sole survivor Captain Zoom of Team Zenith. Dr. Grant (Chevy Chase) exposed the team to Gamma-13 which turned older brother Connor/Concussion to the dark side 30 years ago destroying the team. Now General Larraby (Rip Torn) in Area 52 and Grant bring back Jack with the help of psychologist Marsha Holloway (Courteney Cox) to train a new group of kids. Dylan West (Michael Cassidy) is a teen with invisibility and clairvoyance. Summer Jones (Kate Mara) has telekinetic powers and empathic senses. Tucker Williams (Spencer Breslin) can blow up parts of his body. Little Cindy Collins (Ryan Newman) has super strength.Tim Allen is too bitter and sarcastic. Chevy Chase is silly without being funny. He's just a pathetic shadow of his former self. The adults are the problem of this movie. This needs to be about the kids. The little girl is actually quite funny. The kids need more screen time to develop. This is simply a badly thought out comic book movie.",
            "review_date": "2014-07-24"
        },
        {
            "review_title": "Zoom:The Doc's Review",
            "content": "Zoom is horribly unfunny mostly thanks to Tim Allen and the very untalented cast minus Chevy Chase and Courtney Cox.The character Tucker is irritating throughout the whole movie but not as irritating as the corny one liners and jokes that stink like stale farts.Tim Allen is not funny and his movies minus Galaxy Quest have proved that time and again.I was very bored during Zoom and hated every minute of it.The film's dialogue is as corny and clichéd as the dialogue in Batman and Robin.The Incredibles,and Sky High are as good as Kill Bill when compared to the unbearably cheesy Zoom.Tim Allen has had bomb after bomb yet he's still making movies.Bring back Home Improvement and spare us from Zoom,The Shaggy Dog,and Joe Somebody.The only way Zoom could've been worse is if Bob Saget had a cameo.",
            "review_date": "2006-08-11"
        },
        {
            "review_title": "I liked Spy Kids, The Incredibles, and Sky High. But Zoom is none of the above.",
            "content": "At least Tim Allen was funnier in this movie, then he was in Christmas with the Kranks. But the movie its self doesn't have much going for it,but the special effects were alright but not spectacular, and everybody else in the movie is annoying instead of being funny. The story begins with a retired superhero named Captain Zoom, who is known as the fastest man on earth, is called back to help train a new group of young superheros. I wouldn't waste my money to see this again, I was expecting more and got less in return. The effects in Spy Kids and Sky High were 10 times better, at least the characters in those movies were more interesting. I rather watch Spy High again.",
            "review_date": "2006-09-10"
        },
        {
            "review_title": "Rhymes with Doom and Gloom...",
            "content": "Any film that starts with an elongated voice over giving the viewer the back-story has to be viewed with suspicion from the outset...or at least that is my experience. So the rot sets in early.So what do we get? A brainless load of rubbish. Cartoon characters in the truest sense of the word. Lack lustre juvenile love story sub-plot (yawn!). 6 year old effectively abandoned by her parents (charming!). Creepy bedroom scene -- 6 year old with non-relative in his 50s.Oh, and then, brother who killed Zoom's lover and best buds is forgiven in a trice. What shite!Hmnnn... Well, side stepping Tim Allen's dyed goatee (what price growing old gracefully), how Courtney Cox could have been so hard up as to appear in this pile is the true mystery of this non-com.Utter rubbish. A waste of 90mins of my life. 90mins too long.",
            "review_date": "2011-05-23"
        },
        {
            "review_title": "Chill... It's for Kids",
            "content": "If u hate it, it's cause it was made for kids I remember watching this as a kid and loving it except for the ENDING. It was like building and working hard for a very simple ending.And then I rewatched it as a 25 years old and it' sorr of aged well. It's your classic slapstick. If u want to randomly watch something nostalgic then go see this. Just remember, don't be too harsh about it. It wasn't made to be then's Avengers.",
            "review_date": "2021-10-04"
        },
        {
            "review_title": "Alright",
            "content": "The movie was alright. By any means, it wasn't bad but it wasn't the best movie ever either, it was mediocre. I thought the ending was pretty disappointing and seemed rushed and there were many opportunities to extend and develop the story line or a characters personality, that were not seen and therefor those opportunities were missed. Overall, the acting was very good and the cast were brilliant. The special effects weren't great but it was made a while ago now. It is not a movie I would rush to see again but it was passable and parts did make me chuckle!",
            "review_date": "2018-07-22"
        },
        {
            "review_title": "Unfairly Thrashed Movie",
            "content": "This is a movie that deserves more love. If anything, the acting was wonderful and I even enjoyed the plot. The movie had wonderfully done scenes in the movie and it even had a heartwarming ending. I'm pretty upset to see a lot of hate go into this movie. Zoom to watch it on TV when it comes and you'll learn how great of a movie it is. Trust me, this is a type of movie that you would want to see with your friends and family and don't forget to tell them some of your favorite parts of the movie. This was a movie that I had really enjoyed watching and if I happen to stumble upon something new with this movie whether it would be a great deal of merchandise, a reboot, or even better, a sequel, I cannot wait just to get or watch it. Definitely a great movie to watch whether you are bored and if you really want to watch a superhero or an action packed movie that will make you happy.",
            "review_date": "2016-01-23"
        },
        {
            "review_title": "Dismal",
            "content": "I like a superhero movie as much as the next person, but not when it is this bad. Zoom for me is a contender for the worst superhero movie ever. Peter Hewitt has done some good films, The Borrowers is delightful and Bill and Ted's Bogus Journey is one of the best sequels out there, but his direction here is very inept. Hewitt's direction is not the worst asset of Zoom though. The script is dire, while the juvenile humour gets embarrassing fast, the best it gets is the gag reel at the end and even that was lame. The story is lame and predictable, the action is special-effects driven mostly and it is badly done and the pace is rushed. The acting is simply terrible, Tim Allen is a talented actor but he goes through the motions, Courtney Cox is wasted and Chevvy Chase is simply embarrassing. All in all, just dismal and a chore to sit through. 1/10 Bethany Cox",
            "review_date": "2011-01-08"
        },
        {
            "review_title": "The old superhero trains new young superheros",
            "content": "I think that it did take the ideas from other superhero movies but it had a cool story and it was a really good kids movie. Who cares if they took ideas from other movies everyone is doing that kids are not going to notice. So yeah in other words just watch it and watch the kids laugh not all the movie had parts taken from other movies there were lots that are original. And the actors were really good at the parts they did. You need to think how hard it would be to make a superhero movie original because all the ideas were taken already. I always thought that all the movies combined into one would make a really cool movie. Now they have done that.",
            "review_date": "2007-02-11"
        },
        {
            "review_title": "\"Zoom\" isn't bad as long as you take it for what it is, a silly family superhero film.",
            "content": "\"Zoom\" is about a man named Jack Shepard (Tim Allen) who after a big government cover-up decided to quit being a superhero and live a normal life. But one day, Jack gets a visit from the government officials who he used to work for and they notify him that he has to come back to the private academy where he once worked. Without a choice, Jack is brought back to the private academy where he has been assigned to train a group of kids and turn them into the next generation of superheroes. Silly and fun moments ensue\u0085 When I read all the reviews for this film, I was very nervous heading into the theater. I thought oh boy this movie is going to be god-awful but to my surprise about ten minutes in, I had a big smile on my face and was rather amused by everything \"Zoom\" had to offer. I really don't see why anyone would literally mark this film off their list as a bad film. I can see how some can say it's an average film but nothing that warrants a one star review. Sure, \"Zoom\" is a lot like other superhero movies but it's supposed to be like that. And how often does Hollywood come up with a fresh idea, that's why independent films are they. This isn't supposed to be an original concept or idea. This is a movie that is meant to entertain and be fun for the entire family. I think \"Zoom\" does its job very well. Many say it's like \"Sky High\" which I don't agree with. It's different in its own way and I for one enjoyed watching it.\"Zoom\" was fairly innocent and used simple humor to make its audience laugh. It was more kiddy than most of the recent comic book films even the ones geared towards kids. However, I thought there was enough humor in the film for the adults as there was for the kids. Tim Allen did a great job with his sarcastic sense of humor and in all honesty this role reminded me a lot of his role in \"Galaxy Quest\" which is one of my favorite Tim Allen movies. Personally I really like Tim Allen and while many say he does bad movies, I don't think he does. He does family oriented movies which unless they are animated and are made by DreamWorks or Pixar get a bad wrap. I will say that \"The Shaggy Dog\" was Tim Allen's worst film and was bad but other than that I think he is good at being in family films. It was nice to see Chevy Chase pop up in \"Zoom.\" I really miss Chevy Chase being in movies because he really is a funny guy. Too bad he is too old to make another \"Vacation\" film. Chevy added some nice humor to the mix and really offset Tim Allen's sarcastic remarks. Also I thought all the kids in the film were great as well especially Ryan Newman who played Cindy. She was so adorable and funny. In fact, I think it's safe to say she stole every scene she was in. Good casting choices here for sure.\"Zoom\" was directed by Peter Hewitt, a man who seems to direct only family films. There was nothing spectacular about anything he did with this film nor was I expecting anything. He did a decent job with the film and I am happy with that. I like reading the reviews that say this movie was poorly shot, excuse me it's a family film who the hell is looking for unique camera angles and ways to capture the characters emotions. This isn't groundbreaking cinema; this is a simple and fun film.In the end, \"Zoom\" is a fun and silly family film with a great cast. If you don't go into it expecting much other than it being a family superhero movie you shouldn't be disappointed. I again think critics want too much from films like this. I took two of my little brothers with me to see this film and they both really enjoyed it. I know critics like to pick out things about movies but there are some movies which fail even at the simplest things like \"Date Movie\" all it had to do was be funny and it wasn't at all. This movie was supposed to be amusing and entertaining a goal which I feel it accomplished very well. I thought \"Zoom\" was a lot better than many led me to believe and I know when it arrives on DVD I will be sure to watch it again.MovieManMenzel's final rating for \"Zoom\" is a 7/10. If you take it for what it is, you will be able to enjoy it.",
            "review_date": "2006-08-20"
        },
        {
            "review_title": "Great family film",
            "content": "I had my doubt about Tim Allen in this one but he pulled it off,again. Now i can't wait for the Santa clause 3 to come out. the chemistry between Allen and the children was remarkable.Between the teen romance the plot,and the superpower plot and the fallen hero Concussion the movie has something for all ages. See this movie you'll love it it's classic Allen. That means always funny and lovable and sincere.Tim's classic humor shines in this film and will make you wan to get all seasons of home improvement on DVD.lol. The little girl and finally a good Courteney Cox Arquettecharactor on the big screen was most surprising of all. loved it!!!",
            "review_date": "2006-09-13"
        },
        {
            "review_title": "An Interesting movie that was surely pushed to an crappy end!",
            "content": "Zoom is another superhero flick for the family that stars Tim Allen ( I wonder what happen to him lately) as the once greatest superhero and team leader, \"Captain Zoom/Jack Sheppard\" who lead a group of heroes along with his brother \"Concussion\" who once affected by a powerful weapon known as, \"Gamma 13\" went rouge and took out some of the zoom team and left captain zoom without a brother throwing Jack into a state of melancholy as well as the real world forgetting his life as a once known superhero that comics were made of. Now called once again to bring forth a new team to combat the threat of an old team member gone powerful beyond his limits; Besides having a Marvel/DC'ish beginning that looked cool the rest of the movie wasn't all that polished to a perfect shine sadly.Obviously you can tell that Tim Allen's character was even though somewhat funny in some parts it felt like he was really stalling the time until the end. His witty banter and sarcastic way of things was just pressing the moments until his brother returns and even still it wasn't really good enough to hold this film in line; Now lets move to the story line...even though they did try to make a good story the scriptwriters somewhere along the way much like some superhero movies perform a rush job not giving good character arrangements as well as developments making most of the characters unknown in some areas...they never explain if their parents wanted them to join this \"Superhero academy\" nor you never see the emotional value of each of the characters just their enjoyment of being there; And if there was so much of a academy of heroes...how come you have to pick only four people I mean COME ON there's a classroom full of desks and only four heroes...I thought that was pretty lame not to mention pointless they could of added more people to the cause but then I had to realize its a family film not the X-men...but still it would be cool to have a REAL team not just 5 to 6 superhuman.Each of the characters powers was pretty cool you had, \"Mega boy/Tucker Williams\" (Spencer Breslin) who can expand in size which was awesome but the special effects sucked in that area. Next you have, \"Houdini/Dylan West\" (Michael Cassidy) who can become invisible but has another gift of foresight or whatever they called it, \"Wonder/Summer Jones\" (Kate Mara) is the very attractive girl that has telekinesis, and finally the ever so cute, \"Princess/Cindy Collins\" (Ryan Newman) as the super strong child in the ever so different costumes. I personally thought there could of been better super names for these characters but they choose the latter and plus princess was the one that stole the show with her ever so cuteness that makes you think of a power puff girl...I'm sorry all I could do was say, \"look at her she's soooo cuuuuuutee\" If ever there's a live action movie of the power puff girls (which I doubt) bring this little girl aboard. Even though all these powers fit into the academy there developments didn't; again due to bad script writing there were lack of developments in their personality the romance between Dylan and summer was rushed and I felt more could of been done to spice it up a bit but never was tried.The climax of the movie was even worse. I felt that there could of been a more better battle between the new zoom team and \"concussion\" (Kevin Zegers) but it was very short lived and the special effect was kind of bad and somewhat off in areas if looked closely; This movie is no \"Sky high\" at least there were more characters in that movie than just Four and I think that's the direction this director wanted to go but was afraid to push the boundaries and try not to compare it to Disney's version. But don't get me wrong this move had its fun moments and its pretty interesting if the script was re-done properly, Tim Allen had some funny moments that made me laugh but that was it...just funny moments; I honestly thought, \"Galaxy quest\" when seeing this movie cause he was pretty damn good in that movie I felt that the director didn't let Tim do is thing and be funny cause he is. Courtney Cox as, \"Dr. Marsha Holloway\" as the geeky doctor with a secret of her own was pretty funny and it would of worked between Tim and ms. Cox's characters but again never tried and it was rushed.All in all. With a cool comic book beginning, a somewhat story line, not much plot twist, Not so good special effects, short fight scenes, and a bad climatic battle this family movie really didn't live up I'm sure for the kids it might be pretty good and fun; but honestly I'm sure there good family heroes movies out there like, \"The incredibles\" but if you like this type of movie you have to be the judge and ask yourself if this movie is for you or not...this movie REALLY could of been good if it took its time before reaching theaters.At least Cindy is soooo cuuuuuteeee awwwww!",
            "review_date": "2007-05-07"
        },
        {
            "review_title": "A pleasant way to spend 90 minutes",
            "content": "A very pleasant children's movie, with roots from power rangers. This movie would have been miserable had it not been for the comedic talents of Tim Allen and Chevy Chase. But the two of them managed to pull a rating of six out of me with almost non-stop laughs. The action in this movie leaves something to be desired however. Go see it for the comedy, not the action. I will not give away the ending, but I will tell you that it is probably safe for you to walk out of the theater at about the 75m minute mark. After that the movie becomes even more predictable than it already was, and that is really not good. But once again the laughs save this movie from dismal failure.",
            "review_date": "2006-08-12"
        },
        {
            "review_title": "I liked it",
            "content": "I took my 7 year old son to see this movie and he laughed out loud several times and said he loved it. I caught myself laughing as well. The special effects were pretty good. The story line while simplistic for an adult was just right for my son. I thought Chevy Chase was under utilized as well as Rip Torn. Tim Allen is a funny guy, not a great actor. I will never see Courtney Cox in anything I don't like. As a straight geek, she is pretty good. In one of the gag clips, Tim Allen borrows a line from friends in which he says, \"Uh, I forgot what I am supposed to say. I'm so in love with Courtney.\" Well Tim, so am I. I would recommend this movie as good, light entertainment.",
            "review_date": "2006-08-12"
        },
        {
            "review_title": "Quite a Terrible Flick",
            "content": "So, we start off with a story about a guy who lost all his powers and lost his brother, but what? He lost his powers but yet his finger can vibrate? Also, at the very end, he gains his powers, why didn't he even think of using it before? He just magically gains his powers back? Then there comes the cast, \"Sir, I speak Greek not geek\", what kind of line is that? Now kids are gonna say \"geek\" to anything without even knowing the meaning.Well, let's get with the cast. The super heroes, or what will be the heroes. A 6 year old is the strongest girl, an ugly girl is a mind reader and can make things float and move, then comes a kid who is the fattest thing ever and can make any part of him go bigger (but the special effects are so bad that a one year old can tell its fake), and last there is a punk who's voice is deep and can turn invisible. Well, there it is. Only four? Is this the Fantastic Four with kids in it? Well, a \"villain\" named Concussion (what the hell of a name is that?) is on his way to destroying the planet even though he is already supposedly dead.So he appears and he looks terrible and sounds like a retard. I thought he would be a lot cooler than that, but no. So anyways, there is like a two minute battle, blah, blah, blah and the end. What? No sense of lines? Then he turns good, that is the worst twist I had ever seen in my life, I thought to myself. Well, that's basically it.I thought this movie might be good until the very end. It was a major disappointment. And this movie doesn't seem too suitable for kids for these reasons:They mention about the first Zenith team died. Concussion killed them, why? No answer, just saying he was evil. Do you want your kids watching about that? They don't even show their emotions other than Tim Allen's emo moment about the past. Then there goes with Tim Allen, his brother doesn't even look like him, in the pictures he looks younger than Concussion, but now he looks much older, like 50 and Concussion looks like he's 30.That is what I think about this movie.",
            "review_date": "2007-09-17"
        },
        {
            "review_title": "My grandkids enjoyed it.",
            "content": "I went into watching 'ZOOM' knowing that it probably isn't a very good movie. The story is pretty silly, and the premise has been done better in other similar movies - kids with various \"super hero\" traits going to a school to develop them. But the school is mainly a vehicle for a number of sight gags, many of which are entertaining, but do not form a cohesive story line.Tim Allen is the 'star' here, as Jack Shepard who once was 'Captain Zoom', but now he doesn't seem to think he can zoom around anymore. But his older brother has gone to the dark side as 'Concussion' and in a time capsulated state has not aged. So the thread of the story is preparation for the day and time that Concussion must be faced.The movie has a number of famous faces in it for decoration. Courteney Cox is Marsha Holloway, Chevy Chase the hapless Dr. Grant, Rip Torn as General Larraby, and Thomas F. Wilson of 'Biff' fame in 'Back to the Future' as a teacher.The cutest kid was 7-year old Ryan Newman (girl) as Cindy Collins, whose super hero name was 'Princess '. She has amazing strength, can hurl blocks weighing several tons as far as she wants. But she has the cutest smile I have ever seen.My granddaughter said she liked the movie, because it showed how teamwork can get things done.",
            "review_date": "2007-06-23"
        },
        {
            "review_title": "(whispers) zoom-zoom!!!!!",
            "content": "That's what the Mazda kid thinks of this wonderful family film!!!!! (BTW, what happened to him now?)Anyways, \"Zoom\" is a great film about a family of superheroes. It's no \"Incredibles,\" but at least this movie ranks close to another film - \"Sky High!!!!!\"I have to say, I liked this film very much. It has a feeling that just leaves me happy in my heart; there isn't much in the way of bad stuff, really. It's cute, full of action, and it will leave you wondering, \"How did those kid heroes do that?????\"I say, I recommend \"Zoom\" to my friends and their families; that's how much I really enjoyed this film. This is as good a masterpiece as \"Superman Returns!!!!!\"10 stars",
            "review_date": "2006-09-01"
        },
        {
            "review_title": "This is a nice movie",
            "content": "that it is a nice movie - the kind that makes you relax and smile. And for that along, it is worth to watching. The movie was made as a fairytale and should on my opinion be judged as such. We do not see a lot of films like that - films that we can enjoy without thinking about the complex relations between the characters and with out questionable ending .When this film ends you can know it is the end of it. In short the movie is simple but in a good way. I enjoyed it and I'm shore most of the people who enjoy reading comics books will.It is a film about super heroes kids. All of the characters are unique and special and funny. All the actors playing very funny and doing a lot of great mimic. The movie contains special effects are just enough to enjoy them. In short it is a nice movie, it is definitely stands out.",
            "review_date": "2007-01-11"
        },
        {
            "review_title": "Fun 80's like movie",
            "content": "I don't understand the Ridiculously bad reviews. My 11 yr old son loved this flick. I actually enjoyed it and the soundtrack. Loosen up people, it's not Citizen Kane but it deserves a better score. Courtney Cox as a clumsy dork was fun to see and Chevy Chase was his good ol self. This is a solid old fashioned kids film reminiscent of the 80's.",
            "review_date": "2020-05-16"
        },
        {
            "review_title": "Brilliant and severely underrated film",
            "content": "I watched this film first when I was about 9....so of course I found it awesome. I've loved this film since I was 9. It's cheesy, cute, funny, charming and consists of a cast which work so flawlessly together. This film truthfully and cheesily is kind of exactly what I want out of life...to have a group of friends that'll help you through anything and to be treasured for being different and to be able to use my differences to help people and save the world. This film is so cute seriously- \"faster than fast. Truer than true. In the pursuit of justice there is no speed limit.\" As a typical teenage girl....my favourite character would be Dylan and not just because he's cute but because his powers are so awesome as well as his attitude. His \"I don't care\" attitude which eventually grows into this cute team leader attitude where he'd do anything for zoom or summer or cindy or tucker.....it's just adorable. Truthfully I'm being quite general in this review as this film was a slight part of my childhood and I remember going to school and pretending to get a headache above my eyebrow and looking down hallways which were miles away from me....yeah I'm a dork. Truthfully I kind of refuse to point out the flaws in this film. (there is flaws....I'm not denying that) OK quick plot description- this film is based around 4 kids with extraordinary abilities- a 6 year old girl named Cindy who is insanely strong, a 12 year old guy named Tucker who has the strangest ability ever....he can exaggerate his body parts and make them grow huge at will, a 16 year old girl named Summer who is telekinetic and a 17 year old guy named Dylan with the ability to turn invisible and to see places and people in his mind without being there with them or being in that area and these four kids are lead by former superhero- \"Zoom\" or Jack as he now prefers to be called who is played by Tim Allen and at first he seems all washed up and useless but gradually turns out to be a father figure to these kids. OK they become a superhero team who fight against a villain named Concussion...I'm going to leave it at that because the endings the best bit and I don't want to give away the twists too.OK here's the gist- this film is awesome! It's probably the perfect kid's superhero movie and I still love it as much as I did about 7 years ago. To me though...this film represents the idea that differences are what make us amazing. This is a feel-good movie based around real themes, great music, a great cast, stunning visual effects and a group chemistry which is undeniable. Watch it.",
            "review_date": "2013-08-15"
        },
        {
            "review_title": "It's Horrible!!!",
            "content": "There was a large plot hole, when Zoom breaks the kids out of their rooms to protect them from being radiated with Gamma 13. He tells them to stay out of sight. The next time we see the group they have been caught in the conference room. Yeah! I go hang out in the conference room when told by an adult to stay out of sight. This is just the tip of the iceberg. The kids and Miss Cox acting was very fake. Cox seemed to be like plastic. The dumb superpowers they gave these kids the military would be better off without them. Tucker was the worse a boy who is fat and could make himself fatter??? Very insulting. This was a knock off of Skyhigh but it came out over a year later. And even Skyhigh didn't do too well. I also see elements of X-Men, Fantastic 4, and Men in Black. Several scenes seemed to have no point other than slapstick comedy. The plot needed more depth.",
            "review_date": "2007-02-18"
        },
        {
            "review_title": "Important film",
            "content": "Zoom is one of the most beautifully acted films that I have seen in recent years. The Performances by Tim Allen and Courtney Cox are spectacular. While Cox plays the stand out role of a mother/wife, who has slowly and methodically grown distant and quite mad over the years of their marriage, I believe that Allen's performance is just as impressive and equally mad. In dealing with a wife who is as immature as his own children, Allen is reduced to dealing with her in extreme and embarrassing ways.The tension begins when Captain Zoom, played by Allen brings his co-workers back to his house in the morning after a long night shift, which probably was not the smartest idea because he had broken a long standing date with his wife the previous night. I suppose he brought them back for his own protection, thinking that maybe the presence of other might help to suppress an incident with his wife. Her bazaar awkward interactions build until Captain Zoom has to yell at Marsha (Cox). From there it only gets worse. Marsha's fickle and fragile mental state makes for a strange situation for her children. After practically kicking them out of the house in the morning, a few minutes later, she is begging for their presence once again. She waits in frantic anticipation for the bus to arrive and collects her children at the foot of the bus like a mother has not seen her kids for years. The way in which she acts towards the father of her children's play date is that of a twelve year old. The father does not seem comfortable at with leaving his children with a woman who he thought to be drunk, but later finds out just to be mad. After he tells her so, her demeanor immediately changes once again and she has a look of shame, like a child who has just been scorned by a disappointed parent. Allen arrives in a fit of rage that seems a bit over the top. He strikes her and it is in this scene that one realizes the exhausting effects that his wife's strange behavior has on him. It drives him to lash out and act in equally irrational ways. His patience is constantly being tested.This is a common theme throughout the movie. It seems that every family member seems to have the right idea of how to fix this family and is not afraid to voice their opinion. Captain Zoom's mother is one such character. One of the final scenes is when the family is gathered around the dinner table after Marsha's return from the hospital. Captain Zoom's mother and other family members refuse to accept Marsha's request to be alone with her immediate family thinking that the best thing for her is to have people around. This ends badly and Marsha is almost forced into a type of relapse. Captain Zoom is constantly trying to keep a dictatorial control over his family no matter what the cost - understandably so, as he has been pushed to this point psychologically and physically as he strikes Marsha into sanity once again.The movie is a strange demonstration of family life. I think it's extremes are meant to display that all families have their problems and deal with them under their own circumstances. Is it right for others to intervene? Who makes that decision? The voyeuristic quality in which the film was shot also incites a feeling of guilt in the audience for witnessing such atrocities and also instills a feeling that they are a present member of the family and a first hand witness to the troubles that they are experiencing. The movie was enrapturing from beginning to end.",
            "review_date": "2006-09-01"
        },
        {
            "review_title": "Don't watch this.",
            "content": "Kids movies are declining in quality over the years, \"excluding Pixar and maybe Dreamworks\" and this rings ever so true in Zoom: Academy for Superheroes.Searching the IMDb user reviews about this movie i was shocked to see such quotes as 'Great Movie' or 'Best Kids Movie EVER!' or even a worrying 'Best Film of 2006'.If you have gone to see the movie without a child by your side, then you will be horribly disappointed by what this movie has to offer.Key points such as the 'revival' of Chevy Chase and others are put down early in the film when you find that they are hamming through the worst dialog ever, eg. \"I speak Greek, not Geek\" etc. etc, Enough to make kids the world over roll their eyes knowingly.The fact that it has a short cinema life probably contributed to the overall quality of life.Has your child had an IQ test? If so, children above the 110 mark will have trouble being entertained by the lousy performances of the actors. We all know Tim Allen's been a bit off lately, but this takes the cake.So, others may say that the acting was 'forgivable' and that critic's harsh reviews were only so because they were taking the movie seriously. Hmm. I think those that were prepared to give the movie a 'Perfect' 10 stars have an insanely different viewpoint to life. Any score under six would be a rational average for mentally stable people. Should come with label saying -do not buy-.Summing up Zoom: -Bad acting and bland story, kids may like it if not put off, but you'll be snoozing in your seat.",
            "review_date": "2007-08-05"
        },
        {
            "review_title": "A Feel Good Family Movie",
            "content": "Hadn't heard anything about this movie, so accidentally came to watch.Really glad I did, it's a really nice family movie, enjoyed the fun.So no complaints from me, it's worthy of a watch.Also, sure these characters and the concepts could be expanded, taking it further focusing on the typical save the planet type of adventures, but with the core idea to stay family focused and most of all fun!",
            "review_date": "2020-11-14"
        },
        {
            "review_title": "Zoom Away From This Film.",
            "content": "Zoom (2006): Dir: Peter Hewitt / Cast: Tim Allen, Courteney Cox, Spencer Breslin, Chevy Chase, Kate Mara: About as exciting as slamming your hand in a car door. In a film that manages to be even worse than Sky High, Tim Allen plays retired superhero Captain Zoom who must whip into shape a bunch of misfit kids with super powers to fight his arch enemy brother. I've had diarrhea spells that were more fetching than the special effects created here. Directed by Peter Hewitt who also made the mediocre Bill and Ted's Bogus Journey, which at least had the decency to have good special effects. This film looks like a really bad chemistry experiment. Tim Allen survives the nightmare only due to background superpower incident and the task before him. Otherwise the screenplay would make better toilet paper. Courteney Cox plays a lab coat female obsessed with comic books. She should be obsessed with finding a better agent. Chevy Chase reminds us that he was funny in the 1980's but here as the bumbling scientist clearly the joke is on him. Spencer Breslin has been featured in several films with Allen including The Santa Clause 2 and The Shaggy Dog. Here he plays a kid who can oversize his body parts. Kate Mara plays a girl with telekinesis that is not half as interesting as Carrie White. That sounds wrong on so many levels. Frankly someone should zoom over this film with a tractor trailer. Score: ½ / 10",
            "review_date": "2015-09-01"
        },
        {
            "review_title": "Believe it or not, worse than Doogal",
            "content": "Well, August is usually when studios haul out the trash, and this movie certainly qualifies as such. Cheap-looking effects (possibly generated on a Pentium 1 computer) bad script, bad acting. Tim Allen shows all the warmth and charm of an ex-con making his weekly visit to the parole office. Nobody is enjoying themselves here; even Chevy Chase seems embarrassed. Consider that. How rotten does a movie have to be for Chevy Chase to be wondering: Is this worth a paycheck?Maybe everyone was upset by the glaring continuity problems. The rubber band baseball sequence, for instance, seems out of place and makes very little sense. Then there's Allen, who appears hostile to the kids in one scene, their best friend in another, then hostile again. Apparently he can't make up his mind. Near the end of the movie, he leaves the four kids safely hidden from the evil military men, yet in the next scene the kids are back in captivity without explanation. Did he turn them in? Does anyone really care?This is a very white movie. Very very white. I think Tim Allen even makes this comment at one point. There are no characters of color to be seen other then the wannabe heroes at the beginning who hit the reject pile. Personally, I think the kid with the giant snot balls would have been at least as useful as the one the military ultimately chooses (his special ability is the inflation of body parts) but what can you do.If your children, six or under, have absolutely nothing else more entertaining to do this week, like getting booster shots, you might want to take them to Zoom and kill half an afternoon. Or not. It's hard to decide how much would be too much to pay in order to see this movie. Maybe if you found one of those dollar bargain theaters. Or maybe not.One can only hope there isn't a Zoom 2 in the works.",
            "review_date": "2006-08-22"
        },
        {
            "review_title": "Uhh...",
            "content": "The only reason that I watched \"Zoom\" was because:1.) There was nothing on TV and 2.) I was curious on HOW bad it was reviewed.And not kidding.Maybe because it was probably designed for younger kids...? Who knows, but all I know is that I could get the feeling out of my head that day: the feeling of humor-disgust. Tim Allen is Zoom, the superhero has-been who recruits four very different kids.First is the adorable little Cindy, the strong little princess with super strength. But adding little pink tutus and blond curls didn't give the character a unique look like Kojack with candy.Next is a teenage boy who, in the trailer, decides to render himself invisible -- in the middle of class. Um, hello? And the guy's got a thing for the next character.Superhero #3 is a girl named Summer, who can movie things with her mind, which is cool, even when it was abused in this movie. Abused to throwing school food in the faces of cheerleaders in the the trailer. Girl has small thing for guy, which guy has a bigger thing for her.Perhaps the most interesting character must be the fat boy, who can make himself even fatter when expanding any part of his body (from butt to first you name it) It's really annoying with the fact that he focuses on food than training.)\"Zoom\" is not the best movie in the world, but maybe for children who still pin their blankets around their necks and pretend that they can fly. Either way, this movie was a wreck.",
            "review_date": "2008-03-28"
        },
        {
            "review_title": "All that is Evil in the World",
            "content": "I watched this movie 3 years ago when I had literally no standards for a movie, and yet it still pained me. It's genuinely one of the most painful movies to watch. None of the jokes were funny and none of the plot was interesting.",
            "review_date": "2019-07-29"
        },
        {
            "review_title": "It's a good movie for TV not for theaters",
            "content": "Overall I can say this movie is not the best superhero movie out there but it is fun, when I saw it it was on TV and I liked it. I think as a movie it didn't do very well, but as a TV movie it deserves a rating a little higher than 4.3. Overall I think this movie should have at least a 5.6 if the CGI wasn't the best but we're only 6 years into the new century so I think this movie ages well to this day as a familiar sight of Occasionally. To laugh and when there is nothing to see on television or in the movies, as for the characters, if something is wrong that they do not explore their origin a lot, but in general they are good guys and good actors, as for the villain yes It only appears for 15 minutes but it is because the film needed to focus on the formation of the boys and on the emotional overcoming of the protagonist, in my opinion this film is more a film for TV than for theaters, in general I consider it a good film .",
            "review_date": "2022-08-30"
        },
        {
            "review_title": "The film for Sky High dropouts",
            "content": "This move can only have been a product of laziness. The plot is a pastiche of clichés, which is bad enough, but the script writing doesn't even try to develop any of them into a coherent storyline. We have a group of kids, who are \"outcasts\", \"weird\", etc. who must learn to work as a team. Oh, and they have super powers. And they will be lead by a washed up former super hero who's lost his powers and is disillusioned and bitter. But somehow, they'll bring it all together and vanquish the villain. Any of this sound familiar? A collection of tired plot devices can be made fresh with good writing, but it's not in this movie. Stale story and flat writing can be compensated for by good direction, but not in this movie. Sometimes it's worth it to see talented actors doing their best with little to work with, but not in - you see where I'm going with this? The cast is a group of talented people whose talents are never called upon. If you have small children and a slow afternoon, it's worth a rental. But not more than a $2.50 rental. Any more, and you're wasting your money.",
            "review_date": "2007-05-15"
        },
        {
            "review_title": "Awful.",
            "content": "From the back-story explained at the very beginning of the film, you could tell right away \"this is going to be painful.\" Awful, awful film. This was definitely directed towards children, but I don't know what parent would sit through this with their child. The dialogue was awful. The story was unimaginative. It seems that this was supposed to be a comedy, but I had trouble telling. It was... ugh, there's no word to describe it. It's sad, really. I laughed a few times, I'll admit. Well, at the film itsself, not any of the jokes in it. The film itself was a joke. I can't even begin to describe it. I think my brain erased the majority of it from my memory. Avoid this \"movie\".",
            "review_date": "2008-03-25"
        },
        {
            "review_title": "Too Much Like \"Sky High\"",
            "content": "This studio needs to admit it. They got this idea from Disney's \"Sky High\" with Kurt Russell. They had to have done so, because the premise of the two movies is almost entirely the same. The only difference is Tim Allen tried to star in this version and Kurt Russell tries to star in \"Sky High.\" After watching this film (and it was painstakingly hard), I tried to remember why I watched it. I don't regret that I did. But it is an hour and a half I can't get back.Rip Torn playing the general was probably the best part of this movie, and thats not saying much. Courteney Cox part in this movie made her into a real geeky girl who is infatuated with Allen's character.After much consideration, I had to give this film a 4.",
            "review_date": "2008-02-23"
        },
        {
            "review_title": "This likable family film suffers from cheese-whiz script.",
            "content": "Jack Shepard (Tim Allen) is living ordinary life, which he's trying to forgot his past as a superhero. Because of that, he lost his brother (Kevin Zegers) that turned evil and his team. Now his evil brother is coming back to the real world, after being in the vortex for a couple of decades. Jack lost most of his powers. But he doesn't know that his brother is still alive. Jack is forced to train four kids (Kate Mera, Michael Cassidy, Spencer Breslin and Ryan Newman) to understand their powers and to used them well for the military. Jack is getting help from two scientists to help these kids, a clumsy woman (Courtney Cox) and a clueless doctor (Chevy Chase). Which Larraby (Rip Torn) is trying to convince Jack and the two scientists to make these gifted kids using Gamma 13. Which makes the kids stronger in different ways but also has it's side effects. Which is the reason why Jack is there to train these kids to understand their powers before the Military are forced them to take it for the upcoming threat.Directed by Peter Hewitt (Bill and Ted's Bonus Journey, Garfield:The Movie, Tom and Huck) made an watchable adventure/fantasy kid movie that is completely forgettable but it has some fun moments here and there but again not enough. This movie suffers from a bad cheesy script, which it's extremely obvious. Also it is a bit familiar to \"Sky High\", which it was enjoyable to watch. Allen tries his best with the film and he brings a few laughs. The kids are fun in this. But the supporting cast like Cox, Chase, Torn and Zegers are completely wasted in this movie. It felt bad watching them in this movie, especially Chase. Which Chase only has one big laugh in the film, where the kids are torturing him.DVD has an sharp anamorphic Widescreen (1.85:1) transfer and an good Dolby Digital 5.1 Surround Sound. DVD has four public announcements, a making of a features and previews. This is one of the reasons why the film was a flop, due of the terrible screenplay and the supporting cast (aside from the kids) are terrible in the movie. Which this is based on a graphic kids novel \"Zoom's Academy\" by Jason Lethcoe. Which i heard, it barely or nothing true to Lethcoe's novel. Allen's fans might fun watching this. Although it wasn't a good year for Allen, which he was in two other Box Office Disappointments like \"The Shaggy Dog\" and \"The Santa Clause 3:The Escape Clause\". Which oddly enough cast-member:Breslin was in these two other movies as well. Kids will probably enjoy this more than the parents. Screenplay by Adam Rifkin (Mousehunt, Small Soldiers, Underdog) and David Berenbaum (Elf, The Haunted Mansion, The Spiderwick Chronicles). From a screen story by Rifkin. (***/*****).",
            "review_date": "2007-10-19"
        },
        {
            "review_title": "Watch with caution",
            "content": "My boyfriend and I went to watch this movie because it was free and we figured it would be a mildly entertaining waste of 90 minutes...and that's exactly what we were in for.It COULD have been a promising movie...well maybe not \"promising\", but decent. Yes, let's say decent. Unfortunately the whole movie was nothing but average. Now, there were parts that were laugh-out-loud funny, but they were VERY few and far between. Mostly you had dialogue that no one cared about, kids that filled specific \"quotas\", and a nonexistent plot.Let me explain. Any CHILD that was taken to watch this could even tell that none of the adults were in this because they cared. It was one of two reasons, either so that they could show a movie that they were in to their young children who weren't old enough to see mommy and daddy (or grandpa) in anything else OR because they couldn't find any other work, but had a big enough name to MAYBE draw moviegoers (*cough cough* Chevy Chase *cough*). And the younger actors were only in it for exposure. There can be no way that any of the four besides Spencer Breslin will look back on this as one of the highlights of their career. --And one more thing. I do believe, nowadays Tim Allen can't make a movie WITHOUT Spencer Breslin. Which has to have contributed in part to his downfall, considering how unspectacular Spencer has been up to now (enough with the overacting please!). Anyway... Oh, and as for Kevin Zegers, BOTH my boyfriend and I walked out of that movie saying that he HAD to have owed someone a favor, because that is the ONLY reason that I can see that he needed to do that movie. The boy did NOT need the exposure and he certainly has no young'n's to impress. And really with his part being how it was, they could have cast any old early twenties, pretty boy. I mean really Kevin did fine with what he had, but he didn't have much. (Run boy! Run!)But truthfully, I can't blame the actors for not caring with dialogue such as (*spoiler*), \"Must save Connor!\" (which was truly laughable...and not because it was supposed to be funny), who would?And the plot? Wait, what? There was a plot? Oh, I thought this was just a Tim Allen promo. But seriously, the plot goes like this (possible *spoilers*): Once upon a time there were these superheroes, one goes bad and kills all but his brother and gets sent to another dimension because of it. Years later, he's coming back and is a threat to \"all of the world\" and so they must take a group of misfit \"superhero-etts\" and make them \"good\" enough to defeat him. And to do this they recruit the brother who is now old, worn out, and very reluctant. Hardship and sarcasm ensues.And dear lord is the ending battle just perplexingly short. It makes it seem as if the whole time, the kids weren't needed and this \"horribly bad guy\" is just a little puppy that needs a hug. *shrug*So really, not very good, though not the worst I've seen. There were a small handful of redeemingly funny bits, such as (*spoiler*) little Cindy in a bunny suit. No one (including my boyfriend) can deny that THAT was freakin' cute.All in all, watch it if you wish, just know what you are getting yourself into.",
            "review_date": "2006-12-03"
        },
        {
            "review_title": "It's a kids movie, what do you expect!!",
            "content": "I had to review this just because its been given such a low rating by most of the other users on this site.This is a decent, fun kids movie, if you have young kids I'm sure this would be great to watch with them on DVD.Tim Allen is a funny,likable guy, he plays his character like he does in all his other movies, so if your a Tim Allen fan, you shouldn't hate this movie.Chevy Chase, is pretty much what you'd expect, funny guy, OK so it's by far and away not his best movie, but he's just playing the clown in a kids movie, and he plays that part fine.The story is not disagreeable, if your a kid you'll probably like it. Another reviewer said that it would go down as one of the terrible movies of our time, like Howard the Duck, well I remember watching Howard the Duck on video when I was a kid, and I loved it! If I had watched this when I was a kid I would probably have loved this too.So credit to the writers and all involved for making a GOOD/fun kids movie. (I was going to say a GREAT/fun kids movie, then realized that this is NOT a GREAT kids movie, that would be going into the realms of the Goonies etc, but this movie is definitely worthy of pass marks)",
            "review_date": "2011-05-14"
        },
        {
            "review_title": "Good and bad at the same time",
            "content": "I like the idea behind the movie Zoom. Zoom (Tim Allen) is a has been superhero who finds himself forcefully recruited into the organization he left many years ago. A group of young new heroes has also been recruited and it is Zooms responsibility along with Dr. Halloway (Courtney Cox) to prepare them to face an impending evil. After a reminder of the deaths of his own team Zoom bonds with the kids in time to save them from a forced experiment by the military man in charge (Rip Torn)to kick start their powers into high gear. Eventually the kids and Zoom are forced to face off against Zooms brother who was turned evil by the same experiment the military wishes to use on the kids.This film has a lot of great elements. The kids are well written and actors did a good job. The idea that the greatest evil is created by a so called good guy experiment is a great idea. The story in essence is a great one as well. The big problem however is that most of this film was done poorly and included useless scenes that added nothing to the film.Instead of focusing on showing us essential plot movement and important character development we get many cheap jokes along with poor romance. So many supposedly funny moments were forced and came from no where. It was sad to see so much of this especially when there were great moments that had a natural flow from the story.I really wish the film had fallen into the hands of a different director and screen writer, we could have gotten a much better film.",
            "review_date": "2008-08-19"
        },
        {
            "review_title": "Not incredibles!",
            "content": "Jack Shepard (Tim Allen) is a former superhero who might have lost his powers and is now all washed up.He used to be Captain Zoom of Team Zenith. His older brother Connor became a villain which destroyed the team.General Larraby and Dr Grant seek out Jack to train a group of teenagers and young kids who have various superpowers.However Shepard is bitter about the way he was treated and is reluctant to teach the kids at first about harnessing their powers.However he soon realises the real reason he was called in for.This is a kids superhero adventure which sorely lacks fun and wit of The Incredibles. It is a boring dull film where nothing much happens. The story is flat and poorly written.The acting is off from Tim Allen and Chevy Chase seems to be only here for the pay cheque.",
            "review_date": "2019-07-26"
        },
        {
            "review_title": "Entertaining",
            "content": "If you like Galaxy Quest or Tim Allen humor in general, this film should entertain you. It's light and fun. Someone always dislikes offbeat films, but clearly more than enough did! This movie features kids with super powers that are forced into government training, under the reluctant direction of a grouchy Tim Allen (who once was \"the\" great superhero). Yes, think Galaxy Quest! In almost every film Tim Allen has ever made, he has a change of heart - is this one going to be different? The film is not intended to be serious. Still, it brings an interesting perspective to the down side of \"being different\". Common needs will help this very dysfunctional team bond. If you have a chance to read a spoiler - don't! An novel surprise you won't anticipate is near the end, which neatly wraps the entire movie's theme. I hope there is a sequel in the works...",
            "review_date": "2006-11-01"
        },
        {
            "review_title": "Galaxy Quest for kids",
            "content": "Tim Allen reprises his character from Galaxy Quest in this superhero romp targeted at kids.On the level it's pitched at I suppose it succeeds, but it takes a long time to get there. Allen brings nothing new to a role he has played before, and Courtney Cox doesn't do well as a clumsy lady scientist of the \"Take off your glasses - my God, you're beautiful!\" variety. Chevy Chase is, frankly, poor (as well as looking as if his face is about to burst) and Rip Torn as duplicitous paranoid army/government bigwig never gets the comeuppance he deserves. The kids aren't great either, although I am very taken by Kate Mara.The plot is implausible and mostly unexplained, although that doesn't matter too much. The effects are mostly fine, but too few and far between.What this film does is ultimately fine, but it takes far too long to do it and then, when it finally gets moving, it's all over before you know it.",
            "review_date": "2009-07-12"
        },
        {
            "review_title": "Terrible Rip Off Of Sky High",
            "content": "This movie is a rip off of Sky High which is awesome. The acting and story were absolutely terrible and I thought it was so cheesy. Sky High is way better than this piece of trash.",
            "review_date": "2019-03-06"
        },
        {
            "review_title": "It was okay",
            "content": "I'll admit, the acting could have been better. The movie could have been longer. The ending was a bit too fast. After 'Zoom' made the vortex and the main enemy turns 'normal', it's instant happy ever after. It would have been funny if Zoom tripped (like he did when he first started running) and ended up messing up the vortex, and then caused instant danger again. Perhaps his 'brother' could then have an ultimate fight. Then the filmmakers would have to choose who saves the day out of everyone, which could be tough. But it would have been funnier if the 'final plan' were to fail.I twas very funny throughout, though. Maybe because I'm a teenager and I find teenage humor, well funny! I'll admit the transition between the main character being against teaching the children and going forward with it was a bit dry and too fast. He should have had a more emotional and slower time changing, to show his hesitation.They did do somewhat well with the stereotypes. A typical lazy 17 year old guy, a very attractive young lady, an overweight kid, and a small girl. I think they could have done better. The lazy 17 year old guy was okay, but a more common stereotype is a geek. A 13 year old guy who is obsessed with video games and/or computers. The girl was a bit too 'normal', based on what the movie was explaining. She was being picked on, but that's normal. She wasn't mental, she wasn't a nerd and she wasn't blond.The fat kid was okay, since we all know that young boys are fat, or at least that's what the movie wants us to think. The girl was just a normal small girl who had an ordinary life. Unless this whole time their 'problems' were their powers, then I suppose it's okay.Overall, the movie was great. I just think they took the story too fast.",
            "review_date": "2010-06-20"
        },
        {
            "review_title": "Goofy dumb fun",
            "content": "I went with fairly low expectations, and ended up laughing loud and hard in many places. Go, have fun, be 12 and take a few friends who loved 1960's comics as much as you do.Yes, there were some plot holes, but Rip Torn is dour and funny, the little girl with the super- strength is very cute (gotta love that juxtaposition!), the bits with the flying saucer made us laugh out loud, and Courtney Cox has too much fun playing the ultimate comic book nerd. Tim Allen does his usual shtick, and the rest of the cast holds up their end.Don't pay full price - but for a hot afternoon it's fun for a matinée.",
            "review_date": "2006-08-13"
        },
        {
            "review_title": "I have to be honest...",
            "content": "...I truly hated this movie. Zoom was a terrible movie, at the very least - the plot was unoriginal, the acting was blatantly dull and the biggest fact drove me up the wall the most of the time - kids were running the show. I'm not a big fan of Tim Allen, I've barely seen Home Improvement, I barely watch any of his movies, I don't like him at all, in fact, but when I watched this movie, there were a few jokes I found funny, a few jokes or quips he retorted that I found amusing. But that's Tim Allen. The kids, on the other hand, they were unbearable.The Invisible Boy was by all means annoying and inconsiderate, and he frequently make me bonkers and as I tried to find my way around the story's incredibly boring plot, he made it worst. The young strong girl - ugh, I hated her character. She was bratty, spoiled and inconceivable. It looked like she made friends through fear by using her strength rather than be less of a burden. Though, that's me.The place was terribly designed - the special effects pretty good, in fact, meaning it was a simple waste of some good special effects, but overall, it never was placed together.Movies are made to entertain people or tell stories - this movie was made to entertain, but it clearly could not with such a simple storyline (which if you watch it, you'll see how simple it is, as it is explained in the first two minutes of the movie, and there's no change to it at all), characters jumping to nearly unnatural leaps of logic and bratty children with incredible powers, some of them abusing it. It didn't like a single part of this movie - I hated the directions, I hated the children, and I hated storyline. The only reason why I went to watch it was because a friend of my was in it. I'm assuming the situation might or might not be the same for you, but overall, don't watch it.That's my advice.",
            "review_date": "2006-08-12"
        },
        {
            "review_title": "Cox, Chase and Allen make you laugh in a contrived flick",
            "content": "'Zoom' starts off on a promising note. I had the impression that it would be a comic-book spoof comedy but it pretty much turns out to be just another generic kid's sci-fi flick. It's not as terrible as many have made it out to be. For a children's movie, it's quite okay. The biggest flaw lies in the writing. The contrived script is repetitive and filled with plot holes. The characters lack development. Given the concept, this could have been something highly entertaining for adults and children. The special effects are quite poor. The pacing is also poorly maintained. Much of the humour is very effective thanks to Tim Allen, Courteney Cox and Chevy Chase. Allen is brilliant as the washed-up aged superhero who's forced to train four kids to use their power appropriately. Cox is a natural performer when it comes to comedy and she is fantastic as the ditzy, nerdy, enthusiastic do-gooder psychologist. Chevy Chase is hilarious, especially in the scenes where he's bullied by the kids. The rest of the cast is passable. Overall, it is these three actors who kept me laughing throughout this very mediocre-at-best flick.",
            "review_date": "2011-06-17"
        },
        {
            "review_title": "Fantastic Four if they were real? Maybe...",
            "content": "Tim Allen as Jack Shepard **aka** ZOOM.... a spent hero, bitter at US Govt and life in general was very realistic - it is also the fittest I have ever seen him in a while! The shocker was Chevy Chase! I hope it was make-up to get him to look so decrepit! When I saw the protagonist of Caddyshack and Fletch being such a fall-guy? I nearly wept! The children to be trained in a little over a week was a bit thin but typical as Hollywood plots go, especially the fact the team started to coalesce in the last 2 days before the onslaught of Concussion (Zoom's now evil brother thanks to ye olde US Army's mega Gamma 13 treatments)! Six yr old Cindy Collins **aka** Princess, of course, was the underhanded powerhouse literally! Heaving 2.5 tonne blocks in a fit of rage at no costume nor name! Very underplayed yet brimming with potential was Michael Cassidy as Houdini, an invisible far seer who eventually becomes the group's leader.Kevin Zegers handling the role of Conor Shepard/Concussion has a very striking appearance, I do recall him vaguely from some episodes of Felicity (not a big fan of that, by far)...Rip Torn plays Rip Torn, very much the same as his role in MIB, MIIB, etc. Mega Boy is just an older version of himself from The Kid with Bruce Willis; the psychokinetic gal was okay just not too memorable...The best thing for me was the illustrations and told a better story - maybe Hollywood will one day be brave enough to do a comic book movie as just page by page with voices - it may be the best telling yet! Like the old days when you turned the page with the 45 or LP on the PING! http://bajanreporter.blogspot.com/",
            "review_date": "2007-04-11"
        },
        {
            "review_title": "An Adequate, But Uneven Young Adult Comedy",
            "content": "20 August 2006. Tim Allen arrives once again with having to regroup from his eventual character's demise as he did in Galaxy Quest (1999) but this time he is much more in a deep funk than his previous role where he portrayed a much more overly-confident character. Unfortunately, the script lets many of the characters down this time around, especially, Chevy Chase who is unable to overcome the flat lines he's forced to say or else he just didn't have the spontaneous spark anymore. The plot overall and the character development for Tim Allen actually is relatively strong and meaningful, yet the balance between childish comedy and actually funny humor is blurred. While this movie is entertaining, it's also somewhat disappointing because in more capable hands, it could have been much better. Five out of Ten Stars.",
            "review_date": "2019-01-22"
        },
        {
            "review_title": "Low expectations yield high returns",
            "content": "I have just viewed this film for the first time. I made the mistake of avoiding it in the past because of the low rating by IMDb members. It certainly does not rate a \"10\" but \"1\" is just as ludicrous. For fans of the superhero/fantasy genre, this film is entertaining. Lots of good special effects and lots of fun. Sure, there are clichés, but then that is generally expected in this genre. Perhaps I enjoyed it more because the \"3\" rating on IMDb caused me to have such low expectations. It is clearly a better film than the rating implies, and nearly 2000 IMDb members have done a disservice with their votes of 10 or 1. It's not quite up to \"Sky High\" but it was a lot of fun.",
            "review_date": "2007-10-26"
        },
        {
            "review_title": "This movie is completely fake on every level!",
            "content": "You can see the boom mic several times throughout the movie. The little girl with a fake speech impediment is wearing a wig. The boy is wearing a fat suit. People don't behave or talk this way, even in a family film. Check out the directors other flops for hack verification...",
            "review_date": "2020-06-13"
        },
        {
            "review_title": "Keeping Up With The Joneses",
            "content": "Let me start by saying I do not hate this film. I found it rather enjoyable, but I do see the problems.This film was Columbia's answer to Buena Vista's mildly popular Sky High starring Kurt Russell, featuring two super heroes who married and their son who attended a high school for budding young super heroes and the subsequent ensuing events.While this takes place in a government installation rather than a high school and is more effects and story driven than Sky High, the entertainment value suffers for lack of something Sky High exhibited full out: Heart.I was happy to see Chevy Chase on the big screen again, and I enjoyed the effects driven crescendo; however, there was little life to this work and even less to draw adult viewers, though the children will (no doubt) find it fun.The child performers give great performances, and even Tim Allen seems involved in his role this time; however, even as far as comic book movies are concerned, this storyline was permeated with cliché and insulting female leads (Courtney Cox who couldn't keep from literally tripping over herself in the presence of Tim Allen) and typical male macho idiots (Tim Allen's character was so utterly cliché as to render his performance nigh unwatchable).All in all? It is enjoyable to a point and has some great eye candy towards the end, but the film itself is lacking in relationship to its audience. It's mildly entertaining in spite of the great independent elements it contains. You would think the sum total would be more enjoyable.It rates a 4.8/10 from...the Fiend :.",
            "review_date": "2007-09-20"
        },
        {
            "review_title": "Pretty good",
            "content": "At first, this didn't seem much like a movie to be taken seriously. Of course, the \"auditions\" were quite funny and disgusting.Tim Allen came across as a grumpier Tim Taylor/Mike Baxter. A great line to illustrate his attitude: \"Why is the green dress talking?\" I liked the way he resisted trying to be helpful until he finally realized how important it was.I liked Summer and Cindy. Summer looked good and had just enough attitude. Cindy was so cute, complete with a lisp.And Marsha was adorable and gorgeous. Jack thought she looked better without glasses? I thought she looked pretty good with them. But the clumsy routine didn't work so well for me. That's just not how I think of Courteney Cox, and the day before I saw this, there was another pretty but clumsy female scientist who was even less suited to such a role.And Chevy Chase ... can anyone take him seriously? I have this memory of his being associated with quality. \"Caddyshack\" and \"Foul Play\" at the very least. What happened to him? But he's still entertaining in his own way.Rip Torn is an actor known for quality, and at least considering the material he seemed to be convincing, but I still have to wonder why this?But the movie changes about halfway through. It is a worthwhile experience, a real comedy/adventure with the emphasis on adventure, and seems like a quality production. Except now Chevy Chase becomes even more of a liability.Then the prom happens, and we're back to square one. The final scenes are pretty amazing, though, especially the visual effects.It's a kids' movie, but that doesn't excuse lack of attention to quality. And it was there, just not all the way through.But I'm about Jack's age, and I enjoyed it enough.",
            "review_date": "2012-08-01"
        },
        {
            "review_title": "Three Stars Mainly For Smash Mouth And Princess",
            "content": "Everything else about this film stinks. Tim Allen is known to be a comedian, but 2006 was not a good year, as this and his two other films for that year were not well received. This film, based on a book series, is nothing more than an attempt to cash in on the rise of superhero films. Tim's jokes in this are not funny, the story is slow to get to, and some of the CGI is bad. The only good things is the character of Princess being cute and Smash Mouth being part of the soundtrack.",
            "review_date": "2020-01-20"
        },
        {
            "review_title": "Truly fun for the entire family!",
            "content": "This movie is hilarious! My husband, teenage son and I truly loved it! We can't wait for the DVD to come out! It is truly an upbeat, fun movie for the entire family! I highly recommend for all to see! Tim Allen tops the amazing cast of talented and interesting young people and veterans alike (for example: Rip Torn!) This is one of those great movies that let you forget about everything outside the theater doors and just immerse yourself in it! I can't say enough about this film! Keep up the good work Tim and company!Zoom comes out of retirement and helps to create a new Zenith squad. He resists but then is won over by the cutest six year old in Hollywood! The action is wonderful! Never a dull moment! Make sure to eat your popcorn during the previews because you will want to sink yourself into this movie! Amazing twist at end, you have to see it! Enjoy! We sure did!",
            "review_date": "2006-08-24"
        },
        {
            "review_title": "There are not enough lovers",
            "content": "What is with people who hate movies like this? Well sure, I'm not gonna get the DVD, but still, there are not enough people who love this movie and it is not nearly enough to make up for all of these people who doesn't like a movie like this. Tim Allen: good. Viewers who don't like the awesome guy: bad. I'm not okay with people bashing this kind of stuff. And about the 100 worst films list. Leave the films that go on to that dumb list for the truly bad films. Hello? Movies way worse than this aren't even on it! Killer Shrews, Attack of the Giant Leaches, and not even The Dead Talk Back! Ridiculous.Zoom: *** out of **** Killer Shrews: negative**** out of **** Attack of the Giant Leaches: No stars out of **** The Dead Talk Back: 1/2 star out of ****",
            "review_date": "2007-02-08"
        },
        {
            "review_title": "awesome",
            "content": "Zoom was a fun filled awesome action packed film it has a great message great actors and great visual effects it was a lot better than expected it the perfect for for all ages and a great spectacular family movie. Tim Allens character was portrayed perfectly and the same with all of characters. The person i was most impressed with was Ryan (princess) she has little acting experience but was a excellent addition to the whole movie. The only thing that could have been better was the final fight between Connor (Concussion) and Jack (Zoom) it was a little short than i would have liked but all over the film was excellent and is the perfect movie for any age and occasion.",
            "review_date": "2006-08-11"
        },
        {
            "review_title": "The failed X-men school",
            "content": "Zoom tried unsuccessfully to capture the magic of the X-men by becoming of rip-off of them and thank the Helmet of Magneto and Beast's hair this didn't happen and the movie failed both commercially, making only 12,5 million from a 35 million budget and critically with critics and general audience dismissing it as superhero movie and as a flick in general. In short don't bother watching it and now I will spoil you why it failed so dramatically.Firstly the person who plays the mentor is presented as a old superhero who after a tragic accident he quieted, but not for even one second while he was teaching ,I didn't see him as a professor and he was quit incompetent to find out that his main villain was his friend all along. Also why didn't he think that this doctor who say that she admire him and see him and his students at a daily based ,that she also has powers?Now to the students, kids with no interest to act and their personalities are so overused that I can't say if are good types or brads. And that is an issue because if you can not see the characters on the scene as unique people why bother to route for them? As for the \"powers\" ,I will only say that you have a girl with telekinesis, her boyfriend who has super strength and two other that I don't bother remembering and the effects are so lame that, those in Power Rangers look much nicer and cooler!! Finally the villain is a rip-off version of the Reverse Flash and has no further goal what so ever apart from killing the teacher who hates him just for hat sake. Yes , Thorne hate Flash ,but he did it because he was admire him and when he see him in the flesh he was disappointed. So Reverse Flash wins!Inconclusion this flick could be called \"An X-men rip-off in order to capitalize from their success\" and it would make no difference to me. The X-men aren't loved with armies of fans around the world due to their appearance ,but because they are a metaphor for the human rights , diversity and the nice personalities who live in their universe help the viewer to relate to them.",
            "review_date": "2016-06-28"
        },
        {
            "review_title": "Captain Zoom trains a new generation of super heroes.",
            "content": "Zoom is a good clean family movie. It's meant to be fun and the storyline is meant to lighthearted. Premise is easy and simple. Captain Zoom has long since lost his powers and retired. After a battle that killed his team and his brother Concussion. Zoom has disappeared and in his place is JAck Shepard a bitter cynical man. Shepard doesn't believe in heroics anymore. So when the government tracks him down 30 years later with the job offer of training a new generation of heroes. He's offered a lot of money and he's told he is the best qualified because he is the last superhero alive. The Group consists of your usual clichéd kids the jock the wanna be cheerleader the fat kid and the little girl. All have amazing powers and the government under the Zenith project wants them to be trained to face a enemy,that's coming. The Enemy is Concussion Captain Zoom's long thought dead brother. The Story falters here and there and the ending is not as fantastic as it should be. But it's a kids movie. And that's good enough. Keep in mind the audience this was made for and you'll enjoy it. It's not Nolan's Batman films. It's more innocent. And A lot of fun.",
            "review_date": "2012-12-21"
        },
        {
            "review_title": "The worst superhero film ever. Period.",
            "content": "Former superhero Jack Shepard (also known as Captain Zoom), is called back to work to transform an unlikely group of ragtag kids into a new generation of superheroes at a privacy Academy and save the world from certain destruction. The project holds an audition of would-be members, most of whom possess useless or disgusting powers. In the end, Dylan West, a 17-year-old boy who can turn invisible; Summer Jones, a 16-year-old girl with telekinetic powers; Tucker Williams, a 12-year-old boy with the power to enlarge any part of his body; and Cindy Collins, a 6-year-old girl with super strength. \"Zoom\" is a kids' superhero flick based on the novel \"Zoom's Academy\" written by Jason Lethcoe. In it, Tim Allen stars as a has-been superhero who's tasked to train four young superheroes to battle a nemesis, nothing less than his brother Connor Shepard (also known as Concussion). With that, you pretty much know what to expect. Unfortunately, that's all. While the film has all what comprises a prototype of this milked-dry genre, the experience is overtly familiar and dull. Jack (Allen...nope, not Matthew Fox) was Captain Zoom, a superhero who can travel at superhuman speeds, and one of the members of the military-sponsored superhero group \"Team Zenith.\" But he has since lost his powers after a military experiment has gone awry that also has his teammates killed. 30 years later Jack is brought back to train four youngsters with superpowers when a new malevolent threat from the past emerges. First of all, the script of Adam Rifkin and David Berenbaum doesn't attain new heights with their blunt dealing of a theme that's been done more excellently with \"The Incredibles\" and \"Sky High.\" And director Peter Hewitt (\"Garfield\"), who clearly isn't exactly a master storyteller himself, has little to work from with such a dull and hollow material. All of the characters are perfunctory parts rather than humans portraying genuine conflicts. Also, for a film that's called \"Zoom,\" the film drags: it lacks a sufficient amount of action. We're supposed to see the kids train, but all we're mostly shown are unfunny attempts at slapstick humor that the filmmakers assume would elicit laughters from the little tots among the audience (uhm, Courteney Cox tripping down and Chevy Chase getting slime on his face, anyone?). What constitutes for training involve at the most paint balls and a drive-thru chaos at a Wendy's restaurant. Yes, there's the climactic fight sequence at the end but it's too quick, unexciting, and not enough by a mile for a film that has terribly dragged along. Ultimately, what transpires is a terribly unfunny movie that wears out its welcome faster than its main character runs.Please do not listen to the positive reviews on here. This movie is not an \"excellent movie for kids\", or an \"Under-rated excellent movie\". It's a piece of garbage from start to finish, and probably would only appeal to you if you've had a lobotomy. Do not take your kids to see this movie, unless you're using it as some sick, twisted form of punishment. Movies like this are used as a form of torture in Guantanamo Bay. No redeeming qualities whatsoever.",
            "review_date": "2017-05-25"
        },
        {
            "review_title": "Worth watching",
            "content": "I have recently seen this movie, and I enjoyed it, it is harmless fun with some funny lines, maybe not the best Movie but not the worst I have ever seen. The kids in the audience really enjoyed it and that's what it is a kids movie, one that the whole family can go and see. It is in the similar vein to Airplane (although not as funny) a complete **** take of X Men and similar movies, take it for what it is.Tim Allan played his part well, and it was nice to see Chevy Chase and Rip Torn, it is a very undemanding movie, sit back and enjoy it, it doesn't make you think just takes you elsewhere for 90 minutes, with some good laughs along the way.",
            "review_date": "2006-09-11"
        },
        {
            "review_title": "Hey, what's wrong with fun?",
            "content": "AFter looking over the general critics' review ratings and then the user ratings, my wife and I were reluctant to gamble our once-a-week-away-from-the kids night out on Zoom. In fact, a lot of people must have felt the same way as we were the only 2 people in the theater. But we gave it a chance because we thought it might be a good way to get a few laughs and relax. Yes, the plot is very simple and predictable, the humor adolescent and sometimes rather crude (although I can easily imagine people actually USING the jokes in everyday life which is not always true), and it is highly unlikely to win (or be nominated for) any Oscars. But it moved along, I cared about the characters, and I felt that it really WAS a family-of-sorts in the process of uniting. I don't disagree with the comments posted by others about its general flaws -- but they didn't bother me much. We had fun, we laughed (I even cried a little one spot), we even got surprised once (but only once -- smile), and my wife has said that she'd like to see it again. She doesn't say that about many films. In a world where the news is dominated by war, terrorists, and politicians who cannot seem to be bothered to do the job for which they have been elected, sometimes it's just good to have fun.",
            "review_date": "2006-08-15"
        },
        {
            "review_title": "Ah, ... nah.",
            "content": "I was very disappointed that Courtney thought this film was a good idea. The rest of the cast are used to making wishy-washy bombs. But Courtney had the rest of her carrier to consider. Oh well.",
            "review_date": "2020-02-07"
        },
        {
            "review_title": "Worst movie i've seen this year",
            "content": "At first I thought this movie had promise, with Tim Allen and Chevy Chase creating some comedic elements. Once you get through roughly 5 minutes of the movie, you realize you're just sticking around to see how much worse the film can get (Can you say Troll 2?).Obviously this movie is a cop-off of Sky High, and a very poor one at that. The scenes just look randomly put together and make absolutely no sense at all (Like the part where they go into a flying saucer). I honestly felt sorry for some of the cast members (Especially Courtney Cox, who was legitimately trying to make a poor script work).Basically i'll just give you a synopsis of the plot, and leave you to decide if this Cracker Jack box of a plot allures you. Tim Allen is Zoom (Or as he likes to call himself Jack). He and his brother (Concussion) use to fight along side each other with a team of superheroes. The government wanted them to be even more powerful, so they shot the lot of them with radiation (I think they called it G17, but i'm too lazy to watch the movie to remember). Basically it makes all of their powers go tenfold, and subsequently makes Concussion mentally unstable. He turns on his team, and his brother, and apparently wipes them all out but Zoom. Of course this film is so weak that they don't show that part of the movie at all (That would be too intense of action for us PG fans to enjoy).Now go 30 years later. Zoom has lost his powers, and is a moody mechanic. You really don't get any character development. He's basically just shown as a washed up loser. Courtney comes in to lure him into a trap (Why I dunno, as they could've just shot him with a tranquilizer dart to begin with, which they do later on anyways). He's basically kidnapped to train a bunch of adolescents with super powers. Don't even get me started on how annoying some of these child actors can be. The girl that calls herself Princess should be banned from film for another decade. What is it with some child actors that they just come across as annoying more then cute, and don't have any substance to lend to the film (She's definitely no Haley Joel Osment).Anyways, rather then train the kids Zoom is bitter, and he doesn't even know that his brother is still alive (He's apparently in another dimension). All throughout the movie he basically insults the kids, and refuses to train them. It isn't until Courtney Cox finally tears through his defenses that he realizes what is at stake, and even then, he obviously feels betrayed, as he is training the teens to combat his brother.The fight scene of the movie lasts a whole whopping 2 minutes. My gosh it was short, and very weakly made. Afterwards I couldn't help but chuckle, as Concussion gets defeated and just acts all hunkie dory towards the people that defeated him. He doesn't ask why his brother is in his 50's (They portray it as him having partial amnesia).Anyways, hopefully I didn't offend too many people with this review.Bobby",
            "review_date": "2007-05-23"
        },
        {
            "review_title": "I think it's a good, fun movie",
            "content": "I'm not sure what most of the other commentators were expecting in this movie. I found it fun and I laughed through most of it, so did my SO. We are both 50.I thought that the casting was really good. Rip Torn played the kind of character that I'm familiar with, regarding him. I thought that Tim Allen was good throughout the movie. I thought that Chevy Chase was hilarious. Courtney Cox was funnier than I've ever seen her. The kids were all great.Yes, the movie was very formulaic. I didn't think that it took anything away from the movie.",
            "review_date": "2009-03-14"
        },
        {
            "review_title": "Its so bad and little good",
            "content": "First the story is pleasnt and I think the plot could've been better. They made it seem super childish. The way of moving from one event to another was some how awful and fast, It's like every scene is planned and not in a good way.My point from this review is it coul've been done so much better. Like imagine it was another movie super hero with a fine story but amazing plot and little bit darker, also if they didn't just wrap things out at the end I could give it a 5. And this movie had the chance to be good but they didn't take it maybe if it was a tv show or a sitcom, In my opinion that would've be better.",
            "review_date": "2022-10-19"
        },
        {
            "review_title": "enjoyable super hero family movie",
            "content": "The kids and I watch this DVD regularly. And we always enjoy the music and the feel good fun... It is a kids movie and as such it should be treated with some levity and give it a break.. The cgi etc is fine and does it job.. And it's funny in spots..and all the characters are well cast, Tim Allen is always watchable and while I don't remember this in the cinema, it is better then a lot of the stuff I have been dragged to over the years. So if you're looking for a movie to watch with the kids they will enjoy it, the sets are fun.. While the story is silly at times it still feels like it could be made into a series or have come from a series.",
            "review_date": "2015-01-04"
        },
        {
            "review_title": "My Kids loved it!",
            "content": "Okay, the movie is hardly an academy award winner, but take it for what it is\u0085good clean wholesome entertainment. I have children at home and they loved it. Me too actually. There are some quirky parts, but the story moves along. Give it a chance. If you have kids, they will love it.We saw this movie and watched it several times. There is somebody that each person can relate to. I only wish that a little bit less time could have been spent for Zoom to realize who he was and become the leader of the group. The characters were great. The movie moved along and was just entertaining. Much better than many of the comments here.",
            "review_date": "2007-03-10"
        },
        {
            "review_title": "Zoom is a Fun Movie",
            "content": "Zoom is a fun movie to see, all together lighthearted and witty. It just took a little too long to get going. The first hour was all about Zoom's (Jack's) not training the kids, which was rather boring all in all. He was so nonchalant that it made the story go no where for most of the film. It was a slow progression into actual action and the funnest parts of the movie at the end. You might want to write down when you hear the kids character's hero names BTW. I can only remember one out of the whole four of them after the fact. It was good though. I would see it again, not in the theaters though.Some familiar faces showed up in the movie besides Tim Allen also. Courtney Cox, and Chevey Chase were in the movie. Both played great roll's. Courtney displaying a more human side to her role playing than those that I've seen before (including when on friends.) I do not think it is at all like the other recent film about children action hero's \"Sky High.\" The plot is completely different, and the story line is nothing like that of Sky High. Two completely different movies. It's like comparing Spiderman with Batman, yeah they are both hero's but all else? Um, no. So as I said, it is a good movie in my opinion. If you haven't seen it already I'd say go for it. Don't pay attention to those star stat's. :)",
            "review_date": "2006-08-30"
        },
        {
            "review_title": "I thought torture was illegal now!",
            "content": "Before I begin, let me say this: I have never written a review of a movie before. I thought it right to start with a horrible film known to many a movie-watcher as \"Zoom: Blowout of the Century\".Movies like this can be broken down into almost two categories: Movies with traditional morals that are occasionally humorous and entertaining, and movies with a dull and done-before premise that has NO humor and a distinct lack of good acting.In fact, I found that movies like this can be made at home using a simple recipe: combine a heaping cup of clichéd plot, and bring to a boil. Roughly chop half a cup of washed-out family actor, throw in a pinch of terrible child acting, and I think you've got \"Zoom 2: A Twist in Time\".All in all, if your children and/or siblings beg you to take them to this movie, try not to. Let them go see something somewhat entertaining - maybe a good flick for teenagers would be \"The Pursuit of Happiness\". A good film to rent that's somewhat similar to this would be the \"Santa Clause\" series. Just find it in your hearts to stop people from seeing this movie.Please.",
            "review_date": "2007-02-01"
        },
        {
            "review_title": "kinda bad",
            "content": "the movie is OK but there will be better then that though it is bit funny to but the younger boy is power very very fake when he made his head bigger in the movie it was so like cartoon I don't think any one is going to believe that would ever be true and also the strong girl was almost as fake as the boy yeah right she can carry any of those heavy things I don't think even one adult could do that so they made a lot of the scenes look fake thats one of the reasons that there movie had a bad rating even friends hated it from how fake the movie looked good in the beginning it looked like it would be a nice movie but its horrible movie but some parts are OK and a bit funny but most parts are not good so yeah id give it a four out of 10 for the movie zoom",
            "review_date": "2007-04-06"
        },
        {
            "review_title": "I was so worried...awesome movie!!!!! 10/10",
            "content": "First of all the only reason i went 2 see this movie wuz because of Dylan West and you know what i ended up loving the whole movie!!!! Although when Dylan almost collapsed in the secret hiding place i almost stood up in front of the movie theater and yelled, but it ended up that he wuz okay but he had me so worried!another part of the movie i liked was when the audience finds out that Marsha Halloway (Courtney Cox) had powers!!!! it totally came out of nowhere!!!! Besides falling in love with Dylan i fell in love with Concussion, zoom's evil brother...who becomes good at the end of the movie...But he was very hott 2!!!!!",
            "review_date": "2006-08-16"
        },
        {
            "review_title": "Not the best, but for me a good escape",
            "content": "The critics savaged this film. I can understand why. There are major continuity issues - it looks like at times it was edited by a 10 year old. Still, these are some things I like about. I think Tim Allen's character does make the transition from cynic to caring mentor in a nice sort of way. There are a couple of nice performances from the kids, and Chevy Chase at times is actually funny - of course, there are times when he isn't.I have real problems with Courtney Cox in it, though. Stiff, wooden...troubling to watch.Too many montages.Funniest gag: Answering the question of what would happen to a speedster if he tripped.The film did give me the unique experience of knowing what it would be like to have a private viewing room. Other than the drug dealer in the upper corner conducting deals over his cell phone during the film, there was no one else in the place.I was curious about the source material, so I looked it up and found out it was a children's book that in no way, shape or form resembled the finished product. Other than the names of two characters (Summer and Zoom) nothing else was the same! This film has the unique distinction of getting the old goose egg at RottenTomatoes.com... but I didn't think it was that bad.4 stars out of 10. Maybe the DVD will explain some of these issues.",
            "review_date": "2006-09-13"
        },
        {
            "review_title": "4 star?????? How?!?!?!?!!!",
            "content": "This was such a good movie!!! How on earth does it have a 4 star!!!!!!!!!",
            "review_date": "2019-11-24"
        },
        {
            "review_title": "Zoom saves itself multiple times.",
            "content": "There are three things wrong with Zoom, only three:1) The superstrength special effects for the little girl. It doesn't look natural, of course, we realize the actress likely isn't used to, nor has the patience for intricate green screen direction, however, it is a flaw glaring enough to stand out. The rest of the special effects were either passable, purposefully goofy or excellent.2) The plot for the first quarter of the film. It's a decent string, with Zoom getting used to his old surroundings and deciding what to do about these kids, but it doesn't go anywhere... no events in that section of the movie build up to anything, causing unrest in what should be a children's movie.3) It is a children's movie... and while some of the actors and their performances may seem adult, every fifteen minutes or so, the team logo in stretchable brightly colored CGI jumps onto the screen to help us change scenes. I like kids movies, but it was a painful reminder not to take this movie too seriously. Once or twice would have been fine. Nine times?That said, there are three things that Zoom did so well that I want to see it again:1) One Liners. The movie was VERY funny. Everyone had great lines and some classic reactions. You'll remember laughing at this movie because of the way the characters interact, quickly and naturally with lines that only a movie character could be fast enough to think up. Everyone had comebacks for everybody, Tim Allen especially had sly cracks for every other character and, honestly, there's nothing much more fun that a tiny girl who can bench press trucks. The comedy is great. The Physical Comedy has some great moments, but I think the massive abuse of Chevy Chase was for the tiny tots more than anything.2) Veteran Actors. Rip Torn. Tim Allen. Courtney Cox. Chevy Chase. They added an immense amount of credibility and substance to the movie. They all worked very well off of each other and, well, it was great. The kid actors were decent too, but all those guys showed that they still \"have it\" in the acting department. So might say these actors are \"has beens.\" The movie shows them to be as talented as they were, and moreso, when they were big drawing cards, it appears as though they have better things to do than acting nowadays. Fine by me, when they show up, they're just as funny, deep and compelling as they always have been.3) Homage Superherodom. Incredibles, while original, was \"too close to the Fantastic Four\" for some. My Super Ex has a dozen Superman riffs and well, I think you guys know how it goes with these original properties. Zoom homages superheroes more intelligently and more broadly, taking aspects from Marvel's (used to be) new Ultimate line just as readily as DC name dropping and a dozen classic 'traitor' story lines. Case point: The kids don't have any powers that you can't find in the fantastic four, but no one notices... why? It's done in such a way so as not to be a ripoff, and you're distracted by the comedy between the characters.There are nitpicks to be had: The couples didn't have enough chemistry or characters we wanted to care about didn't get enough screen time or they should have had a black kid in there, but all in all, it was a fun and funny superhero movie, one you can enjoy if you aren't looking for it to be as serious as Spider-Man 3. If you liked Incredibles, you'll enjoy Zoom too. And likely laugh more.",
            "review_date": "2006-08-15"
        },
        {
            "review_title": "The best movie of all time",
            "content": "Zoom will not only be remembered with such masterpieces as Ishtar, Howard the Duck and Gigli, but also as one of the most excellent movies of all time. Just like X-Men and Sky High to Spy Kids and Fantastic 4, on and on, all these movies were great. And all of it works! The most interesting anomaly is that finally there's a movie with Chevy Chase where the material is better than he is. (Chevy, all of your movies were awesome, your career consists of mostly excellence.) The script is phenomenal, as were the actors. Howard the Duck and Ishtar, Great as they were, were outrageously funny and witty. Zoom is recycled, which is very cool and it's just another great film that Hollywood is renowned for.",
            "review_date": "2006-11-19"
        },
        {
            "review_title": "Not a bad kid's movie, but Chevy Chase almost ruined it",
            "content": "This was obviously a kid's movie, so previous comments about how bad it is are out of line. Every movie borrows plot elements from other movies, that's how movies are made. The plot was actually entertaining, even for an adult, and most of it was quite unique. Bringing disaffected kids with superpowers together as the only chance to defeat a returning superhero gone bad has not been tried before as far as I know. And I think a rather good job was done to chronicle the progress of the group from alienated individuals to a working team, along with cute tidbits of comedy and a developing romance between the superhero who lost his powers and the hidden talent.I actually thought Tim Allen was one of the better actors in this movie, living up to his own normal high standards. Courtney Cox delivered a cute character as the romantic interest that fit the plot. The kids all did their part in a believable manner, especially the little girl. The fat boy was obviously a stuffed costume, they could have done a lot better with that.However, Chevy Chase nearly ruined the movie all on his own. He looked like a dying man in the movie, so fat he looked like a stuffed sausage, and pale as a corpse to boot. You'd think they could have applied enough makeup so that he didn't look so sickly. His acting and delivery was zombie-like, his lines were stupid, it appeared as though the writers allowed him to insert his own take at times, and it was awful. I don't know what he was doing in this movie, but he is clearly washed up. He wasn't even a shell of his former self. He appeared to be muddled and dazed through the entire movie, the best thing he could come up with was \"we love to poo in our pants' in the outtakes? I feel really sorry for Chevy that he has sunk to this, but he should bow out gracefully. I've loved virtually everything he's done, but this almost undoes all the good karma. Someone please put him out to pasture.",
            "review_date": "2008-03-24"
        },
        {
            "review_title": "Come on peeps! It's a great family superhero film.",
            "content": "My entire family enjoyed this movie from the first time we saw it. I have 6 children and at the time this came out, I had 4 old enough to understand it. ZOOM is funny and entertaining for a kids superhero movie. And all the actors were funny and entertaining. The great part is, with it being a superhero movie, it doesn't contain the violence and scary villains like most others. And every new young one that comes over and sees it immediately says...... I know Captain Zoom's voice from somewhere. Within a few minutes they get all excited starting he's Buzz Lightyear. I am a Movie Freak!\nrUaMovieFreak2",
            "review_date": "2020-08-21"
        },
        {
            "review_title": "They lost me at the Wendy's drive thru",
            "content": "This is a kid movie of the era with a few stars. It wasn't my style but my family liked it.",
            "review_date": "2021-06-19"
        },
        {
            "review_title": "A peek into our own psychosis",
            "content": "Zoom assembles a wonderful cast of actors (such as Joshua Bozin and Ridge Canipe) that brings a rich and colorful rendition of the worn out plot of a superhero dad that is overly protected of a daughter going through puberty.The premise of the movie is very similar to Sky High, which I really enjoyed, but brought a fresh new look to an otherwise excessively used superhero plot. It is the inordinate, sometimes simplified, theme of \"Dad protect daughter and fight evil\" that brings an immediate familiarity to the characters, similar to an unwelcome stay from a spouse's relative.Allen, who plays the superhero father, brings his mentally challenged daughter, played by Mara, to a new school that caters to kids with special talents. I believe the social development of having a wide range of personality disordered kids together to accomplish a specific purpose helps the adult viewers want to believe and understand each of the characters.This is especially true when the villain, that represents the evil embodied in all of the wars and genocides, is first introduced into the movie. As the twisted plot unfolds around the villain one can personify this villain as all of the bad events that have occurred in our lives. But what is so wonderful about this movie is that it teaches us, in some small insignificant way, how to redirect this anger into something positive.Of course as the special needs kids (recently embolden on their journey to fight all that is wrong in this world), representing the natural good embodied in moms and twinkies, face this evil, all the audience emotions that tend to be inhibited by societal pressures and small cubicles are released in bits of vocal approbation that really don't end until the ending credits arrive.Forgetting the fact that Fox actually sued Sony for copyright infringement and unfair competition, this should not deter anyone who is interested in understanding the old \"good vs evil\" theme and dealing with their own innermost demons. In fact one should willfully relinquish the ticket price to enjoy the variety of emotional torrents that Zoom will illicit. You won't be disappointed.I recommend this movie for kids of all ages (1-100) but I caution those who tend suffer from narcissism and multiple personalities that this movie will cause one to meet the person they don't know, themselves.",
            "review_date": "2006-08-14"
        },
        {
            "review_title": "A really bad movie",
            "content": "Yes, the movie is pretty bad, but it has some juicy \"it's so bad it's good\" entertainment value.So i would recommend it only if you are that type of guy that likes to make fun at bad movies.",
            "review_date": "2021-05-23"
        },
        {
            "review_title": "This movie is not as bad as it is being made out to be...",
            "content": "I took my 6 year old and my 4 year old sons to this movie and found it relatively enjoyable. Do I think it was worth the $25 in movie tickets and an additional $10 for popcorn and juice... that is up for debate.I think movie theaters in general are completely over-priced - regardless of the movie... but that is another argument for another day.When I took my sons to see this I went without expectations of Oscar nominating performances. I only had one thought... showing my sons a good time with their Daddy. You know what? That is exactly what we had - a good time.This movie is nothing spectacular - it was a movie about superheroes coming into their own. Perfect for young children, and parents who remember what a Saturday afternoon movie was like when they were the children going with their parents.All I can say is - don't go looking for a Spider-Man, X-Men, or Fantastic Four type movie... the dialog and the pacing of the film is written with the idea of young children in mind - not adults looking for something more.",
            "review_date": "2006-08-16"
        },
        {
            "review_title": "Better than Sky High! It's a Blast to Watch!",
            "content": "Regardless of the negative feedback that is directed at this movie, I rather enjoyed it. It's just one of those movies that are fun to watch. Tim Allen was, as always, an asset to the movie and I was so ecstatic to finally see Chevy Chase back in a comedic role! The music was fantastic as well and really seemed to meld seamlessly with events of the movie. I thought it was very appropriate to play \"I can be your hero baby\" during the Superhero prom.The action scenes are decent and the super kids' powers are actually somewhat cool. The main reason I did not like Sky High was because the powers were overly stupid. There was a kid who glowed in the dark for goodness sake! But in this movie the main superhero powers (speed, invisibility, engorging, telekinesis, and super strength) are fun to watch portrayed in the film.THERE IS A MASSIVE SPOILER PERTAINING TO THE END OF THE MOVIE COMING UP, SO PLEASE STOP READING IF YOU DO NOT WANT IT SPOILED! First off, I thought Concussion (the bad dude and little brother to Tim Allen's character) was an interesting villain. His ability to generate concussion waves was pretty cool. I liked how he turned back to the \"light side\" at the end, but it seemed to me that he changed from villain to hero just a little too quickly to be realistic. Don't get me wrong! Every other aspect of the climactic battle was great, but I just wish the drama between Tim Allen and his brother would have been drawn out a bit longer (like it was between Luke and Vader in Return of the Jedi, though no movie could ever get it THAT good).Overall, I thoroughly enjoyed this movie and recommend it to anyone.",
            "review_date": "2007-09-18"
        },
        {
            "review_title": "Funny Family Film",
            "content": "I carried my kids (ages 13, 9 & 5) to a budget cinema to see this film and I will admit that I went with pretty low expectations. We were joined by another family from church, whose 10 year old daughter had worn them into submission as well.I thought the casting appropriate and well done...it was nostalgic to see Rip Torn in yet another movie with UFO's and references to Area 54. It's been a loooong time since I have seen Chevy Chase in anything and he was his usual goofy self. Tim Allen was really funny. You can understand why Home Improvement was at the top of the ratings for years. Ryan Newman (Cindy) was cute but sometimes her speech was hard to understand.Not the greatest script, but the plot was very easy to follow for small kids (my kids are relatively unsophisticated). The scene when Dr. Grant was trapped in the weather simulator was very corny and did nothing to advance the plot, but the kids in the cinema loved it!!! Go figure.The one \"keep it real\" moment is when Zoom trips. Really inane, really juvenile but I loved it. OK, I admit tears were rolling down my cheeks. I obviously don't get out much.I am one of those geeks who look for the boom mikes and cars and planes in medieval scenes and I didn't notice any technical goofs. I was probably distracted by the film. Not like the time I was watching Fantastic Four (on DVD), on my knees begging hubby \"Please, can we watch something else? Or scrub the toilets? Anything but?\"Zoom won't win an Oscar, and it may even be nominated for a Razzie or two. But it aims to be fun and fulfills its purpose to the delight of the kids.",
            "review_date": "2006-09-03"
        },
        {
            "review_title": "Could have been good",
            "content": "Good actors, decent premise, bad execution. This movie is almost as bad as if you took 2017 Justice league but made it with kids.",
            "review_date": "2021-05-04"
        },
        {
            "review_title": "What in the world were they thinking",
            "content": "This is the first movie I have ever commented on.... I usually don't make comments on movies because I didn't feel it was necessary, but now I feel like I'm flashing my lights at cars warning of a cop ahead. I don't see how anyone could actually enjoy this movie, it's so full of small stupid jokes that aren't even funny. I walked into the break room where it was on, and I can usually watch any movie that's on just to entertain myself but this one is so horrible that I actually had to stop watching because it hurt. Whatever you do avoid this movie at all costs it's not worth the wait for 2 laughs, go watch family guy and save yourself!",
            "review_date": "2008-08-14"
        },
        {
            "review_title": "Pretty Good movie",
            "content": "I thought this movie was pretty good so I gave it a 4 or 5 stars. Yes there were things missing and I could not tell if Conner was good at the end. His eyes turned from red to blue at the end to signify that he was no longer bad but his acting did not say the same. He was not very convincing on turning good. They could have developed the kids characters more and given us a better background of the kids. Overall I thought the acting was pretty good. I thought Tim did a great job. I also thought Chevy Chase, Courtney Cox and the rest of the kids did good on acting. I think that Summer and Dylan had great chemistry. I think Kate Mara and Michael Cassidy were great. I liked Michael rebellious side. I thought he played that well. I do wish they showed why each character felt the way they did. It would have been more fitting if they showed more on how the kids, zoom, and the scientist lady felt on the way they were treated by the outside world. That would have brought more character to the movie. I also thought that they should had more Conner in the film and show more on his side as well. Not everything is as they seem.",
            "review_date": "2007-06-10"
        },
        {
            "review_title": "Just plain bad",
            "content": "I first saw this back in preschool, and I've been re-watching clips from it. No wonder this movie bombed!!! The acting is mediocre at best, terrible at worst. Tim Allen is a complete schlub and unlikable jerk as Jack \"Zoom\" Shepard. I love him a lot better as Buzz Lightyear from the Toy Story movies. Former SNL star Chevy Chase mugs way too much as Dr. Ed Grant, like he's still headlining one of his 1980s comedy roles. As Dr. Marsha Holloway, Courtney Cox seems to do nothing but fall, even TRIPPING OVER A WHOLE DESK AT ONE POINT!!!! The kids are no better. Kate Mara is utterly bland as telekinetic mind-reader Summer \"Wonder\" Jones (she only seems to have 2 facial expressions, one being half-shocked, half-p***ed off), and Spencer Breslin (sporting a fat suit) is clearly too old to be playing 12-year-old human balloon Tucker \"Mega-Boy\" Williams (his voice is far too husky to sound 12. It sounded far more appropriate when he played Conrad in The Cat in the Hat). Ryan Newman tries be the cute bruiser as pint-sized powerhouse \"Princess\" Cindy Collins, but she just seems to come across as annoying. Michael Cassidy, playing human chameleon Dylan \"Houdini\" West, always looks like he's chewing tobacco or something. The special effects are horrifying, particularly the part where Tucker inflates his HEAD, and the part where he inflates his EYES! The jokes are unfunny (especially the fat jokes directed at Tucker), and there are way too many disgusting moments (such as when Summer telekinetically makes nasty-looking bolognese explode all over the cheerleaders after they bully her in the lunch line, and the part in the auditions where one boy blows a huge snot bubble which explodes all over Dr. Grant's face). Also, why does this movie rely so much on Smash Mouth songs? The Smash Mouth songs aren't even catchy (except \"So Insane\" and \"Hang On\")!!! Speaking of which, Smash Mouth's cover of \"Under Pressure\" (one of the best rock songs of all time) is downright ATROCIOUS!! The plot is generic and poorly written. In short, avoid this one.",
            "review_date": "2021-06-23"
        },
        {
            "review_title": "A poignant, thought-provoking social commentary",
            "content": "In an era rampant with political propaganda and constricted thought, Zoom prevails, providing a much needed look into the depravity of modern society. At the center of this masterpiece is none other than Tim Allen, the undisputed god of cinema. Through clever allegory and sublime acting, Allen's performance showcases the human race with unprecedented realism. His portrayal of Jack Shepard encompasses a range of meaning wider than the Grand Canyon, granting the viewer ultimate resonance. As the film progresses, an increasing amount of thought is demanded from the viewer. Certain plot points vanish, and the film transcends the realm of entertainment and enters that of prophecy. Through delicate craftsmanship and subtle detailing, Zoom manages to deliver its messages in a manner that is both poignant and subdued, leaving the viewer to ponder their very existence. Case in point, Zoom is an artistic think piece designed to engulf the viewer until the final frame of the credits, to much avail. Qutie possibly the Mona Lisa of its medium, Zoom is an unequivocal masterpiece, and it's political and social relevance shall know no end.",
            "review_date": "2016-07-02"
        },
        {
            "review_title": "I enjoyed it, but it was way too disappointing",
            "content": "Long time ago, I was going to want to watch this movie and like it, and I did think I would like it in the past and be more interesting to watch to check out the superheroes fighting crime and such, but now I just watched it today and I was really disappointed. :-(I'll tell you this, I really enjoyed this movie but I started to have problems with this movie until the end. So here is my problems, 1. When I watched it through, it didn't have a proper villain in the movie that the heroes were suppose to be fighting against which means there was no main villain in the movie. 2. It didn't have much action in the movie, which means the movie didn't have a lot of action through out the movie, it was just very slow paced and a waste.3. This movie was short.4. There is a little girl who's named Cindy, when you see her being in her uniforms that she needed to be wearing, she dresses up weird and very lame, all she does is wear mostly costumes in some other parts to get prepared to do stuff to be a superhero, meaning that she goes crazy with wearing costumes while being around in the facility and it didn't make any sense why she's wearing them and it was just stupid.5. Chevy Chase's acting was just not that good.6. It didn't tell and show any stuff about some kind of team that Jack's brother named \"Connor\" has been, which means it didn't show flash backs about what Jack's brother Connor has been doing in the part of a team that he is a member of in the past.These are my reasons with this movie, and I was not too impressed with this movie. I still really enjoyed this movie, cause to showed about kids that had strange and secret powers that were developed secretly that made them become superheroes, but this movie was just a complete mess.",
            "review_date": "2014-08-09"
        },
        {
            "review_title": "Needs a reboot",
            "content": "Concept has lots of promise, but the story is horrendous.A fun movie... for kids.Adults can't help but feel the pain of Tim Allen in the lead as \"Zoom\" the Flash wannabe. His acting was OK, it's the concept of his out-of-shape loser style for the story.Pain also comes with a character that instantly balloons a body part. That's a super power?All the other characters were good, well except for Chevy Chase's part. Just lame.With all the superhero movies doing so well now, this could be reboot-worthy. Grab a decent writer and a decent cast, and it would make for a fun family popcorn movie.",
            "review_date": "2015-05-29"
        },
        {
            "review_title": "Maybe for small children?",
            "content": "Normally I give any movie that is competently made and has a coherent plot at least a 4, but this an exception. Maybe the target audience is small children, but if that's the case the Spy Kids/Sky High are so much better. Then there's the not insignificant matter of Smashmouth being all over this film. Big time regrets as the credits rolled.",
            "review_date": "2022-07-17"
        },
        {
            "review_title": "This is an awesome, fun family movie!",
            "content": "This is an awesome, fun family movie. We need more movies that are a great message for kids and fun to watch. How exciting it is for kids to see the real kids become super heroes. We all love super heroes and this movie is done with a wholesome and enjoyable approach. Kids can leave the movie with a good feeling about themselves. Even superheros are not perfect, but that doesn't keep them from being great, just like our kids! Too bad more adults don't see the value in good movies for their kids and the whole family, rather than expecting kids movies to be full of adult content that distorts great messages like the one this movie leaves everyone with. Thanks for a great family movie!",
            "review_date": "2007-01-27"
        },
        {
            "review_title": "Don't waste your time...",
            "content": "Unfortunately, I am so sad to say that it was one of the worst movies I've ever seen. I came across this accidentally on TV, and I stick around just for Tim Allen and Courtney Cox. But the script was pretty awful, even they couldn't even save it. I just gave it a 3, just because the little girl's funny kind of scenes. Other than that, it doesn't deserve your time.",
            "review_date": "2020-09-07"
        },
        {
            "review_title": "What did you expect?",
            "content": "Okay, so this movie is not going to win any awards anytime soon.But, come on. What did you expect? I didn't pay anything to see this movie, maybe the reason why I didn't find it so bad. It wasn't great, but it wasn't as bad as it could have been.Sure, it was mostly a chance for writers/director/producers/etc to cash in on the craze that is Super Hero movies. Particularly kids super hero movies. Zoom is no 'Sky High', and yeah, with a better script and a director who maybe tried, it could have been. It had the potential, it honestly did.The acting was so-so. The characters were pretty stereotypical. You had the beautiful Geek (Cox), hot angsty guy, pretty outcast girl, fat kid and cute little kid. Allen's character was a bit too bitter and Rip Torn (man, his name makes me laugh) was over the top. They relied on slap stick rather than scripted jokes, but you have to remember that this is a G rated kids movie. Made for kids under 12. To the average adult, yeah, it was a waste of time, but kids will love this. With kid-approved sight gags, cool gizmo's and the whole super hero theme, the younger audience will love it.All in all, this movie wasn't all that bad. It was only an hour and a half and even if you don't like it, it'll amuse the kids for a while. The whole movie was predictable, from opening credits to end credits and stuck closely to the popular, yet overdone, super hero kids movie. It could have been done better, but it wasn't complete rubbish. Light-hearted entertainment for the kids.After all, there's nothing cooler than super heroes.",
            "review_date": "2007-07-06"
        }
    ]
}