{
    "rating": 9.1,
    "release_date": "2014-11-07",
    "num_reviews": 469,
    "genres": [
        "Kids&family",
        "Comedy",
        "Adventure",
        "Action",
        "Sci-fi",
        "Animation"
    ],
    "summary": "Robotics prodigy Hiro (Ryan Potter) lives in the city of San Fransokyo. Next to his older brother, Tadashi, Hiro's closest companion is Baymax (Scott Adsit), a robot whose sole purpose is to take care of people. When a devastating turn of events throws Hiro into the middle of a dangerous plot, he transforms Baymax and his other friends, Go Go Tamago (Jamie Chung), Wasabi (Damon Wayans Jr.), Honey Lemon (Genesis Rodriguez) and Fred (T.J. Miller) into a band of high-tech heroes.",
    "reviews": [
        {
            "content": "It tells a heartwarming story about a young robotics prodigy, Hiro Hamada, who sets out to solve the mystery of his brother's death with the help of his robot, Baymax, and a group of friends.\n\nThe animation in this film is simply stunning. The city of San Fransokyo, where the movie is set, is beautifully rendered, and the characters are all unique and memorable. Baymax, in particular, is a standout character with his lovable personality and iconic design.\n\nThe story is engaging and emotionally resonant, touching on themes of loss, friendship, and redemption. The film also has plenty of action and adventure, with thrilling set pieces and exciting moments that will keep you on the edge of your seat.\n\nThe voice acting in this movie is top-notch, with standout performances from Ryan Potter as Hiro, Scott Adsit as Baymax, and the rest of the talented cast.",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is so cool, but stays kid friendly and it still works for me. Lots of fun ideas, and it is technically a Marvel movie, so of course Stan Lee gets a cameo in the post-credit scene.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This thing shouldn't have won over How to Train Your Dragon 2 at the Oscars",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thoughtful, inclusive message. Big Hero Six is the example of being superheroes look like, life will turn upside down. Agreeably entertaining and brilliantly animated, Big Hero 6 is briskly-paced, action-packed, and often touching. Also great for athletes of sports to watch and being immortal.",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My issues lie with the plot twist, but it still is pretty good regardless.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kids and I loved this movie. It had a engaging story, didn't seem like a direct rip off of anything, and was overall great.\n\nSide Note: Stay away from the short stories. Disney ruined those with the wokeness.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 might be my favorite Disney movie - it certainly is my favorite of the \"beyond classic era\" of Disney movies. Funny in all the right places, sweet in others, Big Hero 6 never lulls, never feels off its game. I can't recommend BH6 enough.",
            "review_date": "2022-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is an Action Animated film that follows the adventure of Hiro and his lovable robot Baymax as they Try to uncover the mysterious Yokai as he causes havoc through the city. In my standpoint I was  going to give it three stars because other older critics didn't really find it entertaining which is obvious because the movie is  rated PG and as it clearly holds up to the disney theme if which is why I recommend it to young(7-10) viewers.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Know don't get me wrong I love this movie but it is still so overrated and how this movie the award for best animated feature while The Lego Movie did not even get a nomination final rating 7.9/10",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty good. The robot was my favorite spot as he's lovable. The visuals are pretty nice, too.",
            "review_date": "2022-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pixar movie with the theme about loss and how to accept loss",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a really solid movie with heart and action to make the film great to check out.",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very happy to dive into the world of Big hero 6, where the protagonists, for how much part of a fantastic world, have to deal with real emotions. \nLose a dear one, growing up and trying to find your way, choosing who to trust, friendship. These are just some of the themes that are exposed through the story and are handled without making everything a cliche'.\nThe animations are a pleasure to watch as well as, thanks especially to the catalysator of the story, Baymax, there is a great touch of humor that is not only the way to make less serious the drama that Hiro, the protagonist, is leaving, but will be also the resolutive key for the events to get resolved.\nI loved very much the setting, the town of San Fransyoko, a nice balanced mixture of San Francisco and Tokyo. \nA perfect movie that will leave some suspense! The plot seems to be obvious but it has a nice twist that, although can be figured out, is not crystal clear until the very end.",
            "review_date": "2022-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Archie’s review: “It was fine. I liked the main guy. I think it was the kid that was the main guy. I liked the start. Maybe I liked the cat. I did like the cat a lot. Mochi. I liked the part when they took that guy to jail.” 🗼 ",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing visuals, 4k ultra HD, I'd buy a Disney plus subscription just for this movie.",
            "review_date": "2022-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7 years ago-Amazing animation, great action, and, really, really funny.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So Entertaining for all ages. ",
            "review_date": "2022-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the animation and soundtrack of this movie. The whole obvious plot that the characters are so dense and don't really understand body language or people is insane. How can they go to a high-tech school and still don't know what social skills are like? It's crazy. These people are adults in this movie yet they can't tell someone's acting a bit crazy or fishy not just by a science fair?? But by long hours working with the person who brought them to school and all? I find this plot so funny to me. But I feel like there was a genius behind the plot and that was Baymax. He knew yet his only goal was to help all of them face grief and loss which he programmed himself to do. I feel like to me everyone knew who it was but they were just having a goofy good time to make everyone else feel better. There's just a smart hidden plot in this movie that I'm not getting that I only focused on the main plot.",
            "review_date": "2022-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BIG HERO 6 is one of the best animated superheroes, I liked this Disney movie. the good: The fights are good, there is reference to Marvel and Disney and STAN LEE! yes!!!",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is not among the best that Disney has ever done and it isn't flawless. But it is still very good and one of their best easily since the Renaissance. It did feel a little rushed at times and felt like it tried to do a little too much in the storytelling, as a result some ideas that were introduced like the science-is-good message gets lost. If it slowed down and explored a little less areas it would have improved things. The villain felt underdeveloped and his reveal came over as very obvious and forced as well.\n\nHowever, the animation is outstanding with lots of rich colours and textures, backgrounds that are incredibly detailed and sweet(but not in a cloying way) character designs. One of the best-looking recent Disney films definitely. The catchy and upbeat yet atmospheric and emotion-filled soundtrack and smart script are other things to like, as are the brisk(when not rushed) pacing and rousing if not exactly inventive action. While the story is not flawless, on the most part it's still a winner. Whatever originality it may lack, it more than compensates for that with fun and heart. There are plenty of funny moments(i.e. Stan Lee), and of the laugh-out-loud witty kind and even better is the emotional impact Big Hero 6 has. The brother-brother relationship is handled very affectingly, like between Anna and Elsa in Frozen it was Disney trying to explore a different kind of relationship than they did before and it succeeds in that respect.\n\nSure Big Hero 6 sometimes takes a dark tone but not in a heavy or inappropriate way, there's no reason why anybody should be disturbed by that. The characters are not the most developed ones there ever were and as said more should have been done with the villain, but they're still engaging. Hiro is a very flawed but still likable main protagonist and his relationship between brother Tadashi is beautifully done. The most memorable character for me though was Baymax, he has to be one of Disney's most adorable characters, along with Maximus(Tangled) and Sven(Frozen) he has one of their cutest since the Renaissance. As well as being beautifully designed he displays a lot of laughs and a wide range of emotions, literally the film's heart and soul. The voice work from all(I just wish that James Cromwell had more to do) is very good, with particular mention going to Scott Adsit and his voice is a good match with Ryan Potter's deeply felt Hiro. All in all, not one of Disney's best but one of their better ones of the past 15 years. Haven't seen all the Best Animated Feature nominees but while this viewer did prefer How to Train Your Dragon 2 and the un-nominated Lego Movie they still felt that Big Hero 6 was still a good enough film to merit an Oscar nomination. 8/10 Bethany Cox",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film as expected from Disney, they almost never seem to let you down. \"Big Hero 6\" is an action packed, beautifully animated film with tons of heart-warming scenes. Classic Disney experience. It's about the same formula at it's core but it sill works after all these years.",
            "review_date": "2022-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best animated films made, \"Big Hero 6\" packs the emotional depth of previous Disney films while trekking through brand new Disney animated territory by successfully exploring the superhero genre. The amount of characters can feel overwhelming as many of them can never be fully developed. However, the fantastic soundtrack, gorgeous animation, and beautifully done action more than compensate for it. The story is also great (even if it is noticeably weaker in the second act), giving us all the emotion of other Disney animated films and giving us a powerful ending. Overall, I loved this film and thought it was a nice change of pace for Disney as a whole.",
            "review_date": "2022-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 certainly did not disappoint in which the film was packed full of heart with its heartwarming story, action, fun and engaging characters.",
            "review_date": "2022-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enormously underrated. This is a special film.",
            "review_date": "2022-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fun superhero take. Does something Disney rarely tackles, addressing the loss.",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is sweet, well animated and has passable characters other than Baymax, the healthcare robot, which has more depth. It's not amazing by any means but still an overall enjoyable movie. It's super fast-paced and feels a bit rushed at times, especially at the start of the movie. The plot is neither great nor very believable but I don't think having a great plot was the purpose of this film. You can tell the emphasis was put on the protagonist's personal evolution and development rather than the general plot. I would say Big Hero 6 excels at nothing, except perhaps the animation, but is okay at everything.",
            "review_date": "2022-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was his mistake",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Summary\nA lonely 14 years-old robotics genius, Hiro Hamada, loves building his own robots to defeat other robots in street fights in San Fransokyo city. His older brother, Tadashi, is concerned about Hiro's future, so he decides to take Hiro on an engaging tour of his university's robotics lab. There Hiro meets Tadashi's genius friends and falls in love with the robotic program. In order to get accepted into the program, Hiro designs a new type of nanorobots (microbots) to impress the program's director, Callaghan. During the presentation of the inventions, there is a tragic event that leaves Hiro immersed into a deep depression until he finds Baymax, a personal healthcare companion designed by his brother, who seems to leaven his sadness. After a bunch of funny and mysterious events, Hiro finds out a shocking truth about the presentation's tragedy. It was not an accident, but it was produced by Callaghan to steal Hiro's microbots. Out of rage, Hiro decides to upgrade Baymax´s functions turning him into a fighting robot, and gathers his brother's friends to form a group of \"superheroes\". What apparently starts as a mission to find out the truth behind Callaghan's mystery, turns into a selfish act of revenge from Hiro. However, in this revenge process, the group discovers the heartbreaking reason behind Callaghan's decisions. Late in the film, and after putting rage and hate aside, Hiro and Baymax save Callaghan´s daughter by getting into it the portal, but while doing so, Baymax gets stuck and is not able to come out of the portal. After a few months and several tries, Hiro rebuilds Baymax and gets his robot friend back.                                       \n\nAnalysis\nBig Hero 6 is a touching and enjoyable animated movie that conveys friendship, love, adventure, action, and superheroes while promoting an anti-violence message. This film helps viewers to realize that violence is never the solution even when it appears to do good. Focusing on Hiro, he is filled up with so much anger and a deep desire for revenge against Callaghan for a valid reason, which pushes him to turn sweet Baymax into a murdering machine. However, at the end of the movie, he chose to forgive and even help the villain. The movie encourages people not to choose violence but to do good in everyone's life. Also, the movie shows us that love comes along with sacrifices, sometimes these sacrifices are meaningless but sometimes they are huge and heartbreaking. As we were able to see at the beginning of the movie, Tadashi sacrificed his own life to save someone's else life who happened to be the villain of the movie, or when Hiro sacrifices his robotic best friend to save Callaghan's daughter, even when Callaghan was partly responsible for his brother's death. Additionally, this movie portrays the importance of friendship in a person's life. It is wonderful to see how Tadashi's friends and Baymax help Hiro to recover from depression after his brother's death just by offering him their friendship, time, love, and advice. Big Hero 6 illustrates how a well-intentioned friendship can help you to move on and even become a better person.\n\nCritique/Recommendation \nBig Hero 6 is one of the best Disney movies produced. Despite of it being a little bit predictable towards the end, the movie works out really great thanks to the charism of its characters, the exciting action scenes, and its effective emotional content. All characters are memorable, especially Baymax the most lovely and cute robot ever seen on screen. The villain of this movie is a well-developed character based on a complicated background story, which makes it easy for viewers to feel sorry for him and experience empathy.  The script and dialogues are great, creating a unique storyline. This movie entertains not only kids but adults too. Last but not least, the 3D animation is fantastic and skillful.",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here my thoughts: I Baymax and Fredie. I Liek them. Gogo Hot. I Dont like Honey lemonm, A little annoying. I Like mochi Cat. Gr8 Flick!\nMarisa: You didnt talk about Wasaba. I like Wasabi. Okay thats good 😅😅",
            "review_date": "2022-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It started out good but everything went downhill from there. The twist villain is unbelievably predictable and his actions are absurdly unreasonable. The side characters are forgettable and their costumes are stupid. There are some good fight scenes and humor though.",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite animated movies of recent memory. Although I feel this one was riding the Marvel wave a little bit with some of it's story elements. This movie will no doubt bring joy to those who watch.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I mostly like how on earth someone could just think of a big, 'marshmallow'-shaped nurse robot who says \"On a scale of 1 to 10, how would you rate your pain?\". Just hilarious. The story around is not that special though, just a normal story about a group becomign heroes and defeating the evil one. \nBut just because of the hilarious Baymax, I rate this movie a 10/10\nAbsolute Must See!",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it attempts to provide a cute little story about a boy and his robot, the movie mostly works. The setting and secondary characters will leave you asking for far more of them, especially when some of the latter payoffs feel unnecessary and unearned.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised how good this was given that it failed so thoroughly to replace Frozen in popularity even a year later. I think they could've made a great movie just based on the robot fighting aspect (and may even have preferred it as I'm a big BattleBots nerd) but what they shifted toward was fine too. I didn't really buy into the non-Baymax heroes as legitimate since they got so little backstory and screentime, but Baymax himself was a very good protagonist and made for a touching final scene. The music was good too.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming and full of energy, Big Hero 6 is a surprising well written approach for Disney in the superhero genre.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun superhero movie, with likable characters and plenty of entertainment for the whole family.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over time, Big Hero 6 received massive hate for winning a questionable Oscar of Best Animated Feature (as 3 of the 4 other nominees were better: How to Train Your Dragon 2, The Tale of Princess Kaguya and Song of the Sea), and this hate blinded these people from an excellent film. As a superhero movie, Big Hero 6 is perfect. We have a strong protagonist and villain with also strong motivations (and the villain has an opponent who has a questionable nature) and interesting sidekicks with their own personalities. But the main star is Baymax, the inflatable robot who is an ambulant joke with the best comedic timing Disney has ever made. The \"separation of the team at the end of second act\" cliché is forced and the epilogue does have a plot hole, but these are mere details in a movie that is unfairly over-hated and deserves an apology.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting, likeable characters in a plot that may be a pinch over-the-top and stretching the limits of suspension of disbelief, but still good nonetheless. You'll wonder where the \"6\" comes from in \"Big Hero 6\" for most of the movie but overall a creative movie that'll leave you hoping for a sequel (stay for the post-credits scene).",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A young teenager creates a group of superheroes to save his city. This is Disney Animation's first film using a property from Marvel Comics. The heart of this film is the relationship between Hiro and Baymax, Hiro's brother's nurse robot. The film really delivers on that relationship and does well with the subject of loss. The supporting characters are unique and interesting. The animation is the quality that you would expect from Disney. The voice acting is also well done with Ryan Potter as Hiro and Scott Adsit as Baymax being the standouts. A highly recommended movie, go check it out!",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great classic brings me back to my 4th grade life",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome action, beautiful animation and the best superhero film to be part of Disney",
            "review_date": "2021-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a first-rate, powerfull, legendary, thougth provoking, fascinating film. \nMy favorite part was when the beimex almost passed the speed of sound the hero would die with the speed. \nI highly recommend because is a film that mixes a lot of science, technology and action",
            "review_date": "2021-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pretty awesome and watchable at every time. My favorite of the Disney Studios. 8/10",
            "review_date": "2021-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SO STUPID WTF I JATED IT HATED KT SO MUCJ SO BAD I JATE BAYMAX I HATE HIM AND ALL HIS FRIENDS AND THE GUYS BROTHER WHO DIED IN THR FIRE IT ALL MAKRS ME SO ANGRY AND ITCHY AKD MY EARS HAVE BEETLES IN RHEM CRAWLING ALL OVER THE PLACE EBERY TIMR I HEAR HIM GO BADALALALALASADA",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I was in 10th class and this movie was announced, I had no intention of seeing it, because I haven't seen the last 5 movies. That's how much I lived under a rock. By the time I learnt it doesn't have any prequels the movie was long gone from the theatres. So I finally watched the movie when it came on TV and damn this was a movie I'd have loved to see! Later on I got to know this is based on the Marvel comics, so technically this is the first Marvel movie I have ever watched (because I live under a rock, remember?).\n\nThe reason why I liked Big Hero 6 so much is because of Hiro Hamada. I have always been interested in robotics and have participated in a robot combat competition myself. Other than that I was preparing for JEE so I was as such very much into science. So right off the bat we begin from a relatable protagonist. Tadashi was also a very nicely made character. When both Hiro and Tadashi go to his college my focus was on how nicely they both talk. It actually feels like they are physically there, as Hiro looks around and Tadashi gives remarks as he gives Hiro a tour. When he shows Baymax to Hiro the part where Hiro thinks he just made a duct tape shows how natural their behaviour was. The other characters were also very interesting, although I don't remember their names anymore since I watched it so long ago.\n\nThe movie has all kinds of emotions that make it appealing to the audience. It will make one laugh, cry, angry, excited, scared and awestruck. The heroes, villains, story, plot twist, emotional conflicts and even the little details scattered throughout the movie have all been placed very well. Just watching the hero-villain fights didn't let me be seated. Baymax is so cute. The Stan Lee cameo in the end was also unique.\n\nOverall I'd say the message of this movie is the most important aspect about this movie. A hero, who has lost his brother who was his only family and has gone into depression, is brought back to high hopes with the souvenir that his brother left him. His brother's friends were there to help him, his step-mother was supportive of him and overall everyone around him was always wanting the best for him. This is what finally allowed him to be the superhero. His emotional conflicts, whether he should entirely act on his feelings or take a calm and collected approach, whether he should kill someone or never harm a person, whether he should use his powers alone or assemble a team, all of this was in his hands. He did everything he hoped will make his brother proud.\n\nI enjoyed this movie so much that later on I showed it to my sister and recommended to all the children I met. This is what a movie should be like. It has a good story, memorable people, character development, conflicts, emotions - everything needed to make a good story. These are the most grounded heroes I have seen in any animated movie. I really hope it gets a sequel. I can't have enough of it.",
            "review_date": "2021-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all round great action/comedy for the family, brought down only by its predictable and overly 2-dimensional villain with a conscience.",
            "review_date": "2021-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovable, smart, it's gonna make you cry in the first third. Great natural character development. It has it all.",
            "review_date": "2021-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 is a bit sad but with some pretty good action and a dope plot it's still a good movie and Baymax is touching and full of heart and it also has a good soundtrack from the fall out boys.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has a great main character that has a likable bond between his brother, and side characters that are ok. However, they don't stick out as one person or as a group either. Also Callahan is the worst twist villain in my opinion don't quote me on that. However, BAYMAX. Baymax is adorable, funny, and integral to the plot and has a lot of personality.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of Disney's attempts at entering the world of superheroes and it might be the best one. Impressive graphics, design, and an impressive story all play a part in this, a story that we can all relate to. This is the best Disney movie that I have watched in my life.",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This animated superhero movie was very good. Ryan Potter, Scott Adsit, Daniel Henney, T.J. Miller, Jamie Chung, Damon Wayans Jr., Genesis Rodriguez, James Cromwell, and the rest of the cast did a spectacular job on this movie. The plot of the movie was entertaining, humorous, and thrilling. It was very cool to see these tech geniuses as superheroes. If you haven't seen this movie yet, check it out sometime. It's fun for an entire family.",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could easily be mistaken for a Pixar movie which is a good thing. This is a cleverly crafted movie, me and my older sister is a fan Japanese anime and its associated a lot in this movie.",
            "review_date": "2021-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I somehow missed this movie when it was released seven years ago, but I'm so glad I found out about it now. It's so much fun and very sweet without being saccharine.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6.3/10 — \"Okay\"/\"Decent\"/\"Watchable\"\n\n-(Seen on 2/15/21)",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a cool movie.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This doesn't anger me, but ‘Big Hero 6' is still a hodgepodge of everything from The Iron Giant, to the MCU formula, to Jimmy Neutron, to The Incredibles, to even T2 - which all left me with the unmistakable fatigue of not having witnessed anything more than a diverting product (no matter how solid the animation is). Everything can only be solved with a giant cyber portal battle yaaaaaay.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now/Adult: 9/10. 96/100. As Child/Teen: 10/10.  100/100",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is just beautiful, which makes some illogical story aspects neglectable.",
            "review_date": "2021-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best kids films ever made and will ALWAYS be a great film through the decades.",
            "review_date": "2020-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is more than a good family super hero movie. It stands on its own with a good story, excellent pacing, and a lot of heart. It's earnestly funny and doesn't subvert its established rules for the sake of a quick joke, a mistake common to far too many of its peers. The superpowers are interesting and creatively implemented, the villain is unique, memorable, and flushed out. Sure, it's childish in a few places and whenever someone says, \"Woman up,\" it's cringe-inducing, but those nitpicks aren't enough to bring the rest of the movie down with them.\n\nClosest comparison: It's like Iron Man by way of Frozen.\n\nSetting: Super Hero\nPlot: Super Hero\nTone: Family Adventure",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Disney superhero movie",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was genuinely surprised when watching this movie that the only character who I think isn't generic, boring, or annoying is Baymax the emotionless robot. However, despite its bland characters, Big Hero 6 is beautifully animated and colorfully designed enough to warrant at least one viewing.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good superhero movie with compelling drama. The twist villain may be horribly built up with confusing side motivations, but that was their mistake.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is an overpraised Disney film. It's basically a mix of How To Train Your Dragon when Hiccup rides on Toothless for the first time and Monsters vs Aliens when the monsters don't succeed as a team until the end. In other words, it really wasn't original besides the robots aspect. The superhero concept was painfully child oriented, the twist villain was terrible, and the robots besides Baymax were ridiculous and completely unbelievable. The whole child genius thing wasn't great either. The writing was the biggest let down, and the film could have been more emotional considering the circumstances - it was no Up or WALL-E. Furthermore, the plot was predictable, especially the ending and what happened to the brother. However, Baymax was a fantastic character, the animation was brilliant, and there was some good humour in the first half. The second half was definitely worse and things seemed to get increasingly silly as the film went on. It's an acceptable film, but it's very far from the best animated picture. Most animated pictures have a little bit for everyone, whereas this was blatantly more child oriented.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story, great animation.",
            "review_date": "2020-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish I would have seen this years ago. This film is on par with Zootopia, which prior to watching this I would say is Disney's best movie in over 20 years. It's story was really investing from the start. I was constantly interested in what was going on with the characters, which were all engaging, and it never stopped being entertaining. I loved it from beginning to end. And I laughed out loud quite a few times thanks to the  amazing character that is Baymax. The very serious emotional themes in this movie were also handled incredibly well for children to be able to watch while adults can understand what is happening on a deeper level. Great film.",
            "review_date": "2020-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm probably in the minor cause I didn't like this movie at all. It's really rare that a disney movie feels too childish for me. This, Frozen II and Ralph breaks the internet are too bland and childish for my taste. The characters and plot are really forgettable, and the villain is so ridiculous and predictable. One of the most boring disney movies ever.",
            "review_date": "2020-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone seems to love this movie. It was just okay.",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool animated superhero film, one that I think is good.\n\nThere are moments I like about 'Big Hero 6' and moments I don't like quite as much. I'll start with the positive parts. The animation is excellent, as is the music (nice song from Fall Out Boy). It also has a fair amount of heart, not as much as the film intends to add but still more than most.\n\nNow for the lesser things; that aren't bad per se, just not as well done in my opinion. The plot doesn't feel like anything too refreshing, I feel it's a story I've mostly seen elsewhere; in a few areas  it kinda reminded me of the sorta stuff you'd see in a Scooby Doo episode, at least in terms of the twists and/or antagonists. I, also, don't love the design for Baymax - making a character with no facial expressions or true emotion always makes it harder to get attached to them. I do like his purpose, mind.\n\nAs for the cast, they're decent just not memorable to me. Ryan Potter and Daniel Henney are solid as Hiro and Tadashi, I enjoy their bond together. I'm struggling to remember any of the others though.\n\nAll in all, a good film - it's just missing a couple of things that would've made it greater.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outside of Pixar this is possibly my favorite animated film (well also aside from The Iron Giant).",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprising and incredibly captivating story with charismatic characters to make the experience even more fantastic, \"Big Hero 6\" is a great movie for anyone who expects from Disney who was inspired by a beautiful adaptation of the same name.",
            "review_date": "2020-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With stunning animation, colorful visuals, charming characters, thrilling action, and an emotionally affecting story that deals with heavy themes like grief and family relationships, it's a fast-paced family friendly animated superhero flick that's a great addition to the Disney catalog.",
            "review_date": "2020-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie!! Loved everything about it. I'm a sucker for cartoon films, especially the more sentimental ones that make me cry. This one both made me cry and laugh. This movie is also super exciting and doesn't disappoint.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, exciting and cute",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was just awful. Somehow at the end he jumps through that portal on the last second. What were the chances? On the DVD it says \"Best animated movie of the year.\" BULLCRAP. THE LEGO MOVIE CAME OUT THAT YEAR AND IT WAS FAR BETTER!",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best Marvel/Disney animated films in my opinion. You can be an adult and or child to enjoy this touching story!",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#BigHero6 #MovieReview: 10/10\n\nPros:\n\nBaymax/Hiro carry the entire movie\n\nStunning animation quality\n\nTouching character moments\n\nEmotionally strong\n\nSome of the best slapstick humor in Disney films\n\nHilarious\n\nSolid supporting cast\n\nRelationships between characters\n\nCons:\n\nN/A",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun for the entire family. Some of the humor doesn't land, but there is enough heart to make it work.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "honey lemon is the superior lesbian she is the only good thing in this movie",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why do people like this movie again? The twist villain was awful, so bloodthirsty and 1-dimensional. Very forgettable. I really like the opening. I think it's a wonderful set-up. But once Tadashi dies, everything blows up with him.",
            "review_date": "2020-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming Pixar adventure. Never thought I'd fall in love with a giant inflatable robot. Gut wrenching - as you'd expect.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First saw this in college during my first year and this movie has remained a staple in my favorite animated movies list since then. Pure joy, tears, and everything in between, this delivers all the emotions you could possibly want from a great movie. Will be calling my next pet hairy baby.",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterfully tells the story of dealing with grief from a teenager's perspective, as it amalgamates both Western and Japanese influences to form a harmonious balance, promoting an optimistic future which lands on this fine line. The narrative was somewhat undermined by the Marvel-istic cliché of an ending, and I would have liked to see Callaghan upheld as the villain with good intentions rather than getting his due justice. But overall, a great animation which injects American Disney with modern culture and Eastern flavour.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an adult, I haven't cried to a Disney movie since the ending of Toy Story 3. Big Hero 6 manages to make you cry early on in the film. This movie blew my mind away, with its story telling, and compelling amount of characters. You will cry, laugh, and cry some more. The movie has all the adventure you could ask for. A fun one to watch, over again.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hadn't seen this movie until now and it was AWESOME! BIG HERO 6 delivers!",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely among the greatest CGI Animated movies to come from Disney Animation Studios. Very fun and original, ",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Agreeably entertaining and brilliantly animated, Big Hero 6 is briskly-paced, action-packed, and often touching.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a sophisticated animated family movie created by Disney filled with happiness and sadness throughout the movie featuring superheros taking on a villian. It is overall a pretty great animated family movie, but it is filled with some crazy emotion for a family/children movie.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney's redundancy on their classic recipe still remains profitable. Great storytelling and an appropriate balance between comedy and seriousness.",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was just okay. Only kind of interesting. I couldn't really get into any of the characters. The animation was nice so young ones may really like it. I think it's overrated. I wouldn't watch it again.",
            "review_date": "2020-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "（8.5）It is an exciting movie.",
            "review_date": "2020-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great animated super-heroes movie",
            "review_date": "2020-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was actually a good movie also dan and Phill is in it yay!",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Love This Movie!! So Much Heart... Great Action, and Very Funny!!",
            "review_date": "2020-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loose story, distractive sub characters, hard to get into main character's situation. Though, the magnet robots were cool.",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, extremely fun and exciting, Big Hero 6 has a great direction by Don Hall and Chris Williams, a beautiful script by Jordan Roberts, Robert L. Baird and Dan Gerson, a memorable soundtrack by Henry Jackman, mind-blowing action scenes and a excellent dubbing cast and, in addition, it manages to be one of the best Disney films of the last decade",
            "review_date": "2020-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie It kind of shows what the future can look like and I love the story line, very suspenseful",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly didn't like that this was just a prolonged add for Michelin tires. but I don't know why you put a monster.  But also why did it have the brother die.",
            "review_date": "2020-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie ever made!",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A boldly entertaining crowd pleaser from Disney Animation that is sure to leave audiences with all the warm, fuzzy feelings, and tugged heartstrings, that they could possibly desire.",
            "review_date": "2020-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is unlike any other superhero movie. A. Kids are the heroes B. Its animated in 3D animation C. It doesn't take itself so seriously like Marvel, DC, and those other no name companies trying to be cool by making a movie. Big Hero 6 was funny. It had good action. It was enjoyable. Younger kids will enjoy it more than adults, but I can see adults at least enjoying the film. My one complaint. Characters. Yes, Baymax and Hiro were fine, but it isn't very believable that the college kids that have never really fought are all of a sudden great fighters and can take down the microbots that easily. Hiro and Baymax are believable. Baymax is the robot who can fight because of the chip. Hiro doesn't do much without Baymax, but he took off the mask by jumping off Baymax. That's believable. I guess Go-Go I could see doing good in the fight because she probably took her wheels or skate things out for rides and got good at riding them. Then there's germophobic, neatfreak Wasabi. There's no way on Earth he's gonna fight great. Then comic book lover Fred. Fred sits on his butt reading comics all day. He's not going to be a great fighter. I don't think Fred could have done 20 push  ups. But at the same time, it is the suit that does all the work so I'm torn on him. Outside of that, it was a great film and it was very enjoyable.",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun! Predictable but fun! Didn’t know what the story was about. So it was also as refreshing as it was predictable. But the city San Fransokyo was as dumb an idea as I’ve seen. ",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was already sold when I heard Fall Out Boy's theme song in this.",
            "review_date": "2020-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This little animated movie has more heart than 90% of Hollywood blockbusters.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was ok. the characters were very undeveloped",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Animation was fine.  The beginning was interesting, but I had to turn it off cause it was boring.  The story was boring and characters cliche.  A science lab with a surfer dude?  Everyone wants to be heroes?  Couldn’t finish it.  Shocked at the positive reviews.",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE Big Hero 6 it has such good action and humor and heart. It is one of the best Disney movies and it is just a really good superhero team up movie!.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally such a good movie.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an action movie but emphasized with brains over muscles, and this one aspect made it a great movie altogether. Marvel met Disney -- who would have thought it would be possible?",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BROTHERHOOD! This is the theme of this amazing movie, and I loved every bit of it. Also, where can I get a personal Baymax?",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hiro, a robotics prodigy, joined hands with Baymax in order to avenge his brother's death. This led to an amazing turn of events, full of Disney magic that everybody can't resist.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baymax, how could you not resist this adorable being? He is the main star of this movie (sorry Hiro), and no one can challenge me for it.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming decision by Baymax until the end. Hiro's well-being was his top priority. That \"Are you satisfied with your care?\" hit me hard.",
            "review_date": "2019-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smartness overload! The technology and talents of all the characters were beyond my comprehension. GENIUS!",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ADORABLE! How could a giant white robot with an expressionless face make someone feel better? Sometimes, presence is all that matters.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie taught me the essence of confidence and perseverance. If you put your heart and mind into something, things are possible.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tadashi was a brother I never had. He's been a very important character in this movie, and it was so smart of him to build Baymax.",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is yet another successful Marvel.. errr.. I mean Disney comic book movie. Typical Disney shock opening and a slow but steady rise to the protagonist's full potential. TJ Miller is a delight and how can you not love Baymax? This movie feels and is familiar in a lot of ways, which I believe gets in the way of BH6 being truly special.",
            "review_date": "2019-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6, a film where I can say, that went to my list of most loved animated films! The way it tugs at the hearts of everyone, and not just targeted to the kids, made it pretty awesome. And honestly, we just loved the movie because of Baymax, come on!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I just got forced watching this movie by my child, and I'm glad I did. This movie appeals to all ages. It combines this one amazing animation, writing and a set of characters that are full of personalities that will make you love them a lot!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has a way that teaches you life lessons even though it was an animated movie. A lot of human emotions were involved in this one, and I gotta admit, I maybe cried a little.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply amazing! The relationship between Hiro, the main character, and Baymax, the robotic nurse his brother left him, was special and entertaining. A great film, one of the best.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I never thought I would see the day a movie made by Disney based on Marvel Comics will happen. And I'm glad they did! It is a fantastic film for everyone, and Baymax is one of the most entertaining characters that I saw.",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BAYMAX!!! I would pay a lot of bucks just to hug that adorable and lovable robot! This film is not just a kiddie movie, but has an emotional take that is perfect for both kids and adults alike!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie appeals to all ages! It didn't feel forced for me and it entertained me through and through. The Disney magic still lives on!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will say this, Big Hero 6 is definitely worth watching! If you love Disney and Marvel, then this film is definitely for you. The tandem between the main character and robot is phenomenal and the bond between them made the core of this movie.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming and funny! Watching a connection between humans and a robot who can actually coexist triggered my imaginative side and taught me the value of genuine friendship. True friendship might come hard but this movie showed me a bond through thick and thin.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best animated movies that I have seen so far. Fun story, cool characters and a lot of emotions. Hands down to Disney and Marvel for creating this masterpiece of a movie.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 delivers the hilarious dialogue and beautiful animation that one would expect from a Disney film. Unfortunately, the plot is so thin and predictable that even Baymax couldn't fix it.",
            "review_date": "2019-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit heartwarming than I expected ",
            "review_date": "2019-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want baymax trying to kill the professor scene a little longer, which is really cool. SanFransokyo is really beautiful so I bought the art book (though it contains only a few pictures of the town). I also like the end credit, so I bought a CD of fall out boy. I want to read the original comic book, but I couldn't find it in japanese book stores. It's a shame that Disney Japan advertised this as a \nheartwarming movie of friendship bet a boy and a robot, and hid the fact that this is a hero action movie. It even changed the title to baymax from big hero 6, so the last scene is a little strange in Japan. 日本でもヒーローアクションものとして売ってほしかった。題名変えたせいでラストも変わってしまっている。ランドに折角アトラクション出来るのにコーヒーカップみたいなやつだし…トランスフォーマーライドみたいなのにして欲しかった。",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As unwaveringly heart-wrenching and equally action-packed as possible, Big Hero 6 is another bold step forward for Disney's animation department.",
            "review_date": "2019-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificent movie filled with powerful emotion and outstanding animation.",
            "review_date": "2019-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie love Baymax people keep complaining no one cares about the other characters and say they only care about Baymax thats so not true. I love the storyline of it just a perfect movie in my eyes",
            "review_date": "2019-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the only mishap in this movie is the horrible Disney twist villain. Probably the worst disney twist villain ever. Doesn't have any good motivations, doesn't care about harming others and doesn't even have human thinking like \"Oh maybe i shouldn't murder these kids and i feel remorse for my actions\", well no he has no remorse whatsoever and it feels like a robot.",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's freakin' awesome.",
            "review_date": "2019-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the sweetest and deepest cartoons of recent years, although the plot is more or less always the same here differs on the fact that to change is not only the protagonist but also his robot friend and in general suit the 'team', that this film although funny is very sad especially at the beginning and reflects the folly of man",
            "review_date": "2019-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was absolutely amazing I absolutely loved it I definitely recommend it big hero six gets an A",
            "review_date": "2019-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starts strong and kinda fizzles off in the 3rd act. ",
            "review_date": "2019-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite Big Hero 6 being non-canon to the MCU, it's still a big load of colorful animation, humor, and touching moments! Whatever happened to making good villains, Disney?",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creative, fun, and action packed!",
            "review_date": "2019-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best modern animated Disney films out there. The setting is phenomenal, it manages to be both futuristic while also staying completely feasible in our own world. It makes a sort of superhero origin story sort of thing but has it feeling like a friendship based Disney adventure instead. The ‘loss of parents' hero trick is overplayed but here it is flipped on its side where our hero starts without parents and loses family in the same story. Baymax is a lovable sidekick and each of the side characters manage to leave the spotlight to Hiro while also developing interesting and unique personalities that the audience is able to find some of themselves in. The villain has a good motive and while not amazing is still good enough to hold his own in such a fun movie.",
            "review_date": "2019-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far the worst movie i have ever seen in my 13 years of life if you like this movie i will personly come tou you house and eat all of your food and slap your butt so hard it will be as red as a tomato",
            "review_date": "2019-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a animation film. The story is about a boy ho build a robot ,one day happends an accident and the robot goes to his brotherand than has many adventures. The main characteresare Baymax, Hiro ,Gogo,Tadashi, Honey and Fred. This film is very good and funny because has many jokes.",
            "review_date": "2019-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this film. Probably aimed at a younger audience, but i enjoyed it nonetheless",
            "review_date": "2019-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite Disney movies! It shows us a lot of different themes in an utopian world. It maybe has some problems with characters, other than the protagonist himself. Like the villain is almost not foreshadowed and kinda comes out of nowhere.",
            "review_date": "2019-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can still remember.\nIn January 2014, I was looking for a coming soon movie. And I saw this with only an interesting trailer. Well...I was waiting for this movie until it came to my nearest theatre. This movie makes me feel like \"I wanted to go back to see this movie again\" because it's the last year to being with my friends before they were going to seperated to other schools. And if I could go back to that time, I could see all of my friends again.\nAnd that also was my best winter memories.",
            "review_date": "2019-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good animated movie!",
            "review_date": "2019-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the characters!",
            "review_date": "2019-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love, lose, and super intelligence. Baymax is AMAZING.",
            "review_date": "2019-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am totally down for Disney animation trying coming book adaptations, and the end result is something very mediocre. To be fair, there are some positives. The animation is gorgeous with a very vibrant world to suck you into it. There is also a great establishment of character connection between Hiro and Baymax. But the execution dipped the films quality. It has many cliches to its already somewhat predictable story. The pacing is extremely weak and inconsistent. There is also many supporting characters who don't really have any identity or connectivity to situation and circumstance. I still recommend seeing it, but don't be disappointed if the end result is just alright.",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good unexpected surprise from Disney!",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a Disney film directed by Don Hall and Chris Williams. Good and stedy voice acting. Okay characters. Some are fun and interesting but the others can be a bit annoying at times. Good cinematography with some cool shots. Really good animation with the detail and how the characters move. Good setting with the city. Good style with the colour scheme and character design. Good sound design like all animated Disney film. Steady dialogue. Steady editing. Okay music can be good and points and really irritating. Steady story with some plot holes. The comedy falls flat a lot of the time. There is some good atmosphere but thats only toward the end. The film is also a little emotional. The film is also quiet enjoyable. There are also some problems with the film and plot. Over all I give it a 5/10 - could be better",
            "review_date": "2019-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is very well made, the animation is beautiful the setting is unique, the relationship between boy and machine is genuinely touching, and it does tackle the issue of loss in the family. But it just doesn't grip me, nor does it stick with me in any dramatic or comedic way and I often find myself struggling to remember too much that happens. I apologize guys but I can't seem to see what you guys see in this one.",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fall out boy? Japanese? Science? quality. Its a bit sad but the marshmallow thing makes up for it.",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced, action-packed and often touching, Big Hero 6 is a hidden gem from Disney's animations.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not Disney's best movie, but it had a good theme showing revenge is an empty pursuit",
            "review_date": "2019-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good story and world, hope to see more from this IP.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manga-influenced, team-based teen superhero antics with an emphasis on engineering over fantasy and mysticism. Nobody's struck by a meteor or experimented upon by the government, they're all just classmates at a prestigious technical school with a very specific set of strengths and passions. That's refreshing, both for the way it keeps the story grounded and for the limitations it places on the core characters. They're each decidedly human, even the cute inflatable robot whose personality is dictated by a memory card. Paired with a bright, friendly sense of style and a spacious, unique world that's loaded with fun little surprises, it's a visual and conceptual triumph. Unfortunately, the greater plot runs a bit generic, its well-worn twists and turns telegraphed a mile away, so those quirks and design touches are leaned on quite often. It's well-made, good natured, unique in a very crowded crossroad of genres, but too complacent and vanilla with its storytelling. Given a little more ambition, a sequel could do really well.",
            "review_date": "2019-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Big Hero 6' is a new Disney classic with a Marvel twist. It's just so touching to see a robot have such a connection to humans like that. It's hilarious, emotional, and a fun movie for the family.",
            "review_date": "2019-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A super hero movie I genuinely enjoyed! It was the unique characters that made it so entertaining. It's a shame they all got pin holed down into a defensive fighting machine.",
            "review_date": "2019-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartening and hilariously brilliant movie that's full of family entertainment.",
            "review_date": "2019-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite animated movie ever. saw this after Spiderman into the Spider-verse and liked it even better than that, although the styles are very different so it's apples and oranges. Both are great. I just preferred Big Hero 6.",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of fun with an adorable title character and a creative blend of superhero tropes with homages to Japanese animation.",
            "review_date": "2019-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Purpose of plot: maximize fun, cool stuff and special effects.",
            "review_date": "2019-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing animation and powerful acting, just how Disney should always be",
            "review_date": "2019-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Funny and Entertaining film",
            "review_date": "2018-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful animation, heartwarming moments, memorable characters and some genuine humor make up for middling and predictable story.",
            "review_date": "2018-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best animated Disney movie I have ever seen action packed funny, humor and tears in every sad moment amazing movie 100% certified fresh",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would have given a good four and a half if it weren't for the ending. I feel like if they had Baymax deliver a crushing blow to the villain, it would have captured my attention more",
            "review_date": "2018-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really didn't know what to expect from this movie. I couldn't see how this group of nerds and misfits could form a superhero team. Hiro has charisma and his brother's being the well-liked genius helped sway them too, but a superhero team they did become, fighting the good fight against the villain who stole Hiro's tech. Baymax is wonderful, with a heart as big as the sky. I loved all of it.",
            "review_date": "2018-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My personal favorite CGI Disney film yet because it's beautiful, funny, heartwarming, and proves how Disney can make superhero movies.",
            "review_date": "2018-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It gives adventure that’s satisfying",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is one of the best movies Disney ever made. Couldn't love this movie any more. Great protagonist, awesome plot, and and a air robot that would be awesome if it actually existed.",
            "review_date": "2018-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a fun film thanks to it's action scenes and touching storytelling.",
            "review_date": "2018-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh, not bad, not great either. The years of hype from friends before watching this led me to have absurdly high expectations. However, I do want a Baymax companion in real life.",
            "review_date": "2018-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 was a comedic, fun and enjoyable film. The setting and characters were interesting and lovable, while there were many new concepts and ideas which were crafted beautifully, making the film a beautiful piece of art. The story and villain were a bit predictable and general, however, the film was still enjoyable and entertaining, with many funny gags that made it all the more enjoyable.",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We should all be so lucky to have a caretaker like Baymax when we suffer a horrible loss.\nThe adventure is relatively safe and predictable, but the goofy superteam way his new college friends help him deal with the los of his brother make it work.",
            "review_date": "2018-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strengths: We keep running into animated films with plenty of heart and Big Hero 6 really tugs at your emotions. The relationship between Hiro Hamada (Ryan Potter) and his brother Tadashi Hamada (Daniel Henney) is established early and plays a pivotal role in everything that unfolds. Of course, the relationship between Hiro and Tadashi's robot, Baymax (Scott Adist) is even more important. Without it, Hiro may not get past what happens to his brother. Baymax is such an endearing character. Everything from the voice work to his actions to his design is charming. You can't help but love him. The rest of the voice cast is great. It includes strong work from TJ Miller (Fred), Jamie Chung (Go Go), Damon Wayans Jr. (Wasabi), and Genesis Rodriguez (Honey Lemon). The animation is top notch and the sound track is great. The twist when it comes to the antagonist is well done and really adds to the emotional impact of everything that happens. The action scenes were also much stronger than expected in a film like this.\n\nWeaknesses: It can take a little long to get into the meat of the story, as it's about half an hour or so before Hiro and Baymax begin to team up.\n\nOverall: I ended up liking this way more than I expected. It's a wonderful, charming movie that does almost everything right. There's a lesson to be learned, a character arc for our protagonist, lots of action, a cool twist, fun characters, and more. I want to go out and buy this immediately. Incredible.",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fairly standard as (animated) superhero things go, but a great deal of fun with a nice postcyberpunk(!) edge. Plus, I love that they didn't just use the Asian aesthetic visually, but wore the influence in the story too - in some ways, it reflects Astro Boy, both in the general idea of \"robot as substitute for dead relative\", and in the tragic origins of the dynamic, that they both share.",
            "review_date": "2018-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being an avid movie watcher, by saying this movie is in my top 3 favorite ever, speaks for itself. I wish they would make a second... and maybe they shouldn't. This movie is a true gem.",
            "review_date": "2018-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 was the best movie of 2014 I thought the trailer was great and then I new I had to see this movie every one will enjoy it! Now I do you consider this a mastery movie you will find out why it’s like a mastery. I really hope they will make a SQL to this movie! Every time I watch this movie I laugh hard and fall on the ground still laughing, it is a sweet Comedy!!",
            "review_date": "2018-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an underrated animated film that needs to be discovered. The script is great, characters are very well etched- dare I say I even got emotional.  This film may not have a great marketing budget or recognizable voice actors but do not let this interfere with your decision to give it a shot. (An underrated animation film destined to be a cult classic)",
            "review_date": "2018-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and Entertaining movie! Great animation!",
            "review_date": "2018-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie but it could have been better with a small amount of effort.",
            "review_date": "2018-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie! Watched it like so many times!",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wrote this one off originally, but man did I love it when I finally watched it. Disney does a phenomenal job of doing a great super hero movie without Marvel doing all the heavy lifting.",
            "review_date": "2018-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's cute, funny. and even a bit emotional. Baymax is an incredibly loveable and endearing character.",
            "review_date": "2018-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining to say the least. \"Big Hero 6\" is not only fun but fresh as well. Not only will the kids enjoy it but the parents as well.",
            "review_date": "2018-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good. It had some unexpected humor and I couldn't help but laugh! I know it didn't have A LOT of original humor, but a good family movie altogether!",
            "review_date": "2018-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good funny, family friendly movie",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and sentimental. An exhilarating adventure of two very lovable characters. A must-see film for all ages.",
            "review_date": "2018-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great soundtrack.",
            "review_date": "2018-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst Disney movie",
            "review_date": "2018-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something for the kids, and Mum and Dad too - very interesting and tuoching story!",
            "review_date": "2018-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a great movie for kids and adults. Very cute and so touching",
            "review_date": "2018-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie really funny. You can watch this movie more than once and its still funny.",
            "review_date": "2018-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Childish logic, limited mystery, timid yet managable stakes (in which no one really \"dies\" or, in the film's PG vernacular,  \"is gone\"), an alarming absence of acrophobia (because 3D), and the need to science the shit out of everything, along with a plethora of Family Guy Awkward Pauses, cause this lightweight superheroic origin tale to sail as breezily and haphazardly as the deflatable vinyl balloon that is the robotic sidekick, Baymax.  Strains of Disney's \"STORY ACT STRUCTURE: INITIATED\" coding might as well count as \"Hero #7\" of the empowered sextet.",
            "review_date": "2018-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A depressing low point for the studio, Big Hero Six is an insult to Disney's legacy. Full of completely hollow characters, a predictable, painfully cliche plot, a genaric uncreative rendition of the source material, and one too many Fall Out Boy songs, this film utilizes the sterile visual style Disney has insisted on using for several films now for the sole purpose of selling AdORaBLe toys and blushes of its talking marshmallow.",
            "review_date": "2018-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie helped me grieve the loss of my dad. It truly is a masterpiece that holds hidden power to heal. This will always be my favorite movie. It was since I first saw it in theaters.",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "odd yet enjoyable movie is tons of fun for families, action, humor, and fun galore",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney just created a few new lovely characters, can't wait for the sequel",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loses its way a little in the second half where it descends into generic superhero stuff but this is still a strong family offering.  Covers things like grief and anger which is to be applauded and Baymax is a really wonderful character.  My 4 year old loved it and asked me immediately afterwards 'if we could watch it again one day?' always a sign of a success.  Thumbs up for our movie night.",
            "review_date": "2018-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is such a clever and well made animation with a great story a beautiful animation. filled with very likeable characters and unique scenes that make this film really entertaining, heartwarming and sometimes sad but stays really funny throughout.",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 is such a great movie you will laugh a way when you see it. The trailer is good to this movie. I consider this movie to be a Ministry movie if you watch it you will find out why. My favorite character was Hero he was sly and funny and crazy but hay I liked it! You know I really recommend watching it. So what I hope they do is make a SQL",
            "review_date": "2018-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. this is the best Superhero movie with a good plot that surprised me a little bit.",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Crosses arms and smiles) Well done Disney! This is how you make a movie. You went from the overrated too cold flop that was Frozen, too a Marvel based action packed 102 minute movie! I would absolutely love a sequel. Please.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty average movie. There isn't anything very unique or remarkable about the story. Aside from Baymax, none of the other heroes were very memorable and appealing. The story isn't very original, it's just typical superhero cliche and the plot twist is lame and predictable. Something about the movie made it kinda boring including some fast paced scenes. On the positive side, Baymax is probably the best part of the movie. His warm, caring nature makes the audience wanna reach out and give him a big hug. I also love how the film takles loss and acceptance in a child friendly way. The city itself is eye candy, I love the creativity. Overall the movie isn't spectacular but good enough for pass.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an incredible film, with action in almost every scene. I loved this movie, because of Baymaxes' humor.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Family, friendship, drama, and humor.  You could not ask for anything more.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE this film for it's characters and visual style. It's full of fun and important character-building moments that draw you into the world",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of 2014, Fun for kids and adults too",
            "review_date": "2017-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's okay. Not the best Disney movie.",
            "review_date": "2017-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good movie!Big Hero 6!\n   First of all, I would like to thank Disney.\nThank you for making a story in which robots make friends in the virtual world of Japan. It was an interesting work that destroys the fixed stereotype that it is disney animation for children anyway. In recent Hollywood, except for the exception of \"Chappy\", roughly the robot is called \"cruel monster\"I think that I treat it as.\n   About this movie, I want to tell you something. Baymax is so cute! Looks are very soft and people who see him be healed definitely.\nAnd this movie is beautiful picture so everyone is attracted by it. I love it, so I have seen this movie for 3 times and I almost perfectly remember this story because this movie makes everyone wants to see again. \n   Before I saw the Big Hero 6, I thought this movie is just friendship story of a boy and robot because I was fooled by a preview of this story. But I think I was fooled in a good way because the robot fights the enemy with weapon. Additionally, it flies! It's also hero story! And the characters in this movie are unique. Baymax is fat, and his stride is very short and cute. And kindness as a care robot. For example, when Hiro feels sad or bad, Baymax cheer him up. Sometimes Baymax hugs him to make happy. Everything lovely! The main character of this movie,Hiro. He is only 14 but he has a great brain but sometimes he got angry as a child. And then, he organizes \"Big Hero\". This team is consists of 6 people. Each characters are very unique and strong. \n   First of all Honey Lemon. She is a Chemistry genius. Medicines her make, is help them. Second, Gogo Tomago is a very tough and strong girl. She always chews gum, and she can do anything by herself. Third, Fred is always joking around and manga geek. He raises the mood of the team every day. Last, Wasabi is a big powerful boy. But also he is smart and his fighting skill is the best in the team. \n   After all, science is only a means. The robot is the same. It is only means.\nThe thought of the maker and the person who uses it makes it good or bad.Come and have children watch this movie.Please look at the endrol until the end.\nThere is a good thing.",
            "review_date": "2017-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie directed by Chris Williams and Don Hall and is Marvel comic. The movie includes elements of emotion not only comedy and action. The setting is a fictional city \"San Fransokyo\" mixed Tokyo in Japan and San Francisco in the U.S.A. There is a boy name is Hiro Hamada, and he is a robotic prodigy. He has an old brother go to the technical college name is Tadashi and Hiro admire him. However, unfortunately, Tadashi was dead suddenly because fire accident happened at the College and he tried to help the famous robotic professor of his college and also he admired. Hero was very disappointed that he quit robotic work. One day Hiro finds a strange junk, so he opened it and there was a big robot. It was made by Tagashi, and the big robot is Bay-max. Bay-max is a nurse robot that protect people have hurting heart and body, and it tried to heal him little by little.\n     I think one of interesting points of the movie is setting because there were a lot of Japanese elements like three?dimensional sign board. In Japan there are many kinds of three-dimensional sign board, for example, sign board shaped French fries of McDonald's and sign board shaped crab of a famous crab specialty restaurant in Japan. Also, sometimes these are moving or flashing. These are something particular to Japan, and we can see only in Japan. Of course, San Francisokyo was based with symbolic design of San Francisco. \n     In addition, I think Bey-max is also point we should pay attention to. He is very cute, after all. It says that the shape of a Japanese bell was used his face as a motif, also the directors thought of the cute robot because they were inspired by cuteness of Japanese electronic rice cooker. Therefore, we can enjoy that how is Japanese culture. \n     As I wrote, there are much detail in the setting and characters of this movie, so adults can enjoy the movie by these points not only children and I rather want adults to watch the movie. Some people have wrong thought that Disney movie is only for children, but they may guess it is not by the movie. I think it may be good that parents watch the movie with their children, and have a good time to find interesting points together because it will be learning that touch different cultures for children.                        Every time we watch this movie, we can find interesting points we didn't notice before, so we never get tired of the movie. That is the strongest point and is the best compliment for movies I think. I promise that many people can enjoy and feel something by this movie. Did I make you feel like watching Big Hero 6? If so, you must watch it!",
            "review_date": "2017-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6: Irking in a familar rehash on better superhero films that adds nothing new to the gerne.",
            "review_date": "2017-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What\u0092s not to like? It doesn\u0092t break any new ground but it\u0092s a solid animated feature.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is my favorite animation. It or relatable and touching. Love it",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a Emotional and Action-packed story, brilliantly crafted animation, Lovable characters, and a great score. Big Hero 6 is a great movie for Marvel fans alike and Disney fans as well.",
            "review_date": "2017-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am satisfied with my care.",
            "review_date": "2017-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FAV MOVIE OF ALL TIME!! ANIMATION, COMEDY, ACTION AND LOVEABLE CHARACTERS COMBINED TO PERFECTION???",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 was so funny now when I saw this I considered it to be a mystery movie you have to figure out who the bad guy is that's what makes it A good mystery movie, see this funny movie!",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The super hero story feels fresh!",
            "review_date": "2017-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best modern Disney films out there",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty interesting turn on the superhero genre, it's a funny lovable roller coaster ride.",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is brilliantly animated, has great action, and has a great story! I recommend it!",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is a fun super hero movie that the whole family can enjoy. It some fun and entertaining action sequences and the movie doesn't get violent except for some mild animated action. The movie also has some hilarious moments. Big Hero 6 really is a treat. It has a good story, has funny moments, a good heart, and it's entertaining. Big Hero 6 is a movie the whole family can enjoy. I don't think it's the greatest movie of all time or anything like that but it's still worth your time. A-",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super funny, fast-paced, entertaining, and mixing science and technology, showing us the modern day advances, Big Hero 6 is another great entry to Disney's large canon of amazing movies. \nWith appealing characters, stunning animation and being often touching is an awesome movie to see!\n\n|It's an 8,6 out of 10|",
            "review_date": "2017-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Likeable animated adventure.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Style and substance combine in Disney's unlikely, superhero adventure.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure why it took me so long to watch this one!  Super cute.",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty enjoyable film. There is some stuff that tugs at the heartstrings and lots of action.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 has many flaws and cliche plots...but it's still enjoyable for the family.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a heart reanching movie",
            "review_date": "2017-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can never go wrong with a Disney Movie and this movie \nis another example of it GREAT JOB",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the emotions are processed with this one.",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is fun for all audiences with its action, humor, and sad moments that feel deserved throughout this film.",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With it's great CGI, great voice acting, and good development, this film is one of Disney's best late films, even if the story is a bit too predictable at times.",
            "review_date": "2017-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still and always will be the best Disney movie of all time. I don't care what the critic reviews say this movie is a true masterpiece. Showing that no matter what happens in your life you need to do whats right. Also introducing the most lovable character in movie history. The basis for the movie is so unique compared to most other Disney movies. 1000/10 for me",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't think about it too hard you will love this movie.",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can never go wrong with a Disney Movie and this movie \nis another example of it GREAT JOB",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(4.5 out of 6 Stars)\nWhen we see a futuristic world where we are among robots, that we see who is the better fighter. When what we don't see could kill us when we are in disguise, seem small but very powerful. When we see somethings we are not welcome when we are in illegal activity and young in a big underground business. When what we see is state of the art when we need to see and move faster then our competitors and ourselves to build the next best thing. When we see every small component can be used to serve a different purpose when inventing and innovations can create all what's new that we don't see the possibilities. When we see what we invest in technology we invest in the creators when we have great minds that come together to see us through to the future. When what others see in us we see in them when the industry paved way for other great minds and inventors that we attach ourself to based on their technology. When we see technology can be used for good and for bad, meant to serve a purpose for humans. When we see all what technology is capable, to see we fo it right. When what we see others see to get their hands on what others dont see to make a fortune on. When we see who sees the responsibilities of today's technology, to make they are safe for all  we see we value the invention rather then the profit in what we make. When we see we can make technology see things we don't see to not have it when it counts. When what we don't see we wish technology was there to see to steer us a direction we ought to be seeing. When we only see technology serving us when what makes us down we see we can find another purpose it can serve when it makes us up. When we see technology is able to learn and communicate fast able to adapt to new surroundings and able to be compact enough to go anywhere. When we see some technologies don't take much able to fix itself but not other things it has no control over when it needs more power then what we see exists today to hold. When what the world holds and knows we can capsulate compactly to take with us everywhere we go. When we see holding such technologies others want to hold to serve themselves to put others in harm who competes with them. When we font always see the ethical side to technology as others when humans are built differently then their inventions. When what we see we can't believe our eyes when anything is possible when we can co exist with anyone even technology to fit in well with society. When we see in various perspectives to get a better view on our technology we see where we can head with our inventions. When what we can't see what technology does when it's put to use when it can make us a hero or villain when our eye is on a greater power we seek. When we wish technology could see everything we couldn't see to know what to prepare ourselves for when their our various perspectives and calculations that can lead us to a different result then what we initially see. When we see technology has its strengths and weaknesses to only improve on both. When what we once though impossible, we see possible when we connect the right technology to it calculation to change the world what we now can see is possible. When we see some technologies only lead to more technologies along with it, it can suck us into what we don't see what we are capable of seeing when it can go wrong or go right but hard to see. When competition leaves us with decision to speed up or slow down what we don't know to know to get the lead in the latest eat thing we know in technology. When we see the special connection between the creator and it's invention to see that it serves more then the purpose it is meant for, but to serve a purpose to inspire the next future inventors to see what technology is meant for. When we see the connection between the master & emotion that can lead technology into various paths on those who hold control. When we see only way for future generations to see good in inventions is by showing how wrong others see it and use it that we lead them to the right direction. When we see destruction is only means to construction of what technology is linked to, to see only fear the person behind the technology. When we see what we don't know we need technology to see for us when venturing into inhabitable we rely on them. When what the world contains and poses challenges to we either compact ourselves to withstand to go further or just pack enough to what we only necessarily need to stay back when we are happy in what we see now that matters for our today. When we see what others see when we bring technoligy to life a creation that is meant to connect with the human inside of us.",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An adorable, predictable, reliable kids flick with excellent side characters and a standard villain. I'd watch more adventures with this team.",
            "review_date": "2017-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It begins losing steam in the end, but overall very enjoyable.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The twist villain is bland, forgettable, and predictable, but the story is very engaging with some highly emotional moments that will likely leave tears in your eyes, the animation is great with a lot of creative designs, and the side characters are all really likable and memorable.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite my moral problem with this film's antagonist being an educator, rather than the greedy capitalist, there is so much fun energy, along with heart-warming relationships, that I'm forced to love it.\n\nThe wonderful scene of the masked marauder chasing the car overpacked with our heroes is proof that action movies, which take themselves too seriously, suck.  When the humor element is added, more can be done with a chase scene than the conventional film allows for.  We haven't had a chance to know the rest of the team, the film has centralized around Hiro's relationship with Baymax.  This chase scene cleverly uses the animated nature to both give us a fun, suspenseful pursuit while developing the other characters' personalities and values.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good animation but the setting of the movie and actions/success of the boy seemed to far fetched to hold interest. The movie from middle to end seemed like it was going for a blockbuster kind of style, but why even try, block busters are weak, animation can be used much more effectively than that. \nGags with the big hero were great",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Melding comedy and drama perfectly, Big Hero 6 is a surprisingly mature film with luscious animation. The voice work is great, and the characters are well realized. This is a great animated movie.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really nice and tender relationship between the brothers and their aunt. Great cast of characters all with their likable quirks and personalities. Different kind of animation, but still really liking it. Looks smooth. I love the concept of Baymax being the nurse of the future.\n\nWhat an inspiring and wonderful presentation that was with the micro bots. Very creative. That's what keeps this world going, creative people who are also innovative and want to do good in the world. Holy shit, I was not expecting that twist when the building blew up.\n\nBeautiful colors and designs in this movie. Great action sequences full of energy and motion. Holy crap, that was crazy when Baymax got the Tadashi card taken out of him. It was like he became The Terminator, a killing machine.  This movie is a great reference to Dr. Otto Octavius from Spiderman, only it was his daughter, not his wife. \n\nI would so look forward to the afterlife if it looked like the inside of the that portal. The part when Baymax goes in with Hero.\n\nWonderful movie filled with emotional moments and a really colorful cast of characters. I can see a sequel being made for this movie.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun loveable superhero film that is worth watching. It's a film that will make you laugh, and make you cry. The group of heroes in this film have great chemistry and each give pretty good performances. However, none are as good as Baymax, the cute, huggable robot that got people to see this movie. Despite having a very forgettable villain with a vague plot, this is still a film many will enjoy.",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tale of love, loss and friendship. Worth watching.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i see why they awarded it best animated film by the academy awards and the kids choice award for favorite animated film i watched the whole thing in the theaters and i loved it and i'm already looking forward to the TV series and any potential sequels",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the film, liked the plot and the cast of characters. Disney turned a unknown superhero team popular with a tv show coming out soon. Can't wait!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At some point in every person's life, they want to be the superhero with a cool power and save the world.  The film Big Hero 6 shows the life of a few kids who become superheros with the power of their brains.  As Hiro Hamada starts the life of Bot-Fighting, he realizes his potential as he visits his brother's \"nerd school\" and meets his smart friends.  They all are developing new inventions with new technology that we would like in our world today.  \n\tWhen tragedy strikes Hiro's life he discovers a mystery concerning his new invention of the microbots.  Teaming up with his nerd friends, they create their own superpowers using their new technology.  And don't forget Baymax, the big and puffy, personal healthcare assistant.  As friends, they figure out who stole Hiro's idea and the story behind it.  This mystery in a sci-fi world shows the power of friendship and teamwork.  The fun plotline and development of characters attracts to children, families, and maybe some scientists.  Big Hero 6 is a must-see movie for everyone.  \n\tThis movie is very well animated and has amazing graphics, making it feel like you are soaring over San Fransokyo on top of Baymax.  As for the character development, Hiro learns to cope with a loss and learns that the help of friends can make things way easier.  The technology ideas make you super excited for the future and the inventions it brings.  This movie is also filled with action, causing you to sit on the edge of your seat in certain scenes.  People who wouldn't like this movie would be the old people who startle easily with action.  The action and intensity of Big Hero 6 makes it fun for children and people of all ages to be engaged and excited, but not enough to be too scary.  \n\tThe directors Don Hall and Chris Williams did a fabulous job with this movie.  It is Disney after all, so it has the potential of being very good and turned out phenomenal.  The movie Big Hero 6 was very cute, had some mild action and fun for all ages.  It just might surprise you how well done it was.  With the cool characters that are extremely smart you can find some way to connect to the plot.  If I were you, I would turn on Big Hero 6 right now, because you will not find many better movies, especially to please your whole family.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool action animation film to watch almost everyday",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story: 5|10\nAnimation:10|10\nCharacters: 8|10\nOverall: 7|10.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 is really good, definitely one of the best kids movies of the year, 8/10",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. This movie proves just how dangerous arrogance and revenge can really be, and that there is always an alternative way. This is a really important message for the modern age.\nIt was beautifully animated by Zack A. Parrish, and Dan Gerson, Robert L. Baird & Jordan Roberts did a fantastic job as the lead writers.\nAll of the talented voice actors did an amazing job portraying their unique characters, and it was well directed by Don Hall & Chris Williams.\nNow, this is what I call a good movie!",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining film that hits a lot of the right notes. And not just for the kids.  The premise for the villain is a bit muddled and awkward, but the rest of the film is smooth and well-crafted. Good characters, solid animation. My 4-year-old loved it.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is one of my favorite Disney movies! I love animation & I love super hero movie! Put it all together & you got yourself a Oscar winning movie for Best Animated Feature! The sequel can't come any longer! MUST WATCH!",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly smart and touching throughout. Thoroughly enjoyable.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly I had no idea what to expect of this. When this first came out, the robot dude didnt do much for me in terms of \"I gotta see this\". So I waited a number of years, until I got a chance to see it on Netflix. My goodness, what a lovely movie about a boy, his love for his brother, his love for science, and yes, a big white robot. This starts off a little slow at first, but then when things start going, well, they certainly get going. Great stuff.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good balloon man is deep when with hiro when the team comes together it makes a good movie",
            "review_date": "2017-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was okay not much I want to say for it!",
            "review_date": "2017-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly for animation with a twist in the middle, you'll find Big Hero 6 pretty enjoyable!",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta love it when he fist bumps and makes the noise",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney has managed to create a fresh, animated superhero film that succeeds to the levels of \"The Incredibles\". You will laugh, you will cry, you will not be bored out of your mind. What's really special is that Big Hero 6 brings in themes of love, family, and growing up in this fun adventure that will easily connect with the kids and adults.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney is in the middle of its recent renaissance of films, and this film is one of the reasons why. I heard nothing but praise for this animated superhero flick from Disney, and I couldn't wait to finally get my hands on it. When I was finished with it, I was pretty surprised of how dark it was for a Disney film. There are many deaths that I wasn't necessarily expecting, but it still surprised me. Other than that there are many bright qualities about the film. Baymax is undeniably loveable, and I loved every second of screen time of him. I thought the whole origin and the world within the story was impressive. The villain was intriguing, and the characters were likeable, so there are many likeable qualities to it. The score was also fantastic. I thought the pacing was a little off sometimes, and also the darkness at some points of the film. Nevertheless this a very likeable film that fits nicely in the Disney catalog.",
            "review_date": "2017-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A somewhat Scooby-Doo like plot can definitely be forgiven with the introduction of smart yet cool characters displaying that learning and inventing can be fun not to mention the adorable Baymax! Not only this, the underlying theme of loss and grief are portrayed beautifully in a way in which all ages can relate and understand - definitely a touching yet entertaining movie.",
            "review_date": "2016-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is just as beautifully animated as fans of Disney movies have come to expect...as well as packed full of thrilling action on par with the Marvel Cinematic Universe, full of laughs, boasting amazing voice acting and emotional drama especially early on in the film when our main protagonist loses his older brother in a tragic accident.",
            "review_date": "2016-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is one of the best animated superhero films since The Incredibles. A conventional but fun, action-packed and heartfelt story, great humour, excellent animation and memorable characters. Must-watch for everyone else including Disney fans and superhero comic book fans. 4.5 out of 5 stars.",
            "review_date": "2016-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best films this year i loved baymax",
            "review_date": "2016-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I expected. A real roller coaster ride.",
            "review_date": "2016-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Put lovable characters, sad but exciting plot, and humor for kids and adults you get Disney's Big Hero 6! Mavel fans, you'll love it.",
            "review_date": "2016-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome ! Amazing story, development of characters, and I hope they make a sequel.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "89% Tomatometer (2o16.11) for what???",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked the animation, the music, the story.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally an animated movie that actually delivers an atmosphere of fun, wonder, and truly presents loss and finding",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why do people love this movie? There is nothing great about it apart from Baymax. Everything else is stupid, predictable, and boring.",
            "review_date": "2016-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ok. Nothing special.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one of the greatest movies ever made",
            "review_date": "2016-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet, sometimes sad movie.  Maybe too depressing for little kids.",
            "review_date": "2016-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An animated movie that wasn't about talking animals! I had a lot of fun watching the movie even if there were a few holes and cheesy parts.",
            "review_date": "2016-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an absolutely joyous animation to see with the whole family to enjoy. Following the protagonist Hiro Hamada, the audience is taken through one of Disney's most incredible rides; with clever humour typical of Disney's wit, and heart-warming and emotional plot lines too. It is a testimony to creating a live-action superhero movie into an all-family adventure, where being a geek at 'nerd-school' is what's hype. The stunning colours and visual editing, along with relatable and engaging characters make the film so much more lovable, one can only hope that a sequel is on the cards for the future.",
            "review_date": "2016-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved it especially when she says \"do you have ur turn signal on\" then he says \"you have to indicate your turn it's the law!\"\"",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it!  Baymax and Hiro were enchanting.",
            "review_date": "2016-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the clever animation and fun characters - especially Baymax - that make Big Hero 6 worth watching. It has some cheese and it takes a little too long to get going, but kids will easily love it and adults will be entertained, at the very least. Now if only they'd cut out that Fall Out Boy song, I might have given a half-star better rating.",
            "review_date": "2016-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the best superhero films since The Incredibles (though there were other good superhero movies such as Guardians of the Galaxy and the dark knight trilogy, just saying.)",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is small on originality and has more pride in its animation and fake PG-movie fighting action sequences and Disney-fied special effects than character development or dynamic plot writing.",
            "review_date": "2016-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I have some concerns\"\n\nI think Big Hero 6's main issue is how caught it is with it's incredibly humble premise, that it forgets to set up the world it's created in. This is all very fast moving, even for a kid's film and whilst it is admirably decently animated, Big Hero 6 doesn't create too much depth as to what it is trying to achieve. A generator of sympathy, meaning the bad guy is essentially non threatening at all. It's also a shame that genuinely quirky and interesting characters like Wasabi and Freddie didn't get a whole opportunity to explore their potential as much as they should've, giving warm and relieving addition to their futuristic suits. This being said, Big Hero 6 is solid to entertain, the chemistry between Baymax and Hiro is humble and charming and will please as a family movie. Just don't expect anything too meaningful, it often gets too caught up in sad moments that it forgets the environment it is set in isn't that harmful at all.\n\nB\n\n64/100",
            "review_date": "2016-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny yet touching!  Awesome film recommended for all ages!  Loved it!",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one has the important message that violence doesn't solve anything, but compassion does. And that your mind is more powerful than you think.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Imagination, great story and entertaining, slightly dark nonetheless a good Movie.",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my 3 favourite Disney films. \nA Disney-ified marvel comic sound like a terrible premise, but this movie made my laugh and almost cry (twice) . I need my own Baymax. The action is also very marvel worthy. This is just great",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 offers a lot of superhero actions that sorta makes it similar to Marvel movies!",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nearly typical children's action flick with the youngest as the hero (literally) who looses sight of the right thing to do - momentarily. A few of the scenes are incredibly lifelike - showing just how far animation has come.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I totally called the plot twists on this and I'm loving that because normally I never see them coming. The first thing I was struck by in this movie was how it deals with unexpectedly hard topics such as loss and grief. I guess it shouldn't be surprising because Disney have done that often in movies before, like Lion King and Bambi, but for some reason it did take me aback. It was effective though because it really makes you understand what Baymax needs to become for Hiro and I did get emotionally invested through it. It's actually got big hints of Terminator 2 about it in that the kid's guardian, protector and best friend turns out to be a machine who in turn, almost becomes human. \n\nIn the second half of the movie it turns into more of a generic superhero thing. I'm still not quite sure how Baymax managed to get that chip into his hand at the end without either shutting down, or turning into destroyer Baymax. But for me it's a good thing he did or this movie would have got 1 star for bumming me out. Baymax is actually the star of the show as the poster suggests. He's funny and loveable, especially when he's running around in the warehouse. \n\nIt's a good movie. I won't be in a big rush to watch it again but I'm glad  I watched it once.",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully designed and plotted, as well as being heartfelt without being saccharine (if anything, a bit much for kids).  It occasionally veers into \"designed for the toy market\" territory, but you're in the wrong genre if that's of concern.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now I know why Logan of SuperMarioLogan really hated this, but everyone else likes it including me... well, I thought it was good even if it kinda made no sense. I didn't want to watch it at first, but soon after, I think I can respect what Disney has to offer with their works on it like I respect Disney and Amblin with Who Framed Roger Rabbit. 3.5/5 stars for me.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 doesn't offer all too much a new thing to begin with, but its remotely loose adaptation with an admirable bunch of characters ought to set the benchmark beyond simplistic plot structures.",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly enjoyable",
            "review_date": "2016-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. It was fun, cute, and action-packed. Kids, teens, and adults would all enjoy this animated adventure.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is also a sad with a happy ending story but the characters and the story, it was all very enjoyable. bought this movie for my daughter. she watches it alot.",
            "review_date": "2016-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Disney Animation's finest!",
            "review_date": "2016-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is based off a MARVEL comic book! So I consider it a Marvel Comics movie! Disney's best kids movie yet!! Stan Lee even has a cameo!!",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an Awesome movie",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great plot, special effects, actions, characters it was well done.",
            "review_date": "2016-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 is action-packed and very entertaining. Disney kind of makes a superhero animated movie off of Big Hero 6. Disney also does a great job with the animation to this film. Two thumbs up! I would very much suggest this movie.",
            "review_date": "2016-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very heart warming movie with the right balance of comedy, action, and drama.",
            "review_date": "2016-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike other Disney animated feature films, Big Hero 6 is sci-fi and Tokyo-influenced and packed with supercool smooth visuals. However, with its well-cared characters, this film still brings the original heart-warming Disney spirit deep inside.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotionally potent and loads of fun.",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so great, funny, entertaining. we all really enjoyed this one.",
            "review_date": "2016-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kids Like this movie if they don't like other movies and they like big hero 6.get your kids to watch it",
            "review_date": "2016-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know exactly how to feel about Big Hero 6. While I liked some of the characters, the majority of Hiro's friends were annoying. I loved BayMax but I felt like his character wasn't utilized properly enough. The animation was beautiful (the end scene in the portal especially). The plot was your standard Disney offering (dead parents, misunderstood protagonist, etc.). However, this was a little darker than the average Disney animated film. Overall it was an okay movie that left a lot to be desired.",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's very interesting and cool",
            "review_date": "2016-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good not great... the second half is generic as is the lacking character development of others.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite often being a little bland, forgettable and predictable, Big Hero 6 is an enjoyable flick full of heart that serves as a homage from Disney to the superhero genre, and improves massively over the horrible previously released infamous Disney movie",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Disney movie!! This is better than some of the recent ones though. Great story, and lots of funny bits for kids and parents alike. I thought it was really, really well done.",
            "review_date": "2016-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Animation is stunning! Unlike anything we've seen from Disney Studios in the past. Although the story can feel a bit cliched at times, the film still manages to brilliantly combine action, comedy, and heart into a kid-friendly look and feel. Could be entering a whole new era of Disney animation.",
            "review_date": "2016-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The same old plot structure that we always get from these Disney movies. Some things are different here and there, though there are some flaws too... Definitely not Oscar worthy. Kids will love it; everyone else is getting tired of it.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie deserves 100%, As a grown adult at the age of 46 I have seen many movies, this movie is in my top ten. I will be purchasing this movie to have in my favorite collection",
            "review_date": "2016-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was a few feels",
            "review_date": "2016-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Involving family feature with some novel characters, the plot though is hardly new and not entirely convincing.",
            "review_date": "2016-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best animated movie ever.",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I do find some of the dialogue to be somewhat cringeworthy the animation is amazing and the story is nice.",
            "review_date": "2016-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films Disney has put out in recent years.",
            "review_date": "2016-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a cute movie it's a mix up of many things I really liked it and I'm kind of too old for Disney movies but I still enjoyed it",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adorable movie with a lot of heart, it's a favorite among my family from everyone from ages 8 to 82. Too bad Disney seems to only care about marketing for their princesses",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't think I was gunna. like this movie but I did. It was a really cute movie, but sad too.",
            "review_date": "2016-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You already know going in to expect a high amount of quality, which the film indeed delivers. I loved the mix of Japanese architecture into the San Francisco landscape  (I presume that is from the comic, and that there is a canonical reason for how that came to be.). The film doesn't waste time trying to explain the world. Everything is already established, which is good. The voice cast, unsurprisingly, knocks it out of the park, especially Scott Adsit voicing Baymax. Something that didn't add up for me was why the villain was attacking the kids. His beef isn't with them; Considering his motivations, it seems like trying to destroy the kids is horribly counterintuitive. Eh, I guess you gotta have conflict somehow, but, overall, I still liked the movie.",
            "review_date": "2016-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasabi(Damon Wayans Jr.): My brain hates my eyes for seeing this.\n\nThis a little refreshing and somewhat different that any of the recent Disney flicks. The character are great, the story was good, albeit a little too sappy and predictable, but the animation was smooth-- very nicely done.  Overall, it was very entertaining but a little light on the humor; still pretty enjoyable to watch over and over again.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is sooo freakin cut baymax is soo cute very sad in one point but baymax will make u smile",
            "review_date": "2016-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the more positive side of Disney buying marvel\nSure it's a bit cheesy with the calling out fighting move names as you do them cliche \nBut it's a good flick to watch with the family",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's be honest only a handful of people actually knew the Big Hero 6\ncomics and that's because \"the series was shelved after less than a\nyear. Then was brought back for a mini series in 2008\". I don't know\nabout you guys but I consider that a failed comic book series. The\noriginal was based in Japan after the WWII bombings. The team was\nassembled to protect Japan under command of the emperor. Looking at the\nCharacters you will actually be surprised how similar they actually are\nin a sense. Keep in mind they did change up specific parts to make it\nmore kid friendly and to show kids how cool the Science is.Big Hero 6\nis not only a movie that will hypnotize you with its bright colors and\nhybrid city of San Fransokyo but will also have you searching for\ncareers in Science. \"A large theme of this movie is science and how it\ncan help man kind.\" This is a completely different message you would\nget from reading the actual comic books.",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie deserves a five star! I loved baymax and the purpose of his creation. This movie reminds me of how much I loved Olaf from Frozen. This movie was amazing, interesting, funny, and touching. I would not change anything if I had the chance. It was perfect!",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this film! Good story, and great animation, especially towards the end.",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should watch this movie. Amazing animation alongside a brilliant narrative with amusing yet strong characters.",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like, back in 2014, everyone kept talking on how good Big Hero 6 was and I saw a lot of fan art of the movie in my inbox, so I wanted to give it a shot and watch it on DVD.\n\nBig Hero 6 is indeed a wonderful movie and I found it to be funny and just beautiful. The scene where the brother of Hiro had died in a fire had made me feel emotional in the inside. The idea of calling the city San Fransokyo was just genius to me.\n\nAnyways, I adore most of the characters and they are well-developed in my taste. Baymax was especially my favorite because I found him to be very humorous and a fun character. I would like to have my own Baymax who could do all of that stuff. \n\nThe action was just amazing and I LOVE action stuff. At least it's not a musical Disney movie where you have to deal with the annoying musical numbers and what not. Big Hero 6 is just perfect. \n\nIt deserves a 5 out of 5 and it was worth watching it again. I do hope they would make a sequel, because I would love to that one.",
            "review_date": "2016-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most entertaining movies I've seen in a long time. It has action, adventure, and comedy while confronting some pretty serious issues that I feel a lot of kids go through in one way or another. A must watch,",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have always loved the Disney animated movies, but anyone can say that are not what they used to be once. In the later year we have had great animated features like \"Tangled\" and \"Frozen,\" and now Disney is back with the really good \"Big Hero 6.\" It has been made by some of Disney's best animators and the animation is astonishingly beautiful. The city of San Francokyo is the perfect environment for this film to take place in as the combines the superhero trend from America with the Japanese anime feeling. The movie has an incredible cast, including a cameo by one of the living legends when it comes to comicbooks. I love this movie and it's truly great to be able to watch a movie like this an be entertained from the very beginning to the very end.",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gorgeously animated, well written and expertly paced film that is highly entertaining.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvel from America + Comic book heroes from Japan. This is the original concept and Disney made it very fun and enticing. Yet, one thing to note is that its plot shares so much with How to train your dragon. Just look at the similarity of their leading dual and the bunch of underdeveloped teammates both movie possess. That's what cost the movie half a star. Still, Disney really did the job making it a fun movie, an Avengers movie in animation.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big Hero 6 feels like a comic book based movie, but in this case that is a good thing, as it is fast-paced, humorous and visually stunning.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining and touching film that proves Disney can still make great movies that aren't musicals. My main reason for liking this movie as much as I did was the inspiration from Japan and Anime. Overall a fun film that I can watch over and over with anyone and not get bored. Well done Disney! \n\nAlso an excellent Stan Lee cameo after the credits.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An adorable movie with silly humor, it was immensely sweet and heartwarming. However, plot wise, it brings very little new things to the table.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film. Some plot holes and lack of people during car chase scene make me feel that it was half finished.",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than an average kids movie. Probably best thing to come out of this division of Disney. Worth showing to your kid. The thematic elements were integrated very well considering this division of Disney isn't pixar. I wouldn't go as far as to say it's a classic, but it is certainly nice for what it is. \nSpecifically it is refreshing to see a kids movie that touches on loss in a adult manner, rather than the usual \"you can do anything you set your mind to,\" \"you're perfect the way you are,\" or \"there's good in everyone\"",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a must see, the plot is unique and for once a 'super hero' movie wasn't predictable and felt great to watch.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining and touching film that proves Disney can still make great movies that aren't musicals. My main reason for liking this movie as much as I did was the inspiration from Japan and Anime. Overall a fun film that I can watch over and over with anyone and not get bored. Well done Disney! \n\nAlso an excellent Stan Lee cameo after the credits.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the first Disney/Pixar/Marvel collaboration, this one nails it. Certainly not the best for Disney/Pixar, but the sci-fi/Iron Man-esque theme is a refreshing change from all the princesses and monsters.",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has some fine animation and some touching moments but Big Hero 6's few unique ideas are crammed in with plenty of fun though tried ideas to the point that they are all equally unrecognized making for a predictable, unfocused, though ultimately passable movie.",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw the whole movie about 100 times but I like it",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice family film that ticks a lot of boxes.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie both adults and kids will love it, it was funny, somewhat logical, well animated and heartbreaking great film.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvel and Disney come together to make a funny and exciting movie that appropriate for all ages too.",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought they did a really good job on the movie and I almost started crying during the end. And of Course it was fun.",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney really is on fire right now but don't worry Baymax will put it out for you. Big Hero 6 is heartwarming, thrilling and teaches a lot of lessons about how to deal with loss. It's far more than it looks like in the trailer.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good action ,comedy,emotions etc.It is the best film I ever saw",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Think I'm a bit too old for this.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Disney movie for all ages. Something to watch with the kids without you wanting to leave the room right away. Movie starts off slow after you get past the intro but then picks up rather quickly and keeps that pace. It is Disney, so all plot twists ends up being easily predicted. Still a good watch.",
            "review_date": "2016-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best new Disney Films I have seen, kept the humour for the older generation too.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a modern Disney film I enjoyed, Completely different to what I expected, A very similar plot but done well, Some good humour and animation work, Kids will love it, I can't comment on the 3D as I watched the 2D version, My only problem wasn't nothing to do with the film itself but the fact that Disney has always got ways of being secretly controversial, It's set in San Fransokyo which to me Says that USA never nuked Japan and they won the war and now rule the USA, I know I'm over thinking it but Disney do things like this more than you think, But apart from that it's a great funny action packed animation.",
            "review_date": "2016-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie! The movie was very well animated. It was entertaining as it had tons of action and some sad moments as well. (I highly recommend watching this!) 5/5",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! It was an animation movie that was a little taken after robot and Frank.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many will surely suffer from Frozen hangover, but Big Hero 6 is a lovable, well thought- out movie. 80%",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't really know where this was going at first but I ended up really liking it.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining and some original stuff.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies I've seen in a while. there were some blank moments, but all movies have some flaws right? the movie touched my heart and I hope there will not be another movie, this doesn't need one. don't bring back tadashi,  because it would mean it was a waste to say he so called died in the first movie, please don't make another one. but this movie was wonderful",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok. Typical animated film.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was the best movie i have ever seen. It was heart warming and suplurb! The animation and comedy was well put together and everything was flawless, some glitches here and there, but very good.\nBUT PLEASE DON'T MAKE A SECOND MOVIE, THERE IS NO NEED FOR A SECOND MOVIE! OH GOD PLEASE NO! DO NOT BRING TADASHI BACK TO LIFE, BECAUSE THAT WOULD BE A WASTE OF OUR TEARS IN THE FIRST MOVIE! PLEASE DONT!",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Disney film I've seen in ages. Great fun story about robots. This had a real story to it and was funny and sad. Was a bit like Ironman and Fantastic 4",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant animation , fast paced screenplay and most importantly very much entertaining . An amusing super hero tale",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies ever really creative. (:",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, I didn't like it. What's the matter with me? Loved Baymax but the people were boring and the movie as a whole was too juvenile for my taste.  A lot going on, but nothing I cared about.",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than I had expected. It is slightly unoriginal, but takes the perfect parts from other movies to put together a fun film.",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SUPER COOL I LOVE THE MOVIE but i dont like when tadashi died :( BUT IT WAS COOL ANYWAY THE MUSIC I LOVE THAT SONG INMMORTALS THIS MOVIE NEEDS 5 Stars",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saving the city with some of hillarious geeks and nerds plus an inflatable robot never be same again with Big Hero 6. They saved the city and audiences' heart with its humor and heart. And Baymax is the one you will always satisfied in this movie.",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is how I like my animated movie: smart and entertaining.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bursting with fun, this wonderful animated film has both action and heart. Baymax is a great creation and the whole film serves up energetic entertainment from start to finish.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable. Slows down in second half, but can't hate.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised with this film. Not only was it original, it was funny and emotional too. Great for adults and children alike.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is cute.  Baymax is a character so good that he is an automatic instant classic.  The rest of the heroes are a bit underdeveloped, and the story was a bit predictable as well.  Still, there was a lot to like about this movie and I hope that there is a sequel at some point.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a family fun movie and like the music and a funny movie. This movie was a good movie to see! I would say this movie is a mystery movie. And if you and family see this movie you will fined out why and how!! That it is a mystery movie. Hay I know when I watch this movie I laugh a lot, and I bet other people will as well.",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny and fun for the whole family.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally one of, if not THE best movie I've ever seen. Enjoyed it beginning to end. It has A LOT of heart, it's fun, has robots, has superheroes, it nearly made me cry. If you have kids & haven't watched this with them you are a bad parent. Lol. WATCH IT NOW!",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sad excuse for creativity. jeez guys watch some studio ghibly. the animation is fine but the writing is terribly unfunny and stupid. a lot of this movie make no sense",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is really good with a bit of a mystery to it. It creates a good emotional attachment to the characters so you actually care if something happens to them. The animation is excellent and the voice acting is pretty good too. Overall a very good movie.",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully brilliant, Big Hero 6 will entertain in such amazing ways for Disney fans.",
            "review_date": "2016-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, one of my favorite animated films out of Pixar",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie want to get it on blue ray",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie!!",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun film, but is too unoriginal and the villain really has no big motive.",
            "review_date": "2016-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the first Marvel film from Disney that didn't just build into the Marvel Cinematic Universe. I think the cast of characters made for a really great animated flick and I also think maybe Pixar is on the outs and Disney Animation is making for a HUGE comeback!\n\nHere's pretty much how the plot breaks down: Hiro Hamada is a smart boy with an older, also smart, brother named Tadashi - both with the penchant for building robots. Tadashi is the one who designed BayMax, a robot meant for at-home healthcare and medical assistance. Hiro takes up the challenge of preparing a new technology for Tadashi's robotics school in the hopes of being accepted (he invents nanobots that are controlled through mental electrical impulses), and during an \"accidental\" fire, Tadashi is killed. Turns out, someone broke in and stole the nanobots, so Hiro works together with BayMax and Tadashi's school friends to stop the \"man in the kabuki mask.\" None of this should be spoilers - all details from the trailer.\n\nBig Hero 6 dealt with a lot of really intense themes pertaining to relationships and that's what makes up the majority of people's lives growing up and you see it A LOT in this movie; heck, it's the driving force for the main character, Hiro Hamada. Hiro goes through a lot of change over the course of the film - you see him start out just fighting robots in alleys and stuff and it takes the loss of his older brother (not a spoiler, it was the in the trailer!) and pretty much changing his whole life around for him to cope with it and feel proud of his intelligence and actually do something with his gifts instead of clean out shady gambling rings.\n\nI think this movie has a lot going for it, culturally. We've got a very diverse character set (departing from the comic inspiration) in a diverse, but relate-able setting in San Fransokyo (San Fran + Tokyo; not just Tokyo as in the comic) and themes and plot points that you wouldn't expect from a kids movie (but seem to find their way into more and more these days). I'm actually really proud of animated films that are starting to realize that kids are a little more clued into the world around them; it's the kind of film that gives the audience accountability and doesn't patronize or condescend and that's a really respectable way to make films in general, let alone films for the most impressionable sect of the population: the childrens.\n\nAnd now, of course, let's talk about BayMax - easily the centerpiece of the film, and a total home run at that. He seems so tactile and real, it's crazy! There's just an incredible way in how he's animated and brought to life, despite being this blank white balloon of a robot (probably the hardest thing to make for people to relate to ever). His and Hiro's relationship is essentially the foundation of the plot to the film, almost in a Terminator 2: Judgment Day kind of way with the street-smart kid teaching the robot how to act less like a robot and more like a friend. BayMax is a great character that we will probably see more of in the future.\n\nThere was a lot of intent and focus in the direction on feeling, whether it be the literal sense of touch or emotional depth and I think that directly correlated with the story very well as Hiro was sort of forced to gain control of his reaction to his brother's death and come to terms with his responsibility to do his best to continue Tadashi's work and be the best self he can be. I think they would have felt inappropriate in the MCU though, even if this was a live-action take on the comic so I'm glad Disney and Marvel are making sensible choices with their source material in adapting it to the big screen rather than just trying to cram it all together in an obvious cash-grab. Looking at you, Sony. What with your three-villain Spider-Man films and your rumored Aunt May solo film.",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was fun, with a few clever ideas. However, some parts felt derivative (e.g. Hiro riding Baymax was similar to \"How to train your dragon\"), and others felt as if they'd been put into the film for the benefit of the tie-in computer game. There are also a couple of plotholes; as an analogy, if I lost the remote control for my TV then I'd get a replacement rather than complaining that I can't change channel anymore.",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say except \"flying makes you a better healthcare companion\". Brilliant!",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation was well-done, but that's about as much as can be said for this film, which has a made-for-TV feel that cannot be shaken (especially with its tired references to Disney's newest comic-book acquisition)...",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie I cried at the beggining of the movie and the end",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a pretty good movie with an amazing cast but it feel like a rehash of The Iron Giant, The Incredibles, Wall-E, The Dark Knight, and Treasure Planet.",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disney have delivered and made their own superhero film inspired from a marvel comic. Made a pleasant change for disney to create a film without any princesses or love stories. A damn good film and a brilliant change for disney.",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bring out the nerd in ya....",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was stunned by this film. I was expecting another modern average Disney film but instead I watched a modern Disney classic. It made me laugh many times and cry as well and it's a shame it came out when frozen did because it hasn't earned enough recognition. Promoting themes like friendship and making the right choice, this is a must watch.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a generic plot for an animation that attempts a slightly wider appeal than just children, but it's well made and looks good.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best young people movies I have seen.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, but nothing too special.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything about this movie is ok. The characters and settings were recycled from other movies and you could see the twist coming miles away. The only thing that it did exceptionally well with is Baymax and Hero's friendship. The comedy part of the relationship is funny and not forced and the heartfelt stuff in their relationship is tear jerking.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great story, great animation, what more can I say, I want to see another!",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the start was really good, there were really good character plots but I wasn't really satisfied with it. There was a lot of fan base and advertising for it but it was alright, that's Disney for ya",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Baymax is an absolute gem of a character but sadly the film is let down by an undeveloped supporting cast and a weak villain.",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable animation, a rarity these days in my opinion.",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I saw this film I just knew I would love it.\nI mean superheroes? We have Disney + Marvel with that touch of Up (if you saw the extras in the dvd you understand what I mean).\nHero is a young boy that is hi-tech genius and is brother, Tadashi, tries helping him but dies. Hero is left with a goofy fellow (BayMax) who will become is battle friend to face the guy that caused his brother's death, with also a little help from a group of Tadashi's friends.\nThis movie has sad moments, fight moments, comedy and Fred (he's like a cool Shaggy!) and the animations are wonderful! Definitely a want to see again and again!",
            "review_date": "2015-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually appealing.  Interesting stories and characters.  A touch of humor.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie that has ever been made.",
            "review_date": "2015-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was a little sad but it was a good movie",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a solid voice cast, great characters, stunning visuals, plenty of laughs, cracking score, decent enough plot and some touching moments this is one of the best Disney animated films.",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great insight into the nature of human-robot relationships: computers only act  and speak according their logic and programming, without emotion or true personality, and humans develop feelings for and extrapolate emotions onto them.",
            "review_date": "2015-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too mainstream for me. Way too much action, destruction and unnecessary death for a kids movie.",
            "review_date": "2015-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming moment... there it is! No wait, there it is again! Those moments are everywhere in the movie along with the action somehow included.",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hearthwarming tale about a boy dealing with loss and a adorable robot.",
            "review_date": "2015-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing animation!!! One of disney's best films to date!!",
            "review_date": "2015-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very much in the same vein as The Incredible's, this is a moving, funny story with lovely character design and some good laughs.\n\nDoesn't quite have the same flair as its inspiration but still a good story.  Baymax steals the show as an iconic adorable robot",
            "review_date": "2015-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You're only as good as a rock if you will not cry in this movie.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a solid voice cast, great characters, stunning visuals, plenty of laughs, cracking score, decent enough plot and some touching moments this is one of the best Disney animated films.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Fun for the whole family.",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a fan of MoA, I wasn't really surprised to learn that they brought this animation to life. It's a great family flick for all age groups and it tells a wonderful story. The team does what they're best at and proves that diversity in films and animation can really pay off. It teaches good morals to those who have lost loved ones. Five stars for an amazingly diverse cast and proof that it can be successful!",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching, cute, funny, and action packed. Big Hero 6 is a smart animated twist on the superhero genre while still including elements that makes them great.",
            "review_date": "2015-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't know about 1 thru 5 but I didn't care for #6",
            "review_date": "2015-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastically animated film from Disney, Big Hero 6 has fun characters and quality voice acting. Scott Adsit as the lovable robot Baymax steals the show and its an overall very enjoyable film.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big hero 6 is clever  and fun movie. There is heart, its funny and it has action scenes. Big hero 6 is something disney never did before, and it works.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvel may have Ironman but Walt Disney has Baymax, the big loveable health care marshmallow, that can turn into stocky mean fighting machine... but never to kill.  Iron man may be just has powerful as Baymax but we love Baymax many times more....",
            "review_date": "2015-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 words Frick in amazing",
            "review_date": "2015-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as heart-wrenching as some of Disney's other creations, but filled with beautiful animation, plenty of good spirits, and some good laughs. Plus the moral messages about forgiveness and restraint were honorable.",
            "review_date": "2015-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really love this movie. It was put on during my trip to New York, but having woke up at 5am I fell asleep during it. Having seen some of it and really loving the song Immortals by Fall Out Boy I decided to sit down and watch it properly. I definitely wasn't disappointed, I cried and laughed and I really loved baymax going \"fa-la-la\" when fist bumping (so cute!) It was just such a good movie and so underated!",
            "review_date": "2015-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Heartwarming And An Funny Masterpiece That Disney Made To Touch Your Heart!",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "were it not for baymax's endearing design, the film would have been an extraneous mishap. 'big hero 6' is an uninspired insipidity that courts every contrivance in the book: grieving orphan, counterfeit deaths, predictable twist on the villain. it's a tragic departure from any new-minded witticisms we should expect in the horde of comic-book films. a creepy talking lump and the ambivalent, unsightly landscape is again in evidence of this.",
            "review_date": "2015-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. fun characters and plot",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant & entertaining",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am satisfied with my care. =(",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont care how related (or how unrelated) it is to the comics, Big Hero 6 is a well written, entertaining movie, and a funny and delightful experience for all ages.",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't say enough wonderful things about Big Hero 6.  This is by far my most favorite recent Disney film.  For me, not even Frozen tops this.  If you have yet to see Big Hero 6, do so immediately.  It's an awesome film.  Highly recommended.",
            "review_date": "2015-11-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}