{
    "rating": 8.6,
    "release_date": "2014-10-02",
    "num_reviews": 102,
    "genres": [
        "Hindi"
    ],
    "summary": "In Kashmir, a young man discovers not only that his mother is having an affair with his uncle but also that the man is responsible for his father's gruesome murder.",
    "reviews": [
        {
            "content": "\"why do skulls keep grinning?\nbecause it is only after death that you know you never lived fully and it never stops even after death.\"\n\nHaider's got everything. Vishal Bhardwaj directing Shakespeare, Gulzar Saab writing lyrics, Tabu, hard-hitting monologues, breath-taking setting, Tabu, deep and dark political undertones that'll shake your beliefs and question what you know and what you don't until you deep dive through articles and articles and articles and realise how messed up the world really is and... Tabu.\n\nso, how does a film based on a play from 1599, set in 1995, released in 2014 and rewatched in 2022, still manage to be awesome? the answer is quite simple. TREATMENT. Instead of showing us the regular Kashmir Ki Kali that Shammi Kapoor would dance around in, the film takes the state's politics and history and wraps it up quite neatly in very very very high Shakespearian drama. In school, nothing was more boring than Shakespeare, but in the hands of veteran Vishal Bhardwaj, it all feels fresher than ever.\n\nthe film does follow the basic storyline of Hamlet, but the meticulous craft with which Bhardwaj manages to inculcate the separatist situations and the nation's reaction to those situations is just brilliant. None of the subplots feel like they shouldn't have been a part of the film because frankly, all of them buildup to an explosive and satisfying climax which I've rarely seen in Indian Cinema. to summarise, the film follows a chain of events that is driven by one mission and one mission only. INTEKAAM (REVENGE).\n\nthe acting is just phenomenal. it's in the film, that you notice, what an actor with a caliber of Shahid Kapoor can do in the hands of a good director. the हम हैं की हम नहीं? (Are We or Are We Not?) monologue is still etched in my brain due to the sheer impact of it's writing and the way Shahid delivers it in the film. he's always been good, just his film choices haven't been so \"Shaandaar\". Then comes in Kay Kay Menon. he is so good as the antagonist Khurram that even when he's acting all innocent, I wanna punch him in the face (he owes me a laptop btw). sometimes, you feel that Shakespeare wrote the part specifically for him. okay, let's talk about Tabu. she needs to be stored in a gold vault and protected forever. it is impossible to take your eyes away from her when she's in a scene. now, talking about the show stealer, Irrfan Khan. his character in the film is brief but, he still manages to steal every scene he's in (as usual). also, his entrance scene might just be one of the best entrances I've ever seen in out of all the 7 pieces of artform in existence.\n\nVishal Bhardwaj also manages to sneak in the Oedipus Complex that was also quite evident in the original novel without making it seem cringe. this adds an extra layer to Haider's character in manifesting his hatred for Khurram. because, Khurram has done what Haider subconsciously always wanted. kill his dad and marry his mom, which essentially is the definiton of the Oedipus Complex. this also makes the ending somewhat open to your own interpretation as to why Haider chooses to do what he does?\n\nnow, talking about the music. It's just mind-boggling. Bismil, Aao Na, Jhelum Jhelum, each and every song is just marvelous. Especially Bismil and a rendition of Aao Na before the very end of the film. Gulzar literally said, I'll take on Shakespeare and write my own version of the song sequence where Hamlet reveals his true desires to everyone. and my god, Dil Dhadke Dil DIl Dhadke indeed.\n\nI think everyone needs to watch this film atleast once in their lives not just to see the brilliance of Vishal Bhardwaj's adapting techniques but also to see the brilliance with which he does it. This also is my favourite among Bhardwaj's so called Shakespeare Trilogy each of which is a brillaint piece of work on it's own.",
            "review_date": "2023-03-11",
            "source": "rt"
        },
        {
            "content": "A wonderful adaptation of 'Hamlet' with its own twists that may not feel like the original play, but gives an alternate version of it. The main leads did a fabulous job. For me personally, I felt very few parts just dragged a little bit but the movie never failed to engage me.",
            "review_date": "2022-07-29",
            "source": "rt"
        },
        {
            "content": "Very Great & Very Good \"Chutzpah\" Movie...",
            "review_date": "2022-07-02",
            "source": "rt"
        },
        {
            "content": "The most impressive thing about \"Haider\" is that it uses a story like \"Hamlet\" to portray something socially relevant. The movie is a well-made story that works because of its strong performances. The movie does tend to feel like it has a lot of things going on and sometimes I felt myself in and out of interest in the story. Nonetheless, it builds up to a very entertaining and engaging final act that makes it worth the journey. I admittedly have very little experience with \"Hamlet\" but I am certainly intrigued to watch another version of the classic story after seeing this Bollywood version.",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "Based on Hamlet, son of revenge to the father's death was murdered by his uncle",
            "review_date": "2022-02-13",
            "source": "rt"
        },
        {
            "content": "Haider is a good movie but it has its own problems viz., the villain does not show the required emotional depth(is sometimes reflected on other characters) that story expects him to show, moreover, some issues with editing and sharpness of screenplay(at times) impair its quality.",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "A powerful adaptation of Shakespeare's 'Hamlet', to Kashmir.\nVery well written, and acted.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "You bite the hand that feeds you . I felt like this after this movie. Mr  vishal bhardwaj you are a disappointment. Cinematography is Brilliant but brainwashing the people with this twisted message is shamelessness.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "'Haider' is another striking Shakespearean adaptation from Vishal Bhardwaj, even if I was a little unconvinced by the choice of Shahid Kapoor for the titular role.",
            "review_date": "2020-06-27",
            "source": "rt"
        },
        {
            "content": "Khan's death is a tragedy, but at least it led me to this absolute knock-out. A faithfully complex modern rendering of Hamlet, exploring the terrifying psychology of vengeance, guilt & forgiveness. However, that description doesn't do justice to how urgent the film is. Kapoor, who's like an Indian Tom Hardy, gives a lead performance for the ages, commanding every moment he's on screen, a screen filled with strikingly crisp & harrowing visuals. If this is what Bollywood offers, color me shamed for my ignorance.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "'Haider' works big time like an effective thriller because it is easily one of the best films of Vishal Bhardwaj, easily affirming your confidence in his reported series on Shakespearean saga (it's going very good till now, and the last thing he can do to ruin this is to recreated Romeo and Juliet next). This film is a strong political subtext other than just a film because Shahid Kapoor delivers an outlandish and frank performance as Haider the Hamlet, and he finely slips into the skin of the character. He does it just like Tabu, who also delivers one of the finest worms of her career. \nIf only the runtime was accessible, and the romantic arc was better, this could have become a perfection. Till this happens to any of the director's films, let's just say this is one for the best films of the year 2014.",
            "review_date": "2020-03-13",
            "source": "rt"
        },
        {
            "content": "As a Kashmiri, I feel this masterpiece pulls all the right strings, and reignites all the pain and horror we all have grown up living in during the 90's turmoil. To achieve such levels, I must say Shahid, Tabu and Menon have produced the performances of their lives! Credit to Mr. Bhardwaj for that. A must watch, indeed.",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "Incredible, riveting & powerful.",
            "review_date": "2019-12-13",
            "source": "rt"
        },
        {
            "content": "awwwwwwwwwwwwwosom movie ........must watch",
            "review_date": "2019-11-25",
            "source": "rt"
        },
        {
            "content": "5 stars for Shahid's awesome performance. Tabu was good as usual. Shraddha was ok. Nice film",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "What an awesome movie!! (It's a retelling of Hamlet that is set in modern day Kashmir.) Avery great ensemble cast. I was very impressed how they were able to make the Bard come alive in Kashmir.",
            "review_date": "2018-10-01",
            "source": "rt"
        },
        {
            "content": "One of the best Bollywood movies I have ever seen in my life. Brilliantly acted by Shahid Kapoor and Tabu, and a tight, edge of your seat plot. ",
            "review_date": "2018-08-14",
            "source": "rt"
        },
        {
            "content": "shahid kapoor acting is very dangerous. \nNow (after watching Haider) I respect his acting.",
            "review_date": "2018-08-11",
            "source": "rt"
        },
        {
            "content": "Haider is a great film. Bollywood films tend to be shlocky cheesy mess and this film surprised me for being different. Based on Shakespeare's Hamlet the action transpires in war ravaged Kashmir region. Shahid Kapoor is fantastic as the young son hell bent on revenge and every actor from Tabu to Narendra Jha gives this film their absolute best. The cinematography is good, but the plot and characters take precedence in this film. Very few Bollywood films are as effective as Haider- Give this one a chance and you will be surprised.(A great take on Hamlet set in modern day Kashmir).",
            "review_date": "2018-07-16",
            "source": "rt"
        },
        {
            "content": "This is truly a spectacular piece of art. Everything ,  every element of movie works. From excellent cinematography to outstanding screen play to the best music direction,  the movie is surely not everyone's cup of tea. Beautiful amalgamation of Hemlet with Kashmir conflict issue of 90's . Towering above all are performances of everyone. Beautiful Shradha kapoor to strong cameo by Irfan khan.,  perfect sense of evilness and letchery by Key Key,  the rage in Shahid's eye and what to say about Tabu,  she has given one of the best performance ever given by an actor. The concept of Oedipus is rare in Hindi cinema and to showcase that with such a way is praisworthy. One of the Best movies ever made ??",
            "review_date": "2018-07-02",
            "source": "rt"
        },
        {
            "content": "Excellent movie on the horrible plight of the Kashmiri people torn between the army politics of India and Pakistan. Thought provoking and thrilling. Very good supporting cast.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "Haider as a must-watch, as it has a phenomenal story, which is backed up by amazing performances by every actor but Shahid Kapoor shines in this movie, this is his best performance as of now. Despite that, I got bored a few times, but then I instantly got interested, and this happened a few times throughout the movie.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "A Bollywood reinterpretation of Hamlet set against the backdrop of Kashmir conflict. And it actually delivers on all accounts.",
            "review_date": "2016-02-04",
            "source": "rt"
        },
        {
            "content": "Hands down the best Shakespeare adaptation that I've seen. Need more of this from Bollywood - hopefully also with some original stories of their own.",
            "review_date": "2015-12-13",
            "source": "rt"
        },
        {
            "content": "100% tomatometer rating made me write this review for the most over-rated movie from Bollywood in year 2014. I remember watching this movie in a multiplex where people (mostly younger audience) was inclined towards the other release of the week - BANG BANG. I like serious cinema and in a hope to watch something thrilling and exciting - at least this is what the promos promised - I decided to skip BANG BANG that day and purchased the ticket for what turned out to be a torture for my senses. Haider started out quite well with that doctor's assisting the terrorists and his house getting demolished by the army. But the thrill just ended there. What followed was a series of extremen sadism, one-sided storytelling, anti-army atmosphere and pro-militancy storyline that nearly ducked my mind. \n\nPeople around me were so bored to death that they had to turn on their smartphones and check messages. It was so torturing that I almost decided to exit the hall few minutes after the interval but then I thought why not test my sense to see how strong I am and how much torture I can handle. \n\nTo Mr. Vishal bhardwaj - Sir, I saw your omkara (I was tortured), I saw your matru ki bijli ka mandola (you raped audience's mind) and now with Haider you proved that you are one most boring storyteller in this country.\nI will NOT be watching any of your movies again.\n\nPS: Btw your production ek this dayan was good.",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "It's very late but finally I watched this. Perhaps this is also Vishal Bhardwaj's best work being almost comparable to Maqbool. Haider is the Indian adaptation of Shakespeare's Hamlet, a tale of revenge set in the Kashmir valley during the height of militancy. This very backdrop ensures that the story would be riveting and the visuals amazing. Bhardwaj uses the bleak, wonter landscape of Kashmir and paints them with even darker shades. An honorable doctor, his troubled son, a distanced wife and a creep of an uncle. Haider follows most of Hamlet the way it was albeit raising some very important human rights issues in Kashmir. The army loyalists blasted this film but after watching it I see no reason why there should have been an issue. Firstly, the AFSPA is only a minor part of the film and secondly the film never forces the judgment on its audience. Also bolstering the act is an absolutely stellar cast. Even Shraddha Kapoor impresses. Tabu is her usual class and so is Kay Kay Menon, his pre-election campaign hauntingly reminiscent of Gulaal. Irrfan Khan makes an impact in his guest appearance. But finally it is Shahid Kapoor who OWNS the show. His expressions are dramatic and he plays the sad guy, the angry man and the madman with equal ease. Faiz Ahmed Faiz's diaogues are noteworthy and especially the dance drama that Haider performs to enact his tragedy. The film wraps up in vintage Vishal Bhardwaj style, with a cult soundtrack, raining bullets and ultimately redemption where it diverges from the original Hamlet. It is a film to be leisurely relished, each character a story on its own. Well why not the full five stars? Well because I was not too happy with Shahid and Tabu's contact lenses and the very fake looking blood in the end! ;)",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "A great, pathbreaking film in so many respects. In both portraying Kashmir and Tabu's various relations, the directors have gone where few would ever have imagined. Lovely acting.",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Fabulous depiction of Shakespeare's Hamlet set in the backdrop of Kashmir - soundtrack is awesome too !!!",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "A class adaptation of hamlet performed outstandingly by shahid Kapur and Tabu and not to forget Kaykay menon's mind blowing act as the villain mind blowing music and great locales add to the movie's limelight. Powerful and resounding",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "92%\nWatched this on 12/5/15\nHaider is one of the best revenge flicks made in India and it owes that to Shakespeare's Hamlet from which it is inspired. Haider is a revenge flick that is made on the Kashmir background and the 1995 Kashmir Curfew. It can be considered as an Indian version of Old boy(2004), well not in terms of twists, but in terms of it's scope. The film has superb cinematography and fine performances from Shahid Kapoor, Tabu and Kay Kay Menon. It is also one of the most violent Indian films that I ever seen.",
            "review_date": "2015-05-12",
            "source": "rt"
        },
        {
            "content": "Awesome acting from shahid and Tabu.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "A pretty entertaining 'Hamlet' adaptation.",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "Great cinematic interpretation of Shakespeare.  Also brings attention to the conflict in Kashmir.",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "Haider -  a masterpiece! \nA tragedy of vengeance, 'standing ovation'  performances  by the leading star cast. Shahid and Tabu, you were the icing on the cake. Speechless!.. Watching a movie after ages tat really left me feeling awed!... \nThe song *jhelum* creates a lasting eerie-Ness..to the gorgeous backdrop of snow and wound clad kashmir. Beautiful watch. My night is done. Wow.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "Director Vishal Bahradwaj's 'Haider', the talented filmmaker's third brilliant Shakespeare adaptation, sets the story of 'Hamlet' in 1995's war-torn Kashmir (Northern India). Not only does it shed light on the civilians' plight, the military atrocities and rising tensions in Kashmir during that period, but also explores the lead characters in such unique light, especially, the mother-son relationship; the sexual undercurrent is maintained well, quite nuanced.\n\nHaider's character might deviate a bit from the original story, but his development is intriguing and apt for this story. The film not only gives us a strong Hamlet (Haider), but also gives us a memorable Gertrude (Ghazala); she's the more mysterious character, we never know what's going on in her mind. These characters are strong because of the excellent writing and the terrific performances by the two actors, Shahid Kapoor and the ever-so-beautiful-and-sensational Tabu. Kay Kay Menon is excellent as always, and Shraddha Kapoor also gives a commendable performances.\n\nThe cinematography by Pankaj Kumar is just spectacular; he has captured Kashmir with such elegance. The music composed by the Director himself (as always) is quite mesmerizing; they certainly add to the charm of the film. I liked the rage-filled stage-play song ('Bismil'), and really loved the grave-digging song ('Aao Na') as well. The only annoying thing was the particular score from 'The Bourne Ultimatum' which was used twice in the movie; it was a bit distracting.\n\nAfter the movie is over, everyone would very well remember the word 'chutzpah'; the satirical references of this word with the military's (AFSPA) actions were quite hilarious. The Salman Khan and 90's songs references may not be understood by people who don't follow Hindi cinema.\n\nIt's mainly a political drama, and has an interesting opinion on revenge, and among all this, it was interesting to see how Bharadwaj created these Shakespearean moments at crucial points in the story.\n\nUltimately, it's not Bharadwaj's best film, but it's certainly one of the best adaptations of 'Hamlet'.",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "Super performances! Nice visuals of Kashmir. Story and screenplay are a bit weak but the direction and acting made it look good. Shahid's best work so far. Irrfan in his small cameo was too good. Shradha Kapoor didn't have much to do but she did well whatever she got. Tabu n Kay Kay once again proved how good they are.",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Vishal Bharadwaj's adaptation of Shakespeare's titular play 'Hamlet' is dark, gritty and thoroughly meticulous in craft. There is always a beauty about snow white backdrop that provides the canvas to draw human fallacies in red.  'Haider', set in the backdrop of Kashmir proves to be violently beautiful. But it's not the violence, or the prominent vengeance of 'Hamlet'; nor the socio-political dogma that creating a ripple of controversy was faced by the people during the 95 Kashmir Conflicts,  that was the driving force of Haider. It was the awry and eerie love and relationship between the mother-son duo of Ghazala and Haider.\n\nThe primary characters of the story, and their relationship did not deviate much from Hamlet in the film. But, just like his previous films on Shakespeare's works, Bharadwaj triumphs, more prominently in this film, in the craft of blending the tragedy of the play with the emotional aspect of the story. Thus, the film becomes very unique and Bharadwaj's own in that perspective. The preparation and hard work of the director reflects in the film's narrative.\n\nMuch like Hamlet, Haider arrives in a discontent Kashmir to find that his family has been torn apart by the war that is brewing between the Militants and government. Amidst that, people are disappearing, seemingly at random. To Haider's grief, he finds that his father is one of the missing persons and to his shock he finds out the proximity of the relationship between his mother and uncle, Khurram.\n\nViewers could almost sense the amount of threads Bharadwaj was spinning in the film. Whether it was Haider's search for the truth, the controversial torment of the common people in Kashmir, or Haider's search for his father that continues to reek of betrayal and thus spawn vengeance in his heart; Haider's love for his fiancée or the palpable love between Haider and Ghajala, which to me is crowning glory of this tale of vengeance - all of these threads creates the web where our titular protagonist is at the heart of. And herein lies the mastery of Vishal Bharadwaj that not for once one could feel him losing the grasp in the story, such is the screenplay.\n\nA film like this deserves the acting brilliance it had in the cast. First of all, Shahid Kapoor, hitherto mostly playing romantic characters (with the slight exception of Kaminey, another Vishal Bharadwaj film), was nothing less than magnifique in his portrayal of the central character. The soliloquy of his in the midst of the street would and should go down as one of the finest acting display in Bollywood. \nKay Kay Menon, as the antagonist Khurram, does his work deftly. But, perhaps, being an ardent Kay Kay fan, it just seemed a tad bit overtly dramatic from his part in some occasions. In smaller roles, Irrfan Khan (as the enigmatic Roohdar) and Narendra Jha (as Haider's father Hilal) do more than than their limited screen time allowed.  Shraddha Kapoor does not disappoint either.\n\nBut, the film was provided another dimension by the performance of one woman. Perhaps it was symbolic that the story had powerful men falling into destruction through the love of one woman, the femme fatale in its truest sense. A character like Ghajala needed acting of highest order, and Tabu, just like the woman she portrayed, put her male acting colleagues a league behind her in this film.\n\nThe film is backed up adeptly by Vishal Bharadwaj's own compositions -Songs 'Aaj ke Naam' and 'Jhelum' provides a bleak yet soulful tune, and not every day one can see the visual portrayal of songs like 'Bismil' and 'So Jao'.  Superlative cinematography of Pankaj Kumar does not go amiss either.\n\nHaider is a mammoth sized achievement in contemporary Hindi cinema, basking in the glory of its display; and it needs to be watched.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "Not for everyone but good story script.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "I don't understand why this movie is so well received. I find it painfully boring and uninspired.",
            "review_date": "2015-01-14",
            "source": "rt"
        },
        {
            "content": "By far the best performance of Shahid Kapoor's career. He is definitely the favorite to sweep the best actor awards at every ceremony this year.",
            "review_date": "2015-01-14",
            "source": "rt"
        },
        {
            "content": "What a movie. Terrific acting by it's leads espically Shahid, Tabu, Kaykay. Haunting background. So haunting that I am humming it still now after hours. The background just took this movie's darkness to another level. Talking about darkness it's one of the most dark movie that I have seen recently. It's like watching a foreign Indie cinema with Hindi language. What A Movie....Just What A movie. and What a presented KAShMIR. Mustwatch !",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "Revenge only begets revenge\n\nHaider is dark, grooming, haunting and at the same time set in naturally beautiful region of Kashmir. Its trump cards are its stunning cinematography and ground breaking performances by Shahid Kapoor and Tabu. This Bollywood adaptation of Hamlet is a marvelous piece of art which sadly only a handful people will appreciate in India. Director-Writer Vishal Bhardhwaj has to his name acclaimed films like 'Maqbool' and 'Omkara' both adaptations of Shakespearean work. Unfortunately I have not seen them but I have seen 'Kaminey' where I got a chance to witness his talent. His films mostly have grim themes giving us the glimpse of darker side of humans.\n\nMany of us are familiar with the plot of 'Hamlet'. A son returns home to find out about his missing father. On this path he finds harsh truths which puts on a quest for revenge and vengeance. 'Haider' is the name of the son here in place of 'Hamlet'. All of this set in the disputed lands of Kashmir, where frequent conflicts have lives miserable for the Kashmiris. I advice to get to know about the Kashmir Conflict those who are aware, will be really helpful in connecting more with the characters and their lives. Vishal Bhardwaj makes excellent use of this setting to give a powerful story.\n\nShahid Kapoor gives one of his finest performances as Haider. I could deeply feel Haider's desperation, confusion and urge for freedom. His monologue in front of the crowd of locals was memorable. Another great performance is given by Tabu as Haider's mother portraying eloquently her motherly love. Kay Kay Menon as Haider's uncle and Shraddha Kapoor as Haider's love interest do a good job. Irrfan Khan was a delight as always even with a smaller role. There are many songs, none of the seemed out of place or necessary like most Bollywood films. They blend into the atmosphere smoothly, making the movie kind of musical as well. Vishal Bhardwaj's script was immensely poetic and thought-provoking. The expansion over the Hebrew word 'Chutzpah' was really intriguing and eye-opening.It has many thematic elements about the imminent fate of life and philosophy behind freedom and revenge. The pacing is quite slow,so be patient.But I felt it was necessary to connect with characters and the environment more deeply. The ending was visceral and powerful, made me feel worth the wait. The only thing I found bit let down is that it attempts unconditional humor.Also sometimes the film tries involves the regional conflicts a bit too much which is not core of the film. Still overall the films like a masterpiece in recent few years in Bollywood.\n\nAt the end you need to have the right mindset before watching Haider. Its a very dark and depressing story so don't go into expecting to be entertained in a fun a way. If such movies are not your taste, please don't watch it and unnecessarily rant. There are still quality film makers in Bollywood like Vishal Bhardwaj which makes me immensely proud. Respect him for making a piece of art like 'Haider'.\n\nRATING: [4/5]",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "Editing is letting Vishal Bharadwaj down. Good movie, could have been better.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Whole Team of Haider Went Full Retard.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "A good movie which engages the intellect and senses. The cast gives memorable performances. Tabu more so. With talent and opportunity why wouldn't she. There is irony in the beauty of a torn Kashmir. Shakespeare demands theatre and gets it throughout the movie. I wouldn't know whether the portrayal of indian Army and terrorism is accurate. But isn't that the role of an independent media? In short the movie is an example of what Shakespeare is able to inspire centuries later and leaves many questions unanswered like how a real piece of art should.'To be or not to be' is not bound by language!",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Vishal Bhardwaj has mastered the art of rendering Shakespeare to Bollywood, Macbeth first, followed by Othello and now Hamlet.  Truly engrossing and throughly enjoyable.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "I never felt so happy being so sad!",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "vishal bhardwaj with his amazing sense of subtle screenplay and yet making it interesting for the audience to follow the story. the amazing dialogues which takes you into the depth of the vision of the writer binds you and your subconscious. Thanks to him that art of story telling is still alive in bollywood.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "Terrific!! Best hindi movie in a long long time!!",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "A solid adaptation of Hamlet, interestingly transposed into a different political and cultural setting. Apart from the tense opening, the rest of the first half tends towards dullness, with a sulky lead performance and blah song montages, but once the craziness sets in, so does the life and intensity. The play-within-a-play scene is brilliantly re-imagined into an intense musical dance number that has to be seen to be believed. Some liberties are taken, especially in the ending, but it's no big deal.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "Two words. Holy Shit!\nWhat a performance by Shahid, guess one of the best meaningful movies he have ever done.\nThe story does raise some eyebrows as you would think its putting terrorist supporters at good spot. However, I compared the movie and the situation in 1989 in J&K with the post 9/11 interrogation and tortures. Both were wrong. Although the forces have to do what they can do to protect and prevent national interest, the movie shows the point of view of the people who seldom get a chance to explain their side of story and gain humility.",
            "review_date": "2014-10-16",
            "source": "rt"
        },
        {
            "content": "Beautiful adaptation of 'Hamlet' . It adds to the list of fine classic cult Indian cinema with riveting performances from each character. No wonder, it seeks attention for unfolding the grim side of Indian army , but, yeah whatever.!",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "A neo-masterpiece from Vishal Bharadwaj. Also the most radical retelling of Shakespeare I've seen.",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "lacking hamletwise, but a good enough movie otherwise",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "Goes along pretty well till it bumps into some incoherent story telling beyond its optimal screen time.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "After a long time, there is a movie from Indian cinema, which leaves you thinking.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "Vishal Bharadwaj's Shakespearean adaptation,` Haider' urf `Hamlet' is a poorly told story constructed to drain last ounce of human patience. The movie is way way too long and choppy all throughout. The actors including Shahid, Tabu and even KK do a fabulous job and I mean really good acting the types rarely seen...but the movie still fails to deliver. It tells a gory side of story with zero context resulting in a lot of rage and also fails to fully keep you with it. I would recommend sitting this one out and renting a DVD when available.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "The director-actor duo of Vishal Bhardwaj and Shahid Kapoor is responsible for one of my all time favourite Bollywood movies - Kaminey. So without a doubt, when they teamed up again, it absolutely couldn't be missed.\nHaider lives up to expectations and is an incredibly well acted and directed film. Shahid Kapoor gives his career best performance and Tabu, Kay Kay are phenomenal in support. \nThe movie has a relatively dark tone and takes a while to get going. While the build up throughout the first half was good, it really demanded alot of patience and had me questioning what everyone loved. However, once Irrfan Khan enters, the film really comes into its own. It picks up pace and has plenty of intense sequences that stay with you.\nBeautifully shot and complimented with a daunting and soulful background score - Haider is a technical marvel and a film made with alot of heart and passion. Its worth your time and money and shouldn't be missed.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "Unrealistic direction, Tarnished screenplay, Worthless Acting & Senseless Climax makes this Bharadwajs worst movie ever. The Beautiful Valley of Kashmir never looked this ugly.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "Its one of those rare moments when you feel sad that those 2 hours got over so soon and you still wanted Haider and his madness to go on and on.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "What an amazing movie from Bollywood, very string massage and acting by all the actors, definitely worth watching.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Top notch performances by Tabu and Shahid, intense depiction of the drama tad bit violent, beautiful cinematography and music that goes well. Look out for the grave digging sequence.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "William Shakespeare's 'Hamlet'",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Irfan with just 15 mins of screen time shadowed all the powerful performance in the film..",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "What a great watch. Whatever you know of Shakespeare it don't matter, this gives the old story a mighty shake and gives a completely amazing take. Wonderful performances by Shahid and Tabu. Superb direction and great cinematography. And the story with its setting, exemplary ! A must watch and is going to be a classic. If I must state, the missing half star I feel is because I think the editing could have been slightly more better (that's me being picky) but doesn't take away too much from the whole movie.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "Awesome... That's what i can say...",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "far far far better than bang bang",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "Very good performances and engaging drama.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "Fantastic acting, breathtaking scenes, great storytelling, one of the best Bollywood movies ever! Art at its finest!",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "A gripping re-telling of the Shakespearian epic \"Hamlet\", the story remains almost true to the original plot line with Shahid Kapoor delivering probably his best performance in my opinion. With the exception of Shraddha Kapoor, all other cast members gave good performances. The movie is well-directed, even though it seemed to have stretched at certain points which led to its 162 mins run-time. The cinematography was quite good , with the climatic dance sequence being shot with near perfection providing the well-deserved intensity it needed, due to the significance it held even in the play Hamlet performs to get the truth out of his uncle.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "This movie is a masterpiece. One movie with so much character in characters, in relationship. Speechless.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "A movie perfectly crafted by Vishal. Shahid making a good comeback as Haider trying to avenge his father's death.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "Excellent movie and performances. Shahid Kapoor, Tabu, Kay Kay and the all the supporting casts gave really good performances. Kashmir looks beautiful like it really is.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Haider, an adaptation of Shakespeare's Hamlet, is a long and intense drama set in the heartland of Kashmir valley. The film draws on multiple issues such as infidelity, terrorism, agonies of families with missing members, half widows, cruelty of armed forces, and revenge. A multitude of themes emerge in a higgledy piggledy fashion throughout the movie, rather than focusing the viewer's mind on a single, strong idea. Few themes could have been easily avoided - for example the exasperating romance of Shahid and Shraddha, and the cheesy reference to Salman Khan movies. That apart the movie is artistically shot, the compositions are spectacular, and most actors have done justice to their characters. Overall, it manages to keep one engaged till the end. Recommended.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "intense is how i describe it in one word!!shahid's best performance till date....an emotionally driven movie showing how life is in kashmir in reality more often than not....tells how innocent souls up there in kashmir(like haider,ghazala,arshia  in the movie) are lied to,ill treated and often brainwashed by the militants and at times by army(p.s. govt) too just to get their support by any means....shahid just rocked in his character of haider and shraddha kapoor,tabu & Kay Kay were superb too....as narration,as screenplay and direction,the movie was as good as it can get in bollywood movies...but for an average viewer,you wont hear a single whistle so fiery is its content throughout(P.S. dont watch it if you dont have an appetite for serious movies)...for a short summary to sum the movie up,the movie starts from a gesture of humanity turns into acts of authority & domination into hatred & revenge and ends with a message of forgiveness with a hope for a better future :)",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "One haider is not enough",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "One of the best films of 2014 and a perfect ending to the Shakespearean trilogy by Bharadwaj.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "\"Awesome\" that's it! Words can't describe \"HAIDER\" I felt like I was watching a movie after a long time.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Good movie but very slow. Could have been easily reduced by 30 min and made it more appealing.",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "A rare masterpiece in bollywood...Keeping aside the controversial Kashmir issues, you could see the brilliant acting ,screenplay and direction in the movie. Amazingly depicts Hamlet. Every scene is so brilliantly crafted that one can't just take the eyes off.  Highly recommended",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "a film of epic proportion! Vishal Bharadwaj has done it once again!! From the outstanding cast to cinematography to music..everything exceptional. Rendering Shakespeare's one of the most critical drama to this level of excellency is pure brilliance. Bharadwaj at his one of finest i must say..",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "thought provoking, beautiful and haunting... Shahid Kapoor's best work to date.. i forgive R.Rajkumar and all those debacles.. \n\na fantastic twist by Mr. Bharadwaj wherein Gertrude aka Ghazala, played the unparallelled Tabu, becomes the nucleus of this desi-Hamlet.. She is the masterstroke, the gravity that holds this intense film and the audience glued together..",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "Another Brilliant Masterpiece from the Maestro Vishal Bhardwaj. Bhardwaj adapted and India-nized Hamlet in a very rational way.\n\nSuperior Cinematography showcases the real beauty of Kashmir . Songs & Background Music Brilliantly composed by Vishal Bhardwaj himself. Lots of Urdu & amazing Poetic Dialogues used in the film, increases the Raw appeal. Lyrics of the songs takes sometimes to understand but goes perfectly used in the movie and the more you listen the more you get hooked to it.\n\nSuperior performances from  Shahid Kapoor, Tabu, Irfan Khan & Kay Kay Menon. Only thing I missed in the movie was little bit more romantic sequences. Other than that, the movie is absolute brilliant Masterpiece.",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "Can't get better than this! Bolywood is on the rise!",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "\"Awesome\" that's it! Words can't describe \"HAIDER\" I felt like I was watching a movie after a long time.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Vishal Bhardwaj is one of our most renowned film makers, with this film he completes his trilogy of Shakespearean adaption. Vishal has proved his mettle with likes of Maqbool, The Blue Umbrella, Omkara and Kaminey. No doubt, Vishal has a robust hold over what he is doing. This one is an official adaptation of Hamlet set in the backdrops of Kashmir. Without Vishal's directorial finesse Haider couldn't have been the experience that it turned out to be now. Screenplay of the movie is pitch perfect without any loopholes. It couldn't have been better. The writers have transformed the idea on paper into a visually splendid movie with superlative script. The dialogues penned by Vishal strike the right chord. Cinematography is of astounding. The DoP depicts Kashmir in an exquisite way. Shahid Kapoor, without doubt the most underrated actors of our industry, as the lead protagonist depicts the role with aplomb. It is his career's best performance! Tabu gives yet another scintillating performance. Shraddha Kapoor looks ethereal and carries off a very difficult role on her shoulders very well. Kay Kay Menon appears in a different shade and steals the show every now and then with his acting skills. Irrfan Khan, though in a special appearance is perfect. On the whole, Haider is a 2 Hr 45 Min long engaging drama. Vishal doesn't let you get bored because of his fine writing skills. This one is for the cinema lovers & can easily be termed as the best film of 2014!! So far..",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Haider may share similarities with Hamlet but Vishal Bhardwaj makes it completely his own creation. Powerful performances, technically strong, visually stunning, heartbreaking beautiful thing.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Vishal Bharadwaj returns with another powerful homage to Shakespeare... Tabu's intense performance is simply phenomenal... I wish we could see her in more films....",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "I give this film 4 stars just for chutzpah.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "An Oscar movie. Very serious, thought provoking, serious ,dark radical and slow. One of the best artistic movies seen after a long time. Serious movie lovers should not miss this gem of a movie. However, it is not entertaining, it is unlike any Bollywood movie, It takes you in emotional journey, makes you think and one leaves the theatre with a very heavy heart.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Mr. Vishal Bhardwaj why are you not giving me chance to criticize any of your movies ?? Seriously YOU DID IT AGAIN ! Adapting Shakespeare into a Dark-Disturbing material only you can create it and \"HAIDER\" is one of those gem which should not be missed. \n\nThe cast, Plot, direction, Every-fucking-thing was up to the brim. You can't ask for a better one really. Shahid just knocked it out of the park, Shraddha fit right in it. Irfan and Kay Kay did their part really great ! And last but not the least Tabu, I JUST LOVED HER !! Everyone in this film must admit that this is the best film of their career.   \n\nAs a viewer, we don't get to watch many sensible movies in India. Movies like Haider should not be missed as it is not a DVD-Watch stuff. It is very difficult to portray a Shakespearean drama into an Indian Setup. For Vishal it is not a big deal as he has done it thrice Completing the Shakespearian trilogy successfully. \n\nDEFINITELY RECOMMENDED FOR NICHE AUDIENCES not for those douchebags who spend money to watch Katrina's tits :D :D",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Intense Cinema! Strictly for theatre lovers..",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Another Classic Masterpiece from ?#?VishalBhardwaj?.Its real triumph as an Adaptation - One needs balls [ ?#?Chutzpah? ] to make a film like this.Beside little lengthy screenplay,Its AWESOME.Only Vishal can Project Real Kashmir situation through Hamlet.Man Hats Off.\nLifetime performance by Tabu - Shahid - Irfan.Some may like it some may not but undoubtedly this is a Film to be Remembered for Long.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Only For K K Menon, Tabu & Kashmir.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Haider \n\nA Great movie with all crooked characters\n\nHaider is an adoption of Shakespeare's coveted play Hamlet. Now, I haven't read any Shakespearean stuff for the simple reason that I won't be able to comprehend that dude. But every time I watch Vishal Bharadwaj adopt his plays into a spiced up Bollywood movie, in a language that mere mortals like me can understand, I get a pretty good taste of his brilliancy. If Maqbool and Omkara made me sit back and pay attention for Shakespeare, With Haider, I finally came to realize why Shakespeare is regarded as such a dude. Now, I claim to be a Shakespeare fan, without ever reading a single line of his work.\n\nSet in Chaotic Kashmir of mid 90's, the movie has tragedy written all over it, right from scene one. Like every other movie that is made in Kashmir, Haider has terrorism and separatist movement at it's backdrop. But unlike every other movie made in Kashmir, the movie has no hint of patriotism whatsoever. Infact, its a story of the other half. So some parts of the movie may not appeal to you if you are the likes of those who are easily raged by stuff like Bilawal Bhutto's dimwittedness. \n\nYou get to know what the movie is all about in the first 30 minutes. What follows is the unfolding of the complexities of the characters involved. While, it doesn't make to too difficult for you to take sides with, it does make you empathize with the wrongs of the characters. A coming of age movie for Shahid Kapoor and a movie that yet again proves such a good actor Tabu is. The movie belongs to both of them completely. Shahid comes out real good in quiet a few scenes. Kay Kay Menon is back at doing stuffs that he is good at, being a great badass. Irrfan Khan is delightful in his short role and do makes his presence felt. Shrradha Kapoor is lovable. And there are two other lovable characters who create those only few lighter movements of the movie.\n\nAt 2 hrs and 42 minutes, the movie does test your patience at places. On top of that, the screen where I watched it included 4 trailers of Hindi movies starting with SRK's all glossy Happy New Year and 2 trailers of English movies as part of the theatrical release of the movie. So yeah, I did run out of my not so buttery butter popcorns even before Shahid's appearance on screen. They could have done away with 10-15 minutes to make it more appealing.   \n\nA movie worth watching for many a things, in spite of its flaws. Like other Shakespearean adoptions this one too is a movie with all messed up characters. So don't be surprised if you hear all the audiences including you gasp \"Holy Shit\" as the end credits roll.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Watch the film for Vishal Bhardwaj's direction, dialogues and touching acting prowess that almost everyone in Haider shows. In the backdrop of Kashmir issues and beautiful cinematography, This film is really very special.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Haider is a beast that just won't be tamed by regular cinematic definitions",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "The best Bollywood movie of 2014, so far. http://thediaryofarecluse.wordpress.com/2014/10/02/hamlet-or-haider-thou-dichotomy-most-profound-a-review-in-3-acts/",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "The word you are looking for is 'Chutzpah'.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "2014.\nBest Bollywood Movie !!",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "One of those rare gems in which every word of the story, every frame of the movie, every vibration of the music and every breath of its actors says a big fvck you to the masala movie genre that has put filth in the minds of the Indian cinema goers who have no ounce of respect or patience left in their useless minds to devour such delicacies. Powerful writing and explosive acting. Mr Bhardwaj has the chutzpah!",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "Kashmir: broken lives; false promises; shredded dreams; all glued in blood in an intricate knot of human wretchedness on a heavenly stage. Vishal Bhardwaj skips the cliche and with mastery of the grandest of weavers, untangles, unthreads and then magically weaves it all back into a Shakespearean tragedy that is hypnotically beautiful yet relentlessly macabre. Haider is a masterpiece, no lesser word would do.",
            "review_date": "2014-10-02",
            "source": "rt"
        }
    ]
}