{
    "rating": 8.9,
    "release_date": "2014-09-26",
    "num_reviews": 330,
    "genres": [
        "Comedy",
        "Drama",
        "Lgbtq+"
    ],
    "summary": "Realizing that they share common foes in Margaret Thatcher, the police and the conservative press, London-based gays and lesbians lend their support to striking coal miners in 1984 Wales.",
    "reviews": [
        {
            "content": "Powerful retelling of the miners' strike in 1984 when a group of gay and lesbian friends travel from London to a small village in Wales to join the miners' cause.  Great acting, great cast, with a realistic approach to a difficult culture in the early 80s.  I highly recommend.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie, fun and feel good.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched for the third or fourth time and lost my bodyweight in tears of joy and sorrow. It may take some liberties with what really happened, but the fact that anything like this happened at all is worth celebrating. A joyous movie and an education - can't say that for too many films can you?!?",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly refreshing and full of hope on the cause for human rights. ",
            "review_date": "2022-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical British movie perhaps - well acted, amusing screenplay, effective moments - but leaving the slight impression that this is not the harsh reality of what happened. Britain as a fantasy world rooted in reality but departing from it when entertainment and emotion require. Not that I disagree with the values, on the contrary. Just that some other cinema traditions (e.g. Italian) would give it a more powerful treatment although to be honest that is not always what you want.",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lovely movie with laughs and a real feel good factor.",
            "review_date": "2022-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and a real crowd pleaser. Does a great job tackling big issues and historical events, without it letting it get too much.",
            "review_date": "2022-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVED this movie, it truly is one of the best films I've ever seen. Bravo to the filmmakers, the crew and the cast for such a fantastically made movie about a great topic, people from all walks of life and backgrounds coming together to fight injustice. I can't believe I had never heard of it before and just came across it on prime by complete chance as I was searching.",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Amazing finale! And most importantly, this is all a real story and not fiction!",
            "review_date": "2022-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Workers' rights are human rights, as are gay/lesbian/bi/transgender rights.  This film joyously celebrates them all.",
            "review_date": "2021-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I watched this year. Inspirational and truly Epic!!  Must Watch!",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So glad I took a chance on an unknown title. This movie is funny and heartwarming. The fact that it's based on true events just makes it that much more endearing.",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. It shows what can happen when two diverse groups with the same issues can talk and get to understand each others world. They are not so different. We could all learn about compassion and empathy, especially in these time.",
            "review_date": "2020-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fantastic film and a true story too. A very inspirational tale that happened in 1984 when a group of gay campaigners decided to fight for the miners. The films shows how the group was faced with prejudice but as time went on things began to change . The final scene is tearjerking as the miners turn up for pride, There are some gaffs in the film such as PVC Doors and windows that were not around in 1984 in the welsh valleys neither were black weely bins! But a wonderful story, sad that Mark Ashton died in 1987, but what an inspirational young man.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uplifting and fun and powerful, this movie is a must see.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Had no idea this actually happened.",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on true events, this portrays the link between gay rights and mining union activists. Sympathetic and humorous treatment of characters and events.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart warming and believable.",
            "review_date": "2020-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heartfelt funny and important. The characters were interesting and relatable. Fascinating story.",
            "review_date": "2020-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both heartfelt and hilarious. This is a story of social issues that will stick with you after viewing.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching, memorable, and an important message about communities coming together. Wonderful and believable performances by all.",
            "review_date": "2020-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BEE-PROUD \nReview\nA historical comedy-drama film Pride is a 2014 British LGBT-related film written by Stephen Beresford and directed by Matthew Warchus. It is the perfect film for those who want to watch a educative but also a super fun movie. The film was released on 23 May 2014 in Cannes film Festival and on 12 September 2014 in the United Kingdom.   \nI did admire the film so much because the film is political and tells a true story about gays and lesbians that support the miners. I can understand why this very beautiful story was nominated for the Golden Globe Award for Best Motion Picture – Musical or Comedy and for the BAFTA for Best British Film, Best Actress in a Supporting Role for Imelda Staunton ( she was in the film a member of the strike committee), and for outstanding debut by a British writer, director or producer.\nPeople who know about the British mine strikes will see that there is more than just a strike. The film \"Pride\" is about a shy gay boy who hasn't yet come out of the closet for his parents. He goes to London to study but meanwhile he also goes to the gay prides. The boy sees a group of lesbian and gays and joins them. This group is planning to start a campaign titled \"gays and lesbians support the miners\". With this campaign they want to collect money for the miners who are victim of stagflation and they have become poor as a consequence that they don't have a lot at home to eat. They wanted to donate the money that they have collected to a trade union. They often were rejected because they were gay but there was one union that did accept them but the citizens of the village didn't accept them. There will be a discussion between the two groups and after a blessing in disguise it is beautiful how it creates a bond between them.\nWhen I watched the movie with my friends I didn't know what the movie was about. I thought that it was a movie made for LGBTQ but it was more than that. It wasn't a movie for them only, it is also a movie you can watch with friends or with your class, you can even watch it with your family at home. This film can change your way of looking at gays, not in a sexual way, but in a way that makes you realize what they have to deal with.\nThe movie is political because it is about workers who stand up for their rights and are protesting on the streets. The film was excellent, it showed discrimination and how the prejudiced group learns that they made a mistake by judging. I also found it sad  for the boy whose parents didn't accept him because he was gay. I was watching the film worriedly about this boy, I wanted to know what was going to happen with him. All the ingredients of a feel-good film are present. The combination of moving elements, humour and personal development is reminiscent of films such as ‘Billy Eliott' or ‘The Full Monty', a list to which this film can certainly be added.\nPride is one of those rare films with content, entertainment and soul. It is also very funny but has also his sad parts. Some parts of the movie can really give you goosebumps or even a tear.I really did enjoy the film ‘Pride'. We need more beautiful and learning stories like this one based on true stories with a successful cast like this one. The film was so powerful I held back from crying but couldn't resist the bittersweet tears of joy that were coming.",
            "review_date": "2019-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing.\nHeartfelt, funny, emotional",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful uplifting film that tells a great story in a humorous and very British way.",
            "review_date": "2019-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story about the power of solidarity, true solidarity, between two groups who have more in common than they ever thought they'd be willing to admit.",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant film. Uses comedy to sway those less inclined to like it, serious when it needs to be. Brilliant acting. Beautiful film.",
            "review_date": "2019-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Specifically, it's a struggle in 1984, Wales & London. Universally, it's the lesson that we're stronger together, and together we find seemingly disparate populations share the same values: fairness, integrity, fulfillment, joy, love and friendship - belonging and self-determination. No finger-wagging here. The characters are complex and delightful. Top notch acting. Stunning cinematography. A true tale beautifully told with cheek and heart! And absolutely relevant in 2019.",
            "review_date": "2019-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Important history. Long and a bit corny in places.",
            "review_date": "2018-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful work, Laughed and cried. Wonderful cast, charecter design and production design",
            "review_date": "2018-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure joy, along with a few tears.",
            "review_date": "2018-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tackling both the issues of 80s Miner strikes and the rampant homophobia prevalent at the time, Pride juggles both issues without ever losing balance. A top-notch cast takes us on an odyssey across a country stricken by political upheaval and social unrest. I loved the parallels it made between miners fighting for their rights and the LGBT community fighting just to be accepted by a group they're trying to help but who offer nothing but insults and hostilities in return. Far from being a sombre, depressing affair, the movie is very uplifting and life-affirming, filled with slick humour and realistic characters. I felt that the Miner's town's acceptance of their new allies happened oddly fast for some members, and the lead character's abandoning of the group only to come back later is a very hackneyed plot twist, so much so that it's not even a twist anymore. But these little niggles did not hamper my enjoyment of the movie as a whole. The screenplay is witty and profound, the acting is excellent, its full of great character development and little subplots which all demonstrate how much of an impact the event had on those involved, its tender moments are never overdone and the tone is never oversentimental. It will bring even the stoniest of cinemagoers tears, and I say that anyone who has ever experienced even a sliver of discrimination should put this film at the top of their 'to-see' list.",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love love love everything about this film",
            "review_date": "2018-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3/29/2018\nInspired by amazingly true events in 80's Great Britain, the movie tackled several issues during that decade and added some comedic and personal touch to its situations and characters.",
            "review_date": "2018-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels authentic, never gets too sentimental, balancing the drama of the difficult and challenging circumstances these people faced, with a decent amount of humour. Great performances by all.",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Welsh Minors + LGBT History + Bronski Beat. \n\nWhat is not to like? \n\nIn divided times such as these, this film takes on even more significance and stands as a marker for future generations to understand the plight of the Thatcher era for those at the fringes of the masses. \n\nYou will certainly laugh and cry in equal parts.",
            "review_date": "2017-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is a 2014 British LGBT-related historical comedy-drama film directed by Matthew Warchus.\nBased on a true story this does tell a good story, though as a movie it has its flaws. The ending is quite moving.\nGGNC",
            "review_date": "2017-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried and laughed. Great film",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bloody Brilliant. Loved it!!!!!!",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story, in 1984 in the United Kingdom, realising that they share common foes in Margaret Thatcher, gay and lesbian activists lend their support to the National Union of Mineworkers. After their initial refusal, the two groups discover that standing together makes for the strongest union of all. It is an inspiring movie indeed that is thought-provoking and clearly an example of what solidarity and tolerance really can accomplish. Really good acting and sometimes even funny and great.",
            "review_date": "2017-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The type of film that Britain does best, almost a direct transition from the likes of 'Brassed Off', 'The Full Monty' and 'Billy Elliot'.  The story is great, I can't vouch for how true to events it is but it's so moving I almost don't really care.  A film absolutely stuck to the rafters of character actors doing really great work, seek it out.  Excellent.",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever, should be more like it. It just go's to show we all can work together",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a fantastic movie I tend to re watch it time and time again! Its inspiring, lovable and very well done!",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story.  Awful film.  A 'feel-good' 80's tune (akin to 'Walking on Sunshine'), or \"inspirational\" music swell (akin to the 'Love lift us up' ending in An Officer & a Gentleman) EVERY two minutes.  Almost no character development.  Lazy filmmaking at its worst. Wait!  Let's throw-in a 'gays teach straight-guys how to dance' scene!  Skip it & read the wikipedia entry for better entertainment value; a real wasted opportunity here.",
            "review_date": "2017-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Irritating and sentimental drama, well acted by reliable performers like Bill Nighy (struggling with a Welsh accent) and Paddy Considine, but hampered by a script that treads water and seems very contrived and old-fashioned. Very much in the school of Billy Elliot, Full Monty and Brassed Off. Production design is very accurate.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, charming movie.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a great film!! awesome good feeling movie about how 2 completely different causes that were struggling started supporting each other for a common well. \nI´m such a tear jerker, I cry with almost every film that touch my heart, i´m very easy to cry, but this movie totally deserves my tears, beautifully crafted, with a really great cast, every character in the movie adds the nessesary to the story, all of them are awesome, but if I´d have to choose one, i´d say Bill Nighy. \nsuch a cheerfull film, I think is a must see not just for britains, but for everybody who still believes in humanity.\npride is in my heart when I see films like this one.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "most joyful and courageous movie  ive ever seen",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous story and very funny too.",
            "review_date": "2017-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a fan of people vs. Gov.",
            "review_date": "2017-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PRIDE portrays the unlikely alliance and friendship formed between a small group of gay activists and striking Welsh miners during the mid-1980s. Those days seem like a different world and while we take the rights and acceptance won by the LGBT movement in the UK pretty much for granted and this movie is a timely reminder of just how hard won those rights were. This is most definitely a feel good movie and there is little illustration of the hardships faced by the miners who were on strike for so many months. However the movie has tremendous good heart and is told in a warm and humorous manner, with some genuine belly laughs along the way. There's a terrific ensemble cast headed by Imelda Staunton and Bill Nighy who play the leaders of the village. The improbable alliance they form with the young gay activists is touching and inspirational and there really isn't much not to enjoy about this great little movie.",
            "review_date": "2017-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great historical fiction movie, really funny lines, and a very uplifting story. Plus very strong acting and writing throughout the entire movie.",
            "review_date": "2017-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining and warm-hearted, Pride depicts a dark and gloomy era for these minority groups with such charm and authenticity.",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crying continuously through this because of the sheer amount of FEELS! Gah!",
            "review_date": "2016-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply a fun, emotional and entertaining movie about the struggle of the underdog. Absolutely love it!",
            "review_date": "2016-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I believe this movie offers an interesting view and comparison in struggle. Great script/story told here.",
            "review_date": "2016-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed and I cried cried cried!",
            "review_date": "2016-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great feel-good movie celebrating solidarity and tolerance. The set-up in the 80s feels authentic, thanks to the fitting soundtrack and costumes. The great acting, especially by Bill Nighy, who has some of the best scenes, makes it enjoyable and very entertaining to follow the characters through their ups and downs. While the second half has a few more serious tones than the first, it also makes the film much more interesting and the mix always works.",
            "review_date": "2016-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a brilliant film and true - lovely!",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a really good film",
            "review_date": "2016-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This retelling of the unusual friendship of coal miners' families and homosexualists amid the UK miners' strike of 1984-85 is unfortunately laboriously formulaic.",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The critical importance of Gay & Labor solidarity at the height of Thatcher anti union crusade against the Welch miners to the mutual benefit of both movements. Left me teary eyed in the end.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better history lesson than that Terrance Howard movie.",
            "review_date": "2016-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and all what you want ...good movieweek again  ! Interesting",
            "review_date": "2016-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a queer person, this movie is so good. What i really love about it is this group of gays and lesbians decide to help another oppressed group and these strangers, the miners, most of them just totally accept the group and these strangers are just supporting each other through their oppression and I find it amazing how some strangers can accept you better and more than ppl you thought were friends and family.",
            "review_date": "2016-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an interesting moment in socialist/gay history, but being only a moment means there's not enough there for a two hour film.",
            "review_date": "2016-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an excellent film in the vein of \"The Full Monty\" and \"Billy Elliot\".  Based on a true story in the mid-eighties of  gay and lesbian activists supporting and raising money for miners.  Cynical people can view the film as manipulative and cloying, but to me it seemed inspiring and positive.  The acting is top-notch, Imelda Staunton is becoming a favourite of mine, and Bill Nighy makes any film he's in better.  Seek it out!",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An important, moving, hilarious movie and a brilliant cast.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching. Brings back to life the times, personalities and struggles, showing how working together can bring major results.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful little feel good movie, perfect balance of tugging on the heart strings while keeping you laughing about a story to strange and lovely to be fiction. Highly recommend!",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh, I loved it. made me very emotional. it was a very British movie and it was wonderful. I teared up at the end.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not what I expected, but overall a worthy piece of cinematography.",
            "review_date": "2016-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very typical British comedy about how the lesbian and gay rights campaigners put their support behind the striking miners, in particular a small welsh village community not used to having alternative types around. Interesting true story but a fairly lame comedy.",
            "review_date": "2016-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was based on the true story of the 80s-era gay support for the miners' strike in the UK. The story was heart-warming, the acting was solid, and the sound track was superb. It reminded me of Priscilla Queen of the Desert, but without drag queens and with miners ... so not really similar except for great music and gays.",
            "review_date": "2016-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood (even in the UK) loves to use big speeches to oversimplify important issues, and this movie is no exception.  That being said, I couldn't help being engaged in its likable cast of characters and strong message of tolerance.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly wonderful movie that shows what people can do, if they overcome their prejudices, and join together to fight injustice. We are all human and should act as the name implies--humane.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching and enjoyable film",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*** Average\nThe British film \"Pride\" is based on the true story of U.K. gay activists' work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984. It was a story that I had not heard of before. Director Matthew Warchus' was sure to bring some inspirational elements of the film on how two opposite polar groups can work together for civil rights and fair labor. But Warchus' was sure to implore us with the aforementioned concept a few too times to many; as worthy as the concept is. I am a big fan of 80's New Wave Retro music, so I was very proud of \"Pride\" to include some U.K. New Wave classics. The ensemble acting was commendable but not sensational; which included Ben Schnetzner as U.K. gay activist leader Mark, Dominic West as the flamboyant Jonathan, and Imelda Stanton as a Miner Committee Member. \"Pride\" is not the biggest pride film piece from the 2014 movie year, but it has enough activist gravitas to give it a shout.",
            "review_date": "2015-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally entertaining. Emotional and funny.",
            "review_date": "2015-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I love good movies about the triumphs of the LGBT community, this is not one of them.  Sure, the critics will disagree with me, and that is fine.  I just found this to be nothing but a HUGE waste of time.  I will never sit through this again.",
            "review_date": "2015-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those movies I don't want to pick apart - just like and enjoy. Funny and loving. Homophobes and right wingers need not apply.",
            "review_date": "2015-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like Billy Eilliot, Pride takes place during the coal miner's strike in UK. It addresses many issues apart from telling the tale of a group of homosexuals helping to raise funds for the coal miners. It seems like the director has not made up his mind which direction he wants this movie to go. As a drama, it is not dramatic. As a comedy, it is not light enough. As a documentary, it has many fictitious moments. In the end, it feels neither here or there.",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a kind of movie you leave the theater feeling good about what humans are capable of without leaving viewers feel it's contrived and resorting to our sentimentality. It's genuinely moving and inspiring with splendid story telling.",
            "review_date": "2015-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny as hell, well acted, and beautiful.",
            "review_date": "2015-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may well be the feel-goodiest of all feel-good movies.  This little-known gem of a film is about the incredibly implausible yet true story of how a tiny gay rights group in London allied with a blue-collar mining community in Wales to support the miners during a year-long strike.  In 1984.  Think about that for a minute... in 1984, people didn't even realize Liberace was gay.  I had no idea these events had even occurred, and it's such an unlikely story that after the credits rolled, I spent some time reading up about it just to make sure it was actually true.  But it is.  It's a truly remarkable and uplifting story and one that I am so glad they put on film.  In our tragedy-obsessed culture, it's such a relief to see a movie that focuses on how awesome people can be to each other, instead of the atrocities we commit against each other.  In addition to being just a great story, it's well-told, well-acted all round, and really funny in parts (including some clever winks at the audience).  The film stays on point until the last 30 minutes, where it loses its focus and veers off into subplots, but I can't fault it too much for that.  You can't really make a movie involving gay men in the '80s that doesn't even touch on the perils of being out-of-the-closet, or the huge impact that HIV/AIDS was having on the community at the time.  But the clear message is how a small group of people can overcome adversity and make a huge impact on not just their community, but the world.  This film will warm the heart of even the most jaded of souls, and the ending moved me more than I care to admit.  \"Pride\" is aptly named, as after watching it, I felt proud of all of those people, and proud to be a member of the human race for a change. ",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful, heartfelt and funny film.",
            "review_date": "2015-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic... \n:)",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb, true through and through, well observed and written - real people doing incredible things, a timely reminder to us all how important it's to speak out",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a lovely, well made film with a strong central message prevalent throughout, great performances, solid direction, a smart script, and a sense of heart throughout. a feel good film, entertaining film that doesn't (thankfully) get too preachy or overly sentimental.",
            "review_date": "2015-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of gay activists organize a protest in support of Welsh miners who have been victimized by Margaret Thatcher's policies.\nIt's hard to make a heart-warming movie. With too many positive scenes a film can flounder for conflict and fail to progress. But Pride manages to be thoroughly heart-warming and keep moving. The film progresses from intra-group interpersonal conflicts, which are funny and occasionally moving, to inter-group awkwardness, which are just as funny. The film's serious moments don't ward off its charm, and the cast is equally accomplished throughout.\nOverall, this is an excellent, uplifting film.",
            "review_date": "2015-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't expect to like this as much as I did, it's a little schmaltzy in places and there seems to be a lot of jokes told at the expense of the lesbian characters rather than anyone else but overall it's a feel good movie about friendship and solidarity that will put a smile on your face.",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feel good story from a time when both groups depicted faced difficult times.  There's a certain genericness to this type of screenplay but it remains a decent watch nonetheless.",
            "review_date": "2015-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love, love, loved this feel good wonderfulness. So glad the world has changed so much from the 80s.",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit preachy, personally I preferred Pricilla Queen of the Desert. Following in the tradition of Brassed off and The Full Monty even Calendar Girls. You have to admit it's what the British film industry does exceedingly well.",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride [UK, 2014] In which inspiring LGBT people fight for the rights of another oppressed community. A film about acceptance, respect, solidarity, and finding friendship amidst homophobia and union battles. It is truly uplifting and heartwarming. 9/10",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hugely enjoyable comedy drama based on a gay and lesbian support group during the miners strike. Based on true events.",
            "review_date": "2015-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, definitely recommend everyone in the lgtb community & out to watch this film!",
            "review_date": "2015-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has Professor Umbridge in it so of course I had to watch it.",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gay issues aside, this is a good watch...",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Went straight to my favorites list!",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched most of it with tears in my eyes, such an inspirational movie, I loved the dancing and the singing scenes but the ending was epic. One of the best movies I've seen about gays and support.",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heartwarming and wonderful. and I teared up at the end",
            "review_date": "2015-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is just a fantastically uplifting film, not sickly sweet, just a decent dramatisation of real events, of which the associated background doc with the DVD is really interesting.  Just watch it!",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is a powerful testimony to the ability of small acts of kindness to start a solidarity storm that fights the good fight against hegemony. May we always have unknown and unexpected friends in our life struggles.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant movie to make you cry with joy",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensational! Inspirational without being preachy or mushy!  You may not know any of the actors/actresses but it's done with so much heart, you won't care! I genuinely teared up and that hasn't happened in quite some time! Go see it!",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring, funny and moving, Pride is a heart-warming little-known true story of courage, conviction and the forging of an alliance between two unlikely comrades-in-arms against discrimination and bigotry.\n\nIn the summer of 1984, Brittan was at an impasse. Tensions flared between an unsympathetic government lead by PM Maggie Thatcher and the National Union of Mineworkers on a long contentious strike.\n\nAt the annual Gay pride march in London, a group of passionate activists decide to show their solidarity for the miners plight by raising money and banding together to form the LGSM (Lesbian and Gay Support Miners).\n\nThe only issue, the unions are embarrassed to receive 'their' support. Unperturbed by initial rebuttals, the LGSM randomly selected the small rural Welsh mining town of Dulais and descend to show their staunch support, handover the money raised and break down conservative prejudicial barriers.\n\nTV actor Stephen Beresford's terrific screenplay is not yet another sorry tale of victimhood, but one of civil rights. His utterly compelling story is full of heart and conviction as well as tangible sense of the era allowing viewers to truly grasp the hopeless situation that was the 1984/5 strike.\n\nThe tapestry of emotions felt by those involved is wonderfully showcased through an outstanding to-many-to-mention cast whose comedic timing is only surpassed by their dramatic acumen, this really is a case where only the trademark British wit and restraint could pull of such an enjoyable cinematic experience.  \n\nThe verdict: A deserved crowd-pleaser down to its rousing finale.\n\nPublished : Canberra Weekly Magazine\nDate of Publication : 14/11/2015",
            "review_date": "2015-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so many highs and lows but a very heartfelt film",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute little film bringing to life an important story in English Gay rights history.  They played it very safe on this one, but it still works.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching story that is worth seeing.",
            "review_date": "2015-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable movie, especially knowing it's true.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming movie if I've ever seen one. I found myself laughing and crying in turns. While I do think it was disappointing that it pinkwashed and sanitized the fight for gay rights in the 80s, and didn't truly approach other topics important in the day (such as AIDS and police violence), I do think it's a film that's truly representative of the constant struggle of civil rights activists: how important it is to work for ALL rights, not just yours.\n\nEach character was well-filled out and real. Despite the pinkwashing and sanitizing, it was a thoroughly enjoyable movie that everyone should watch. I also did like that there was no bullshit romantic love triangle, despite the fact that I expected one. It was a historical film that honored the point of a historical film: to tell history, not to add a love triangle.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dedicated group of actors band together to support a cause that matters. I say actors because none of the characters were particularly well defined, and I do not mention the cause because it doesn't really matter. The actors did a nice job and it was well directed, but I've seen this movie before and I've seen it better.",
            "review_date": "2015-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely depiction of the Miners' strike, and the fundraising  (and solidarity) from LGBT community. A period piece that actually makes you more contemplative about what has come since. The closing of the pits, AIDS and gay marriage.\n\nInterestingly AIDS was my one bugbear. They play the \"don't die of ignorance\" tv ad, which was from 1987 and not 1984. Minor point (see what i did there), as this is a lovely film about solidarity and compassion.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good movie. I didn't know what to make of it when we started watching but it was brilliant. oh the feels.",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My buttons were effectively, if unsubtly, pushed. A couple of the lead characters were underwritten / stereotypical, but many of the performances were strong. Most importantly, this is a story that deserves to be heard, and it's interesting to see, in the span of my lifetime, how far Britain has come in terms of tolerance and how far it has slipped in terms of solidarity.",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching portrayal of a true story. Definitely worth a second watch for me.",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though about ten minutes too long, Pride is still a hilarious feel-good film with strong work from a great cast (Paddy Considine and Imelda Staunton are the standouts) and a great script that takes a bleak situation and manages to tell a heartwarming and hopeful tale of social cooperation and empathy. Also, ignore the 15 rating - this is a fantastic film for young teens and anyone older.",
            "review_date": "2015-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Up until last week I never even heard of this one, but this film's infectious upbeat vibe quickly won me over. In telling the true story of an alliance between LGBT activist & striking mine workers Pride demonstrates how just being yourself can be a revolutionary act",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth watching. Two causes come together.",
            "review_date": "2015-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would be 5 stars if it weren't for the clichÃ©s and unnecessary (poorly executed) comedic fluff. Still an entertaining and inspirational little film. Worth seeing if only to gain a greater awareness of the true story on which the movie is based. Also the soundtrack is pretty fun too!",
            "review_date": "2015-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected to hate this film. I figured it would be a cliche-fest with a TV Movie-of-the-Week feel and production values. I was very wrong. Yes, some of the characters are a bit cliched, but the story (a true story, unknown to me) is powerful and inspiring. A lot of unknown actors (at least to me), but Bill Nighy and Imelda Staunton shine in supporting roles. I can forgive its flaws because it's a story that needed to be told.",
            "review_date": "2015-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comedy/Drama of a true story centred around the year long coal strike in the UK in 1984. An unlikely alliance is formed by some members of the gay movement and coalminers in South Wales.\nFocusing on gay rights primarily amongst the backdrop of the coal dispute.\nA history lesson not only about the dispute which Ive read, seen and heard lots about from various viewpoints but about the quite anarchic gay rights in the UK in 1984.\nSome excellent performances by the cast that includes Bill Nighy, Paddy Considine and Imelda Staunton.\nDue to the events depicted in this film legislation changed in the Labour Party and the nation in years ahead.\nSimilar in tone to other British films from recent times like Billy Elliott and The Full Monty in terms of working class industrial Britain that has decayed and strong casts.",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Made me laugh. Made me cry. Great characters. Great cast.",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, Awesome, Sweet...the cast including Nighy, Staunton, and Andrew Scott( Moriarty!!!!) are perfection.",
            "review_date": "2015-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, bread we fight for, but we fight for Roses, too! (in a charming Welsh accent)",
            "review_date": "2015-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A loveable, inspiring, wildly entertaining true-story movie from beginning to end! \"Pride\" benefits from a unique story, witty writing from Stephen Beresford, dedicated direction by Matthew Warchus, and a terrific cast.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great message, characters, scenery and it's true. Very glad I gave this movie a chance; all the actors are interesting.",
            "review_date": "2015-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matthew Warchus' direction is spectacular. A well balanced seesaw of emotional hills and valleys tell the story of a young group of gay and lesbian Londoners randomly select a group in need of their fund raising support. Thusly, The Miners from Wales strike served that need and the film relays the story of how the two unlikely groups united as one. \n\nBrilliant Direction and some scenes were so powerful without even a word being spoken, yet the story was told. \n\nThank goodness for the European Film Festival of Trinidad and Tobago, else great films such as this will never be shown on main stream cinema.\n\nIf you have another opportunity, go see this film",
            "review_date": "2015-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart-warming and humorous.",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like all recent colourful British films centred around real figures or historic moments it is overly diluted. The interesting storylines here are sieved through leaving the audience something \"nice\" and inoffensive.",
            "review_date": "2015-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie, enjoyable comedy.",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Want to give a shout-out to this wonderful film that may not be on many people's radars. Such a touching story about how London's LGBT community comes to the aid of Welsh mine workers, figuring they have more in common than not, but at least at first, the Welsh miners don't feel the same. Based on a true story during the beginning of the AIDS epidemic, this film is incredibly moving and has some great one-liners. Plus, \"Wire\" fans: if you've only seen Dominic West as McNulty, you are in for an extra-special treat.",
            "review_date": "2015-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review:\nI quite enjoyed this touching true story about a group of gay and lesbian activists who come together to raise money for the families of miners during the miners strike in London, when Margaret Thatcher was in power. As the movie was based around the 80's, there was a lot of prejudice against the gay and lesbian community but this movie shows how this group came together and fought against all odds, to raise the money for the Welsh people who were going through such a difficult time. The group also protested for Gay and Lesbian rights, at a time when Aids was the biggest fear for there community, so this movie is a big eye opener to a world which is the norm in today's day to day life. The storyline is great, along with the performances and the witty script which brought some light to a situation were a lot of people were struggling to come to terms with there sexuality. The real footage on the DVD was touching because a lot of the activists were actually in the movie and they get to tell there story of how it was to deal with the true situation. Anyway, it's a well made movie which tells a true story which hasn't been told before so it's definitely worth a watch. Enjoyable!\n\nRound-Up:\nI've always been a fan of Bill Nighy's unique style of acting so I was glad to see him in this film, even though his role wasn't that big. The same goes for Dominic West who also had a small but important role in the film. Most of the rest of the cast have only had small roles in films so I can't really comment on there performances. Paddy Considine has starred in a few movies like the Bourne Ultimatum, Cinderella Man and Hot Fuzz but he's never played the main role. In this movie he played the go between the activists and the miners quite well but it was Dominic West's dancing which really impressed me. The other thing that impressed me was how a small group of people, who had weekly meetings, could have made such a big impact for there community. The amount of people that joined them in the end was touching and I'm glad that they changed a few laws after putting in such a big effort.Â \n\nBudget: N/A\nWorldwide Gross: $14.7million\n\nI recommend this movie to people who are into their powerful dramas about a group of gay and lesbian activists who come together to support the miners strike at a time when there sexuality wasn't that welcomed by many people. 6/10",
            "review_date": "2015-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty cool flick; even better that it's based on true events.",
            "review_date": "2015-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful wonderful wonderful. And if you were mid teens in the mid eighties, like me, (and you know who you are), this will remind you why you are alive.",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great movie. I went in not thinking id pay attention as it was a movie my parents chose. But I enjoyed it thoroughly. Both funny and sad at the same time.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unlikely combo between Gays and lesbians and striking Mine workers in a small Welsh town in 1984 when gay rights were pretty much in the dark even in UK.",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was on the miner's picket lines in Yorkshire; it transformed my life in the political sense. .  While this film doesn't capture what that was like and the brutality of Thatcher's assault on the miners and their communities it is still a very good film about working class life and solidarity.  The small Welsh community could have been West Virginia or Kentucky or any of the miner's communities throughout the world.  The term working class was not used once as far as I could see.  Compared to Hollywood, it's a masterpiece. It's worth watching.",
            "review_date": "2015-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gay activists tries to help out miners during the well known strike of the National Union of Mineworkers back in the mid 80's. They meet some cool people and their chemistry is good. Things like this is not easy to go trough with without meeting loads of hate - from all angles. In this film it goes too easy too often in my opinion. Some speaches turn crowds and minor happenings turn hate to love easily.\n\nWith that said, it's a good film that has loads of warmth and moments. It's not especially funny, but it's never a boring watch.\n\n6.5 out of 10 rainbow flags.",
            "review_date": "2015-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hilarious, spectacular performances, excellent theme, a series of actions that lead the viewer to get inside the movie. technically is well made and should flatter the Director",
            "review_date": "2015-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great take on real life events. 90/100",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is based on the sentimental belief that simple determined acts can make a difference to messy complicated situations. I love it for that!",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nicely portrayed the story. A bit long and a bit uncomfortable but overall a good movie.",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing story. Funny and touching.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie about the miners' strike against Margaret Thatcher and the support that they had a group of homosexuals.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With heart and hope, the film becomes a feel-good triumph of statement.",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I have seen this year! Superb acting and great screenplay! And the music!!! A heart-warming film that shows how divide actually unites!",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story that I wasn't aware of, this is a funny and warm crowd pleaser.  Although the rougher edges are sugar coated, there's a lot to enjoy here",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a truly amazing story. So glad I watched this film. Restores my faith in mankind.",
            "review_date": "2015-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Richard Curtis would have justifiable grounds for a lawsuit given how closely this mimics the Curtis formula - the alternate title could be The Coal Mine That Rocked. Unfortunately a copy of a good film does not necessarily make for a good film, and Pride, while not terrible, just never delivers on the potential of the premise.",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great british film. A must see!",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An account of British gay history when miners and gays and lesbians formed an unlikely alliance to fight Thatcher and the tabloids. Bordering dangerously on sentimentality at times, the film remains on the good side giving the events that unfolded their due. Excellent cast. Bottom line: A lesson in humanity.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels good and I'm proud to say it.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On Netflix.   An unlikely alliance...in 1984 gay and lesbian activists from London see Mineworkers being brutalized by the Thatcher gov't trying to break them.  They decide to help by raising money to support them.  Obviously two very different segments of society collide and the results are quite lovely.  It's a true story and it will leave anyone but the cold hearted with a warm feeling.  Two very different parts of society coming together in solidarity to support each other.  It's interesting and funny and uplifting.  Definitely worth a watch.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.  Interesting story and full characters.  Beautiful cinematics of Wales.  A must see.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid little movie; reminds me of blue-collar Brit comedy/dramas like \"Brassed Off!\" and \"Blow Dry\" from the 90's with a twist.  You can tell it's an English movie because the lesbian couple doesn't look like the typical male-wish fullfillment gay girls on \"Glee,\" \"Sin City\" or anything by Joss Whedon.  Kind of a bummer that Andrew \"Jim Moriarty\" Scott doesn't have more to do, but he's damn good even if he isn't chewing scenery like on \"Sherlock.\"  Funny how the movie's London ca. 1984 gay dudes dress like millennial hipsters.",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny, appropriate and beautiful. This will have you singing, cheering and crying. absolutely bloody brilliant!",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film I have seen for a long time, it is funny but in a way tragic too. Brought back lots of memories from the 80's.",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The BEST film of 2014. Pride made me laugh, cry, and ask where my gays are. Memorable and nostalgic, Pride looks back to a Britain of national struggle, and to a future of national unity.",
            "review_date": "2015-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"TAKE PRIDE...IN WHO YOU ARE.\"",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "strikes are so gay... it's awesome",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little bit of politics. It doesn't matter what side you took. The characters are here - you feel their pain and you feel their pride. Really strong performances - from you really good British Actors. A cracking story - with some really  memorable. Top pick for me is the Dance off in the social club.  Based on a true story. Put everything aside and go and see this.  Its bloody lovely !!",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun movie.  Good story.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not to be missed. The best film l have ever seen",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is a brilliant British movie everyone should actually watch. It's funny and smart and it's about civil rights and friendship and love, you'll enjoy every single part, you'll laugh to every \"waleshly-accented\" joke. Will Nighy and Imelda Stauton are pretty awesome, surely two outstanding actors that will make you want to watch and rewatch Pride forever.",
            "review_date": "2015-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story - gay liberation in London meets miner strikers in Wales. True story of remarkable communist & gay libber who died of AIDS at 26. Great acting - great story!",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant , I laughed I cried , I cried again ! Great movie",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film with some important things for everyone to understand from history. This isn't a film for gays, lesbians or miners. It's one everyone can enjoy and should watch for a laugh, cry and happiness.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally amazing... Laughed, cried and cried laughing! Highly recommended to everyone!!!",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an uplifting drama, about how , two struggling marginal societies of it's era, backing up at each other. Funny, heart-warming, and provocative",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "important, poignant, touching, loving it!",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super film that just flew by.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The answer to many if not most of the worlds problems is contained in this story.  When minorities stop fighting among themselves and join together, they realize they can make a majority.  CDW",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story. Movie about Gays and Lesbians... But it was fun, fresh and heart warming! I think only British people can make a wonderful movie like this! Bill Nighy, Dominic West and Imelda Staunton made small and plain movie looked fantastic! 80s disc songs were great too!",
            "review_date": "2015-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some films when they are in prerelease have so much hype and advertising running behind them that by the time the film is actually released we have seen three or four different trailers that have usually given away all the bets bits of the film leaving a sour and disappointing taste in our mouths and a feeling as though we have just wasted our time once we get around to actually seeing them. Then there are some films that deserve the hype and publicity that only ever get minimal, usually these films belong to a film festival and it's only through word of mouth that they make it to their intended audience. Pride is a film that was first released at the 2014 Cannes Film Festival winning a standing ovation and the Queer Palm award from there it went onto a limited release schedule mostly being involved in Queer Film Festivals around the world.\nPride is a true life story based around the British Miner's Strike in 1984, Margaret Thatcher was Prime Minister and not very popular, not with miners and especially not with the gay and lesbian community either. Joe, a young naïve closeted gay boy arrives in London to take part in his first gay pride march, soon after arriving Joe is taken in by a local gay and lesbian rights activist group who do their part to raise funds to fight their foe Thatcher and her evil ways. Soon after the group realise that both the Miner's and the gay community have a lot in common they make the decision to start raising funds for the families of the miners in a little Welsh town called Onllwyn. The miners reject the gay and lesbian activists money believing it will do more harm than good for their cause so the group unfazed but a little perplexed decide to take the money personally to the town to hand it over and explain their situation and hopefully form a new alliance against the countries Prime Minister and her party...\nPride is set in a very bleak and dark time of British history but I feel that it's never actually shown that way, sure things are dark and gray but I wish the director just added more hardship to his final edit for the film, not being a part of it personally but remembering how harsh it was from school study and other films I have seen over time. I don't think the film was shown as brutally honest as it should have been, from what I know of those days; they were horrid, times were rough and extremely hard, I just wish that it was portrayed a little more than what we were given. That is my only concern with the film, which says a lot I feel. None-the-less it is a fantastic well made, well directed and full of amazing actors that really bring the story to life, the story is really well scripted and the actors chosen in their respective roles have done an amazing job. Staring Bill Nighy (Love Actually, Shaun of the Dead) as Cliff, Imelda Staunton (Maleficent, Vera Drake) as Hefina Headon, Dominic West (John Carter, The Awakening) as Jonathan Blake, Paddy Considine (Hot Fuzz, The World's End) as Dai Donovan, George MacKay (How I live Now, Peter Pan) as Joe \"Bromley\" Cooper who is one of the few fictional characters created for the film and a whole heap of others, it is actually a very great cast everyone did their part to make the film work. As I said earlier the cinematography of the film was good I just wish it was darker like the times it is set in. The director and his crew have done a great job with this film written by Stephen Beresford and directed by Matthew Warchus (Simpatico).\nPride is a feel good film with a fantastic story that can be shared with all your loved ones, there are a couple of scenes that may be a deemed a little over the top but perhaps you can use that to answer some curious minds if questions are asked. Pride is an amazing story that brings two very different worlds together for one great cause.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching, potent, and a little bit magical.",
            "review_date": "2015-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible achievement.  A movie that has the power to inspire, uplift and restore ones faith in the human experiment.  One of the best films of the year.",
            "review_date": "2015-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie, I found this both hilarious and emotional. Filmed up the road from where I live, this film is about the gays supporting the miners during the strike. Old lady \"Is it true all lesbians are vegetarian?\" - Lesbians \"actually we are vegan\" :)",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's most interesting in Pride, is the ability to cross and cover some major issues like social and political stuggle, family patterns and social prejudice. It never fully succeeds but it's a good shot and definitely an enjoyable watch altogether. Quite good performances, especially from veteran actors and actresses. It's so typically English but with all the good elements an English production might possesses.\nAt the end it's all about \"Solidarity\" that we all people should rediscover and utilise for our own good.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's disconcerting when the news of your childhood becomes the historical movies of your adulthood. Pride did nothing if not confirm for me that I have officially hit middle-age. \n\nIt's a British comedic-drama about events during the Miners Strike in the UK of 1984 (I was 11, just about aware of what was going on in the wider-world). It focuses on two small communities: one is a small mining town in Wales of the sort that suffered most during that time. The other is a London-based group of gay and lesbian people who form LGSM (Lesbians and Gays Support the Miners). They take on the small Welsh community as a project for which to fundraise. The film is that story, of unlikely friendships and culture-clashes. In tone it is closes to British comedies like The Full Monty or Brassed Off; an edge of social realism and a triumph of underdogs storyline. \n\nThere's some fine performances - Bill Nighy is at his understated best, drawing laughs at times without uttering a word; the comedic tone sits well with some serious themes of social distress and prejudice and it's hard not to leave the cinema without at least a small air-punch of satisfaction at the film's feel good narrative arc. \n\nIt's not without flaws though. Some things just seem a little too easy to be true; did they really, for instance, break into singing that easily in the minibus? At times the adventures of the London-based characters come off too much like a school outing rather than engaging with one of the biggest social issues of the day. More seriously is an overly romantic view of history. The miners' strike was a brutal and painful period of British history for all sorts of reasons, not least because it fractured families and communities. The film presents to us a picture of communities and towns united in their stand; I can't speak for the individual town in question, but the brutal reality of the strike is that it was opposed from within the community of miners as well as by the government. Members of families fell into bitter, lifelong dispute; strike-breakers were, and maybe still are, 'scabs'. All this because some felt they and their families couldn't pay the price of their families' well-being. It's tempting to, as the film does, to play the strike as a unified struggle; but it wasn't and it does a grave injustice to the complexity of real people in unimaginably difficult situations to pretend otherwise. \n\nNone of this detracts from the joy of the film; it should also be noted, though, that the nature of the film means that the humour is broader than The Full Monty (it really is); and sometimes that too (especially towards the end) seems a bit too easy to be true. The film also suffers slightly from Return Of The King-itis in that seems to have about three endings. By the time the last one rolled around I was ready for the film to actually end.\n\nIt doesn't outstay its welcome, though. The reservations are real, but not major problems.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fab Brit Com based on a true story. You'll laugh, you'll giggle, you'll shed a tear or two, but remember that true stories like this aren't about people who sit on their arse reading film reviews on Facebook but by those who actually inspire their community (political or geographic) to embrace a cause and fight for what they believe in and overcome prejudice and distrust along the way.  Love this film  :)",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good brit-flick with superb performances from a stellar ensemble cast. It's worth watching if only for Dominic West's dancing!",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The surprise gem of the year! A feel good flick without the artificial sweetener.",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PRIDE is an uplifting UK dramedy revamps the postures of various people in the actual events of LGSM (Lesbians and Gays Support Miners) movement in the summer of 1984, but it overtly dodges the over-used \"based on a true story\" troupe, and artistically gives the story some polishing in terms of some morale boost. \n\nJoe (MacKay) is a young student, and being the surrogate for audience, he firstly engages in the 1984 London gay parade with wide-eyed novelty and closeted reluctance, and half-heartedly he becomes a founding member of new-coined LGSM group, lead by an avid 24-year-old activist Mark (Schnetzer). The film starts its narrative quite flamboyantly in the gay parade and quickly steers onto the thorny issue, to raise money for the UK miners who are under the same predicament where LGBT minority is, the mineworkers'  union starts a strike would last for more than one year.  \nkeep reading my review on my blog: http://wp.me/p1eXom-1Nw",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story that was screaming to be told and now has been with style and dignity. This wonderful and inspiring film highlights unity and acceptance using actors at the top of their game. The range of emotions are plundered leaving a contented glow afterwards. Cinema like this leaves you with a smile on your face and a hunger for more great stories that enlighten you to true events.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't fancy this at first but it was really good, it's mad to think this happened not that long ago",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, the film does trade in the occasional cliché, but it does so with a light hand and it's large ensemble cast really couldn't be much better. Why don't we do this stuff as well as the Brits do it in American films?",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute and inspirational enough.  Nothing particularly dynamic, but a pleasant diversion.  It's interesting how dated this feels.",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just so much better than I was expecting and I was expecting brilliant. You have to watch this!!!",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly enjoyed this film. Kinda of a gay history lesson. Great humanising film , should be seen and shown to all. A real warm fuzzy type film (but the epilogue killed me). \n\nFound the whole us release issue very strange. Why does a film with NO SEX, MINIMAL VIOLENCE AND PRETTY INOFFENSIVE LANGUAGE get an R RATING.",
            "review_date": "2015-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Funny and heartfelt and would only for short for those who lack an open mind. Characters are lovable, and the message is strong. See it!",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This legitimately inspirational and thoroughly-feel-good movie is about an unusual but extraordinary slice of history involving the solidarity of a gay-and-lesbian activist group and the National Union of Mineworkers during the London strikes of the Thatcher era. Matthew Warchus directs with the chutzpah of a movie musical (I wouldn't be surprised if it wasn't already being optioned for stage adaptation), gravitating effortlessly from crowd-pleasing moments of light-heartedness to surprisingly effective emotional beats. He is aided completely by his stellar cast, an ensemble of such character and nuance that maintain an element of sincerity even in the film's more formulaic segments.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a total feel-good movie, with a great soundtrack and great performances all around. It's based on a true story, and the last scene made me smile from ear-to-ear and feel warm and fuzzy all over. However, the movie also reminded me how vile and despicable Margaret Thatcher was, an unpleasant memory that I needed to quickly excise.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving and enjoyable, good characters all with different problems and responses and resolutions to them.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant! Had the movie aired in 1984, the miners would've won!",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Community history 101.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring plot and history to produce the full package. This is what movies inspired in true events should be done!",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A custom-made crowd pleaser brimming with good intentions, this Pride-ful presentation of oftentimes harrowing real events nonetheless ends up to be moving, earnest, and oftentimes fun in all the right places even when you feel your strings being pulled. An unlikely true story of an unlikely alliance that's unlikely well done, Pride tells the plight of both striking Welsh miners and the hugely persecuted English homosexual community in equal and genuine measure. A heat-seeking crowd-pleaser, the film comes damn close to becoming mawkish without actually tipping over the edge. The climax, for example, assumes a tone that almost feels a bit too cheeky.almost. Regardless, the dynamite performances and rich storytelling always come across as truthful throughout this production, however manufactured it feels. You've hear of designer drugs, eh? Here is a designer feel-good flick and it likewise plays with your body's chemical makeup to make you feel good.\n\nIn this R-rated dramedy available on DVD and download, U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984. \n\nBoasting a theater CV that includes Ghost: The Musical, Matthew Warchus deftly directs the goings-on with a nimble footed swagger, literally making your toes tap. For a non-musical, this is an impressive feat. For Pride, however, it also proves appropriate. Bill Nighy, Imelda Staunton, Dominic West, Paddy Considine, and Andrew Scott (the wicked wicked Moriarity to Benedict Cumberbatch's wily Sherlock on the BBC) play beaten-down and sometimes tragic figures, but they bring a resolve and vigor to their characters that you never feel sorry for them--just, well, proud. Their performances and the direction get you on your feet in solidarity, yes, but a good deal of credit also goes to the screenwriter. Stephen Beresford's script effortlessly hopscotches from bleak to hilarious moments and back again in a manner that somehow remains reverential to both.\n\nBottom line: Heart O' Miner",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Outstanding performances which engages you throughout the film.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome film about people overcoming their differences to work together... It being a true story made it that much better.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid drama based on true events about a group of Gay Rights activists in 1980s London, who decide to raise money and show support for miners who are striking. Good cast, heartwarming and entertaining, it is an easy to like film that manages to mix some humor with real human drama and some rather bleak situations.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow what a great movie, this true tale of solidarity and pride is uplifting and sets an example how standing united despite being very different (but are we really?) is a powerful thing. all this without being preachy, but emotional and funny, is a great achievement.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie all around. I'm looking forward to doing a double feature with this and \"Brassed Off\" some night...",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although being a bit sentimental and somehow familiar in terms of plot, this was a funny and touching film.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although occasionally cheesy, \"Pride\" is an effectively moving and joyous celebration of the solidarity oppressed groups must exercise to stand up for their right to exist and thrive.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's always tough for me to view Dominic West as anybody other than his role in The Wire, let alone a British guy.  That said, Pride is a great movie about a happening that I had no idea existed.  Good film, a little too goofball and cheesy at times but definitely entertaining throughout.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly remarkable piece of history, warmly told..",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, adorable, and worth seeing a few times--especially Dominic West and Imelda Staunton dancing together.",
            "review_date": "2015-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A crowd pleaser, and a fun one at that too; \"Pride\" tackles on a hard subject without being too \"on the money\" or too in front of our faces.  It might be formulaic, but its charm, humor, and heart make us forgive its flaw and enjoy the wonderful characters it embraces.  it has a great message and everything.  A win for both the gay and straight community.",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such a great movie that I'm going to watch it again this weekend. I didn't know about the true story the movie's based on - but what an impressive one it is. Gays helping miners and miners helping gays, a most unlikely but true combination. It even resulted it getting gay rights on the political agenda of the labour party. Wow. The acting is rather impressive - although I can imagine the Welsh accents of the non-Welsh actors might have annoyed some native Welsh. It's commendable that such a difficult topic (the 80s weren't necessarily the greatest time to be gay... if ever) can result in such an uplifting and hugely entertaining film like this. It's funny, heartfelt, positive yet real and thought-provoking. Loved every minute.",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seems overrated to me. Thin plot , one dimensional characters. Feel good film produced to a bit of a formula.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I'm honest, I'd avoided this one. In spite of glowing reviews I didn't think it would be my cup of tea. Strap me in a 36,000 feet for ten hours, though, and I'll give most things a go. Boy, were my opinions of this full so far off base. The trailers don't do this justice, it's not (quite) as candy-coated as I was expecting. And for someone who didn't know the ending, I found it exceptionally moving. I didn't cry, but I wanted to go up to them all and say \"well done.\" To put aside one's preconceived prejudices is one thing. For an entire town or country to do it in such a way is exceptional. What a great story.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story that I should have known more about. I'm expecting \"Pride: The Musical\" to be on Broadway very soon.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uplifting.  Funny. Poignant.  Great music.  Love it.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride: In the early 1980s a group of London gay activists took it upon themselves to raise money for striking miners in Southern Wales. This film, about that seemingly unlikely alliance, never quite achieves a satisfying climax, although it has loads of heart and some truly charming moments. Predictable fish out of water moments aside, it is worth checking out just because of the amazingness of its real life events. B",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dramatic, suspenseful and emotional. That's Pride.\n\n\nIt's extremely fun to see how the LGBT rights movement and the rights we take for granted today began. Pride is in fact one of the best movies I have seen that's based on a true story, and the movie does indeed illustrate how hard it can be to be other than \"normal\", especially in the 80s. But also what people close, and loved ones thinks about it. One of the main actors; Joe is excellent. We see him develop during the whole movie and he keeps getting more and more self-confidence. He also gets a bigger and a more important role in the movie. That's wonderful. I actually felt really close to Joe, just the look in his eyes felt me closer to him than any of the other characters. The actors in Pride are superb, especially George MacKay, Imelda Staunton and Bill Nighy. \n\nThere are surprisingly no flaws in this movie, and it really is one of the best movies that are based on a true story. It's also very underrated!\n\nPride gets a 7.5.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is one of those rare movies that you will smile, laugh, get angry at and have a wee tear in your eyes. A true story from the summer of 1984 about gay and lesbian activists raising money to support the National Union of Mineworkers on strike. Great performances from all the actors and a killer sound track from the 1980's. If you don't have a tear in your eye in the final scenes of the movie, you don't have a heart!",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's nice when a movie can make its point without being preachy or overly political, and this one does it beautifully. The humor is a great touch without being over the top or forced and the acting is fantastic on all sides. My only complaint was that it seemed a bit long, but it is well worth sitting through.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun to watch, but full if cliches. Could have been better.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinating film about the surprising working together of the Lesbian And Gay Community of London with the Mineworkers on strike in l984 in the British Isles.  Well worth everyone's attention as history and as a rousing good political film.",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyable film. Moving, funny and with a great soundtrack.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say I found this film really annoying for moments, it has a horrible music, a terrible cheap telefilm style and it bothers me so much how hard they try to make them look \"gay\". Anyway, having said that, I cant be that rude with a movie that has Imelda Staunton and Andrew Scott with so wonderful performances, along with the surprising Jessica Gunning and the young George MacKay.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"When you're in a battle against an enemy so much bigger, so much stronger than you, well, to find out you had a friend you never knew existed, well, that's the best feeling in the world.\"\n\nPride is Matthew Warchus's third feature film and the first one since his 2004 musical, Our House. Pride isn't a musical, but it surely feels like one with all the colorful characters and the lovable 80's soundtrack. It was a surprisingly fun film with an upbeat message about solidarity. It is one of those rare crowd-pleasers that stands out from other films thanks to its strong cast and uplifting message. I never imagined a film focusing on the historic events that took place in the UK in 1984 when the miners were at strike and found an uncommon ally in the gay and lesbian activists could be so fun. We've had similar plots in the past where two groups come together in the aid of each other despite their differences, but I don't think it has been done in such a contagiously joyful manner. Take last year's Dallas Buyers Club for example where we get a contrasting alliance between a redneck cowboy and a group of gays suffering from AIDS. That was a much more serious film where we got some comedic moments due to the contrasting lifestyles, but Pride takes this similar premise of contrasting groups coming together and delivers a much more hilarious and uplifting film. It still delivers the message and despite being formulaic it manages to stand out thanks to its colorful characters that never lose their humanity. I can't think of another film where a group of gay and lesbian activists aren't just fighting for their own cause, but are actually invested in helping others who are going through a difficult moment. So it stands out in that it isn't one of those films that is focused entirely on delivering a message in favor of gay rights, but rather focusing on the solidarity between these two groups. That is what makes this a much more humane  story and one everyone an identify with. The way the film is portrayed feels like a musical at times and you actually want to dance along with some of the characters when the music plays. Pride is a film with a lot of heart that reminds us that despite our personal issues there are always others out there in need of our solidarity. Pride might feel a bit too sentimental at times, but it is a feel-good film nonetheless with some of the funniest scenes of any comedy released in 2014. There are also some dramatic moments where I literally got goose bumps because I was moved. It is well balanced and uplifting despite its flaws.\n\nSome of my favorite moments in the film involved the clashing of these two contrasting groups. Despite their differences they learn to understand each other because they both have suffered from oppression. The cast couldn't have been better. Ben Schnetzer gives an impressive performance as the gay activist who comes up with the idea of supporting this group and winning a new ally in the process, but the fun really kicks in when they interact with these miners from a small Welch community. This is where we are introduced to some great characters played by Paddy Considine, Jessica Gunning, Imelda Staunton, and Bill Nighy who are outstanding. Nighy really delivers by underplaying his character and proves that sometimes less is more. I enjoyed Gunning's strong female performance and I look forward to seeing her in more films in the future. George MacKay also delivers as this young kid who hasn't told his parents he's come out (which is probably the most formulaic part of this film) so he lies to them about his activities. Andrew Scott and Dominic West also have some endearing moments on screen together. The best thing about Pride is without a doubt the strong cast which thanks to the rich screenplay by Stephen Beresford are given such colorful and interesting characters. It is a film that reminds us about our humanity and the importance of being solidary towards one another. It is both cheerful and earnest about its subject matter.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"When you're in a battle against an enemy so much bigger, so much stronger than you, well, to find out you had a friend you never knew existed, well, that's the best feeling in the world.\"\n\nPride is Matthew Warchus's third feature film and the first one since his 2004 musical, Our House. Pride isn't a musical, but it surely feels like one with all the colorful characters and the lovable 80's soundtrack. It was a surprisingly fun film with an upbeat message about solidarity. It is one of those rare crowd-pleasers that stands out from other films thanks to its strong cast and uplifting message. I never imagined a film focusing on the historic events that took place in the UK in 1984 when the miners were at strike and found an uncommon ally in the gay and lesbian activists could be so fun. We've had similar plots in the past where two groups come together in the aid of each other despite their differences, but I don't think it has been done in such a contagiously joyful manner. Take last year's Dallas Buyers Club for example where we get a contrasting alliance between a redneck cowboy and a group of gays suffering from AIDS. That was a much more serious film where we got some comedic moments due to the contrasting lifestyles, but Pride takes this similar premise of contrasting groups coming together and delivers a much more hilarious and uplifting film. It still delivers the message and despite being formulaic it manages to stand out thanks to its colorful characters that never lose their humanity. I can't think of another film where a group of gay and lesbian activists aren't just fighting for their own cause, but are actually invested in helping others who are going through a difficult moment. So it stands out in that it isn't one of those films that is focused entirely on delivering a message in favor of gay rights, but rather focusing on the solidarity between these two groups. That is what makes this a much more humane  story and one everyone an identify with. The way the film is portrayed feels like a musical at times and you actually want to dance along with some of the characters when the music plays. Pride is a film with a lot of heart that reminds us that despite our personal issues there are always others out there in need of our solidarity. Pride might feel a bit too sentimental at times, but it is a feel-good film nonetheless with some of the funniest scenes of any comedy released in 2014. There are also some dramatic moments where I literally got goose bumps because I was moved. It is well balanced and uplifting despite its flaws.\n\nSome of my favorite moments in the film involved the clashing of these two contrasting groups. Despite their differences they learn to understand each other because they both have suffered from oppression. The cast couldn't have been better. Ben Schnetzer gives an impressive performance as the gay activist who comes up with the idea of supporting this group and winning a new ally in the process, but the fun really kicks in when they interact with these miners from a small Welch community. This is where we are introduced to some great characters played by Paddy Considine, Jessica Gunning, Imelda Staunton, and Bill Nighy who are outstanding. Nighy really delivers by underplaying his character and proves that sometimes less is more. I enjoyed Gunning's strong female performance and I look forward to seeing her in more films in the future. George MacKay also delivers as this young kid who hasn't told his parents he's come out (which is probably the most formulaic part of this film) so he lies to them about his activities. Andrew Scott and Dominic West also have some endearing moments on screen together. The best thing about Pride is without a doubt the strong cast which thanks to the rich screenplay by Stephen Beresford are given such colorful and interesting characters. It is a film that reminds us about our humanity and the importance of being solidary towards one another. It is both cheerful and earnest about its subject matter.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jimmy McNulty all gay and utterly heroic..:)",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Britain, 1984. Margaret Thatcher's Tory government is facing the consequences of its extreme economic policies as employment, health and sense of freedom of the Average Joe is crumbling during a period of apparent economic boom. The miner's strike has been going on for weeks, resulting in illegal government action and measures against freedom of speech. 20 coal mines are under threat, spelling 20 hopeless towns. Union funds have been seized by the government, leaving the towns literally starving. Politics are polarizing. At the same time, gay rights are targeted by the same government, adding insult to injury to a community struggling with the peak of the AIDS epidemic.\n\nDuring the aggressively political London Gay Pride march a young man named Mark Ashton realizes something: the miners and the LGBT crowd have a common, dangerous enemy: their own government. A posse of a handful of London-based gays and one lesbian form a fundraising group called- informatively- Lesbians and Gays Support the Miners and start collecting money for food, setting up their base of operations in an artsy bookshop.\n\nThe at first glance unlikely support group manages to gain momentum and soon starts co-operating with the small Welsh mining town of Onllwyn. The core group of activists is soon invited to visit a town made up of beer drinking macho miners and their dutiful housewives. Things are about to change. The oddest of bedfellows, united only in the oppression that has embittered them, are about to meet. This is how you lay the grounds for a predictable but endearing, damn stylish and skilfully presented film based on actual events.\n\nThe main point of view in this tale of a meeting between two completely different worlds is that of Joe, a closeted, 20-year old boy who has just discovered the gay community. He documents the political struggle, both in London and in Wales, in photographs. His journey of self-discovery is as formulaic as the rest of the film, but also equally genuine, touching and well presented. He is the least aggressive in the group of young activists, allowing him a certain status of an outsider observing the uneasy union that is forming between initially homophobic miners and provocative young gay activists. The process is handled with insight here, the pacing perfect, the character interaction plausible and nicely complicated despite the both historically and dramatically obvious direction it's all heading into.\n\n\"Pride\" threads in very familiar territory, all in all. This along with some scenes that take emotion into the realm of sentimentality cripples the film in some obvious ways. But then again- \"Pride\" is exactly what it aspires to be. And it's still special and frankly just damn enjoyable as well as thought-provoking to watch, filled with rich characterization backed up by an army of wonderful performances. Stephen Beresford's script alone is deliciously witty yet touching, growing into a funny but also deeply poignant work. The film is not ashamed or sneaky in its declaratory left-wing politics, but doesn't taint its case by painting only in black and white, even if it does leave its antagonists a tad thinner than its heroes.\n\nI saw this in a small Finnish movie theatre in the middle of the coldest, completely sunless winter, and it warmed the audience so much it received actual, hand-clapping applause from the Finnish audience as the credits started to roll. Believe me, this better than anything else indicates that \"Pride\" is a force to be reckoned with.",
            "review_date": "2015-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total feel good movie, but it's not all by the numbers. Pride took a few surprising turns, but even when the expected moments arrive, as they inevitably will, the superb acting by the cast lifts the material to new heights.",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride may not be the best brittish comedy of the decade (so far), but it certainly is rather enjoyable. The entire cast is well rounded and offer pungent, if whimsical,  portrayals of the hardship homosexuals faced, especially the Christians. Dominic West and Ben Schnetzer are particularly good and both Bill Nighy and Imedla Staunton excell at the dry humour. Paddy Considine is another that hits some dramatic and comedic notes, which propell his towns relationship with the GLSM. However, this film is more of a dramedy than a full-on comedy and therefore doesn't provide laughs the entire way through. But is does offer some rather confronting scenes of homophobia which adds to the dramatic element. This film is genuinely one of the best films to come out of the uk this year, even if it is a bit grim for a comedy. And its not really a dark comedy either...",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was rough. Watching Pride was like swallowing a heaping spoonful of corn syrup. It was sweet, sappy, and made you want to regurgitate after swallowing all the ham fisted made for TV level schmaltz I could take. What Pride did was take a promising true story and deconstruct it bit by bit with countless cliches. Rather than present a layered and complicated narrative the director chooses relentless sentimentality that whitewashes all and any believable character/story development. What surprised me the most was how well received this movie was. I was excited for it based on it's reviews but in the end Pride felt like attending a party where everyone except you is having fun, making it all the worse.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful story will amazing acting that make you feel connected to these people from the very beginning.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie...it had it's serious moments but had some laugh out loud moments too.  Great acting and great story because it was true.  Good soundtrack.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny way to see how man can overcome preconception...it was a really good time :)",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Pride\" is a interesting and funny piece of work by Matthew Warchus., with excellent actors. And even If the 2 hours long are maybe a little excessive, the characters are enought touching to keep attention.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Positively surprised by this movie.A very healtfelt,very thought-provoking movie.It is a beautiful message to all of us without being to loud about it.A very well movie  with a great cast.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Films based on true stories are always the best and this is no exception with a great 80's soundtrack.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smartly written and does not fall into the clichée traps that films in this genre often fall into. Okay maybe it does but very rarely and the film as a whole works anyway and you dont really mind them then. Uplifting to say the least but also inspiring and heart felt and i can truly say, it got me a little bit. Dealing with a theme that audiences can apprecite and relate to even today and that theme being homosexual works perfectly in this movie. Funny and charming in a really smatrly done way, Pride was for me a big surprise.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit too long and a horrible spontaneous singing scene, but despite this it is still a really good film and a great true-ish story.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie. Funny and very touching at the same time.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really really good film and can see why it has been rated so highly. I am really surprised to read afterwards how historically accurate it was.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heartwarming, positive, moving, really enjoyed it!",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is funny and unforgettable. It introduces a originality to material that some would consider dated and forgettable. It reminds us that pride is worth fighting for.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as funny as I thought it was going to be but a really nice story. Light entertainment.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story about history, and today's world.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an inspiring story of two groups overcoming inherent prejudice to act together in solidarity and fight against an oppressive regime! Full of heart, warmth and humor and a rendition of 'Bread and Roses' that made me stand up and cheer! In the middle of so many pretentious art fare and stylistic grittiness, this is a breath of fresh air with a powerful message to take away. Highly recommended.",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great depiction of the work of LGSM supporting the strike of the National Union of Minerworkers",
            "review_date": "2015-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great video!!",
            "review_date": "2015-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sticks very well to the original story from what it seems, and has lots of great performances and moments of heartfelt emotion. It's far too long though; it seems they wanted to cover absolutely everything so they wouldn't have to leave anything out.",
            "review_date": "2015-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story even though I didn't really know or care about the strikes in England.  Spoiler sort of ----- did the activists have jobs or were they rich or what?",
            "review_date": "2015-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film criticism is absolutely enigmatic!  On the one hand -- especially at this time of year -- it's all about ranking the best from the rest, compiling Top Ten lists, awarding prestigious prizes and statuettes to the most outstanding films and filmmakers, minutely comparing one movie with another.  But, as a matter of course, every film no matter how great or small is critiqued concisely with practically no precision, often on a 4-star scale.  IMDb allows its users to select from an extravagant 10 stars, while other sites offer 5 stars (sometimes with the doubling effect of half-stars).\n\nIf four stars was good enough for Roger Ebert, surely 10 stars at IMDb should be good enough for me ... but no.  This film is a good example of 10 not being enough for me.  No, no, i don't mean i'd like to Spinal Tap it with 11 stars -- what i mean is that this film begs nuance in the range between 7.0 and 7.9.\n\n\"Pride\" is not an 8 out of 10 film for me.  It's very good, for sure, anchored by the gravity of Bill Nighy and Imelda Staunton, and buoyed joyfully by a young unknown(-to-me) cast.  My salty cheeks are evidence that the story's sentimental notes were soundly struck.  But ... it's a little ... too much (?) sometimes -- there may be a few frames, a few lines, that could have been left on the cutting room floor...  A first-time writer and a sophomore director have teamed passionately and exuberantly to create a wonderful film, but ... \"Pride\" is a 7.9 out of 10, not an 8, but better than most 7s.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a Disney movie about gay pride movement sprinkled with communist manifesto.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do yourself a favor and watch this movie..",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Una prueba mÃ¡s de q la uniÃ³n hace la fuerza. Interesante historia real sobre la impensable solidaridad entre dos grupos muy diferente.\nA lovely real story about the unthinkable relationship between two completely different social group. Just another proof that united as human we stand.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of 2014!  Well rounded and wonderful!",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lighthearted and quite funny, but predictable and a bit staged",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this inspiring movie. Plus we learned a little history. All the performances were spot on.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a lovely, heartfelt film. It's not perfect by any stretch, but I found I could forgive a few sins knowing that it is based quite closely on real events.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this witty & heartfelt film based on true events, a group of London gay & lesbian activists identifying themselves as Lesbian & Gays Support the Miners raised money for the families of Welsh coal miners striking in the summer of 1984.  Mark (Ben Schnetzer), Jonathan (two-time Golden Globe nominee Dominic West), Dai (In Americaâ??s Paddy Considine), Gethin (Andrew Scott), Mike (Joseph Gilgun), Steph (Faye Marsay), Jeff (Freddie Fox), & Joe (George MacKay), portray the activists who arrive en masse in the small mining town putting many members of the Miners Union and the community ill at ease.  What happens is the gradual breaking down of the barriers of prejudice and ignorance to enable the forming of cooperation and friendship between the two groups. Director Matthew Warchus & screenwriter Stephen Beresford have enlightened us with a story that most viewers never knew about, but also the reminder of the power of will and refusing to give up on what you believe is right. The performances from the entire cast were wonderful & their portrayal of the real people were believable. There was a perfect mix of humor & humanity in the film. You can SEE THIS FILM which is nominated for a Golden Globe for Best Picture-Musical or Comedy.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful movie. The cast is top-notch, the story is both interesting and heartwarming, there are a plethora of hilarious moments, and there's enough conflict for it to hold your attention the whole movie, without really forcing conflict and generally allowing for happiness and teamwork to flourish from early on until the end. It's just a happy movie, you know?\n\nI'm not sure what you could complain about with this movie. I guess some characters are sort of archetypes, but that's necessary with an ensemble cast like this one, and besides, the actors do a great job of making up for their limited screen time by making their few scenes count. It's clear Joe Copper is fictional, a sort of audience surrogate created to introduce us to LGSM, but that's okay, because his stereotypical situation is made genuine thanks to his actor, the strong direction, and the particular details in the script.\n\nThere's also just a lot of beautiful visual moments. The Wales countryside is gorgeous, and the whole visual feel of the movie is colorful and vibrant to match the spirit and optimism of the movie.\n\nI guess one more complaint somebody could make is that the themes are a bit expected, nothing truly new. I'm sure there are aspects of the story that are misrepresented or simplified in the film, and overall the movie is pretty simple. So...I guess I can understand if somebody was looking for a deeper message and was instead met with a treacly or overly sentimental movie. But, to be honest, I don't think every movie needs to be extremely complex or true to life, and it'd be hard for me to make that complaint when I was having so much fun spending time with the characters onscreen. There's just so much unapologetic happiness, from Dominic West's amazing dance scene to the crazy old ladies having fun (I loved all of them) to the gay pride parade at the movie's end. I just had a lot of fun watching the characters, and even if the story and themes are pretty basic, it doesn't make it less moving to see two distinct communities support each other, or to see the simple but effecting image of two hands clasped together.",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought-provoking, although however bleak at times, \"Pride\" is one of the oddest films of 2014. Normally a film about Gay rights is endearing even if you do not agree with it, and this film does that once again; However, I felt that it was a very one sided film at times. They mention the opposing side a few times, but it is more of a statement than a respect to the true story. Don't get me wrong, in the end, I thought this was a great film. Well-made all around and smartly scripted, \"Pride\" delivers in all it's goals, but falls short to those without an open mind, in which I would not recommend. I myself have a very open mind and a broad outlook on life so films like this intrigue me. I think my problem with the film was that once the credits began, I felt no different about the matter than I did before my viewing, but I admired the hell out of what was on screen. \"Pride\" is soulful, but lacking in other areas.",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved everything about this movie. It made me laugh so hard and it made me cry, all while teaching me a bit of history I know nothing about. Wonderful!",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe it was the title, but at first I kind of thought \"yawn..how many movies riddled with clichés are they going to make about gays?\" However, I decided to check it out and can happily report it is genuinely affecting and (mostly) avoids the clichés, offering a refreshing plot twist instead: the gays in this movie decide  to come to the aid of Thatcher-era striking miners in a Welsh community. The resulting culture clash is what gives the movie most of its dramatic power and  \n comedic elements. I never heard about this when it happened; what a great subject for a movie!  It tugs at one's heart strings, but not too desperately like\n some movies of its genre, offering more true life grit than over the top melodrama. Anyone can enjoy this movie, it's pretty marvelous and deserves its Golden Globe nomination. The story is all the more amazing in that it happened at a time in which some gays were more concerned and freaked out about self-survival in the face of AIDS than helping some non-gay group not particularly known for their support of gays in the least. That's what gives the movie it's \"WOW\" factor.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A delightful sleeper... hadn't heard of the film, but found it compelling, realistic, gripping and emotionally stirring. Bill Nighy, Imelda Staunton and Dominic West are awesome as always - and tremendous work from Ben Schnetzer!",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride is one of those films you don't expect too much from going in because there has been little to no buzz around it and therefore you have little to no expectations for it. I sat down not knowing what exactly the film was even about other than it was based on a true story dealing with gay rights. More specifically, Pride concerns itself with the 1984 trials of a London-based group of gay and lesbian activists who raise money to support the National Union of Mineworkers who are on strike. The two groups discover that standing together makes for a stronger union for both their causes and generally serves as an inspiring tale all around. What makes the film so rousing and fun while telling an inherently dramatic story is that of the characters and the genuine way in which they interact with one another. From Bill Nighy and Imelda Staunton to Paddy Considine and Dominic West with a cast of exuberant youths in between including Ben Schnetzer, George MacKay and a star-making performance from Jessica Gunning Pride knows where its charm lies and it utilizes that quality to ensure the viewers feel its points. Maybe it was that lack of expectation that made this a more emotionally stirring experience than I expected, but it is also a rather exhilarating study of the human spirit and the kind of, well, pride that comes along with seeing differences set aside for the greater cause. Either that or maybe it's simply because director Matthew Warchus and first time screenwriter Stephen Beresford gauged just the right tone with which to capture this story and allowed their actors to flourish-creating not only a winning film in terms of being entertaining and informative, but a rather moving and intimate portrait of a little-known story that still feels more than relevant today.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. So many people could learn from this story.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "decent but very predictable coming out story about a young man finding himself swept up in the political gay rights and coal miner strike during the mid 1980's in UK. Fantastic supporting performances are what make this movie, the rest is a bit of deja vu.",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful, important movie to see and share.  Thank You.",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie based on a true story...appropriate before I head to the UK",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top British talent shows Hollywood how to make a film great. Laugh out loud funny and moving. Well written well acted this will put lesser known actors on the map. The film shy away from the matters at hand and I would like to say thank you",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best film I have seen in a long time.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soundtrack was great too. I had never heard this piece of history before this movie. So glad I was able to learn about it.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's slightly better than most \"inspirational true story\" adaptions, but still follows most of the standard plot points. The film does distinguish itself by focusing on a rather unique event so on that level it's worth seeing.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving story.  Without spoiling, it's a must-see!  Love the solidarity and two totally different groups coming together to support each other.  Highly recommend.  Enjoy!",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A triumphant tale of community solidarity.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in mid-80s London and Wales, Pride is the story of a somewhat crazy band of gay activists who begin raising funds for the striking miners out of a conviction that they were enemies of a common enemy, namely Margaret Thatcher and the harsh Tory state. Even in context of the emergence of the AIDS epidemic, this gaggle of idealists believe that they can make a difference in their own struggle and the progress of humanity by linking arms with those engaged in the pivotal class struggle of their time. I was working for the AFL-CIO at this precise time, and know that the result -- unions joining the struggle for human rights -- was directly inspired by what happened in this story. So yes, one person can make a difference. As a film, this one follows a long line of 'heart-warming'  comedy/dramas that have come from the decline of Britain's working-class, such as the Full Monty, Kinky Boots, Billy Elliot, Calendar Girls, and many others. There are lovely set-pieces (Dominic West as a flaming disco queen, the girls in London discovering dildos and porn), and some genuinely affecting emotional moments.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasant enough, but no where near as good as I expected given the high critic ratings. Each individual performance hits the right pitch, but together  there was  little drama or punch.  Not a waste of time, but not memorable.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feel good movie of the year indeed. \n\nDespite being directed in the cheesiest, dated way possible this thing has enough joyful sentiment bursting from it that its impossible to not enjoy yourself. \n\nHighly recommended for fans of films about miners. Oh and gay rights too.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, thought-provoking, heart-breaking and featuring a plethora of astonishing performances, Pride is full-blooded, joyful cinema, driven by classic story-telling and emotional twists of absolutely unprecedented magnitude.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, hilarious and moving.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in the 80's this is a real good feel good flick about a gang of gay activists who support a Welsh community during the year long miner's strike.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films i have seen for years",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fabulously rich movie with a superb mix of talent relating the victories of human relationships over and above the overwhelming power of political ideology in partnership with business... Life-enhancing--A Joyous Triumph of two tribes, one pink, one coal-black, at war with one enemy: The Iron Lady... Solidarity Forever!!",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "true story, walking out of cinema thinking yeah!",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pride manages to make a bleak situation (in which mine workers were crushed by The Iron Lady) into a heartwarming and hopeful tale of social cooperation and empathy.  Bill Nighy and Paddy Considine gave particularly enjoyable performances as dignified but struggling members of a mining community.  If I had to describe this film in one word, it would be \"uplifting\".",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You've seen the story a million times, either in Kinky Boots, The Full Monty, etc., but this version tugs at the heartstrings.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a different story than I thought it would be",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting feel good true story, worth a watch.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an charming and emotionally uplifting movie!  People can change!",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's seems like a lifetime ago such bigotry existed,  and though it still continues,  life for the community is a bit better thanks to heroes like these.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had higher hopes for this one, but it was enjoyable.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie about two bullied groups coming together for a cause.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uncomfortably patronising.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though the performances are great and it's heart is in the right place, Pride is a mediocre comedy-drama film that constrains it's interesting true story to a trite narrative framework and feels more schmaltzy than inspirational.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "based on a true story in London when the gays and lesbians get together with the striking coal miners for form a legion in the mid 1980's when AIDS was just beginning to take its toll and when homophonic actions had to be diverted.  very entertaining movie.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet comedy tells the true story of a very unlikely brotherhood forged under the anvil of 1980's politics. Well acted and directed, it tugs in your emotions and delights all the way to its happy ending.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another way to know the british history.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aint that funny more of a drama-lamadingdong. don't know why it's in the comedy section.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming, it manages to be political without being off-putting or preachy. A story of the endurance and empathy embedded in the human spirit",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film won the British Independent Film Award over \"Calvary\", \"Mr. Turner\", and \"The Imitation Game\", what a feat! And deservedly it did, although not by a big margin. If only the director had kept up with the dramatic tone, the film would have been much more dramatic and effective, in my opinion, since the subject and theme of this film consist the most fertile ground for a good drama - social struggles for equality mixed with internal quests of finding oneself. My sometimes he fell for lighthearted touches of \"stage/musical\" style, which made the film much more cheerful and up-lifting to watch, but at the same time cut off the emotional stream of feelings by the audience built up by the previous moving sequences (and I just realized that the director is indeed a more accomplished stage director and is planning for a musical adaptation of this film, which I believe will be even more successful due to its stage-suitability). But as a blade having two edges, the cheerful tone of \"Pride\" also brightened up its characters, whose everyday lives were often put in the dark due to the social and political prejudice against miners and LGBT. As such, almost every character in the film stands out and is easily recognizable for their liveliness and their will to fight for what they believe. The weaknesses of the film might be the shaky emotion build-up, as mentioned above, the lack of \"true climax\" (although I did actually enjoy this style - rather having some fun and care-free moments than watching heavy dramas all year long), and a very uneven \"second act\". However, the brief but extremely powerful ending did concluded this film on a high note. If only the film had been a true cinematic drama rather than a stage-alike piece, but not every one can be Sam Mendes (who jumped from his stage career to film career with instant success), so we should sit down and enjoy the film for all the optimistic thoughts it has, which shone through the film like a beam of sun light piercing through the cloudy sky in December.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually a really nice story, with some of my favourite actors. Its a shame that after the miner strike finished it seemed to loose its way but anyway. Worth a look.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How hard is to balance the jolly and the dead serious is seen especially in the way the characters are sketched. Otherwise it's a pleasant watch, if only for the costumes and the hai",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it tries to sugarcoat the harsh truth, Pride is a destiny worth making! Beautiful and elegant :)",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every once in awhile I find a film so inspirational that it moves me. This one of those films. Easily top ten of the year for me.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and heartfelt, writer Stephen Beresford and director Matthew Warchus succeed in bringing humanity to the 1984 British miners strike. Boasts a memorably colorful ensemble cast along with an uplifting message regarding courage and friendship without getting too schmaltzy.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story, great characters, well written.  Good job.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eventually got to see it. Loved it. Such a feel good movie.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never has radical politics been so much fun!",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        }
    ]
}