{
    "rating": 8.5,
    "release_date": "2014-02-28",
    "num_reviews": 50,
    "genres": [
        "History",
        "Drama",
        "Biography",
        "Anime"
    ],
    "summary": "A lifelong love of flight inspires Japanese aviation engineer Jiro Horikoshi, whose storied career includes the creation of the A-6M World War II fighter plane.",
    "reviews": [
        {
            "content": "This movie was incredibly touching, with excellent music and fantastic animation!  Another very memorable movie from Studio GHIBLI, and one of their best films I've seen!  HIGHLY RECOMMENDED!  10/10 STARS!\n\nNote: For best viewing experience, view the original Japanese Dub!",
            "review_date": "2023-03-21",
            "source": "rt"
        },
        {
            "content": "Very interesting animation movie.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "An absolutely fantastic movie but I just couldn't entirely connect with the story or characters. Despite not connecting with the story, I'm not going to deny how extraordinarily well this movie was made. The animation is beautiful to look at and I could not look away. Every scene is just filled with incredible scenery. The story does have a lot of good themes and it's a very sad story. I also love the writing, it was constructed very well. In terms of the negatives, like I said in the beginning, I just couldn't connect. I thought the characters were not as memorable as the characters from ‘My Neighbor Totoro' (I'm comparing these two films because they were made by the same director) and I also related to that story a lot more than this. Overall, other people would probably adore this movie. I still really enjoyed it though.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "This film is a film for artists by artists first and foremost. It happens to be set during war times but it is about the obsession and passion one can have for creating. This permeates everything in the film from the attention to detail in animation, natural sound design and music. Absolutely love it!",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "BEST GHIBLI MOVIE EVER! Great movie with the best storyline, visuals, color, and animation. I’m definitely making a remake of this!",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "A bit disappointing. My least favourite Ghibli movie so far. The story is kind of segmented and the attempt to tell the story of both the engineering/warfare aspect and the love aspect of the protagonist's life makes it a little off-focused.",
            "review_date": "2022-12-13",
            "source": "rt"
        },
        {
            "content": "Its alright, not one of my favourite Miyazaki movies, but watchable.",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "There will never be a time when this movie won't bring tears to my eyes.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "The Wind Rises focuses a lot on the following of dreams and it makes it a beautiful story though with some obvious issues. Animation in this one is great in general, but even stronger when watching flight. Then the skies seem more vivid than the rest of the movie which is reflective of Jiro's wonderment of aeronautics as well as Miyazaki's. Jiro's love for his wife is shown to be touching and does well to not pull much away from overarching story. The story sometimes be a bit slow-paced, but it is nothing too obvious. The bigger issue is how the message can become a bit tarnished when looking at the background of the story. The movie follows a character as he works to accomplish his dreams which is a good message by itself. Where is becomes problematic is when you look at the people that he is making planes for. When you see that he makes planes for the Imperial Army even though he doesn't support the war effort, he basically starts to change his mindset to that he is just happy to be making planes. This changes the message to \"follow your dreams no matter what the cost\" which is a perverted view of the message that the movie wants to present. It is a beautiful film with a mostly heartfelt story that becomes a little tarnished by the overall message of the film.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Would have been 5 stars but the man couldn't get his priorities straight on his wife's last days.",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9.5/10) ; Cinematography (10/10) ; Plot (9.5/10) ; Acting (9/10) ; Pacing (9/10) = 94%}\"",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Refreshing to see animated biographies with beautiful story telling. Another amazing film by Studio Ghibli.",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "Hits fresh on all pages. The top of animation!",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Não é um dos melhores, meio sem sal, mas ainda assim da pra ver.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "A vida dele fio triste, mas que filme. A delicadeza dos detalhes é linda!",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "As a fan of Miyazaki and Studio Ghibli, The Wind Rises is not one of their best(Princess Mononoke, Spirited Away, My Neighbour Totoro, Castle in the Sky, Whisper of the Heart), let down by some overly-languid pacing and some wooden voice-work from Joseph Gordon-Levitt. It is however a great and beautiful film and quite easily along with Disney's Frozen one of the best animated films of 2013.\n\nThe best thing about The Wind Rises is the animation, if there was one word to sum it up it would be exquisite. It is filled with Ghibli's characteristic meticulous and loving attention to detail, and it's not just luscious in colour and elegantly smooth in background art but it is also incredibly expressive. Joe Hisaishi's music score is also stunning, ethereally orchestrated and nimble in mood, it's also thankfully the antithesis of over-bearing, the gentle approach it has gives the film intimacy. The script is thoughtful and never preachy, and it doesn't get complicated either and the story while languidly paced and not the most imaginative that Miyazaki and Ghibli have come up with is very personal, charming and very affectionate. I did find myself very moved by the ending, then again this is hardly the first time where this viewer has gotten emotional watching a film. The reason for this being that the film deals with some very personal issues and explores them so movingly and mind-hauntingly. Miyazaki's direction is nuanced and intricate, the characters are engaging if more in the supporting roles than the leads(Caproni being the most memorable). The voice acting is quite good, though one of Ghibli's weakest dubbed films, reservations are had about Levitt but Emily Blunt is very compassionate and Martin Short, Mae Whitman and especially Stanley Tucci stand out in roles that all three give a lot of personality to.\n\nAll in all, Ghibli and Miyazaki have done better, but The Wind Rises is still a great film, one of the best animated films of 2013, and a beautiful \"swan song\" from Miyzaki. 9/10 Bethany Cox",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "\"The Wind Rises\" isn't among my favorite Studio Ghibli films, but I admire it because it is among their most grown-up films. This is a movie with a realistic story that still captures the imagination and wonder the studio is known for. I thought the movie had a very strong beginning but then slows down immensely for the majority of its runtime. Regardless of this, I think this just might be the most beautifully animated of the bunch and even when the story is slower, it is stunning to look at. The heartfelt finale of the story brings everything together and makes the journey worthwhile. Overall, it is a very solid addition to the Ghibli library with a good heart, decent story, and jaw-dropping animation.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "The Wind Rises has a more realistic approach than Hayao Miyazaki's conventional fantasy plot, yet because of its graceful direction and cinematography, it is one of the most beautiful films to watch. Even if all he wanted was to construct the thing he loves, the film illustrates young people's ambitions and attempts to accomplish those dreams in a society controlled by corruption and war, a grim message for those who are chasing their passion. While the film focuses on Jiro's (Hideaki Anno) difficulties, it also has a beautifully managed tale of Jiro's (Hideaki Anno) ecstatic and melancholy romance with Nahoko (Miori Takimoto). Despite its two-hour runtime, the film could have done a better job of developing and polishing certain storylines, particularly the romance subplot, which was introduced later than it should have, and the characters surrounding Jiro are one-dimensional. While the subject matter may not be to everyone's liking, if you can easily immerse yourself in the character, this is one of the best biographical films you will ever see.",
            "review_date": "2022-01-12",
            "source": "rt"
        },
        {
            "content": "Thought it was a great watch, wish it went further into his life",
            "review_date": "2021-12-09",
            "source": "rt"
        },
        {
            "content": "A truly sweet and touching film, Miyazaki's final effort seems to take a more personal tone. The film deals less with otherworldly affairs yet still remains magical and imaginative in all the ways that Miyazaki films usually are.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "This film is far more mature than other Miyazaki works. There are no cute spirits or anthropomorphic animals in any scene. The film has multiple haunting images of fire, plane crashes, illness, and death. Much of the exaggerated imagery that would be expected from the bouncy cat-bus fantasy is more toned down for the realistic designs of the aircraft. The dreams, which had the potential to be absurdly colorful and wacky, are incredibly tame by Miyazaki standards.\n\nThe film is slightly fast pasted, not very comical, and occasionally a bit dull or empty. The only thing I would consider to be 'action' would be the test flights for the planes. But these are minor complaints, as the story never drags on onto actual boredom or poor writing. It's just a different kind of emotional experience.\n\nI will have to mention how the film's setting and story are about the development of Axis Power warplanes. The film makes it very clear that the character of Jiro, both in this fictional tale and real life, distanced himself from the warmongering of the Axis Powers. Jiro is still highly respected today, which would explain why this film would become 'the highest-grossing Japanese film in Japan in 2013'. If Jiro was viewed as a war criminal, then the production of this film might not have happened to begin with. This film has a view aimed at normal and likable civilian characters. The film does still acknowledge the acts of tyranny and warmongering occurring before and during WWII; however, it has a more inspiring story to tell. Miyazaki intended this to be his last film, and so wanted to make a story that reflected his lifetime fascination with aircraft as a Japanese man.\n\nUltimately, it is not going to be remembered as well as Porco Rosso but is still something I would recommend for any Miyazaki fan and anyone who is fascinated by aircraft. And while the romance in the film was short in terms of film time, it did feel genuine despite being modest and minimalistic.",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "The film tells a story about the aspiration of a creator to create something beautiful and how someone could inspire the creator to achieve that. Every creator wants to create something marvelous. To create something great, creators put times, labor, compassion, endurance, etc. They fail so many times but stick with their work. They revisit the mistakes again and again, and they work hard to fix those. The desire to make something aesthetic always motivates them to finish what they have started. Their inner selves help them to cross the boundary of possibilities so they could create something magnificent. But sometimes, people fail to understand the true meaning of their creations. So people might use them for hideous purposes, i.e., war, human-made disaster. Another aspect of the film is that someones always give inspiration and motivation to the creators. The hope, faith, and support from them help creators to push them beyond their ability. Hayao Miyazaki, director of this film, is considered one of the greatest anime directors. The quote from Horikoshi, \"All I wanted to do was to make something beautiful\" was encouraged him to make the film.",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Beautiful. This is by far one of the best animated films there are. Much more than what one may expect.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Interesting movie with a fantastic English dubbing cast. How in the world could they afford Joseph Gordon levitt as the main and Emily blunt from edge of tomorrow. Now Jim from the office I can tell how they afforded him because duh. Anyway I found some things in this movie that I enjoyed. I liked the animation and the relationship with the 2 mains aka the main love couple in the movie. Everybody else was pretty average. But I did like that it was set in WW2. It took a different approach from being in the background than actually being on the frontlines. But the main question is the movie good? It's good in some instances but overall I can't give it the thumbs up because of its all over the place ness. If it didn't have an over amount of characters to care about and a more tight story to see why the 2 mains love relationship is established and why it kept going. Like I know why it did because it's a movie but actually why. I know it's confusing but who knows. In the end theirs a lot of ideas. Some good but if they picked one over the other or have a reason why the main girl character is connected to the main character it would've made for a better movie.",
            "review_date": "2021-04-21",
            "source": "rt"
        },
        {
            "content": "Interesting movie with a fantastic English dubbing cast. How in the world could they afford Joseph Gordon levitt as the main and Emily blunt from edge of tomorrow. Now Jim from the office I can tell how they afforded him because duh. Anyway I found some things in this movie that I enjoyed. I liked the animation and the relationship with the 2 mains aka the main love couple in the movie. Everybody else was pretty average. But I did like that it was set in WW2. It took a different approach from being in the background than actually being on the frontlines. But the main question is the movie good? It’s good in some instances but overall I can’t give it the thumbs up because of its all over the place ness. If it didn’t have an over amount of characters to care about and a more tight story to see why the 2 mains love relationship is established and why it kept going. Like I know why it did because it’s a movie but actually why. I know it’s confusing but who knows. In the end theirs a lot of ideas. Some good but if they picked one over the other or have a reason why the main girl character is connected to the main character it would’ve made for a better movie. ",
            "review_date": "2021-04-21",
            "source": "rt"
        },
        {
            "content": "The wind is rising, we all must live.\n\nSince Hayao Miyazaki loved flying, which was made abundantly clear in Porco Rosso and others, this movie felt like his passion project, as well as a tribute. The story was a factionalized version of the real life Jiro Horikoshi, who designed the Japanese Zero airplane during World War II. \n\nI loved how Miyazaki portrayed Horikoshi as a kind person who had a dream of building airplane as a kid, and tried to maintain that passion as an actual engineer. The director also showed the main character did not care about the politic or war, but just wanted to make beautiful airplanes for the sake of flying. \n\nThis led to one of the themes, which was the struggle to maintain a dream, and keeping the dream pure. Another theme was the purpose of airplanes. In a time of war, it was inevitable that airplanes became tools of destruction. Here, Hayao wanted to emphasize that this was not the main purpose. As a person who is obsessed with flying and disdains war, he made his intention quite clear.\n\nAnother aspect of Horikoshi was the romance with his partner, Naoko. The romance was beautifully and realistically portrayed. They were just young birds that loved and wanted to be with each other. As sweet as the romance was, their story was tragic and heartbreaking. \n\nThese two aspects of Horikoshi's fictionalized life led to the movie's biggest theme, which was to keep living life to the fullest. \n\nMy small problems with the movie were some pacing issues, and at the beginning the time jumps were a bit sudden. It took a bit for me to realize that some years had already passed between scenes. \n\nOverall, another Hayao Miyazaki's passion project and beautiful movie. 8.5/10",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "A hard to grasp movie that will leave you floating and thoughtful.",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "The Wind Rises (2013) is Hayao Miyazaki's last film before he announced his retirement. The film is based on the life story of Jirō Horikoshi, who designed the Zero fighter jet during World War II. In the film, Miyazaki was influenced by Horikoshi, as well as by his father, who had a wartime factory that produced aircraft parts. Even though a fighter jet is at the center of the film, Miyazaki aims to show the design and production process of the aircraft as technological development, rather than a militarist one. After the movie was released, Miyazaki was criticized by different circles. South Korean audiences opposed the glorification of the designer of the warplane, one of the symbols of Japanese militarism, and the disregard for forced Korean workers to build these planes. On the other hand, the nationalists in Japan also accused Miyazaki of treason for emphasizing the futility of war in the film.[1]\n\nFull review: https://guncesinema.com/en/as-the-wind-rises/",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Adoration for flight in anime form.\n\nHayao Miyazaki's historical romance drama anime The Wind Rises (2013) is a beautiful farewell to the greatest animation director of our time. Miyazaki's legendary run of directing anime films is untouchable with Nausicaa of the Valley of the Wind, Castle in the Sky, My Neighbor Totoro, Kiki's Delivery Service, Porco Rosso, Princess Mononoke, Spirited Away, Howl's Moving Castle, Ponyo, and now The Wind Rises. It's a fitting endcap to his pictures that all feature Miyazaki's fascination with flying, love of planes and airships, and the wind itself. I appreciate that Miyazaki wanted to direct a serious period drama as his last directorial feature. \n\nHayao Miyazaki's writing is loving in nature with his clear love of flying and appreciation for the company of a good woman as the focus of the film. The hero's need for inventing Japan's next great plane is riveting as you slowly realize that he should just appreciate the time he gets with his lady love and the art of aeronautical engineering. I think Miyazaki's anti-war themes bleed in here as you witness great airplanes being used to gun people down for warfare.\n\nI think Miyazaki's writing is very sensitive to the fact that his beloved planes were used to kill en mass. The Wind Rises is a gorgeous art film about Japan's modernization into metal fighter planes, launching into warfare, and romance with heartfelt affection. The Wind Rises is easily Miyazaki's most emotional, tragic, and heartfelt picture. He gets you to care about a boy turning into a man, who finds love, only to have limited time with her. It's a fantastic story and the harrowing ending as you realize these planes are only really made for combat is a perceptive moment of Miyazaki's understanding of the true nature of the cost of technological advances. Hayao Miyazaki's The Wind Rises is a perfect film with patient maturity, kind behavior, and thoughtful pleasure found in the simplest of things.\n\nJoe Hisaishi's score is lovely with an airy breeze to his gentle music this time around. His scores for Hayao Miyazaki's films have long captivated me and The Wind Rises is full of equally majestic and romantic themes. I really like the sound designers use of mouth noises for all the sound effects like taking off or turning the plane engines on with a rumble. It's a very cute choice, adding to The Wind Rises' charm.\n\nTakeshi Seyama's editing is excellent as he keeps The Wind Rises steadily moving with a sincere authenticity to each scene's dramatic pacing for 126 breezy minutes. Atsushi Okui's cinematography is striking with close-ups as winds blow intensely on a character or far wide shots for an earthquake wrecking an entire city. Yoji Takeshige's art direction is gorgeous with a dedication to older eras of Japan, the history of airplanes, and sweeping winds blowing things around. Studio Ghibli's hand drawn animation is more detailed and technically advanced than any other Miyazaki movie.\n\nFurthermore, I definitely liked the English Dub's cast for The Wind Rises. Joseph Gordon-Levitt is a vulnerable and endearing lead choice. Emily Blunt sounds so sweet and loving as his wife. Stanley Tucci makes for a likable and compelling Italian plane engineer. Martin Short is hilarious as the feisty plane engineer boss with a nice Jennifer Grey cameo as his kind wife. Lastly, Werner Herzog's cameo as a German defector is astonishing and full of captivating dialogue and vocal performances.\n\nIn conclusion, I loved Hayao Miyazaki's The Wind Rises. I think audiences will look back fondly on it one day like a friendly gust of wind blowing your hair.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "A true heartbreaking masterpiece. Hayao Miyazaki put his soul into this movie as he does all his movies and it shows. A love story that's rested on top of an anti-war message. Beautiful!",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "It might be the most beautifully animated of any Miyazaki film but I just couldn't get into the story of this the way that I did with some of his other work.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "The wind rises is the weakest Miyazaki movie for me. Its main character is too dull and hollow so I can't relate to him at all. The story is basically aimless: anime characters are planning planes. Yes, that's it. It still worked pretty well for the first half of the movie, but after that I was just so bored. Also, the romance in this movie felt so naive and unnecessary. Hopefully Miyazaki leaves us with a better swan song...",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "A different take on Japanese WW2 fighters and how they came about.  It was a feel good movie to boot.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "an amazing Japanese tale about ear crafting",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "\"REALMENTE HERMOSA\"\nAunque en mi opinión The Wind Rises no es la mejor pelicula de Miyazaki, es aun un gran trabajo de maestría de dirección e imaginativa del director que nos tiene acostumbrados y si esta hubiera sido en realidad su ultima pelicula, bueno, se hubiera ido por todo lo alto, volando en esos aviones que el tanto adora.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "Rather than starting out with plot and proceeding from there, I think Miyazaki started with a passion (his love of flight) and subsequently pursued a narrative that allowed him to indulge that passion as comprehensively as he desired, albeit with a distinctly Japanese twist. Employing a nonfiction basis is certainly unusual for both the director and the studio, though Miyazaki couldn't resist splicing in a host of inventive flourishes, often via dream sequences. Ultimately, the range of themes and subjects seem to come together in a muddled mix as opposed to the more streamlined efforts of prior years; the focus on pure flight and the whimsical dream elements/blurred line between reality and fantasy don't seem to necessarily fit with the rather unrelated romantic subplot (which does become more compelling with deeper exploration and bittersweet tone), the commentaries on the development of the Japanese state, and the rise of the Axis powers and aircraft's role in it. There's plenty for the eye to feast on, but I'm not sure that Miyazaki blends the included genres as effectively as they could have been. (3.5/5)",
            "review_date": "2020-07-24",
            "source": "rt"
        },
        {
            "content": "Amazing film, it literally made me question my career path when I was younger. This fantastical film based on history is an incredible watch and everyone should do themselves a favour and give it a shot.",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "Now I understand why this is considered Miyazaki's masterpiece. The story intertwines the stories of Jiro's dream to design and fly beautiful planes and his love for Naoka. It also gives insight into the history airplane design and the complex historical events of the period. A work of art.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Subtle yet effective. Initially sceptical as the first scene opened with a magical setting which I correctly predicted to be a dream sequence - I find this to be a gimmicky way for a film to start but in this instance it was used quite well. The protagonist is an avid day-dreamer. From a young age he has his head in the clouds (excuse the pun) seeking to design a perfect aeroplane. Through his analytical lens he unpicks the intricate beauty within natural design (such as the bone structure of a mackerel) as inspiration towards engineering aircraft. He is interestingly despondent at points, whilst also being caring and considerate. Through his talent and motivation is able to push for achieving his dreams. The film provides glimpses into the challenges of wartime, and frailty of humans facing unpredictable environments (earthquakes) and the ravages of disease (tuberculosis epidemic). An emotional and moving romantic story line is skilfully stitched into the unfolding plot. Some of the romantic aspects in Ghibli can come across as middle of the road ('Ocean Waves' as a case in point). However, this one struck a melancholic chord. A wonderful midway point between the  realistic/grounded Ghibli works, and those containing a more radical/magical sensibility.",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "The final Masterpiece of Hayao Miyazaki. A rich story and beautiful animation make this Movie one of the greatest Ghibli has created yet.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "Hayao Miyazaki's latest entry on Studio Ghibli is a wonderful animated fictionalized version of Jiro Horikoshi's life as well as a beautiful homage to the genius.",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful films I've ever seen. Such a dynamic and moving film. The Wind Rises accentuates the beauty of passion, love, and companionship and juxtaposes it against the bleak reality of a war torn Japan. The story is dotted with the most magical dream sequences giving it that Miyazaki touch. Yet, this film is not an ordinary Ghibli film. Instead, it is closer to Grave of the Fireflies than to Spirited Away, in that it does not shy away from darkness. It's darkness is what grounds it firmly in reality. It gives the story its profound nature and communicates a balance between good and evil. It gave me hope.",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "Its subject matter may not be for everyone's interest, but it's overall an excellent, fitting and bittersweet swan song for the legendary Hayao Miyazaki.",
            "review_date": "2020-05-12",
            "source": "rt"
        },
        {
            "content": "La difficoltà di far aderire un film animato ad una storia vera è già di per sé un grandissimo punto a favore.\nVengono trattati temi molto delicati in maniera lucida e coerente.\nForse avrei apprezzato qualche cenno in più in merito alle ideologie del protagonista.",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "A story well told. Of dreams, love & airplanes..",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "（8.0）I love Hayao Miyazaki!I love this movie!",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "This movie should have won an oscar.",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "The Wind Rises is an interesting anime movie. It talks about the life of Jiro Horikoshi and his dreams of creating airplanes for the Japanese military. I love everything from this movie: the voice performances, the animation, the score, the story, etc. In my opinion, this movie should have won the Oscar instead of Frozen. At least director, Hayao Miyazaki, had make another amazing anime film. Overall, The Wind Rises had successfully passed the test.",
            "review_date": "2020-01-18",
            "source": "rt"
        },
        {
            "content": "Watching this with two friends talking about it was difficult, but it's beautiful. I have to go back and rewatch it. \"All I wanted to do was make something beautiful.\" Art often generates controversy and pushback, but I do feel like saying I disagree with the controversy here. The inherent clash between wanting to make something beautiful and making what turned out to be a kamikaze war weapon is excellent material for a story. This struck me in particular while watching: it's a true story, and Miyazaki and co give it a more \"cinematic\" look, for lack of a better word. For the first time I found myself reflecting on the fact Miyazaki is an adult who must watch, and be impressed by, lots of relatively conventional movies. (For example, I'd imagine he saw Reds, the 1981 historical movie about the Bolshevik revolution.) Usually the films Studio Ghibli makes are so fantastical that I never stop to think a normal person made this, someone who goes down to the cinema sometimes and buys a ticket.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "A visually immersive masterpiece. Miyazaki's farewell chapter, The Wind Rises captures the magical power of dreams, as well as the inexplicable aura of true love; all through the lens of a boy, who lived a life. \nIroh's grade: B",
            "review_date": "2019-08-10",
            "source": "rt"
        }
    ]
}