{
    "rating": 8.9,
    "release_date": "2014-11-07",
    "num_reviews": 90,
    "genres": [
        "Portuguese(Brazil)"
    ],
    "summary": "A blind teenager's life and world is changed with the arrival of Gabriel.",
    "reviews": [
        {
            "content": "What a wonderful movie, tastefully done with two great kid actors, makes this a movie you cannot help but fall in love with!!!!!",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a sweet warmth to this movie that is impossible to deny. The characters and their relationships, particularly in the first half, are colored in very realistically; you can genuinely latch onto them and care about the small-scale drama unfolding in their lives. However, the film does stall out toward the end and it tries to manufacture added drama around elements of the story we've already addressed (and as far as the audience is concerned, already resolved). Gabriel's sexuality and Karina's place in the love parallelogram are good examples of this. Had that part been tightened up and the subplot with the exchange program been given a bit more of a meaningful finish, the film would get higher marks. As it is though, it's hard not to enjoy this.",
            "review_date": "2022-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a wonderfully sweet film about Leonardo, a blind, gay (but closeted), high school student struggling with his desire for independence and his sexuality while confronting bullying at school. I love that Leonardo feels like a fully fleshed out character with flaws and faults, strengths and agency, all despite being blind. This could have very easily been very sappy and saccharine, with Leonardo treated as a helpless baby, but there is a wonderfully complex, loving story here.",
            "review_date": "2021-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so beautiful. Its picture the perfect love story between man and man. The story is so delivering and perfect.",
            "review_date": "2021-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So sweet, so heartwarming, likable characters and realistic conflict. What a breath of fresh air to have an LGBT romance free of the bury your gays trope.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fresh idea that makes way to a simple yet beautiful love story.  Gabriel falls in love with Leo despite Leo being blind.  In turn, Gabriel falls in love with  Leo despite of never been able to see him.  It's a story where love breaks all barriers, it's true love.  I recomend that teens watch this movie as to learn what real love should be. The  actors specially the one that play Leo were stellar.  I was convinced the actor that played Leo he was a blind actor in real life he's not .  Bravo!",
            "review_date": "2021-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Beautiful,Intelligent and charismatic tale about a blind boy finding love,while not having that much drama with the \"am i gay?\" the real drama comes with the other characters that also have romantic problems,the movie focuses a lot in the most simple of moments,and this is when te movie really shines,the gestures and the way that the actors emote is soo real that makes you smile of happines with then,this movie is really adorable,its basically a \"call me by your name\" for younger ages,but it has some more intense moments even if they are peaceful,some of the little details like iin the beggining of the movie leo says that he absolutely hates sublock but when gabriel asks him to put some on himself and he just puts even leting gabriel put more,and the bath scene is adorable with a really small detail that can fly over some people's heads,the sundtrack is great and the cinematography is simple,but the acting makes for it.\nI Recommend to watch the behind the scenes and the deleted scenes,the movie should probably be 2 hours,one hour and a half lefts you wanting more of this masterpiece.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it.",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing, is a must seen",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Way He Looks has a tiresome plot with the girl, but otherwise it's superbly crafted on every level as it's filled with such abundant, accurate, real details that make the film honest and rich. It deals with blindness in such a grounded manner while also developing a sweet, great romance. The cinematic touches to it are masterful and the characterization is excellent. It's a wonderful movie.",
            "review_date": "2019-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best LGBT movie I have ever seen and I have seen most of them. I don't give very many movies a 10 out of 10 but this was deserves it its absolutely flawless on every level. the acting is wonderful Ghilherme Lobo as leo couldn't be more perfect. the movie has so much heart and soul you feel everything the characters are feeling and going through and the romance in this film is delightful leo and Gabriel are such a well made couple and there chemistry is so good and believable the kiss scene at the end of the movie is just pure magic and gives me chills every time. the movie is flawless and you have to watch it if you haven't already. ",
            "review_date": "2019-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hidden gem amongst the crowded coming of age dramas, The Way He Looks nails its refreshingly different, albeit difficult premise with a level of honesty and sweetness that no other movie could match.",
            "review_date": "2019-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE WAY HE LOOKS\nOne of the best Lgbt-themed movies Iï¿ 1/2 1/2 1/2(TM)ve watched. This reminds me of the novel Aristotle and Dante Discover the Secrets of the Universe. Itï¿ 1/2 1/2 1/2(TM)s an exquisite portrayal of gay romance, friendship, and coming of age story. This Brazilian movie gets all the details in the most subtle and beautiful manner. I canï¿ 1/2 1/2 1/2(TM)t stop thinking about it-Iï¿ 1/2 1/2 1/2(TM)m literally obsessed with it. Its subtlety and perfection on laying out small details are just exceptional. The love story between Leonardo (a blind since birth) and Gabriel (a newcomer) is so authentic and inspiring. An instant classic for sure. I fucking love it. 5 bananas out of 5. \n#thewayhelooks #brazilianmovie #moviereview #moviereviewer #gay #gaymovie #comingofage #todayiwanttogobackalone #lgbt #lgbtmovie",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming of age on top of being blind is interesting for Leo",
            "review_date": "2019-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considered as coming-of-age movie, this was light, fresh, cute, and easy-to-follow movie about blind adolescent that started to discover his identity, and his sexual life and fantasy. A simple and smooth premise. Forever in love with this movie!",
            "review_date": "2019-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best LGBT movies in existence!",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such an adorable movie. The two main characters had great chemistry. The plot moved along great, not too fast or slow.",
            "review_date": "2018-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full Of Visceral Moments. Crafted To Emphasize The Subtleties Of Loneliness, Longing, Shame, Miscommunication, Joy And Togetherness. Beautiful Music.",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nearly perfect film.",
            "review_date": "2017-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful Portuguese film depicting a blind student attracted to a new student. The actress playing Giovana did a phenomenal job portraying her character and was an overall wonderful link between both main male characters.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film, have never grown tired of watching it. Restores my warmth for humanity",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never ever have I given a gay film a *5* star Review but in this case IT DEFINATELY DESERVES IT.  There is no sex, its not that kind of movie but it strikes so close to the heart.  Me and my Partner of 37 years really enjoyed this movie!!!!!",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming of age movie that deals with homosexuality and the thought process. I liked the camera work. I was very pleased that the film didn't dumb down the audience and try to paint a flowery process, but allowed us to see the process for what it is.",
            "review_date": "2017-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this little movie is far from being perfect, but there´s something sweet and charming in it, you leave the movie with a feeling of satisfaction, a kind of satisfaction you don´t feel often in the movies anymore.",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my absolute favourites. Stunning film",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Ribeiro brings one of the coolest, most delightful and enjoyable stories about young people in the contemporary era of 2014, which is so lacking in the world of cinema. \"The Way He Looks\" is a work of effort and dedication in which it jumps to the screens a very sweet and tender narrative of the romance of two boys that doubtless make that the audience stares and keep glued in the tape forgetting everything else and just paying attention on it. Ribiero arrives with a well-constructed narrative that speaks of strength, confidence, independence and the unstoppable desire to explore the world and the pleasures of life, facing reality with experiences of all kinds that leave nothing but thoughts, beautiful anecdotes and the learnings about the pursuit of sexuality. The friendship as a theme is great in \"The way he looks\" as well as the feelings we find which are transmitted in a sometimes hard way but full of love and truth. It does not take too many dramas to create an excellent story and here no resource is forced, and while there is tension, this is certainly a charming and heartfeeling tale.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is for sure one of the best LGBtQ+ movies I have seen in a very long time. It's hard to find a quality one anymore, I will admit that occasionally I will watch some of the trashy ones just for fun but I do love a quality one. The Way He Looks shows that you don't have to be overly sexual in a movie to make it interesting. It told the story in a beautiful way that I thoroughly enjoyed.",
            "review_date": "2016-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a lovely, relatable movie. A must watch!",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fresh, intriguing, crisp, unique, romantic, beautiful-\"The Way He Looks\" carries the audience through a wonderful journey of self-discovery, growth, friendship and love. The characters are so lovable, the storyline pops with creativity, and you are sure to be moved throughout this amazing film. Seriously, the trailer doesn't do this movie justice. You'll just have to see it for yourself!",
            "review_date": "2016-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, the movie is perfect",
            "review_date": "2016-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film with a simple story and excellent performances.  Truly beautiful.",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice and charming self-discovery film from the point of view of a blind kid. It's a little too obvious and surfaced, but at the very least gives you a more or less realistic perspective of high school and very formative years of a life with that condition. I just wish it wasn't straightforward in its approach, as it makes it less interesting as a character piece.",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant! Saw the short film and the feature movie is even better!",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 Stars. Overrated IMHO.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film. Brilliant cinematography and a cleverly-penned script really give the three principle actors something to sink their teeth into. And do they ever! Totally worth the watch, with or without any grasp of Portuguese -- the subtitles are true to the literal and figurative meanings of the dialogue. If you aren't thoroughly charmed by this easy-going but rich feature, then you should probably stick to Iron Man movies and hope for another Twilight sequel.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie story was on point",
            "review_date": "2015-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie. So adorable. Has what must be one of the best pay-off kiss scenes in all of cinema.",
            "review_date": "2015-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those good feel movies. Simple predictable plot, characters and nice soundtrack. Not much to remember after the credits run.",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really quite sweet, but retreads old ground. The characters are endearing, though, when they aren't being silly just for the sake of prolonging the narrative.",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Expanding the idea from an endearing short into a film, a script could fail, but not this time. The tenderness from the original idea comes developed with bright sensibility whose only mistake could be found taking count on minor plot holes.",
            "review_date": "2015-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful and unique coming-of-age story. I fell in love with the original short film a couple years ago (I Don't Want to Go Back Alone) and I was ecstatic when I found out they were making into into a feature film. One of the best LGBT movies I've seen.",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's nothing terribly original about this movie, but it is ridiculously cute.",
            "review_date": "2015-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow moving but honest and compassionate view of identity and adolescence. Better than over rated \"Boyhood\"and has more purpose and meaning. Not brilliant but very good International cinema. In Spanish with English subtitles",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A highly emotional and sweet romantic movie about a blind boy named Leonardo who is desperate for independence and then unexpectedly falls in love with his male friend Gabriel. Simple in plot yet poignant in spirit and flawless acting this movie manages to leave you with a profound and compassionate feeling. If you believe in love, you will find this movie heartwarming and resonant.",
            "review_date": "2015-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While certainly a sweet story with some terrific performances, The Way He Looks lacks emotional depth as well as some poignant chemistry between the male leads",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story tells us about a boy who is being bullied at school and is getting too much attention from his parents because he is blind. Not being able to lead a normal life he becomes a shy boy who is always ready to protect himself from others. However, in spite of all this pressure he stayed who he was and also he was honest and brave enough to be with whom he really wanted to be.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story. Beautiful. Gave me goosebumps. Everyone deserves to experience love.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so, so, so good. Plus, the characters are adorable.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blind teenager Leonardo (Ghilherme Lobo) longs independence from his parents, classmates, the ennui of the every day. Along with his best and only friend, Giovana (Tess Amorim), he laments over the general lack of excitement of being in high school. Things begin to look up, however, when he meets a new student named Gabriel (Fabio Audi), someone who is unlike the other boys in his class.\n\n\"The Way He Looks,\" written and directed by Daniel Ribeiro, is an LGBTQ picture that radiates honesty and with that quality it is already lightyears from its contemporaries. It neither relies on overt sexuality to be sexy nor a syrupy romance to get us to invest in the lives of the three Brazilian teenagers. Its approach is simple but effective: it shows the characters' insecurities, how they deal with their problems, and the reconciliation, if any, that occurs when or if they learn to mature a little bit.\n\nThere is an organic feel to the look of the film. It benefits from not one scene being shot in a studio. When we are inside Leo's house, we notice the decorations on the walls, the knickknacks on the side tables, how lived in it all feels. When a scene is set at school, the floors are not shiny, the desks appear as though they have been used for years, certain corridors look like they need a bit of polishing. Because of its realistic look and feel, it establishes a certain tone-that we are looking at real lives being lived in real places.\n\nLeo's arguments with his parents, too, are executed with realism. Watching them felt like I was being intrusive at times. The disagreements come across as genuine, from the tone and pitch of their voices to how close they get to one another physically. The words chosen and how they are delivered are not glossy or hyper-articulate. It makes these scenes very relatable and there were a couple of times when I could not help but think back to certain instances when I was upset with my parents after a long day of school.\n\nThe friendships among the three are sweet. Throughout the course of the picture, we discover how the dynamics of their relationships work. Sometimes they are fragile but surprisingly strong at times. There is a great metaphor introduced in the middle which involves the sun, the moon, and the earth when an eclipse occurs. Furthermore, there is a theme involving fear of losing a strong connection throughout-whether it be of a long-lasting friendship or a potential romance.\n\nI enjoyed that sometimes it isn't clear what a character wants exactly. We try to figure it out. Is the truth hidden in behavior? How one looks at another? How one acts when he or she is by herself? That confusion is tackled here in a fresh way. It is essential that it is communicated with clarity. After all, it is a part of being young and still trying to figure out one's identity.\n\n\"Hoje Eu Quero Voltar Sozinho\" ends right where it should and yet I could not help but want to see more of Leo, Gi, and Gabriel's lives after it wrapped up. The feeling I had as it finished reminded me of a similar sentiment, somewhere along the lines of saying goodbye to a good friend. You know you're not going to see this friend for a long time and so a part of you is sad. At the same time, that friendship is very secure so fear is not at all a part of having to step away.\n\nFilm-Review.org",
            "review_date": "2015-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "warm, smart and delightful.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some prince charming is not after the princess.\n\nThe Brasil's submission for the last concluded American Academy Awards, the 2015's Oscar edition and as we know it did not make that far. Again, one more movie in the list of 'based on the short film'. It also retained all the prominent cast and their respective roles for this full length feature. A teen romance-drama, a gay theme as well as a love triangle. Very light and softly narrated tricky romance theme and obviously suited well as a complete picture.\n\nThe story was told from the perspective of a blind high school student Leo. He and Gi are the friends since childhood. She's always there for him like a pair of eyes, a companion who walks with him home, only until a new student Gabe arrives. The things are starting to change around them and they begin to realise how much valuable to each other. What comes after is the crux of the story. The same old jealousy story, but from the fresh cast it looked so good.\n\n\"In our eclipse, Gabriel would be the\nEarth and you, the moon.\"\n\nA successful domestic box office, critically acclaimed film and the better ratings in all the online movie database, but to me it was just a good movie. The story had adorable characters and the love tale was told in a cute way, though that was not enough for me to get excited. No offense, but the gay theme was the letdown, that doesn't mean I'm against the gay. I loved 'Love of Siam' and 'Bangkok Love Story'. Maybe because I'm a straight, though I had no problem with the movies like 'Water Lilies', 'Yes or No' and other lesbian movies.\n\nIt's a crazy world, full of crazy people and their crazy romances. Whatever the format is, the love is always sweet. I liked this film's concept, if it was reversed from the gay to the lesbian, probably I would have loved it more. Or the story structure and character development in the first half should have been improved. Because in the end part, looked everything hurried and forced to conclude. Don't listen to me, you might like it, but be cautious, especially don't go after it with a great expectation seeing plenty of praise everywhere.\n\n7/10",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blind teenager Leonardo (Ghilherme Lobo) longs independence from his parents, classmates, the ennui of the every day. Along with his best and only friend, Giovana (Tess Amorim), he laments over the general lack of excitement of being in high school. Things begin to look up, however, when he meets a new student named Gabriel (Fabio Audi), someone who is unlike the other boys in his class.\n\n\"The Way He Looks,\" written and directed by Daniel Ribeiro, is an LGBTQ picture that radiates honesty and with that quality it is already lightyears from its contemporaries. It neither relies on overt sexuality to be sexy nor a syrupy romance to get us to invest in the lives of the three Brazilian teenagers. Its approach is simple but effective: it shows the characters' insecurities, how they deal with their problems, and the reconciliation, if any, that occurs when or if they learn to mature a little bit.\n\nThere is an organic feel to the look of the film. It benefits from not one scene being shot in a studio. When we are inside Leo's house, we notice the decorations on the walls, the knickknacks on the side tables, how lived in it all feels. When a scene is set at school, the floors are not shiny, the desks appear as though they have been used for years, certain corridors look like they need a bit of polishing. Because of its realistic look and feel, it establishes a certain tone-that we are looking at real lives being lived in real places.\n\nLeo's arguments with his parents, too, are executed with realism. Watching them felt like I was being intrusive at times. The disagreements come across as genuine, from the tone and pitch of their voices to how close they get to one another physically. The words chosen and how they are delivered are not glossy or hyper-articulate. It makes these scenes very relatable and there were a couple of times when I could not help but think back to certain instances when I was upset with my parents after a long day of school.\n\nThe friendships among the three are sweet. Throughout the course of the picture, we discover how the dynamics of their relationships work. Sometimes they are fragile but surprisingly strong at times. There is a great metaphor introduced in the middle which involves the sun, the moon, and the earth when an eclipse occurs. Furthermore, there is a theme involving fear of losing a strong connection throughout-whether it be of a long-lasting friendship or a potential romance.\n\nI enjoyed that sometimes it isn't clear what a character wants exactly. We try to figure it out. Is the truth hidden in behavior? How one looks at another? How one acts when he or she is by herself? That confusion is tackled here in a fresh way. It is essential that it is communicated with clarity. After all, it is a part of being young and still trying to figure out one's identity.\n\n\"Hoje Eu Quero Voltar Sozinho\" ends right where it should and yet I could not help but want to see more of Leo, Gi, and Gabriel's lives after it wrapped up. The feeling I had as it finished reminded me of a similar sentiment, somewhere along the lines of saying goodbye to a good friend. You know you're not going to see this friend for a long time and so a part of you is sad. At the same time, that friendship is very secure so fear is not at all a part of having to step away.\n\nFilm-Review.org",
            "review_date": "2015-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple and sweet and one of the best pieces of queer cinema I've seen to date.",
            "review_date": "2015-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Way He Looks is a classic movie about romance, jealousy, love and hate. It totally delivers on those parts and it's really touching too. The directing and the script is very unique, and I really recommend this movie for everyone out there, especially parents! It feels so real and the plot is very well written! \n\n7/10",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great coming of age story.",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it, I tend to not like romantic films because they're all focused on heteronormative couples, so this was a nice change",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story of my life. Hahahaha",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best movie in the genre I've ever seen. Wonderful, wonderful story.",
            "review_date": "2015-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet delightful coming of age and coming drama about a blind teenager. Gentle and a really good watch.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot may follow a familiar path, but this coming-of-age gay film brings heart and relatability to a blind teen's story of first love.",
            "review_date": "2015-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt like the world was a good place after I watched this movie. Seriously good stuff. Recommend it as strongly as possible!",
            "review_date": "2015-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated... So boring... I didn't like it... But ending was nice. Actors were good too... But I was really disappointed...",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave it a 5 for its perfect romanticism, it will bring back memories when you had a crush in high school - absolutely love the 3 characters in this movie.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'\"Goodbye,\" said the fox. \"And now here is my secret, a very simple secret: It is only with the heart that one can see rightly; what is essential is invisible to the eye.\"' ? Antoine de Saint-Exupéry\n\nA quote from 'The Little Prince'; not the most auspicious of starts when reviewing a film, I know... But do bear with me.\n\nMuch like 'The Little Prince', you will not find the film 'The Way He Looks' featuring anytime soon in any Top 10 lists of the year or of all time.\n\nIt is not a critics' darling. It doesn't capture the zeitgeist and it certainly does not provide any groundbreaking insight about the times we live in. It is not a 'Catcher in the rye' nor a 'In Search of Lost Time'. But it is a 'The Little Prince', concocted with the same deceptive simplicity and irresistible understated charm. And just as likely a target for the same misanthropic, highbrow bile as the latter is.\n\nIts plot, an age-old story of teenage girl/boy/otherwise meets teenage girl/boy/otherwise. Its magic, telling it with inescapable charm and simplicity.\n\nSeemingly reducing the complexity of the human condition to its most clichéd, over-simplistic denominator, what in reality this film does is finding the common humanity in all of us and bridging the gap by conveying it in a universally accessible language, that of emotions, sensations and of fewer words as possible; blasphemy for the supposedly more sophisticated masses.\n\nThe film is awkward, silly at times, and it revels in it. It comes to life when depicting with disarming sincerity and earnestness such moments of embarrassing unease.\n\nEmbarrassing unease; that is the ultimate definition of being a teenager, if there has ever been any. Sex hasn't happened yet. Life hasn't happened yet. You are discovering who you are, how your body responds to stimulus, which stimulus it prefers and how. You have never chartered these waters before, you have no clue what to expect and feel completely out of your depth. You are clumsy, all that you do and say is pathetic and all that surrounds and happens to you is silly and painfully awkward. And yet, you have never felt so alive.\n\nA few babyish kisses in a foggy shower mirror. One fully clothed masturbation scene, angle wide focused on the eyes, the lips, the face, the touch and the thrill of discovering fantasy and pleasure. One lips-only hushed kiss. One fleeting glance at your loved one's line of beauty. One climatic final embrace. The thrilling delight of speeding away down your street in your bike, holding the one you love tight, with a joyful abandonment that only youth and inexperience allows.\n\nLet's face it: Disney nowadays manages to squeeze in more action than this. And yet, 'The Way He Looks' stands tall as one of the most sensual pictures ever made. Nothing you see will arouse you. Nothing is overt, crass or vulgar. Its sensuality derives not from what you see but from what you experience. With its disarming sincerity and earnestness, the film pulls you in; you don't observe as much as you experience.\n\nIt is you who is braving a confusing and yet pleasurable and uncharted territory of newly discovered sensations. It is you feeling the thrill of experiencing love and infatuation for the very first time and the absolute dread of not being able to live up to its promise. It is you he/she is holding; you he/she desires. It is you kissing, you being kissed. It is your hair that the wind tosses in that final elating bike ride. It is you being inflicted the cruelty of bullies who taunt you mercilessly for not being able to see, for not being the life and soul of the party, for sticking out like a sore thumb. It is you who holds your beloved hands as a show of defiance to them.\n\nSome films will provide you with the comic relief needed to manage the drudgeries of daily life and prevent you from falling down the perilous pitfalls you find along the way. Other films will provide you with a safe haven to let it all out, anger and sadness alike, by serving as a metaphor and ultimate validation of all the sorrows in your life.\n\nBut then there are films that by virtue of their artistry will fill you with a pervasive sense that irrespective of the reality that you are facing, you will ultimately prevail in some form or the other and will still be able to somehow take a small measure of joy from what surrounds you. Such films will not necessarily give you profound insights about life and your existence, nor will they open your eyes to new ways of being and doing, nor will they invariably make you cry or laugh out loud. Instead, they will fill you with an unbridled, understated elation and an inescapable sensation of being at peace with life passing mercilessly by and you somehow still managing to take some pleasurable bits of it for your enjoyment. They will make it OK to be OK with life as is and its imperfections.\n\nNothing in this film feels false or formulaic, owing much to one of the most naturalistic and sincere pieces of acting to ever grace the screen, curtsy of its 3 main leads, Ghilherme Lobo, Fabio Audi and Tess Amorim. You will find it silly and unsophisticated. You will find it unremarkable and understated. And you also will feel hijacked by expectancy, as you see sincere love unfolding before your eyes. You will end up elated and uplifted. You will want to clap at the end and will be left feeling giddy for weeks to come. You will be a willing prisoner of its charm.\n\nJust don't forget to leave your misanthropic self behind when entering the screening room; you can always get back to it later. Give it a break.\n\nThat fox was on to something after all...\n\nhttps://cinephiliaetc.wordpress.com",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching, beautiful movie about teenage love, sexuality and \"growing up\".",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is wonderful. The lead actor does a remarkable job and is truly a must-see. I have and will continue to recommend this movie to everyone I know. It has now one of my favorite movies of all time. It explores so much, even bullying without being overly dramatic. It relates to real life!",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Brazilian movie and where is 6 stars button? \"The Way He Looks\" successfully reminds us the way we were.  Wish to have that innocent thrills at least one more time.  Truly pure and passionate.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is so sweet,so beautifully delivered and such a nice coming-of-age story.With a very specific and very delicate plot,it made me feel uncomfortable in many ways.I have watched the short movie that was the predecessor of this story and in way I felt like watching the same story with more details.I didn't know what to expect.Perhaps I thought this will be a sequel but now I'm really glad I got to see a full picture.This is a heart-warming movie.Not a great one but definitely a good one.",
            "review_date": "2015-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful movie and it's on Netflix! Go watch it people!!!",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this at the 2015 Cleveland International Film Festival. Expanded from young director Daniel Ribeiro's 2010 short I Don't Want to Go Back Alone. The three young Brazilian actors who star (Ghilherme Lobo, Fabio Audi, and Tess Amorim) do not have a lot of acting experience. The whole film felt a little amateurish and soap opera-ish. The love story of two high school boys discovering their sexuality is sweet. Mix into this that the one young man Leonardo, played by Ghilherme Lobo, is blind and seeking independence in the world. The teens, parents, and teachers as written are all playing types instead of real, fully developed characters.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful, adorable movie that is probably the best coming of age movie I have seen since The Perks of Being a Wallflower. This was Brazil's submission for Oscar consideration and I am disappointed it didn't make it in because as much as I liked Ida and Leviathan, this film trumps them both. It's a wonderful debut performance from Ghilherme Lobo who plays a blind kid, Leo, and I had to research to find out if the actor is blind in real life (he isn't) because he gave on of the better performances as a blind character that I've seen on film. The story is ultimately about friendship between a few different people and how Leo just wants to be a normal teen which sounds like a been there done that concept with teenagers with a crutch but works well here with Leo's interest in an exchange program, going to parties, the movies, just normal teenage life. Fabio Audi is also wonderful as Leo's new friend Gabriel. It has a beautiful screenplay and certain sequences especially a dream sequence that are well crafted. It's a lovely film that joins in the elite club of movies I found myself sad to see end because I feel in love with these characters and the story so much. Definitely check it out on Netflix",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple, well-developed, believable, and very likable. A lot of \"gay\" films seem to drown in corniness or unrealistic setups, but this film is not one of them. Sometimes I feel as though watching a movie in a foreign language allows me to better enjoy the actors' abilities to emote. This cast did a great job. There is a scene with the father and son that is very touching, but I feel like the exchange program element of the plot was a tidbit unresolved by the end.",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting \nthoughtful \nplayful\na hint of cherry",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Instant LGBTQ classic! A wonderful and beautiful coming of age story where you find yourself rooting for Leo & Giovanni.",
            "review_date": "2015-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being a little saccharine, no movie has warmed my heart like this in years. It's nice to see a film about the gay and disabled that isn't just about how hard life is, depicting struggle after struggle after struggle. The LGBTQ community especially needs more films like this that normalize queerness and don't justify their point of view for the sake of pleasing the close minded.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Way He Looks is fantastic! There is so much chemistry between the characters and the script is raw and vulnerable.",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just so lovable and heartfulling, also a great refresh to brazilian movies.",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet young love it is :)",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unexpectedly well acted and directed coming of age Brazilian film, worthy of the accolades it received at the Berlin Film Festival. A well written story with compassion and warmth which is not normally found in films of this genre.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really sweet without becoming saccharine.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful. This is in essence a high school romance. No great plot twists or shocks. However it is so well crafted and so deeply touching. It touches on issues of independence, sexuality, and disability from a very naturalistic and real perspective. A very honest, gentle film that I already know will stay with me for years to come.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautiful gentle film with a happy charming end, phew",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the short so I'm glad they made this into a feature length. I'm in love with this movie. It's just so good. Very sweet.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are only a few films nowadays that actually induce a deep, emotional connection between its' viewers. This is one of them.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        }
    ]
}