{
    "rating": 9.0,
    "release_date": "2014-10-17",
    "num_reviews": 290,
    "genres": [
        "Fantasy",
        "Anime"
    ],
    "summary": "A tiny nymph found inside a bamboo stalk grows into a beautiful and desirable young woman, who orders her suitors to prove their love by completing a series of near-impossible tasks.",
    "reviews": [
        {
            "content": "This movie was the most beautiful movie I have every watched. Every. Single. Aspect. of it was absolutely incredible. It is perhaps one of the most visually pleasing movies i have ever watched. The art is nothing short of perfect. It encapsulates the feeling of the movie, whether that was purposeful of not is irrelevant, there is no denying it fits so well. The themes of the movie brought me to tears several times. Although decently surface level, the portrayal of wealth vs happiness and the importance of all human emotions was gorgeous.  1 billion out of ten",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me feel at a level I haven't experienced since many years. The Art style, the scenes, the mood. It is a masterpiece. I spent years scared to watch it again, in fear of losing that first and strong impression it left on me.",
            "review_date": "2023-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is pretty poor 👎",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe a little overrated? Sure, the animation is beautiful and the story is undeniably heartwarming, but it also drags on much longer than it needs to and misses a ton of opportunities to dive into the characters and their relationships. Instead, it uses this intimidating runtime to get weirdly plotty and explain some stuff that didn't really need explaining.\n\nSomehow the movie's main theme of letting your loved ones do what makes them happy instead of forcing them into a specific life gets completely overshadowed with some weird stuff about not wanting to return to the moon (?), despite the fact that our main character has seemingly not experienced real joy for years. It was just a strange way to climax a movie that seemed like it was building to some obvious, yet powerful emotional moments between the princess and her parents.\n\nBut enough complaining! The fact is that this is still a good movie. I've already mentioned the animation, but it can't be overstated how unique and gorgeous it is. The characters have depth and realism that's often missing in animated movies.\n\nIt doesn't quite make it on Ghibli's best-of list, but it's a solid watch.",
            "review_date": "2023-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely movie with the reality of our society and feeling of a young girl. 😊",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Tale of the Princess Kaguya\" brings my Studio Ghibli journey to a close until the studio releases new films. In a studio known for being unique, this is one of the most unique outings they've had. The story has the magical and whimsical nature they are known for, but the animation is truly one of a kind. Anyone who likes seeing different visual styles of animation needs to watch this movie. Its beautiful simplicity with its visuals is a wonder. I think the story is pretty good too but I mostly appreciated this one because of the visual splendors it provided. Overall, I think this is among the better films from the studio and is just one of many examples of their creative projects.",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "im confused but pretty good art",
            "review_date": "2022-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hard not to be struck by the visual beauty of this masterpiece, a perfect and careful work that turns a folk tale into a story of great depth, nostalgia and tenderness. One of the best animated films of all time, timeless and wonderful; and another great achievement of Studio Ghibli and Isao Takahata.",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With its melancholic story about Princess Kaguya's life journey being forced to grow up fast despite all she ever wanted was to cherish life, The Tale of Princess Kaguya cranked up the emotional impact to nine thousand. In a subtle way, the picture smacks you with emotional beats left and right. When you combine that with the stunning animation that perfectly complements the tale, you have an incredible modern classic that will be discussed in decades to come. Despite the fact that several secondary characters are one-dimensional and the story may alienate some viewers, the pros of this film far outweigh the disadvantages, and it is the closest thing to a perfect film. The Tale of Princess Kaguya is indeed an imaginative art form that neither Pixar nor any other studio has ever produced.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Through this film, Isao Takahata leaves us an astounding philosophical treatise in which social stratification, gender and spirituality are gently dissected. A declaration of love to the short time we are here alive, an invitation to reflect on it and not waste our precious time and the few chances we get at being happy.",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The flowers open and the trees bear fruit, even if they fade at last\", the last paragraph is a subtle metaphor for death. The line between clarity and filth is blurred, what you wanted to escape from and what you were looking for become objects of recollection, and the memories of the land, whether joyful or sad, all glow. Eventually you realise that the existence of the world is ultimately a human existence, and that your love of the world is ultimately a love of people. Then you put on your gorgeous cerements and forget all about it, waiting for the next awakening of life as the seasons change.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "princess kaguya even with a very simple picture, but nice to look at. The main character also has a beauty face and her story is quite sad. I'm just not satisfied with the ending.",
            "review_date": "2021-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great farewell to Isao Takahata after a turbulent 1990 decade. An immersive and dazzling animation style and the greatest character from this director crowns an almost masterpiece. Here we have a great discussion about humanity versus hunger for social ascention, starring mainly the protagonist and her father. The ending was my only issue. I understood it, but it feels depressing and anticlimatic. However, considering the whole film, it's in the same level of Hayao Miyazaki's movie released on the same year, The Wind Rises.",
            "review_date": "2021-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is now my favourite Studio Ghibli movies and one of my favourite movies and it's a visual masterpiece and one of the few animated movies or movies in general that made cry",
            "review_date": "2021-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simple, magical and beautiful",
            "review_date": "2021-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Next movie on the Studio Ghibli film list. This is the 5th movie from Isao Takahata (rest in peace). Grave of the Fireflies and My Neighbor the Yamadas were two of my top favorite Ghibli movies. So naturally I was excited for this movie.\n\nNow I get the overwhelming positive and emotional reaction from many viewers, but for me, I didn't feel that much from the movie. The biggest reason for this was probably because I wasn't sure where the movie was going for the first half, and then the twist was a bit sudden.\n\nThe animation was the same as in the Yamadas, but this time it was better and more stylistic. \n\nI was a bit sad at the end. But overall, even though I get the theme, I didn't feel it, and the movie was a bit long. 7/10",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright, so I went into this film optomisticly; \"it's got 100% on rotten tomatoes and is made by studio ghibli,  what a perfect combination!\" I swear, I tried to watch this film for 3 days and was only able to make it 40 minutes in. Before I start my rant, let me clarify 2 things:\n1: I am an uncultured American and have no idea what is seen as appropriate in Japan. That being said, a good film is one in which anyone from anywhere can view and enjoy.\n2:  credit where credit is due, this film possesses beautiful animation and watercolor artwork, hence why I am not giving only half a star. \nAnyway, without further to do, I have a few criticisms I need to address. For one. This film is rather vulgar in nature; there are many scenes involving nude minors, genitalia, and exposed, growing breasts. I did not expect the amount of vulgarity I saw in this film, and It was extremely uncomfortable for me to sit through. Second. This films early messages and tone were discouraging for me ( I know that i didn't finish and I know that the themes may have strengthened, but as stated, I simply couldn't continue suffering through this film). There are two scenes in particular that bother me; (spoilers)one where the group of kids and kaguya steal a melon from a farmer, and for a second it seems that someone will say something about how it was wrong to do so, as they show the farmer frowning upon seeing his stolen crops. But instead, the greedy kids slice it open and devour it without noting on their unjust actions at all. Aditionally, I was irritated in the scene where they decide to randomly kill a pheasant in cold blood. Heck, one of the characters jumps of a cliff to catch it and kill it, almost injuring himself. Being a bird lover myself, I felt enraged by this vile scene which could have been left out of the film. It adds nothing other than showing how violent and greedy our \"protagonists\" really are. Combined with the vulgar nature of this film, I could not continue watching; i may revisit this film in the future, but for now, my opinion stands strong. I am not trying to discount the mythology behind this film, or discredit the talent and effort put into making it; however, as stated, a great film is one in which all audiences, young, old, black, white, in Greenland or Antarctica, can enjoy and gain something from. While viewers elsewhere may like seeing an old woman's breasts inflate to feed a baby, or seeing a gang of kids kill birds in the woods, I prefer less vulgar content. Say what you want about me not finishing it, but a good film should be watchable from beginning to end in one sitting.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful animated films ever. Great themes and story (though it can be hard to understand the point of the ending). What sinks the film is the excessive length. At over two hours, it is episodic and easy to just start waiting for it to end.",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a really good movie. It was fun in the beginning but it gets really depressing in the near end and I was in tears. If you're a young adult or a teen I recommend this for you",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very slow. 5.2/10",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the only problem i have with this film is that it didn't conclude with the moon-deities parade music",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the best",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While visually beautiful, the movie fails to deliver a compelling narrative. It instead relies on the trope of a princess with a mysterious origin and hopes that this concept is enough to fill the entire movie. While the characters are content to puzzle over Kaguya's origin for over 2 hours, the character and animation style failed to keep my interest over the length of the movie.",
            "review_date": "2020-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation here is looser and more impressionistic than in Miyazaki films. That contributes greatly to some scenes, detailed landscapes and the one scene where the princess is running away from the capital, while others can look a little sloppy. The third act gets fairly heavy, and though the specifics in the film make it sound a little ridiculous, it still has a universality that makes the princess's situation relatable. I mean, aren't we all in some sense just princesses dreading the day when we will have to leave Earth and go back to from where we came?",
            "review_date": "2020-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The images are beautiful but the movie is way too long!",
            "review_date": "2020-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest, the astounding stylized visuals carries the movie all over the way. In my opinion the narrative felt small, filled with symbolism, but this time with an uninteresting world . THE TALE OF THE PRINCESS KAGUYA 6.75",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen !! Studio Ghibli really knows how to make a legendary movie. From the plot to the animations and the film techniques and soundtrack. Perfect. Also, I really do recommend the Japanese version. It truly gets you into your feelings. And the meaning behind this, is a true beautiful sadness.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'The tale of princess Kaguya' is simply one of the finest animation movie I have ever seen.\n\nReminds me of Stayajit Ray's story telling -- simple, steadfast yet affective.",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tale of the princess Kaguya is a really heartwarming, touching and beautiful piece of art by Takahata! It would easily be a 5/5 stars movie for me, but unfortunately there are a few scenes that could have been easily cut out, so that the content would be a bit more tight. Still, this japanese folk tale is both happy and tragic, and it makes me cry everytime. Takahata surely left us with a beautiful swan song.",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely powerful, I am still crying.",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat overt in putting forth its theories on life, happiness, and the role one fulfills, The Tale of the Princess Kaguya still forms some beautifully bittersweet moments, balanced against charm, wholesomeness, and humor. It's real strength lies in its wonderful art style, embracing a watercolor-esque animation technique far different than what Ghibli has come to be associated with. The uniquely melancholic tone, as well, sets the film apart from its contemporaries, and is a unique strength of Takahata as a director. It might not carry the raw power and brutality of Grave of the Fireflies, but the tone is far more nuanced and balances the Japanese folklore basis far better than Pom Poko; to me, it is probably the most complete film by Takahata, given the visual daring and narrative complexity. (4.5/5)",
            "review_date": "2020-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern animated masterpiece and a fitting swan song for Isao Takahata with beautiful and artsy hand drawn animation  a well-crafted and poignant narrative, profound and thought-provoking themes, and an emotionally affecting and imaginative story based on an ancient Japanese folktale.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing and gorgeous movie!",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watercolour sketched animation style was beautiful, with a wonderful selection of shades and vibrant colours. Stills of the film would make lovely Japanese style paintings, capturing elegant moments of nature with great attention to detail. A particularly memorable scene involved the Princess running away with colourful robes and kimonos left on a path beneath an illuminating moon, which was meticulously framed and had this incredible style of illustration that really stood out. Possibly the most beautifully designed Ghibli piece. Majority of the plot worked nicely which was apparently taken from a Japanese folklore legend (involving a magical Princess found in a bamboo stalk raised by humble country folk). Includes some contentious princes hoping to become her husband being sent on impossible adventures; it reminded me of the fantastical ideas one would find in the iconic Arabian Nights stories. One of my favourite Ghibli works for sure. Only slight criticism was interest waning near the end point ending as it started to introduce ideas around the Princess' origins that failed to connect, and derailed parts of the prior plot and interest in the characters - however it seemed like this was all tied into the folkloric mythical element and did not greatly detract from overall enjoyment.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great to see, that Ghibli made a movie based on not just one of the oldest folktales of Japan, but one of the oldest ones in the world. Oh yeah I also like the style of Drawing. Those almost pencil like Graphics make it look like something, we've never seen before from Ghibli (except for the Yamadas but let's ignore that).",
            "review_date": "2020-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started watching Studio Ghibli films only recently, with this film followed only by My Neighbor: Totoro. The art is definitely different and the theme developed into a more mature note towards the end. What I really love about this film is how beautiful the use of watercolor was, especially with the wonderful play in color and intensity throughout the film. Can imagine framing some of the nature scenes  💕",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, I see why it had an Oscar nomination, it's beautiful and every frame is a captivating painting, but still not a perfect animated movie to give it a 100% rating. I found some scenes trite, banal, and mawkishly sentimental. But I won't deny that it's powerful in some ways.",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Artistically and engrossingly beautiful",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best animation i have ever watched",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully animated and conveying a simple, yet powerful and tender message about love, The Tale of the Princess Kaguya is amongst Studio Ghibli's most profound works.",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful. Hand made. Deep feelings. Thanks for this masterpiece.",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful?  Yes ! It could have been a better movie with 40 or 50 minutes less of runtime? Yes ! True story is very straightforward and animation is unique.",
            "review_date": "2020-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny, beautiful, melancholic and humour-filled tale. Undeniably handsome, the impressionistic art giving a strange sense of depth and weight and dynamism. \nThe film suffers from being a sprawling tale originally, moving through many ages and I found its themes either not translated well or difficult to follow, exactly the point of the tale or the take home message j wasn't sure. I just felt sad and like the entire story wasn't fair on anyone. \nThe dub is brilliant, Moretz as Kaguya is personable and spirited and James Caan's warm, sad portrayal of the woodcutter is truly engaging and nuanced. \n\nBut the films striking tone and spark are wistful and charming enough to redeem its 20 pounds of myth in a 10 pound bag.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "art like it should be done",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfying Japanese fable. The art style takes some getting used to, but lends itself to the period feel.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "weird and a mixed bag of 3 different movies that mostly works but ultimately doesnt quite come together",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Profound masterpiece.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, emotional film with a unique and engrossing art store.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simply put this film is utterly exquisite, with some of the most sumptuous animation ever seen on film, and a deeply humanistic story that touches the very soul. A delicate perfect work of art",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Ghibli masterpiece! Maybe the best of the studio in years! Takahata and all the stuff envolved in the movie are pure genius!",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a huge anime connoisseur. Before seeing this film I had seen popular anime movies  including Spirited Away, Princess Mononoke, Howl's Moving Castle, Akira and a few others but Princess Kaguya absolutely takes the cake as the best I've seen, and also one of the finest folklore movies I've ever seen, period. Kaguya is beautifully animated, the story keeps your interest throughout the 2.5 hour journey, the English dub is not only tolerable but excellent, and the dialogue is well written and lacks the awkwardness and cheesiness that many anime tend to have. Kaguya has a plethora of themes including the inspirational and healing power of nature, the difficulties of growing up, the curses that beauty/status/wealth can bring, the importance of freedom and playtime, and the importance of letting your children seek their passions. A true masterpiece in storytelling and animation and a movie I will pass on to those I love most.",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible. The animation, soundtrack and everything else about this is just fantastic! A must see!",
            "review_date": "2019-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie. One of the deepest stories adapted in the animation medium, this film is proof that adaptations and rip-offs are worthwhile watching or making. The expressionistic visual style accompanies the wonderful story and makes for a great emotional experience. \n This traditional Japanese folk tale is somehow so relatable that it's one of the few pieces of art that made me cry.",
            "review_date": "2019-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the soft art really brings out the innocence of the princess, the progression of the softness to the harsh and dramatic art is a great visual representation of her development from a simple little girl to a sheltered and scared woman. overall, a beautiful and original take to a classic tale. wouldn't expect anything less from Studio Ghibli.",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Isao Takahata is my favorite Studio Ghibli director because he puts top notch storytelling on top of creating epic, memorable characters. \nStudio Ghibli's take at this classical Japanese tale is nothing short of awesome. A gorgeous, fully hand-drawn animation, with a style that changes depending on the mood of the scene. The story being told didn't fail to make me emotional several times during the film. Takahata movies rely heavily on the plot so it's really hard to fully praise his work while avoiding spoilers. I will up this review by saying this: It's not your sunday afternoon movie, this isn't some cute animated movie. This is a heartwrenching, 2 hours and 17 minutes experience that will leave you sobbing and appreciating the little things in life. ",
            "review_date": "2019-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Tale of The Princess Kaguya features beautiful animation, beautiful music and a story that runs too long. Perhaps it's just because I'm not as familiar with Japanese folklore, but I also found it to be a little confusing. My kids weren't very pleased with the ending, either. I'm glad I saw it, but I probably won't be watching it again.",
            "review_date": "2019-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Ghibli film I haven't enjoyed, I mean that's generous i was bored to tears and my kids really lost interest in the second half.  It's one of those kids films that is actually aimed at hipster film critics.  This is a stinker and lasts well over 2 hours, avoid.",
            "review_date": "2018-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fantastic story and unique animation are beautiful.  However, some of the themes and opposition distracted.",
            "review_date": "2018-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this. So different. So special. So unique. Truly a once in a lifetime experience, like nothing I've ever seen before.",
            "review_date": "2018-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Isao Takahata pulls so punches with a story that is mesmerizing and surprisingly sobering. occasionally the story drags and feels like it gets a little lost but all an all it is a truly beautiful metaphor on excepting life as it is, or refusing to.",
            "review_date": "2018-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie released by Studio Ghibli.",
            "review_date": "2018-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly astonishing! Visually incredible and with a plot that is timeless and peculiar. This movie brings animation to a whole new level.",
            "review_date": "2018-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a time to be alive. Literally breathtaking.",
            "review_date": "2018-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An impressive epic, but the story is a bit simple.",
            "review_date": "2018-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most touching animations in history. A beautifully written movie with expression and feeling. Flawless.",
            "review_date": "2018-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a gorgeous movie, not surprising considering it's from studio ghibli",
            "review_date": "2018-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly enjoyed this movie. I cried a lot too!!!!!",
            "review_date": "2018-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly captures the atmosphere of folktale, eastern or not, along with the best animated artstyle I have ever seen.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The art style is extremely impressive, and the romance heartfelt. Life is only worth it if you're happy.",
            "review_date": "2017-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, and I burst into tears toward the end for no good reason. Amazing art, story, and just overall amazing.",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most visually arresting animated films from Studio Ghibli that is based on one of Japan's oldest folklores.\n\nThe story begins with a young princess that is born miraculously through a bamboo tree & grows up naturally with other children, adventure, fun & nature.\n\nWhen she becomes of age she then is forced into royalty & organized marriage. This is a beautiful & lyrical portrayal of strong young woman & I highly recommend for 12-13 girls & parents alike.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a great depth of complex emotions and truly enchanting animation that reminds one of a storybook come to life, 'The Tale of Princess Kaguya' is a magical and heart-breaking tale that has many great messages to impart to its viewers. A unique and profound watch.",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Tale of the Princess Kaguya is an absolute stunning piece of art. Let's just take a moment to appreciate how beautiful this film is, it is without a doubt a work of art. Every paint stroke, every detail and every frame by frame animation is perfection. I've never seen such exquisite visionary qualities in a film before. Every frame is colourful, bright and absolutely delightful to admire. Not to mention several scenes have multiple layers of animation embedded within them, masterful. I'm just...in awe of how amazing the animation was, I really am. Trust it to be Studio Ghibli, they really are masters of the animation genre. This film is a re-telling of the famous Japanese folk tale \"The Tale of the Bamboo Cutter\" where said bamboo cutter comes across a glowing stalk which is revealed to contain a princess. They raise her as she grows rapidly and, with the help of a divine presence, believe she should be living in the lifestyle of nobility. There is so much to analyse, so much to take in that I just don't have enough words to detail every theme that is explored. The story is one of happiness. The contrasting lifestyles of rural village people to rich noblemen. But is anyone actually truly happy? Princess Kaguya wishes to live back in the mountains whereas her old friends are jealous of her new luxurious residence. Within this personal conflict is the never ending battle of seeking true happiness which conclusively she does not find (much like everyone else in life). The bamboo cutter gave the princess a life in his own image, a life that he wished he desired all along. While he may have been happy, his daughter was not. He was blinded by the materialistic aspirations that he yearned for. The representation of the traditional Japanese culture was wonderful and really captured the authenticity of the folk tale. I do have to warn you though, don't let the cutesy animation fool you. I do not recommend this for children. It's a long runtime, there are heavy themes and I don't think they will fully appreciate it.",
            "review_date": "2017-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few animated films have such an exquisite blend of maturity and complexity. This truly is a Ghibli masterpiece, worthy to be compared with the best of all animated films. Kaguya boasts breath-taking artwork, complex emotions, satirical jabs at societal norms, powerful characters with real motives and incentives, and a depth that is likely to leave one pondering the themes of this film for sometime. This is not one to miss.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible! I was tearing up at the end! This film teaches important messages yet also kinda educational for we learn royal customs from Japan during the era",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic and beautiful fairy tale.",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another wonderfully inventive, beautifully animated fantasy story from the famous film studio.",
            "review_date": "2017-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is great, it's so colorful yet amazingly touching. I love this so much, especially the ending.",
            "review_date": "2017-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was visually impressive, the traditional elements from the original story of the moon princess (Kaguya Hime) was striking. I was left thorougly dissapointed with the story; I personally couldn't connect with the character as a major fan of the original story, I tried my best to differentiate the stories but could not get over that the character was thoroughly different from the book. The animation was beautiful, different from any other animation movie I have seen, it's nice to see something so unique in a time where computer animation and high detailed films are created; this film was left raw, like the characters and story, which I liked.",
            "review_date": "2016-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern day masterpiece , and a Beautiful Music score, The Procession of the Celestial Beings Music is unbelievable.",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful movie. I can really recommend this!",
            "review_date": "2016-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tale of princess Kaguya is a heart-breaking, beautiful story, and full of human-touch. Such a brillantly masterpiece. Always go along with the original.",
            "review_date": "2016-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The swan song of 78 year old director, Isao Takahata, The Tale of Princess Kaguya is an ethereal fluid, seamless brushstroke animation that unrolls like the Ukio-e scroll which Princess Kaguya playfully unrolls across the tatami mats.  You get the sense that the scenes are being painted as you're watching it.  What Takahata has accomplished is the next level of Anime, of animation, and of filmmaking in general.  The animation as well as the story are deceptively simple, but are full of complex & sophisticated flavours which will leave you satisfied, much like genuine Japanese cuisine and culture.  \nThe story is taken from the oldest recorded Japanese folktale, The Legend of the Bamboo Cutter's Daughter. Its themes are the simple joys of human life & the sadness of conforming to cultural norms. \nThe music is also beautifully minimalistic.  The koto music is exquisite.\nAfter watching the DVD's special features, you can see that Princess Kaguya had a long, painful labour, unlike the character in the film who comes miraculously out of a takenoko, a bamboo shoot.\nThere were a few times I thought of other films while watching this one. Near the end of this film, it has some similarities to Wim Wenders' classic, Wings of Desire, in that there are otherworldly beings wanting to experience the joys of human existence, the small pleasures of which most of us are unaware.  Also, the flying scene is very Miyazaki-ish. \nMy only complaints have nothing to do with the film itself:\n- The tagline of \"The Crime & Punishment of a Princess\" has nothing to do with this film at all.\n- It seems like any animated film is automatically labelled as a kid's movie.  Not so in Japan, Anime is not just for kids; it's for everyone.  There's even animated porn!  In regards to The Tale of Princess Kaguya, the Okanagan Regional Library has it listed under Junior DVD, which definitely this film is not.\n- Also, actors who have dubbed the English versions are always given more status than anyone else.  After working on a film for 8 long years, it's not fair that someone else who spent a weekend in a sound booth gets higher billing than you.  \nThis work of art has taken and will stay in an exalted place amongst Studio Ghibli's vast annals of masterpieces. \nCTT: 5 bamboo shoots out of 5; JDT: 4/5 because she didn't like the freakin' story",
            "review_date": "2016-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe that this movie hasn't won the Oscar. \nDrawing technique, story, dialogues, soundtrack, philosophical reflections, a moral and lesson...this movie has it all. \nThis is an animation that achieves to convey emotions, as delight and sorrow. Not every movie deserves to be called a masterpiece, but even weeks after I'd watched the movie for the first time, I still thought about it and it touched my heart in a very different way. I could relate to the protagonist, and her pain, which is drawn magnificently, seems so real that I can still feel it within myself.",
            "review_date": "2016-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie I have wachted more than 5 times in just a year... It Stirs my spirit and life.. Nostalgic and unique. You should watch it.",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As expected from Studio Ghibli, a beautiful Japanese tale about human character..",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's another Ghibli film that isn't so compatible with those outside Japanese culture, and the ending is strangely tragic; but the journey on the whole is carried by a centuries-endured story and a rapturously complex & unique style of animation which was Isao Takahata's greatest gift.",
            "review_date": "2016-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First, where has this animation been all my life! It's so beautiful! The story was emotional and has a bittersweet ending and I loved each one of the characters. What a treasure!",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really loved the art style of this movie! It was different and quite beautiful. The voice cast was also perfect as it usually is with English dubs of Stuido Ghibli movies. The story itself was a bit odd, but there were certainly parts that made me feel something. Not completely satisfied with the ending, either.",
            "review_date": "2016-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film from Ghibli, poignant and amazingly animated. Really thought provoking experience that transports u into its world",
            "review_date": "2016-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, whimsical, romantic and ultimately sad. Classic Ghibli.",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seeing the high numbers that indicate what a great movie this is truly baffles me. How can such a painstakingly dull and boring movie be loved and critically acclaimed? Every minute was agonizing to watch let alone two hours, which is way too long for an animated film anyway. I'm at a loss for words trying to find a positive aspect to this overrated failure.",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fuck this stupid movie. I wasted two hours of my life on this shit.",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah I was torn whether to give this a 4 or 5 star rating.\nReally the ending, it was so miserable - what a way to end something so pretty! I felt almost offended! Too sad!!\nBUT!\nI must admit, that emotional wrenching aside, it is - just magnificent!\n\nThe art will blow your mind! At times so simple and yet so complex! The story is definitely original and takes unusual and unexpected twists and turns. \n\nThe reluctant princess herself is just a joy to behold! Talk about reminding you to really just enjoy life for what it is, not all decorated and gilded in false tinsel and shine!\n\nAh! I can't wait to rewatch it and go on the whole romp all over again!  ^_^",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done. I found the film was going a bit too slow for my taste and doubled the speed without missing anything. The theme of the prince or princess living amongst ordinary people was done multiple times before, so this story is less original than the other I've seen from this studio. It is different though because it is a japanese rendering. So it is certainly great for kids. I give it 4 stars for kids.",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done. I found the film was going a bit too slow for my taste and doubled the speed without missing anything. The theme of the prince or princess living amongst ordinary people was done multiple times before, so this story is less original than the other I've seen from this studio. It is different though because it is a japanese rendering. So it is certainly great for kids. I give it 4 stars for kids.",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably too long for its own good.  There really is one primary message/point and yet it's frustrating to watch none of the characters get it for so long.  But it's an important point.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant re-telling of a traditional Japanese folktale. With some of the most beautiful animation I've ever seen and oozing with culture and creativity, this is a must-watch for any fan of animation, fairy-tales, or Ghibli films in general. This movie is an absolute treasure.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I am going to need to process the ending for a few days in my mind, overall, I think this was amazing.  It's a bit too long, but it is wonderfully different and amazing to look at.  Not for everyone, but worth watching.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "STANDARD REVIEW: Even though I don't know much about the original folklore tale that this movie was based on, this film is the best non-directed Miyazaki Ghibli film that has ever been made. Although I have only seen three Studio Ghibli films that weren't directed by Miyazaki, this film is surprisingly better than most of his works and also pretty damn tragic when you think about it. This film (At least in my opinion) is better than Laputa, Totoro and Porco Rosso, heck it WOULD even rank up there with the masterpieces of Mononoke and Spirited Away but not better. Yeah, we've seen this type of story before with princesses being rebellious against tradition, who longs for a break out in the country, but the way the story is told and the animation itself help tell the story in such a mystical way that I just got completely lost in this movie's world. I have not felt this way about a film for a LONG time. In fact I cried from this movie and I haven't done that in years (Trust me, years!). Told with such mysticism and attention, The Tale of the Princess Kaguya would've been a timeless classic that I would've enjoyed everytime I see it, no matter my age. Recommended for the whole family, The Tale of the Princess Kaguya is a soon to be classic that will be remembered for a long time.\n\nRANTING TIME: OMFG!! This is the worst ending to a Studio Ghibli film I have ever seen in my life! I will admit that:\n\n\tIt has been a long time since I cried at a movie's ending\n\tIt has been a long time since I was this mystified by a movie's setting/story (This goes back to something like Spirited Away or Princess Mononoke)\n\tIt has been a long time since I have seen such a goddam perfect movie like this\n\nBut this movie has one of the MOST anti-climactic endings of all time! I have never, EVER seen such a perfect movie ruin itself so hard, three minutes before its ending. Everything was absolutely perfect for me, until those last three minutes. Death Note's last 12 episodes are NOTHING compared to the rate of speed that this movie nosedives into shitville. I have never, ever seen a movie go so downhill, so fast, so hard yet still be more affecting than a 12 episode dive into shitville. I have a feeling this is how a lot of Star Trek fans felt, when they had to sit through the last 15 minutes of Into Darkness' ending. I don't usually reference other forms of pop culture here but for this rant, I'm definitely going to need to.\n\n(SPOILERS) All her life, the Princess has never had one spec of happiness in her life. The moment she left for the Capital, she has always been in the wrong place all the time. She's never loved (Sort off), never enjoyed herself in the Capital and never even makes a genuine goodbye to ANYBODY! In the fair few months she lived in the countryside (I think it was months anyways) were the only real genuine moments of happiness she has had in her \"mortal life.\" Compared that too the years of living in the Capital and you can tell that for most part, the Princess had a pretty crappy mortal time. And of course she forgets all that anyway, so it doesn't even matter anymore, which makes it all the MORE heartbreaking. And don't get me wrong tragedy is fine, just make sure that it ends well! The real title of this movie should've been \"The Tragic Tale of the Princess Kaguya.\"\n\nI get the type of ending that this movie was going for (I think). But the problem with that is the scene itself was so anti-climactic that it ruins any emotional buildup that the movie had going for itself. It almost makes the whole film utterly pointless. If you're going to go the \"E.T. go home,\" route, HAVE A \"E.T. right here,\" MOMENT DAMN IT!! The ending literally has her mid speech about the world's beauty and then all of sudden *PUFF MOTHERF*CKER! We don't give a f*ck about what you have to say! Get on the magic carpet B*TCH!* Personally, this film would've been much, MUCH better if they would just let the Princess have her moment and let her spew about how \"The world is a cruel place but also very beautiful,\" speech and persuade the moon people (Or whatever they're called) that she is not sad and that she wants to stay! As corny as that maybe, personally I would've found that a much more fitting/better ending then what we actually got anyways. It would've fit in the context of the stories fairy tale-like structure and kept itself true to what could've been a goddamn masterpiece that ranks up there with Ghibli's best like Spirited Away and Princess Mononoke. Freaking Ponyo had a better ending than this! The good stuff in this film unfortunately just wasn't enough for me to say it compensated those last three minutes (That somehow completely ruined everything?). But I still standby my statement, when I say that this movie is one of Ghibli's best non-Miyazaki directed films, just not one I would re-watch a lot unfortunately.\n\nThe only reason why I cried at this movie was the multitude of emotions going through my brain as I reacted to those last three minutes. To have her just leave like that WITHOUT EVEN SAYING GOODBYE! And forget EVERYTHING she's experienced, itself was so hard to watch. It was just soooo shocking to see such a perfect movie, completely destroy itself in just three minutes and it pains me too because I loved this movie so much for 98.94% of the time and for those last three minutes to exist is just jarring to me. Don't get me wrong, I still liked this movie but, my god (Facepalm). I really wanted to forget those last three minutes and just mindlessly enjoy this film to no end but I just can't, I really REALLY cannot do it, no matter how hard I try :( This rant shouldn't exist and those last three minutes shouldn't exist! (SPOILERS)\n\nI'm done. (*Phew* That's a load of my chest)",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This along with The Wind Rises is one of the more serious Studio Ghibli films. It is not a children's film like Totoro, and adventure like Princess Mononoke, or a fantasia like Spirited Away. It is a deep critique of sexism and tradition and at the same time a celebration of the subtle arts and naturalism of Japanese culture. Hands down the most beautiful animation I have *ever* seen in a feature-length film - bold kawaii aesthetic is replaced by watercolor naturalism.  Beautiful music as well. The Princess's servant girl provides some comic kawaii relief.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film told in a flat, Japanese watercolor painting style.",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Isao Takahata presents his next work in The Tale of Princess Kaguya. A couple in a small village in the woods discover a child born in a stalk of bamboo. They decide to raise her as their own and come to decide she should be a princess. She learns the ways of a princess and how to be proper all the time missing the time she grew up. Kaguya struggles with this and deals with all the ups and downs in life from courtship, regulations and maturity. Kaguya was and feels long, but was a beautifully animated tale.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The hand drawn style of the animation was not that appealing to me, but the story kept me hooked the whole way through.",
            "review_date": "2015-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving and imaginative in its simplicity and rawness, a throwback to an animated era of yesteryear, detailing a legend from even further back. The painted colours and minimalist lines show Takahata's longing to tell an emotive tale of how much he and the moon/bamboo princess long to remain, and why not, for every world and studio needs its artistic art-house films and filmmakers, to carry literary imagination onto the silver screen.",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loved every second of this animation.",
            "review_date": "2015-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too. Long. But that aside, The Tale Of The Princess Kaguya is a beautiful film with a gorgeous art style and a story with real emotional heft to it. It'll leave you dazed and blown away.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautiful, visually distinct film with narrative depth and realistic characters mixing with the element of fantasy, it's a modern animated masterpiece. My one problem is that multiple scenes are pretty slow moving and last a lot longer than what they need to be (in my opinion).",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Studio Ghibli fans will notice several departures from most of the studio's previous work: the art style is far less vivid, relying largely on pale pastels; and despite the editing of the trailers, there is little real adventure in the narrative. That none of the film's impact should be dulled by these changes is a testament to the quality of the studio's work, and could make one question if the only reason Miyazaki is highlighted in coverage of Ghibli is because it's easier to focus one's gratitude on a single figure.\n\nIn the tradition of the best folktales, The Tale of Princess Kaguya celebrates life and strangeness, becoming ever-more magical and bittersweet as it progresses. There is a slight slump in pacing near the middle of the film, but even that is suddenly broken with a breathtaking sequence relying on gesture drawings. Kaguya may not be as consistent as the best of Ghibli's work, but one way or another, it will leave you breathless; some for only a few moments, others for half the movie.",
            "review_date": "2015-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it's run time may be long and it wont appeal to the very young generation of filmgoers, the Tale of the Princess Kaguya boats enough depth in plot, character development and visuals making this one of the best Takahata/Ghibli films to date, as well as one of the most visually stunning movies of the past year.",
            "review_date": "2015-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic and very original animation. I'd say it's not a story for children, at least not one they can understand. The film presents a beautiful story of a girl that is portrayed in a very natural, and sincere way, from her birth to her youth. The last act is unforgettable, along with its amazing music.",
            "review_date": "2015-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never seen something this rich and creative in design and character.",
            "review_date": "2015-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, \"Kaguya Monogatari\" is one of the best titles produced by Studio Ghibli. The folktale is very touching itself, but this film brings a completely different feeling ...\nSymbolic images of Princess Kaguya makes us feel sad, happy, regretful, and serene at the same time, help us to realize the reason we exist. We are all born innocent, but this world set us to certain positions, sometimes you want to escape, but simply cant , because that is the fate of one \"human\". The remaining by your side is just beautiful feelings that you can never forget...\nThe soundtracks of this film, what can I say ? Simply Studio Ghibli, fantastic as ever. The animations are abnormal, but it makes people feel that this film is a \"folktale\", not an Anime movie, and of course, should be considered as another masterpiece of Isao Takahata (I love \"Grave of the Fireflies\" so much ^_^)...",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An aging peasant couple stumble upon a magical child growing in a bamboo shoot and they ultimately raise the baby as their own. Celestial forces then bring the couple a vast fortune and they decide to buy their way into nobility and mold their girl as a proper lady. However, their mysterious charge bristles at the constraints of the gentry and the unwanted advances of highborn suitors; her only solace lies in either her rustic home or her supernatural origins. Directed with patience, grace, and empathy by Isao Takahata, The Tale Of The Princess Kaguya commands audiences with its poetic storytelling and gorgeous animation. This film is yet another gem of Studio Ghibli's impressive catalog.",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Tale of Princess Kaguya [Japan, 2014] Wow. How can something so cute and sweet break my heart into tiny little pieces? 9/10",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best animated movies I have ever seen.  Which makes it one of the best movies I have ever seen.  I don't give 5 stars out lightly.  This is a crowning achievement in movie making.  Beautiful, heartfelt, moving.",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Studio Gibli always destroys my heart with powerful stories as this one (this one based on a famous Japanese folktale which is super strong and makes you think that sometimes parents want the best for you even if what you do is what they really want to do for themselves...how selfish they are right? Some of them, not all but is a storie I hear every day of people and friends who do stuffs for their parents and not coz they wanted that in the first place...selfish no doubt). Anyway, I recommend this movie to all the Gibli fans, gamers, anime fans and of course, the folktale admirers aussi. Enjoy. - July 31, 2015 (last day of this month...how fast!).",
            "review_date": "2015-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The \"running from the palace\" sequence may be one of the most effective mid-film changes in animation style I've ever seen, and it's just one jewel in this crown of dreams and memories. Bravo, Ghibli.",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Timeless folktale, beautifully hand-drawn and every frame is a masterpiece.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie broke my heart. It's a painfully beautiful inherently Japanese work of art. Contemplative and respectful to Japanese tradition and wildlife, poignant, moving and emotionally moving.",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breathtaking beautiful japanese tale about a mythic princess...Misterious and funny with an unexpected twist .Although slow paced, it is engaging, sad and touching.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like watching a painting, so beautiful. Kaguya is a much deeper, and more serious movie than the other Studio Ghibli movies we have seen (those are all Miyazaki's). In our house at least, this wouldn't have been enjoyed by the kids. Perhaps because of the theme. I loved that it was a folktale, and seemingly kept as it should be, rooted in Japanese culture. The clothes, countryside, and city all lend themselves so well to the animation style. It stays true to folktale, like Grimm's or Andersen's which are sad. This isn't a Disney-fied version (I do love Disney though) making it happily ever after. Sadly, I don't think my kids would appreciate it. I found it sad at several moments, but there are beautiful scenes of pure joy. \n\nAnd, in addition to all this, there are scenes of breastfeeding mothers, and naked babies running about. Wonderful!",
            "review_date": "2015-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful and sad, poignantly so.",
            "review_date": "2015-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful addition to the Ghibli canon",
            "review_date": "2015-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most amazing movie, a work of art not just in animation but in story telling",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very beautiful and heart-touching story. Those who appreciate this movie can tell it is a production from the heart. The whole animation was developed in a very classical form of arts. The backdrop of the story was so finely described according to the ancient Japanese cultures & beliefs. The theme of the story is so pure & genuinely simple. Great work as it is so out-standing exceptionally in today's world which craves so much in different kind of effects to tell a story in movies. :-D",
            "review_date": "2015-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing work of animated art. Isao Takahata has already made what I think is the best animated movie I've ever seen, Grave of the Fireflies. The Tale of the Princess Kaguya is now pretty high up there as well. I can't pretend to understand every little bit of the movie, but what an experience it was. Gorgeous, unique animation, made in the style of what I'd call Japanese impressionism (I don't know what officially this style is called). Reportedly it has taken Isao Takahata 8-10 years to complete the movie; like Miyazaki with The Wind Rises, Takahta is obviously at the pinnacle of his craft here. What amazing swan songs for both of them if indeed these are their last movies (along with the legacy of their Studio Ghibli after it releases one final film, I believe). The world of animation will indeed be a diminished one once Takahata and Miyazaki leave us.",
            "review_date": "2015-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story of a special young girl found by a bamboo cutter in the woods. She grows up fast learning to love the beauty of the world, but as she also must mature quickly and face hardships, she struggles to find her true place. charming and unique, The Tale of the Princess Kaguya is one of Studio Ghibli's greatest masterpieces. Its eloquently hand-drawn art brings the film a feel of true beauty and wounder. This instant classic will live on forever",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully told folk tale animated very different to the style Studio Ghibli's normally use for their films but similar to their shorts shown at their museum in Mitaka.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew I'd love it, I just didn't know it would be this much. One of the best from Ghibli. The animation style is absolutely breathtaking. Not much else I can say about the actual movie that has not been said. Moved me to tears by the end, a sad ending but with the way things were playing out, a realistic ending. Touches on some of the hardships women, noble or not, had to go through back then.\nAmazing anime film, one of the best I've seen and truly deserves even more publicity! How Big Hero 6 won the award ahead of it, we will truly never know.",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much love for this! Everything about it is beautiful and this is now one of my favourites.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Insanely good. I cried more times during this movie than I have in the past few years of my life.",
            "review_date": "2015-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long animated film that's telling an old Japanese tale, the tale of Princess Kaguya. The story us touching and weird - in a good way. A fairytale for grown-ups, being depressing and bringing up some sort of moral.\n\nIt's quite easy to catch the massage here, you get the main point after 20 minutes or so. It does not ruin much, but weighing in at 2 hours and 15 minutes it's maybe a bit too long. The story aside, this is fantastic craftmanship! The used visual technique makes this film. It's like a living aquarelle painting. Often painted with weaker tones - backed with smaller amounts of stronger colors. The music is also incredible and very fitting. I watched most of the film with English dubbing. Maybe wise, maybe not. It was clearly easier to hang on to then, and Chloë Grace Moretz was both fitting and impressive when giving her voice.\n\nKaguya was definitely robbed of an Oscar - it beats the mediocre \"Big Hero Six\" by miles when it comes to orignality and execution.\n\nAn impressive and delightful experience. It's solid all over, but it's a bit long and it could have brought me more emotions. Guess I'm not that connected to ancient Japanese culture - even if I dig it.\n\n8 out of 10 kotos.",
            "review_date": "2015-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily stands among the best of Ghibli and - as a result - animation/film in general. I don't think it's Takahata's best film, but it is more than worthy of his talents.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful story that transcends emotionally and spiritually.\n\nI have not watched many Japanese animation films. The only the other I have seen except this one is Spirited Away. But now I really consider watching them looking at the skills of the directors Hayao Miyazaki, Isao Takahata, etc. The tale of Princess Kaguya based on an old Japanese folktale is the story of a mysterious girl(named Kaguya later) who is discovered by a bamboo cutter in a bamboo stalk. He and his wife the raise baby girl as their own.Their house is situated in greenery of remote village in the mountains. Kaguya seems to grow very rapidly and becomes very close friends with gang of children in the neighborhood. Merrily singing and playing they enjoy the nature and Kaguya is having the most joyous time in her life. \n\nHer father though, envisions great things after he finds gold and fine clothes in other bamboo stalks. He thinks heaven wants Kaguya to become a princess and they need to raise her in that way. So off they go to the city and become a noble family with their gold. Kaguya who is initial happy with all the royal treatment soon understands the sorrows and bitterness in life when things are forced onto her. The story slightly loses its steam after the breezy first hour and I feel the run time could have been short by about 20 minutes. It dwells into complex themes of our world full of deceit and sorrow and the perceptions of cycles of life, afterlife hidden under its straight forward narrative. At times things get difficult to understand, still the visuals are so beautiful that you are completely engrossed into the scenery forgetting about the story. The ending which left me dazed was quite emotional and spiritually powerful. Despite some loose ends, the movie is overall well crafted with beautiful hand drawn animation and music. I felt it was emotionally moving and deeply profound. \n\nRATING: [4/5]",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeous. Effortless. Heart-wrenching. An absolute winner. If you love animation, this is a must-see.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply fantastic - one of the best movies of the year. I hope their is a live action version of this.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Tale of the Princess Kaguya\" is an ambitious, engaging, and overall memorable film where its narrative reaches surprising heights while telling its story with heartwarming sensitivity that appeals to the emotions with an honest approach. The animation design is an artistically inventive creation that allows the visuals to highlight its character's perspectives and the gentle pacing. Overall, this film reaches a deep scope within its story in a way that encourages emotional resonance and thoughts from the audience.",
            "review_date": "2015-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If THE TALE OF THE PRINCESS KAGUYA is to be Isao Takahata's last film, at the very least we can say he has ended his career on a graceful note.  That's more than can be said for Hayao Miyazaki's technically beautiful but often meandering swan song THE WIND RISES.  Gorgeously rendered in a rich watercolor pastel style out of an old picture book, this melancholy animated feature, based on a Japanese folklore tale, centers on a bamboo cutter who adopts a girl who turns out to be anything but ordinary.  The girl grows quite rapidly from a precociously adorable child to a young lady, but her simple world is turned upside down when her misguided \"father\" decides that royalty is the life she's destined for.  As is usual per a Ghibli movie, the animation is top-notch and rich with detail, even in its stylized mode, and if the film seems long, the dynamics between the title character and her parents -- arguably the real anchor of the film, even more so than a tragic love subplot of sorts involving a poor farm boy -- are presented in a sincere, emotional way that transcends this film from being just another animation showcase.  Joe Hisaishi's music is also a plus, particularly the koto-flavored folksongs that occasionally pepper the film.  It should be warned, though, that this movie does have a few moments that stretch into \"adult\" territory (a scene where a child drinks from her mother's mammary, as well as a few shots of nude children), but it is inoffensively presented and frankly, hardly a detriment.  The bittersweet final fifteen minutes will also encourage the viewer to have tissues in store.  Not only beautiful to look at, but to watch as well, this \"princess\" is a royal treat.  The dub is, for the most part, very well done, with James Caan and Mary Steenburgen turning in solid performances as the bamboo cutter and his wife, respectively.  Chloë Grace Moretz has a fitting voice for the title character and is mostly good, but sometimes she falls a bit flat during the more emotional moments.  The sparse narration also borders on occasional pandering as well.  The rest of the cast is fine, especially the children in the opening scenes.  There are a couple of places where the dialogue sounds rushed, but otherwise, the script is adapted fairly smoothly.  It's easily livelier and superior to the more lifeless WIND RISES dub.  Still, if you can't stand the dub, there's always the original Japanese track.  Either way, a lovely film.",
            "review_date": "2015-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent artwork ,beautiful story",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I generally hate cartoons, but this was beautiful.",
            "review_date": "2015-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love film craft. I love highly stylized presentations. This should have thrilled me to death. Instead, despite trying to sit thru it 3 times, I've yet to finish it. The pace it too much for me; and I enjoy subtlety. I know I'm an outlier on this one but I can't see this clearly or something.",
            "review_date": "2015-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Profoundly UN-profound!!! That this movie was put in the same category as \"Song of the Sea\" or \"Big Hero 6\" is absolutely flabbergasting...everyone is either cheating on their wife or abandoning their child...and did I Mention Moon people and a Space Baby?!?! This was an absolute and utter waste of my life...to say I'm disappointed is an understatement...",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Hayao Miyazaki, but this is quite possibly one of the most beautiful films Studio Ghibli has ever made.   The Tale of Princess Kaguya draws heavily on the Japanese fairy tale \"The Tale of the Bamboo Cutter\", and does so with rich aplomb.  The style of the film is gorgeous, and unique to boot.  I would encourage people to watch both the subtitled and English version, as both are well done and a joy to behold.",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has a unique sketchy animated style which while not realistic makes it look different than any other animated movie I have seen.  The movie has a slow natural tone to it that's refreshing as it deals with a very human drama.  For those who have the patients for its pacing it can be a joy even if it lacks the emotional weight of Isao Takahata's previous works",
            "review_date": "2015-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Princess Kaguya is the most beautiful girl yet from Studio Ghibli. The sketches and paintings are magnificent.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't break me as it did you Luke. animation and design was breathtaking. it is captivating, but i felt the main themes could have used a bit more overt heavy-handedness to really make this film come together. it doesn't reach the devastation of Grave of the Fireflies or the epic grandeur of Spirited Away for me.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The prettiest movie I've seen in a very long time",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved the graphics storyline\nlittle bamboo. ost.",
            "review_date": "2015-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely beautiful.",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seem like source material",
            "review_date": "2015-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful hand drawn animation and great vocal performances from Moretz, Caan, Steenburgen, Criss, and Liu. The story is fine but with a 2 hour and 17 minute run time I got really tired of it real fast. I think this could have been the one to be taken out of the Animated race for The Lego Movie to go back in but I have not seen Song of the Sea yet. It also has a nice score",
            "review_date": "2015-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie starts out slow, but really quickly sucks you in. The art is beautiful and the story rich and bittersweet.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful animation and storyline, this film kind of reminded me of the Last Emperor.  I'd rather watch it with subtitles and without the English overdub.  It was a tad too long as well.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tale of Princess Kaguya is quite an extraordinary achievement. The hand-drawn animation is enchanting - especially the running sequences, which show what a true master can create with only a few lines! - and the imagery superb. If at times a tiny slow it's still a must see!",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful art romance bandaged by good and strong persuasive tale. Kudos for this Japan animation !",
            "review_date": "2015-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful animation and story - bit speechless. Wasn't expecting it to be so moving!",
            "review_date": "2015-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It does not take a hardcore animation fan to discern that \"The Tale of The Princess Kaguya\" is a good film. The sketchbook visual look, (a rarity for Studio Ghibli, only done in their 1999 \"My Neighbors the Yamadas,\") the strong vocals of Chloe Moretz and Lucy Liu, and the overall classic 'Old Japan' feel of the whole piece is well done. Perhaps the single most breathtaking (and talked about) animated sequence in recent HISTORY is cradled in the second-half of this film, the scene where our princess protagonist blasts through a series of doors like a human rocket in a fit of intense rage, accompanied by abstract shapes, and hastily-sketched charcoal-inspired outlines. The wonder and excitement in this scene is hard to describe, and the only way to do so is calling it \"an artist's sketchbook come to life.\" This brief, fantastically drawn sequence is outstanding and is worth more than all the photorealistic CGI Hollywood has to dish up. However, with that said, Princess Kaguya shows that, as I feared with \"Poppy Hill\" and \"Arrietty,\" Studio Ghibli is becoming far too conservative for their own good. True, there is joy, sadness, and true emotions in \"Kaguya,\" but not in heaping platefulls like past efforts like \"Spirited Away,\" \"Porco Rosso,\" or \"My Neighbor Totoro,\"to name a few. Heck, Isao Takahata's 1994 \"Pom Poco,\" (his least famous film,) contains more visual excitement and originality in its first 20 minutes than this entire film. We as audiences get the miraculous birth of Kaguya almost in the first scene of the 2 hour-long-anime, but there is nothing really miraculous till the last moments when *** spoiler*** the moon people bring Kaguya back to her rightful home with a cloud of joyous, melodious entities. I wanted to see more life, more wonder, more legendary \"wow\" moments so typical in ancient folklore. I felt hungry for more. Still, \"Princess Kaguya\" was a fine film, and a bittersweet goodbye to legendary Ghibli co-founder Takahata. This is Studio Ghibli's second to last film and for that fact alone, it must be cherished and protected till the end of time.",
            "review_date": "2015-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully made by the end of it u will shed a tear",
            "review_date": "2015-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For those of you that think original, hand-drawn animated stories of quality are a distant possibility, Studio Ghibli will amaze you otherwise.",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is considered a classic in my book",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this one, beautiful animation in the style of Japanese water colours and a wonderful story.  It's directed  by Master director Isao Takahata who co-founded Studio Ghibli with Hayao Miyazaki.  It's long for an animated film at 2hr15mins, but well worth it and deserving of its Oscar nomination.  Give it a try!",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully animated and a compelling story, although the ending is perhaps slightly unsatisfactory.\nThe main characters were drawn so aptly, with the supporting cast fittingly relegated to broad brush strokes and ill-defined features.\nParticularly liked the high-speed loosely drawn escape from the banquet sequence.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "B+(89%) movie. Blue-ray Disc.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tears were shed, even though I didn't fully understand what it is was that made it so sad. Will have to watch again, very special.",
            "review_date": "2015-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is pure ART. Too bad society can't recognize art when they see it. Not to mention, the academy who didn't even see it! If you're more used to american animation like Disney, this movie is too sophisticated for you.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning and lovely-in both animation and story-in every sense of the term-The Tale of the Princess Kaguya is honest, energetic, and brimming with life. There is no way to say that this Studio Ghibli's masterpiece's idiosyncrasy is not unambiguous, for there is nothing like it. This movie is reminiscent of coming-of-age, and as one never is the same following their childhood, thus is the effect of this movie.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without doubt the most beautiful animation I've ever seen. The soundtrack and sound effects are stunning. Just perfect.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully animated and fascinating symbolic story based on the old Japanese folk tale.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "visually stunning and quite moving",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's exquisite to look at and has a real range and depth of emotions. I took the kids to see the undubbed version with subtitles - possibly a mistake. It's a bit too long though.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film gives us hope that even after Miyazaki's retirement, the animation industry in Japan (and Studio Ghibli specifically) will make timeless classics- and this is a sterling example. Unique animation based on a popular folktale, this leaves a  lasting impression  long after the film is over. Immaculate!",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing! It is like watching a watercolour painting telling a story of life.  It makes you happy and sad at the same time. For all ages",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ranked up there as one of my best Ghibli films,loved it",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is like a beautifully crafted childrens book. It is so simple but beautiful and story unfolds like a good fairytale however the third act gets a bit odd (Buddha shows up and comes across as a bit mean) and it felt like it lost it narrative edge by going down this route instead of having a more accessible ending but still enjoyable up until this point.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A studio Gibihli film and a real winner. Based on Japenese folklore this is about a small baby discovered in the woods who grows up to be Princess Kaguya. \nEvery scene is like a painting. The end is sad but its an enjoyable ride. See it",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very engaging tale. The animation may be simple but it is truly beautiful.",
            "review_date": "2015-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Magical and beautifully drawn and made.",
            "review_date": "2015-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful animation. Cute, whimsical story.\n\nI think I honestly prefer this unique sketch-style animation to the usual anime I'm accustomed to (admittedly, I haven't seen too many). Without losing much detail or emotive ability, the animators employ a noticeably dressed down technique that shows off the hand-drawn line in its simplicity and beauty.\n\nThe story is cute and touching, with lots of intriguing glimpses of Japanese myth and culture. Unfortunately, the film's second act really drags. It's not that there isn't interesting stuff going on here. There's simply a very deliberate hand guiding the story that prefers to very gradually depict the passing of time (ironic considering the title character's growth process is magically truncated within the narrative). Honestly, I dozed off numerous times and kept having to rewind the BluRay. This yarn most certainly could be weaved without crossing the two hour mark.\n\nAll in all, like many traditionally animated films in recent years, I'd recommend The Tale of Princess Kaguya on the merit of its beautiful animation style alone. While the story is emotionally captivating in many ways, it tends to plod along in its second act. But admittedly, this animation deserves to be seen and marveled at from beginning to end.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is truly the best animation movie of 2014 \n\nThe tale of the Princess Kaguya brings in the japanese tale about princess kaguya and her journey to find the meaning of happiness.\n\nSince this is Ghibli studio movie , it's for sure still amazing looking movie but even more stunning with it's japanese painting style , and even that the movement of characters in the movie is still really good and some scene which character moving really fast it's just so amazing and so beautiful to watch.\n\nWith that and Isao Takahata great storytelling just make this movie a really top list of animation movies.\n\nOne thing that really make a lot of people angry is the ending of this movie which is not a surprise consider Isao Takahata famous movie like Grave of the Fireflies but honestly i personally really like the ending because it's just fit to the theme of this movie so much.\n\nand that theme is talking about finding the \"happiness\" but in the reality world it's not that easy and sometimes you just can't change everything especially the terrible fate that waiting for you and that what's The tale of the princess kaguya talks about.\n\nIn the end this movie is truly the best animation movie of 2014 without any doubt in my mind , and maybe even the best movie of studio Ghibli.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as Spirited Away (nothing is as good as Spirited Away) but still a delicate and beautiful tapestry of tender and caring animation. Wonderful.",
            "review_date": "2015-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there are lot of details taken care of indepth in this film by the director, audience just will get immersed with the characters in movie and will wake from a strong dream in the middle which they will enjoy while watching...",
            "review_date": "2015-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really really should and must win an oscar!",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film and the animation was so beautiful to look at as well. The ending was bittersweet and sad but very hopeful. It had some funny moments too.",
            "review_date": "2015-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation I guess was \"refreshing\" but that takes five minutes to appreciate. But it's kind of long...and boring.",
            "review_date": "2015-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With its gorgeous visuals and investing main character, The Tale Of The Princess Kaguya is a heartbreaking and deep tale about the gift that is life, and will go down in history as one of Studio Ghibli and Isao Takahata's greatest works.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Parents should let their children live the life they want. Otherwise they will be left alone... Takahata, we love you!",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunningly beautiful.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simple, melancholy and superb!",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely does a film make me gasp in sheer terror of a moment. And rarely does a film profoundly ends on such a depressing note. For me even though it may be a depressing subject, it's important none the less. Do what you want, be with the people that make you happy and have a life of love. What a phenomenal masterpiece!",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty great movie. Very entertaining. A bit too long, but still very good. It is happy, sad, and everything in between. The voice acting is good, and the animation is beautiful.",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, it is indeed based on the folktale but the story is like a social critic. Anyway, its hand-drawn masterwork is really, really superb!! \\o/",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie brought me to tears. Even after watching it I still find myself thinking about it. It's magnificent and beautiful. My wish for this movie is for it to be remembered several years from now and to live on as a piece of art. It's a modern art masterpiece weither we all know it now or not. That's the beauty of Princess Kaguya",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually, this movie is beautiful. I'm always so refreshed to see hand-drawn animation, and this is some of the best I've seen in a long time. As for the story, I was less impressed, but if you're a fan of Studio Ghibli's other films, you will likely enjoy this one as well.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's emotional, it's beautiful, and it's one of Studio Ghibli's absolute best. The Tale of Princess Kaguya is on of the most beautiful films i have ever seen, in visual and and story.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is absolutely exquisitely drawn.  There is no CG here and it is a joy to watch.  The famous Japanese folklore tale is great to watch and you cannot help but be enthralled by all the characters.  Superb.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With absolutely stunning animation, well developed characters, well crafted story and emotionally powerful ending, The Tale of the Princess Kaguya certainly doesn't disappoint and it is one of the finest animated films of the year. It is sometimes slow and uneven, but it is such a wonderfully animated film with authentic and rarely seen watercolor look which seems both original and artistic plus the score is terrific, the ending is imbued with strong emotion, the story is involving and the whole film is executed with such grace, wonder and simple beauty that it is hard not to get in love with it. It is not one of the best Studio Ghibli films, but it is definitely one of their finest recently and it's a movie every true animation fan should watch and enjoy the admirable artistry and expected quality this entry adds to Ghibli's impressive pantheon of awesome pictures.",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this with my 9 year old granddaughter and we both loved every moment.",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this one was good in general, but, I didn't seem to enjoy it as much as some of the other ones in the past as the story was a little strange to follow.",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i likeded it so i bought the dvded it it!",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm Japanese who only knew the simplified version of the story for kids.\n\nThis movie hinted the Princess's sin and punishment. \nSo it was new to know why the Princess came to Earth and went back to Moon.\nIt may be difficult for non-Japanese to understand the main theme Takahata wants to convey, so I will explain.\n(Most foreign critics seem to have no idea on the main theme which is not really about feminism or coming-of-age or rebel-of-tradition or simple life in nature etc.)\n\n****Spoiler Alert****\nPrincess was from Moon(heaven), where she desired for life which is inferior to heaven. So Princess was sent to Earth for punishment until she admits that she doesn't want to live (on earth).\n* Since the classic ver. doesn't reveal what her sin was so there are other interpretations.\n\nMoon = After Life/Heaven/Clean place with no desire thus no sufferings/emotions.\n(Nirvana is one level up from Heaven btw..)\n\nEarth = Life/Reincarnation/Dirty place with desires thus so many sufferings and emotions (but thus also a place of joy, love, hope to human). All things are transitory. \n\n* it seems that in Buddhism the life is suffering so people train themselves on Earth to get to heaven then ultimately to Nirvana .\n\nAs for the animation, I like 2D with deep story so much better than 3D with kid story.\nAnd this picturesque fits the era of the story and it would be nice to hang one scene on the wall as it will look like an art work.\n\nMoon tried everything it could to have Princess experience sufferings in life and always took her away from what she wished for such as life in mountains with friends and a relationship with Sutemaru.\n\nWhen she was hugged by the Emperor, she on the spur of the moment wished not to be here. \nAnd this was the point when Moon decided the punishment is over and it's time for Princess to return to Heaven. (But she loves the earthly things incl her parents thus doesn't go back)\n\nI got crept out and awed by the cheerful and beautiful music, when the people from Moon came for the Princess, which has no sense of sufferings/griefs but is so cruel to grieving Princess and desperate/grieving people who loved her.\nApparently, heaven has no idea what the grief feels like.\n\nThe life doesn't go how you want but still is beautiful and worthwhile.\nWhen death comes for you, it's too late to regret for not having lived the life .",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 hours and 12 minutes of glorious Japanese animation. It's a damn shame not enough people in the U.S.A saw this. The Princess is utterly adorable. Don't even attempt to resist her.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best motion picture i have ever seen its very sad and very touching",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully animated epic film that tackles a number of relevant themes about life.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful movie. Stunning visuals and haunting music. How ordinary this makes titles such as Big Hero Six!",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wonder how Japanese kids grow up when even their fairy tales don't have happy endings...",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expect it to be weird but this is some other level weird.",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully made and beautifully done. The Tale of The Princess Kaguya is as beautiful as its characters.",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a treat this movie is! It might be cliche, but to say that they don't make animation like this anymore is a very true statement. It is unfortunate that they don't make it like this anymore, because this film is artistically beautiful - it is like a handrawn picture come to life, in the very best sense. Besides that, it is also a wonderful story about a young woman with an unusual beginning trying to find her way in the world, pulled between the love of her parents and trying to please them and also finding her own happiness, it is heart-wrenching and wonderfully told tale that hooked me from beginning to end and made fall in love with 'Little Bamboo' and her story. It is too bad this missed out on winning the Oscar for Best Animated Feature, because I think it truly deserved it, for it's traditional animated look to its well-told story, it is a worthy addition to the Studio Ghibli pantheon. Don't cheat yourself out of a beautiful film - go and see it!",
            "review_date": "2015-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my new favorite Ghibli movie. Both the art and story were so beautiful.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. If any other of the animated nominees wins, it will be a travesty.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "yo this movie is sad as fuck.... BUT SOO PRETTYYYYY",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most beautifully animated movie I have ever seen. The Tale of the Princess Kaguya raises the bar for animation and will no doubt cement itself as a timeless classic in the years to come.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is beautiful and the story is compelling and heartfelt.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing hand drawn masterpiece",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A girl who is not of this world is raised by an elderly couple in this beautiful, glacially presented gem from animator Isao Takahata, the 78-year-old co-founder of Studio Ghibli, with animator Hayao Miyazaki. This telling of a 10th century Japanese folktale is an ideal story of Takahata to present his sweet melancholy for the passage of time and his palpable love for the pastoral. His abstract, rough, but exquisite style--it's not hard to spot the pencil lines and blots of watercolors--are evocative of a most magnificent fairy tale being told on the most delicate of papyrus paper. It's a Best Animated Feature Oscar nominee and a new triumph for the great Studio Ghibli.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful epic from a director I was unfamiliar with up until now. Isao Takahata's retelling of a Japanese folktale, which I was also unaware of, is beautiful and moving in tone and sweeping in scale. From the absolutely gorgeous and unique animation, which feels like something out of a storybook, to the script, which makes you completely care about these fantastical characters, everything works really well in The Tale of Princess Kaguya. \n\nFrom the beginning of the film to the end, I was wrapped up in the story of this young princess. I felt the same wonder she did as we explored this magical world together, and by the end of the film, I was moved by the emotional arc she went on. It's an amazing thing for a director to make an audience care about an animated, fairy princess, but Takahata makes Kaguya feel real and sympathetic.\n\nAlthough it's perfectly appropriate for children, I'm not sure that's the intended audience of this film. The emotional complexity of the characters feels like something that would be missed by young children. I also think the deliberate pacing of the film would bore their short attention spans. This feels like a film for parents. A film for people who want to relive the wonder and innocence of childhood.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't get better than this",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not only the greatest movie I've ever seen, this is the greatest anything I've ever seen. To see this movie is to understand animation in modern cinema.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A georgeous film. Between this and Grave of the Fireflies, I think I actually prefer Takahata's films to those of that other Studio Ghibli luminary Miyazaki.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely beautiful to look at, and a lovely fable for the most part, but I felt it could have been shorter and also could have been an even more poignant fable with a little more emotional impact with a few tweaks to the story, but, I guess that's how the famous Japanese folktale was told. Still great and worth seeing.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully animated film about a girl experiencing the various emotions being human has to offer during her short amount of time on Earth. The score and animation is calming, which reflects how slow the story moves forward.\n*English Dub*",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Complex and beautiful.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually beautiful with a story that hits you hard this movie is a soon to be animated classic. It has earned a very worthy oscar nomination.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Tale of the Princess Kaguya\" is a lovely story about a found princess that grows quickly, deals with life's hardships, downfalls, and the realistically drawn imagery really makes you buy into this story. Well-written, brilliantly-animated (as always by Studio Ghibli), it is definitely worth it's Academy Awards recognition. It may not be the best film to come from this studio, but ever since the mastermind of the studio passed, it will be a challenge to live up to. I really enjoyed watching this film, and by the end I was actually tearing up, because the maturity level of the characters and symbolism that was being shown, really stood out. \"The Tale of the Princess Kaguya\" is the definition of an achievement in my opinion and deserves to be seen by many around the world. This is a very original film, however, it is a tad overlong and slowly paced out, making for a less pleasant experience. It felt like it was trying to take it's beautiful story and stretch it to become a Blockbuster film, which felt very out of left field for the studio. In the end, this is a really good film.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie's breathtaking animation and likable characters make up for it's generic plot. While not only of Studio Ghibli's best, it's still one of the most refreshing animated films I've seen in a long time.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply beautiful story",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice animation but the pacing was very slow and I started to dose off a few times in the second half.",
            "review_date": "2015-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That the title of the original folktale places its importance on the bamboo cutter is symptomatic of those ungrateful times for women like our tragic heroine, and this is a gorgeous-looking, sad story whose only flaw is a frustrating suggestion that its most beautiful scene could be a dream.",
            "review_date": "2015-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story was so beautiful and sad.  A MUST SEE!!!",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 star\nThis could be a highly biased rating. Everything Studio Ghibli does, I love. Except!!! \"Grave of the Fireflies\" That is the saddest movie I have ever seen in my life. \nThis is their newest release. Decades in the making. Hand drawn,  Water colored, beauty. Japan's most famous folkstory brought to life. \nJust FYI, it's equally happy and sad. I cried, at the end.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Tale of Princess Kaguya is yet another unforgettable installment by Studio Ghibli, and it is one done with mesmerizing beauty. Directed by Isao Takahata, one of the co-founders of Studio Ghibli, The Tale of Princess Kaguya is a tribute to the very roots of animation, since the animation is hand-drawn (or simulates hand-drawn animationâ?¦I donâ??t really know). It looks like moving pictures taken directly from a childrenâ??s book, which was a delight to watch, especially accompanied by Joe Hisaishiâ??s beautiful score.\n\nThe film follows the story of Princess Kaguya, who was brought to the world through a bamboo shoot and stunned everyone with her beauty, which in the long term ended up depriving her from happiness thanks to his fatherâ??s assumption that happiness encompassed having a mansion, lots of money, and a suitable husband that would treat her like a jewel (or in other words, like an object). It is surprising and encouraging that the film is based on an old Japanese folktale and the screenwriters turned the tale into a coming-of-age timeless story about the relativity of happiness, the objectification of women, and the undeniable pointlessness of material objects. Princess Kaguya is a symbol of humbleness, feminism, and freedom. However, the film is also filled with bitterness since the Princess could never have the things she stood up for, especially freedom; she was trapped in the maze of tradition by being born at the wrong time. The film also depicts the temporality of our stay in this world and succeeds in showing how joyous is to see someone come into the world and how sad and devastating is to see someone go,\n\nThe film raises the following questions: Are all of these materialistic and ultimately pointless things only intended for people who are beautiful? Are the components of happiness homogeneous or heterogeneous? Are we supposed to stick to the image our parentsâ?? have always imagined for us? When is the right time for the daughter or son to fight for the happiness they know is compatible with their personality? The Tale of Princess Kaguya is one of those animated films you will not forget soon because it not only appeals to the eyes with its visual beauty, it appeals to _______ (whichever part of the body this applies to) with its deep and emotional plot.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Isao Takahata brings us a visually-entertaining film with a powerful and emotional story.",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was very different than what I was expecting. All in all, I liked it but not something that I would watch a lot",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This made me cry so bad. Beautiful story that's really about growing up more than anything else. Wonderfully rounded characters, beautifully animated.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, pastoral, lyrical and full of folk culture...a gem of animation!",
            "review_date": "2015-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving and melancholy film with beautiful minimalist brush-stroke animation.",
            "review_date": "2015-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterpiece. Studio Ghibli never disappoints. I can't express how I felt in words.",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best animated films I have seen in a long time, stunning watercolor animation and from Studio Ghibli. The Tale of Princess Kaguya is wonderfully animated film I can watch over and over again. While the plot is unpredictable for me and may seem long to audiences; it's a breathtaking animated film wiht never before seen animation that makes it a beautiful film and enjoyable for a long time.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this at a local indie theater by chance, was completely enamored by it. If you can't get passed the animation, that's your problem",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great princess story with unexpected ending with lots of twists.",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chronicle is a legend full of fanciful flourishes that myths are known to have. Princess Kaguya is a mysterious protagonist compete with a secret back-story like the heroine of any good yarn. However she isn't a particularly warm person. When her childhood friend Sutemaru is beaten in front of her, she does nothing to help him.  She gives would-be suitors false hope by demanding they fetch items to court her favor. The kicker is she has no interest in any of these men to begin with, so she requests items that are impossible to get. One even dies in the process. At least Kaguya gets depressed about it. At first she seems to praise the simple value of her previous country life over her more exalted existence in the big city, but then the celestial ending kind of throws that idea out the window. Fairy tales always have a moral and I'm sure this one is no exception. I just have no idea what that is given the bizarre finale. I still enjoyed The Tale of The Princess Kaguya. It's different and that's saying something in today's cookie cutter world.\n\nfastfilmreviews.com",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is the first time that a feature length film brought tears to my eyes in this year. Artistry at a different height - all done with sketches using water color and pencil.It is stunning to see how someone can stitch together enough sketches to tell an epic fantasy story in the true sense with extraordinary emotional and visual presence. The picture tells a heart-breaking story having deep threads of thematic material throughout the movie. It is a story without any stereotypes. It is lyrical , poetic , musical and a wonderful way to say that no amount of computers can beat a pencil. From a story point of view , this is basically an epic take on the life of a princess. It touches the very simple yet powerful thematic lines while masterfully tackling complex themes that are both timeless and has a huge contemporary applicability. This story does not require any villain or anything. It's beautiful right from the first sketch. It starts with a very classic fairy tale concept and then takes on  a heavy turn without losing any poise.  It also hit the archetypes of fantasy which is essentially crucial for the plot but then also takes a totally different way and the final act of the movie is as heartbreaking and bittersweet as it can get . Finishing this amazing piece of art is a beautiful song One can recollect the whole picture even if one cannot understand the language.This is telling those simple stories in an extraordinary way . Hands down this is a picture that will hold dear to most. Thank you Mr.Takahata",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching someone grow up is such a good change in pace than what you see in Hollywood today. The animation is great with storytelling that reflects what people go through in certain ages made the characters really relatable to everyone.",
            "review_date": "2015-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first 5 star rating to any movie ever. This is simply too perfect to deserve any less. Paku-san certainly outdoes everything else.",
            "review_date": "2015-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice, simple and traditional animation, but the story is never going to hit you like Spirited Away, Grave of the Fireflies or other Ghibli classics.",
            "review_date": "2015-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very sad statement on how real our world can be, ironically done through beautiful animation.",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So beautiful. My pick for best animated film of 2014 and possibly the decade so far.",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Magnificent!. made just as if we were looking the very scroll the folk tale has been created in the 10'th century in watercolors, The Tale of Princess Kaguya is breath taking and an amazing work of  Isao Takahata.",
            "review_date": "2015-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inherently Japanese experience, from the stunning music to the delicate design. A near-magical and transcendent experience.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The animation is that of a storybook dream, very vivid and beautiful. The film is slow moving, but the story of a magical young girl's life on earth is engaging. The ending is sad and bittersweet, but it is one of those Japanese folklore that stays with you after the films ends.\n\nGrade: A",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I missed 30 minutes of this movie, it was still great. It is nice to see hand drawn animation as it is rarely shown nowadays. It has an incredible, emotional story about life and expectations. It also talks about how we can take some things for granted in life. It is a must-see, especially in Japanese so that you can appreciate the art.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what does the art matter with a weird ending like that?",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simplistic perfection.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Tale of the Princess Kaguya is a beautifully hand-drawn fable, one that boasts narrative depth and visual beauty. Our little tragic hero is born out of a bamboo, and then turned into a Princess, something she does not enjoy. The film is about living, living life to the fullest extent, restrained by nothing. A life is nothing without the joys of actually living it. The animation style is reminiscent of old Japanese paintings, and it is gorgeous. This is a jewel within family entertainment, a movie not to be missed.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exquisitely animated and poignant. The themes of the richly woven \"Tale of the Princess Kaguya\" are both modern and timeless.",
            "review_date": "2015-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A watercolor painting made into a movie, soulful, painful, joyful, alive.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a beautiful film.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A vaguely interesting but incredibly flawed film. Questionable story choices throughout.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it seems that studio Ghibli also make rubbish films too. This lacks the creativity of the typical SG output and it's long and slow, not very well animated (in this age of technology). It sent me to sleep.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A True piece of art, animation, creation and storytelling at it's best. I used to yearn for the days when animation can retrieve the magic it had on me when I was kid. Watching this as an adult, not only did I remember my childhood, but I became a child at heart. The story walks the line between being a fairytale and being something very very personal, And it does that very well. As for the animation, it surpasses in my eyes some of the most expensive productions of the year. This is a most recommended film that captures the beauty of childhood and keeps one very attached to it even years after he has left it.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "while it was refreshing to see a real animation-animation with muted colours and not-flashy graphics, the story got a little convoluted and messed up and I wondered how kids would react to the princess saying she would have to kill herself, among other things. not sure of the target audience!",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A triumph in Japanese folklore. Breathtaking animation with depth in storytelling. The Tale of the Princess Kaguya is a mixture of joy and  melancholy of a bittersweet coming of age story.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        }
    ]
}