{
    "rating": 1.3,
    "release_date": "2014-11-21",
    "num_reviews": 334,
    "genres": [
        "Horror"
    ],
    "summary": "A police chase through the streets of Los Angeles inspires dozens of fame-obsessed teens to try to capture the salacious footage, but they are unaware that they will face their own deaths as stars of the next video sensation.",
    "reviews": [
        {
            "content": "The first short story was just straight up mega ass, and the rest were meh. Doesn't hold a candle anywhere near to the two previous V/H/S movies.",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "Iu u khmg6g6h6b   II  ijb6ybv76tc6tc7iyghuhgiobkj9jbiub",
            "review_date": "2022-10-20",
            "source": "rt"
        },
        {
            "content": "V/H/S/3 (Viral) is a significant downgrade of the previous 2 movies as the segments get increasingly dumb and less frightening.",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "V/H/S Viral creates some of the series scariest short films, all contained within a well-made, masterfully produced anthology focusing on 'fame' and 'fortune'. More specifically, Viral popularity. Connected together by a truly terrifying 'filler' story.",
            "review_date": "2022-06-30",
            "source": "rt"
        },
        {
            "content": "First skit was good, then it fell apart…",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "If you thought the first two were thin on explanations, this one is the king of the series. What an incoherent, random series of films that are neither disturbing nor scary. It felt like someone’s weekday hobby filming these and putting them together for a few thrills. It didn’t work. It was bad. Unfortunately this series has lots it’s way",
            "review_date": "2022-04-03",
            "source": "rt"
        },
        {
            "content": "V/H/S: Viral has a couple of memorable moments and it is still fun to watch, but this is by far the weakest entry in the franchise with the worst selection of stories yet. You'd think that a film that had Nacho Vigalondo as well as Justin Benson and Aaron Moorhead in the directorial chairs would be better, but you'd be wrong unfortunately as it's all quite mediocre.",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "The machine part was the best!! Overall the movie is a step down...",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "This contained nothing that made the first two films so good, besides the gore. This is a woefully directed and terribly written follow up to 2 great films.  Grade: D-",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "None of the ideas was good for a short, for sure, this is one of the most awful movie that's i ever saw about foundfootage.\nWatching this, makes me think that was offered a low budget for some teenegers to film this.",
            "review_date": "2020-09-09",
            "source": "rt"
        },
        {
            "content": "While the first two seemed to have a cohesive story line in between the shorts, even seeming to be connected with each other.\n V/H/S: Viral not only drops the cohesion out the window, replacing it with an impossible to understand barely kept together string of events that hold no relevance to each other. But also goes so far as to even drop the found footage style of filming. The only thing related to the other V/H/S movies is the title, other than that, this mess should be kept from being related to the first two.",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "It was horrible. If I could unsee it, I would.",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "The worst one in V/H/S trilogy, don't waste your time.",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "Surreal, highly imaginative and high-energy, this one is way more fun than the first two films, which are good but forgettable (and I've seen all three films at least twice). Fans of bizarre cinema should see VHS Viral. If you prefer Halloween III over the rest of that series, this film might be your thing. If you go see movies based on people having very strong reactions against it and saying it's blasphemous like 'Mother', 'Midsommar' or 'Re-animator', check out VHS Viral. It's totally insane and I can tell that a lot of the 'bad reviews' are by people who are deeply offended by parts of ths film; some admit it, some don't, some just expected something different, but bottom-line, this film is bonkers and a lot of fun if you don't go in with expectations of average horror.",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "Do you like bad acting, Cliches, bad plots, and tampon jokes? You will certainly like this movie?",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "a horrible end to a good horror franchise",
            "review_date": "2019-06-28",
            "source": "rt"
        },
        {
            "content": "Even worse than V/H/S 2. The only memorable story was about the magician.",
            "review_date": "2019-03-27",
            "source": "rt"
        },
        {
            "content": "Following on from my stle of review from previous entry, V/H/S/2, I'll just bne giving my quick thoughts segment by segment, rather than the whole thing (star rating is still for Viral overall though).\n\nVicious Circles: Of the various framing devices found across the V/H/S franchise, \"Vicious Circles\" is the best/makes the most sense, but it wasn't great or anything.\n\nDante the Great: The most fun of the entries across the whole series. It does stand out in a bad way a little bit, firstly because it's a combination of fake \"found footage\" and fake \"documentary\" which... Like it's weird to have sat through all these shorts and then suddenly have a guy giving an interview to a camera crew, and secondly because I think calling it horror is a stretch. More of a... Fantasy-action-comedy with some heavy gore right at the end.\n\nParallel Monsters: Has the same problems as the previous film's \"Safe Haven\" entry, but fewer pros to counterbalance it. Could probably be explored in a full length movie to better effect, but even that I'm unsure about.\n\nBonestorm: The silliest and worst acted of the entire franchise, which truly is saying something. Would probably make more sense as something outside of a V/H/S film, say... playing silently on a loop on a TV in a skateboard shop, for instance.\n\nGorgeous Vortex: The \"hidden\" V/H/S: Viral entry is an odd one. The only thing it has going for it is also the dumbest thing about it. It's a 15 minute movie that is entirely aesthetic in value, the first and only entry with good video quality. But this is supposed to be a collection of crappily filmed, glitchy footage, copied over to VHS tapes - so in what universe does it make sense?",
            "review_date": "2019-03-14",
            "source": "rt"
        },
        {
            "content": "V/H/S Viral, makes the third enstallment very boring that is far from effective.",
            "review_date": "2018-12-22",
            "source": "rt"
        },
        {
            "content": "Wow... if you loved the first two films... skip this one. This was probably the worst film ive seen all of October. It was trying to send a message about how everyone now a days is trying to \"go viral\" become a YouTube star... but oh man somewhere along the way the message was lost and the film became infuriating.",
            "review_date": "2018-10-09",
            "source": "rt"
        },
        {
            "content": "This movie is like a virus video.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "One of the worst things I've ever seen.",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Jeez, man, this isn't perfect but it deserves better than 38% critical and 14% audience...",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "Short stories which were quite interesting and scary.  Not bad",
            "review_date": "2017-10-23",
            "source": "rt"
        },
        {
            "content": "The VHS reality paranormal series finally loses its momentum, descending into Internet gore mockumentary culture, which by now is a cliche. The short films this time around are as ridiculous as what the average YouTube shock artist works so hard to put out there and take up hard drive space.",
            "review_date": "2017-10-22",
            "source": "rt"
        },
        {
            "content": "Absolutely horrible. Made no sense and was just plain bad. NOTHING like the first two.",
            "review_date": "2017-07-26",
            "source": "rt"
        },
        {
            "content": "Do not watch this. It's too evil and too vulgar. STAY AWAY.",
            "review_date": "2017-05-30",
            "source": "rt"
        },
        {
            "content": "A good solid movie. Good short films, good directing. Not quite as good as the 1st too, but still pretty good.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "The stories are pretty good here.  I wasn't a fan of the main wraparound, but the rest was good.  I love this franchise!",
            "review_date": "2017-04-27",
            "source": "rt"
        },
        {
            "content": "This movie is very bad.",
            "review_date": "2017-04-15",
            "source": "rt"
        },
        {
            "content": "1. Vicious Circles - stupid and over the top\n2. Dante the Great - the worst in this one, again, stupid and over the top\n3. Parallel Monsters - decent\n4. Bonestorm - decent",
            "review_date": "2017-04-07",
            "source": "rt"
        },
        {
            "content": "Not the best but not the worst. At least half of it was good.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "Man did this series really got worse and worse never getting much better than the original VHS (2012). VHS Viral is the third film in the VHS series which are a series of short horror films connected by some sort of a story. This one like the others uses found footage and its \"main story\" centers around a guy named Kevin (Patrick Lawrie) who is filming a police chase that's going around town, but in the process his girlfriend Iris (Emilia Area Zoryan) is kidnapped by a stolen ambulance. The ambulance drives around town messing with peoples cell phones and causing them to become violent. The short stories are Dante the Great about a magician who finds a magical cape that gives him powers, Parallel Monsters which is about a man who creates a portal into another dimension where he meets himself and lastly Bonestorm which is about a bunch of skateboarders who run into a cult. So here's my thoughts on it all. The main story (called Vicious Circles btw) is easily the worst connecting story out of all three VHS films. It's all over the place I never cared about Iris and Kevin is super annoying. Nothing is creepy about the over the top violent parts and It didn't connect the short stories as well as the previous movies did with their connecting anthologies. Dante the Great isn't bad, but isn't exactly that scary. It has one creepy scene. Parallel Monsters is almost too long and drawn out although I did enough the \"twist.\" Bonestorm was probably my favorite, but it was still really all over, but had the most enoyable characters out of the three short films. Overall, this is a solid skip. Unless you've seen the last two VHS films and really want to finish this thing out it isn't worth your time!",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "2.5/5.  While Viral is entertaining, it's not great, and I can't exactly recommend it.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "WORST OF THE SERIES BY FAR!!",
            "review_date": "2016-12-15",
            "source": "rt"
        },
        {
            "content": "No todas las historias están igual de bien, pero me ha entretenido mas de lo que me esperaba",
            "review_date": "2016-11-25",
            "source": "rt"
        },
        {
            "content": "When it comes to movies, sometimes I intentionally subject myself to pain. I think there's a term for that...",
            "review_date": "2016-10-31",
            "source": "rt"
        },
        {
            "content": "Despite a few chilling moments, Viral is the weakest of the whole VHS series.",
            "review_date": "2016-10-31",
            "source": "rt"
        },
        {
            "content": "Subtlety has never been the series' strong suit, but, here, the entire meaning of the word appears to have been forgotten. Some amount of shock factor can still be found, but there's nothing legitimately creepy about any of the mini films this time around. The whole thing is essentially just ridiculous, and it's even in your face with respect to its already obvious use of more modern recording devices. \"Look how different this one is! Look at all these iPhones and GoPros!\" Yeah, how about you give me one solid story, and maybe I would want to.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "This movie doesn't make sense. In other words, it doesn't hold up to the first two installements either, and it gave me enormous headaches, because of the shaky footage. The two first VHS film were also fucked up, but at least you could follow them, but this one looks just like a bunch of poor ass footage mashed together, I mean, what the fuck is going on. And the special eefcts are also weaker than the previous movies, but still okay. Not really recommended though.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "Wow, I didn't believe it was actually possible, but this movie was actually worse than V/H/S 2. Horrid plot, terrible and acting, and just bland and shit story writing. And what the actual fuck was with the other dimension.",
            "review_date": "2016-09-14",
            "source": "rt"
        },
        {
            "content": "One of the sloppiest and most tensionless horror films in recent years, V/H/S: Viral fails to understand that glitch effects, cloaks, demon vaginas, skateboards and bad acting are not scary.",
            "review_date": "2016-09-03",
            "source": "rt"
        },
        {
            "content": "Coming into this movie i had high hopes. Both VHS and VHS 2 were great movies with halfway decent stories.VHS Viral however goes in the total opposite direction and is a mess of a movie that needs to be locked away and forgot.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "Weakest of the series and the viral angle is kind of lame but I give them credit with sticking with the format. If they keep the series going them I'm sure they will find all the weirdest ways to tell a found footage movie.",
            "review_date": "2016-07-20",
            "source": "rt"
        },
        {
            "content": "More flushed out than its predecessors, \"V/H/S: Viral\" manages to add a disturbing and unique set to an inconsistent series. \n\n\"V/H/S: VIRAL\" follows the story of a group of friends trying to film a police chase in order to garner internet fame. However, this is not your typical car chase, with a sinister ice cream truck out to ruin the lives of many.\n\nIn all honesty, I didn't really like the first two V/H/S films. Each had their moments and a couple of great segments, but for the most part, it was more miss than hit. Here, I saw the ratings prior to that and I had zero hope for this film. I was honestly ready to tear this film apart but instead, I found myself enjoying this film a lot. This is not only my favorite V/H/S film in the series, but is actually a pretty good horror film. \n\n\"Vicious Circles\": A man named Kevin, obsessed with shooting film, decides to go for a viral video by filming a high speed car chase happening near his house. However, the ice cream truck on the run is not your typical truck, inflicting damage to anyone with a cell phone near by. As he chases it down, more and more people get images and videos on their phones,  causing them to go mental and deranged. Now, this narrative started out pretty cliche and ordinary, with the main protagonist filming his girlfriend. I wasn't all too impressed but then, the film introduced the primary narrative and I was shocked. It was actually a very interesting and unique way to continue the story and I was always excited when the narrative was playing. The story was on a much larger scale than it previously had been, which made the movie even better in this case. Not only was the story interesting and unique, but it added this awesome mystery that made this the creepiest and flashiest narrative that we've had in the V/H/S series thus far. Many people did not like this film considering it strayed very far from the format of previous films, but I for one loved it. Considering I didn't like the previous two films, I was very excited to see this new change. 4/5 stars.\n\n\"Dante the Great\": A magician who discovers a cloak that gives him powers like never before. He's able to put on performances that mankind couldn't even imagine, but with great power comes great responsibility. The cloak is not what it seems to be and when its discovered that he's feeding its power through death, it becomes a fight for life. With this being the first film we get to see, at this point, I was expecting nothing. However, what I got was another interesting story with a unique layer to it. This was actually a really flashy and visually interesting story. I actually found this to be pretty disturbing also, blending together magic, a psychopath, and evil all in one film. This was a great intro to bring us into the first of three great shorts. 3.5/5 stars.\n\n\"Parallel Monsters\": Alfonso creates a portal to an alternate dimension where everything seems the same. But when he switches sides with his alternate self, he soon realizes that this alternate reality may not be so human friendly.  I was actually really excited by the unique thrills that this short brought. I thought it was very interesting to see this alternate reality because as the doubles switched sides, we were given a mystery as to what this alternate reality was. I was having a ton of fun trying to figure out the story at hand and there were multiple parts where my jaw dropped. I loved the creepy vibe that came about and I was genuinely disturbed by what was happening. It managed to tell a well, flushed out story with enough mystery and an eye opening ending. 4.5/5 stars. \n\n\"Bonestorm\": A trio of skaters run out to Tijuana in order to purchase illegal fireworks and film themselves skating. Arrogant and young, they decide to skate in a valley containing a pentagram. When they accidentally unleash a hoard of cloaked monsters, they'll find themselves fighting for their survival. Despite this short also following the pattern of as*hole characters and questionable moments, I actually found it to be more entertaining than it should've. There's something about a group of teenagers kicking ass and killing a bunch of cloaked monsters that makes me laugh. Not only did it look decent but it was also just mindless fun. The short often fell to shaky camera and unlikable characters, but the mindless violence and creepiness is enough to keep you watching. 3/5 stars.\n\nIn the end, I'm very surprised at the poor reception this movie has received. Many people are upset at the fact that it did not follow the format of the first couple films, and considering I didn't like them, I'm completely okay with that. I loved the new format of this film and each story felt more flushed out than it ever has. Yes, this film has its problems, primarily with its characters, camerawork, and cliches, but for me, it stands out amongst the other films. I had a ton of fun with this film and I would actually consider buying it for myself. I'm very surprised to be giving it this rating considering the negative reception it's gotten, but I'd be lying if I said I didn't like it.",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "This was Zoombies. Hot garbage.",
            "review_date": "2016-05-25",
            "source": "rt"
        },
        {
            "content": "Certainly a step back from VHS 2 but still better than the first VHS, Viral puts a greater emphasis on humor rather than horror. Some of it works but most of it doesn't. The one segment that does work fairly well overall is \"Bonestorm.\" Visually interesting, fast paced, and humorously gory, this story will certainly keep viewers entertained.\n\nThe other two segments are tolerable but mostly too silly and over the top to laugh at, but they're also not at all scary since they're going for comedy so they fall short on both fronts.\n\nOf the three VHS films released, you'd best stick with part two only and leave it at that.",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "A witless, nonsensical mess of sub-Tales from the Crypt schlock (but without Tales from the Crypt's sense of fun). This one entertains a rough impression of a framing device, like the previous two films in the series, except it doesn't actually do anything to tie itself to any of the short films shown (with one exception). That's right - the framing device doesn't actually FRAME anything. One of the shorts even lurches clumsily between documentary, found footage, and regular \"the camera is just a floating ghost held by nobody in particular\" style film. The parallel dimension short is just cryptic and strange enough to be interest-holding, but its bit of creativity on offer is completely washed out when a later short shifts between \"boring YouTube skate video\" and \"boring horrible video game.\"",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "Short rating \n\nShort 1 (2.5/5\nShort 2 (3/5\nShort 3 (1/5",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "A massive drop in quality from the excellent V/H/S 2, this anthology movie lacks the humor or style of the original two",
            "review_date": "2016-04-13",
            "source": "rt"
        },
        {
            "content": "Not as bad as I had originally been warned. The first two vignettes were actually very engaging. Sadly, it went downhill after that.",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "VHS Viral manages to bring us an anthology film where the segments themselves are better than the whole and improves on the previous outing in the franchise.  Each segment (short of the wrap around) stands very well on it's own and would be recommendable as a short film. Unfortunately, this is a VHS film so you have to look at the whole of it. This is where I take issue with the film.  The first two VHS films used the VHS format to bring about their stories, this is not the case in the third film. This is all digital all the time and yet not only do they use the VHS franchise name... they incorporated VHS style distortions, damage, manipulations, etc. throughout the film.  I'd normally say this would be a 3 star anthology film but I had to reduce the score due to the poorly chosen wrap around and the choices made regarding trying to make a film that wasn't a VHS film... a VHS film.  But if you like anthology films more for the segments contained within rather than the film on a whole, VHS Viral would likely still entertain so I'd recommend checking it out.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "This film was a massive mess. From start to finish it didn't feel like it knew what it was trying to say or do. None of the stories stood out, and all ranged from bad to very bad. Even if you're a big fan of the other two, don't bother watching this wreck.",
            "review_date": "2016-03-03",
            "source": "rt"
        },
        {
            "content": "Waste of time.  One wasn't even in English.  The rest was almost pure crap.",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "A letdown from the second by a lot.\nI saw only 1 good story here, and the overall plot was just too stupid.\nIt tried to get with the times but it just didn't work.",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "Not the best of the series.",
            "review_date": "2016-02-15",
            "source": "rt"
        },
        {
            "content": "Compared to the other two this was nowhere near as interesting. More silly than scary.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "While this series continues the normal rule of diminishing returns for the average horror franchise, it is still rather watchable and worth a look, as it begins to play with the reality of those recording the videos.\n\nWell worth a rental.",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "While this series of films have always been a bit of a guilty pleasure for me, this third entry was just awful.  The magician story was the only one that I thought was even slightly watchable.  This is a huge let down compared to the others.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "Back to banality. When compared to its stellar predecessor, V/H/S viral is a bit of a blank squib. Scoring a whopping 0 out of 4 on the scary scale, 2 for 4 on funny, and only one, creative diamond in the rough to really recommend (it's called 'Parallel Monsters' and I'm sure you could find it somewhere online) My honest suggestion would be just to watch V/H/S 2 again, and again, and again until the tape wears out.",
            "review_date": "2016-01-30",
            "source": "rt"
        },
        {
            "content": "Ive seen some pretty bad horror movies, I can usually watch through them and laugh... I hated this movie. There was a point where I paused the movie and had to take a break cause I couldn't take it. This. Movie. Sucks. They try to replace everything with tons of gore and nothing makes sense. I hated it. Horrible way to wrap up a decent horror franchise.",
            "review_date": "2015-12-30",
            "source": "rt"
        },
        {
            "content": "This film was really a waste. It looked as though the production value decreased from the 2nd film. The scenes didn't fit together at all. It was very forgettable. I just watched it yesterday and can barely remember what all happened. It seemed like a typical horror sequel, just trying to squeeze out what remaining money is left out of the audience.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "If you're a fan of the series like I am then you'll be annoyed. Sure, the first two films had their ups and downs but at least they stuck to their formula. In Viral, the found footage gimmick just completely goes out the window whenever they feel like it. All in all, a big disappointment. The second story, \"Parallel Monsters\" was easily the most compelling/creepy thing in the film, even if the big reveal was vapid. The rest of this film doesn't make much sense, tries too hard and abandons what made the series popular to begin with. My advice, just watch one of the first two again instead.",
            "review_date": "2015-12-14",
            "source": "rt"
        },
        {
            "content": "Pros:\n-A couple stories were interesting like the alternate universe one\n-The acting is ok\n-The gore and effects are done well\n-The film is shot in traditional VHS style...\n\nCons:\n-...except there are no VHS tapes in this film\n-The main story feels very scattered\n-You end up not caring about the main story or main characters because some of the minor stories end up being much more interesting\n-Shaky cam is shaky\n\nConclusion:\nVHS: Viral is a found footage anthology horror film that is not really worth your time unless you liked the previous VHS films and want to see it or are a glutton for punishment.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "One good story and the rest were all crap.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "Nov 2015: 3 stars\n\nJan 2021:\nVicious Circles: 1 star\nDante The Great:  3 stars\nParallel Monsters: 2 stars\nBonestorm: 2.5 stars\n\nOverall: 2 stars",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "V/H/S formaatti alkaa pikkuhiljaa riittämään. Viimeinen episodi oli jotenkin edes siedettävä.",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "The Raw, weird, intensely gory and inventive VHS series takes a serious nosedive, first off is the almost complete lack of vhs, the footage that actually is found on tape looks nothing like the format (a problem i had with the last few Paranormal Activity's) instead we get, as the later half of the title suggests, a cursed viral video theme, which kinda sucks frankly. The biggest issue with these films has been the wrap around story that segments and bookends the film's, after an improvement with the second, we get the worst by far, a bafflingly incoherent (something seriously vague about an out of control icecream truck that causes mass hysteria whilst a extremely unlikable young dude persues it) it's ill conceived and threadbare and loudly nonsensical. The first of the actual main tales is a very hit and miss affair concerning a Chris Angel stlye magician who gets real powers from a possessed cloak, there are some inventive visuals and cool moments but the talking head documentary execution is really all over the place and often it outright betrays the found footage format. The middle story is the only real selling point, it's fucking great, much like Gareth Evans monumentally hardcore \"Safe Haven\" short in part 2 \"Parallel Monsters\" is twisted, intense, disturbing as fuck and really creative and fun, it's truly what i wish more horror was like these days, imaginative and unpredictable. The third story, about a bunch of truly obnoxious skateboarding kids getting in over their heads with a mexican death cult has energy and creepiness and some satisfying kills but is undone by just how hateful and unpleasant the kids are, but is still worth a see. It's all finnished with the climax of the terrible wrap around story, which is undercooked and just \"meh\", still, at least it ends on a memorably ambitious, apocalyptic image, scored to Beethoven. Disappointing, messy and not fully thought through in it's stories and concept's but with enough fucked up moments and suprising ambition to make it worth a watch for horror fans, if nothing else just watch the second story as a great stand alone, scary short.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "The magician sketch was average and you can flush the rest.",
            "review_date": "2015-10-26",
            "source": "rt"
        },
        {
            "content": "this movie was god awful.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "I'll admit I really enjoyed the first two V/H/S movies, especially the second one but I found V/H/S Viral to be such a disappointment. Not only does this one essentially ditch the found footage aesthetic that had such a strong presence in the first two movies but the short stories depicted where some of the most un-engaging sequences I've ever seen. Two of the segments barley grasp being watchable and the others just left me pondering what possible changes could have made them the least bit interesting.",
            "review_date": "2015-10-15",
            "source": "rt"
        },
        {
            "content": "\"This third entry in the series ought to haves had punch and bravado considering the talent involved, sadly this anthology is full of partially developed shorts- many ill-fitting and at odds with the core ideals of the tries - and the wraparound story is an unmitigated mess. So very disappointing and a badly put together attempt at Horror satire. Rewatch the first film and Safe Haven from V/H/S/2 instead.",
            "review_date": "2015-10-05",
            "source": "rt"
        },
        {
            "content": "Garbage film, with only a few good ideas that are executed horribly.",
            "review_date": "2015-10-03",
            "source": "rt"
        },
        {
            "content": "After the overwhelming success of VHS 2 VHS VIRAL is such a disappointment to me! It only gave me mild jump scares, it had horrible makeup effects, it has a worse storyline than Scary Movie V and it has the quality of an unknown tv movie sequel!",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "I can't believe they even finished this project.",
            "review_date": "2015-09-09",
            "source": "rt"
        },
        {
            "content": "Probably my second favorite of the trilogy.  Saw this get a lot of hate from critics and viewers alike, but I don't know what else one would expect from a V/H/S sequal.  It had a handful of hit or miss shorts, full of lots of experimental techniques, and at times genuinely clever stories.  Definitely worth the 90mins any horror fans time.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "Could not even make it all the way through this movie, which is rare for me, normally I will watch anything at least once.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "totally shitty..worse than 1st",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "There are bad movies and then there are the despicable ones, deserving of every excoriation because it feels like the filmmakers don't even try to put out good work. \"V/H/S: Viral\" belongs in the latter category; I hated pretty much every segment it offers.\n\nThe \"best\" of the found-footage shorts is \"Parallel Monsters\" directed by Nacho Vigalondo. It tells the story of a man who creates a portal to another dimension. He is welcomed by his double who also made a portal from the other side. It stands above the other segments because there is intrigue: We wonder what lies on the other side. Although the material falls apart somewhat in the final two to three minutes, a good chunk of it is curious and it offers some humor. It is rarely one note.\n\nArguably the worst is Justin Benson and Aaron Scott Moorhead's \"Bonestorm.\" Skateboarders go to Tijuana to shoot some stunts while causing some ruckus along the way. While filming, one of the boys is injured and blood drips on a pentagram. The segment might as well have been a video game. Eventually, the boys end up fighting some men wearing cloaks-presumably devil worshippers. The violence is cartoonish, silly, and dumb but never fun. None of the skateboarders are remotely likable. I did like the shot, however, when one of the camera was swallowed by a demon and we get a chance to see inside of its throat.\n\n\"Dante the Great,\" directed by Gregg Bishop, reminds me a pilot episode of a television show that might have appeared on The WB when I was a teenager. It is so dramatic, almost soap opera-like, and some of the stunts and visual effects reminded me of \"Charmed\" sans a level of self-awareness that made the show enjoyable to watch. The segment involves an aspiring magician who finds a cloak that requires human sacrifice in order to give its wearer some power. I sat in my chair, wondering how the segment made it into the collection because there is nothing scary, creepy, or thrilling about it.\n\nThe unifying storyline is \"Vicious Circles\" directed by Marcel Sarmiento. There is a high speed chase around the neighborhood and Kevin, despite his girlfriend's disapproval, hopes to record some awesome, preferably violent, images so his footage will go viral. Then Kevin starts to notice something strange: the chase, for some reason, is going on circles. The unifier should always be told with simplicity and clarity. Because it lacks these qualities, once the segment is chopped up and interweaved between the other segments, we end up feeling confused and wondering what message the writers hope for us to take away from it. We are not given one reason to care for Kevin, his beautiful girlfriend, and their relationship.\n\n\"V/H/S: Viral\" offers a dearth of suspense, great thrills, or creative horror. The filmmakers of each segment, with the exception of those responsible for \"Parallel Monsters,\" should pay the audience to sit through their films because looking at those images felt like work.\n\nFilm-Review.org",
            "review_date": "2015-07-28",
            "source": "rt"
        },
        {
            "content": "Awful...couldn't finish",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "Not that particularly well done, confusing and boring.",
            "review_date": "2015-07-18",
            "source": "rt"
        },
        {
            "content": "Definitely the weakest installment of the series. The wraparound segment is not another discovery of disturbing VHS tapes. In fact, there aren't any VHS tapes. It's about the Internet, making the title a tad bit misleading. But nobody watches this for the usually flimsy thing connecting the segments together. They watch it to see what kind of mini-horror films will be served to them. In order: \"Dante the Great\" is shot as half-mockumentary, half conventional horror film. It's a fine segment with some impressive special effects (the franchise has clearly gotten a budget upgrade), but it doesn't really seem to belong to the \"VHS\" series. It seems more appropriate for \"The ABCs of Death\" or some other horror anthology series. The next segment, \"Parallel Monsters,\" is from the director of the Elijah Wood/Sasha Grey film \"Open Windows.\" It takes awhile to get going (which makes sense, as it's about two versions of the same man as they explore each other's parallel dimensions), but you won't believe what the horror is here. The final segment, \"Bonestorm,\" is the bloodiest one offered here. Three skateboarders, their extremely obnoxious videographer, a ditch in Tijuana and undead cultists. Stir them all together and you've got blood, guts, and the most uses of the word \"dude\" outside a Pauley Shore movie. Save this one for last. Watch the \"VHS\" franchise in order. The first is very good, the second great, this one falls short but is still worth a look.",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "And so it begins, the downward spiral all horror franchises must make.  A pitty for it to happen so soon and to a franchise I had such faith in.  I will start with the good and say there is one short involving a parallel dimension that's actually pretty great.  It's unique, intriguing, and downright creepy.  The rest, even if they may have one or two interesting ideas, just aren't very good, memorable, or scary.  They all break the found footage rules in jarring ways, some are just nauseating to watch, and most are just plain boring.  The biggest disappointment comes in the framing device which is hardly a framing device at all, but just a short that we return to in between without any cohesion to the rest of the shorts and a \"twist\" ending that is incomprehensible and pointless.  I give the film props for that one effective short which is actually worth seeing, but the rest of the movie is just a mess.",
            "review_date": "2015-06-23",
            "source": "rt"
        },
        {
            "content": "Weirdly engaging and fantastically Fucked up!",
            "review_date": "2015-06-23",
            "source": "rt"
        },
        {
            "content": "Like any horror series VHS proves that the longer you milk a name the worst it gets. Like the previous VHS movies Viral has an anthology format but the frame story is weak at best and the story snippets aren't that much better either.\n\nThe attempt at the 'high-brow' dig towards our voyeuristic camera(phone) culture is so bad that it doesn't live up to even the first two or three minutes from the Black Mirror Episode tackling the same problem.\n\nAvoid.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "this one wasn't even close to as good as the first two. its very disappointing",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "Just about every review of this was negative, but i still wanted to see it just because i like the v/h/s series, surprisingly it wasn't as bad as i feared it would be, i ended up getting into each story and was interested in them, the problem really was just that they all really didnt know how to end, the wraparound has the most screentime of any of the v/h/s, and i was into it, but the ending sucked, the first segment was probably the most complete, no real complaints but just kinda underwhelmed, the 2nd was def more intriguing, but the grand reveal was just wtf, tho i liked how it ended, and the 3rd one, while even tho had the douchiest douches as characters, did get quite suspenseful, but then it just ended, like 5 mins seemed missing, oh well, overall not as bad as i thought, tho still flawed",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "So much for hoping this gets a good franchise. This is some of the worst filmmaking I've ever seen.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Wasn't the greatest of the installments and wasn't the best of the previous two but still enjoyed a couple of the sequences.. Mostly \"Bonestorm & Dante The Great\"",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Oh what the fuck. I loved part 1 and part 2, and now they do this weird shit? The thing is, I could take the weirdo truck driving around LA even though I couldn't figure out what it had to do with the tapes, but the SOUND was ANNOYING AS HELL. I could sit through all these stories, but the constant scratching, and misalignment timeline, etc. Was SOOOOO ANNOYING. BLAH. Decent concept, BLEH execution.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've ever taken the time to finish.",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "When I first saw VHS and VHS 2, it was new life into the found footage movies. VHS2 was one of the rare movies that improved on the first movie. With Viral it turns out that going bigger isn't better. VHS did well with its over the top situations. Viral attempts to do this, but ends up just wacky. I have never been so bored and frustrated with the movie. Now honestly I have nothing nice to say about it.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "Poorly filmed, unscarry, messy and unsatisfying, VHS 3 is a poor imitation of it's much better predecessors.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "In the footsteps of the previous two movies, this film just comes across as a spastic version of its predecessors. More gore and supernatural events, the third movie in the VHS trilogy just celebrates the unexplainable in an absurd way",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "I like these movies because there is more than one story, and this twist being viral is a nice switch from actual video tapes. Some good special effects, though not a lot of really good story.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "I've seen some bad movies but very few made me feel like someone just took a shit on my television. This was one of them. I feel like Netflix should pay me to have this movie on my Netflix.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "Not as good as any of the previous V/H/S's. it couldn't give me that drive or shock value.",
            "review_date": "2015-05-03",
            "source": "rt"
        },
        {
            "content": "Literally the worst piece of shit that I have ever seen.",
            "review_date": "2015-04-30",
            "source": "rt"
        },
        {
            "content": "With the success of v/h/s/2 the producers thought it would be a good idea to make a third part but this installment lacks everything it's predecessor had to offer with overused elements and overacting that does not deliver much of anything  but it does have it's moments such as Parallel Monsters which is unique and terrifying.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "I turned this one off within the first twenty minutes. \"V/H/S: Viral\" is a surprisingly lazy anthology sequel that is contradictory, poorly acted, uninteresting, and worst of all, it's just not scary. While the first two were entertaining mixed bags, this one isn't a mixed bag at all. It just flat-out sucks.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "The first two were at least entertaining.",
            "review_date": "2015-04-21",
            "source": "rt"
        },
        {
            "content": "Seriously? What a waste.",
            "review_date": "2015-04-19",
            "source": "rt"
        },
        {
            "content": "Wat happen??? 1 and 2 were AMAZING and couldn't wait till the third one came out sadly after 38 min into it I turned it off and very pissed of how terrible it is!!!!",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "what the hell was this... I don't think I want to watch the rest in the series",
            "review_date": "2015-04-16",
            "source": "rt"
        },
        {
            "content": "Big letdown really enjoyed 2 but this one just missed the mark",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Are you a ninja?\n\nA couple run after a wild police chase in hopes of getting some key shots on film that will help the boyfriend become rich.  They get involved in a string of films where people around the country have filmed some strange videos involving gruesome deaths.  Upon viewing the films, the girlfriend gets sucked into viral space and the boyfriend will need to make a tough decision.\n\n\"He had to feed it and it was only hungry for one thing.\"\n\nSix directors collaborate to deliver a series of short horror films that all tie together.  Some of the skits are better than others, but they were all entertaining and fun to watch unfold.  I enjoyed to watch the skits and felt they were all better than average.  The cast is reality television like.\n\n\"My camera, my show.\"\n\nI've enjoyed watching these films and this was recently added to the Netflix new queue online.  This was a fun horror movie with unique plots (the magician story was my favorite), and the gore was well done.  This was better than average and is worth a viewing for fans of the genre.\n\n\"Do you want to be immortal or a giant vagina monster?\"\n\nGrade: C+/B- (6.5)",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "I wish I could give it zero stars. This movie was horrible from beginning to end. A disappointing way to end what could have been an awesome trilogy. None of the stories were scary or even disturbing. The filming is not as good as the first 2 film's original 'found footage' style. I wish I could unsee this film.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "This is easily the dumbest linkage of short horror films in the franchise.  While the shorts themselves are inventive, the wraparound is intolerably irritating.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "It's like watching fresh roadkill sputter and bleed out on the pavement---you kind of feel sorry for it.  It's _that_ bad.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "I don't think that the third entry is as strong or original as the first two but it does have some real good moments. The alternate reality one along with the Death cult were highlights.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "the first 2 movies were in ovation and brought back the anthology movie. the second one being the best but this third and final is about as meaningless as sunglasses at night. the story has no connection with the first 2 and some of the stories feel like they were thrown together just to fit into a movie they wanted to push out fast. the only good one I thought was the skateboarding section. definitely skippable.",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "This is a really bad movie, if you know this before watching it, you will enjoy it. Get some friends, get drunk and laugh your asses off!",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "The first film was amazing... The 2nd was good.... This one.....well let's just say that if I see a collection of the first two films for five dollars, and all 3 for 5.25....  I would save my 25 cents for a gumball and skip out on this. \n\nThey really didn't seem to try, it was more action than horror. I would not recommend this to anyone for any reason.",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "The first two may not have been Shakespeare, but VHS viral pales in comparison to even the initial two, flawed horror anthologies.  From the non subtitled Spanish story, to its obnoxious skater, demon venture anything positive that could be said about the prior two films cannot be stretched into a half compliment for this entry.  It is because of lame endeavors such as this that prevents horror from garnering any credibility that films such as THE GUEST, THE BABADOOK, YOU\"RE Next, and IT FOLLOWS have desperately been trying to reiterate for the genre recently.  Finally, could the CLOCKWORK ORANGE end reference been any more pathetic attempting to elevate this turd to respectable standards?  Avoid this poorly crafted, clap trap at all cost.  Go out and support the indie gems that are desperately seeking viewership out there that allow horror to surface for breath a midst all the low class knock offs  clinging to a franchise that in itself does not deserve three chapters.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "Ne viens pas à la cheville des 2 premiers qui étaient vraiment originals et nous gardais sur le bout de notre siège.",
            "review_date": "2015-04-05",
            "source": "rt"
        },
        {
            "content": "It was pretty scary. 8-o",
            "review_date": "2015-04-04",
            "source": "rt"
        },
        {
            "content": "Dante the Great: The first segment is a decent one that is actually something I've never seen. The acting is good, and the effects are cool to look at. It's interesting, but not as interesting as it was trying to be. The fight scenes are really good, and it's cool of the way they fight. It's a bit messed up, but I didn't find it scary at all. I was questioning it like, how is this being filmed? Dante the Great is not really that great of a start, but it was a heck of a try for a segment.\nParallel Monsters: Well that was quite a segment. The premise is really different, and the acting is decent. The new world looks creepy, and the effects are good. The make-up looks messed up and disturbing, but in an effective way. It's a bit disturbing, and can be a scary place living there. It made sense why it's found footage, and the effects on the camera looked cool. It's the best segment in the movie so far and I actually wanted to see a movie out of this.\nBonestorm: I was actually looking forward to Justin Benson and Aaron Scott Moorhead's segment, until everybody talked about how it's the worst segment in this movie. Sadly after watching it, they're right. The acting is fine though, and there's one moment the I actually laughed at, but man, this segment has the most stupid characters that I've ever seen in a long time. The characters are mean-spirited, and they could've gotten out of the situation if they didn't just stay there. The fight scenes are great to watch, but what's the point when they could've got out of it like I said. The effects looks really cheap, and some of it was really unnecessary. I'm very disappointed of what it could've been, and just turn out to be a horrible segment.\nVicious Circles: This segment is a boring one that I didn't find it scary at all. The acting is dull, the plot doesn't make any sense, and it sometimes goes nowhere. Some moments were just random and add nothing to the story.\nV/H/S Viral is an all right horror movie that half of the segments are good, while the other half is just awful. There's a bit more bad stuff in it than the good stuff which makes this movie to be disappointing.",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "Radically departing from the series format, V/H/S: Viral is an inexplicable mess that's appallingly bad.  The film doesn't follow its own rules, as a lot of the videos don't conform to the conventions of found footage (and some of the videos aren't even found footage).  And this might be excusable if the videos were any good, but most of them aren't.  V/H/S: Viral doesn't know what it's doing, and ends up turning out garbage.",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "More of a let down than the second as only one of these mini stories was pretty damn creepy(Parallel Monsters). The rest.. meh. If they make another one of these movies of course I'll watch, on Netflix.",
            "review_date": "2015-03-31",
            "source": "rt"
        },
        {
            "content": "without the magician one and the concept of the parrellell universe one it would be 1 star",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "I liked the first two entries in this found-footage horror-anthology series, but \"Viral\" is the most irritating thing I've probably ever watched. OK, maybe not quite as bad as \"Inherent Vice,\" but pretty damn close. The jerky camera style, stupid recording interference make this an exercise in torture. Press eject and run like hell.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "Leave It.\n\nRead the full review: http://wp.me/p5EQnP-6m",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "Sloppy, boring, and uninteresting, the latest installment in the V/H/S horror franchise doesn't have enough juice in any of its segments to really get anyone excited about it. I hope the next one will be better.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "A serious step down from the other films in the series.  The frame narrative of the police chase in L.A. is probably the best of the series, but it causes more confusion than answers questions.  The ending is really dumb though because it makes no sense.  While the film starts off strong with a really interesting video about a magician with dark powers, the rest of the videos are confusing and just plain gross.  The one about the Dia de los Muertos zombies is just plain stupid.  I wouldn't mind seeing another VHS film, but it's gotta be better than this one.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "A bit of shame considering I was really looking forward to this.  Maybe it's because the 2nd film set the bar so high.  It's still enjoyable but definitely the weakest of the trilogy",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "A step in the wrong direction for what seemed like a blossoming horror franchise after a creative and chilling first sequel. With the exception of one, the segments are dull and unimaginative, the horror is gone, and the heavy-handed themes bog down the whole thing.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "Wow this movie was absolute aweful. I saw the first two films, which were good. stay away from this one.",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Another year, another compilation of found footage horror. A magician, parallel dimensions, a death cult, and an ice cream truck make up the quartet of supernatural shorts. Making the frame narrative the fourth short is an improvement. Much more even than the previous two, with decent stories throughout. More focus is given to each, none are spectacular, but all are enjoyable.",
            "review_date": "2015-03-27",
            "source": "rt"
        },
        {
            "content": "People will like this for what it is, that's if they like it. Fans with have satisfaction in some form or another here. It is just as off the wall as ever yet better in some ways. It draws you in. There is the high level of absurdity here, but it works.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Really hard to explain. Not a good movie by any means. Heck maybe not even a passible one to most but for some reason I feel like they kind of tried to do some creative things. Really experimental with horrible sloppy execution but I still respected some of the things they tried to accomplish",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "A collection of, always entertaining, short horror stories.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Completely destroyed the spirit of the original two.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "If you've followed my reviews, then you know that I'm a fan of this franchise.  While it shares some of the many issues anthology films face, inconsistency in the segments themselves, the VHS franchise has actually been a pretty damn fun franchise to follow.  I don't wanna say it's the most creative horror franchise around, but I think giving the filmmakers the freedom to do what they want has been a very inspired choice.  Case in point, Gareth Evans' short in VHS 2, whose name I forget, was absolutely incredible, and I doubt anyone other than him and the crew had any real say as to what went into that short, creatively speaking at least.  Which brings us to VHS: Viral and the absolute utter disaster it is.  Perhaps disaster is the wrong word, but there is a massive drop-off in quality as the film shifts from VHS tapes to a more modern take on fame on the internet and getting hits on YouTube.  There's heavy-handed social commentary on how we're obsessed, or some people are, with getting millions of hits on YouTube and how toxic that can be.  If you loved the first two films in this franchise, this one has hints of what you loved about the franchise but, by and large, it's a really goddamn big step down for such a fun franchise.\n\nVicious Circles:  This is the wraparound, the one that connects all the segments together, and this one really did absolutely nothing for me.  Essentially, and I described this in the earlier paragraph.  This short basically sees a car chase take place around L.A as thousands of people try to record, all of looking for a million hits on YouTube.  Sort of like Nightcrawler of the internet era, if you will.  The problem is, as the truck travels around the city, people receiving images, that the truck is broadcasting, through their phones causes them to become dazed and violently insane.  Naturally this leads to a lot of deaths.  The main character in this short is following after the truck that's sending this signal because he believes his girlfriend has been kidnapped by the person responsible.  This segment this absolutely nothing for me, as none of the wraparound segments in the other films have.  But on top of not doing anything for me, it has this incredibly forced message about all the wrongs of the internet and wanting to go viral that you've heard elsewhere.  It's toxic, it's a virus, it makes us zombies, blah blah blah blah.  We've heard it all before.  It's not that it's a bad idea, per se, it's just how heavy-handed the whole thing is.  The message is so forceful that it loses all effectiveness.  And the segment really isn't that good to begin with.  And all the camera effects, like the image distorting and stuff, are absolutely fucking terrible.  Everything that people hate about found footage is right in this short.  I'd say that this was a bad way to start off the film, but this segment was spread out through the entire film, shown before and after a new segment airs.  As a whole, however, this just isn't very good.\n\nDante The Great:  The first real short of the film is a fairly decent one.  But, and this is a theme that carries throughout the all the segments in the film, is that this isn't exactly a traditional horror film.  And this short, while it has elements of it, in some ways more resembles a weird attempt a superhero movie with some hints of horror in an R-rated setting.  Essentially Dante, a struggling illusionist, finds this strange cloak that Harry Houdini got rid of, for one reason or another, and he finds it to have strange powers that actually makes him one of the more successful magicians in a very short time span.  There's just one thing, the cloak itself requires sacrifices.  So there you go.  It honestly wasn't a bad short in the least, it didn't take itself seriously at all, but I wasn't really that into this.  I will say this, the editing is absolutely excellent in this.  Because there's sections where Dante will wrap someone up in the cloak and take them to a completely different room.  The editing in these parts is so smooth and crisp that, unless you know editing tricks, you won't even notice it.  That's how good it is.  The rest of the short is fine, I mean it has some decent gore and everything, but it's not anything special and it's a relatively weak way, outside of the wraparound, to start the film off.  Some cool moments don't make this a good short.\n\nParallel Monsters:  To no one's surprise, Nacho Vigalondo, filmmaker of the excellent Timecrimes or Cronocrimenes in spanish, has the best segment of the entire film.  This guy is great.  I'm at a bit of a crossroads with this short's placement in the film to be completely honest.  You'd want to make a great first impression, right?  And I suppose that Dante The Great is quicker paced and it's an easier watch.  It gives off the appearance of fun more than this one. So I get the reasoning behind that, but Dante isn't that good of a short to be completely honest.  I'm also mixed in that why wouldn't you this segment for the last one instead of Bonestorm?  I'll get to that in a while, but this is still considerably better than Bonestorm.  This is the Safe Haven of Viral.  If you remember Safe Haven from VHS 2, then you know exactly what I'm talking about.  Unfortunately though, it's not as insane as Safe Haven, but it's the one I can most compare it to.  To avoid spoiling anything, I will keep a lot of the details to myself.  But essentially it involves this man  successfully builds an interdimensional portal where he meets a parallel version of himself who also built the same portal and finished it at the same time.  Both, very obviously, are excited to see that their invention has worked and they've managed to discover a parallel universe.  Curiosity getting the better of them, they decide to exchange places with one another and basically see how the other half lives.  Let's just say that things are not exactly the same in one of these worlds.  It's a pretty goddamn crazy and, actually, pretty clever short.  Let's just say there's some strange genitalia involved.  It is a great short and it's a shame that the rest of this film doesn't match this one's greatness.  The only reason this film, as a whole, gets 1.5 stars is solely because this segment is so goddamn great.  I think giving it 2 stars would honestly be giving it too much credit.  It's great, but it's not that great, you get what I'm saying.  However, if you were to watch any segment of this film, make it this one.  I can promise that you won't be disappointed.\n\nBonestorm:  Which brings us to the last short of the film.  Let's just get this out of the way, if you're strictly watching this film to watch the bloodiest and goriest short, then this is the one for you.  That's essentially all it has to be perfectly honest as, until it truly gets gory, this is probably the weakest of all the shorts, excluding Vicious Circles, which connects them all together.  I don't think it was actively as bad as Vicious Circles ended up being, but it was just horrifically boring.  Essentially, these group of skaters, wanting to film some great footage, decide to go down to Tijuana, Mexico.  When they find a good enough place, their prompted by the cameraman to perform some dangerous stunts.  One of the guys falls and injures himself and he bleeds onto this pentagram that's drawn on the floor, this weird cult comes out and they start attacking the kids in skateboards.  They fight them off using various weapons, guns, fireworks, machetes, their own skateboards even, etc.  It all sounds like it reads perfectly fine, but it fucking takes forever to get to that point where all the gore comes in.  And even when it DOES come in, it literally comes in out of nowhere and with no build-up.  It felt like they were running out of time and they had to get all this shit in.  It's like one of the skateboarders bleeds on the pentagram, the cultists come out, and the next thing, one of the skateboarders is shooting them.  There was no build-up.  To borrow a quote from Ron Burgundy, that escalated quickly.  On top of that, there's no real impact or power to any of the gore,  I mean some of it is cool and all that, but there's no real reason for it to be as gory as it was.  At least in other films like this, it feels like there's a reason or a purpose for it being as violent as it might end up being.  This one is just a mess of structure and pacing.  The ending was terrible too.  You see one of the kids take some remains from his skateboard's wheels as more cultists start appearing behind him, he has a camera strapped to his helmet.  Then the next scene is of the cameraman, who's long dead by this point, as this monster comes out, you only see the feet, comes out and eats the camera, that's still recording.  And that's it.  That's how it ends.  Talk about anticlimactic and unsatisfying.\n\nAs you can see from the reviews, this movie is such a step down from the first two films that I'm almost wondering as to whether this was done on purpose or not.  I don't doubt for a second that this actually wasn't the case, but the fact that it's so bad that it actually made me think it was purposely sabotaged should tell you something.  Honestly, Parallel Monsters is the only thing worth watching on this film.  If you want to watch that and then shut the movie off, then you'd actually be satisfied with this.  This is a terrible anthology film.  Surprisingly worse than ABCs of Death 2 and I wasn't a big fan of that to begin with.  And this is worse.  Imagine that.  One great segment out of 4 isn't enough to elevate this film from being bad.  You can do better than this, like both VHS or VHS 2.  Dead Snow 2, just saying.  Do not watch this.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "The third installment to the VHS series is absolutely horrible and a text book example of everything wrong with modern horror movies. I wish i had not wasted the hour and a half of my life on this crap. The first two segments were interesting at best but still ultimately bad as well but once you get to about forty five minutes into this movie becomes completely unwatchable. The sad part is the first VHS was actually good and the second kinda sucked but still had some good segments worth watching.But this third had a horrible frame story which kind of negates what you know from the first two movies and terrible segments on top of that and it seemed like they spent more money on making this crap which actually did this movies tone a great disservice. What a complete waste of an hour and a half.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "The acting is breathtakingly sub-par, the special effects are cheesy, (and not in a good way), and even the charming found footage-style present in the first two films has been butchered, possibly more than anyone in this movie. I forced myself to sit through the first twenty minutes, took a break, and then finished it for the sole purpose of confirming my suspicions that it was the absolute worst movie I have seen in a very long time. I would recommend that fans of the first two movies accept the first sequel as the final installment of the series, because the only things about this movie that will keep you up at night are the horrible dialogue and laughingly bad \"glitch\" effects.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "I was actually pretty disappointed in this one.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "What the hell did I just watch?",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "How disappointing.  This latest installment is pretty bad compared to the 2 previous movies.  The individual segments weren't bad. the magician one was interesting.  The Day of the Dead one ok.  The parallel universe one seemed interesting, but it was in Spanish and since I don't understand Spanish, that kind of made it difficult to follow (why no subtitles?!).  But the story that was supposed to tie them together made absolutely no sense.  They really should have stuck to the formula that worked in the 1st two movies.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "VHS Viral is the third offering in the V/H/S series of short films that have been exciting and thrilling offerings since the inception, giving directors an oppurtunity to explore horror through several short cut films.  And whil ine the series not every offering lands on its feet, you can't help but be impressed with the effort put into creating them.  VHS 2 improving even moreso on the premise and taking it to another level.  But all the hard work that went into it all is destroyed with meek and insulting offerings of VHS Viral.  The shorts, ranging from the bizarre with some sort of monster penis episode, and then one about skateboarders in Mexico, and a lackluster piece of junk about a magician, the whole thing plays more like a terrible episode of Tales From the Crypt than it does a found footage anthology.  I don't doubt that a lot of hard work went into these movies, but it clearly feels rushed, and the whole thing has unfortunately now become a joke.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "I was a big fan of number one and even number two. Although they didn't have a plot they were still fun you know. This was just.... It's nothing really. It's literally random clips for an hour and a half. It's nothing.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "After enjoying the first two, not loving them mind you, but just enjoying the format and the clever scenes that made up for the lacking ones, I was excited to see what was next for the series. Like the first two, there was at least one scene which stuck out while the rest of the film pretty much sucked. The scene with the guy who discovers an alternate dimension was very clever and well put together. The rest was just garbage. Disappointing, especially since I liked almost all of the VHS 2. I hope this is the last of the series, although with the Horror genre, these tend to get so many unnecessary sequels. I likely won't check out the next one.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "The parallel universe was the best story, great stuff right there",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Some parts of this were good but most of it was abysmal.",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "Good stories but no so good like the others two films.",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "Complete disappointment. After two decent horror entries, this one descends into the complete garbage of found footages films thrown together with no clever payoff. Motion sickness directing, horrible anthology movies and horrid acting.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "weak sequel compared to the previous films,production wise is very decent but the stories are not as good,if there's part IV,it better be good!",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "I love the VHS series but this third entry is the worst for sure.  What made the others so great was the short, interesting and scary stories told that were able to freak you out in just a short span.  Viral changed up the concept and it failed with this attempt.  There were less short videos and some of the films were way to long.  The worst fact about it was that none of them were scary, not a single one! They all went for a \"cool\" factor instead with more special effects and money put into it but took the whole horror aspect away.  One film was even 90% in spanish with no subtitles, so I did not understand what was going on. There was one film that while long, was actually really cool and saved the movie from getting a lower rating.  You will know which one Im talking about it because it by far the best.  I just could not believe that they strayed so far from the roots of this series and changed it all up.  The first film was the best, 2nd one was cool but not as good and this one was flat out not good at all. All of my months of waiting to see this were a waste.(except for that one sweet story involving skateboards, helmet mounted cams and killing tons of dudes in robes at a weird ritual)",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Nah... this was not as good as the first two films, not even scary damn it... but some good stuff was in it .. like skater boys killing undead skeletons ... lol",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "A solid effort, but nothing went over the inventiveness and sheer insanity of the second installment.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "Terrible film that doesn't even scratch the surface of what path the first two films set out on. Awful shorts with the exception of one mildly interesting one that ends up falling flat. See it only if you lose a bet or if you just can't help yourself.",
            "review_date": "2015-03-13",
            "source": "rt"
        },
        {
            "content": "V/H/S:  Viral is not going to answer any questions that you've had about the series--so if you were looking for a definitive answer to where all of these tapes are coming from--prepare to be frustrated.  The theme of the film was supposed to be internet videos--but only one sketch actually captures the internet video style which is the skateboarders vs. Tiajuana undead/demon/things.  The film has some great short films--I loved the Magician's cloak one and the one about a parallel universe was also amazing.  I would have liked a more definitive answer though to the question of where do the tapes come from and I would have liked a better plot to hold the film together--but what you see is what you get and that's the story of an ice cream van terrorizing L.A. The run time says 1 hour and 37 minutes but I felt like this V/H/S just flew right by. If you enjoyed the other features in this twisted tale of the tape trilogy then you'll enjoy this last one.",
            "review_date": "2015-03-10",
            "source": "rt"
        },
        {
            "content": "this series started with a lot of potential and now it ended as the movie itself a DVD on the shelf!",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "It's better than the first one, but not even close to the first one.  A couple pretty cool segments though, especially the Spanish and skater ones.  It's starting to abandon its original concept though...",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "A cheap imitation of the once promising VHS franchise. There was immensely little to like about the third installment of this series that in all contained one generally entertaining segment. Specific criticism is especially directed towards the atrocious wrap around story that is so nonsensical and unconvincing that it's a small miracle it made it past test screening.",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "I'm a big fan of the first 2 VHS. They're really fun and are great showcases for many directors to show their creativity. Well, I can safely say everything that was good about the first two films is gone from this turkey. The plot of this movie is well, anyone's guess to be honest. Where the first two films had basic plots that didn't quite explain everything but the lack of explanation really made it more interesting and scary in turn peeking your interest in the world, Viral straight up makes no sense. All the creativity is gone, and it's filled with some of the most generic stories and dumb characters. Where's the innovation and creativity. The only redeeming factor are the unintentional laughs it provides.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "boring and no where near as good as the first two.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Ugh. I don't know why I've watched this film series. You would think when you get a variety of horror directors in one film to direct a bunch of shorts, how could this turn out bad. Well, although there's a small spark on ingenuity in the concept, this overall feature will leave you cold",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "So bad. So, so, so bad. I loved the first two V/H/S movies, but this one was just awful. Not a single scare in the entire movie. But the worst part, which to me just proved these guys aren't trying, was after the magician \"Dante the Great\" used his magic cloak (that's right, a magic cloak) to fend off a whole SWAT team, he looks at the camera for a few seconds before saying \"Ta-da\".\n\nI registered on here JUST to post this review. Don't waste your time!",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Amateurish,  dull, a weak entry to the series.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Head-scratcher and not in a good way.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "i don't know. i really can't tell if i enjoyed it or not.",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "The hell did I just watch? Vagina monsters and dick creatures. Im lost, pooptastic.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "I LOVED the first two. And then there was this one.  Now I haven't seen the last segment that was deleted on VOD but this installment just was not that good.  The two worlds segment was ok but the rest were BAD!  The main story arc was meh at best.  You can tell they had more money for this one. Mo' Money Mo' Problems.  Lets hope they fix it for the 4th one.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Just when I liked a found footage film series, they had to make a spin-off.",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "What a fancy way of almost ruin a good franchise. Bonestorm was a good concept, but dumb, in the end.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "Oh my god. I enjoyed the first two VHSs, but with this they threw almost all the talent and scares out the window!",
            "review_date": "2015-02-12",
            "source": "rt"
        },
        {
            "content": "i really liked the first clip -- the magic one -- the rest of it was not impressive. i would've maybe liked to see the monster in the bones one though.",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Not as good as part2",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "it was a waste of time and really disappointed..from part one and two this is nothing compare to those..don't bother watching this",
            "review_date": "2015-02-04",
            "source": "rt"
        },
        {
            "content": "If you have a weak stomach just don't . Or a fear of demons definitely don't watch !",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Having watched the first two VHS films, this third instalment fell a bit on the average side for me.  However with that being said, I did enjoy the \"Parallel Monsters\" segment, very eery indeed.  The weakest out of the three segments I thought though was the final, \"Bonestorm\" segment.  It just came off, near the end of the segment, as comical rather than scary.\n\nThis may be wishful thinking but I hope there is another instalment in the VHS series (although I have a gut feeling that Viral will no doubt be the final instalment) as I do like this \"found footage\" genre.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "As far as the series goes, this one was a bit out there for the main story. The sub stories were pretty good, just not the main.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "Just bad.  Plain and simple.  This series has lost its luster.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "it has potential but the only potential that is... is the third story ... the first story of Dante the magician was over its head thus the second story about the other dimension was smart but falls apart ... the third story about the skaters . well who doesn't wanna see pothead skaters beat the hell out of Mexican witches and skeletons . it was fun for what it was ...",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "Only one story was actually good",
            "review_date": "2015-01-16",
            "source": "rt"
        },
        {
            "content": "I have been a fan of the VHS movies, they redeem what found-footage is made for. However, V/H/S: Viral is a downside to the franchise and that is why. Firstly, the major storyline is not clear, in the first VHS movie, it is a mob finding tapes, VHS2 it is investigators finding tapes, neat and tidy. But here, it is just not clear it makes it messy. There are two skits in specific that are really good, with a fun premise, but they are for the most of it dull, Dante the Great was really good, it could turn into a feature film. \n\nHowever, even with the 20 give or take minute runtime, it feels slow and dull yet interesting and frightening. This threequal has more shakiness, it is obviously not action it is gimmick which very disappointing compared to its predecessors. Overall, you can easily skip this movie, it is a disappointment, watch the first two and skip the third. Hope this was informative.",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "skateboard one was so bad, but i still love these",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "Enjoyed the first two movies, this was very lacklustre. Didn't have the scares or corniness that the previous ones had. Didn't blend with the others either.",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "I wish I could add a lower rating. Despite the critic reviews, I enjoyed the first two V/H/S movies as It would be my go to movie for a scary date night or to get some friends creeped out. This installment fails to not only deliver the scares but the charm that is V/H/S. One story that fascinates me was \"Parallel Monsters\" and that falls short and just down right disappoints. This movie was terrible, watch the first two, you can live with out this one.",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "As a horror movie fan I was excited for this film, but it was a waste of time. Boring, bad acting, and easy to loose interest.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "V/H/S: Viral is a movie for horror buffs in the mood for a change in atmospheric intensity and storytelling. ...h this, the \"V/H/S\" franchise has already established its value,  but if \"Viral\" turns out not to be the conclusion of the franchise as a whole, the future will need to see more quality control for the franchise to remain admirable...",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "Is this movie some kind of joke... Lol",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Worst movie I have ever seen!! Whoever rates this movie good has a horrible taste in movies and needs to see a psychologist.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "3/10 - Horrible. Seriously, don't waste your time. The first 2 V/H/S flicks were really cool, but this one just seems like a lazy fan made rip-off. Started off, \"Eh, it's okay?\", and just plummeted downhill fast. Couple of cute chicks gives it the few stars I gave. AVOID",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "STUPID!  Don't waste your time!  The first two films were creative and interesting, this installment is confusing and tries way too hard to be cool.  What a waste of time!",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "Story's were just not as good as the first two films.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "Same as the last two 2 episodes, a few stories work (just like those segments seen in THE TWILIGHT ZONE, TALES FROM THE CRYPT), others don't plus messy. Almost all of them is disturbing enough however.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "Watchable, but doesn't make sense in comparison to the previous two entrees.",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "An awful installment of what was a promising franchise. The new folks in charge seem to have a complete lack of understanding what made the first two work",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "Sin duda tiene sus momentos, pero es un retroceso lamentable a las primeras dos, pierde completamente la esencia de las primeras dos entregas. Su mejor momento \"Parallel Monsters\".",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "This series of films isn't bad as a whole it's a solid series, that said this one just doesn't stand up to its predecessor. In my opinion it's just confusing and doesn't have that flare the other two films had.",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "Dumb ass movie ð???ð???ð???",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "While most of the time it was incoherent and short of suspense, its first segment \"Dante the Great\" showcases an entertaining showdown of two dark magicians and its second segment \"Parallel Monsters\" offers a crazy yet intriguing premise of parallel universes. All in all, it felt more like a cinematic experiment than a legit anthology.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "This 3rd entry is a major disappointment for this series. I have been a huge fan of the V/H/S films since day one and it's a shame that this one failed in so many aspects of what makes horror movies good. \"Vicious Circles/Main Arc\" - 2/10, \"Dante the Great\" - 7.5/10, \"Parallel Monsters\" - 4/10, \"Bonestorm\" - 5.5/10, \"Gorgeous Vortex\" - ?/10 (cut from theatrical and VOD versions of the film).",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Even after seeing all of the horrible reviews I still wanted to check this out for myself. Being a fan of the first two, I hoped it wouldn't be as bad as most were saying. But it was. The wrapper story was just terrible and really made no sense at all. The FX in every piece of this movie were so bad they were laughable. Sad to see this franchise take such a nose dive. If they make another one, I hope they make it more inspired than this piece of trash.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "\"VHS: VIRAL\" Review\nAlright I enjoyed the first \"VHS\" I even liked \"VHS 2\" more. Basically they consist of short horror segments. They are fun and entertaining (even though I hate found footage films) \"VHS: Viral\" is the recent entry in the series and hopefully the last one in this series. This was probably one of the worst movies I have seen in a long time. The only segment worth mentioning is one about parallel dimension with a woman's genitals that eat a man whole. (I know it sounds crazy stupid but trust me) But overall a very bad movie .. Terribly acted, really bad CGI, and one of the worst horror shorts I have seen in a long time called \"Bonestorm\" was really painful to watch.. Im lenient on special effects but this was horrific in all the wrong ways.. * 1 Star PIECE O SHIT",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "Welp that was really disturbing... lol",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "The first V/H/S had three great segments, the second had only one, and this one has two. Viral continues the fine tradition of a completely pointless and draggy framing sequence, but adds ham-fisted social commentary to the glitchy mess. Once you suffer through that, though, the first two shorts are fantastic. \"Dante the Great\" brings real magic to its fight scenes, and \"Parallel Universes\" brings old-fashioned gross-out practical effects to a darkly funny sci-fi tale. The third segment, \"Bonestorm,\" is as bone-headed as its name, trapping the viewer with three bone-headed skateboarders for what feels like an eternity.  It's amazing to hear that a segment was cut from the movie--could it possibly have been worse than Bonestorm? \n\nV/H/S: Viral has an equal hit-to-miss ratio, but the high points are high, and it's worth a look. For a more consistent experience, though, check out ABC's of Death 2, which delivers far more than its predecessor.",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "2012's VHS was an under the radar new horror classic that put some much-needed umph in the found footage horror motif (that segment with the kids in the woods being terrorized by a killer in broad daylight is a keeper) and even though last year's sequel skimped a tad on the scares, it was still something worth enjoying. The trilogy is  complete with V/H/S: Viral, but all the scares and fun is nowhere to be found. Six vignettes fill this latest installment, but they all look like ideas so bad and silly even Treehouse of Horror would take a pass. In it there's skateboarders taking on ghouls, and evil illusionist and something called Bonestorm. It's all way less interesting than it may sound. Be kind to yourself and don't press play.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "The Worst in Serie V/H/S  Don't waste your time on this.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "The worst of the three.  Nonsensical,  made no sense with its connection to the root plot.   At least Tales of the Darkside didn't take itself seriously....",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "Yeah, I don't know what the fuck I just watched.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "This isn't horror by a looooong shot.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "La peor pelicula de \"terror o suspenso\" del mes",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "El puntaje se lo lleva todo su segundo segmento, siendo lo más rescatable de la película. Siguen sacando colección de cortos empalmados de la peor manera, sin siquiera intentar generar algo de mediana calidad. Es como ver tres segmentos (más largos) sacados del ABC de la muerte, donde sabemos que alguien va a morir violenta o estúpidamente, y sólo esperamos que suceda y la cinta termina sin pena ni gloria. El segundo segmento merece una oportunidad, pero queda con sabor a poco por su duración.",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "I didn't hate this film, like everyone else did. However, I didn't find it all that great. The second segment was my favorite. I thought it was creepy and created an interesting and unique story. The intertwining segment was terrible and really far fetched. I did enjoy the other two segments but as a whole they didn't grab me, and they were forgettable. My least favorite of the VHS series.",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "Pretty sloppy but some of the tales actually had some potential going for them.\n\nYou can read my full review at...\n\nhttp://revronmovies.blogspot.com/2014/11/vhs-viral.html",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "There's practically none of the real horror that the first two V/H/S films had to offer. Most of the sketches here range from slightly funny (but barely) to tropey, cliched, slapstick ridiculousness thats often so bad it's not even interesting.",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "So sloppy, slow and a major disappointment as someone loves the previous movies.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Wow this movie was bad. I loved the first two and this was nothing like them....don't bother.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "all of the VHS movies SUCK!!!",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "The sad thing is I am a fan of the franchise and the first two movies, but this one was just incredibly disappointing. I spent more time fidgeting and playing with my phone than watching the movie. Nothing to catch the interest like the first two, just a bunch of random scenes that look like they were cut from the first movie as they were not up to par.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "The third installment in this fairly admired cult series, is not only the worst in the series, but maybe the worst film I've been subjected to in a year that has already seen two Adam Sandler and three Kevin Hart movies.\n\nRead the rest of my review at: http://www.examiner.com/review/v-h-s-viral-worst-film-of-the-year\n\nFollow me on Twitter @moviesmarkus",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "Lacked everything that made the first movie so great. As a huge fan of the first two, I'm beyond disappointed.",
            "review_date": "2014-11-18",
            "source": "rt"
        },
        {
            "content": "Dante the Great - D\nParallel Monsters - A\nBonestorm - D",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "If VHS 2 raises the bar for this horror anthology franchise, this film sadly lowers it down. The film here pretty much lacks any SCARES with only a decent creativity and surprises this time around comparing to its previous films. There are still some GORY scenes to enjoy here and there but nowhere as bloody as the last one and the climax is either not quite satisfying as well. Also all the segment here are quite equally decent in which most of them are nothing outstanding and memorable enough to even surpass any of the previous segments in the second film. Overall, this is still a FUN anthology horror that plays out more like an action film with interesting premise but a somewhat disappointing and forgettable outcome in the end [C+]",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "One of the best yet V/H/S trilogy so far, even the wraparound is breaking a rule for other V/H/S and it runs shorter than its predecessor. V/H/S: Viral gives us another shocking and gory shorts ever done.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "Disappointing.  None of these shorts incorporated found footage in the same manner as the first two of the series.  The wrap-around footage was confusing in this one, and the viral element felt forced.  Just do yourself a favor and only watch the second short with the parallel universe.  Pretty coocoo stuff.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "best one in the series yet.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Not as good as the last two. Wait for Netflix.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Wtf? This was trash seriously.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "An absolute disgrace. This entry will eviscerate this series' reputation as a horror gem. All of the segments except for one are terribly paced, have horrible dialogue, and are funnier than terrifying. There is no cohesive narrative to weave the shorts together and the quality behind this make one wonder whether the filmmakers threw creativity out the window in attempt for a desperate cash grab. Avoid this abomination at all costs.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Hardly a step forward from what the franchise has offered before, but it does give its audience mor einsane stories and awesome little things that common found footage films dont ussually do. A slightly lackluster ending and a significant quantity of amateur looking effects do seem to harm the overall experience a little. That and the fact that the movie is pretty darn short in comparrison to the other films, which also provided more stories and in a way, more creative fun. This is still a very clever entry in which the first story is particulary one that really grabbed me at the beggining almost making me want to give the film a 4/5 rating.",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "If not for the second short in V/H/S: Viral, I'd give this movie 0 stars.\nNote: I loved the first two.",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "I'm baffled at how this movie got such a high rating with critics. It was by far the worst movie in the series and the worst movie I've seen in a year or two",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "A mixed bag...which is a shame given how brilliant the first two compilations were.",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "The weakest installment of the three but it's not a bad film. The others were more cohesive with a better overarching story. The anthology stories themselves though were pretty interesting and held my attention. One story, for unknown reasons was cut out of the film, I would love to know why or see the story.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "This series is done....it's done, it's not getting any better. Do not see this movie, it's awful. I can't even recommend one of the segments to you, they're all bad. Acting is horrible, the stories are stupid, plot points are convenient and it's not scary.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "As an avid V/H/S fan, this wasn't worth the time. Well the Parallel Monsters was good, but the overall \"social commentary\" vibe was shit.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "god. this is a crap movie.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "The segment from Timecrimes director Nacho Vigalondo was extremely entertaining. The other vignettes were fun as well. Definitely worth a watch.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "With only a few potential moments and one good story in the compilation, V/H/S: Viral ended up being a major disappointment as a whole. Almost nothing worked  and it pained me to see this film go downhill with only a few signs of hope lingering through. Coming from a fan of the series, I only recommend the dimension portal tape as that showed the most promise. Everything else? Skip it if you can honestly.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "Found it to be a let down compared to the first two. Tried too hard to make it scary, that it just came out stupid.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Terrible ending to the horror anthology trilogy. I wasnt interested in any segment. Complete waste of time.",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "Pretty good movie. The latest installment in the bloody, stylish, and often darkly comedic franchise of \"V/H/S\" delivers plenty of blood, guts, and grotesque imagery, but it's certainly the weakest entry in the franchise. The \"main plot\" is not nearly as strong as the first two, nor does it connect to the whole watching of the VHS tapes to figure things out. Also, the editing and camerawork has degraded back to the same quality as the first, if not worse, it being choppy, shaky, and really low quality visuals for the most part. At least the second brought the series to a more digital era. This one tries that and doesn't really succeed. The other issue is that the segments are kind of all over the place, a couple of them not making sense or getting confusing at times, but they're still fairly interesting for the most part. Overall, the film is a massive disappointment, especially seeing as how the previous installment is the best, but this one still packs a gruesome punch with some interesting visuals and a couple really good segments.",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "Another good V/H/S/ film that has another unique twist that highlights the world we live in today and makes it fun and scary at the same time.",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "This is what happens when you give 3000$ to 13 year old kids and tell 'em \"go do something hip and trendy with horror elements\". Except these are professional filmmakers...\n\nEverything is awful here, from the Birdemic level special effects, to the atrocious acting, to the boring nonsensical stories, very little works here. On an anthology series, you're bound not like one or two stories or approaches but not liking any of them? Well done, that's a first. Was only mildly entertained on the segment directed by Nacho Vigalondo but even that one quickly derailed.",
            "review_date": "2014-11-06",
            "source": "rt"
        },
        {
            "content": "i have loved this series so much of the past few years, where i have VOD'ed a few times just to show my friends how much it rules.  2 was the best in my opinion, especially after learning at the last minute they cut out a whole segment from this sequel at the last minute.  i love the commentary on how this generation will do whatever they can to capture something that will propel them to fame as the basis, but the other stories aside from Bonestorm lack the true POV VHS feel that the previous 2 had.  it saddens me to review this one so low.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "What a crap. The storys, the effects, the actors, all is horrible. \nOne of the worst movies i ever seen. Dont waste your time with this please!",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Usually i'm against Franchise movies, its like throwing a ball down a fleet of stairs, it just drops in quality and ends up chasing money rather than a worthy sequel. V/H/S:Viral is one of those rare exceptions. Its just amazing with the ideas they come up with. Brilliant concepts, neatly executed. I would say its a worthy end to this disturbing franchise.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "Although I stuck around and seen all three installments of this franchise I have to say that the concept and she is way out there. It's like watching several episodes of \"tales from the crypt\" that was selected to be put into a movie with no rhyme and reason. maybe if somebody was high on drugs they might be entertained by watching this movie.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "Two good segments? I can't even remember the others. I just liked the cape and the skeletons. The main story was a real stinker too and brought the entire thing down.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "The first VHS about being low key, creepy and cool. This is seen in the way it used certain experimental film techniques in lieu of story but the effects were unique creepy, and  jarring enough to keep the viewer unsettled despite the plot or lack of. The second VHS was the best of the series as it built on the groundbreaking use of off key special effects the and added a layer of unconventional storytelling. The first VHS was a series of creepy film experiments meant to unsettle you but the less low key VHS2 was a balls to the wall horror film with brilliantly told stories and doomed characters that you could care about. VHS Viral is none of that. It's an incoherent mess that adds nothing new to the series in terms of experimenting with story or using new effects to shock the viewer and creep under your skin. It could be hundreds of other poor low budget horror anthology films and it had me actually laughing at points where I don't think I was supposed to. I'd like to see Rifftrax take this one. \nAnyway the first story is about stage magician who uses his cape to perform real magic. I was surprised with the lack of emotion displayed by people he's performed for, especially, a couple who went to the show in NY and left in LA. That whole part reminded me of Aziz Ansari' and Paul Scheer's  Illusionators sketches on Human Giant. The rest of the story was convoluted and, worst of all, not scary. It was like seeing an Are You Afraid of the Dark episode with the story told by the one kid in the Campfire Society that everyone else secretly hates.\nThe second story seemed to about invaders from another dimension. That's just a wild guess as its not in English or subtitled. I had no idea what was going, I was bored, and I did not care.\nThe third story is the strongest but I still have no clue what happened in it. It was mostly filmed on body cams placed on skate bored helmets which led to some cool shots and it involved four guys making a skate video on an abandoned area. The relationships between the skaters wasn't defined well. They seem like they know each other regularly but they don't know everybody's name. It's also unclear if there's four or five of them. Most of the time i thought four but then a fifth is guy is shown only to die immediately. It's unclear what or why anything happened here. There's allusions to shrines, occult markings, and a fight with some undead that is actually the best part of the movie. The speed,  sounds and movements of the more skeleton like undead  is spot on. They're fast and you can hear they're bones clacking together as they charge. They move very quickly in what I imagine to be realistic staggery hurky jerky way that may might be stop motion. The skeletons in that scene were the only thing here that scared me and the only thing here worth watching. If you like the first two VHS fils I'd recommend these other horror anthologies instead and avoid this.\nCreepshow \n(George A Romero and Stephen King tribute to the horror comics of the 1950s. It's a lot of fun with scares and colorful enough to come right off the pages of a comic.\n\nNight Gallery \nIt's created by Rod Serling of the Twilight Zoneand both the show and movie are great. The movie has a great story called \"Eyes\" directed by Steven Spielberg in the early phases of his career)\n\nTales from the Darkside\nEarly 90's horror anthogy spin off film from the TV series. Debbie Harry plays a witch. It's a fun film for horror buffs. A young Steve Buscemi has a central role in it too.\n\nTalez From Da Hood\nA combination of horror anthology and hood film tropes done respectfully. This could've been a joke but uses horror to bring up important themes that are then taken seriously. It does get ham fisted at times but it's  much better, much smarter, and scarier than it looks.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "I enjoy the format of these movies and how much they try to just make each segment as crazy as possible.  But this is by far the weakest of the three V/H/S films.  It's barely even recommendable for fans of the series.  The story with the guy racing around town on his bike that they keep coming back to is horrible.  The magician story is ok.  At least the stories with the skateboarders and the scientist are the kind of crazy I was hoping for.  But nowhere as fun as what I was seeing in the first two movies.",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "While the first two V/H/S films were quite scary and haunting, V/H/S 3 loses almost all sense of coherence and direction. It is quite captivating with its exciting visual effects and pure shock-value, but ultimately the movie falls into style over substance and is frankly not scary at all.",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "The first was ok the second was so so this one is meh",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "By far the weakest of the series, with the exception of \"Parallel Monsters\" none of the stories seem inventive or new. A lot of it just seems repetitive and boring.",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "This movie sucked. And I'm not the one to go as far as to write a review bit this movie was just plain horrible. save your time and your money and don't watch this.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "Esta es la tercer entrega de lo que ahora parece ser una franquicia fílmica. La primera \"V/H/S\" fue algo genial y me gustó tanto que tenía muchas expectativas con la segunda, que realmente aunque mostró potencial, no llegó a mis expectativas personales, pero, nuevamente, como la primera me gustó mucho, quise darle una oportunidad a la tercer entrega, hay franquicias donde la primera es buena, la segunda no, pero la tercera repunta. Desgraciadamente, para mi gusto personal, no fue el caso aquí. \"V/H/S: Viral\" aunque mantiene el mismo formato de ser una antología de historias cortas, cada vez se va perdiendo más el elemento de cómo el expectador es introducido a los videos. Uno entiende que la tecnología dejó atrás al formato del VHS, pero creo que inclusive la segunda entrega logró agenciárselas para explicar el porqué de los videos, que era similar a la primera, que yo no tenía problema con ello. De hecho, la segunda ahora luce un poco mejor en comparación a esta tercera, pero tampoco me engaño pensando que ahora sí es buena. No, es un mejor acabada, pero igual es una pálida producción a la par de la genialidad de la primer cinta. En esta tercer entrega, hay un par de historias bastante buenas (\"The Great Dante\" y \"Parallel Monsters\") y aunque no dan tanto miedo, son muy imaginativas y encajan en un estilo similar a \"Twilight Zone\" (Dimensión Desconocida) donde no todo daba miedo, pero sí podía generar situaciones fantásticas. El problema con \"V/H/S: Viral\" radica en la historia que intenta amarrar todo el filme (\"Vicious Circles\"), que pintaba que podía ser algo genial, pero termina siendo algo sin pies ni cabeza, ni siquiera un buen climax, y para terminar de rematar, la tercer historia (\"Bonestorm\") es algo totalmente cliché, sin imaginación y que definitivamente se trae abajo el valiente esfuerzo de las dos únicas historias aceptables en esta tercer antología. ¿Veré una cuarta cinta de esto si surge? No sé, tal vez sí, así soy de necio o esperanzado, solo lo sabré si realmente la hacen. De momento, este filme es apenas como para verlo una vez, si acaso, y si no la ven, tranquilos, no se pierden de nada.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "Much improved cohesion among all the arcs and an interesting message...but each individual short lacked the oomph brought by the second installment.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "V/H/S Viral is hit and miss just like its two predecessors, but the third in the series seems to be a bit more hit than miss. The best way to review this movie would be by the segments themselves:\n\nVICIOUS CIRCLES:\n\nThe frame narrative to V/H/S Viral makes as much sense as the frames of the previous two movies. That is, none at all. It tries to capitalize of all of the social media popularity these days (the movie has VIRAL in the title) but ends up just being lame. It goes into random subplots multiple times, and every time it makes no sense and is immediately forgotten after it happens. I don't even know why they were included. Overall, it paces the film well by cutting back to it after every tape, but it's nonsensical and anticlimactic. Vicious Circles gets 2/5 stars.\n\nDANTE THE GREAT:\n\nThe first tape (not counting the frame story) is probably the best. There's genuinely good acting most of the time and it's not overly reliable on horror cliches. It's documentary format is refreshing to the series and the plot is pretty unique unto itself. Although it sometimes really reaches for the found-footage shots to read and it's ending is a bit predictable, Dante the Great is a fun and entertaining ride with some impressive special effects. It gets 3.5/5 stars.\n\nPARALLEL MONSTERS:\n\nThe second tape starts of interestingly enough, its premise is intriguing but you know things are going to get weird because of the atmosphere, and boy does it get weird. As the tape goes on you become more and more curious to what exactly is going on until it just gets weird. Way too weird. It gets ridiculous, I can't even really describe it. Like most of the tapes in this series nothing is explained and it just kind of leaves you stunned, and i'm not sure if it's a good thing or a bad thing. You're going to have to see for yourself. I give it 3/5 stars just for being so... weird.\n\nBONESTORM:\n\nThe third tape begins really irritatingly, with a bunch of annoying skater kids just being douchy. But then, the weird skeleton people attack and it gets pretty entertaining. It makes good use of GoPros and practical blood effects, and it's really a lot of bloody fun to watch despite falling apart a bit at the end, a common thing to happen in this series. I give Bonestorm 3/5 for being a good bit of gory fun.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "While one of the shorts, \"Parallel Monsters\", is completely insane in some terrifyingly unexpected ways , it seems that the overall vision for this third entry in the series was to go bigger and try for some social commentary. The result is mostly silly and certainly not scary.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "Not terrible at all, but not as good or twisted as the first two...and a little on the silly side.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "This is the worst of the three VHS movies but it's still pretty fun to watch if you have nothing else better to do.",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "In a word: obnoxious. It would be much different if it were only a few of the film's segments, but it's literally every single one.\n\nThere's one segment that briefly rises above this movie: the segment directed Nacho Vigalondo that follows a man who has invented a doorway into an alternate reality. It has a cold, terrifying slowburn that works incredibly well thanks to Vigalondo's direction, but it quickly takes a steep dive when the actual secret of the alternate universe is revealed and the viewer is left in a state beyond wanting more. You feel betrayed by the impressive direction.\n\nEvery segment, the first and last segments being the worst offenders, all suffer from a lack of tension. It's all extremely choppy and poorly edited with unnecessary grain and added digital imperfections that just make it feel more like a poorly edited movie and less like real footage which is the primary goal of a found footage film.\n\nThis was absolutely horrendous, and keep in mind that I loved V/H/S and V/H/S/2.",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "Enjoyable entry into the franchise, most notably for Nacho Vigalondos contribution but overall good fun...",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "Being a big fan of the VHS series, I was very excited about this one. And so after watching I ended up being quite disappointing because it felt like a big let down compared to its two previous entries, but also it didn't felt that connected to the whole VHS series, but instead it reminded me a little to the ABC's of Death anthology. It's not that the stories were bad, but simply they weren't scary or that interesting, aside from two of the four stories, the better ones were \"Dante the Great\" and \"Parallel Monsters\" which the more interesting and creative ones. But aside from that the whole movie looked really nice and everything looked great, but the whole content of the stories weren't on par with the VHS series, and I also I was pretty bummed that they axed one of the shorts because it seemed interesting and promising, hopefully this isn't the last one on the series and the shorts improve for the next time.\n~October 30, 2014~",
            "review_date": "2014-10-30",
            "source": "rt"
        },
        {
            "content": "The movie lacks any real scares. The other 2 movies had good parts and at lest tried to make it believable that it was a found footage movie. This installment has none of that. I really like the other 2 movies and this one let me down.",
            "review_date": "2014-10-30",
            "source": "rt"
        },
        {
            "content": "Not bad. The frame narrative was superior to V/H/S 1 and 2, and unlike its predecessors, I can't say that I disliked any of the stories in Viral(although the first entry crosses the line a tad out of the found-footage genre). My favorite story was certainly Parallel Monsters, written and directed by Nacho Vigalondo (whose film Timecrimes is also worth checking out). I'd say if you enjoyed both or either of the first two films, you won't be disappointed with Viral.",
            "review_date": "2014-10-30",
            "source": "rt"
        },
        {
            "content": "So bad. Loved the second. Liked the first. This was a waste.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "really really bad nothing like the other two",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Fave one ever And love the scene with the teens killing the guys",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Very very disappointed by #VHSViral.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Shit sequel. Doesn't have the same feeling as the first ones.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Such a disappointment.... I really enjoyed the first two movies. They were creative, fresh and at times they totally freaked me out... This instalment fell flat... Only one of the stories had some real potential and even that completely fell apart when it revealed its \"twist\"... I was really looking forward to this movie. I can only hope that if they make a 4th one they will pull together a better group of film makers.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "I was dissatisfied with the third installment of the series it just felt incomplete storyline they couldn't tie in together the first two were so much better",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Dante:  Welcome to the show!\n\nOne certainly cannot accuse the V/H/S series of not wanting to evolve.  Each film serves as a horror anthology based around the idea of genre directors using the 'found footage' to put together some extremely messed up films, but this series has also attempted to grow its mythology and find new and wilder approaches to the short films.  The first V/H/S was marred by its long runtime and general nastiness as far as a majority of the characters, both protagonists and antagonists were concerned.  V/H/S 2 was a major step up, as it was shorter, scary, well-produced, and still very extreme.  Now we have this third feature which is a bit of mixed bag.  On the one hand, it is very well-produced and shows a lot of creativity.  On the other, a large focus on the connective tissue between the individual films really brings things down, along with the very evolution of the central conceit, which may be controversial to 'found footage purists.'\n\nread the whole review at thecodeiszeek.com",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Proof that a sequel can destroy a great franchise.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "V/H/S: Viral is easily the worst of the trilogy. The stories are hardly creative and you can tell very little thought went into them... All except a man building a parallel universe time portable that happens to be the exact same, but also the complete opposite, is uncreative and adds nothing of value to the movie. \n\nAnd I definitely don't wanna get into that ridiculous ice cream truck serial killer (bogus). \n\nBloody-Disgusting made two decent horror movies, but Viral seems to be just that. I could halfway believe the stories in V/H/S 2 and I absolutely fell in love with V/H/S, but they missed hitting the broad side of a 2 story barn with this one. I wish I could get my $10 back and just wait for a Netflix stream. \n\nI can't say much without giving it away but just save your money and your time - unless curiosity gets you like it did me.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Very disappointing to say the least. I was annoyed most of the movie with it jumping skit to skit and the constant video glitch they felt compelled to use 500 times. Just sad.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Throughly disappointing final chapter to the VHS franchise. What a shame",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "VHS Viral doesn't touch the 2nd film, the best of the series, but its segment directed by Resolution creators  and the contributions from Deadgirl creators are fun.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Every installment is a mean-spirited little treat for horror fans, and in a genre that is largely defined by inconsistency, that's a tiny little triumph in and of itself. I say SEE IT!!!",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "Disappointing. I went into this movie with high hopes since I loved the first two. It was painful to watch at points and just plain childish in others. The main plot, while interesting, lacked the substance that the other two had. The stories seemed to crawl on and none of them were anything to write home about.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "The worst and most disappointing entry in a horror series to date.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "V/H/S 2 is everything good that can come from a sequel, V/H/S: Viral is everything that is wrong with a sequel. This second sequel feels unbelievably rushed and has themes that don't even fit in with the point of the series.\n\nNow we're down to 3 stories, with one being taken out for some reason...?! Why? So we can spend more time in the wraparound story? While story 1 had a good set up and was interesting in its documentary style approach, it wasn't scary at all and it didn't even attempt to be scary, if one had to have been taken out, that's the one. They didn't even film most of it found footage style, most of it was filmed like any normal movie which takes away most of the point. It also explained a few things which seemed odd but it has the best visuals this series has seen and overall has less blood than V/H/S 2. Story 2 had a good premise and besides destroying time itself, was interesting. The story took a little long to kick into gear but when it finally did, it was appropriately creepy. Story 3 did its one thing right and had me completely confused throughout and just had me thinking, 'what?'. I didn't hate it as much as quite a few others did. However, it does end rather abruptly and does have some slow motion in it, which doesn't make sense because a camera wouldn't suddenly go into slowmo just because it looks cool but trust me, that's the least of this movies problems. \n\nAs stupid as this sounds I have a feeling the stories are an afterthought in this movie to the very forced wraparound story, or at least that's how it feels. When I heard about the 'viral' aspect of this, I thought it'd be a bunch of teens searching the Internet for a scary videos, which would make sense but when I heard what it actually was I thought it'd be teens trying to film scary things to get hits online. What we actually have is an incredibly forced message about how people are too obsessed with technology to become the next big thing and what it can do to people, so much so that the stories don't have anything to do with what's going on and just play randomly for some reason, there isn't even a VHS tape in sight. I understand they have to change the formula up somewhat in an effort to remain fresh and even though it has a point that I agree with, it could have been done a lot better but as it stands, is quite terrible. Having them look online would have been a fine change. All of the smaller stories, if you want to look deep enough, seem to have some sort of message of leaving well enough alone and just being satisfied with what you have, which at least ties them in, somehow, to what's going on. It also has some random imagery of the first two movies for some reason, probably in an attempt to try to cling to some of the genius of the first two. I don't know what's worse, having a segment taken out to spare us the pain or that it makes a short movie even shorter, not like it could really save the movie. \n\nV/H/S: Viral completely goes against the whole point of the series for no good reason. The message doesn't fit in to the series and is out of place, the stories don't fit in with what's going on and seem like an afterthought, making the whole point of the series useless and tells us what we already know. Sure, I wanted to find out what was going to happen next but it wasn't very good. Also, while at least I can say the first two movies attempted to scare the audience, this one didn't even try. The closest thing we got was being confused in the 2nd story and really confused in the 3rd. It's also annoying that story 1 began to explain itself and the others didn't and for this movie that annoyed me a little. The other two movies didn't explain that much and I was fine with that but when you start to explain in detail for some of it and don't for the others, even though I know each story is directed by someone else, it's a little jarring. Like the other movies, I will return to this at some point but will just watch the stories and skip everything else. You changed for change sake and destroyed everything you had going for you... Not angry, just disappointed. At least it's short.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "How to kill a franchise 101.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "\"V/H/S 3\" is a disappointment regarding this predecessor. On the 4 shorts, only 2 are good and the principal story is very confusing despites the great intentions. But it's still better than any other found-footage, playing with the genre and trying to do something else.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "Weak ending to the V/H/S/ trilogy.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "The weakest of the three anthology films thus far--although the DVD/Blu-Ray Release promises new revelations--V/H/S Viral features a problematic frame narrative, a seriously flawed story, and only one truly great story.  The first story in the film sets a lame tone, the second one is phenomenal, and the third one is decent, but the vast alterations in quality and the thoroughly crappy frame story make the film seem less cohesive than its forebears.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Parallel Monsters was good. But what the heck happened with everything else?",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Overall a disappointment and a letdown from the first two. The only part I recommend watching is the second story (the one in Spanish), which is exceptionally good and one of the best segments of all three VHS films.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "With more of the same, this anthology horror film doesn't offer chilling moments like its predecessors. It tries to be original but fails.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "V/H/S: Viral is a big disappointment. It's definitely inferior to V/H/S 2 which I loved. It's follows the same formula of the first 2 movies but this installment  felt watered down with cheesy special effects and short run time. Don't get me wrong it's not a bad movie, just not as great as the 1st 2 and it had it's positives. There was a great story of skateboarders going to Mexico to skate and all of a sudden all hell breaks loose. This was highly entertaining and creepy, this was my favorite story out of the 3 showcased.  V/H/S 3 is worth seeing but not as great as the others were.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Not sure what to say this one proabbly the worst of the franchise",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Trading in scares for variety and gore, VHS Viral fails to deliver on its vignettes (aside from a superb outing from Nacho Vigalondo) or its encompassing wrap-around story. VHS and it's sequel set up a standard of excellence in modern horror that it's third counterpart frankly did not achieve.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "I really enjoyed the first two but this is just a bunch of nonsense, really awful.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "V/H/S and V/H/S 2 didn't seem bothered by nudity at all, whereas V/H/S Viral is perfectly fine teasing audiences but freezes in terror at the thought of showing one single breast (Oh wait, I forgot, V/H/S Viral happily shows us a full frontal of a granny. Doesn't that make you feel a bit better? Yeah, me neither). While this isn't a major problem, it does show how the attitude of the V/H/S films have changed. The first two V/H/S films prided themselves on their edgy, dark, intense, grungy style of filmmaking. V/H/S and V/H/S 2 wanted to try to push the envelope, and they both succeeded pretty well. V/H/S Viral however, seems to want to play it safe. It almost feels like the filmmakers have no new ideas, are out of inspiration and are unsure what to do this time around. V/H/S Viral is completely disappointing. It has a pathetically low number of shorts (four in total if you count the overarching story), and none of them are scary, thrilling, or all that exciting. I honestly think that the filmmakers should have waited until they had more material to work with, or some real inspiration or ideas. As it is, V/H/S Viral is dull, tepid and uninteresting. It lacks the thrill, excitement, and scares of the first two films. V/H/S Viral leaves me with some serious questions as to the quality of any further V/H/S films and the future of the V/H/S franchise. This was a fun and exciting experiment while it lasted, but maybe it's time to put the video camera away and give it a rest?",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "So much hype, so much disappointment. Again.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "i was so disappointed in this movie! The let down after watching 2 pretty decent movies to start the franchise this my ultimately kill the franchise!",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "Found It A Lil To Comical But Still Worth A Watch!",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "The poorest of the VHS movies. Except for the Parallel monsters segment.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "A step back for the V/H/S films.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "As a big fan of the previous V/H/S movies, I have to say this is a big f***in letdown on a colossal scale. You can tell none of these amateur directors knew what the hell they were doing or knew why the last couple films worked. The first segment had a seemingly good idea, a murderous magician looked good on paper, but from the very first scene it just went downhill fast. It was pretty much laughable how awful it was executed. The parallel dimension segment had some promise for the most part, but once you get to the end, it's fails miserably. The skater segment was somewhat decent but the kids that you follow are so damn annoying and horrible at getting a legit reaction, you want them to die. The wrap around segment was so forgetful and stupid how it wants to tie in the previous films, that you want this movie to be over fast. It makes the weaker segments from V/H/S 1 & 2 look like masterpieces. Skip this awful attempt at horror.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "It is a safe assumption to say that the V/H/S films have become modern day cult classics for horror fans, particularly those with a taste for found-footage. Viral is now the third installation in the VHS anthology series, during which characters have been known to watch horrific, violent, and supernatural events that have been previously recorded.\n\nThe first V/H/S film caught the attention of many indie horror fans, myself included, due to its original manner of plot progression. Yes, found-footage horror is a dime a dozen these days, but the first V/H/S installment managed to stand out due to its outlandishly frightening storytelling and the ever-expected gore one can expect from an indie horror release. For the most part, both V/H/S and V/H/S: 2 delivered the darkly sinister and haunting stories horror fans have yearned for. The first film presented the terrorisms of a succubus, serial killers, supernatural forces, and satanic rituals. V/H/S: 2 also recounted similarly grisly events, such as violent ghost hauntings, zombies, the practices of a satanic cult in Indonesia, and alien abductions. \n\nIn a nutshell, the previous V/H/S installments have all borrowed concepts common in the horror genre and added their own abhorrence and originality to the stories being portrayed, each with its own validation for the footage recording of each event. However, the previous two films have done something that V/H/S: Viral failed to do completely: include actual V/H/S tapes. Both parts one and two involve an individual searching through V/H/S tapes for answers. In the first installment, it was the search for a snuff film worth a lot of money. In the second film, it was the search for answers after the disappearance of a loved one. This is what has allowed the V/H/S films to function as an anthology series-the fact that we are experiencing the terror of a grainy video simultaneously with the protagonist of the film. There is always a core plot the film returns to after its bloodcurdling segments, and therein lies the fault in V/H/S: Viral. \n\nViral has no concern for explaining why exactly we are watching segments of V/H/S tapes, or rather, how they ended up as a compilation on the same tape we are watching. It is assumed that the anthological installments of the film were previously recorded on the tape, while the introductory plot of the film is told between the three main segments. Furthermore, Viral's three segments are recorded in a fashion much more electronically advanced than those of the previous films, such as the use of documentary storytelling, camera headsets on helmets, and even aerial shots from helicopters. While the continuity and explanation of the film is shaky, to put it mildly, V/H/S: Viral still manages to be a chilling and highly entertaining experience, delving into black comedy and surrealism that is much more original than the plots used in the previous installments. \n\nThe film begins with an enthusiastic man who cannot keep his camera off his voluptuous girlfriend as they return to his hometown for vacation. It is not long before night falls and he becomes aware of a car chase that is headed straight toward his home. In hopes of getting good footage to \"go viral,\" our protagonist decides to follow the car chase on bike, leading to the abduction of his girlfriend by a suspicious ice cream truck that initiated the car chase. It is then that the grainy V/H/S tape goes into white noise and we are introduced to the first segment in Viral's anthology, \"Dante the Great.\"\n\n\"Dante the Great\" is told in a documentary-like fashion with the overall plot occurring in real time. It follows the account of Scarlett, a young woman working as a magician's assistant who made a disturbing discovery involving the manner in which Dante the Great \"performs\" his magic tricks. We are informed that Dante was arrested for the murder of several of his assistants, with a resoundingly haunting method of murder. \"Dante the Great\" is a supernatural tale of magic and deceit, filled with gorgeous cinematography, gore, and hilariously compelling plot development. It is easily the most enjoyable of the segments, although its much more black comedy than it is horror.\n\nThe second segment, \"Parallel Monsters,\" is the strangest and most difficult to decipher from the three parts of the anthology. It is a Spanish piece that tells the tale of a man who is successful in creating a portal to an alternate universe. As he peers through the portal, he sees himself, and timidly talks to his alternate self to see if their universes are alike. Both are in complete awe and agree to trade places for 15 minutes in each other's universes. Due to the shock value and possible spoilers for this segment, I will no longer discuss it, but let's just say the thrills and bloodshed come quickly in this fast-paced thrill ride through alternate universes.\n\nThe final segment, \"Bonestorm,\" is a fitting end to the anthology before Viral returns to its core storyline. It is both captivatingly humorous and monstrously unnerving that it is near impossible to keep track of how to feel throughout the segment. We follow a group of teenage skaters with headpiece cameras attached to their helmets, hoping to catch their stunts on video. Due to a lack of adequate skating areas, the boys decide to travel to Tijuana where they believe there is a superb area to film themselves skateboarding. Upon arriving at said destination, they find a disheveled woman whispering about blood and the unleashing of a creature. The boys ignore her and silly banter ensues as they find their supreme skate destination, hardly giving a second thought to the giant pentagram drawn onto the cement floor. Chanting figures with horrific make-up and cloaks soon surround the boys, and the segment plays out like a contemporary homage to the original Evil Dead trilogy by being equally gory and engagingly funny.\n\nUltimately, V/H/S: Viral is a highly entertaining horror flick that is more comedic and original in plotlines than its predecessors. However, that is not to say it is without its faults. The core storyline that is told between segments is one the film's failures, never living up to the expectation of terror promised by the ice cream truck kidnappings. The film's finale makes hardly any sense and is easily Viral's largest failure. Its lack of cohesive structure makes the film feel poorly executed and incomplete, which is a disappointment after such a strangely enjoyable experience. Overall, V/H/S: Viral is a film for horror buffs in the mood for a change in atmospheric intensity and storytelling. For better or worse, that is exactly what is provided.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "The black sheep of the series that abandons it's roots and tries to be something different, but ultimately becomes a shell of what it's supposed to be and ends up not being a true V/H/S film at all. The wrap-around story this time makes no damn sense and is truly awful with seizure-inducing camera-work and pointless situations. There is a message in the film about our culture being obsessed with making viral videos, but it goes nowhere and is really half-assed! The first segment is good fun (though it doesn't really count as found-footage) and the second segment is fittingly bonkers, but they're as good as it gets and neither feel like a true segment of these anthologies. The third segment was TERRIBLE and went on way longer than it should have, with an abrupt non-ending that really pissed me off. There was supposed to be a fourth segment, but it was removed for being \"not up to quality\", which makes me wonder how bad it must've been if it wasn't fit for THIS lot. A real disappointment as this was neither scary nor competent and I don't get how they dropped the ball so badly.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "Didn't hold my interest like the previous films. The interlocking story made sense why the tales were being shown. Here they just appeared. The tales gradually got less interesting as the film went on. The magician story was pretty cool",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "VIRAL is the third movie in the V/H/S franchise, it isn't nearly as creepy or messed up as the first two movies, I'm not sure what happened, a new director by the looks of it and new writers, the magician story was no hell at all, which only left 2 other short stories which were mediocre at best. Overall the first 2 movies are more effective in every way, The second V/H/S is still my favorite one though!! I do wish this movie was longer too, by the time you really get into it, it's over! Unfortunately this one is my least favorite out of the 3.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "A cheaply made, uninspired, and incoherent ending to a once-promising series, VHS: Viral is so bad, it could make for a solid case of ending the found-footage horror genre once and for all",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "The Verdict for is movie is Good movie? Yes. Good V/H/S movie? I am not sure. It's something completely different. It isn't horror it's weird founded footage satire horror dark comedy. But i enjoy it. Having said that, there is a lot of action in those short movies and there will as with the previous installments be ones you like and some you don't. You don't have to have seen the previous movies, which is the nature of the VHS (though we are far removed from those cassettes now) series. A nice addition to the \"franchise\" (I think it can be called that now)",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "As a fan of the series I as adamant that i needed to see this movie as soon as I could. However Viral really did Disappoint me, The stories seemed rushed and confusing, and the main overall story could have ended by tying all the loose ends together when in fact it opened more questions that we don't need. Its a film to watch with friends if you are bored and contains some jump scares throughout however as a big fan of the series i was saddened by this sequel , maybe its time to stop with VHS now and get back to DVD/Blu-ray",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "A step down for the franchise but still a pretty solid Horror flick. \"V/H/S: Viral\" is the third in a trilogy that die-hard Horror fans know about and everyone else eventually stumbles across on Netflix. The point is to be a some-what original found footage anthology with a bunch of weird and creepy stories combined around a wrap around story. This time around, there's only a mere three segments as opposed to four in \"V/H/S/2\" and five in \"V/H/S\". The first tape revolves around a magician that holds a powerful and deadly cloak that makes him nearly invincible as he becomes responsible for many local deaths. This is hands down the best short in the entire film. It's gory, clever and completely original. The second is the weakest of the three. It involves a man that travels into another dimension with a sort of time machine he creates. It was too outrageous and bizarre. This was my least favorite because it just never seemed to make a whole lot of sense and it didn't come together like I wanted. The third and final tape is about a couple of skaters that take a trip to Tijuana. They wind up skating in the middle of a cult ritual. This could've been done a lot better than it was but it had a campy/music video type feel to it that made it enjoyable. The wrap around story wasn't the greatest either and it's a bit disappointing considering how great the second film was but for the fans of the first two and those who don't mind found footage films, \"V/H/S: Viral\" is still one of the stronger Horror films of October given some of the bombs we got this Halloween season.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "Not as good as the first and second one. They could have left that wizard story out, and I think that story killed it for me.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "Le segment de Vigalondo est sans surprise le mieux accompli, le reste est  soit inabouti, soit franchement bordelique et sans grande portee. Le moins bon de la franchise.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "http://filmclassjunkies.com/2014/10/23/vhs-viral-review/",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "It was really not as good as the first two but that's not saying much either it was just ok that's all",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "I was less impressed with this one.",
            "review_date": "2014-10-20",
            "source": "rt"
        },
        {
            "content": "Following suit of its predecessors, V/H/S: VIRAL takes its great anthology premise and sloppily squashes it! This time we get one slightly entertaining segment that carelessly breaks the found-footage rules (Dante the Great), a wonderfully set up segment that ends in some ridiculous puppetry (Parallel Monsters), an able-bodied segment that quickly turns into a foul-mouthed teenagers pipe-dream (Bonestorm), and a choppy, nonsensical wrap-around to bring it all together. Not quite as disappointing as V/H/S or insulting as V/H/S 2 - somewhere in the murky middle, where franchises usually go to die.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "This is a pretty big letdown from the first two movies, as I don't think it really knew what it was supposed to be and was poorly executed (pardon the pun). The magician story was neat, but not of the style I'd expect from this series, the skater story at the end was ok, but the alternate universe one in the middle was the only saving grace as it was messed up.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "It's hard to believe that V/H/S Viral is even related to the unique, intriguing series of the shame name that showed a lot of potential for growth. Viral is instead an utterly stupid, colossus of a failure on every level.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "A big stumble for a series I have loved thus far. One good segment, one bad segment and one unfinished segment; wrapped in an ambitious but misguided framework story.",
            "review_date": "2014-09-30",
            "source": "rt"
        },
        {
            "content": "This epic conclusion to the anthology series [V/H/S (2012) & V/H/S 2 (2013)] is much more crazier & epic! I definitely enjoyed Viral MORE than I did with the previous two films. As its predecessors, V/H/S Viral is formed by three found-footage stories, tied together by yet a fourth frame story, also filmed in a found-footage fashion. (Apparently there was supposed to be one more segment, directed by Todd Lincoln, but it was never filmed or it didn't make the final cut) All the four stories have an innovative touch to them; they may start of a bit strange, but trust me you would be paralyzed with shock & awe the moment you realize where the story has lead to. Compared to the last two outings this one is actually low on horror but nonetheless creeps you out. The directors & producers behind V/H/S: Viral have made sure the V/H/S series ended its run on a high note, instead of falling under its own success like most horror franchises do! Must watch for found footage & horror fans!!",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "VHS: Viral is a disappointing and bland horror anthology film. While the film's first short is intriguing and shows potential for the film the rest of the film's shorts are poorly executed and range from bad to atrocious. Many elements of the film feel rushed and poorly directed with some abysmal camera work and narrative structure. The films last short is an embarrassment to the series and is executed so poorly and features such unlikable characters it's near impossible to sit through. A social message is implemented into the film, but hinders the film and feels forced and pretentious especially during the film's last act. With the exception of the film's first skit, every character is unlikable and poorly written to the point where any suspense or scares are non existent.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "The first time I saw it, I hated it. But with a second viewing, it's fast, entertaining fun. The three segments are great, even if the final one could've been longer. The main storyline is trash tough.",
            "review_date": "2014-09-24",
            "source": "rt"
        },
        {
            "content": "V/H/S: Viral is weak, confusing and lacks the creativity that made the first two installments such a success.",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "an absolutely inane, mind numbingly idiotic mess of a film. it's frantic, messy, I didn't know what was going on half of the time because of the choppy editing and terrible filmmaking. I really liked the first two V/H/S films but this one is a disgrace to those two. I really hated this one and couldn't wait to turn it off. the only reason this gets one star is because of the Parallel Dimension short. that was its only redeeming quality. save your time and do something better for an hour and 20 minutes.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "I was really forward to this movie, but it ended up not what I wanted it to be.\n\nV/H/S: viral is about a  big viral video in order to launch their \"careers\" instead find themselves becoming part of the latest Internet sensations - with fatal consequences. \n\nBefore I start this review I have seen the other V/H/S movies and to me I thought those films was actually really shocking but still fun to watch, and when I heard this movie was coming out I was looking forward to it, and the trailers got me excited for the film, and after seeing the film... am a bit disappointing. This is a found footage movie and you know the camera is going to be all over the place, but in this movie the camera moved around so much that I couldn't see a damn thing and that annoyed me so much, because in the other V/H/S movies the camera did move around a lot, but not to the point where it annoyed me. And the movie is not scary at all or even shocking. But the only good thing in this movie that stopped me from giving this movie 1/5, is the skateboard scene with the hooded skeletons attacking the skateboarder's, and why I like that scene is because it comes out of nowhere and that's what made the other movies so fun. Overall I was really disappointing with this film. It's the worst, but it's not good.",
            "review_date": "2014-09-18",
            "source": "rt"
        },
        {
            "content": "The most disappointing end to a trilogy of all time.",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "What a disappointment. The first VHS was a flawed yet very entertaining horror flick, the sequel was a great horror film with some very unique segments, viral on the other hand has only one legitimately good segment, which was the first. The problem with viral is that in each of the segments there's something that messes it up, the first one was very entertaining and unique, and the character of Dante the great was very entertaining, but the segment isn't very thrilling. The second one was interesting but they never explained anything, that worked in the previous films but not here. The final segment would've been ok if the characters weren't unlikable and if the short wasn't a rip off of Safe Haven from the first. So in the end its not god awful like every one says, but its pretty bad.",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "This movie isn't as good as it's predecessors but still has some brilliant moments in it. So much so, I hope for a 4th. There were a few disappointing moments throughout but there are more moments that shine bright. It's brutal, violent but has lost the sex appeal it once had.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "Not as bad as it's made out to be. I actually thoroughly enjoyed this one. Different from the other 2 but still lots of fun. Weakest of the series but that's not saying a lot as the VHS series is one of my favorite horror series ever.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "Is this was any crappier it would be a toilet on the outside of a gas station.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "Loved the last two... but this one was average for me.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "Bad. Even by the series' own slightly lower standards. Weighted down by a budget that they felt they had to use, this entry in the franchise reached way too far. Two of the three shorts, plus the through story, were far more action oriented than they should have been. That said, there is one that stands out as being particularly great. But being sandwiched between garbage bogs down the experience. This film was, frankly, embarrassing for me as an avid fan of the franchise. Breaking its own rules in favor of a more \"cinematic\" look, VHS: Viral thinks it's much better than it is, thinks it has societal commentary, and takes itself far too seriously in the wrong ways, and too lightly in other ways. All in all, I think the filmmaker's collective egos may have ended their own modest franchise. If you're a fan of the series, I recommend watching the film anyway. It's like watching the fall of Valhalla. Both grand and terrible in its  destruction.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "A messed up movie. Parallel Monsters was my favorite.  Had some nast laughs its more a black comedy horror thriller film.Not really what i thought it would be.",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "compared to the previous two films, V/H/S : Viral feels like the neglected child in a family. It's lacking the fear that the first two presented, but keeps on point with the gore and absurdity. The first two made me jump and cover my face, but this movie was much more tame, and didn't have the same scare factor.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Such a disappointment. \n\nThe film felt very cheap, and was very empty. It felt like something was missing the entire time, and in its 1 hour and 20 minute running time it actually got kind of boring. \n\nThe shorts had originality, that's true, but they all felt as if they were missing something. The first short was very original, but it wasn't scary, very campy, and WAY to short. \n\nThe second one felt as if it was supposed trying to be Safe Haven from the second one, but derailed 2/3rds of the way trough. \n\nThe third one was neat, the characters were fun. However towards the end it dragged on and felt irrational and felt extraordinarily foolish. \n\nThe underlining story was interesting, and had some new moments, but was unfurnished, and had some problems. \n\nOverall the film was a grave disappointment. The absence of Simon Barret and Adam Wingard was gravely missed.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Just awful!!  I thought the first two VHS were somewhat entertaining, but this one is just plain bad",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "An alright follow up, though the \"oomph\" and novelty is starting to wear off.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "After much white noise and other loud sounds along with annoying picture fluctuations, the individual horror segments begin. None of them are impressive. I recognize that it's part of the great horror tradition to beat a marketable name into the ground, but that doesn't make up for the disappointment. Out the three, this is the worst, it's problem lies is it's own demise, if you've seen the first two then you'll know what to expect, except this one isn't shocking nor fun to watch. Good twist at the end and the young cast are good but it lacks spice from a weak script. However, it does end an interesting trilogy but I'd stick with the bloody gory second film and the first film that shocked the shaky cam-doc genre. One need go no further than the film's first segment to grasp how little interest the latest entry in the anthology series has in generating chills from the lo-fi.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Still not a good movie, V/H/S/Viral is probably the best of the trilogy and it makes me glad the franchise is over.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Amateurish bloodbath isn't all that",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Least favorite of the trilogy. The anthology strategy was clever and it wrapped around with satisfying \"what you should expect\"  from a third installment. The route being \"viral\" takes away from what was appealing in the first two films. Mild scares and corny 80's creepshowesque  plot gave me a love/hate feeling throughout. Overall it was a fast paced, \"in your face\" creation with camera angles that were ingeniously executed to create originality at every opportunity possible, but aside from it's predecessors uses the \"shock\" factor rather than terror and gritty disturbances that made the others terrifying as it's main target of reaction. So constant, that Its clear to expect almost immediately every scene was going to include some sort of WTF moment. Which is good for some and bad for others depending on your attention span. There's definite credability for the directors taking advantage of every single frame as an opportunity for visual enthrallment, but for me ,it was overkill to the point where all else at some point lacked surprise and just turned into a \"that was cool\" mindset. Every moment became a predictable crafty output minute by minute until the final act, which made the entire film feel like they rushed areas of creativity that were overworkked at something that could've been a lot more visually pleasing and less bothersome. The foundation of the movie was glued with force feeding the audience as much eye engaging trickery as possible in 90 minutes. There is definitely going to be a biased audience on whether or not it worked in their favor. As for me, the creativity was overfed and backfired.",
            "review_date": "2014-06-19",
            "source": "rt"
        },
        {
            "content": "ruins what could have been the biggest cult horror series with the right talent but this film shows it has reached the end.\n\nD-",
            "review_date": "2014-06-02",
            "source": "rt"
        }
    ]
}