{
    "title": "Bats",
    "rating": 4.0,
    "release_date": "1999-10-22",
    "num_reviews": 273,
    "genres": [
        "Horror",
        "Sci-Fi",
        "Thriller"
    ],
    "summary": "Genetically mutated bats escape and it's up to a bat expert and the local sheriff to stop them.",
    "reviews": [
        {
            "review_title": "Nice chiller starred by flying foxes , fast-paced , and well directed by Morneau",
            "content": "Absolutely surprising carnivorous bats tale , derived from abysmal story . The film starts in Skull Valley , Arizona, where the scientific Casper (Dina Meyer) and his assistant Jimmy (Leon) are investigating about bats . They're brought by a government scientist (Bob Gunton) to a small town called Callup , in Texas . There appears a pack of carnivorous bats that prey on citizens , terrorizing the small community . The chiroptera specialist Casper , his helper , along with a policeman (Lou Diamond Phillips) attempt to stop the genetically altered flying foxes before the military comes into action , bombing the caves.This is a slam-bang chiller about flying foxes , full of scares and lots of blood and gore . It delivers the goods with suspense , tension and hair-raising chills ; plus , the astonishing special effects of this nature , as the ferocious bats seem alive . It's an eerily effective thriller , quite entertaining , though many will undoubtedly find repulsive when the bats attack and eat their victims . The tale can't bear such close scrutiny , but while this thrills ride is going, you won't mind . With a final budget of 5.25 million, the film went on to gross well over 30 million worldwide in theatrical , DVD , Digital and Television sales . Although considered somewhat unsuccessful at the time, the film recouped its entire budget during its first week of release . The vampire bats are splendidly made by means of Animatronics in charge of Robert Zurtzman , Greg Nicotero and Howard Berger . The bats in the film were a combination of Animatronics, CGI , and 2 live bats. The 2 original bats in the film were brought over from Indonesia . The acting is uneven , an attractive Dina Meyer , Lou Diamond Phillips as the patrolman who along with the scientific facing off the creepy bats and killing them in their caves . Bob Gunton is an oddball baddie acting as a mad doctor and the comic relief in charge of Leon . Interesting screenplay by John Logan , today writer for blockbusters (Aviator , Last Samurai , Star Trek : nemesis , Time machine) . Produced in just under 6 months , the picture continues to hold one of the top spots for fastest produced 35mm feature films to receive a wide-release . The motion picture was well directed by Louis Morneau , in his best movie . He's a B series director, with no much success (Hitcher 2 , Retroactive , Quake , Soldier Boyz , Carnosaur 2). With similar premise , ten years earlier (79) was shot the movie titled ¨Nightwing¨¨ directed by Arthur Hiller with Nick Mancuso , David Warner and Kathryn Harrold , but it was a flop, this one is a superior film .",
            "review_date": "2008-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very silly but fun.",
            "content": "Bats is a very generic late-'90s killer animal flick that follows most of the genre rules to the letter. All of the expected characters are present and correct—untrustworthy government scientist, brave local sheriff, doomed-to-die deputy, dedicated (and sexy) animal expert, wise-cracking sidekick—and the plot develops in an extremely predictable manner, opening with young couple alone in the dark falling victim to the bats, before introducing a whole townful of potential victims, and climaxing with our brave heroes risking their lives in a showdown against the deadly critters.It all gets very silly at times, with perhaps the most unbelievable scene being the securing and electrification of a whole school by just four people in the space of a few hours, but it still proves to be quite a bit of fun, director Louis Morneau keeping the action moving at such a swift pace that such nonsense is fairly easy to forgive (unlike the director's tendency to 'skew', stretch and blur the image during the frenzied bat attacks, which I found bloody irritating).What really helps to elevate this formulaic nonsense to slightly-above-average are the solid cast and some fairly decent special effects. Dina Meyer (of Starship Troopers fame) and Lou Diamond Phillips make for a likable protagonists, and Leon is far less objectionable as 'token comedy relief black guy' than one might expect. As for the bats, they're a mixture of more than reasonable CGI and nifty puppetry from KNB; my only gripe, FX-wise, is a lack of splatter—a bit more gore would have been very welcome.",
            "review_date": "2014-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watchable...if you view it a certain way",
            "content": "This is not a very good movie. If I had seen it at a theater, I would have felt ripped off, certainly. But at home, I watched it with an undemanding mood, and with the feeling this was a basic update of a low budget animal-attacking movie of the '70s. Seeing it that way, the movie was good enough to pass the time. No more, but I wasn't bored.Certainly, there's a lot of the movie that's dumb. Some of the puppets and computer generated effects look really bad. The black character is only there for humor, and his treatment is somewhat offensive. Lou Diamond Phillips can't act. Sometimes you can't tell what's going on with all the close-ups of flapping wings and bad editing.There are a few good things. Some of the cliches I was expecting actually didn't happen. (For one thing, the authorities are quick to the danger for once.) The cinematography is excellent, and occasionally the movie has a \"big\" feeling that makes it look more expensive that its $6.5 million budget.So if you like B movies, are feeling undemanding, and can see it cheaply or for free, you might want to give it a try.",
            "review_date": "2000-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats!",
            "content": "I really like this film Bats! Lou Diamond Phillips, Dina Meyer, Bob Gunton, and Leon stars in this picture. The movie in My opinion has non-stop Bat action! The actors especially Phillips and Meyer have very good performances. I like the way the movie is filmed. Everything is bright and I think that the camera work is awesome! The Bats are really neat and scary looking little creatures. I love the effects when they fly every where and across the moon! The music by Graeme Revell is very good. Everything else is very good in this movie. I don't know why it is currently on the IMDb bottom 100: #84. I have no clue. The film in My opinion has just about everything and the killer Bats are great! I recommend everyone who loves monster films to ignore the bad rating and comments and watch Bats today because its great film and I strongly recommend it!",
            "review_date": "2004-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Is NOT As Bad As Critics Say!",
            "content": "As usual, I find myself on the opposing side of the critics. This movie has NO BUSINESS in the bottom 100 here at IMDb! It's FAR from a masterpiece, but it's also just as far from deserving that low a rating.As is often the case, whenever you have a good monster/creature feature, lurking somewhere in the shadows is a mad scientist. Such is the case in this film. In fact, I found the mad scientist a tad too mad. I think that is the main contributor to the low ratings this movie receives here at IMDb. The \"doctor's\" performance went WAY over the top. Well, he's supposed to be insane, but he plays it like pure camp, and that's horribly out of place in this otherwise serious work concerning a lab experiment gone awry...or has it?The animated/CGI bats are well done, and all performances besides the doctor are enjoyable and on target. Unfortunately, he was bad enough to have brought down the whole film.This is fun, generates some good suspense, and isn't afraid to show you the nemesis. The story itself is quite competent to hold up, and does, IF you can ignore the wretched performance given by Bob Gunton. I must say that I do not believe it to be wholly his fault, as he has given some great performances in the past, and since. The fault must lie with the director, Louis Morneau, who has never done much of note.I like this film and can enjoy it, in spite of the doctor, and do find myself watching it from time to time.It rates a 6.8/10 from...the Fiend :.",
            "review_date": "2007-05-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple but really exciting",
            "content": "Watched this simply out of curiosity and turned out to be really good.A bat research experiment goes haywire, producing killer bats that terrorize a town in Arizona, and it's upto a local sheriff,and 2 scientists to find and eliminate all of them before they can eliminate more human lives.Its a short film, but really well shot, with good cinematography, action and thrills from start to end. The special effects are not as good as they are nowadays but nevertheless quite realistic. There is also no vulgarity which makes it suited for kids too.I wish there was a sequel.",
            "review_date": "2014-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm shocked how low this movie is rated, it's FUN",
            "content": "This is a fun, fun film that's worth having fun with it despite many of the reviews to the contrary. I enjoyed the cheesy aspect of this film, it's almsot classic watching Lou Diamond Philips shoot bats. It's in the vein of They Live and movies of fun campy nature. Don't let the low rating fool you. See it, enjoy it.",
            "review_date": "2004-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I was surprised by all the really bad ratings!",
            "content": "I have always liked these kinds of creature feature movies. They are a lot of fun and unlike Friday the 13th, Halloween, Nightmare on Elm Street etc it is clean enough that I don't mind the kids watching it. With Halloween around the corner they are already all about the scary, spooky, fun movies but the boys are only (almost) 10yrs old and finding fun stuff that doesn't have nudity and sex throughout isn't easy. We mostly have to stick to the old black and white spooky classics to avoid it. With the exception of a few things like this. Overall, a fun little watch that shouldn't be taken too seriously.",
            "review_date": "2020-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a Treasure of the DTV B-movie Creature Features of the 90's video era!!!",
            "content": "\"Bats\" was a treasure i found on the shelves of Blockbuster video way back in the 90's, a great time to be obsessed with movies like i was as there was constantly new & exciting looking movies out all the time & with Cool artwork on the covers & one that caught my eye was BATS.The case looks Awesome & the cast was great with the super stunning & beautiful DINA MEYER, who i loved from Starship Troopers, here she was with the Cool LOU DIAMOND PHILLIPS (Young Guns flicks) as the two leads in a Creature Feature about killer mutant Bats & i was sold.Although \"Bats\" is a B-movie at heart it still had a very decent budget of around 5 million & every penny is well spent in it's production. The look & setting is perfect B-movie Horror with it's All American little town that gets attacked by mutant bats, it's a great setting that felt like \"Critters\" or something & our two leads are great together with sexy Meyer as an expert/scientist type & Philips as the tough local Sheriff, a perfect old school 1950's sci-fi B-movie story just transported to the 90's.The special effects are fantastic as they use everything from practical puppets & c.g.i to real Bats & all expertly done. Great mutant bat designs.The music is exciting & there's some really thrilling set pieces such as the Town attack sequence!!! A few years later i felt the same sort of sequence of the towns full attack was very similar in another Throwback B-movie Creature Feature called \"Eight Legged Freaks\" the big budget spider movie. I love these small towns under attack from creatures films & \"Bats\" is one of my favourites, a real GEM.\"Bats\" is pure 90's Monster fun & a great late-night film & a treasure amongst the B-movies of the 90's & with two good leads.This is what the direct-to-video market was all about, good entertainment & a fun nights viewing.",
            "review_date": "2021-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I wonder if anybody can name me a film about killer bats that's better than this one...",
            "content": "\"Bats\" had its theatrical run and was widely distributed on rental VHS/DVD. Videostores carried multiple copies which got rented fluently. Yet from the looks of it - its rating on here - most people thought this was bad. Boy, have they not seen 'bad' yet. Things would get a lot worse in years to come with these type of films. For one thing, try watching the alleged sequel to \"Bats\" called \"Bats: Human Harvest\". The thing was made in 2007, for TV and then dumped to DVD as well. Go watch it; it's about 5 times worse than this film. Then come back and tell me which is the bad film out of those two. Or go watch \"Fangs\" from 2001 (starring Corbin Bernsen). It's the silly version of \"Bats\". I tell you, things can get a lot worse than this modest piece of killer bats entertainment. It even stars Lou Diamond Phillips and Dina Meyer. In 'worse' movies, you can't even count on a cast like this anymore. So why the complaints & puss-poor ratings on here?I've seen quite some crappy horror-movies already, and you can say what you want about \"Bats\", but it's not a bad movie. Clichéd? Yes, kind of. Seen it all before? Yes, most likely. But the production values are more than just okay. It's well made. It looks good. Good camera work. The acting is more decent than what you normally can expect from a movie like this these days (like stuff produced by Sci-Fi Channel, The Asylum, need I continue?). I've seen much, much worse special effects when it comes to the CGI used in this one. And there are actually some cool shots of animatronic bats to be admired (from puppets with full body movement to close-ups of their heads with moving ears, grinning teeth and blinking eyes - it's always a kick to see SFX artists go the extra mile on this). The film's fairly fast-paced, keeps you going and never gets boring. It's basically a B-movie that looks damn good, sort of like stuff similar to \"Tremors\" (a fine early 90's monster movie classic) and its sequels. Or if you bump down the ladder a bit, you'll find a lot more (lower budgeted) genre outings telling pretty much the same story (\"Skeeter\" from 1993 comes to mind).Of course \"Tremors\" works better on a variety of levels and \"Bats\" isn't as great by a long shot. For one thing, it misses some wit, and that black guy (Leon playing Jimmy Sands) trying to provide it didn't do a lot of good either. Still, a fun popcorn-movie for the somewhat less demanding horror-fan. If you have this feeling that genetically altered killer bats might amuse you, then ignore the low rating on here and just watch it.Now, can someone recommend me a better movie with a whole bunch of killer bats in it?",
            "review_date": "2010-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Meanwhile Back In The Bat Cave",
            "content": "Bats, a film that should have premiered on the Science Fiction channel on cable, somehow got a theatrical release. If it had been made fifty years earlier I can definitely see Boris Karloff or Bela Lugosi in the part that Bob Gunton plays as the mad scientist.The scariest thing about Bats is not the creatures themselves although they are the ugliest looking things this side of the Black Scorpion. The scariest part of the film was Bob Gunton's portrayal of the mad scientist who created this race of killer omnivirous Bats. He's identified as working for the Center For Disease Control. I was watching this figuring out how this creep got government clearance.Yet Gunton is the most enjoyable thing in this film. And you got to love the fact that he had all these government facilities to work with, he's not hidden away in some laboratory in an old castle the way Karloff and Lugosi used to be. He's bred this race of flying fox bats from Indonesia which are aggressive to begin with and they've taken up residence in a bat cavern in Lou Diamond Phillips's county where he's the sheriff. After several suspicious deaths with mutilation, the cause is identified and zoologists Dina Meyer and Leon Robinson are brought in to clean out the bat cave. If you care about how and if they do it by all means watch the film and the hint is, think blob.Bats will never go down as a great science fiction classic, but it does have a certain campiness to it. And Gunton is a hoot.",
            "review_date": "2008-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What's the Problem?",
            "content": "What is all the commotion about with regard to this movie?  So many people seem genuinely ticked off at it....and I am just curious about their expectations before seeing it.  My expectations were realistic...meaning I didn't expect much, nor was I disappointed in my expectations.  This film is bad, yet in a way fairly entertaining.  Like many films of its ilk it is not trying to be taken too seriously.  We can tell this by the compact acting styles, the huge loopholes in plot, and the horrendous dialogue.  None of the actors are particularly good.  The CGI effects are dismal, and when the bats attack close-up one cannot see anything in the blurred action. Watching it I almost felt it looked a bit like Gremlins, only to be taken seriously and without the professionalism of all concerned in that film.  On the other hand, there are many ways your time could be used less effectively...personally I like watching bad movies....especially a bad movie you can sit through and not be bored out of your mind with.  Bats is just that ...a bad movie you can sit through.",
            "review_date": "2000-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Help!\u0085Save us, Batman!!",
            "content": "\"Bats\" is not so much a 'bad' film; it's just very ordinary and déjà-vu. This is your typical creature-feature about a genetically mutated animal-species (in this case: bats, duh!) that becomes a little TOO intelligent after the experiments performed on them and turns against the creators. And of course the two escaped lab-bats infect the normal ones and pretty soon an entire Texas town is overcome by millions of carnivorous bats! It's up to zoologist Dina Meyer, her dim assistant Leon and sheriff Lou Diamond Phillips to prevent that this plague spreads itself throughout the entire United States. This film has quite a few good aspects going for it, but also too many negative ones and the latter make this is a generally unmemorable and lacking horror film. The most important positive element about \"Bats\" is that the screenplay doesn't waste any time! There clearly is a bat-problem and all the characters immediately acknowledge this. Usually in this type of B-movies, it takes another boring hour or so before everyone accepts that harmless little animals can turn into bloodthirsty monsters. Unfortunately, this is where the praising stops\u0085After the no-nonsense opening sequences, the film turns into an endless series of dull clichés, lousy dialogues, bad acting and terrible special effects. In fact, there are no special effects! The numerous bat-attacks exist of wide pan-shots of the sky but when the critters eventually descend to assault their preys, everything becomes all blurry and you can't possibly make out what's happening. It's hard to take the acting leads seriously (Dina Meyer as a Doctor??) and Leon's character is just a dreadful stereotype of the petrified and witty assistant who brings some comic relief. Worth watching if you really don't have anything better to do",
            "review_date": "2005-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A rather decent entry",
            "content": "Hearing of a series of bat attacks, a scientist and her helper arrive in a small Texas town to deal with the creatures only to learn they're genetically modified killing machines and must find a way of dealing with the creatures once and for all before they escape.There are some pretty good points in this one. What's really enjoyable about this one a lot of great moments is the high-amount of action scenes within this one with a really fast and quite watchable pace to it. The opening attack, where the bats appear to attack the couple in the truck makes for a strong opening while a follow-up encounter where the bats swarm over a truck containing several characters when a second one comes up and they suddenly become aware of the new vehicle and come to an abrupt stop, then turn their heads towards the car so that their eyes light up a malevolent yellow which is one of the best shots. The main sequence in the middle of the movie where a large swarm of bats attacks the middle of town, causing general panic and mayhem also this helps out as the large amount of action including causing cars crashing into electrical poles, gets in tons of small individual encounters of the population getting swarmed allowing for a lot of great action and gore while the fact that it plays out over a long period of time is quite nice. As well, there's the later attack on the school as there's some solid swarming and ambushes there which makes for a fun time, and the finale in the tunnel makes for some atmospheric times with some rather frantic and enjoyable times trying to get out before they wake up which is what's quite thrilling about the sequence while providing a lot of fun action-packed moments here. It's also a little refreshing to see everybody agreeing that the problem is bats right from the start rather than having the clichéd extended argument among people who had clear evidence that it was bats and someone like the chief cop constantly butt heads over what the culprit is until it had a physical attack done in front of everyone to convince them is a nice change of pace. The last plus here is that the bats are actually pretty good, and they're really believable by abandoning the CGI commonly used for these types of films since the puppets look pretty realistic, and their close-ups make them out to be pretty terrifying to a degree. This is a lot better than it's been made out to be although it does have some problems. The biggest one here is that there are several confusing shots in this. Every time there was some sort of dramatic bat attack, the camera would go off on some sort of hyped-up whirlwind of herky-jerky motion that keeps it from being scary as the attack scenes become moot because we don't even get to see what's going on in the scene the cuts are so quick. The film provides in spades, since you often can't tell what is happening on screen and making the technique even more obnoxious is that it's used pretty much throughout the entire film. The origin of the bats is also a little confusing. All we know is that bats are attacking while how they're attacking and what exactly is happening remains a mystery. These bring the film down slightly from what it could've been.Rated PG-13: Violence, Adult Language and photographic violence of animals.",
            "review_date": "2016-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not bad, not bad at all (8/10)",
            "content": "I really liked this movie. Of course, if you're cynical, you might be better off not going to see this. Just stick with whatever movie you saw a long time ago that you think is better than everything now a days. On the other hand, if you really like movies for what they are, you'll probably have fun watching this movie. Everybody in the audience I was in seemed to have a great time watching this as did I. The dialogue was funny and not ALL that predictable. The acting was not bad, it was actually pretty good. I really liked Dina Meyer in this (although she looked better with curly hair). Anyways, this movie will be liked by kids and anyone who goes to the movies as a form ENTERTAINMENT. I'll probably see this once more and get it when it comes out on DVD. Don't let ME influence you, though. You should always make up your own mind. (8/10).",
            "review_date": "1999-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm in the minority here.........but I LOVED this movie!",
            "content": "Everything a popcorn/horror movie should be, and more!! I was pleasantly surprised at how well-made this little shocker was, and to me it delivered all the goods. I thought the effects were a heck of a lot better than \"Nightwing\", and after sitting through the god-awful \"The Roost\", this looks like an Oscar contender!! I thought the story served the effects well, and most were rather convincing, and the film had the charm reminiscent of older horror films from the 50's. Sure, it's not \"Titatic\", or \"Gone With The Wind\", but what were you expecting with a movie called \"Bats\"? Thoroughly entertaining in every respect, and certainly a few surprises here and there----perfect popcorn fodder for a rainy, dark night. Again, I know I'm in the minority here, but honestly it's a pretty good little film, and does exactly what the title says.",
            "review_date": "2007-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's Creepy",
            "content": "This is NOT a bad movie and it follows the novel it was based on pretty well.  I enjoyed it. I even bought it on DVD.  Don't expect Minority Report here. This is simply B-Movie Fun. Lou Diamond Phillips is fine in his role as the local law. The guano jokes abound. And like someone said...there's even a mad scientist!!!",
            "review_date": "2002-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This was a nice surprise and for a low budget film this was actually Good.",
            "content": "I Liked this Film and I don't get the hate for the film I found it very entertaining and engaging and I thought the special effects were good. People say the film is not scary well what do you expect from a film about killer bats?. The film may not be scary but it was entertaining which is the whole reason we watch movies isn't it?. This film had a lot of exciting scenes in it. The film was well directed and well made and I liked the main three characters played by Lou diamond Phillips Dina Meyer and Leon. That's another thing I liked about this film there were actually (likeable characters) and most horror films don't have those but this did. I actually cared about what happened to these characters and I wanted them to Live. I found Leon funny and he gave good lines of dialogue and he was fun to watch. That's another thing that makes this film work,the cast was good. Lou diamond Phillips was also fun to watch and I found him to be a cool character and he played his role of the sheriff well. I also thought the acting from the three main people was Okay. I thought there were a lot of well done attack sequences especially the one at the start of the film which I thought was very bloody and brutal,I also thought the scene was shot well and the bats looked cool. There were some well shot scenes in the film one that I liked is when two of our main characters are trapped inside a car and a swarm of bats completely cover the car,they cover it so much you can barely see it anymore and I thought that was a bizarre but interesting scene. There were scenes where dozens of people were getting attacked in the street and there were bats flying around everywhere in and out of shops,people were getting attacked in restaurants and things were getting blown up and there was non stop Action. I'm surprised most people don't like this film because I thought it was Action packed!. I also liked how our main three characters worked together to try and stop the bats and they set traps for the bats. I especially liked the scene were Leon burns a bunch of bats with a flamethrower I thought that was a very Fun scene. That's why I'm giving praise to this film because it was low budget and they used the budget well and they were still able to create a lot of exciting action scenes and Fun moments. This has a lot of Action for a low budget film,and I found the story interesting. The film also has a very exciting and intense Finale that had me on the edge of my seat. This film was fun and fast paced and I recommend the film.",
            "review_date": "2015-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Will give American Beauty and Green Mile a run for the Oscars",
            "content": "I think the Oscar race just got a little tighter when Bats was released into the market.  This is clearly one of the best films that has come out this year.  You can forget about the cynicism of American Beauty, the brilliance of Fight Club, the ingenuity of Three Kings and the mania that is Sixth Sense, Bats is set to go down as one of the greats up there with Jaws, Patton, Rocky, Annie Hall and Amadeus.  I think future generations of Hollywood directors and writers are going to turn to BATS to see how it is done.  John Carpenter's Halloween and Spielberg's Jaws used to be the bench mark when it came to horror, but this has put a whole new perspective into how to scare someone at the theater.  When I left the theater my knuckles were a ghostly white from gripping the arm rests and when I looked on the ghastly faces of the hundreds of people leaving the theater, they all had the same expression.  They were frightened.  The show ended at about midnight and we were all anxious to get into our cars because we were afraid those cunning bats were waiting to get us, right outside the theater.  Now that is good film making.  Jaws made me afraid of the ocean, I think Bats is going to make me afraid of the night sky.  I have never seen bats that look this real in a movie.  Those fangs were so real looking that most of the budget must have gone into the production of those intricately designed bats.  Fangs, eyes, and even their hissing sounds were realistic.  What a fantastic film.  If this isn't nominated at Oscar time for best picture and director, then I would say that something is up with the academy.  I am still in awe and utter fear as I sit here and write this review of Bats. This is one of the scariest films that I have ever seen. WOW!!!Okay, I just had to do it.  I had to.Bats is really one of the worst films to come out this year.  But this is a film that is so easy to rip on that I thought it would be fun to do the exact opposite and just confuse the hell out of the readers for a minute or so.  The only award this may be winning this year is the Raspberry awards. But you know what?  Going into this film, I was expecting a really, really, really bad film.  I only got a bad one, so that was unexpected and a nice surprise.  I think I, like most other horror movie nuts enjoy a good \"bad\" horror flick at times.  There is just something about cheese that is fun at times.  And for that reason, Bats delivers.  Everything you have heard about the film is true.  It is all bad.  The bats are laughable, the story is a joke and the writing is awful, even the commercials looked pretty bad.  But there is one good thing going for it, and that is that it had a subtle homage to Jaws in it.  The guy that first gets killed at the beginning is named \"Quint\" and when they do an autopsy on him, it wreaked of Hoopers little angry deposition in Jaws when he tells them that it wasn't a boating accident.  And if you can pick up on little subtleties like that then the film is more fun.  Really, this isn't all that bad, I mean it is bad, but there are really worse out there.  Have you ever seen Truth Or Dare?  I mean the movie where mental patients get a hold of a grenade and blow their own heads off?  Well that is really bad, I mean really, really bad.  And as I said, this is just bad.  But I saw it in an empty theater during the day. Seriously, there was just me and a friend.  And at AMC in Toronto, they have retractable arm rests so that you can put them back and use the seats as a couch, which is what we did.  It was very comfortable and we enjoyed the movie quite a bit more that way.  Bats will probably be gone by the time this review gets to IMDb so you may not have a chance to see it at the theater, but if you are in a campy horror movie mood, then rent this when it comes out on video.  You may enjoy it.  I hope you didn't take my accolades too seriously at the beginning of the film, it was all in good fun.  And remember, sometimes bad movies can be fun to see.  You don't have to think, you don't really have to feel either.  And you get to laugh at stupid people doing stupid things.  Bats is a great example of that.  If Bats is even ever mentioned in the same sentence as American Beauty come Oscar time, there will be a federal inquiry and Mr. Logan and the backers of this movie may go to a maximum state prison and his punishment would be to watch this movie every day of his sentence.  Now that would be funny.",
            "review_date": "1999-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Poor Bob Gunton. He deserves better.",
            "content": "After revisiting this 1990s update of the classic \"nature strikes back\" genre of the 1970s, this viewer can say that he has warmed up to it a bit. It's of absolutely no real distinction, but adequate directing and acceptable acting manage to overcome a VERY routine script. An unending multitude of killer bats (that have been genetically engineered, naturally) are unleashed on a sleepy Texas burg. Among our heroes are a laid back sheriff (Lou Diamond Phillips), a bat expert (Dina Meyer), and her assistant (Leon).The script by John Logan is stupid and clichéd, and unfortunately treats the assistant character as a comedy relief stereotype. It's also kind of hard to feel sorry for the many townspeople in the movies' big set piece when they prove too dumb to get the Hell out of Dodge. The execution does manage to make this reasonably entertaining, with a fair bit of intense action and some moderate suspense. The effects, unfortunately, are mostly pretty poor. The puppets are not the best work that KNB has ever done, and the digital FX are purely laughable. At the very least, there's some pleasing widescreen photography and scenic locations. Some horror fans may also be pleased with the fairly high body count.Phillips is likable in the hero role; he's at least more convincing here as a cop than he was in \"The First Power\". The real standout is the lovely Meyer: not only is she excellent eye candy, but her character is very smart, very strong, and very capable. Leon is wasted in his role. That brings us to the matter of Bob Gunton, a superb veteran character actor who has one of the most embarrassing roles of his career. Cast as the requisite mad scientist, you'll likely be left shaking your head at the flimsiness of his motivation.NOT an altogether bad movie, but also far from being a good one. Fortunately, it's relatively short.Five out of 10.",
            "review_date": "2015-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"I don't know about the rest of you but I don't like anything climbing higher up the food chain than me, period.\" Sort of OK in a rubbish way.",
            "content": "Bats starts late one night in 'Gallup, Texas' where a young couple Quint (Tim Whitaker) & Emma (Juliana Johnson) are waiting at a level crossing for a train to pass, however as they wait they are attacked by bats & killed. Cut to 'Skull Valley, Arizona' & Dr. Sheila Casper (Dina Meyer) is the foremost expert in her field, the field of bats. So it comes as no surprise that sinister Government black suit wearing official Dr. Tobe Hodge (Carlos Jacott) asks for her help & expertise. Together with her assistant Jimmy (Leon) Dr. Casper is flown to the small Texas town of Gallup where Sheriff Emmett Kimsey (Lou Diamond Phillips) is trying to work out what happened to Quint & Emma, step in Hodge & genetic scientist Dr. Alexander MaCabe (Bob Gunton) who explain that they have created a new sort of bat, they have taken an ordinary Flying Fox & genetically enhanced it so they are more intelligent, stronger, bigger, work together & are totally hostile to any other living creature, oh & they also carry a viral disease which would infect other bats & turn them into vicious killing machines too. Even though they don't like it Dr. Casper & Sheriff Kinsey decide to help in order to save the town, however it soon become apparent that it won't be as easy as they first thought & it's not long before the entire town of Gallup is under attack from the winged killers...Directed by Louis Morneau I thought Bats was an OK film in a brain-dead rubbishy sort of way, it isn't going to win any awards but for what it was I quite liked it (emphasis on the word 'quite'). The script by John Logan moves along at a nice pace & is never really boring or overly dull but is stuffed with loads of horror film clichés, the stuffy female scientist who starts to loosen up & become romantically involved with the brave hero, the annoying obligatory black comic relief character, the evil scientist who cares for nothing but his experiments & is finally killed by them, the shady Government figure, the heavy-handed military who are all gung-ho & cause almost as many problem's as the bats themselves, the disbelieving (at first) local townspeople & the isolated location. It's all here folks but it's done in a reasonably entertaining way that passes an hour and a half painlessly enough I suppose. The film lacks any real violence or gore, apart from an autopsy scene at the start Bats doesn't have enough of the red stuff. The climax where a swarm of bats are chasing our heroes through some mine shafts is fairly decent & manages to create some excitement although I'm not sure two human beings could outrun 1000's of genetically enhanced (bigger, better & badder than your average bat) bats in a straight race...Director Morneau keeps things moving along, doesn't spend too much time on silly unnecessary character development & doesn't seem to take it all too seriously. However the bat attacks are annoyingly edited, loads of ultra quick cuts, so much so that it becomes confusing as to whats happening. Don't expect to see much during these scenes as it really does become a bit of a blur, maybe they are presented this way to hide the special effects up? The bats themselves look pretty cool although it's obvious their puppets.With a supposed budget of about $6,500,000 Bats looks OK & is generally well made but that sounds like a lot of money considering what ended up on screen. The photography, music & production values are good if not spectacular while the special effects alternate between CGI & rubber puppets, both of which have their fair share of effects that work & effects that don't. The acting was OK but no one stands out except the token black comedy relief guy Leon who becomes highly irritating.Bats isn't the best horror film ever made that's for sure, but it's far from the worst either. On a dumb predictable sort of level I thought it was watchable, worth a watch for horror fans but others may find it all rather silly & stupid.",
            "review_date": "2005-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "CGI creatures in an overly familiar monster flick",
            "content": "Twenty years after Hollywood made NIGHTWING they decided to tackle the subject of killer bats once again with results that turn out to be less than inspired.It's not that BATS is a particularly bad film; it isn't. It ticks all of the boxes and runs through the scenarios with a modicum of energy and drive. The problem is, as with most Hollywood films made recently, a series lack of originality or indeed intelligence. BATS turns out to be cheesy and predictable in equal measures, delivering up its threat of genetically-modified bats without much in the way of passion or intrigue.The plot follows the likes of THE BIRDS and other classics fairly closely. Moments between the set-pieces are dull, while the bat attacks are spoiled by some average CGI effects work (Hitchcock's superimposed birds are still superior to the creatures here). In close up, the rubbery menaces are about as realistic as the bats in Hammer's SCARS OF Dracula; not Greg Nicotero's finest moment, that's for sure.Cast-wise, it's pretty lacklustre. Lou Diamond Phillips goes through the motions and STARSHIP TROOPERS' Dina Meyer displays a singular lack of presence. Leon's character reveals everything that's wrong with Hollywood's reliance on the clichéd \"funny black guy\" in otherwise straight films. All in all a largely forgettable movie that disappeared as quickly as it arrived; go back to Hitchcock for a decent winged-menace movie.",
            "review_date": "2011-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Killer mutant bats......an interesting thought",
            "content": "STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsThe deformed night animals in Bats are interesting to look at.They're no cheat on what was anticipated.So why the film never seems to exploit any of the opportunities to close in on them any further than they do only further adds to it's hinderances.The whole concept of the film is quite intriguing ,the cover alone proves enough to lure in ,with an original tagline like 'Where Do You Hide?',but as the film progresses,the characters become less interesting,and it goes quite over the top with the milatary and the air force getting involved.Ultimately,this is the sort of thing they should leave Stephen King to do.**",
            "review_date": "2000-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Treats Its Audience Like Idiots",
            "content": "Horror is a very poorly regarded genre and you'll notice that the IMDb top 250 movies has a lack of horror movies in the list . Hardly surprising since much of these plots revolve around characters doing stupid things . As soon as someone says \" Don't go into the woods at night \" you know fine well what will happen . It's always puzzled me why the heroes go to Castle Dracula at midnight to kill the vampire when their task would have been much simpler if they'd waited till day break . BATS continues this type of trend but what makes it worse is the way it treats its audience like total idiots Take the heroine Dr Sheila Caspar whose employed by a government agency because she's the world's most renowned expert on bats . The thing is that she can't be a day over 25 ! How long did she spend at university studying bats ? Two minutes ? It's a sad day indeed when the world's most renowned expert on anything looks barely old enough to frequent a bar . I suppose this is possibly forgivable since the producers thought no one over 18 would watch this ( They might actually be correct ) so decided to make the heroine sexy What isn't forgivable is that BATS lacks any type of internal continuity or logic . In fact it's downright offensive on this score . The bats ( Which have to be seen to be believed ) attack a small town . What would you do if a swarm of bats attacked your town ? Would you lock yourself in a cupboard ? I know I would but for some incomprehensible reason people walking down a street don't seem to notice them until it's their turn to be attacked and despite people screaming and crashing their trucks which then explode people drinking in a bar don't seem to notice the chaos for a full five minutes . It also goes without saying that when one of the heroes is attacked they can literally fight off dozens of the critters but one bite from a single bat is enough to kill a nameless extra . If this was a STAR TREK episode most people would be wearing a red top I notice that during the attack on the town the local cinema is showing NOSFERATU which seems to indicate a post modernist sophistication on the part of the makers but again would a small American town be showing legendary silent movies at the local cinema ? Highly unlikely and everything else in this movie indicates that the producers thought the target audience were complete and total idiots",
            "review_date": "2005-11-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Holy bat poop, Sheriff!",
            "content": "The sleepy desert town of Gallup, Texas is terrorized by a large swarm of mutant bats. Sheriff Emmett Kinsey, played by Lou Diamond Phillips, needs help protecting his township from the large bats that not only are carrying a virus, but also are feeding on the towns people. A zoologist that is an expert on bat behavior, Dr. Sheila Casper comes to the rescue. Dr. Casper is played by Dina Meyer and not only is she smart, but she is top of the line eye candy. The bats are discovered roosting in an old mine shaft and the sheriff and bat doctor find themselves knee deep in bat poop.This really is not that bad of a movie for a low budget thriller. The bat attacks do look pretty gruesome. The camera angles and lighting make the attacks seems very realistic. I mean for big ass bats coming out of the big West Texas sky.Also in the cast are: Bob Gunton, Carlos Jacott and Leon, whose previous claim to fame is appearing in Madonna music videos. Creepier as the night grows darker. Give this one a try.",
            "review_date": "2000-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Competent film has no place being in the \"Bottom 100\".",
            "content": "Thankfully, \"Bats\" is not one of those \"monster\" flicks where you have to wait half the running time before the characters can finally figure out that all the trouble is caused by whatever creature you already knew was causing all the trouble just by looking at the title or the cover (check out the 1976 \"Squirm\" for an example of this). No, this movie is called \"Bats\", and right after the opening five minutes all the central characters know they're dealing with bats and already make their first plans against them. The director knows his business, too - the movie is consistently fast-paced, with no dead spots whatsoever. True, it has some faults (the cliched \"mad scientist\" role, the cliched \"comic relief guy\" role, some of the computer generated shots don't look so hot), but overall it's a pretty good example of its kind. If you're too highbrow to appreciate \"Bats\" for what it is, may I give you an eye-opening piece of advice? The next time you're in the video store, go to the horror section and pick up a copy of the 1994 killer-mosquito film \"Skeeter\". Viewing it may just alter your whole perception of bad films.    (**1/2)",
            "review_date": "2003-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Standard creature feature",
            "content": "Nobody ,surely,would sit down to watch a sub 90 minute movie called Bats,and starring Lou Diamond Philips,expecting to see another Citizen Kane.What you get is a brisk tale cut to the standard template for such flicks Mutant bats,created by the US government to be \"perfect killing machines\"create havoc in Texas,when escaping from the lab.Standing between them and world domination are the intrepid sheriff(Philips) a bat expert(Dina Meyer)and her sidekick(Leon)The bog standard mad scientist is on hand to complicate matters even more The director seems to delight in camera movement and the mass bat attacks pass in a whirling frenzy of disorienting and vaguely irritating camera jumps. The script is trite and does not stand up to scrutiny but there are some nice touches e.g Nosferatu showing at the local movie house,the sheriffs closet love of opera Meyer looks fetching attired for combat with the nocturnal enemy,Philips is better than the material deserves but the sidekick character was an irritant spouting would be funny linesAs a no brainer it passes muster on a bleak December day,but it is no \"Tremors\",it is no \"Them\"(still the best picture of its type I reckon) Eye candy for those who need to give the cerebellum a rest",
            "review_date": "2001-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfectly enjoyable B-grade killer animal horror opus",
            "content": "The tranquility of a sleepy small Texas town gets ripped asunder by a swarm of lethal genetically enhanced bats created by mad scientist Dr. Alexander McCabe (neatly played with sinister aplomb by Bob Gunton). It's up to earnest Sheriff Emmett Kimsey (a solid and likable performance by Lou Diamond Phillips), spunky zoologist Dr. Sheila Casper (a perky and appealing portrayal by Dina Meyer), and Casper's cowardly assistant Jimmy Sands (an amusing turn by Leon) to figure out a way to stop the ferocious buggers before it's too late.Director Louis Morneau and screenwriter John Logan bring a winningly lean'n'lean Grade B sensibility to the familiar, yet still effective and entertaining premise: The compact story zips along at a constant brisk pace, there's no pretense to speak of, the savage bat attack set pieces are staged with flair (a major sequence with the bats attacking the center of town rates as a real rip-roaring doozy), and things are even topped with a satisfying smattering of gore. The puppets and CGI effects used for the bats are pretty gnarly. George Moorodian's slick widescreen cinematography provides a nice glossy look. Graeme Revell's spirited shuddery score hits the stirring spot. Granted, this sure ain't no groundbreaking work of exceptional cinematic art, but if accepted on its own admittedly modest terms this movie overall sizes up as a really fun little flick.",
            "review_date": "2015-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats",
            "content": "Two huge virus-based bats from Indonesia escape from mad scientist Dr. McCabe's lab infecting others in the dusty realm of small Gallup, Texas where Sheriff Kimsey(Lou Diamond Phillips)finds citizens being attacked viciously. The Center for Disease Control call on Dr. Casper(Dina Meyer)to help figure out how to stop the bats from spreading the infection on bats throughout the country. She is bewildered at why fruit bats would turn carnivorous, assaulting humans and finds that McCabe designed for them to do so. When asked why McCabe would design these bats to do such things, he answers, \"Because we're scientists. That's what we do.\" Okey dokey. With help from Casper's partner Jimmy(Leon), she'll assist Kimsey in trying to trap the \"roost\"(this is a term describing the entire bat group collectively in one location)annihilating everyone of them before they have a chance to move on to another spot. But, will McCabe allow them to destroy the monsters he created(..for the military..*yawn*)? And, better yet, will the bats comply to their wishes of staying put? In the center of the film, Gallup is attacked by the swarming bats with people dropping dead one after the other.Really, really stupid \"animals run amok\" flick doesn't have a smart bone in it's body. And, the director tries convincing us with rubber bats(which look like rubber bats)through dizzying editing techniques and blurry stretches of the camera lens as they attack. Truth be told, they are about as menacing as Kermit the frog. Even worse, they expect us to believe that bats can throw a large male through a windshield while tossing others grown men through windowed doors. The film is an unintentionally hilarious monster flick. The cast try their best with a dumb plot.",
            "review_date": "2007-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Run-of-the-mill creature feature",
            "content": "Released to USA theaters during Halloween in 1999, \"Bats\" is a nature-runs-amok flick about government-funded mutated bats that have escaped and are harassing the citizens of a West Texas town. The Sheriff (Lou Diamond Phillips) teams-up with a bat expert (Dina Meyer) and her amusing sidekick (Leon) to save the town and, actually, all of North America. Bob Gunton plays the semi-mad scientists who created the genetically-engineered diabolical creatures.This is a solid creatures-on-the-loose movie with a quality cast and a lot of thrills, but it never rises above run-of-the-mill for a few reasons: For one, there's no interesting subtext. This is a film about mutated bats threatening a town and the people who try to vanquish them; that's it. While there's nothing wrong with such an approach, it can only be successful IF the creatures are interesting enough, like 1972's excellent \"Gargoyles,\" but I personally don't find bats that interesting. Don't get me wrong, the filmmakers did their best to make the creatures as malevolent, hideous and formidable as possible, but they're still bats. Another negative is that there's no female eye candy beyond the alluring main protagonist, Dina Meyer, and they don't do anything with her besides showcasing her stunning face. I'm not suggesting nudity or anything pornographic here -- not at all -- but professional filmmakers are able to take advantage of the female resources at their disposal and this film doesn't do that.\"Bats\" strikes me as a decent TV creature feature -- decent, not great or even really good -- and I find it hard to believe that it was a theatrical release.The film runs 91 minutes and was shot in Utah.GRADE: C+",
            "review_date": "2014-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "HOW BAD CAN IT BE?",
            "content": "I saw this movie opening night and I still remember chuckling at it. I was entertained. That's what we see the movies for, right? To be entertained? Well. Maybe that isn't always the case. In any case I enjoyed this movie and will add it to my \"bad\" movie collection, if not to complete the Dina Meyer 4 (Starship Troopers, Johnny Mnemonic, Bats and Dragonheart)",
            "review_date": "2000-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "low budget schlock,but entertaining a times (4.5/10)",
            "content": "this is a strange little movie.i mean it's very low budget and mostly poorly acted,perhaps on purpose.i'd swear it was done tongue in cheek yet at the same time it seems to take itself seriously.it has some pretty cringe worthy dialogue to say the least,and the story is quite silly,in my mind.at the same time though,it is fairly fun,and some of the characters are interesting.it's no masterpiece.in fact far from it.but i did find it a passably entertaining diversion.if you keep you expectation level really low for this movie,you might get some enjoyment out of it.it wasted around 85 minutes or so(not counting the end credits.it's not memorable,and once it's over,you'll forget all about it.for me,Bats is a 4.5/10",
            "review_date": "2008-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Probably would have been better if it was sillier!",
            "content": "Bats. Scary, huh? Well, not really. That's why the makers of this (imaginatively titled) film have made these ones bigger, stronger and smarter. So... now they're very scary! Well, actually no - they still look like rubber monsters, only bigger ones.The main trouble with Bats is that it tries to be serious. Seriously... a film about intelligent bats shouldn't be done with a straight face. If you ever watched Eight Legged Freaks and saw how they handled a plague of giant spiders, then that was probably how the film-makers should have done with Bats. As it is, they try to be genuinely horrific... and it doesn't work.Saying that, Bats isn't the worst film ever. The acting is surprisingly competent, which is credit to the actors who do a good job with the material provided.Bats isn't a bad film, it's just nothing particularly out of the ordinary. It's full of clichés and the bats have this strange habit of letting major characters get a good head start before trying to eat them (as opposed to the meaningless stream of extras who get munched straight away).If you can really be bothered to watch another 'monster-munching' movie, then you could do worse. It's just you could also do a hell of a lot better.",
            "review_date": "2015-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watchable if you are into bats...",
            "content": "Well I must admit that the Christmas spirit has invaded me and that's why I won't be too harsh with \"Bats\" and I will try to be objective.Well the movie has some decent f/x and a good premise. I mean, there aren't much Horror movies with bats. The cheesy plot was decent and served for the movie's purpose. Bats are horrific creatures that somehow, through history, have been linked with Dracula and other demonic situations. The truth is that this movie exploits them in such a way that they are considered to be dangerous.I was skeptic with it but I'm glad I was right. This is a very bad bad movie if you are the kind of movie fanatic that pays attention to production values and plot development.Watch \"Bats\" for what it is : a cheesy, regular B-movie disguised as a big budget Horror movie.I watched it only because it was the last movie of the Horror section in Blockbuster. See? This is why Blockbuster is about to go in bankruptcy.",
            "review_date": "2006-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Seen it all before.",
            "content": "Well, killer bats attacking people. Says it all really. This is a completely mediocre, unexciting, unoriginal example of the normally-harmless-animals-eating-people genre.The special effects are ropey by today's standards and with it actually being difficult to convincingly depict bats (or even sometimes just a single bat) savaging a human the camerawork uses frantic, in-your-face close-ups of flapping wings and biting teeth, jumping from shot to shot and not allowing you to see what's going on properly. This soon becomes irritating.Unfortunately, mediocrity permeates every aspect of this film. The acting isn't great, but it's not awful. The same goes for the script. As a result, it doesn't even descend into the so-bad-it's-good category (although there are one or two laughably bad moments). The film doesn't take itself too seriously though and there are a few attempts at humour.In summary: not very good but not the worst film you'll ever see and hence, probably not worth watching.",
            "review_date": "2001-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Saw this at a movie theater and thought it was dumb fun.",
            "content": "I saw the trailer for this movie before The Sixth Sense, thinking it was gonna be silly. I was wrong. Bats is probably the worst bat animal movie ever made. Skip it and see something else instead.",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Here They Come!",
            "content": "Louis Morneau directed this horror picture that stars Lou Diamond Philips as small-town Texas sheriff Emmett Kimsey, who finds his desert community under attack by large bats that are intelligent killers, and quite omnivorous. Dina Meyer plays expert Dr. Sheila Casper, who comes in to sort out the problem, and they both discover responsibility lies at the door of crazed government scientist Dr. McCabe(played by Bob Gunton) who genetically re-engineered their DNA to make them superior to people. Why you ask? Because he can he answers!(Oh Boy) Despite some reasonably good Bat F/X, this is an idiotic and shallow picture, with no real reason to exist, as it has nothing new to offer.",
            "review_date": "2013-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad title, bad movie.",
            "content": "* 1/2 out of ****Prior to Bats, I'd never seen a horror film centered around the winged rodents before, so it's easy to be curious and skeptical about this film. But just as the previews proved, this is a pretty bad movie, not quite as terrible as I'd expected, but still quite the lackluster picture.  The story is typical for any killer animal movie, meaning we get a few specialists (led by Dina Meyer) and the town sheriff (Lou Diamond Phillips) out to stop the mutated bats before they spread their chaos over the entire continent.Easily Bats' weakest aspect is the dialogue and Leon's performance.  Hell, the two even go hand-in-hand as it's Leon delivering most of the pathetic one-liners.  Every time the guy opens his mouth, it's all it takes to keep from covering my ears, that's how embarrassing his stereotypical black man role is.  Bob Gunton is almost as annoying as the mad scientist who caused the whole mess, playing the same role he always does in the same manner. Phillips is usually a fine actor, but he should stray from attempting a southern drawl.  Dina Meyer is both talented and pretty, and fares the best here as the chiroptologist and heroine.Director Louis Morneau has all of one good film under his belt (the underrated sci-fi/action thriller Retroactive), and a whole lotta crap beside it.  Bats is an improvement over, say, Carnosaur 2, but it simply doesn't gel as the fun thriller it aspires to be.  Aside from the small town massacre (an admittedly fun setpiece, the only thing keeping this above * star), the rest of the film lacks thrills, suspense, and a good sense of humor.  While the movie does have a very slick, polished look, most of the visual effects are cheesy and the individual bat attacks are made into big blurs with Morneau's quick-cut editing and shaky camerawork.  Hard to believe this is the same man who gave us all that thrilling action in Retroactive.Bats concludes with the expected prolonged segment of our heroes entering the creatures' lair.  But Aliens, this is not.  The climax is just one long drag that ends in a predictable fashion.  But the final scene, which breaks a standard horror movie cliche, delivers a good belly laugh that made me wonder why the whole film wasn't packed with this kind of humor.",
            "review_date": "2003-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "* out of 4.",
            "content": "A group of mutated bats hold a town hostage and begin to kill off all the citizens. What could have been a fun campy premise, is given a pretty straight forward treatment. It is devoid of any real chills and is sorely lacking any (on purpose) humor. The special effects are a cheesey mess and the characters are left over stock characters from dozens of other films. The cast tries to little effect. Rated PG-13; Violence and Profanity.",
            "review_date": "2002-09-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Above average creature feature",
            "content": "I won't do a résumé of the plot, but I don't understand the awful reviews. The science is plausible enough (I have a degree and I've worked in science for twenty years), the special effects aren't fantastic, but work well enough (this is fiction after all?) Scary in parts and witty dialogue. The lead characters were all likable (bad guys excepted of course). This is a fairly routine creature feature in some respects, but more believable than most in as much as the characters are neither stupidly heroic nor embarrassingly cowardly, the response to the emergency by the public and the authorities is also quite realistic. The sudden appearance of such numbers of bats is a bit of a stretch and some of the claims made by Dr McCabe are a touch too much, but other than that and the ultimate cause of the bat problem everything else works OK, for me at least. Mostly though, I had fun watching the movie and didn't feel my intelligence was insulted.",
            "review_date": "2014-10-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You messed with the wrong brother",
            "content": "Dr. Sheila Casper (Dina Meyer) is called upon to help save a small town annoyed by killer Chupacabra bats that escaped from an experimental lab. She teams up with Sheriff Kimsey (Lou Diamond Phillips) to kill bats who don't want to die.The film used camera shakes for effect. The muppet-like bats were not overly impressive. Passes for entertainment.Guide: f-word. No sex or nudity.",
            "review_date": "2019-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Most Awesome Movie Ever",
            "content": "Ladies and gentlemen of film industry jury.  So many bad things have been said about one movie entitled, Bats.  I don't understand how this can be done.  For there's a simple fact one should have realized before seeing the movie...it was going to be BAD!This movie is a classic Lame Killer Animal Movie.  Hence, there in lies it's appeal.  If you went into watching this movie looking for a thrilling terrifying scary horror movie, you should have known better.  Just like Lake Placid, Deep Blue Sea, Anaconda, etc, killer animal movies are great for great laughs.  And this is no exception.  It's awesome.  Before you see a movie, and pass judgement on it, know what you are getting yourself into! Genetically altered killer BATS isn't exactly scary to me...and I knew it was going to be bad before I saw it.  Which makes it all that much better. We need to stop taking movies like this so seriously, and realize the comedy that lies there in.Thank you.  And remember.watchoutforthebats theyregonnagetcha BATS BATS BATS theyregonnagetcha BATS BATS BATS theyregonnasuckyadry",
            "review_date": "2000-04-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Bats\" is a trick on movie audiences rather than a treat for them.",
            "content": "\"Bats\" amounts to a load of guano. This mediocre animals-run-amok thriller raises little hair either as a horror chiller or as a creature feature. The executives at Destination Films who green-lighted this half-baked hokum as their debut offering on the Hollywood scene should be hanged by their heels! Director Lou (\"Made Men\" & \"Carnosaur 2\") Morneau and an overqualified cast struggle valiantly against predictable writing and ersatz special effects. \"Bats\" teams up a rugged, cigar-chomping Texas sheriff (Lou Diamond Phillips of \"Young Guns\") with a drop-dead gorgeous bat expert (Dina Meyers of \"Starship Troopers\") as they battle two scientifically beefed-up bats that threaten to destroy life as we know it on the North American continent. Scenarist John Logan has cobbled together a thoroughly synthetic script based on classics ranging from Alfred Hitchcock's \"The Birds\" to Steven Spielberg's \"Jaws\" and \"Jurassic Park.\" Logan substitutes genetically enhanced bats for dinosaurs, but (trust me) their lack of size does matter.You've seen it done before and done better. The action unfolds one dark night in Gallup, Texas (pop. 7,000), when two carnivorous bats kill a couple of teenagers. Clearly, \"Bats\" imitates the opening scene from \"Jaws.\" Cut to a helicopter from the Centers for Disease Control whirling into a remote desert location to haul Dr. Sheila Casper (Dina Meyers of \"Starship Troopers\"), a zoologist specializing in bats, and her wise-cracking assistant, Jimmy Sands (Leon), to Gallup for an autopsy. The pick-up scene comes from \"Jurassic Park\" while the autopsy is straight out of \"Silence of the Lambs.\" Although \"Bats\" adheres to a sure-fire horror film formula, this movie delivers few thrills and chills.CDC chief Dr. Hodge (Carlos Jacott) introduces them to the amoral scientist, Dr. McCabe (Bob Gunton of \"Patch Adams\"), who created this mutant strain of killer bats. According to McCabe, he has spent vast sums of government funds over the last decade breeding these biologically altered bats. Experimenting on Flying Foxes, an Indonesian bat with a six-foot wingspan, he has made them smarter and more aggressive. Further, he has turned them into the equivalent of winged piranha. They fly in swarms and feast on flesh. When Jimmy asks why, McCabe boasts: \"That's what scientists do. Improve things.\" Gee, sounds a lot like the unscrupulous scientists from \"Jurassic Park.\" Sheriff Emmett Kimsey (Phillips) shepherds Casper & the CDC people on their search for the bats. The dialogue about these ferocious flying mammals is unintentionally hilarious. \"Are we talking about bats!?\" Nevertheless, the filmmakers go to silly extremes to persuade us that these crafty critters pose a peril. At one point, they trap Kimsey and Casper in his police pick-up and try to burrow through the AC to feed on them. Eventually, the bats decimate the townspeople of Gallup, and the U.S. Army rolls in for the big showdown. Our heroes track the bats down to an abandoned mine, and the military unveils a giant refrigeration bomb (looking something like a chrome-plated colander) to freeze the fiends. Freezing is another of those time-honored techniques for destroying certain monsters.But these villainous varmints come out swinging. They wipe out the troops before they can set off the bomb. The Army retreats and calls in the U.S.A.F. to finish the job. Casper warns them that blowing up the bats will create bigger headaches. Reluctantly, the military permits Kimsey and Casper to reenter the cave and detonate the bomb. In a suspenseful finale, reminiscent of Michael Bay's \"The Rock,\" Casper and Kimsey plunge into the cave, wade through a river of guano, and work against the clock to freeze their foe before the Air Force blasts the mountain to smithereens. Shoddy special effects defang the fright. When the bats fly, they appear as computer generated graphics, but you can barely distinguish one bat from another, so they look like confetti. When the attack their victims, they show up as obvious hand puppets. Worse, the seams between the computer graphics and the puppets are blatantly obvious. As a result, the bats attain little screen menace. They resemble \"Ghoulies\" with wings. Consequently, \"Bats\" drums up very little terror because the titular antagonists never chill your goose bumps. The only thing compelling about \"Bats\" is director Louis Morneau's muscular direction. He pours on non-stop action, rarely letting anything interfere with the forward momentum of the plot, but his roller coaster tactics cannot disguise the substandard special effects or distract us from the corny dialogue.As ecological catastrophe chillers go, \"Bats\" is a trick on movie audiences rather than a treat for them.",
            "review_date": "2007-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrible",
            "content": "Bat expert Dina Meyer is called in to a small Texas town to investigate a series of bat killings. Before long, she discovers a scientist (Bob Gunton) has genetically altered normal bats to make them super bats or something. Together with sheriff Lou Diamond Phillips, they try to stop the bats before they kill everybody.The effects are awful for a theatrical release. This was made early on in the CGI age and not every film had the budget of Jurassic Park. Bats most certainly did not. The cast is bland and their parts poorly-written. Perennial villain Bob Gunton seems like he would rather be anywhere but here. Phillips and Meyer neither impress nor disgust with their performances. They're just there. Black actor Leon at times seems to be inhabited by the spirit of Mantan Moreland circa 1941.At best, it's a boring but almost watchable movie about killer bats. At worst, it's a piece of excrement. Watch at your own risk.",
            "review_date": "2013-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Genetically Modified Bats!",
            "content": "This film begins in West Texas with a young couple who have driven out to a secluded place to talk when a nearby passing train unleashes a furious swarm of bats upon the unsuspecting teens. Not long afterward an expert in animal zoology named \"Dr. Sheila Casper\" (Dina Meyer) and her assistant \"Jimmy Sands\" (Leon Robinson) are rushed in from Arizona to the town of Gallup, Texas to help the CDC to eliminate these genetically modified bats from spreading a contagious virus to others of its species before they can multiply out of control. Now rather than reveal any more I will just say that this was a fairly typical \"nature gone wild\" film which suffered somewhat from its lack of horror and suspense. It does, however, have some decent action here and there bolstered by good special effects which tends to make up for some of those faults just mentioned. Likewise, both Lou Diamond Phillips (as \"Sheriff Emmett Kimsey\") and the aforementioned Dina Meyer performed adequately enough for me to rate this as about average.",
            "review_date": "2019-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "much better than 3/10",
            "content": "I was very surprised to see such a poor rating for this.Without sounding too clichéd it won't win any awards and was pretty forgettable stuff but it was an entertaining horror/drama for 90mins. There was even some interesting information on the nature and habitat of bats! I thought some of the scenes where the bats enveloped the vehicles and attacked the people were well done considering this was pre-CGI.The plot was a little convoluted and its a shame sometimes when movies like this try and take themselves too seriously but it had enough action to keep up the interest and for any DIna Meyer fans, she looked very fine in this!",
            "review_date": "2008-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Made-for-TV MSTK fodder inexplicably released for the big screen",
            "content": "My Take: Obviously awful. Making this review short, BATS is a totally forgettable affair that I forgot instantly after seeing it. In that way, that's the one thing it does the best. Everything in BATS is the stench of MSTK, bad acting (from a B-level cast), bad script (It came from beyond the deepest, darkest thoughts of Ed Wood), a mad scientist (who wants the little critters for the sake of \"science\" and gets his just deserts in the end), screamers (either extras or leads), the clichéd hero (who kicks the bats' assess, but still can't act) and the morality that is \"Don't mess with Mother Nature!\" This time, bats turn loco as science experiment goes awry (Gee! That's new!). The scientists, one a woman (Dina Meyer) who wants to make up for her errors and a man (Bob Gunton) who wants them back for his own errors. They all are under the shadow of the lead hero, a sheriff played by Lou Diamond Phillips, struggling against CGI and puppet Bats, the real stars of the film, just as bad as the human characters, but at least they don't talk and don't get to have a line in the tailor-made-to-be-Ed Wood's-protégé screenplay.That's just about what I remember from BATS, other than the fact that it's a 'Movie-of-the-week' thriller that lost its hands to a big-screen production. It may just be a sincere bad movie, but even if it is, it still ain't any good. Bland characters and clichéd body-count (and script) finish it all off as one terrible vomitorium badness of Ed Wood proportions, sometimes it's even worse. Camp buffs may find it a treat while being drunk.Rating: 1/2 out of 5.",
            "review_date": "2008-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats Without Vampires Equals a Weak Premise.",
            "content": "Bats (1999): Dir: Louis Morneau / Cast: Lou Diamond Phillips, Dina Meyer, Bob Gunton, Leon, Carlos Jacott: It is weird looking at the advertising poster where the title is upside down spelling \"stab.\" Was this intentional or just an error by someone who flunked their eye examination? The first problem is that unless we are dealing with vampire bats then the title fails to give off any form of scary intimidation as say Anaconda where the thought of the animal is far more intimidating. Then we have a host of airheads that do nothing to render this scary. There is a meathead scientist who experiments with nature by creating a nasty breed of bat thus letting them loose to attack everything that moves. A bat expert is summoned to assist the local Sheriff. This leads to a rather cruel and disgusting climax. Director Louis Morneau does his best but the scientist featured here is a real joke. Bob Gunton plays the biggest idiot in the history of horror films. He out stretches his arms claiming to control the critters only to be slaughtered by a flock of them. Was he drunk or just on a serious amount of cocaine? Lou Diamond Phillips and Dina Meyer play characters of moron capacity, but Gunton's role takes the cake as the biggest bat sh*t piece of writing in this garbage. There are good shots of overhead flight but the film is pointless and should be buried in bat guano. Score: 2 / 10",
            "review_date": "2015-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a very average movie that is also fun and entertaining",
            "content": "Bats (1999) is currently available on Tubi and one of my guilty pleasures I always watch when it's on. The storyline follows a small Midwestern town that has a scientist go too far genetically engineering bats. He creates two super bats that are overly intelligent and gives them a band of followers to help begin the process of world domination. Can a small town sheriff and his friends stop the bats and scientist? This movie is directed by Louis Morneau (Joy Ride 2) and stars Liu Diamond Phillips (La Bamba), Dina Meyer (Starship Troopers), Leon (Cool Runnings) and Bob Gunton (Shawshank Redemption). The storyline for this is as you'd expect but fun to watch unfold in a \"Tremors\" kind of way. I really loved the scenes where the townspeople in the streets and at the high school get attacked by the bats. The CGI in this is actually pretty fun and the settings and backdrops are well selected. The script is terrible and uneven in this but it's still fun seeing Lou Diamond Phillips as the hero. Overall this is a very average movie that is also fun and entertaining. I'd score this a 5.5/10 and recommend seeing it once.",
            "review_date": "2021-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "be aware....bad!!",
            "content": "Almost ten years old and I never took the time to watch this movie, why, because everybody said that it was bad. But there comes a time when you can find those movies in the sell out section of your local DVD shop. So it happened, although it was the extra beyond limits low budget section. I picked it up and plugged it in. Starts of pretty well I thought with the killing of a young couple. But then the movie declines in a real bad movie. The lead actors are surely doing this to cash in, Lou Diamond Philips was once on top of the list with movies like La Bamba and Young Guns. Here he delivers bad acting. For Dina Meyer we could tell the same. They are both never believable. And the real actors are the bats themselves. We have seen this kind of story a thousand times. Especially in the fifties there were those creature features. Now and then they make a new creature movie like Host and that kind of movies really have a storyline. There is never any suspense in this flick. No blood, no nudity no gore. When the bats attack you will never be frightened, the bats themselves look like Disneybats so you could guess how bat, euh, bad they are. When the town is attacked it made me think of The Birds and the link with the posters \"Nosferatu\" at the cinema are ridiculous too. They bring in the army, and they couldn't destroy the bats, come on. As this is a real Hollywood product with wellknown actors I just gave it a 2 out of ten. The editing is boring, score is terrible, anyway, it just got a two because at the end of the movie you really got frightened, a bat arises from the earth, frightened that they would make Bats 2, but it is destroyed in a funny way. Avoid it at all costs.",
            "review_date": "2009-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not good but definitely entertaining",
            "content": "Its was a very creative film, i was well acted and had some humorers parts that made it more enjoyable. I like that it didn't take it self that serious and at the same time making it scary, i admit the bats looked fake in times and the CGI wasn't that great at the time but i don't consider it as bad as say birdemic. It had great characters specially the stereotypical black side kick that was funny most of the time, the only bad character was \"evil scientist\" that well...was evil and did not explain things well he was just that evil mad scientist.I recommend this one as just a Sunday movie to watch don't expect complex story lines. Its fun to watch and the ending was just the funniest ending you could imagine.",
            "review_date": "2016-02-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad Creature Flick",
            "content": "Lou Diamond Phillips and Dina Meyer star in this 1999 horror film.\nThis tells about a government experiment of genetic bats that terrorize a small\ndesert town. Phillips (Young Guns) plays the local sheriff and Meyer (Starship Troopers) plays a zoologist that team up to stop them. This is a bad creature flick that has a semi-interesting premise, but fails and the Bat effects are a bit lame. If you're into B Movies or horror, this may be up your alley, but it's a waste of time in my opinion.",
            "review_date": "2020-09-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very watchable",
            "content": "In a movie of this type, if I am not (a) insulted, or (b) bored, then I am having a good time.  I did not mind this movie at all and can't understand the bashing it seems to have taken.  I am not saying its enlightening or anything, but for what it is there is not that much wrong.  It did not try to be snide (\"Lake Placid\") or be an f/x spectacle (\"Deep Blue Sea\") and seems comfortable to be a decent B-movie - another good thing.PS  There is even a mad scientist!  Calling Peter Cushing!",
            "review_date": "2000-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats? Turkey is a more apt name...",
            "content": "This movie is pretty awful. The actors try, but they are so hampered by terrible dialogue, a truly dire script and goofy effects, that the whole thing comes over as pure MST3K fodder.The effects are sub-standard. Oh, the CGI \"in the distance\" bats are fine, if a little obviously CGI. But it's the close-up, rubber bats that really let the side down. The closer the shot of the bat, the more rubbery and less realistic it looks. As an idea, if you've ever seen the film \"Ghoulies\", then you might have some idea of how un-lifelike and rubbery they look.My favourite bat moment, though, was the bat-cam. Here, they stuck a rubber bat to the front of the camera and run around with it, to show you what an attack looks like from a bat's eye view, as it were. But it's so ludicrous I was laughing my head off.But it's not just the effects that are lame. The plot is too. On the whole, its bearable. But right at the end, it falls flat on its face with the most awful and glaringly obvious screw up on the part of the scriptwriters/cutting crew et al.The script is so full of cliche horror moments its unreal. Top of the list are the beautiful heroine and comedy side-kick. Also present is the evil scientist out to protect his creations, which ultimately turn on him. Ho hum. We also have the disbelieving populace (until its too late!). The hard-nosed \"kill 'em all\" military man. The list just goes on and on.Among the many stupidities that the cast are called upon to perform in the name of the script is the holing up in the town school so that they can track the bats by satellite. Apparently, they couldn't do this from a safe location, far from the bats, as this wouldn't have meant an attack by the bats for dramatic effect. As a further idiocy, the back-up generator is installed far from the \"control room\", allowing for a panicked run to start it up when the bats short out the power. Furthermore, its a pullcord starter, so that the heroes have trouble getting it going, to further enhance the already non-existent tension.But the best bit is saved for last.You see, spoilers, they find the bats are holed up in an abandoned mine (now isn't that original). The military sends a team up there and lowers a truck-sized refrigeration unit into the mine on a long cable. The idea is to chill the bats and make them go ni-nights. However, the bats return (did I mention the soldiers do this at night?) and slaughter the lot of them. Enter our heroes, who turn up next day to finish the job. Except......they go into the mine through some convoluted passageways and an elevator barely big enough for the two of them. At this point, not having seen the military actually lowering the freezer into the mine, I was wondering how they got something that size down all these twisty passages, especially since we'd been told (several times) that there was only one entrance to the mine. Anyhow, after some time our heroes enter the bat cavern and, guess what? There's the freezer unit, dangling from a big hole in the roof on the end of a cable. At this point I was scowling at the stupidity of it all. Why didn't our heroes merely go down through the roof where the freezer was? Of course, the answer was that the scriptwriters are stupid, stupid people who believe we won't notice such an awful screw-up. To add insult to injury, after escaping from the bat lair, our heroes blow the entrance to seal the mine and the bats inside. Except, considering there was only one entrance, the explosion covers the whole darn hillside.Oh, and by the way, Mr writer, if you're going to write a story about bats, it might help to actually get a bat expert to tell you some basic facts about them. Like for instance, how bat guano contains a great deal of nitrates and ammonia and is quite flammable. So I don't think a bat expert would be igniting a frickin' flare in the bat cave!One final rant. If they were going to seal the bats in the cave, what was the point of the freezer? It'll run out of fuel eventually, then the bats'll wake up. So what was the point? Maybe I dozed off and missed something.Anyway, a really crap film that doesn't deserve to have Dina Meyer or Lou Diamond Phillips in it. What were those two thinking? This'll harm their careers for sure.If you must watch it, look out also for the CDC guy's mullet (hairstyle). It's one of the worst I've seen for a while and worth laughing at every time he appears. Other than that, though, this is a real turkey and best avoided except as a DIY MST3K with your mates and plenty of beer.",
            "review_date": "2003-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad",
            "content": "What can one say about a movie like Bats other than it's so scary it will go over your head, so funny that you'll forget to laugh and so entertaining it might put you too sleep.",
            "review_date": "2021-08-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its a new kind of horror movie",
            "content": "I like this movie because it was pretty orignal they didnt go over board with the special effects and it wasnt corny the acting wasnt that great but if you are looking for a great date movie this could be a good one to see and not to mention its right in time for halloween.",
            "review_date": "1999-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really Stupid",
            "content": "This movie is a wonderful specimen of near perfect cinematographic work. When looking up the word 'art', 'Bats' should be at the top of your list. This flick stands alone as unquestionable proof that acting is unnecessary to create celluloid magic. Each veteran star embraces their individual characterizations unprofessionally and with the puerility of a neophyte. The lack of script and direction dramatically adds to the aforementioned unimaginative schema, creating a meretricious masterpiece equally appreciated by both the comatose and fatuous. This inanimate roller coaster of a movie has little action or suspense. Sadly these qualities are devoured by the grating ennui. If one enjoys reasons to take naps, 'Bats' is for you. It is also well worth the time it takes to gouge one's eyes out or perform other self-mutilations – but that is not my cup of tea. If you recommend this to a friend and they will hate you.",
            "review_date": "2014-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Agree, script needed more work, effects were OK",
            "content": "I try to read the comments on IMDb before we watch particular rental movies. Most of what I read on this one hit the mark. My husband fondly (?) remembers Dina Meyer (Dr. Sheila Casper) as a nude redhead in Starship Troopers. He said she was better looking than Denise Richards. She reminded me of a young Erika Eliniak, but in a more natural, non-enhanced sense if you know what I mean. Looking at her biography on IMDb.Com, she is indeed very talented and very smart. Lou Diamond Phillips and Bob Gunton brought a sense of dignity to the mostly improbable script. Also, Lou looked believable in his sheriff outfit. The whole thing reminded me a lot of The Birds, but not as scary. Also, in reply to another posting from SAMLCITR, I never did see the air conditioning unit being shut off after the blasts. Seeing this movie reminded me of a section in Candace Bergen's autobiography. She was on location for \"Bite The Bullet\" and was horrified at the (in her opinion) lousy script. She was complaining about it loud and long it to everyone in earshot. Gene Hackman turned to her and said, \"you take a bad script and you work with it. That's what acting is about.\" (or something to that effect).",
            "review_date": "2005-05-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Great Horror Movie About Man-Eating Bats.",
            "content": "To start off, this movie wasn't a terrific movie, but is not down in the dumps in the horror genre. Bats was very entertaining and witty, but for some reason I felt like I was watching more of a monster movie, and yes the mutated bats can seem like monsters. There was no problem with the acting here, and it was believable. The movie had a great ending and didn't disappoint the audience. All in all, I give Bats an 8 out of 10. :)",
            "review_date": "2002-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "...interesting.",
            "content": "I saw this at the video store a couple years ago and bought it. I just now watched it. I figured that it was just another one of those movies where the killer animals are chasing the group of surviving people or the research expedition or something else on that order. And yeah, I was right.BATS is just another wannabe JURASSIC PARK or JAWS. All of the action adventure movies for the next decade or so will have been inspired by those films. The king movies of creature films. And, sadly BATS tried to be just like them. The cast is a bunch of extras that couldn't land themselves parts in bigger movies by having sex with the directors like how their best friend's probably told them. The script is poorly written with bad dialogue (it is written by John Logan, the guy who wrote the remake script for THE TIME MACHINE). The film is just loaded with stupid attempts at heroic efforts but the film fails except in the very begin sequence where two kids \"meet\" the bats who have been genetically altered (typical B-movie plot) by a \"mad\" scientist (Bob Gunton). The film is not all bad. But is not all good either. It is just another movie to take off the shelf every so often when you are in the middle of a hangover. You can decide to enjoy this film or you can decide not to. Its your choice.BATS: 3/5.",
            "review_date": "2002-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats out of Hell",
            "content": "Whilst not a terrible, we've all seen these types of films and some were done a lot better than this. Lou Diamond Phillips plays Emmett , a policeman trying to protect his town from a plague of intelligent killer bats. He gets help though from Dina Meyer as Dr Sheila Casper who is investigating bats at the time. Of course there is always a bad seed, and in this movie it's Dr McCabe, who is trying to control the bats, we all where this would end up, in disaster. Anyway good always wins in the end up, this time buy blowing up the mine where the bats are hiding. Not an awful movie, just kind of run of the mill.",
            "review_date": "2022-06-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fiction about genetically modified bats",
            "content": "Hollywood is prolific producing films about beasts and terrible animals to enrich its poor genre of Horror. There was a gorilla, King Kong, then crocodiles, monkeys, obviously lions and leopards in Tarzan's films, a terrible dog Cujo and many others. For those who have seen \"Gremlin\" or Hichtcock's \"Birds\" , they have no need to see this film. It is nearly the same, the only thing changing here is that bats attack the humans. Obviously, a miracle done by some heros happened and the bats were supposed to be dead. In fact, they were not killed, a second version is coming soon and more money will be wasted again.",
            "review_date": "2001-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sure it's bad... but enjoyable as well",
            "content": "Manipulated bats attack the town of Gallup, Texas. Now it's up to the sheriff, his inevitable love interest and the much needed computer geek to rescue everybody.Clearly low budget effort, but not as bad as you would expect. The acting kinda stinks, but that's really not what you should be looking for in a B-movie like this one. The story itself is nothing new, but pretty enjoyable. It wouldn't have been my choice to put it in the bottom 100, that's for sure.The ending (with bats chasing the humans in a mine, and not catching up with them for hundreds of yards) is about the worst there is, but if you're into the genre you might as well give it a go.4/10.",
            "review_date": "2004-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "fun creature feature with a rarity: favoring practical effects over terrible CGI",
            "content": "To have a 3/10 on IMDb is criminal for a movie like Bats. The title, premise, and script on paper might altogether warrant a 4 or 5 at first glance, but the main actors make the film enjoyable and not too torturously campy; the pacing is great; the plot, despite its straightforwardness, actually has some nice little turns to spice things up; and the effects, instead of favoring low-budget CGI (the main drawback of most movies this caliber), utilize pretty impressive practical work such as animatronics and puppets. The closeups are frequent and always disturbing. The sound effects and cinematography are great, and fun, but my main complaint is the \"chaotic camera work\" during attack scenes; effective in short bursts, but sometimes they go on way too long. Aside from that it's a short movie, to the point, and highly enjoyable if you know what you're getting into. Dina Meyer and Lou Diamond Phillips make it even more entertaining.",
            "review_date": "2021-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MY REVIEW FOR BATS",
            "content": "BATS***[3 STARS]-BATS IS A GREAT SCARY MOVIE FOR HALLOWEEN. ITS SCARY AND CREEPY. IT WILL SCARE THE HELL OUT OF PEOPLE WHO HAVE A FEAR OF BATS OR JUST DON'T LIKE THEM. THE MOVIE HAS A VARIOUS NUMBER OF CLOSE-UP SCREEN SHOTS OF THE BATS WHICH WOULD REALLY CREEP THEM OUT. EVEN IF YOU DON'T  HAVE A FEAR OF BATS YOU MAY DEVELOPED ONE AFTER SEEING THIS MOVIE. THERE WERE ALSO SOME REALLY AWESOME GRUESOME BLOODY BAT-KILLING SCENES. THE PLOT AND THE BACKGROUND STORY AND ITS AWESOME ENDING WERE GREAT. THE ONLY BAD THING ABOUT THIS MOVIE WAS ITS CLOSING SCENE WHERE A BAT COMES OUT OF THE GROUND WHICH WAS THE ONLY SURVEYING BAT AFTER ALL THE OTHER BATS WERE KILLED. IT LOOKED LIKE THE MOVIE WAS GOING TO LEAVE US OFF WITH A SEQUEL BUT INSTEAD A CAR DROVE RIGHT OVER THE BAT AND KILLED IT. BUT THE REST OF THE MOVIE WAS AWESOME.  IF YOU WANT TO E-MAIL ME WITH ANY COMMENTS ON MY REVIEW E-MAIL ME AT metall8418@aol.com",
            "review_date": "1999-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WHY?",
            "content": "WHY do they torture us through this. This movie is so dumb. The plot, acting and everything else about it is dumb. Why do filmmakers waste money making such a films? This movie was not scary at all. The idea of bats attacking people isn't original. Don't waste your time and energy on this movie.",
            "review_date": "2000-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hilariously bad, but still fun to watch",
            "content": "I have to assume that when this movie was budgeted, the crew sat down and said, \"You know, it's impossible to make a good movie with what we've got. Let's just get drunk instead.\" However, since they were contractually obligated to make a movie, they shot some scenes and turned it in to the studio. The studio, having already spent close to a million dollars on beer, decided they were going to aggressively market the movie to HBO and Cinemax, so that there'd always be a Lou Diamond Phillips movie on, every day, around 2am. Their gambit paid off, and now there's a whole new generation of people who associate Lou Diamond Phillips with bad movies.Is this is a good movie? No. Should that stop you from watching it? Definitely not. Why limit yourself to that which is objectively good? If you can't sit down and enjoy a bad movie about bats attacking people, you're taking life too seriously. While not truly a candidate for \"worst movie ever\", it deserves to have a cult following of fans who devise drinking games and recite quotations. This is epic movie-making.",
            "review_date": "2011-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sucked the fun right out of this",
            "content": "**Starring: Dina Meyer, Lou Diamond Phillips, and Leon.When a group of bats are used as a test for a military experiment, they break loose (now who would have thought THAT would have happened?) and everything goes haywire.  It's up to a group of people to stop the bats from taking over the world.The thing that sucked the fun right out of this was that the bats looked so damn fake.  I mean you can easily see how unreal they were.  That just bugged me throughout the movie.The movie never really has any fun and tries to scare you, but also fails at that.  The actors have a decent amount of fun (their characters obviously don't), and Leon was pretty good as the comic relief.I don't recommend it.",
            "review_date": "2003-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Blood thirsty genetically mutated bats terrorize a small (Texas?) town and threaten to escape local confinement and ravage the rest of the country.",
            "content": "I was lucky enough to be recruited for a screening of this all-out entertainment experience.  The reason I am even posting my comments is because I was blown away.  This is one of the scariest movies I have seen in years.  Think back to those pre-SCREAM years when Hollywood tried to scare us with something other than annoying brats on the run or minute and predictable formulaic expansions/hollow twists.  They used to get our blood pumping and force us to look over our shoulders when we left the theatre. Do you remember that?? We'll it's back.  This movie is an intelligent horror movie with just enough cleverly placed humor to trick us into being relaxed.Everyone in the theatre was screaming shrieking and laughing. I was in a local theatre with a sound system that had never impressed me in the past, but during this film i swore the bats were hovering and then streaking across the ceiling - it was unbelievable! - you don't really see bats that frequently anyway or maybe you think you do because when you see them you remember them, but the darkness of the theatre combined with what you know about bats makes you feel like you're being preyed upon or like you are in a cave and that the bats are all around you.. It's crazy.. And from a guys point of view dina meyer (mayer??) is extremely sexy.  I never really thought so before but she is powerful and beautiful simultaneously.  Her character is also a solid female role-model.  If you want to be entertained go see this movie.",
            "review_date": "1999-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Soooo Bad - it isn't funny.",
            "content": "I guess this is a throw back to a time when movie goers weren't supposed to be smart and therefore hoodwinking was easy. The script seems stuck in the 1970's when a grizzly bear attack or communicating Bugs were potential horror vehicles. The actors try but because the script is so poor they appear as cartoon characters. It doesn't help that the head bats are so-called smart bats. Simply put, it is a waste of time. Does Lou Diamond need money that badly? Do producers really think they can sell junk like this to us? Rapid bats rapidly multiplying, a secret government project and a wicked scientist??? Hmmm, haven't we seen this before a ga-zillion times before, done better?Lord, its put the horror genre back 25 years. Can a remake of Night of the Lepus be far behind?",
            "review_date": "2000-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good film for B-level horror, however script could have used some work",
            "content": "This film is basically about a bat attack and a scientist is brought in to help figure it out. I won't reveal more about this story but however I do have to say two good things about the film: 1.The CG was very good considering the budget was $37 million dollars.2.The bloody bat attacks were great and the R rated film is my preferred version instead of the original PG-13 versions.However to balance the issue (not like Fox news), I will say two bad things: 1.The Script was mediocre at best, being a short film screenwriter, it was made for B-level but some of the dialogue sounds like a straight-to-video movie.2.The Score is way too obvious and a little bombastic.All in all, this is a very good attempt to make a B-level horror film, now if they had made a better script and did some better marketing, this film would have earned more than $10 million dollars domestic gross I give this film 7 out of 10",
            "review_date": "2008-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Poor Lou Diamond Phillips..... Poor, poor Lou Diamond Phillips...",
            "content": "I was going to write a long, involved review citing every atrocity this movie flings forth on the screen, but I won't. It would just be rubbing it in. This movie is bad, yes, but it is actually more on the \"pathetic\" side. Pathetic, and sad, and depressing. Towards the end there is a scenes where fake rubber bats are just hung on a fence and shaken by an off-screen stage hand. Later Lou Diamond Phillips wrestles a big bat dummy while sitting in a big puddle of bat guano.\nThis movie fails in every single possible way. Do not see it. Please. How this got made and into theaters confounds me. I mean, it's better than \"Double Jeopardy\", sure, but what movie isn't? Anyhoo, Bats: Keep Away.",
            "review_date": "1999-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats",
            "content": "An expert named Dr. Sheila Casper is brought in when \"Bats\" begin killing animals and people in a small town in Texas. Some bodies are first found all chewed up, and we discover the killers are large bats who have been injected with something thanks to a mad scientist Dr. Alexander McCabe. Those bats attack and infect a large number of other normal bats, and that's when it becomes feeding time. Whatever the scientist did to the bats he was testing gives them the ability to sense things that normal bats wouldn't, and also gives them the thirst for human blood. We see the bats attack our main group of characters, as well as the entire town until Sheila realizes the only way to stop them for good is to freeze them. Will this attempt to end their reign of terror work, or will the mutated bats live on and kill everyone in sight?'Bats' is pretty much an average \"animal/mammal attacks\" type of horror movie. It really gave nothing too special other than a few moments. Those moments which work are the scenes in the small town when the bats attack the townsfolk. We get nice location shots of them attacking a bar, a grocery store, the outside of a movie theatre, etc. That was really well done. Where the movie fails is it's ending portion. It drags on way too much in which the experts and Sheriff Emmett Kimsey tries to kill them. Plus an added plot point of making it that the government was creating killer bats as weapons in war or something fell flat. I don't know, I thought it was really silly.Acting was pretty good I thought. Lou Diamond Phillips as the Sheriff and Dina Meyer as the expert did a good job. The stand-out performance goes to Leon as funny guy Jimmy, he had some funny one-liners and delivered them perfectly. I'd recommend 'Bats' if you like these kinds of horror films where animals or birds attack. It wasn't bad, but could've been better.5/10",
            "review_date": "2013-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "B-A-A-A-A-A-D!!!!!",
            "content": "I originally posted a review for this after seeing the premiere but only realized recently that somehow it didn't get posted.  For that I apologize - I might have been able to save someone $7 earlier.  Bats:  genetically enhanced mutant killer bats escape from their lab and terrorize a Texas town.  Take out the \"t\" and \"s\" add a \"d\" and a  \"!\" and you have a more appropriate title.  There is nothing about this movie (and I use the term loosely) that can be considered a redeeming feature.  The special effects were pathetic (rubber \"bats\" that look more like gargoyles), the plot was thinner than Kate Moss on a diet, the \"acting\" was abysmal, and it wasn't even remotely scary (unless of course you happened to actually pay to see it).  Although there was a lot of laughing going on, the scenes were not intended to be funny, so it's not even enjoyable as a bad movie like such classics as \"Plan Nine From Outer Space\". I would like to declare this the worst movie of the year, but the sad thing is that there are so many other contenders",
            "review_date": "2000-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bats",
            "content": "The small town of Gallup will have to try and survive an attack by Bats in this sleepy late 90's thriller.'Bats' start out in Texas with a young couple parked in their car attacked and murdered by a bat. After that, we meet Sheila and Jimmy who are exploring bat caves for research in Arizona. They are picked up by some doctors who claim of a biological emergency involving bats that they can help with after finding the dead couple in the car. Along for the ride is Sheriff Emmett Kimsey who clearly has chemistry with Sheila. The large killer bats are apparently from Indonesia and are an endangered species which Dr. McCabe has been experimenting on in an attempt to find a cure for unnamed viruses. The Indonesian bats are infected (thanks to Dr. McCabe) and when they escaped capture, they've since infected regular bats in the area. As they quickly make their way to the small Texan town of Gallup, it'll be up to Emmett, Sheila and Jimmy to fight against their attacks before the entire state is taken over and killed.This has to have been the third time I've seen Bats over the years and each time I start it I think to myself that it can't be as bad as I remember it being. No way is it as weak as critics say. Well, it is and it isn't. Bats is in no way a great horror or sci-fi flick. There is some bad dialogue, very little tension throughout, and with a weak ending. However, watching it today, I did think that it showed some promise and had a bit of heart. The best part of the movie is obviously when the Bats attack the small town in Texas, chasing all of the townsfolk on the street killing quite a few of them. The live and puppet bats look pretty good too, very effective.The acting is fine, nothing to write home about. Lou Diamond Phillips and Dina Meyer are the leads as the Sheriff and Bat Zoologist. They do an alright job and do have chemistry which is needed. Leon is there only to be the comic relief (sadly), but he does a wonderful job given the material. Bob Gunton plays the evil maniacal scientist/doctor who has caused this outbreak of killer bats and he plays it pretty well also.Overall, Bats is an average monster/killer animal horror movie. It's not as bad as I remembered it being, and I think is worthy of at least one watch. I give it a lot of credit for being on such a low budget and managing to stage that bat attack scene on the streets of Gallup. Very effective moment, but unfortunately it's followed up with a weaker finish.5/10",
            "review_date": "2020-05-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I got exactly what I was expecting.",
            "content": "Everything about this movie is embarrassing. The dialogue, the characters, the acting, the cinematography, the music, the direction, the story, all the effects.That being said I have a good time laughing at it and I can see why it's a cult movie.",
            "review_date": "2021-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Squeak squeak your dead!",
            "content": "Based on R2 DVD 88 min.Yes it's a 'B' movie which on a good day might merit a 5 however it's not all that bad for a killer mutant animal movie. In its defence the acting is passably, the low budget isn't too evident and it doesn't take itself too seriously. 4/10 - 4 guys and a six pack [each] could have fun with this.",
            "review_date": "2002-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "blant rip off of \"the birds\",\"mimic\" and \"lake placid\" and countless other creature films!!",
            "content": "If you have seen any of the titles listed above, then you have seen \"bats\" or a similar movie made recently!A scientist mutantes bats for the U. S miltary. Too bad they escape. The bats go to a town in Texas. The miltary hire a female scientist to find a way to defeat the bats. Eventually they find a way to kill the bats. This movie was OK for a matinee or a rental. If you like the titles I listed above, you might like this movie!!!This movie was semi scary so if you want to take the kids to see this go for it!!It has a few swear words and a little violence, no nudity!!!Maybe the DVD will be better than the movie run,(perhaps there are delated scenes from the movie run!!) So go see this if you like the titles I listed above, otherwise wait for the video!!!",
            "review_date": "1999-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good editing + bad acting + bad script + bad direction = bad movie",
            "content": "If anyone in the production crew of Bats actually deserves any credit, it's the editors. They have turned a really BAD film into a bad film, something most film editors don't have the power to successfully accomplish. In most movies we never think about the editing, instead dwelling on more obvious elements such as the writing or acting, but here it is actually remarkable. They didn't concentrate on the actors, who were unimaginably weak, instead on some nice moon and bat shots. The sound editing also deserves points for making it as if the bats are along with you.\tThat said, the rest of the movie is a horrible mess. Lou Diamond Phillips keeps getting role after role even though he couldn't act to save his life. There are a lot of non-acting actors out there, but normally they are known for doing something else well, such as singing (Mick Jagger, Jon Bon Jovi) or modeling (Cameron Diaz). Phillips, on the other hand, doesn't do anything else. His job consists of sleeping in a big trailer, being dragged out to recite his lines, and walking back to the trailer.\tFor whatever reason 'Bats' was a modest hit, it must have been the odd (very odd) favorable review or the flashy previews",
            "review_date": "2000-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One for the bad movie enthusiast only",
            "content": "My favourite bit of this movie was when the sheriff (Lou Diamond Philips) and Casper the friendly bat expert have a romantic interlude in this farcical bat yarn.\"Red sky tonight\" the sheriff observes in this tender moment \"my momma always said red sky means someone's gonna die.\" The laughs just keep coming in this wonky horror flick. The bat on a pole chasing them down a corridor is great but it's not just the shoddy special effects that amuse you because the scriptwriter clearly knows nothing at all about bats and wasn't prepared to skim a book about them before writing this rubbish. I especially liked the bat experts outrage that the scientist had engineered bats to eat meat as though we were talking about cows or something. Most bats are predators, I don't know what the film makers think insects are made out of, flying cheese sauce or something I suppose.The bat-vision scenes are dreadful, if you've made a substandard film the last thing you want to do is annoy the audience even more with ridiculous warped views that don't tie in with what's happening on screen.None of the characters are credible, there's no tension and the bat attacks themselves are unintentionally funny. If you like bad movies you're sure to wring some pleasure from this movie, if not then I would give it a miss.",
            "review_date": "2009-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So bad its.....well, its just bad",
            "content": "\"Bats\" is something of a schitzophrenic movie.  The last 30 minutes are very exciting and somewhat nerve wracking.  Unfortuatly, there's a whole hour before that, and thats not very good.  The premise is this: the US Government commissions research into biological weapons reasearch using bats.  One of the scientists involved in the project apparently loses touch with reality and lets his creation loose on the small town of Gallup, Texas.  Dina Meyer gives a solid performance, but seems to take this movie a bit too seriously.  She is however, as believeable as she is beautiful. \nLou Diamond Phillips makes his big screen return in this movie, and is almost laughably bad.  His character has an on/off accent, and when you first see him he is such a stereotype its hysterical.The bats are not too bad when viewed close up, but when you see the giant swarms of them they are clearly CGI, and move as such on screen.One thing I still have a hard time getting past was a couple rather glaring errors in the movie, and these could be considered spoilers.  Number 1...when the bats are attacking the schoolhouse, Dr. Casper (Dina Meyer) has the scientists gun...and she fires it at the attacking bats....you see her \"dry fire\" the gun when she runs out of ammo.  But automatic pistols lock the slide back when the magazine is empty.  The other very glaring error was the fact that this movie is set in Texas, and the US Air Force is going to bomb the mine where the bats have made their lair.  The planes have French Air Force markings.\"Bats\" was a movie with a good but unoriginal idea, and had potential.  Poor directing and bad execution made this movie a real loser.  If the entire thing had the intensity of the last half hour, it would have really been special.1 out of 5",
            "review_date": "1999-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mad, Bat, and Tedious to Watch",
            "content": "I really can't say much a) that hasn't been said before b) as I switched it off after 36 minutes. Two things stood out: You don't have to be woke to find the African American sidekick a cringe inducing stereotype. When the small town movie theater marquee featured \"Nosferatu,\" film schools have ruined everything. Overall a poor, cynical, and schlocky-and not in a good way.",
            "review_date": "2020-09-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Surprisingly good cast",
            "content": "Very good cast with fine acting. Very rare for this kind of movie. Not a bad movie, worth watching, but man, it's LOUD... lol.",
            "review_date": "2021-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun monstery Flick!",
            "content": "I'm also not sure why this is rated so low. It's in my tier of favorite mutated animal monster flicks.\nYes, completely cookie cutter scientist makes bad human eating ugly animals in small town, saved by heroine and local law hero, but it's fun, gory, appropriately suspenseful, and the ugly bats are SO adorable.\nI also am always a fan of Lou Diamond Phillips & Dina Meyer, and they do just great here.\nDid I mention the bats were adorable? Just like the latex Halloween props you buy to decorate your yard with. Just a bit bloodier.",
            "review_date": "2020-07-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad.......but you can sit through it",
            "content": "This one is bad.  The acting is bad, the directing is bad, the effects are bad....just plain bad.  But, I sat through this bad flick, and when it was over, I didn't really want my money back.  I mean, I tried to follow the notion that, bats are bats.  I mean, they have monster rats, monster cats, now monster bats.  Whatever.",
            "review_date": "2003-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this movie changed my life (for the better)",
            "content": "i am really glad to see that louis morneau has finally found a project to showcase the talent that was hinted at in carnosaur 2. i wasn't expecting much when i watched bats but it really showed me a thing or too! i was totally with all the characters all the time. i mean i was really worried about lou diamond phillips then when that bat was trying to eat him at the end. after they killed cdc guy (i had to walk out of the theater i was crying so hard) i knew all bets were off with these guys. thats some hardcore film-making that you just don't get in an age of brokeback mountaineering. not only does it have great acting, effects, and dialog (this film has one of the funniest black dudes i have ever seen), its got a great social message. i was on my feet cheering when that scientist got annihilated by his bats. let that be a lesson to all those immoral scientists out there trying to make man-beast hybrids (cool as they may be), they're gonna get you. and by \"they\" i mean \"the bats\".",
            "review_date": "2006-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Guano",
            "content": "If you have any knowledge of bats or of science in general this show is not for you. Mad scientist meddling with nature on behalf of evil government creates ridiculous super bats. 5 pound bats flying through vehicle windshields and attacking and beating adult males in single combat-and by the way these were fruit bats the day before. The storyline is at least 50 years old and has been done much better many times. Deep Blue Sea and Lake Placid in 1999 were both considered disappointments but both do a lot better job of \"animal as monster\" and are a whole lot scarier unless you have a particular phobia for bats. Horror movies are not there to educate but the kind of \"check your brain at the door\" science this show relied on really makes you wonder why they simply didn't rely on witchcraft for the origin of these impossible to believe creatures. Horrifying only to those associated with this dud.",
            "review_date": "2000-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie reminds me of China's 2020 lab release of the COVID-19 virus",
            "content": "This movie is about a bat infecting other bats that turns them in to killers. If they would have made a movie about a virus that CAME from bats in a lab, this movie would be a documentary in the year 2020. Just saying.",
            "review_date": "2022-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One very bad film",
            "content": "This movie is bad, but it has a few good moments. I suggest you take a dramamine before you watch this film. When ever the bats attack a person you can't tell what the heck is going on because the camera moves around so fast.  The bats are obvious fakes and during close shots one can tell they are made of rubber. The acting is horrid and so is the dialogue. I was deeply disappointed with this movie. I was about ready to walk out, but I stuck through it.",
            "review_date": "1999-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Off white",
            "content": "Sitting at work, I just really paid attention to how so much of the office is painted in off white.  It seems to be a nice sort of generic color that's not too bland or too loud.  It seems to be a nice atmospheric color, designed to make one feel relaxed and at ease.  What does all of this have to do with the movie?  Well, it sort of eases along..even when the \"action\" scenes are in place.  Like off white paint, the characters, (even sexy Dina Meyer) just sort of move blandly through their pacings.  This thing just floats along(yes, even through the \"funny\" bat attacks) and then it was over.  Funny, once the workday ends I never give another thought to the paint...sort of like this movie.P.S. The herky jerky camera during the bat attacks was easily painted over by all of the blandness before and after the attacks.  Oh, I almost forgot--4.0 out of 10",
            "review_date": "2000-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What happened to Lou Diamond Phillips?",
            "content": "What on earth is up with Lou Diamond Phillips?  Is this really the same man who performed marvelously in Young Guns I/II and La Bamba?  This is, by far, the worst performance of his career.  I can't believe he even agreed to this ridiculous bigotry-stereotyped role.  I expected much better of him.Overall, the film was not terrible.  It wasn't good either.  But it is good enough to sit through without changing the channel (I wouldn't pay to see it).  The acting actually wasn't that bad, and the writing was decent.  The special effects were horrible though.  The F/X guys couldn't seem to decide on exactly how big the bats were supposed to be.  In the beginning, they appeared to be about the size of normal bats with a 12\" wingspan.  But in some of the 1-on-1 attacks on people (this was the worst part of the movie), they appeared to be 40+ lb monsters with 4-ft wingspans!  And the close-up shots of the bats were so dumb.  They didn't look like bats at all.  They looked like plastic toys with moving gears.Another bad part of the movie was the jumping around of the camera.  During the most intense scenes, the camera jumped from scene-to-scene so fast, you couldn't make out exactly what they were supposed to be showing.  Calm it down on the camera jumps fellas.  Quick jumps don't add to the intensity; they just make you dizzy.  This was definitely the dizziest I'd been since forcing myself to sit through an entire showing of Blair Witch without vomiting.I still don't understand why directors feel the need to personify deadly creatures in horror movies today.  The stupid head and eye movements and cunning (crawling up your back) of the bats was simply unbelievable.  This reminded me a lot of the worst creature-horror movie, Anaconda.  If you thought the bats looked too silly to be real, you'll get a real kick out of that stupid snake.  Anaconda was more like a cartoon than a motion picture. And somebody PAID to see that garbage?I give it 3/10 and it's just good enough to watch on cable on a night that you had no plans.  Don't expect a lot, especially out of knee-slap hicky Sheriff Lou Diamond Phillips.  Yuck.",
            "review_date": "2000-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What will they think of next?",
            "content": "For Hitchcock it was birds, for the 70's (Jaws) it was sharks. In 80's (Arachniphobia) we had spiders. Now bats. With each species the films get worse and worse. Well, you know what I'm doing to do? I'm going to come up with something here. Humm, let's see here...well there's jellyfish, elephants oh, I know bees...Yes! I think bees are kinda scary. I'll just sit at my computer for 20 minutes and write a script about killer bees. I'll set the story in a small Mid-western town and have these bees rain terror on a bunch of small-town folk! This is so cool how all this is just coming to me! Now what's a state that has not been used...hummm...Nebraska, yeah Nebraska. Now then I'll have a sexy scientist character come to my little made-up Nebraska town to investigate...no wait, how about an FBI agent with a background in insect study?! I'll make several million off this and retire at the age of 24. Sheesh. PS Lou Diamond Phillips I still love you",
            "review_date": "2001-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dumbest movie EVER!!",
            "content": "If Lou Diamond Phillips gets top billing on a movie, you KNOW it is going to be bad. The acting is pitiful and the storyline is dumb, dumber and dumberer! I don't know how anyone can even sit through this movie without wanting to change the channel or walk out of the theater. And, wasn't this a theatrical-released movie and not a made-for-TV mess? That makes it all the more laughable. It is as bad, if not worse than \"Deadly Invasion of the Killer Bees\" with Robert Hays. Typical tripe with B-movie actors and/or has-beens. Although I would have to say that Lou D. Phillips never WAS, so he cannot be a has-been.The story is ridiculously laughable. The movie itself isn't the LEAST bit scary or tense. If it were at least somewhat suspenseful (such as the movie \"Tremors\") it might be worth a look. But, it doesn't even rise to this level. You have to wonder how anyone who was in this movie can keep a straight face. Everyone KNOWS bats don't attack people -- it almost takes a supernatural, unrealistic creature to pull of a movie like this and make it scary. Bats don't do it.",
            "review_date": "2007-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "ARRRGGGGGGG!!",
            "content": "Words can't express how bad this movie is....The dialogue is so painful. I can't express how bad this is. The acting is bad, the writing and plot are horrible the whole thing is bad...bad..bad. I gave it a 1.",
            "review_date": "2001-09-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very very very bad",
            "content": "the film opens promisingly with some decent Spielbergian-stock set shots: 2-shot; close-up; group; close-up;...and I began to think that this might not be too bad.  But then the BATS show up and they are ugly, cheap plastic looking pieces of crap from the dollar store that make some odd rattle sound that I think is usually used in jungle movies with lots of snakes.  All the bat attack scenes are messy, out-of-focus, unwatchable.  It's really sad because this movie probably could've been okay, but that was really only for ten minutes, after that, the movie turns to a big wet load of guano.",
            "review_date": "2000-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'd rather eat a diseased chicken",
            "content": "can't this director get a life, let alone a job? God! He's so bad! I feel bad for the screenwriter, John Logan (Gladiator, Any Given Sunday) who seemed to have a frightening idea in his head and, low and behold, Louis Morneau, acclaimed director of Carnosaur 2 and Soldier Boyz (which sounds like a band), says, \"me first!\". I can see this loser smiling as he directs this movie, thinking, \"ah what sheer brilliance!\" (if he's capable of that big a word) as he watches the most suspenseful scene of the movie, the credits. And then for his way to handle the actors. Spare me the horror. Dina Meyer needs a job, a friend, or a psychologist because she's pathetic. Lou Diamond Phillips better go start playing drug thieves again in a Steven Seagal movie if he wants to stay alive. Oh and how about the police rookie who looks like John Rocker? Hmm, he was fantastic! NOT! Kudos to the special effects for their mastery of cardboard and 8 feet wide pixels that try and compose bats, which more look like globs of mud. And the sound effects. Haven't heard that much shrieking from flying creatures since Cher came out with a new album. And the editors. Some guy wrote way up above me that the editing was good. Let's analyze the editorial brilliance. In the second scene, Meyer and Leon, some creepy dude, are examining harmless bats. A helicopter sneakily comes up on them and makes them jump (DEN DUN!) which adds to the sheer horror of the scene. You see them argue and moan before they get into the helicopter, and in the next scene they're leaving in a plane. What is this? The helicopter have Firestone tires or something? The cinematography is more erratic than Kaminski's brilliant \"Saving Private Ryan\", or something through the eyes of Ray Charles. Oh one more thing before I leave. Some extra gets killed when he's riding a bike, humming to himself. Does he notice the swarms of cardboard mudglobs flying above him, hitting everyone, and hear the splatter of their corn syrup blood against the windows. No! Because LOUIS MORNEAU IS TOO DUMB TO NOTICE! AIIIIIIHHH!",
            "review_date": "2001-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It will probably get an Oscar or something...",
            "content": "Wow, what an amazing movie.  The computer that was able to locate bats coming through some kind of radar really impressed me.  I need that program for my computer.  Too bad it only exists in the wonderful world of \"Bats\".  I am really happy to have spent $4.50 on this movie... because I realized just how one can waste millions of dollars on plastic bats that are of lower realistic quality than a Pizza Hut \"Land Before Time\" puppet.  I mean seriously, this was a completely ridiculous journey through suck land.  I have made better movies by accidentally hitting the record button on my camera while the lens cap was on... at Lame-Fest '98.  Anyway, run away from this movie at all costs... even your life.  Because you'll probably end up snapping your own neck to relieve yourself from the eyeball torture that \"Bats\" induces.  If someone gives you this movie as a gift, do the following; cry and tell the person you have never been so insulted in your life; then slap/punch them; burn the movie and spend $25,000 to have the ashes sent to into space; move 2000 miles away and never talk to that person again.  Yes, it is that bad.",
            "review_date": "2000-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You'll laugh, you'll cry...",
            "content": "\"Bats\" is, first and foremost, a comedy. Too bad it's not supposed to be one. The laughs come fast and furious right from the start when (you guessed it!) two teens in a deserted area of a small town  get ripped to shreds by marauding bats in a scene shot, like all the attacks in this movie, shakily, as if by someone holding a camera during an epileptic fit, which only serves to make obvious what the makers already know: these vicious monsters are about as terrifying as Big Bird and just as realistic. (They kind of look like a discarded design for Yoda.) Watch for the moment when one the leads picks up one of them: try not to laugh when it's crystal clear its wings are made out of cloth and that the actor is jiggling it about in an effort to give it the appearance of something other than a rubber toy! You'll also delight in watching the talented and handsome Lou Diamond Phillips (sporting a cigar and wavering 'Southern' accent) continue his descent into the movie trashcan, though he at least knows this is a lost cause, something which cannot be said for the deadly-serious Dina Meyer (whose character, a scientist, is -- you guessed it! -- \"the best in her field\") who performs as if this is some sort of Shakesperean drama and proves her home really was \"Beverly Hills 90210\", in which she had a brief role; she's not entirely unappealing but someone should have taken her aside and told her to relax and have some fun. That same someone should also have taken the time to have a little chit-chat with co-star Leon, who can give, and has given, good, solid turns, but here performs his role as written: Steppin Fetchit. It's an embarassment bordering on offensive. Other than this, just sit back and be entertained by every horror movie cliche trotted out gleefully and constantly.",
            "review_date": "1999-11-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No ifs or BATS!!!!! Do you see?",
            "content": "It beggars belief that anyone can call this film \"bad, but not funny bad\" (let alone that anyone could think it's genuinely good). It's hilarious. Especially when you're halfway through a big bottle of vodka (very important all-purpose bad film tip for you there).Oh yes: killer bats! Lou Diamond Phillips! The warden out of The Shawshank Redemption! The woman who wasn't Denise Richards out of Starship Troopers! One of the blokes out of Cool Runnings! The worst bat effects since Hellgate! The worst dialogue since... Hellgate! It's all here. And what's particularly endearing is the director's eagerness to show the bats in close-up all the time, when they look like he's just bought them in bulk from a joke shop down the street and he's working the mouths with his fingers just off-camera.When Lou Diamond Phillips was out on that street pretending to struggle with the big grey bin liner (sorry, 'giant mutant predator') stuck to his back, Young Guns must have seemed so very far away...",
            "review_date": "2001-05-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just plain god awful! Puke!",
            "content": "This is the worst movie on all levels:  acting (lack of), script (non-existent), effects (they went to Ben Franklin and spent $1.99 on a dozen plastic bats).  A waste of celluloid and DVD discs.  Remember \"Empire of the Ants\" (w/ Joan Collins) or \"Food of the Gods\" ??? Same animal. This could have been made in the 70's and would have fit right in.",
            "review_date": "2001-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crappy Bat Effects",
            "content": "When I watch a monster movie I don't expect a ton. I am not expecting top class acting and insane twists and turns.However I do want to see some gnarly and cool looking creature effects and Bats doesn't have it that at all. For a movie of it's budget the effects in Bats should look better than they are, and I'm not just talking about the awful late 90s CGI, but the actual practical bats legitimately look like rubber Halloween bats from party city.This sucked I felt bad for Lou Diamond Philips it looked like he wanted a nap the whole time he was on screen.",
            "review_date": "2022-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "cool",
            "content": "this movie was actually pretty cool. i didnt even want to see it becausei'm so sick of these corny movies they try to pass of as scary. i wasntreally scared by the bats, which were a little fake in my opinion (atleast the close ups on the really big ones were) but i'm not scared ofreal bats either, so that may have somthing to do with it. i absolutelylove Dina Meyer she has been one of my favorites since dragonheart cameout. the rest of the cast was cool and funny,and the effects, like theblast and the flame thrower were awesome.",
            "review_date": "2001-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad Bats Bad Movie",
            "content": "lou diamond Phillips was the reason I rented the DVD.  now I know what I would have missed if I didn't rent it.  My advise is you are better off NOT watching this 'thing'.  Everything that is wrong is wrong.  A bat is big at 1 moment and in the next scene it is bigger.  Same bat different size. plastic bats??? bats with canine teeth.  Bat digs through dirt. Bats act better then the Actors, oops the bats were the actors, actually there was no acting.  Bad Movie, Bad bat. *1/2   out of *****",
            "review_date": "2000-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Suck this!",
            "content": "Standard `We changed them to wipe out the Bat population but its all gone horribly wrong' scenario with Phillips as the small town cop suddenly surrounded by partially eaten bodies and terrible bat puppets.  Writers assume you'll know why the bats are going crazy and don't bother wasting time and money putting the explanation on film.",
            "review_date": "2002-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could have/should have been much better",
            "content": "This movie is one of the first from a new fledgling movie studio so I guess I can forgive it's general stupidity.  Lou D. P. is a decent actor but is prone to overacting and in this one he REALLY does.  He's good in roles that call for that but in this one he was passable in the first half but it wasn't until the 2nd half to last 1/3 that his overacting was offset by the action of the film.  The acting overall left somewhat to be desired and the film was rather boring during the first half.  During the 2nd half it finally began to wake up and come to life and about the last 1/3 was actually enjoyable.  It didn't have enough of a budget to do it up right. Mind you, I realize that having a big budget and lots of flashy well done effects don't guarantee a good film or a hit but it certainaly helps when the movie is an effects type of movie as this.  Again they're a new company and don't appear to have the backing of a major studio so it can be forgiven as growing pains.  On the other hand because of the low budget (12 mil) they're likely to do well enough to make a profit and maybe to more with future pictures.  The movie is ok to see but I'd make sure it is either a matinee or even wait until video.  It's just not worth the full price.  But if you go see it, don't walk out.  Go ahead and stay through the end because it does get better in the last part.",
            "review_date": "1999-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Actually not that bad..",
            "content": "After reading the horrible comments, and the very low rating here on IMDB, I just had to watch this film. An hey - with Dina Meyer in it, could it really be THAT bad ? The answer was no !I honestly don't understand all the bad comments here on IMDB. The movie has a decent plot, and the actors are somewhat believable. There are a lot of clichés - but so what ? Can anybody name just ONE recent Hollywood production that isn't full of clichés ???My rating of this movie is a solid 7. That is to say: It is a decent B-movie worth watching. Special effects could benefit from a higher budget, but Dina Meyer's cute face and believable acting saved the day - and the movie. She proves herself to be the next-generation Ripley ;-)Now all we need is a bunch of aliens, rather than mutated bats... Because everybody who gave this film a bad rating probably  LOVED \"Alien\"... right ?Godtcha !!!:-D",
            "review_date": "2002-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "YUCK! Dumb....",
            "content": "Lou Diamond Phillips attempts to do a Kevin Bacon type(Tremors)horror movie spoof. But fails.. Dismally.Basically the evil government creates nasty bio-bats who kill everyone not on full pay.The evil government then wants to blow everyone up, but Kevin (oppps.. Lou) saves us all...It should be called \"Bats\" 3.. cuz only the third remake could this bad!Dull, stupid, and Lou are getting old....",
            "review_date": "2002-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is virtually a remake of Nightwing 1979",
            "content": "I kept thinking boy does this look familiar. Nick Mancuso was the sheriff, killer bats, carnivore bats. I think this was done one time too many.The main difference is Indian medicine man and magic versus a crazy scientist. The end result is virtually a remake.They both are set in the desert Southwest with a sheriff that is Hispanic or not white.Watch the original movie, it is better. Nick Mancuso was more believable as a rural Southwestern sheriff. Lou Diamond Phillips is usually good, he just seemed like his heart was not in this movie. I think that the Indian medicine man was a more interesting plot twist. The government experiment that went horribly wrong was lame.Just my humble opinion, Edouard in Phoenix",
            "review_date": "2008-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad, Could've Been Worse",
            "content": "I watched this movie on a Saturday afternoon when I didn't have anything to do for a couple hours. It was on TV - so, I technically didn't have to pay anything to watch it. Just from the name of the movie, I wasn't expecting much, and I wasn't overly disappointed because of this.The basic plot is this... A mad scientist (played by Gunton) invents a new breed of bats that the US military hopes to use as a super-weapon. Unfortunately for a small Texas town and its sheriff (Lou Diamond Phillips), the scientist lets the bats loose. They soon start killing animals, and then people, causing havoc in the town. A doctor (Dina Meyer) and her assistant join the party (Leon Robinson) to try to destroy the homicidal bats.The acting throughout this film is bad, but not as bad as other films (even some with larger budgets). Special effects in this film are average, but could've been a lot better for a theatre release. The plot is thin and flimsy and has a lot of wholes in it. And the dialog is unrealistic and cheezy... not much thought seemed to go into the script.This is the type of movie that would've fit in better as a TV-movie or a direct-to-video release. I'm surprised they bothered releasing this to movie theatres.If I had spent the $7 - $10 to see this movie when it first came out, I would've felt cheated. If I had spent the $3 - $5 to rent this movie, I would've been disappointed. But, I didn't spend any money to see this and I didn't expect much to begin with. If you are into the sort of movie that seems so bad it's funny, it might be worth it to you to rent this movie or to see it more than once on TV. Anyone else, if you are bored and have nothing better to do, this is a good time waster and it will keep you entertained. But after you see it, I doubt you'll want to see it again.Rating: 5/10",
            "review_date": "2003-05-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "okay...................look....",
            "content": "i've read almost all of the comments on bats ,and people have slammed this movie relentesly.........it's just not that bad.....when you go to see a movie about killer bats what the hell were you expecting...an oscar winner!!!!..this movie is great for what it is a funny outraguos horror movie...i thought it was great!!!....some people took issue with the \"typical\" bad scientist in the movie well ..the character was right on the money....scientist do the things they do not because they need to but because they can!.......and the actors in this movie are great actors!..granted this wasn't there best work...but lou diamond,leon and dina meyers are all great actors that have done some great work.(espically meyer)has anyone noticed that this girl could be the greatest female action star alive?!?...she is extremly physical,buetiful and does all her own stunts....she's strong and muscular as hell!......she has fought aliens,bats,dragons and the mafia and and looked dam good doing it.....she is an actress who is ready to explode as an action star....she just hasn't been discovered yet...any way the movie wasn't that scary but for the genre it was great...5/5 stars!",
            "review_date": "2003-09-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Restored my faith in Hollywood's ability to make unintentionally funny crap",
            "content": "I was one of the apparently few dopes to plunk down actual money and see this new in the theatre.  After encountering it again recently on the Sci-Fi channel on a lazy Sunday afternoon, I'll stick with my original impression: it's bad, but in an entertaining way.  It looks like a real movie, but it has all the best hallmarks of those endearing crappy B-films from the 1950s and 60s.  These include: horribly fake-looking monsters, laughably bad dialogue, a ridiculous script, and one-dimensional cliches for characters. Funny mainly because it seems to take itself seriously (unlike, say, \"Eight Legged Freaks), the movie's hilarity stops only when the black actor delivers yet another embarrassingly unfunny \"Negro comic relief\" line.Not the best \"good-bad\" movie ever, but still recommended for folks who like crappy movies that are unintentionally amusing and thought (like I did) that Hollywood couldn't make them anymore.",
            "review_date": "2003-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A lot of guano",
            "content": "\"Bats\" is a not a movie to be taken lightly.  It should be firmly grasped by the throat and throttled. I like horror & SF movies a lot and can usually find something entertaining about them even if it's badly done.  Hell, really bad SF & horror movies are very entertaining in spite of themselves!  But I found nothing amusing about this dull cliche-ridden film.",
            "review_date": "2000-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ahh muppets...",
            "content": "I am not a fan of bad movies in that I purposefully seek them out, but when I see a (funny) bad movie I can at least laugh.  I have sat through \"Challenge of the Super Friends: Attack of the Legion of Doom\" and found it downright funny.Bats, while not the worst movie I've ever seen (I reserve this title for Mission to Mars and Phantom Menace), is still pretty bad. But at least it is funny.  I honestly believe that the people who released this movie KNEW it was bad, but decided to release it anyway.  They were being \"scientists\" and attempting to see how well this stinker could do.  Who will pay $13.50 to see this movie? Will they ask for their money back? Who will LIKE it? How can we clone them?That aside, Bats should be played in Film classes. Not for its merits, but as an example of what NOT do do, especially when it comes to the camera work.  In TV they use a technique called a one shot, one shot, two shot (I may be a little off on the title here. I don't work in TV). Anywho, this is basically a description of how to film a conversation. Film one person's face, then the other person's face, then them talking together. Its a formula. Its an EASY formula. The director of Bats thought, \"hey! I can use that!\" And he does...for a conversation of 6+ people. It is the most disorienting thing I have ever watched. There is all of this quick cutting around the circle of people in an attempt to give them all their screen time. And just when I started to feel like I was going to yak, they did what should have been done in the first place: film all of them standing and talking together (the \"two shot\") in a semi-circle that is diguised to not look like a semi-circle (Hollywood does this so well). Why didn't they just do this in the first place? Were all of the actors clamering to get their close ups?  We may never know. What we do know is that that technique should never be employed for conversations greater that 2 maybe 3 people and each person should have a few lines before the camera is cut away, not just \"No\".There next filming mistake was the attack scenes that go on for a few minutes, but you still never know what is happening, or what happened until you see the corpses. Again to much fast cutting, and now blurry images as well.Now to step away from the camera stuff, we will examine the Bats themselves. I'm sorry, did you say Kermit was your father? I am a fan of muppets.  I liked Yoda as a muppet and was royally p***ed off when Lucas CGI'd him. But I like good muppets and only in their place. In sci-fi you can handle them, but in a killer animal movie?  The killer animals need to look REAL in order to \"scare\" us (the quotes here are being used sarcasticly). They should not look like something the director picked up at Toys R Us.The last major problem I found was with our so-called heroes.  Man do I hate idiot movies.  You know where the plot is only furthered because the characters are complete morons? I mean this chick is supposed to be a scientist! An EXPERT in Bats.  Shouldn't she KNOW how to get rid of them or catch them? Plus given the choice between having killer bats take over the whole continent or nuking the crap out of this small town so that they're gone forever, well just help me down with this missile. Oh, but we can't use nukes, they say. I'll destroy our quaint little town and our way of life. Ummm...so will the bats. The bats will also destroy all of the people on the rest of the continent except possibly the people in the Yukon. Stupid, stupid heroes.But all of that said, I did actually like watching Bats cause it gave me something to laugh at and then rant about, which is always fun.  I didn't go into the crappy dialouge cause after Attack of the Clones bad dialouge has a new high water mark.  Dialouge would need to be something SPECIAL to beat that putrid mess, and Bats, while bad, does not even come close.",
            "review_date": "2003-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Bats\" Bites",
            "content": "Fake-looking bats with an attitude starts wiping out stupid Texas hicks before zoologist Meyer and Sheriff Phillips gets into action and end this dreadful cross of \"Outbreak\" and \"Jurassic Park.\" Definitely one of the worst films of 1999 that should've been tossed on video release instead. The CGI was fairly impressive, but the little model bats are laughably ridiculous - as well as the rest of this clunker. Don't bother watching this movie if your I.Q. is above 75 otherwise you'll enjoy it.",
            "review_date": "1999-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Modern B-movie - Pretentious Cinematography",
            "content": "I like this kind of movie.... doesn't scare you, just rolls along... Great late-night TV movie type fare.......BUT!!!!!DREADFUL shaky camerawork, perspective shifting and other tacky effects are used to hide the action when it does happen. Really nasty stuff....The editor/cameraman should be forced to watch it for 24 hours solid.HATE this kind of mess!",
            "review_date": "2003-11-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a corker of a film! bats will knock your little cotton socks off!",
            "content": "A fantastically awful film, 10 out of 10 for effort! the special effects are horrifically cheesy, but that only adds to this films appeal!lou diamond phillips tries valiantly to pretend that he's in a proper movie, but even his efforts cant save this late night guilty pleasure from stinking.every horror movie cliché (and I'm using the word 'horror' here in a purely generic sense) is employed to little effect. my particular favourite involves two 'naughty' teenagers, getting up to consensual mischief in a parked car.despite all this, 'bats' is a must-see film, if only so you can know how truly terrible it really is!",
            "review_date": "2005-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "bad movie! go to your room!",
            "content": "I hated this movie.  I laughed a few times, but they were laughs born out of painful disbelief.  Out of the current wave of monster attack movies (Lake Placid, Deep Blue Sea, Anaconda), Bats is by far the worst.  Yes, Bats is even worse than King Cobra!  Filled with cliches (the evil mad scientist) and unbelievably stupid actions on the part of the heroes, Bats has to go down in history as one of the bottom 20 most idiotic horror movies I have ever seen.  The stupidest scene:  after the bats attack the police and attempt to enter the police vehicle and kill the occupants, the bats mysteriously fly away.  Now, it is still night, right?  But for some reason, the cop/scientist/government team that was just attacked hang out in the open and discuss tactics, right there where they were just attacked, in the middle of the night with no defenses!  This movie is filled with stupid scenes like that and with multiple, overlong \"gearing-up\" scenes. To give this movie a little credit, the bats themselves act ridiculous when attacking, but they aren't as funny-looking (to put it mildly) as the creatures in say, Hobgoblins or (my personal favorite) The Sea Serpent.",
            "review_date": "2000-09-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Who Paid For This?",
            "content": "I saw this for free, and I feel like they owe me money.  Not one original or even interesting point in this senseless mess (except for the presence of Dina Meyer and Bob Gunton, both of whom, like everyone else involved, should have known better).  Lots of swinging camera blurs to mask crappy special effects and rubber bats that even Roger Corman would reject.",
            "review_date": "1999-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too Many Bats",
            "content": "Many movies are built around the \"billions of creatures attack\" theme. Them, Gremlins, and god's gift to mankind, Aliens. Bats is just like those classic tales of man vs nature/gremlins. Except for two things.1. It's not good.2. It has bats in it.Oh and the plot has a tendency to be really bad. Apparently scientists have been trying to engineer a super bat using a virus. When a bat gets this virus then it becomes larger, smarter, meaner, etc ad infinitum. A bat can get this virus from an already infected bat. So, one of these bats escapes from the lab, using its super intelligence no doubt, and gets to a bat cave.The movie has Lou Diamond Phillips as its hero. That poor devil has been in so many awful movies, Supernova and Red Planet coming immediately to mind. He needs to flee like a startled rabbit from the next script they hand him.Anyway, the whole movie just hit rock bottom with its plot and terrible special effects. Actually, change that. Not the whole movie. The ending was the best ending for a movie I've seen in a long time.I'm gonna change this from 2.5 to 3 stars just because of the ending in fact. Excuse me for a second.So, watch this movie just to see the ending. And to cut poor Lou some slack. In fact send him some money too. He deserves it.",
            "review_date": "2003-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful",
            "content": "Bats is a movie with a very, very, weak story and villain, and the only good part about it is the acting done by Lou Diamond Phillips.  The story is simple: genetically mutated bats escape from a lab and the scientist who created them gets the help of two bat experts who get the help of the sheriff (Phillips) to hunt down their flighty foes.  The special effects are bad.  The only time the CG of the bat swarms look convincing is from a distance.  When the bats aren't cartoonish CGI they are animatronics that look more like monsters rather than bats.  In one scene, the bat expert Jimmy, says to the scientist, \"If one of those bats toutches me, if it moves his head around (while saying this he rolls his head on his shoulders) and even seems like it's going to LOOK at me, I'm comin' after you!\"  When Jimmy is desribing the bats head movement, it seems almost like he is making fun of the way the puppet bats move around.  The bats also vary in size from a regular sized bat to a large bat with a wingspan of about 4 feet!  The people in this movie are idiots!  An officer is cornered by a group of bats in a diner, and all he has to say, with gun pointed at them is, \"Stay back, don't move!\"  In another diner a customer is getting mauled by a large bat, but the little kid near him doesn't notice because he's too involved in an arcade game.  I could go on more about that, but I won't.  The scientist character is a poor weak character (not really the actor's fault, more the writers) upon getting a hold of a bat, the scientist, stereotypically says, \"I must study it!\"  And, (WARNING! SPOILER AHEAD!) it turns out that our beloved scientist released the bats on purpose, as he later reveals.  That whole plot surprise right there is the most ridiculous thing I've ever seen. So this guy decides to be all evil and for NO REASON WHAT SO EVER, except just to make him a bad guy, he releases these aggressive, carniverous bats on a small town.  Stupid.  I actually kept slipping in and out of sleep during the end.  This movie is terrible in most aspects.  One good point in it, though is Lou Diamond Phillips, who does a very good job acting as the sheriff.  Overall, avoid this movie, unless you want something that is loaded with pointless, stupid plot twists and story.",
            "review_date": "2000-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why?",
            "content": "*May contain spoilers* The greatest thing about this film was its budget. That must have been big. Other than that it was incredibly predictable and sad. So there are these people who work with bats. One is the \"sexy\" smart, save-the-day woman and the other is the comic-relief black guy. They are asked to go to the town of Gallop, Texas to help with the bat problem. They meet a tough cowboy guy, and the scientist who created the evil bats. The scientist looks scary and drops \"subtle\" hints. Bats attack, they barricade a school (why a school? I don't know). They play opera music, the black guy doesn't like it, hilarity ensues. Then they get attacked by the evil bats. Shockingly, the chicken-wire doesn't hold them off. Equally shockingly, the generator doesn't work, so they can't electrocute the bats. And, most shockingly of all, the scientist guy tells us that he created the evil bats... ON PURPOSE. Then the bats kill him, the rest go to the bat cave and kill all the bats and they all live happily ever after. Bad, bad movie.",
            "review_date": "2003-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Delivers what the title promises",
            "content": "The title tells you what this movie is about... and that's exactly what you get. Bats! Lots and lots of bats! A mix of Arachnophobia meets The Birds, Bats came out at a time where monster movies weren't big at the cinemas, but it has enough horror movie undertones to make it qualify for the climate of slasher flicks that were popular in the late 90's.And for as many movies as there have been over the years with bats in the background (mainly vampire flicks or any of the Dracula pictures) the nocturnal rodents hadn't realy had their moment in the spotlight. In this film, it's all about the bats. Of course there are stock-standard human characters, who either battle the bats or get killed by them, but the movies soars best when it focuses on the flying killers.Set in the small town of Gallup, Texas, the local bats are actually far from local. As we quickly learn, they were a science experiment overseen by a controlling doctor who wanted to see what would happen if he could make the bats better. Claiming they escaped the lab and were probably breeding with local bats, the scientist is joined by two wildlife zoologists and the local sheriff, who are all pulled into the dilemma to find the bats and bring their blood-soaked reign of terror to an end. And as you might have expected, these are no ordinary bats. They are highly aggressive, coordinated in their attacks, and seek out humans as a snack.Our human characters in Bats are not very-well written, but most of the cast does their best within their cliched roles and limited character development. Some of the lines are downright garbarge in every sense of the word, or mostly just exchanges between characters which serve as providing key information to the audience. The film is most enjoyable when the people just stop talking and the bats start stalking.The idea of thousands if not millions of vicious bats filling the night sky to the point they black out the moon, and descending on a small, unsuspecting town to wreak havoc, is enough to make anyone run and duck for cover. And it's in these scenes, even with their inconsistent special effects, that the director shows some talent at staging a variety of climatic moments. There is the standard attack at the beginning of the film, where the bats pick off a couple making out in their car. Then there's the attack on the towns people, followed by our heroes barricaded in a school they've boarded up with wood and electric fencing.The film does explore imaginative ways to show bats attacking people, and whenever a close up of the feral creatures are on screen, you will see a face that is angry, evil and sinister, which can often come across as comical, but also a bit frightening when handled properly.If you don't like B grade movies about bats killing people, you won't be interested, but if you're open to this kind of thing, you will have some fun with Bats. It's short, swift, often funny, occasionally exciting and never demands very much from you.",
            "review_date": "2020-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie ever award",
            "content": "If i could give this movie a .5 I would. Im in 100% agree with the AWFUL category to which most reviews lean toward ... very very bad bad movie. There has never been a single movie in my life to which I've been able to actually say I did not like, perhaps hated, every single aspect of. Even for any other extremely horribly mind numbingly BAD movies... usually they at least have ONE good thing to say about them. The Postman for example... for it I could say, \"Hey well the first half an hour is a pretty awesome flick!\". Well so then Bats came along and took away X amount of time from my life to which I'll never get back and be horribly scared by for life.I was hoping ide enjoy the camp, as i often do... but no. Im usually very tolerant with movies as well and enjoy a wide range. This was just so damn bad.. oh god just saying \"Bats\" out loud or to type it makes me feel sick.This movie is just God Awful and hurts the brain. Never rent it, Never buy it and Never watch it simply because your obviously retarded friend suggests the idea. Run away if forced by someone and destroy it if given as a gift.There simply IS NO WAY and not enough space in the world to sit here and list / describe all the problems and questions this movie has and creates... this is why this review is simply over and over drilling into your brain how BLOODY BAD this movie is.Be aware. Stay Back. RUN AWAY.",
            "review_date": "2009-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bads.",
            "content": "Want to see a sci-fi movie with killer swarms of deadly creatures?Go see Starship Troopers.Want to see a really scary movie with blood and gore and violent attacks?Go see Event HorizonWant to see just one good movie with Leon in it? Go see Cool RunningsWant to see a really bad movie? See this one.The only thing that stopped me from walking out the theatre door was that I was laughing too hard to stand up. Bad filming, bad plot (two killer bats that can communicate...no way),bad props, bad acting (Lou Diamond Phillips, I loved La bamba, but you just can't pull off a Texan accent)... bad everything.An example of this films ridiculousness - near the peak of their \"rampage\", the bats flock into the town and attack the people. One man, who is happily eating scrambled eggs at the bar, is attacked by a bat WHICH IS WALKING ON TWO LEGS. The animatronic puppets look more like deformed puppies than ferocious wing-ed rodents.This movie manages to suck hard every way possible. Rent it just to laugh at the poor people who actually worked on the movie. And Lou Diamond Phillips' bad Texan accent.",
            "review_date": "2000-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Makes me think of the good ol' days, back to cheesy sci-fi films.",
            "content": "Hee hee, this movie is barrels of fun! Like I said in my one-line summary, it makes me think back to the 50's, or, the glory days of bad science fiction movies. It stars Lou Diamond Phillips (how's the career going Lou?) as sheriff Kimsey, Dina Meyer as Dr. Sheila (basically here so she can say things like \"Bats don't kill people\"), and some dude named Leon who is here to (there is not another black man in this movie) to play the comical(and stereotypical) African American sidekick. The movie also has not one original part. It starts out with (gee whiz, dis ain't never been in a horror film before)a young teenage couple making out. The male hears a creepy noise, so he rolls up the windows and drives away. No wait, that's what an actual person would do. As a traditional movie character, he, of course, goes out to investigate. And guess what happens to the couple. Duh, they're killed by bats. During any of the attack scenes, there is always a couple of close-up shots of the bats. Now, on a $6 million budget, they probably couldn't do much with the bats, but holy crap! These are some pretty fake looking super bats we got here! Anyway, if you're into cheesy horror/science fiction films, you'll probably like this movie. I once called this movie Plan 9 From Outer Space for the 90's, but Battlefield Earth stole that title so I's have to call this .....Hobgoblins for the 90's. That works better anyway.",
            "review_date": "2001-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Okay I guess.",
            "content": "This movie is a toughie for me to decide. I would say it's okay. But I'm very iffy about it. I'm wondering what if some other actors would have portrayed some of the characters in this movie, would it make the movie better or worse? The setting was okay but the cave scene was good. Another thought that crossed my mind, was: if they made a sequel would it be better or worse than this film and would it be good? To be honest, when I first saw the commercial which was like 3 seconds - the only thing that I have seen was bats. I thought it would be a vampire-bat movie, meaning that the movie would be about vampires attacking a town and having the ability to turn into bats, something like \"From Dusk Till Dawn trilogy\". (I'm also planning on writing my reviews for the From Dusk Till Dawn trilogy.) In conclusion, I have to give this movie a 5 out of a 10.",
            "review_date": "2006-06-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stupid concept + Stupid Title = Stupid Movie",
            "content": "Come on people, wake up!  This was a movie called \"Bats\" about \"Bats\" that hurt people.  Shouldn't that tell you it's going to be a bad movie from the start?  Granted, occasionally you can get some fine acting in a movie with a very bad plot, but not often.  Good actors typically don't waste their time with movies that sound so pathetic, unless they owe backtaxes.  This movie was almost as bad as Chill Factor !!!!!!.  Please people, send hollywood a message by not going to stupid films like these!",
            "review_date": "1999-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "...do not go see this movie.",
            "content": "This movie is very typical of a horror movie.  Unfortunately, unlike some others (such as The Haunting or Dawn of the Dead), Bats has NO redeeming qualities.The plot is typical, and thus predictable.  The acting is average, or very poor.  You will recognize the dialogue as those same lines repeated time and time again in other movies.  You will see the same techniques (not the good ones) used over and over in other movies.  The bats look stupid, and the characters do very unintelligent things.  The movie even has the \"need to start motor - and it won't the first try\" scene...which you see coming several light years away.You can predict early on who will die and who will live.  The bats or the characters make it obvious when the attack is coming - so no element of surprise exists.  What's worse are many of the bat close-ups are filmed in \"confuso-vision\", and you may find yourself looking away from the screen to avoid becoming motion sick.  The great horror movies of yesterday and today make up for a lacking plot and standard techniques by adding \"something extra\".  The director (or screenwriter) of Bats must have been out of ideas.  Unless you are an absolute die-hard horror movie fanatic that must see every one ever made, do not see this movie.",
            "review_date": "1999-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad, but not funny bad",
            "content": "I rented this movie (on DVD) with my girlfriend hoping for either a fun ride or a good laugh.  Unfortunately, I don't think we got either.I think the opening sequence was okay and then it was downhill from then on. The movie was poorly written, acted and executed.  Unfortunately, I don't think it was done poorly enough to be laughably funny.  By reading others comments, you can see what's wrong with the movie.  I don't need to repeat.I can, however, recommend listening to the commentary track on the DVD featuring the director and Lou Diamond Phillips.  This was funny!  Where to begin?  While we see a young couple making out, Lou comments about the perks of acting.  Though I've often marveled at actors getting paid to kiss beautiful people, it comes across creepy to hear the director and Lead actor talking about it in this context.  Creepier then anything in the movie. They also talk about how the director gave the actors the freedom to explore their characters.  For instance, the director allowed Lou to smoke a cigar and had the actress dye her hair a different color.  If you watch the movie, you realize they're not kidding, this counts as character development!  Also, you learn that several of the actors playing the victims in the film are played by locals.  Unfortunately, these locals, in their brief screen appearances, outshine the leads.Hearing these two gush about the film, the special effects and the 'rich' story is the funniest thing on the DVD.  Either Lou finally does some acting on this track or he really believes this movie is great.  And that is funny!",
            "review_date": "2000-10-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Full of stereotypes, but decent...",
            "content": "Attention, this time the threat is genetically modified and made aggressive and ravenous bats! But what a praiseworthy waste of originality! \"Bats\" places itself in the interminable wake of countless movies based on the fear that comes from the animal world, and in particular in that subgenre (so filled with terribly awful movies!) with genetically modified creatures as protagonists. Nevertheless it maintains itself at least on a level of minimal decency, after all it is not that good but there is plenty of worse movies! If not some thrill, at least there's some atmosphere, and for the rest we are in the usual standard of catastrophic flicks, with all their already-seen stereotypes, but the special effects are acceptable.",
            "review_date": "2007-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just as disappointing as \"The Haunting\"",
            "content": "This movie was a bust.  I took my 10 year old to see it for a halloween outing.  She thought it was cute.  In fact she is quoted as saying \"It really wasn't scary at all.\"  This after me asking her are you ready for your first scary movie.Well I guess I should thank the creators of \"Bats\" for a scary movie worthy of taking the young ones.Besides the language at times, this movie is ready for prime time television without any editing.  This movie did nothing for me.  And I'm will not waste another word .........  on it.",
            "review_date": "1999-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh... my... Lord...",
            "content": "I was so impressed by this movie. I never thought I'd see a movie worse than _Gordy_, but this takes the cake! _Bats_ is an INCREDIBLY bad movie. Desperately trying to be like _The Birds_, it doesn't succeed in any way, shape, or form. Why? Because you CAN'T COPY _THE BIRDS_! You can point out direct imitations from Hitchcock's film. Sheesh! The effects of the bats were laughable, and the plot holes were big enough to drive a truck through. The movie had me saying \"oh, PLEASE!\" half the time, and laughing the other half. If you want to laugh your butt off, rent this movie. If you want to be scared, rent it's big brother Alfred Hitchcock masterpiece.",
            "review_date": "2001-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Attack of the Hyper Camera",
            "content": "One previous commenter suggested that the editing was the best thing going for this film. I would go in the opposite direction.  This is so over-edited and over-hyper, that the action scenes are rendered hard to follow, and the movie as a whole is made distancing and uninvolving. For comparison I kept thinking of the somewhat similar Tremors, which took the time to develop the characters and get the viewer interested. Bats just goes for a MTV feel, with constant movement and dramatic music being the director's only concern, and becomes forgettable as a result.",
            "review_date": "2000-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Basic horror movie, nothing to write home about",
            "content": "I just returned from seeing this movie and felt the need to comment when I saw the wide variety of opinons present on this site.  I did not think, as some do, that this movie was the worst peice of fluff ever made.  However, I do not think that it is exactly an oscar contender either.  I found this movie light and easy to understand with a formula plot and cast.  It was not very scary and I felt no fear exiting the theatre after viewing it.  I personally prefer Scream, Halloween, or I Know What You did Last Summer to this formula almost sci-fi thriller with its \"mad scientist\" and conspericy Theory.  I do not think this film is a master peice but it is not trash either.",
            "review_date": "1999-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a public service message from your friend, unknown dave.",
            "content": "I would just like to warn any viewers who may decide to rent \"Bats\" or spend precious time watching on a pay cable station to please stay as far away from this movie as you possibly can.  I have a feeling that if this website had the option of a \"0\" score, \"Bats\" would be blessed with many of them. This is one of the most feeble attempts at a film in quite some time - although, I still haven't seen \"Battlefield Earth\" - and again, I would like to warn any possible viewers to steer clear of this terribly acted, plotted, paced, directed, edited, possibly even catered movies that has come out of the oily Hollywood machine in some time.  Do not watch this film.  Do not, under any circumstances, watch this film.  It is so bad, one cannot watch it with the sole intent of ridiculing the film, as it leaves the viewer depressed and in need of several high priced behavior modification drugs. Thank you.",
            "review_date": "2001-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Baaaaaaaaaaad like a lamb!",
            "content": "When you name your movie \"Bats\" everyone has a general idea what the monster is, though they might not imagine something which looks like a winged Pug. You heard me, those ugly little dogs which appear to have run muzzle first into a wall, with wings. Oh, and they're mean, real mean.Despite an interesting beginning the movie quickly degrades into frontal lobotomy territory, not the least of which is a patented military response. First off they're determined to eradicate the bats through bombs and antitank missiles, then an attempt to destroy the roost at night gets them all killed, since most recruits have at least high school diplomas these days I'd say our public education system is worthless. Not that it would matter, the creatures at hand are nigh invulnerable, only serious firepower can harm them. Bats (Even mutated ones.) are fairly light, this facilitates the miracle of flight, a female ballet dancer rolling over one would do some damage. Except to this variety, it just gets them mad.By the way, Sheriff Kimsey is the best shot I've seen in my life, any guy who can score perfect shooting at flitting targets with a pistol is a God.After losing half the town's population to an attack everyone is evacuated, except the civilian researchers who barricade themselves into the school. Why they stayed in town I have no idea, but it gave McCabe a chance to degenerate into mad scientist mode just prior to his death.With an air strike scheduled to bomb the bat's cave (Huh?) it's up to Sheila and Kimsey, they must carry out the original plan: Turn on a huge refrigeration unit and freeze the creatures to death. Too bad for the bats, they're only highly intelligent when the script requires... ...such as destroying a member of the swarm when it has been captured and fitted with a tracking device, the idea to change caves after being discovered never dawns on them.",
            "review_date": "2007-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Night of the Lepus\" remade with bats instead of rabbits",
            "content": "This is a way over done theme. Nightwings had a better story and scarier bats. Lou Diamond Phillips looked and acted like he had only shown up for the paycheck.About 1975 Rory Calhoun made \"Night of the Lepus\", about genetically altered jack rabbits that decimated towns and wiped out herds of longhorn cattle. \"Bats\" is a poor remake with no redeeming qualities.Dina Meyer (Starship Troopers) tried hard but this was a lousy vehicle for her.",
            "review_date": "1999-12-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "what do a hick sheriff, hot chick and the standard funny black man have in common? this movie.",
            "content": "This movie seemed as if were filmed on a 100$ budget, very bad camera work. Too many stupid plot twists, like how the scientist suddenly turned evil? Too many magic mericals, like how the obligatory funny black guy is the smartest person and can hack his way into everything. wouldn't you expect that if the army got involved with a crisis involving bats they would have at least one bat expert!?! and why in gods name would the government ever need these killer bats? Extremely predictable, you could see that ending coming from a mile away. Bad SE. I think they spent the whole budget on the explosions at the end. I wanted to turn off the movie, just after the first scene, which involved a train and some drunken Teens coming to their gruesome deaths. The hick sheriff turned out to be a soulful Opera fan, who was really very bright and witty? your a hick sorry. the love connection between the Woman and the hick really didn't seem to work. If indeed they were trying to make a connection ,witch they seemed to hint towards, wasn't a big enough hint. Please, only see this movie if you can't handle Horror movies, because it's really really very un-scary. or if your dimwitted and truly believe bats are as big as eagles and eat humans. or did they eat humans? I don't know...",
            "review_date": "2004-05-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't leave me behind! Please!",
            "content": "I figured it out.  Bats wasn't a movie, it was a sociological experiment.  I believe they will use these types of movies in the future to decide who gets left behind when the planet explodes.  They don't want idiotic people to ride the rocket to re-populate the new planet. Hopefully I haven't been doomed and have a chance to redeem myself.",
            "review_date": "1999-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How they got my $3.99 is beyond me.....",
            "content": "All I could say is the best part of this movie was the ending, which sets itself apart from the other \"B\" horror flicks.  I am a little shocked that Lou Diamond Phillips accepted the role after reading the script, the other second rate actors I understand.  And did they have enough oneliners or what? I was wonder when they were going to kill of the guy who was spewing them out.",
            "review_date": "2000-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch out in the dark...",
            "content": "I think that tis is a great thriller. But it is important to see the movie for what it is, and not what you expect it to be.The bats are very natural looking, and you believe that these \"monster\" can and will hurt you. See this movie and  watch out in the dark, the big black bat might take you.Have a nic thrill",
            "review_date": "2000-05-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ugh!",
            "content": "Yet another made-for-TV stinker starring Lou Diamond Phillips, `Bats' is probably one of the saddest attempts at a horror film I've ever seen. Imagine Alfred Hitchcock's `The Birds.'  Now take away every good Hitchcock element of the film and replace the birds with mutant bats with a taste for human flesh.  Mix in a dash of torrid acting by washed up actors and a predictably dull plot and you have the modern marvel of cinema that is `Bats.'  This movie takes itself too seriously to be laughed at like other bad horror films.  Avoid at all costs.",
            "review_date": "2003-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "These bats are smelly in more ways than one",
            "content": "BATS or is it rats I paid how much to see this movie? The film isn't scary in the least, not to mention I think bats are cool not bloodthirsty killers (I mean if they had started out with a bat that actually drinks blood such as the vampire bat then this film would have had a little hope, but no they had to first state that it was a vegetarian bat then quickly change it to be a fox bat (which isn't that bad of a bat)) all in all I gave this film a 5 !Hope that bringing out the dead is  better.",
            "review_date": "1999-10-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BEWARE: Worst Movie Ever Made",
            "content": "This movie was so bad on sooo many levels, it does not even deserve a review.  After seeing Lou Diamond Phillips' performance in \"Another Day In Paradise\" I thought maybe his career was finally turning up.  I was wrong. I don't know who is making his career decisions, but he needs to fire that person, quick.  I don't know what planet the last reviewer was from, but this movie was anything but scary.  First of all, the Bats look like little flying monkeys.  But not even that cool, THEY LOOK FAKE.  This movie might scare a 10 year old girl, but that's about it.  This movie is  what gives Hollywood a BAD name.  It is so formula-driven it makes me sick.  I could have told you the whole story without seeing the ending after about 20 minutes into the movie.  This was the first time I ran back to Blockbuster and demanded a refund, no make that COMPENSATION for being put through the torture of watching such a COLOSSAL PIECE OF BAT-DUNG!",
            "review_date": "2000-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Turn off your brain",
            "content": "This was the most formulaic load of a movie I have ever seen.  If you've already watched The Birds and a few Alien movies, you've already seen this little gem.  The premise of this movie was silly and the follow through was entirely unbelievable.  Furthermore, if you have ever taken Biology or Zoology at the university level, this movie will make you itch.The special effects were also nasty.  Audiences can tell when they are being shown cheap cut-and-paste computer graphics.  And if you don't mind that, I have some pathetic rubber muppets for you behind door number two.I do have one question though.  Why is it that, in the movies, no matter what natural biological entity is artificially given intelligence, it always has to eat humans?  Sharks, apes, bats, plants, insects, the resurrected dead, you name it!  Why don't the super-smart animals ever want to, I don't know, pursue an exciting career in VCR-repair or something?Welcome to Hollywood, home of nothing new.",
            "review_date": "2000-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the Worst",
            "content": "This movie is bad.  The bats look like laughable not scary.  The only horror invoked by this movie is the dim chance some fool would make a Bats II. If you want to see this type of movie done right, watch Pitch Black.  Watch this for a few unintended laughs caused by wooden acting and lousy effects.",
            "review_date": "2000-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Review of Bats",
            "content": "I actually have two different reviews to share of my personal experience with the movie Bats. The film itself is terrible and a mockery of everything that makes Hollywood successful, however when intoxicated the film is tolerable and filled with numerous laughs and provides a jolly good time in front of the tube. Sober: F- Intoxicated: B+",
            "review_date": "2002-06-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Addition",
            "content": "I just had to say something on this film, but noticed how the previous comments said enough, so i thought i'd point out the flaws in-depth. Namely, i'll be pointing out the errors made with the bats (mind you i've been watching now and then as this movie plays, it's not worth my attention). First off, since when can a single bat overpower a full grown man? One bat flings himself at one nonetheless, and instead of grabbing the bat and crushing it under his boot, he decides to bounce around the cafe knocking over everything that's loose. Second, bats are blind any way you look at it, yet these critters seem to have some red vision - and woe the man who views it, for this is not all. The third point is the fact that when shot at, lots of sparks shoot off the bat, power rangers style, apparently these \"mutated\" bats are made of flintstone. The fourth point (and i'm sure there are more, but in total i've watched this movie for six minutes) is that apparently, bat crap gives off toxic levels of ammonia gas, so naturally the people who enter the lair wear space suits with added padded armor.I'd say this sums up some of the ludicrous material in this movie, and you get the point - bad, bad, bad movie.",
            "review_date": "2004-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cheesy",
            "content": "It is wonderfully cheesy. I loved it. It's a fun movie just don't expect high quality.",
            "review_date": "2019-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "What??  Vampire Bats from a modified genetic experiment, makes this movie so bad its incredibly funny.  That's all I have to say, which is why I give this film a *1/2* star rating.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wanting to watch Bats is just for the sole purpose of watching a horror B movie to add to your mental collection. It's very bland and a lot of it doesn't make any sense. If you'd like to hear Lou Diamond with a very \"heavy\" and \"authentic\" Texas accent while fighting off animatronic bats, then this is it.",
            "review_date": "2021-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the biggest problems of the film that it can't decide whether it is a horror comedy or a straight thriller. the film is not entirely unwatchable but this problem causes a big tonal issue.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well another movie where even the maddest of scientist would not be able to make the experiment work. Supposedly the scientist genetically altered a flying fox and it somehow got loose in Tx and started mating with the local bat population. Now most likely the local bats would be mexican free tailed bats which are I'm guessing about 7 or 8 times smaller than the flying fox. That would be like a Great dane mating with a miniature Chihuahua. Being mammals that would be a real tough on the poor female free tailed bats not to mention the poor thing trying to tuck the baby on board to suckle it. But it's not all bad the movie does have some decent actors like Lou Diamond Phillips so it's good to pass some time.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is exactly the B-horror movie it looks like.",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holey rusted metal Batman, this movie sucks. I've been on a creature flick kick lately and rewatched BATS purely out if nostalgia. It's bad. Really bad. Bad cast, terrible plot, horrible cgi, and worse bat puppets. Really nothing positive to say about this clunker, just don't even waste your time.",
            "review_date": "2020-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though hated by many for a non creepy atmosphere and bad plot, I would argue that Bats delivers on a good, entertaining ride with decent acting from the cast and the special effects of the killet flying menace while managing all of it with a low budget. Very underrated by many but is probably the most fun killer animal movie from the 90's~",
            "review_date": "2020-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bats attack residents in a small Texas town, so bat zoologists are called in. It is soon discovered the chiroptera are genetically modified to be intelligent, omnivorous, and vicious ostensibly to prevent their extinction. The warden from Shawshank Prison (same glasses and all!) is the mad scientist who created these monstrosities. Because of the imminent danger posed to the human populace by the bat's new nature, the military is deployed in order to destroy the nest. Dumb stuff and bad acting happens, sans any fright or scare. SyFy level crap you should avoid, even if you are rather chiropterophilous.",
            "review_date": "2018-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Face paced fun entertainment if your down for a movie with bats eating people and attacking a fucking town I can not say this enough watch this fuckin movie",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I bought this movie looking for a flick that was \"so bad, it was good.\" It definitely wasn't good (or at all frightening) so I suppose it fulfilled half of the criteria.",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great little B-movie. Fun to riff MST3K-style.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creature Features Had Died In The 50's Before A Massive Resurgence In The 90's, This Is One of The Better Creature Features Since Their Re-Instatement Into The Horror Genre. In True 50's B-Movie Horror Style, The Creatures Have Been Genetically Modified In Some Way Which Makes Them More Deadly. This One Concerns Bats, A Small Town Is Attacked By Genetically Modified Bats, But When These Bats Come Into Contact With Normal Bats, They Pass On The Mutation, Multiplying Them In Large Numbers. It's Up To The Sheriff & A Bat Expert To Tackle The Problem. Featuring A Decently Written Script, Some Nice 50's Style Effects & A Few Creature Feature Clichés, This Is One Film Which Doesn't Fail To Entertain Fans Of 50's Horror Cinema. The Only Thing Missing However Is That It Hasn't Really Got Any Scenes Which Are Unintentionally Funny.",
            "review_date": "2014-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly made creature feature in the Gremlins/Ghoulies vein that's not scary or gory enough.",
            "review_date": "2013-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy as all hell, and on so many levels. It deserves a lower rating, but nostalgia gets to the guilty pleasure level for me.",
            "review_date": "2013-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bats that suddenly started killing people in packs. That's pretty much all the film has to offer.",
            "review_date": "2013-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unnamed Texas town has a big problem. It is under the threat of a very large pack of genetically altered bats, specifically the breed known as flying foxes. \r\n\r\nA bat expert (Dina Meyer), her assistant (Leon) and the town's opera-loving sheriff (Lou Diamond Phillips) join forces to try to destroy the bats before it's too late. \r\n\r\nThe first thing you will notice is that this movie, which is obviously a B-movie, is that it is pretty creepy. The bats, which look like they are made of rubber at times, are very ugly and shot in dim light to make them creepy. The bats are also well constructed puppets which moved pretty realistically. \r\n\r\nThe acting is fairly good in the movie. Meyers and Phillips are easily the best of the cast. The supporting cast of characters is not written strongly. In fact some of the characters are just there to help advance the plot, and do not much else. \r\n\r\nOne of the things that really help in the movie's creepiness is the editing. During the bat attacks, you see quick flashes of bats coming at the camera as if the bat is coming at you. If this movie was done better with a bigger budget, the bat attack scenes would have been better. \r\n\r\nIf you ask me, this could be a pretty good second choice for a rental if your first choice is unavailable.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this. That alone should keep me from ever getting married.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad cast for a mutated animal movie. they all do a fair job for the weak script. The bats were pretty well done although some of it i did laugh at. the street scene was clearly a nod to 'the birds' but this is not like that film at all. this was okay and at least somebody tired something outer than crocodiles and sharks.",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films ever made imo.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just a bad movie it lets you down at eveyrhting that transpires if it was taken of the face of the earth and never seen again no one would miss it",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this would be a fun creature flick but sadly it is boring and just pointless. The characters are very one dimensional",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bats is horribly directed, horribly acted, not scary, nor creepy, and the CGI for a 1999 film is terrible. Terrible action sequence and the only reason why I didn't give it a zero is because of Lou Diamond Phillips.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bats are totally scary and deserve their own horror film. I mean seriously they could bite you. Then, you would get rabies. Then, in like a year you would start showing signs of it. Then, you would fall into a bat cave, and like the bat poop is bad for your lungs or something...right?",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey, what can I say, I am a sucker for nature gone awry and kills man movies.",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bats is a cliched, overdone genre film about deadly bats. The concept is old, tired and ultimately boring. The films plot is derivative of every other nature gone wild horror flick.Bats could have been something good, but it ultimately failed in delivering anything good to the screen. The film in originality, not providing us with interesting characters or story line. This film could have been good, instead it took liberties from other genre films, and it just became a big cliche riddled film. The payoff of the film is weak, and overall this is a lazy effort. The acting is sloppy, and is complemented by a very poor script. Bats is an example of a film that has had the misfortune of being in a genre of horror film that really is not interesting anymore. I mean, the nature gone wild genre has covered so much ground in the last three decades. Starting with Jaws, to Grizzlyu with Piranha, Alligator and Arachnophobia and culminating with Lake Placid. There has been other killer creature films since, but what separates this film from the newer films are that these films such as Rogue used cliched ideas in a refreshing way and had a good, well constructed script that used suspense and terror effectively well to tell its story However Bats doesn't do that. Bats uses cliches with a bad script, and it doesn't work. Stick with Jaws, Grizzly and the more recent Rogue. Bats just doesn't cut it, and it suffers from being a bad B movie that is more hilariously bad than scary. As a bad film, this one works, as a horror flick, it doesn't.",
            "review_date": "2012-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple formula: Rubber bats + Lou Diamond Phillips = Win. Well, so you would think... One of those movies where you can't tell if its supposed to be funny or serious. \r\n\r\nThe bats are... horrible. I think they probably bought them at a Party City a few minutes before filming. So many plot holes and just cheap gimmicks to go along with horrible script and worse acting (although Dina Meyer is pretty damn hot). \r\n\r\nKind of a throwback to the 'nature attacks' genre of the 60's and 70's, but has none of the charm. Its in that weird area where its a B movie with high production value, and that makes it sub-par as it pertains to both serious film, and B movie film.",
            "review_date": "2011-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Why would you do that?\"\n\"...Because I'm a scientist. It's what we do!\"",
            "review_date": "2011-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The premise is more funny than the final product but, of course, what were you expecting with tag lines such as: \"Having a BAT hair day?\". This film was never intended to be taken seriously but then somebody should have told the actors. This horror film is inept and utterly uninspired.",
            "review_date": "2011-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from Leon's performance, I really don't understand why people rag on this film. It is far from Hollywood Blockbuter standards but is fun to watch.",
            "review_date": "2011-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple formula: Rubber bats + Lou Diamond Phillips = Win. Well, so you would think... One of those movies where you can't tell if its supposed to be funny or serious.\r\n\r\nThe bats are... horrible. I think they probably bought them at a Party City a few minutes before filming. So many plot holes and just cheap gimmicks to go along with horrible script and worse acting (although Dina Meyer is pretty damn hot).\r\n\r\nKind of a throwback to the 'nature attacks' genre of the 60's and 70's, but has none of the charm. Its in that weird area where its a B movie with high production value, and that makes it sub-par as it pertains to both serious film, and B movie film.",
            "review_date": "2011-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best theme song EVAR",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genre film that opts to do nothing new and do the routine poorly. Boring \"B\" movie that has literally only one scene that managed to entertain in the way it should. I will say that it's kind of nostalgic because I remember watching this when I was 9 and not liking it then either.",
            "review_date": "2011-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so yea, a bit cheesy and the special effects were bad:  sorry the bats didn't look realistic at all.  but good plot.",
            "review_date": "2010-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh man, this is so amazingly bad. best line in the movie when asking the \"scientist\" why he created a strain of killer bats he says \"i'm a scientist, that's what we do\".",
            "review_date": "2010-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very amusing and hilarious 'bad' movie.",
            "review_date": "2010-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To this date, this is the only movie I've EVER walked out of.  Terrible.",
            "review_date": "2010-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely cheesy, the bats aren't very realistic, but there's still something about it that is actually quite... good. It's a great b-movie and entertaining as hell. The plot makes no sense, but the acting is capable and there are some cool scenes involving the bats. It's a fun movie and as long as you don't took it too seriously, you'll enjoy it.",
            "review_date": "2010-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Scenes with the Bats are in the Style like this Experimental Horror Movie i saw once, the Bats were real funny and i like this South Western Style and the Music",
            "review_date": "2010-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one was quite funny :)",
            "review_date": "2010-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it was made in 1950's it would be a classic now not so much",
            "review_date": "2010-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple formula: Rubber bats + Lou Diamond Phillips = Win. Well, so you would think... One of those movies where you can't tell if its supposed to be funny or serious. The bats are... horrible. I think they probably bought them at a Party City a few minutes before filming. So many plot holes and just cheap gimmiks to go along with horrible script and worse acting (although Dina Meyer is pretty damn hot). Kind of a throwback to the 'nature attacks' genre of the 60's and 70's, but has none of the charm. Its in that weird area where its a B movie with high production value, and that makes it subpar as it pertains to both serious film, and B movie film.",
            "review_date": "2010-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not much different to eight legged freaks... except it's bats! still... nothing on the classic tremors",
            "review_date": "2010-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bats is filled with funny cliches and one liners from its actors, but thats about it. horror fans can somewhat enjoy this film because of those reasons. the effects are god awful and the storyline is weak. the film has some energy and is fast paced but is mainly unscary nor suspenseful.",
            "review_date": "2010-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember renting this 18A rated movie from the video store with my friend....when we were 11. It was shit then, and its still shit now",
            "review_date": "2010-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really bad. Avoid at all costs. Don't waste your time on this.",
            "review_date": "2010-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah the B-movie. If there we ever a thing in cinema that could be dubbed a guilty pleasure, its this.\r\n\r\nThe truth is that Bats could easily have been Arachniphobia, Snakes on a Plane or Eight Legged Freaks! and you wouldn't really notice much difference. This is mainly because they essentially all centre around the same core premise: animals with a slightly sinister reputation become mutated by a Promethean scientist and besiege an isolated small town, only to be eventually stopped by a scientist/feminist figure, a working class diamond in the rough and a comic relief who just so haoppens to be afraid of said creature. \r\n\r\nDespite a fairly strong effort by Dina Meyer (who this time manages to go a whole movie without getting naked) and a totally believable performance by Leon, the film can not escape its deep genre-confined script and thus is never anything more than a by-the-numbers affair. Lou Diamond Philips in particular feels about as realistic as a Ken doll and at no point is the audience ever led to believe that he may not make it out alive (the premise which made Deep Blue Sea so refreshing could really have helped here).   \r\n\r\nAs with most genre films, the special effects remain the biggest draw and the hideously vampiric bats do successfully satisfy in the creepiness department. Beyond that, Bats stands as nothing more than a time filler. Genre fans may want to watch it if they haven't already but newcomers are better advised to skip straight to Aranchniphobia, Evolution or the far superior Tremors.",
            "review_date": "2010-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bats is a great horror b-movie about of course killer infected bats that go around town and pretty much of course kil people bats also has great gore effects and great acting.",
            "review_date": "2010-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't mind this, but, of course I was 12 the last time I saw it.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "high hopes but they let me down.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst horror movies ever.  Not even bad-funny, just bad.",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It uses a tried and trusted formula of animal tormentor of humans but even so it's still done very badly.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Synopsis: Genetically mutated bats escape and it's up to a bat expert and the local sheriff to stop them.\r\nStarring: Lou Diamond Phillips, Dina Meyer, Bob Gunton, Leon, Carlos Jacott, David McConnell \r\nDirected by: Louis Morneau",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a true masterpeice of creature features this film is about infected bats which kill people in texas and bites them then kills them",
            "review_date": "2009-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boy, that was one herd of boredome, I just watch it for LDP. Sigh... LDP... you make that nasty balut sounds delicious...",
            "review_date": "2009-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One probably knows what they're getting into prior to seeing a film called \"Bats\".  Something that could rock in a throwback to 50's horror in all it's sweet campiness.  Or just a load of bullshit.  It falls into the latter category.\n\nThe plot involves a a couple of bat experts (Dina Meyer of \"Starship Troopers\" and Leon of \"Cool Runnings\") who hired to by an evil scientist (Bob Gunton of \"The Shawshank Redemption\") to capture and/or kill a swarm of genetically engineered super bats loose in a Texas town.  Of course the stereotypical Texas sheriff (Lou Diamond Phillips, \"La Bamba\") is there to lend a hand as well.\n\nWhy the bats were created in the first place and why Gunton is obsessed with them and believes they follow his every command \"Willard\"-style (but they don't) isn't ever brought up in one of many plotholes.  The ingredients were there for something cool, instead our heroes run around shooting at bats (would a pistol really be the weapon of choice against a zig zagging flying bat?), locking them in a high school, and making plans to freeze the bastards.  No time is given to any kind of character development, so who these people are or why we should give a shit if they're eaten by flying rubber bats is beyond me.\n\nThe cast play this one totally straight without the \"wink at the camera\" which is sorely missed.  Much could have been done with the characters, including Bob Gunton's gung-ho approach to the whole thing.  But the second he starts showing signs of uplifting the film, he's killed off.  The effects aren't terrible for what they are, but better suited had the film chosen the campy route.  The CGI bats don't work as well, nor does fighter pilot footage, filmed with a completely different film stock, look good at all.  Hey, it's 1999 CGI, I guess it ain't horrible.  But what about those fuckin jets?  Oh yeah, that's just recycled footage from \"Iron Eagle II\".  Guess the lifeless rubber bats used up the whole budget.  Or maybe it's Leon paycheck following the critical success of \"Cool Runnings\" 6 years earlier?  He was also in uh...well, he was one of the bad guys in \"Cliffhanger\".  Alongside direct-to-video greats like Lou Diamond Phillips, one wonders how the hell Bob Gunton went from the sadistic warden in \"Shawshank Redemption\" to being eaten by 6 foot rubber bat.  Who knows, who cares.  It's not worth much of anyone's time.",
            "review_date": "2009-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, when I thought Sci-fi couldn't have crappier movies before, this disaster shows up on it. I honestly cannot believe how ridiculous someone had to be to come up with such a story. Genetically altered bats? I love how the bats managed to grow a full set of teeth. This is like Hitchcock's Birds thrown in a barrel of toxic wast, tarred and feathered. With bad acting, crappy plot and outrageous special effects; this movie is not only a pain-staking waste of breath, but a pain to watch. Uwe Boll has directed better films than this, and thats saying a WHOLE lot. Dont waste your time, this film is a trainwreck.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical B movie horror.  Good but not great.",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great time for anyone that enjoys cheesy monster movies. It really feels like a movie that was meant to be made in the 50's or 60's, and to be enjoyed at the drive in. There's no way to take the material seriously. Genetically engineered bats escape from a government lab, infect other bats outside a small Texas town, and proceed to kill everyone in sight. Of course the government recruits one scientist who is \"the best in the field\" to find a solution to the problem. The movie is filled with bats that look as real as the shark in Jaws. Whether they are animatronic, or computer generated, they rarely look real. But when they swarm, it's a cool sight to see. Director Louis Morneau makes great use of the beautiful landscape, and the quaintness of a small town to give the movie a great atmosphere. The characters are all stereotypical, especially Leon's ultra hip, token black character. But the actors are solid, and keep you interested. Lou Diamond Phillips can't sell a Texas accent to save his life, but he's heroic enough as the sherriff. Dina Meyer...ah me, Dina Meyer. Not only is she one of the most beautiful women in Hollywood, she's also a solid actress, and makes her character tough, and is FAR more credible as a scientist than her Starship Troopers co-star Denise Richards was as a nuclear scientist in The World Is Not Enough. Did I also mention she's has one of the most perfect faces I've ever seen? The movie though, loses a great deal of steam in the third act. When the heroes enter the central nest of the bats at the end, it draws out way too long, and begins to become boring, with a finale that doesn't quite fit with the feel of the rest of the movie. But, if you like drive-in movies, cheesy monster flicks, or need nothing more than to stare at the beautiful Dina Meyer for 90 minutes (that would be me) then this movie is for you. In fact, I'm so taken with her beauty, that I'm going to give the movie an extra half star just for that.",
            "review_date": "2009-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to see \"Bats\" as soon as I saw the previews over a year ago and I finally got to see it awhile ago. It wasn't anything like what I thought it would be. I was expecting it to be a good horror movie with great special effects. \"Bats\" turned out to be the worst horror movie I've seen in a long time.\r\nA new breed of bat that was created by a man is terrorizing a small town in Texas. The bats kill everybody they see, so it's up to a wildlife zoologist (Dina Meyer) and a sheriff (Lou Diamond Phillips) to try and get rid of the bats before it's too late.\r\n\r\n\"Bats\" might have had better success a few years ago, but with the great horror movies that have been made lately, \"Bats\" just can't stand up to them. Sometimes the camera in the movie just goes in circles to where you can't see anything. There's not much plot to the movie other than to get rid of the bats. Finally, \"Bats\" was made in 1999. It's pretty bad when a movie made in the late 90's doesn't even have good special effects. The only thing that I did like about the movie was that the bats looked pretty cool. \r\n\r\nSome people might like \"Bats,\" but for me, it just wasn't what I was expecting it to be. Therefore, unless you really really want to see it, I wouldn't recommend watching it. NOTE: That was my Amazon review from the year 2000. Bigtime disappointment movie for me.",
            "review_date": "2009-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cheap effects but the film does have some energy that keeps you watching. sadly the script is terrible and no thrills really does let what could of been a fun b movie. in the end this is just a low budget film in need of a decent story",
            "review_date": "2009-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What if something like this ever becomes true. After all, scientists do go wrong, don;t they?\n\nThis flick s a decent watch for that matter.",
            "review_date": "2009-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dina Meyer...hmmm, oops sorry, I was just thinking out loud.  This is a definite \"B\" movie...I feel bad for Lou, who now seems to be a permanent resident of B hell",
            "review_date": "2009-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "- wasn't as good as I'd thought it be.",
            "review_date": "2009-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i don't care if he isn't a real diamond...lou diamond phillips is the man.",
            "review_date": "2009-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beware of what goes \"bump\" (and \"squeak\" and \"flap flap flap\") in the night. Dr. Sheila Casper (Dina Meyer) is a respected zoologist dispatched by the government to Gallup, TX, a small community suffering from an unusual number of reported bat attacks. Casper finds this news puzzling, since bats are generally placid creatures who avoid contact with humans. The local sheriff, Emmett Kimsey (Lou Diamond Phillips), assures Casper that the reports are on the level and that something needs to be done about swarms of aggressive bats so thick they blot out the moon. Caspar and Kimsey discover that a new breed of genetically altered bats have escaped from a research facility and taken up residence in a cave near Gallup -- but the nocturnal bloodsuckers have no intention of leaving as quickly as they arrived. Bats was written by John Logan, who had two other projects hit the screen within a few months of Bats' release: Oliver Stone's Any Given Sunday and Ridley Scott's Gladiator. The supporting cast includes Leon and Bob Gunton.",
            "review_date": "2009-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "only seen part of it",
            "review_date": "2009-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nSome actors in the film, such as Dina Meyer, Ironically suffer from chiroptophobia or fear of bats. They were repulsed by the puppets and animatronics.",
            "review_date": "2021-04-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "At the beginning of 1999, Destination Films opened its doors and was looking for a picture for a Halloween release. Bats was the company's first feature film.",
            "review_date": "2021-04-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The production of the film had been planned to film the film in Mexico, where it would be much cheaper and cheaper to give a good profit to the budget but finally it was decided to film the film in the United States.",
            "review_date": "2021-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is a real gem...no I take that back it is a (Lou) Diamond (Phillips)! As always The Diamond brings his \"A\" game to the role and owns it. He puts on that oversized sherriffs hat and you think WOW did he quit acting and take on a a This movie is a real gem...no I take that back it is a (Lou) Diamond (Phillips)! As always The Diamond brings his \"A\" game to the role and owns it. He puts on that oversized sherriffs hat and you think WOW did he quit acting and take on a a life of crime fighting. This is a must watch for anybody who wants to see a bunch of bats get handed some Texas justice Diamond style!",
            "review_date": "2008-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nAudio/visual unsynchronised Laser and inkjet printers do not make the noise of a noisy dot matrix printer.",
            "review_date": "2021-04-27",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 1.4,
    "rt_summary": "When a population of bats in a small Texas town starts attacking the unsuspecting citizens, Dr. Sheila Casper (Dina Meyer), a zoologist specializing in the species, is called in to investigate. With the help of her assistant and the local sheriff (Lou Diamond Phillips), strange details about the bats begin to emerge: It's discovered that they are the product of a governmental experiment gone awry. With people dying and the military threatening to take action, a solution must be found.",
    "meta_rating": 7.4,
    "meta_summary": "Swarms of genetically altered bats blaze a path of terror through a sleepy Texas town. The only hope to stop the growing tide of devastation is a zoologist who studies bats (Meyer), her assistant (Leon), and the local sheriff (Phillips).  (Destination Films)"
}