{
  "title": "Gaslight",
  "rating": 8.8,
  "release_date": "1944-05-04",
  "genre": [
    "Drama",
    "Mystery",
    "Thriller",
    "Crime",
    "Film-Noir"
  ],
  "summary": "Years after her aunt was murdered in her home, a young woman moves back into the house with her new husband. However, he has a secret that he will do anything to protect, even if it means driving his wife insane.",
  "critic_reviews": [
    "Direction by George Cukor is ever a display of fine craftsmanship. He utilizes small mosaics of sharp characterization in building to his climax and works in each facet faultlessly. This is the job for which Cukor admirers have been waiting.",
    "It’s canny, gothic fun, helped along by Lansbury (in her film debut) as a tarty maid who delights in overstepping boundaries.",
    "The climax is a workmanlike rise of psychological terror, but the whole exercise looks self-consciously careful.",
    "George Cukor carefully avoids the obvious effects in telling this story of a husband (Charles Boyer) attempting to drive his wife (Ingrid Bergman) insane; instead, this 1944 film is one of the few psychological thrillers that is genuinely psychological, depending on subtle clues—a gesture, an intonation—to thought and character.",
    "Yes, the ending is weak, and there are aspects of the story that don't stand up to scrutiny, but this is the kind of effectively-crafted, well-acted motion picture that rises above its faults to earn its \"classic\" appellation.",
    "It’s often asked why battered women don’t “just leave.” Gaslight evokes the sort of psychological intimidation and cruel mind games that make it so much more complicated than that.",
    "Prepare yourselves rather for a lengthy and restless stretch on tenterhooks.",
    "Patrick Hamilton's London stage melodrama, is given an exciting screen treatment by Arthur Hornblow Jr's excellent production starring Charles Boyer, Ingrid Bergman and Joseph Cotten.",
    "Gaslight is an expertly directed and evenly paced slow burn (and Dame May Whitty is a stitch, though underused, as a nosy neighbor lady), but its lack of a sound moral and psychological center renders it totally transitory and forgettable."
  ],
  "reviews": [],
  "num_reviews": 9
}