{
  "title": "The Machinist",
  "rating": 8.6,
  "release_date": "2004-10-22",
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "summary": "Trevor Reznik has not slept for a year. His every waking minute has become an unremitting nightmare of confusion, paranoia, guilt, anxiety and terror - each of which is part of an escalating series of clues that will lead to the source of his mysterious affliction.  (Paramount Classics)",
  "critic_reviews": [
    "A brilliantly honed tale of dementia, starring a skeletal Christian Bale as a tormented insomniac wasting away and terrorized by his irreal existence.",
    "Psychological suspense at its finest.",
    "Anderson gives The Machinist a sickly noirish look that contributes to the creeping horror - but it's the emaciated Bale's spectral presence that leaves the imprint.",
    "Bale is totally convincing, if not especially endearing.",
    "The Machinist is so brave and visually impressive, it should demand an audience.",
    "Director Brad Anderson tightens the screws of suspense, but it's Bale's gripping, beyond-the-call-of-duty performance that holds you in thrall.",
    "A harrowing experience for those to whom this sort of story appeals.",
    "Bale is brilliant.",
    "Bale gives a near-great performance as a man with all the symptoms of paranoid schizophrenia and the film weaves an ingenious psychological web.",
    "In the hands of a less talented filmmaker, The Machinist would have felt like a stunt. But Anderson, with a terrific assist from Bale, makes his character's plight achingly physical.",
    "A moody psychological thriller with a stunning performance by Christian Bale at its core.",
    "The director Brad Anderson, working from a screenplay by Scott Kosar, wants to convey a state of mind, and he and Bale do that with disturbing effectiveness.",
    "The film presents a compelling portrait of mental illness, but looking at Bale may make audiences feel as though they're watching a documentary.",
    "An intense, precision-controlled psychological mystery built around a very creepy lead performance by Christian Bale.",
    "Not quite stunning enough to live up to a boldly bleak and unrelenting buildup.",
    "Here his (Bale's) physicality is repellent, yet he carries the occasionally creaky plot of Scott Kosar's unsettling screenplay to a resonant finish.",
    "Never gives us the nuts and bolts of mental illness and guilt, just the sight of cooped-up steam escaping from a valve that’s about to blow.",
    "Give Anderson credit for at least sustaining a mood. This is the kind of all-or-nothing movie in which a filmmaker probably can't waver from his tone.",
    "An hallucinatory mix of the imagined and the real, all revolving around the mystery at the cold heart of the tale.",
    "Turns out to be something entirely different than it initially seemed, and while the conclusion brings everything to a logical close, it also renders the movie less interesting -- a stunt that didn't merit Bale's startling, and dangerous, transformation.",
    "May be an expertly manipulated exercise in psychological horror, but that's all it is. Don't look for the kind of metaphoric weight you'd find in a movie by David Lynch or David Fincher.",
    "Anderson is a master of detail, from the film's ubiquitous fish motif to the elaborate carnival set piece that unfolds inside the claustrophobic confines of a spook-house ride called \"Route 666.\"",
    "It's a result so painfully logical it would make Lynch's hair stand on end.",
    "Although the primary plot line turns out to be a letdown, there are aspects of The Machinist that redeem it. Bale's performance is one; another is the dull, metallic look of the picture.",
    "In a way, though, it’s all Bale's show. Withering down to an alarming 120 pounds, he delivers a deeply obsessed performance that leaves us both fascinated and sickened.",
    "The main, if not only, reason to see The Machinist is for Christian Bale's title performance, and even then you have to be a fan of hardcore martyrdom in the service of craft.",
    "Director Brad Anderson (Session 9) is usually really good at humanizing ambiguous characters, and he ultimately succeeds, but he has to fight against Scott Kosar's script.",
    "Bale exists all too large under the circumstances, a well-fed actor playing at emaciation for the sake of a fiction about a character whose torment is as unreadable as his vertebrae are countable.",
    "The Machinist has no meat on its bones, and we've seen it all before.",
    "Bale gives a remarkable performance in a movie I can recommend to no one, because the sight of him is more distressing than any of the allegedly deep themes of the picture.",
    "Director Brad Anderson (Session 9) overtly cribs from everyone from Dostoevsky to Kafka.",
    "Unrelentingly dreary, and seemingly destined to be remembered, if at all, as that movie Christian Bale lost a full third of his body weight for. It doesn't deserve any better."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Brilliant mystery thriller !!!!!!!!!!!!!!!!!!!!!!!!!!!!!&&&&&&&&&&&&&&&&&&",
      "review_date": "2020-01-12"
    },
    {
      "review_title": null,
      "content": "Director Brad Anderson's \"The Machinist\" provides a great script with precise dialogue. However the film mostly succeeds in shocking the audience by the amazing performance of Christian Bale.",
      "review_date": "2011-10-01"
    },
    {
      "review_title": null,
      "content": "One of the essential Bale movies for someone to understand what length this man goes to be an actor. Classic performance that only Bale can produce. Well done and a must see movie.",
      "review_date": "2015-12-03"
    },
    {
      "review_title": null,
      "content": "What admires about this movie is how director highlighted all rawness and nihilism about movie using gloomy tones of color and adding truly discomfort for who's watching, even it doesn't being the most original thing about movies in itsWhat admires about this movie is how director highlighted all rawness and nihilism about movie using gloomy tones of color and adding truly discomfort for who's watching, even it doesn't being the most original thing about movies in its genre. Bale fell into a mental-disturbed character as physically (coming to has about 120 pounds for the film) as acting, adding even more to this rawness on film. Nothing against the plot too, well structured and almost without loose ends.",
      "review_date": "2018-10-31"
    },
    {
      "review_title": null,
      "content": "The Machinist is absolutely riveting. Anderson has create the type of movie where the viewer never knows what's real and what's not, and there is a reasonable doubt to everything. Once it is revealed why the situation is like it is,The Machinist is absolutely riveting. Anderson has create the type of movie where the viewer never knows what's real and what's not, and there is a reasonable doubt to everything. Once it is revealed why the situation is like it is, everything makes sense. Aside from that, Christian acts wonderfully and is obviously committed to the role with how much weight he had to lose. There are subliminal messages, red herrings, and many hints expertly scattered throughout, as well as some meaningful themes and values. For those who like this genre, it's a must-see.",
      "review_date": "2014-08-20"
    },
    {
      "review_title": null,
      "content": "A really good movie with a great script and good actors.Christian Bale is really good in this, not only for his weight loss but also for his acting. While at first you will feel a bit awkward and maybe even disgusted seeing him like that,A really good movie with a great script and good actors.Christian Bale is really good in this, not only for his weight loss but also for his acting. While at first you will feel a bit awkward and maybe even disgusted seeing him like that, after a while movie sucks you in and you want to know what will happen next, which, I'll say won't be always that predictable, especially the ending. Also I think movie makes you think, especially after you know what happens at the end. Definitely worth a watch and I'm sad that I didn't watch it earlier and put it off all the time.",
      "review_date": "2015-06-07"
    },
    {
      "review_title": null,
      "content": "Christian Bale is scarily good in this.Amazing dedication to his craft.He just completely inhibits the role.Suspenseful and intriguing.Top notch psychological thriller.",
      "review_date": "2011-09-05"
    },
    {
      "review_title": null,
      "content": "Sometimes a little slow but brilliantly asphyxiating, stressful and intriguing. You can't stop feeling bad for Trevor's behaviour and even though you know he's completely paranoid, a part of you still wants him to be right.",
      "review_date": "2011-08-22"
    },
    {
      "review_title": null,
      "content": "Both emotionally and physically, Bale nails the character he portrays: Trever Reznik, an man that hasn't slept due to unknown events. As the movie progresses, you get dragged into it, realising what is what, how everything is starting to makeBoth emotionally and physically, Bale nails the character he portrays: Trever Reznik, an man that hasn't slept due to unknown events. As the movie progresses, you get dragged into it, realising what is what, how everything is starting to make sense, and a satisfying conclusion to leave you with. The most interresting thing, however, is Bale's appearence. As he is most known in recent days as the muscled Bruce Wayne/Batman, his skinny and rather surprislingly slender body makes you frown from compassion, feeling not only sorry for Reznik, but also admiring Bale's acting.",
      "review_date": "2013-05-11"
    },
    {
      "review_title": null,
      "content": "This is Memento for half-wits. It's mostly shots of Christian Bale looking at his emaciated body in the mirror. The film is a slow and painful plodding toward a twist ending. And sure, there's a twist, but it comes perfectly gift This is Memento for half-wits. It's mostly shots of Christian Bale looking at his emaciated body in the mirror. The film is a slow and painful plodding toward a twist ending. And sure, there's a twist, but it comes perfectly gift wrapped in in slow-motion after-school special cheese that in no way justifies the preceding hours of over-serious, over-stylized boredom. Everyone's impressed that Christian Bale lost one third of his body weight for a role but this movie is so hollow and poorly written it comes off as a depressing publicity stunt.",
      "review_date": "2006-02-28"
    },
    {
      "review_title": null,
      "content": "This is really quite a sinister, unsettlinh feeling watch. Its quite atmospheric and does well at making the viewer feel on edge, seeing things from the main characters point of view, making us question his frame of mind and wonder what willThis is really quite a sinister, unsettlinh feeling watch. Its quite atmospheric and does well at making the viewer feel on edge, seeing things from the main characters point of view, making us question his frame of mind and wonder what will ultimately happen. I was very aware of the way the lighting was done, in that it appears as if most things are in either black and white or greyscale, almost as if the colour has been literally drained from the people and objects we view. Of course that can be  linked straight back to the main plot of the main character being in a less than refreshed and energetic state.Christian Bale does well portraying the main character - he certainly looks very much on edge and paranoid, almost ghostlike in appearance after a while, with dark rings appearing around his eyes. I found it to be quite an intriguing, tense and engrossing watch. Its the sort of film where you find yourself guessing what might happen next, whats to come. Its an edgy watch, not entirely scary as such but certainly fairly gritty and probably not an ideal watch if your not keen on (if but mild-ish) jump scares. The music featured had a Hitchcock-ian feel to it - I suppose the film does have a bit of that about it, although thats not to say I'd compare it directly with the classic directors work but for a film of this type, its certainly worth seeing. Unsurprisingly, overall, I would definitely recommend this film.",
      "review_date": "2021-11-21"
    },
    {
      "review_title": null,
      "content": "What we have here is a disturbing, distracting but important thriller which explores the boundaries and broken states of not only the human body, but the mind as well, powerful as it is, it can also deceive to the point of self-destructionWhat we have here is a disturbing, distracting but important thriller which explores the boundaries and broken states of not only the human body, but the mind as well, powerful as it is, it can also deceive to the point of self-destruction and doubt of oneself. Christian Bale is the almost unrecognisable lead in this sombre and dark piece, he plays a machine worker in a factory by day, and sits in an empty airport cafe by night, trying to overcome his year long insomnia. When we meet him, he seems to be in an unhealthy yet manageable state, going about his life, but Bale cuts a gaunt and sunken figure, losing extreme amounts of weight to play the part if routine worker Trevor Reznik, a man who alienates his co-workers and does the exact same thing day in and day out, until something shakes his routine and he begins to experience horrific events that he cannot explain nor can he piece together. He turns to a call girl called Stevie (Jennifer Jason Leigh), the only real friend he has, to get a second opinion on his dilemma.\rThe Machinist studies the effects of traumatic events and how one can choose to repress and forget, Reznik is an emaciated yet focused individual, living a life by black and white rules while also trying to keep on top of everything through sticky notes and cleanliness.  While the film studies the emotional impact and aftermath of life-changing events, it often tries to hard to hide its predictable plot which begins to unfold, this definitely distracts what could have been a near flawless thriller, but the deliberate attempts to mask the unwinding story and the distracting appearance of Bale at a mere 121 pounds stop this from happening. But there is still a thrilling story and an excellent performance from Bale, who clearly throws himself into his work and commits to the experience, there are of course arguments about how much actors and actresses get paid, but this is a prime example of money well spent, while harmful to himself, Bale proves his loyalty and willingness to his work, the performance outweighs the sombre and often slow paced film, it has an overall decent approach, but inconsistencies and deliberate out of focus points towards the audience, stop it from being truly great.",
      "review_date": "2013-09-20"
    },
    {
      "review_title": null,
      "content": "Christian Bale seems to be the reason for most The Machinist hype, and their's a good reason for that. Bale's portrayal of , insomnious, Trevor Reznik is something he really devoted to doing. Still with Bale's great acting, as well as theChristian Bale seems to be the reason for most The Machinist hype, and their's a good reason for that. Bale's portrayal of , insomnious, Trevor Reznik is something he really devoted to doing. Still with Bale's great acting, as well as the supporting cast's, are not the delivering factor. The cake goes to Scott Kosar for this amazing script. The Machinist delivers all the suspense and thrills a great movie in this genre need.",
      "review_date": "2012-06-07"
    },
    {
      "review_title": null,
      "content": "When I watched this movie I actually realized that this is my first time I see Bale playing the role. I mean it was not just a guy with Bale's face (like in Batman or Terminator), he actually played that skinny insomniac Trevor Reznik, and heWhen I watched this movie I actually realized that this is my first time I see Bale playing the role. I mean it was not just a guy with Bale's face (like in Batman or Terminator), he actually played that skinny insomniac Trevor Reznik, and he did it just great. The movie has a lot of catchy features, good atmosphere, nice picture with all that pale colors. Pretty decent and original thriller to me.",
      "review_date": "2013-08-29"
    },
    {
      "review_title": null,
      "content": "This film is solid. A very brilliant and thin Christian Bale is on display in this film. A mystery film at its best. The Machinist is going to keep you guessing, and it going to make you want to see it again.",
      "review_date": "2014-11-21"
    },
    {
      "review_title": null,
      "content": "If you've seen any episode of Serling's Twilight Zone, you've already seen The Machinist.",
      "review_date": "2009-06-29"
    },
    {
      "review_title": null,
      "content": "Interesting and extremely entertaining. The Machinist has you watching the entire movie in a way that you can't wait to see what happens next. Christian Bale does an excellent job in this part and his dedication to the role is amazing.",
      "review_date": "2013-11-24"
    },
    {
      "review_title": null,
      "content": "When I read a little about The Machinist I did not expect this movie at all.A solid movie, with a stun script and a painful ending.Great performance by Christian Bale.",
      "review_date": "2018-12-29"
    },
    {
      "review_title": null,
      "content": "I'm pretty sure people will understand what The Machinist is about when Christian Bale has lost a lot of weight and I mean a lot of weight. He is certainly a fantastic actor who is great at everything with losing weight to get into theI'm pretty sure people will understand what The Machinist is about when Christian Bale has lost a lot of weight and I mean a lot of weight. He is certainly a fantastic actor who is great at everything with losing weight to get into the character. It's quite shocking to see his body going through like this. In this he plays Trevor Reznik, a machinist who has insomnia and hasn't slept for a year. It has one gory scene where Michael Ironside's arm came off at the machine. Trevor apparently has seen two accidents like I said today that Michael Ironside's character had his arm come off and a young boy having a seizure at \"Route 666\". There just loads of things went into his head since he doesn't get enough for a whole year when he has nightmares. It's quite like an ambiguous ending in American Psycho. I really was gripped at the chase scene after Trevor got run over by a car causing a hit and run. This film is so astonishingly psychological it grabs your attention in order to understand what Christian Bale is going through. It's kinda like Fight Club and Memento which I haven't seen before but those elements go through together in The Machinist for how evocative it is. For how much a gripping psychological thriller it really is. The twist ending is quite depressing but you know how this goes.",
      "review_date": "2018-08-22"
    },
    {
      "review_title": null,
      "content": "This film makes you feel uncomfortable, but that's the point. Christian Bale is, once again, outstanding. You are with him throughout the film, believing his plight, asking the same questions his character does. The ending did, and at theThis film makes you feel uncomfortable, but that's the point. Christian Bale is, once again, outstanding. You are with him throughout the film, believing his plight, asking the same questions his character does. The ending did, and at the same time didn't shock me  by the end of it you get the feeling that you should have seen it coming!",
      "review_date": "2013-07-05"
    },
    {
      "review_title": null,
      "content": "Dark 'Machinist' Carries Weight.\r Something appears to be eating away at Trevor Reznik -- literally. As embodied by Christian Bale, who lost an astonishing 60-plus pounds in preparation for the title role in \"The Machinist,\" Trevor isn't soDark 'Machinist' Carries Weight.\r Something appears to be eating away at Trevor Reznik -- literally. As embodied by Christian Bale, who lost an astonishing 60-plus pounds in preparation for the title role in \"The Machinist,\" Trevor isn't so much flesh and blood as a walking ghost, a chronically sleepless, gaunt-to-the-point-of-pain (ours, mind you, not his) wraith of a man. As it turns out, he's a character so haunted by himself that he is turning into his own ghost.\r Much has been written about Bale's physical transformation for this film, a remarkable display of starving for one's art that should go into the moviemaking record books on the page opposite Robert De Niro and Vincent D'Onofrio's legendary weight gains for \"Raging Bull\" and \"Full Metal Jacket.\" While the results of Bale's shocking, special-effect-free emaciation occasionally threaten to become a distraction for the audience, especially when the previously healthy-looking actor has his shirt off, they are an essential visual metaphor for the film's message, which comes into full, dark flower only in a clever twist at the end.\r Despite containing an implicit lesson about sin, \"The Machinist\" is structured less like a morality play than a straightforward mystery thriller. As it opens, Trevor, an employee of a soul-deadening machine shop, hasn't slept in a year, and he would like to know why. He'd also like to know why several other strange things keep happening to him lately, such as the appearance of several cryptic Post-it notes in his dingy apartment, and the arrival of a creepy new employee at work (John Sharian), whom it appears only Trevor can see.\r Then there's the accident.\r After inadvertently causing a co-worker (Michael Ironside) to lose an arm in an industrial mishap due to his own inattention, Trevor's insomnia and paranoia (with possible hallucinations) get worse. Soon, he comes to believe that not only are his co-workers out to punish him for the incident, but that his up-to-now understanding hooker-girlfriend (Jennifer Jason Leigh) may be in collusion with one or more of his tormentors. Trevor's only solace? The graveyard-shift waitress at the local airport (Aitana Sanchez-Gijon), an angelic, almost maternal presence whose nightly pie, companionship and coffee -- as if this man needs more caffeine! -- are the few things that keep Trevor sane.\r Or are they?\r Tautly scripted by Scott Kosar, and directed with quiet, nightmarish intensity by Brad Anderson (see Film Notes on Page 39), \"The Machinist\" is psychological suspense at its finest. Shot with a cold blue pallor and edited with a somnambulistic lethargy that belies the urgency of its subject matter -- the nature of guilt and innocence -- the film feels at times like you're dreaming it, rather than watching it. Taking its stylistic cues not from today's crop of horror films, but from such masterpieces as Roman Polanski's \"Repulsion\" (1965) and Ingmar Bergman's \"Hour of the Wolf\" (1968), it makes even scarier that most scary of bogeymen: the human mind.",
      "review_date": "2016-04-03"
    },
    {
      "review_title": null,
      "content": "Hmmm... critics divided. General public not. This is an awesome film. Fight club meets Memento directed by Alfred Hitchcock. Watch it immediately.",
      "review_date": "2007-04-26"
    },
    {
      "review_title": null,
      "content": "Just Brilliant!!!",
      "review_date": "2005-11-02"
    },
    {
      "review_title": null,
      "content": "Think of fight club, take away the sardonicism, and make it more realistic and you've got the machinist ... kind of ... one of few films that makes you think but doesn't completely not make sense. Like fight club, the cool twist Think of fight club, take away the sardonicism, and make it more realistic and you've got the machinist ... kind of ... one of few films that makes you think but doesn't completely not make sense. Like fight club, the cool twist doesn't really hit until you watch it a second time. Good film go see it",
      "review_date": "2005-10-08"
    },
    {
      "review_title": null,
      "content": "This is a visually beautiful movie and I'm sure I will watch it a few times, and I'm someone who usually only watches a movie once. I still can't figure it out but I'll have fun trying. Don't compare this to any This is a visually beautiful movie and I'm sure I will watch it a few times, and I'm someone who usually only watches a movie once. I still can't figure it out but I'll have fun trying. Don't compare this to any other movies, it's truly one-of-a-kind. If Christian Bale and Jennifer Jason Leigh don't get nominated for academy awards then I don't know what the academy is looking for. I love jb young's review here, I can't really add much to that one. Bale and Leigh and the entire supporting cast should expect great things from the reception from this movie, it will grow in popularity for years to come. Congratulations to director Brad Anderson and writer Scott Kosar. It's a masterpiece.",
      "review_date": "2005-11-16"
    },
    {
      "review_title": null,
      "content": "The Machinist is most certainly one of the weirder movies I have seen. Christian Bale is great as usual and the surprise twist will really screw with your head. Good film, certainly keeps you interested.",
      "review_date": "2013-07-08"
    },
    {
      "review_title": null,
      "content": "Brad Anderson's \"The Machinist\" had a lot of hype but ultimately left us feeling underwhelmed. From the first twenty minutes, the film continued in a predictable manner. With a main character who was frankly clueless and showed absolutely noBrad Anderson's \"The Machinist\" had a lot of hype but ultimately left us feeling underwhelmed. From the first twenty minutes, the film continued in a predictable manner. With a main character who was frankly clueless and showed absolutely no prior thought behind his actions, it made me feel uncomfortable to watch him try to figure out the mystery that unfolded. Although the end of the movie wasn't necessarily unexpected, it wasn't surprising, and almost came out of the blue. This film wound up being a desperate attempt at the avant-garde, and didn't really work as well as it could have.",
      "review_date": "2013-05-19"
    },
    {
      "review_title": null,
      "content": "A good movie, with a great interpretation of Christian Bale.This movie was very enjoyable to watch. It's a thriller based on Trevor's paranoia, a factory worker who begins to believe that a newcomer to the service is trying to plot him. OfA good movie, with a great interpretation of Christian Bale.This movie was very enjoyable to watch. It's a thriller based on Trevor's paranoia, a factory worker who begins to believe that a newcomer to the service is trying to plot him. Of course, the fact that he has not slept for a year (a form of chronic insomnia that, for the simple fact that the character has not gone to the doctor, is hard to believe) probably has something to do with these obsessive thoughts. At her side, privileged spectator of her drama, the prostitute Stevie, who is at the same time friend, advisor, confidante and romantic interest of that machinist. He has no friends, has virtually no one, and will slip to the brink of madness, gradually.The script is both the strong point and the weak point of the film. In fact, the story itself is good, interesting and holds the public to the end ... but let's face it, it has little originality. He remembers a lot of other films, particularly \"Memento\" or \"Fight Club\" (two older films where Scott Kosar and Brad Anderson (the director) were probably to drink some inspiration. I remember a mixture of these two films that I mentioned, although this does not remove any merit or quality from him, of course. It's worth seeing this movie just to see how this actor indulges in his character.From the technical point of view, I found it very interesting to use blotted colors, without heat, to pass through the film the coldness and absence of human warmth felt throughout history. The main character, a man uprooted and on the verge of madness, experiments and is the center of all this coldness. The plays of light and shadow, the soundtrack, all contribute to make the film and dark, somber.",
      "review_date": "2019-06-17"
    },
    {
      "review_title": null,
      "content": "The Machinist is yet another movie that looks stylish, is well acted, offers an intriguing plot - then goes on to begin looking overly familiar. It’s obvious the filmmakers had an admiration for Hitchcock’s ‘Psycho’, Polanski, Kubrick,(etc),The Machinist is yet another movie that looks stylish, is well acted, offers an intriguing plot - then goes on to begin looking overly familiar. It’s obvious the filmmakers had an admiration for Hitchcock’s ‘Psycho’, Polanski, Kubrick,(etc), and that’s OK, but to then re-invent something that you-wish-you-had-made is little more than a form of plagiarism. There needs to be more than look-a-like characters, borrowed writing and directorial touches, similar musical tonality and photographic touches – there simply needs to be more ‘originality’ for anything creative to be regarded as genuine involving art. The fact that lead performer Christian Bale, starved himself to the point of illness for this role is, dedicated to his craft, yes -but also pointlessly (and foolishly) over the top. The addition of the moviemakers (and writers) obsession with oral sex offered absolutely nothing to the main plot, so why? This work goes on to offer up one gross situation following another --for the sake of crude shock value--lacking true artistic integrity.  Great (or even good) work - needs more than style and look alike value to be fully deserving of any worthy respect. An interesting try but, an overall fail. Lovers of ‘downers’ will be close to the only audience attracted to this ugly, overreaching morbidity.",
      "review_date": "2018-09-03"
    },
    {
      "review_title": null,
      "content": "I enjoyed watching this movie.The eerie feeling that it makes you feel can almost put you into a psychosis and Christian Bale played the role wonderfully.The soundtrack was great and i enjoyed the plot twist in the end.Overall a prettyI enjoyed watching this movie.The eerie feeling that it makes you feel can almost put you into a psychosis and Christian Bale played the role wonderfully.The soundtrack was great and i enjoyed the plot twist in the end.Overall a pretty enjoyable experience.",
      "review_date": "2020-02-10"
    },
    {
      "review_title": null,
      "content": "If it just didn't insist to be Memento.....!Anderson and Kosar managed to convey the state of mind of Reznik in a way that's as remarkable as Christian Bale's shocking body transformation and terrific performance. Unfortunately, the film isIf it just didn't insist to be Memento.....!Anderson and Kosar managed to convey the state of mind of Reznik in a way that's as remarkable as Christian Bale's shocking body transformation and terrific performance. Unfortunately, the film is bogged down by relying heavily on its \"mind-blowing twists\", which are as obvious as Bale's ribs in this film. It's an unsatisfying watch for sure, but only because how great it would have been if it hadn't been pretentious. Still, it's a quite taut and suspenseful psychological thriller.(8/10)",
      "review_date": "2019-09-11"
    },
    {
      "review_title": null,
      "content": "The Machinist is a mysterious film and in my eyes a very good film. We follow the life of Trevor Reznik, who I have to work with machines, and he doesn't seem to like the job. So you can feel that aversion to it, but at the same time he knowsThe Machinist is a mysterious film and in my eyes a very good film. We follow the life of Trevor Reznik, who I have to work with machines, and he doesn't seem to like the job. So you can feel that aversion to it, but at the same time he knows that he has to do the job. I do not know how to describe it. I liked the atmosphere in this film, which was underlined by Christian Bale, who plays the main character here. Absolutely phenomenal figure, emaciated to the bone. Bale really went crazy here, but on the other hand, he probably did what he wanted to do, to create a quality mysterious film that gets to a completely different level after an unnamed bald man appears, but I won't spoil it anymore. Overall, the film is mysterious and so mysterious, but after watching it is quite clear how it is, even if it is not and you have to think about it, or find an explanation on the Internet. For me, a good film that I recommend.",
      "review_date": "2021-05-08"
    },
    {
      "review_title": null,
      "content": "asdfgjhklopiuytrewqzxcvbbnmmnbvcxzlkjhgfdsapoiuytrewqwertyuilcmsofmfomokkmkkkk",
      "review_date": "2021-04-23"
    },
    {
      "review_title": null,
      "content": "jyftdjbtdugvhnifhfdaeyipjknnygjijhugfufhggjguresfhijoomoyfyfyfuguguguftdyfighoohoninnihihihu",
      "review_date": "2021-04-26"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙,,,,,,,,,,,,,,,,,,,,,,,,,,,,,¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤",
      "review_date": "2021-05-22"
    },
    {
      "review_title": null,
      "content": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************",
      "review_date": "2021-07-13"
    },
    {
      "review_title": null,
      "content": "Just a bad movie! Slow and stupid. And bad move by a actor to jeopardize his health to play make pretend for a 90 min “movie”. Do yourself a favor and watch something entertaining. Not this train wreck!",
      "review_date": "2022-04-23"
    },
    {
      "review_title": null,
      "content": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%&$&$&",
      "review_date": "2021-07-18"
    },
    {
      "review_title": null,
      "content": "----------------------------------5.6/10-----------------------------------",
      "review_date": "2021-12-30"
    },
    {
      "review_title": null,
      "content": "I thought that this was an entertaining enough drama and nothing more. It wasn't one of those where you have to think about the hidden meaning. You just had to watch it to see what happened at the end. It was a little predictable and remindedI thought that this was an entertaining enough drama and nothing more. It wasn't one of those where you have to think about the hidden meaning. You just had to watch it to see what happened at the end. It was a little predictable and reminded me very much in style and writing to The Woodsman (2004). I think that this kind of thing would appeal to women more than men. It was about people rather than situations. I personally would have liked some more horror or thriller elements to the story or if it had any edge of interest that left you thinking and pondering meaning.",
      "review_date": "2022-02-26"
    },
    {
      "review_title": null,
      "content": "Ignore the haters. The Memento comparisons are warranted, but this is a far superior film. Memento was more of a whodunit disguised as a psychological thriller. This IS a psychological thriller. In Memento (a film I thought was alright, but Ignore the haters. The Memento comparisons are warranted, but this is a far superior film. Memento was more of a whodunit disguised as a psychological thriller. This IS a psychological thriller. In Memento (a film I thought was alright, but terribly overrated) you are one step ahead of the protagonist through much of the film and the ending was fairly ho-hum. The Machinist, on the other hand, really delivers the goods. You are just as lost, confused, and helpless as Christian Bale (doing his best work since American Psycho.) Throughout the movie, I found myself asking the same questions he was asking himself. Why can't this guy sleep? What's the deal with his mysterious co-worker Ivan? Is he a hallucination? Is this whole thing a hallucination? Why is it always 1:30? Are his co-workers really messing with him or is he just paranoid? How do the hooker and the waitress fit into all of this? The ending is both satisfying and surprising. You won't see it coming (not entirely, at least) but it fits the plot in a logical way. None of that non-sensical surprise ending crap. This could have become a trainwreck of a movie but Brad Anderson handled it deftly. Unless you're one of those people who can't take movies where you won't know what the hell is going on most of the time, definatley check this one out. One of the best movies I've seen in a long time. If you enjoy this one, check out Session 9 as well. Keep the hits coming Mr. Anderson.",
      "review_date": "2006-05-18"
    },
    {
      "review_title": null,
      "content": "I picked The Machinist up out of curiosity, after hearing the hoopla concerning Bale's dramatic weight loss to get the part, and seeing the positive reviews. After Batman Begins it thought it would be intriguing to see what a \"skeletal\" I picked The Machinist up out of curiosity, after hearing the hoopla concerning Bale's dramatic weight loss to get the part, and seeing the positive reviews. After Batman Begins it thought it would be intriguing to see what a \"skeletal\" Bale looked like, but it turned out to be about the same as seeing one of those poor starving dogs on a change can at the checkout counter in a convenience store. You look, you feel sorry for the dog, but you really don't care to know much more. Feed it, or put it out of it's misery. That's what I wanted to do to Bale's character in this movie. Instead, I had to sit through a plodding telling of a pretty boring tale. As provocative as the hallucinatory/psychotic effects from a year of sleep deprivation were, they just didn't make up for the flat, tedious story. Yeah, we knew SOMETHING big happened to make this guy so screwed up, and if the ending delivered that something big, I could have forgiven the rest of the movie for being so lifeless. Unfortunately, the satisfying ending I was expecting didn't happen. Nope. All in all, the Machinist left me hungry for something more... like a good story.",
      "review_date": "2005-12-01"
    },
    {
      "review_title": null,
      "content": "The negative remarks by critics puzzle me: If this had been a Sean Penn movie they'd all be talking \"Oscar.\" This film is intense, disturbing, moving; Christian Bale's performance is profound. it's one of those movies whose The negative remarks by critics puzzle me: If this had been a Sean Penn movie they'd all be talking \"Oscar.\" This film is intense, disturbing, moving; Christian Bale's performance is profound. it's one of those movies whose puzzles and upsetting questions (sort of like \"Memento,\" but less gimmicky) have you worried that it'll end before you figure it out. Yet the resolution is satisfying (dramatically, at least).",
      "review_date": "2006-01-03"
    },
    {
      "review_title": null,
      "content": "I loved this movie. The acting is top-notch. The ending completely surprised me.",
      "review_date": "2005-08-26"
    },
    {
      "review_title": null,
      "content": "I have a simple requirement for a movie to earn high marks: that the story be sufficiently interesting, the writing and acting sufficiently honest and convincing that they keep me thorougly immersed in the film. Few movies accomplish this. A I have a simple requirement for a movie to earn high marks: that the story be sufficiently interesting, the writing and acting sufficiently honest and convincing that they keep me thorougly immersed in the film. Few movies accomplish this. A single manipulative plot twist, or unconvincing characterization--as are abundant, for example, in Woody Allen's monumentally insipid recent hit \"Match Point\"--will catapult me pellmell out of the movie and back into the room where I happen to be watching. The Machinist lacked any of these shortcomings, and made for thoroughly engrossing, albeit intensely disturbing movie. I'm taking the time to write these comments because I feel so badly for filmmakers who do such a great job, then fail to receive the recognition they deserve, while pretentious, shallow drivel such as Match Point receives undeserved praise. More disturbing to me than the film were the off-the-mark critical reviews. The people who have rated this movie highly got it right. Therefore, I'll give it one bonus point, for a 9, rather than an 8.",
      "review_date": "2006-06-12"
    },
    {
      "review_title": null,
      "content": "\"The Machinist\" is like a malevolent \"Hulk\". This film hides its secrets better than most films with twist endings. You may guess who Trevor's assailant is, but not necessarily the reason as to why he's on his tail. Although \"The \"The Machinist\" is like a malevolent \"Hulk\". This film hides its secrets better than most films with twist endings. You may guess who Trevor's assailant is, but not necessarily the reason as to why he's on his tail. Although \"The Machinist\" isn't billed as a horror film, it comes pretty close to being one. With a little tweaking, it could've been a superior example of the genre, certainly better than \"Hide and Seek\". Trevor Reznik is Travis Bickle with a different psychological disorder, and is decidedly not Jake LaMotta. Christian Bale gives a winning performance, but so would any capable malnourished actor, or for that matter, an Auschwitz Jew.",
      "review_date": "2006-02-16"
    },
    {
      "review_title": null,
      "content": "Machine shop worker Bale is deeply troubled; he hasn't slept in a year, rapidly losing weight and looks like a walking skeleton. Mysterious notes begin to appear on his fridge and he's talking to a co-worker who doesn't appear to exist.Machine shop worker Bale is deeply troubled; he hasn't slept in a year, rapidly losing weight and looks like a walking skeleton. Mysterious notes begin to appear on his fridge and he's talking to a co-worker who doesn't appear to exist. Sinister, disturbing yet a strangely  compelling psychological thriller divinely constructed by director Brad Anderson. Christian Bale's physical transformation for the role is unreal as well as his marvelous performance as tortured individual on the brink of insanity.",
      "review_date": "2012-12-14"
    },
    {
      "review_title": null,
      "content": "Bale's disturbingly gaunt appearance occasionally threatens to overshadow his brilliant performance; and while this story of a man's psychotic breakdown is well told, it is a thoroughly depressing affair, and strays a little on the dull side.",
      "review_date": "2017-11-14"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNot as I expected, if the movie was more dramatic without thriller and illusions it will be better i think.The only think that i was amazed in this movie is how Bale made his body like this, firstly i thought visual effects, but then when i read i knew that he follow a strict diet !!Actually the plot is weak, Bale just hit a boy then he had insomnia for 1 year and i think Alzheimer also because i don't know why he just remember the child that he hit at the end of movie !!!!! really !! i think if the story was clear from beginning and adding more drama, it will more more better just let Bale acting. Am really sad to see Bale made a strict diet for this movie.",
      "review_date": "2019-05-03"
    },
    {
      "review_title": null,
      "content": "The Machinist, directed by Brad Anderson (Session 9) is the story of an industrial worker who hasn't slept in a year and begins to doubt his own sanity.\rChristian Bale's transformation is impressive as he lost 63 pounds for this film andThe Machinist, directed by Brad Anderson (Session 9) is the story of an industrial worker who hasn't slept in a year and begins to doubt his own sanity.\rChristian Bale's transformation is impressive as he lost 63 pounds for this film and literally became skin and bones. Up to that film Bale's screen persona was largely defined by athleticism and physicality. In the machinist he becomes a shadow of insomnia. The film is an alternative psychological thriller of great artistic value. It's end may be considered predictable but still it's cleverly given. Despite the efforts of Brad Anderson to impress through his direction, the film ends up being an absolute one man show by Christian Bale.",
      "review_date": "2015-12-20"
    },
    {
      "review_title": null,
      "content": "Ouvrier insomniaque qui perd la boule ou complot machiavélique ?... Le film laisse planer et entretient le doute tout du long et jusqu'à la fin, jusqu'à la révélation finale à la manière d'un Memento mais dans l'ordre cette fois-ci. LaOuvrier insomniaque qui perd la boule ou complot machiavélique ?... Le film laisse planer et entretient le doute tout du long et jusqu'à la fin, jusqu'à la révélation finale à la manière d'un Memento mais dans l'ordre cette fois-ci. La paranoïa grandissante du personnage se reflète dans son environnement glauque, sa banlieue industrielle, son boulot de forçat, ses questions sans réponse, ses post-it énigmatiques sur le frigo...Le réalisateur qui livre une mise en scène très appliquée se laisse même aller à désaturer les couleurs de façon exagérée : tout y est terne et presque gris, sauf cette voiture rouge vif... Hélas, cette fin est finalement... très convenue et se regarde le nombril dans une leçon moralisatrice à la fois facile et simpliste.Chapeau bas à Christian Bale qui ressemble à un rescapé d'un camp de la mort : une approche du rôle inutile et déraisonnable mais certainement très impressionnante, effrayante même. Il n'avait pas besoin de ça pour se donner une crédibilité puisqu'il l'a naturellement, le talent !The Machinist est comme trop souvent dans ce genre de film à révélation et ambiance, très lent, ce qui accroît encore davantage l'attente du spectateur quant au dénouement : un couteau à double tranchant dans le cas qui nous occupe mais bien que sans éclat, il faut reconnaître que le scénario tient globalement bien la route, au moins logiquement.Un concept donc intéressant, un Christian Bale habité mais qui ne suffisent pas à nous sortir de notre léthargie : nous aussi, on a envie de dormir, en fait.",
      "review_date": "2017-01-09"
    },
    {
      "review_title": null,
      "content": "¿¡¿¡》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》¡¿¡¿》¿¡¿¡》♤♡♡♡♡♡♤♡♡♡♡♡♡♡♡♡♡♡♡♤♡♤♡♤♤♤♤♤♤♤♡♡♤♡♤♡",
      "review_date": "2021-06-27"
    },
    {
      "review_title": null,
      "content": "Bale shines in this role, like many of his roles. Getting one of the greatest actor of all time is nearly a surefire way to make a standout, excellent movie, then coupling that with awesome story telling laden with clues and morsels ofBale shines in this role, like many of his roles. Getting one of the greatest actor of all time is nearly a surefire way to make a standout, excellent movie, then coupling that with awesome story telling laden with clues and morsels of teasers throughout, concluding with a lesson, is a formula for an amazing movie.Very entertaining and a classic movie.",
      "review_date": "2022-11-10"
    }
  ],
  "num_reviews": 85
}