{
  "title": "Thunderbirds",
  "rating": 7.3,
  "release_date": "2004-07-30",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "summary": "A live action film based on the British television series of the 1960's.",
  "critic_reviews": [
    "When all is said and done, the movie's a steaming plate of corn -- and, indeed, that's part of the pleasure. Myles, though, delivers a fine comic performance with no strings attached.",
    "A fun afternoon for preteen moviegoers that has just enough charm, humor and game- for-anything actors to keep parents halfway interested as well.",
    "Smartly written by William Osborne and Michael McCullers, Thunderbirds expertly targets kids. Yet parents won't be entirely bored.",
    "This special-effects-crammed action blockbuster is not rocket science. It's more like rocket fun.",
    "It's a pretty entertaining, extremely good-looking cinematic blip--not important, not outstanding, but better than a lot of PG stuff that attempts to reach both parents and their 8-year-old kids.",
    "A standard, gadget-crazed exercise in whiz-bang adventure with its tongue lodged deep inside its cheek.",
    "Without fail its upbeat cheesy wholesomeness is always good for a smile.",
    "Director Jonathan Frakes keeps the tone just this side of tongue-in-cheek.",
    "The story rarely gets fired up to \"maximum thrust,\" to use the rocket-speed parlance of its heroes.",
    "Kids are most likely to be entertained by this live-action offering, although baby-boomer fans of the series will appreciate how closely it hews to the show's foundation.",
    "It's clean and cheerful entertainment, blithely piggybacking on a beloved classic. No wonder Anderson washed his hands of this project - the filmmakers tampered with and trampled on his magic formula.",
    "Fun at times and tedious at others, it's an action-adventure fantasy aimed particularly at gadget-loving boys.",
    "The production design is phenomenal, reproducing the series' swinging '60s decor and techno-geek flourishes, from the launch pad under the swimming pool to Lady Penelope's pink roadster, which turns into a mini-plane.",
    "Making a live-action version of Thunderbirds is like rounding out the edges on a Picasso painting to render it more realistic.",
    "The trouble is, the kids seem to be in one earnest \"After School Special\"-type of movie, while the adults occupy a retro-futuristic world more like the original TV show.",
    "Thunderbirds is devoted to the principle that character and story are but rude interruptions to the real order of business, an endless display of profound vehicle fetish.",
    "Aside from a couple of rescue set pieces that bookend it, the film is strictly low-wattage in terms of action.",
    "Watching a misfire like Thunderbirds illustrates how impressive the \"Spy Kids\" movies are.",
    "Beautiful Brit actress Sophia Myles (\"From Hell\") is so arch, canny and amusing as the posh, pink-obsessed spy Lady Penelope, it's as if she is acting in the movie this should have been.",
    "A movie like this is harmless, I suppose, except for the celluloid that was killed in the process of its manufacture, but as an entertainment, it will send the kids tiptoeing through the multiplex to sneak into \"Spider-Man 2.\"",
    "As the dapper Lady Penelope, Sophia Myles tries to infuse the enterprise with some \"Charlie's Angels\" verve, but she's only one life vest, and the movie is a downed plane.",
    "This live-action feature actually has less of a pulse than the puppet version.",
    "Kids of all sizes and genders are going to be disappointed.",
    "Dreary, joyless.",
    "The action is snappy and quick, but why does this youth-targeted adventure pit white male heroes against a trio of villains comprising a black man, an Asian man, and an ugly woman?",
    "Not only achingly dull, it has no respect for its origins.",
    "Abomination of a movie.",
    "With its eye-popping color palette and surreal sense of ever-heightening melodrama, Thunderbirds comes across as \"Spy Kids'\" poorer British cousin.",
    "Simply put, this is a bad, bad film, this summer's answer to last summer's \"The League of Extraordinary Gentleman.\" A dog for the dog days of summer."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It's a cheesy summer blockbuster, aimed not just at the kids, but at the whole family as well. Yet, despite it's repeated attempts at a sense of goofball charm, the movie is ultimately lacking in fun. It also doesn't really have anyIt's a cheesy summer blockbuster, aimed not just at the kids, but at the whole family as well. Yet, despite it's repeated attempts at a sense of goofball charm, the movie is ultimately lacking in fun. It also doesn't really have any characters or excitement either. What does it have? Why, a schlocky sense of humor and a clear refusal to take itself seriously of course! Every performance is totally corny. The movie tries to throw a little something in for everybody. For kids you've got the ridiculous action and comedy, while Sophia Miles serves as eye candy for their dads. Sorry moms, I guess you'll just have to stay content with the fact that it's keeping the little ones busy for a bit. Sophia Miles is actually one of the better aspects of the movie, and not just because she's a pretty face who gets in a bubble bath at one point. She's a real scene stealer as the British super spy/model Lady Penelope. Particularly when she's joined by Ron Cook as Lady Penelope's butler Parker. Ben Kingsley is quite enjoyable. It's very evident that he was having fun hamming it up as the movie's villain. Nobody else in the cast really stands out as they are either underutilized or an annoying kid.Mix in an unlikable main character, humor that often falls flat on it's face, and some of the least exciting action and set pieces I've seen in quite a while and you've got a recipe for a mediocre movie experience. At least it nails the bright, colorful scenery. Things are quite gorgeous. With it's doofball villains, uninteresting conflicts, and dull young leads, it's not hard to see where things went wrong. Rather than being a fun flick for the kids, we just end up with something that's rather boring. Perhaps this one can still manage to entertain the youngsters a little bit, but even back when I was eight I wasn't a big fan of this movie. It's certainly not one the parents are going to enjoy. Mostly due to how lazy it all feels. You can tell things were just slapped together to make a quick buck.5.9/10",
      "review_date": "2017-03-17"
    },
    {
      "review_title": null,
      "content": "I thought this was a fantastic film. It was so cool. The theme tune by Busted (I have to admit, I'm a fan) was \"F.A.B.\" and I've been trying to find it on C.D. for ages!",
      "review_date": "2005-09-27"
    },
    {
      "review_title": null,
      "content": "I saw the original thunderbird puppets and this movie. I cannot call myself a hardcore fan, but that is not really required to comment on the movie.\r The movie is on itself nicely made. The special effects, the cars, etc are good. TheI saw the original thunderbird puppets and this movie. I cannot call myself a hardcore fan, but that is not really required to comment on the movie.\r The movie is on itself nicely made. The special effects, the cars, etc are good. The acting is good, like Milady Penelope her acting. A English lady with style and can dish out a punch when required.\rThe movie has tasteful jokes.\r If you like movies and do not require a huge dose of violence, but a movie that is enjoying and can be watched by the younger audience, have a look.",
      "review_date": "2015-05-08"
    },
    {
      "review_title": null,
      "content": "Terrible acting and script boring from start to finish nice CGI though    .",
      "review_date": "2020-07-16"
    }
  ],
  "num_reviews": 33
}