{
    "rating": 7.9,
    "release_date": "2006-12-08",
    "num_reviews": 50,
    "genres": [
        "Adventure",
        "Action",
        "History",
        "Drama"
    ],
    "summary": "The Mayan kingdom is at the height of its opulence and power but the foundations of the empire are beginning to crumble. The leaders believe they must build more temples and sacrifice more people or their crops and citizens will die. Jaguar Paw (Rudy Youngblood), a peaceful hunter in a remote tribe, is captured along with his entire village in a raid. He is scheduled for a ritual sacrifice until he makes a daring escape and tries to make it back to his pregnant wife and son.",
    "reviews": [
        {
            "content": "Despite all the action, it is such a boringly predictable movie.",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After reading a bunch of the reviews, the only criticism that I find people having is the \"racism\" and \"in-accuracy\" imposed on Mayan societies. I think people need to step back and look at the meaning from a distance. Who's to say indigenous life in tribal societies wasn't like this? It's less about the Mayans in particular than it is about pre-colonial societies as a whole. Really, it's a movie, and it's intended to have exaggeration, and I think Gibson made the \"rawness\" of this movie pretty heavy-handed   in the very beginning of the movie. Just calm down and enjoy this straight-forward, fast-paced movie.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the way Gibson tells a story. I couldn't keep my eyes off of this film . Never boring . The pace of the story was perfect . Acting was exceptional. The plot was simple , and I really had a great time watching this.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good, will definitely watch again.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film. Say what you want about Mel Gibson, but the directing, acting,  and story writing talent are undeniable and on full display here. Aside from acting, as he doesn't act in this movie.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mel Gibson delivers yet another brutal but enjoyable watch: \"Apocalypto,\" while definitely being dumbed down towards the end and just turning into a generic revenge story in the final 30-ish minutes, is still a brutally unhinged and cinematographically stunning work of art that's either gonna be a hit or a miss for most people.",
            "review_date": "2023-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all, all praise to the great Mel Gibson! Not to overhype it and leave you with extremely high expectations, but I promise you this will be one of the craziest movies you will ever watch. This masterpiece is filled with heart racing thrills throughout. Go watch it!!!",
            "review_date": "2023-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Currently my favorite a Mel Gibson film and its 2 woman role, Seven and Sky Flower, were too beautiful to memorable in dream.",
            "review_date": "2023-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, enough to own it, but that was before I really watched it. I was hoping for an accurate portrayal of a civilization that has been a huge part of my education. I was hooked the minute I read about their glyphs. Their astronomy and their number system. \nThe list is long for me! As for the movie? The one scene that gets me, every time, is the scene where the Mayan slave catcher has the baby and taunts the mother. Can't watch it, FF/skip over it, would even edit it out.... Was that scene really necessary to tell the story?\nAs for the rest of it, I appreciate the use of Yucatec Maya language, the use of Native American aboriginal actors and the location. The rest is an insult and completely inaccurate. The way that the Mayan people are portrayed is insulting and makes them look like bloodthirsty savages. They did have sacrifices but not in a way that was depicted. Their art was beautiful but some images depicted are not used in their time. THAT list, of historical inaccuracies, is long.\nAll in all, too bad that Mayans were portrayed in such a way, too bad that a certain director was used......",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant film. I felt like I was inside the Mayan world.",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie may not be historically accurate but it will keep you on the edge of your seat with extreme gore, suspense and action.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a film, subtitles throughout but only adds to the magic that is Apocalyptol. Say what you want about the director but this is up there with Braveheart and is one of the finest films ever seen.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely great.  Filled with action, beautiful photography, great writing and excitement.  This movie demolishes the myth of the pre-columbian paradise.  Well worth your time, but be ready to concentrate on the story line.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie !! very worth a watch!",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels like you’re back in 15th century Central America. Gives you a great sense of how barbaric the dominant civilizations were ",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the best movie that came out that year and should’ve won swept the Oscars. Why was it snubbed? Dust off your ego and give credit where credits due. ",
            "review_date": "2022-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece of film making! Completely original. You can feel how you want to about Mel Gibson but, he is a genius as a filmmaker!",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the criticism directed at the film for its apparent inaccuracies about the Mayan civilization, Mel Gibson's Apocalypto is a thrilling adventure story of survival as a man desperately attempts to protect his family and culture.  After Jaguar Paw (Rudy Youngblood) is torn from his family and taken to a distant city in order to be sacrificed to the gods, he escapes and is pursued by his captors through the dense and dangerous jungle.  The action is relentless throughout and more than a little harrowing as scene after scene features intensely graphic violence as the protagonist struggles for survival.  The cinematography is stunning throughout, as is the subtle but effective score.  Those who are squeamish will find Apocalypto unbearable, but it's well worth the journey if you have the stomach for it.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was amazingly filmed. I always recommend this movie.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a huge history buff I watched this movie with high expectation's given Gibson's previous work. I was confused at first regarding the tone of the movie, but that soon dissappeared as this movie opened up into something I haven't seen since. It had legitimate comedic moment's and then pure terror the next. This while keeping you at the edge of your seat not knowing what the next moment entail's. It was beautifully filmed and didn't rely on CGI. Too many movies use CGI as a crutch or just out of laziness and I think it rob's certain genre's of authenticity. This movie does not dissapoint and while it was completely subtitled I wouldn't have it any other way. I have watched this many time's and it never ceases to amaze!!!",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jolly good fun!one of the few movies about the lost civilisations around",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. I wish we had more movies set back in this Era  they really captured the lifestyle and culture. Well done.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film. Totally unexpected in its impact. I went to watch it with a few friends and we were blown away. It still resonates with me today.",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie, I went into this film not knowing what to expect, I knew it exsisted but not heard people speak about it. \n\nShame there isn't a sequal",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic storytelling!  I was engaged moment to moment, wondering what was going to happen next.\nIt's very stabby!  Lots of blood.",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some savage violence but this movie was good.",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is good. But I they made a massive mistake in the history by confusing the Maya with the Aztec civilisation. Two different peoples separated by like 1500 years or so. \nLmao. Ffs",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaguar Paw will always be a classic in my book.",
            "review_date": "2022-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite some criticisms of (proto-) historical accuracy, APOCALYPTO uses the fidelity of its details to transcend the historical in favor of the mythic. It's an incredible film.",
            "review_date": "2022-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me preface with: Braveheart, The Patriot and We Were Soldiers are among my favorite movies. That said.\n\nTL,DW Honestly who wants to watch an hour long chase? First hour's ok, interesting but no character development no redeeming qualities, just violence for the sake of violence. Once the chase starts skip to the end, don't waste your time.",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the top 10 movies of the first decade of the 21st century. The sense of authenticity and the intensity of the action create an immersive experience. A modern masterpiece and Mel Gibson's best movie.",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a masterpiece!",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece, incredible story about how the more civilized the less human and more monsters we become.",
            "review_date": "2022-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only ok movie by Mel",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you enjoy history and brutality this is the film for you.",
            "review_date": "2022-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "based, for some unknown reason I think this movie is a masterpiece, maybe because I watched it twice, I really like the photography, the actors and the performances, and well, I don't know if that language used was invented but it was amazing to watch, although I felt that it doesn't need a sequel, it would be interesting to see a little more about that ending.",
            "review_date": "2022-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply another MASTERPIECE Mel Gibson gave to us.",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW. This movie had me in a cold sweat by the end. As messed up as it is beautiful, it was refreshing to see history on the big screen like this, in a cinematic way, visually stunning and shocking the entire time",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie started as feeling a bit off to me and there were some far-fetched sequences, however I loved what this film ended up turning into and the twists and turns that ended up happening. The dramatic and epic moments were well-shot and executed, the antagonists were well-written, and the third act was like I was watching a Rambo movie in the jungle! While violent, that's why I'd recommend it for those who like that kind of gruesome action and know how to appreciate something well-crafted.",
            "review_date": "2021-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Relentless, powerful and surprisingly artful.",
            "review_date": "2021-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to capture moments in history when we don't truly know what they were like, but this movie gets as close as anyone can get. Visually captivating, and keeps you on a knife's edge the whole time, this is a very well made film.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remains a fantastic cinematic event, deeply sympathetic yet exotic, mesmerizing, immersive and entertaining...standing strong to repeated viewings. i've yet to read a ceitique r dismissal of this film that doesn't diminish the one doing so.\n\na longstanding must-see, and perhaps Gibson's best film.",
            "review_date": "2021-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual masterclass.  Amazing cinematography, costume design, and set design.  Great storytelling with few words needed.",
            "review_date": "2021-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Written, produced and directed by Mel Gibson, this film is about a young Mayan man who lives through the sacking of his village by slavers from a rival tribe. Make sure you have subtitles on as the language spoken in this movie is a modern interpretation of the ancient Mayan language. This movie has a very cruel undertone throughout. Not only through the depiction of human sacrifice, but also the bullying of a fellow hunter at the beginning. Kudos to the casting of native peoples for a movie about native peoples. I felt the climax of the movie was a bit of a let down as the plot seemed interrupted. The final act was an R rated jungle version of Home Alone that I felt could have been better set up earlier in the movie. Personally, not my kind of movie but I can see how it would have an audience that appreciated it.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this th  first time I was hooked on a movie from start to finish, without knowing what is going on ... the movie has insane rewatchability power,  you miss so much the first time you see it.. Amazing movie",
            "review_date": "2021-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mel Gibson has said some pretty foolish things in the last decade, and that's a pretty kind way of putting it. However, his film making and film choices (Dragged Across Concrete [2018]) have most assuredly not been. Sure, he entertained us all with the nonsense that was Braveheart (1995) somehow fooling the Academy into thinking it was highbrow historical fact and sweeping up at the Oscars. Fair play. He appeared to do the same thing again with Hacksaw Ridge (2016) taking some laughable exploitation violence and applying it to a supposedly serious war movie, then throwing Vince Vaughan into the mix. If Hacksaw Ridge was taken tongue in cheek, it might work, to an extent, but for it to be up for so many Oscars was insulting. Gibson's best films as director, hands down, are The Passion Of The Christ (2004), and this, Apocalypto. Gibson's take on the last week of Jesus' life is shockingly violent, but it is not, as people like to label it, exploitational. It's an easy trap to fall into considering Gibson's traits, and if you're not overfamiliar with the week Gibson focuses on, fall into it you might. The attention to detail from Gibson, down to choosing to stick to the original Aramaic language for the film is hugely commendable, and despite the totally out of place slow-mo shots, The Passion Of The Christ is a piece of work- in every respect. Apocalypto sees Gibson continuing his attention to detail in subject matter, focusing on a Mayan community in the jungle of Yucatan, Mexico, in around 1502 when the Mayan kingdom was at the height of its power, but also having to deal with the crumbling of its foundations. Gibson's tale is well told, realistically violent, and once again the only thing that feels out of place is the same slow-mo shots that very slightly hampered The Passion Of The Christ. Gibson has learnt lessons from Braveheart, and proves that he really is a director to be reckoned with when he is this focused. The problem is, so far, for every Apocalypto, we have a Hacksaw Ridge forced upon us. A bit like Gibson's outbursts in the public eye, he should think about what he's saying, because when he does, we reap the benefits.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's savage, bloody, uncivilized, genocide, sins, cruel-reality which still exist today in different forms. Warrning, excessive violent not for teens. Nonetherless, Mel's work of masterpiece. It's good but not little oscar, perhaps it didn't aim for that too.",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        }
    ]
}