{
    "rating": 3.5,
    "release_date": "2006-02-17",
    "num_reviews": 49,
    "genres": [
        "Romance",
        "Comedy"
    ],
    "summary": "Julia (Alyson Hannigan), a hopeless romantic, finally finds the man of her dreams: British gentleman Grant Fonkyerdoder. But she and her beau face many hurdles that they must overcome on the way to the altar. First, each has to meet the other's parents, then they must consult a wedding planner and foil the plot of beautiful -- but jealous -- Andy, who desperately wants to spoil her best friend's wedding.",
    "reviews": [
        {
            "content": "This might be the worst movie I ever watched. It's extremely juvenile and the gags are very bad.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is hilarious that the writers thought this was comedy.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too awful for their acting! I really regret going to the movies to see this and the 75 minutes i spent watching this movie which i will never ever get. This movie is absolutely rote and the acting is awful. The parodies they did in this movie were so bad. In the first 10 minutes of the movie I saw 3 people get up and leave. They didn't return. The same happened at 20 and 30 minutes. These were all kids. There wasn't a single laugh in the theater. Hardly anyone stayed at the end. Don't rent this movie at all - it isn't worth the $1 rental price. I really regret ignoring peoples advice that saw the movie \"Dont see this movie! It is awful\" Aaron Seltzer who directed the movie really doesn't know how to make movies. I really wanted to give this 0 stars but instead the lowest possible rating is 1 star. Officialy in my top 10 worst movies I ever seen in my life. I don't think Aaron Seltzer and Jason Friedberg should be able to make movies again after Epic Movie,Date movie,Meet the Spartans,Vampires Suck.",
            "review_date": "2022-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, the funniest 01 hour: and 22 minutes ever!!!!!!! Rated and unrated versions are on 1 DVD or BD!!!!!!!!!!!!!",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another pile of crap from the retarded duo Friedberg and Seltzer to exploit the less intelligent part of population, and half of them won't like it all the same.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too Terrible for words\nI really regret going to the movies to see this and playing 12.50 for the tickets so I can see it.All I can say is that I want my money back and the 75 minutes i spent watching this movie which i will never ever get.This movie is absolutely rote and the acting is awful.The parodies they did in this movie were so bad.In the first 10 minutes of the movie I saw 3 people get up and leave.They didn't return.The same happened at 20 and 30 minutes.These were all kids.There wasn't a single laugh in the theater.Hardly anyone stayed at the end.Don't rent this movie at all - it isn't worth the $1 rental price.I really regret ignoring peoples advice that saw the movie \"Dont see this movie! it is awful\" Aaron Seltzer who directed the movie really doesn't know how to make movies.I really wanted to give this 0 stars but instead the lowest possible rating is 1 star.Officialy in my top 10 worst movies I ever seen in my life.I don't think Aaron Seltzer and Jason Friedberg should be able to make movies again after Epic Movie,Date movie,Meet the Spartans,Vampires Suck.\n\n0 out of 10 is my rating.",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors are completely lost. There are comedy movies that even if I don't laugh I can find something good, but not here, here it's all boring. Jokes don't have comedic timing, and when they appeal to jokes about pop culture, then the business goes down for good. I can't believe I wasted my time on this shit.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did they trick Fred Willard into being in this piece of...",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely predictable and insane, Date Movie is one of the worst parodies I've ever seen, ridiculous and absurdly boring, it's too horrible to be able to watch this entire movie, it's dull from beginning to end, it's banal.",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just from reading the description on HBO, you'd think it'd be a movie about someone who loses weight and betters herself. No. That is not at all what happened. 20 minutes in and I wanted to end my life. I couldn't finish it all. Please don't waste your time on this, it's not worth it at all. The acting cringe, the directing poor, and the movie's attempts to be humorous resulted in making random crude, lewd, degrading jokes that made no sense whatsoever. I have literally never seen a more repulsing display than this. The characters say and do things that no one in real life would, and the whole time I was asking myself WHY. This left me wondering how so much money can be spent on this crap instead of more pressing and important matters in the world.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In an attempt to parody rom-com cliches, \"Date Movie\" ultimately makes a mockery of itself, with juvenile toilet humor and empty pop culture references.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad it has its own anti-commentary. Fart scene was great though.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is proof that The Burnin' Medallion Of Badness can ruin a \"Date Movie\" that is mostly unwatchable. Characters: 1.5/5 Story: 1.5/5 Acting: 1.5/5 Special Effects (mostly low-budget): 1/5 Direction: 0/5 Cinematography: 1/5 Soundtrack: 1.5/5 Overall: 1.5/5",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fred Willard is worth half a star and Carmen Electra playing the Fay Wray/Jessica Lange/Naomi Watts part (Ann Darrow) are practically all this movie's got to give to the world or arts and entertainment.\nAnd I have to say that Carmen Electra is in the top half of the Ann Darrows of the world.",
            "review_date": "2020-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why cant I give it 0 stars",
            "review_date": "2020-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this because it just is so funny",
            "review_date": "2019-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While better made than the other two Movies, not counting Meet the Spartans, Vampires Suck, The Starving Games and Spy Hard with a sincere performance from Alyson Hannigan that seems rather out-of-place in a movie like this, Date Movie still mistakes pop culture references for movies that came out in the last two years for actual jokes and prefers to pad out the runtime with terrible unfunny poop jokes with a very unconvincing cat puppet. But if you want to see if your favourite movie got referenced, then that's definitely one reason as to why you should watch the Friedberg/Seltzer series of shallow spoofs.",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's put it this way...... Only movie I've ever walked out of in the theatre, and I love going to the theatre. ",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another tryhard comedy.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film just offends my eyes. I don't really understand why it was made. It attempts to make a mockery of films genuinely funnier than itself. Very confusing and a waste of time. Alyson Hannigan is still fit, though.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another \"Scary Movie\" rip-off that's insulting and unfunny.",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Date movie is a Comedy that is trying to get a laugh. This film is a stupid spoof movies of ALL spoof movies. Just for the first five minutes of the opening credits I was wanting to like shut down my television and just say why, why did I killed my eyes to see this film. This film is starring ALYSON HANNIGAN, which as you may know from her comity is from Buffy the Vampire, American pie, and everyone's favorite how I Met your mother. And oh my God I think that she desperately needed for money to be in this stupid stupid stupid stupid stupid movie! I have not had a single damn laugh out of this whole goddamn movie! I hated this film  hated this film. hated hated hated this film!!! Every single scene I want to gag out of my fucking mouth just by the stupidity of this god awful film.  This movie is the worst film I have ever seen in my fucking life. \nI'm not fucking around here I need a fucking drink or painkillers just by seeing this awful film. This is a awful film to go see you don't see this awful film I swear to God,  you will hate it!!!!!\n\nThis film get a 0/10 \nTerrible!!!",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I double-billed this with Kevin & Perry and it seems as though this is America's answer to ridiculous, infantile humour. I'm not against that, I just prefer wit over fat jokes. The film references are what I stay for. That's my jam. Plus I love Alyson Hannigan. But she could probably do a lot better than this!",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible unfunny spoof which gets very tiring and boring about a quarter of the way through. It tries to be funny but fails miserably by trying to take the mic out of lots of romantic comedies. The jokes aren't funny and exaggerated which make them even stupider to watch. A poor effort.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny enough to see , had enough smile's and sexy stuff in it , had a nice time watching this ...that's all that matters . SOMDVD",
            "review_date": "2015-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie ever made.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even as an youngster, this movie was dull for comedy.",
            "review_date": "2015-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This felt like they took a group of eleven-year old boys and told them to write a funny movie.  They failed.",
            "review_date": "2015-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes the romantic comedy cliche' movies need to be  \"spoofed\" with proper screenwriters that aren't Aaron Seltzer and Jason Friedberg (who directed the film)! the film is  written \"everything is wrong with hollywood\"  all over it! The satire is old the racism is old and not funny. The film mocks celebrities like Barbara Streisand and Will smith two very talented actors. Yes the film is funny as hell, but the writers are uncreative. I don't get it why do the directors \tAaron Seltzer, Jason Friedberg make fun of movies that were good? They really hate good movies. They pick on films because the films have talent itself and they don't. Grade D+",
            "review_date": "2015-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no words!!! NOTHING!!!!ð??¿",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Date Movie is a take on parody of the \"romance\" genre of many films, and man, is it bad. It's in fact horrible. This film had quite some potential but the pop culture references and the extremely uncomfortable long lasting sequences ruined this film in a really horrible way. By the first 10 minutes the film goes rock bottom and forgets anything \"enjoyable\" that maybe would have happened. This is not anything like \"Austin Powers\", \"The Naked Gun\", or even \"Airplane\". This is a completely uncomfortable rushed parody film with a budget lower than the reviews for this film. Go into this film expecting a really uncomfortable experience. Not even slightly funny.",
            "review_date": "2015-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Giving this movie a half star is giving it to much credit.",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was unfortunate enough to come across this on television. You couldn't pay me to watch this over again. Parody has died; simply making references to other  films does not make a movie funnier. There has to be a reason for the reference. All I could compliment this film for is for simply having a plot in the first place. Something \"Disaster Movie\" lacks.",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny when I was thirteen, now just seems forced.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Friedberg and seltzer have clever ideas like spoofing romantic movies which can be ridculious but this is a misfire a totally awful film I was laughing sometimes but because how dumb this movie is this had no laugh out loud moments 4 or 5 chuckle moments this fails as a movie and as a comedy\nIt was awful this should've never\nBeen made I forced myself to watch this till the end \nGrade F",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Empty pop culture referencing schlock.",
            "review_date": "2014-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alyson Hannigan, why??? I made it about 30 minutes into it which is better than I thought I'd do. I liked that since I watch a lot of \"date movies\" I understood where the references were coming from. But the jokes were mostly just for gross out value. I was done once the cat had diarrhea on the toilet.",
            "review_date": "2014-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than others in the (Movie) series but still very bad.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie wasn't unfunny to me to be honest. I laughed at the pure stupidity of the parodies of the dating movies in this movie. It was so bad it was good, kind of like a dating version of \"The Room\" but that doesn't mean my rating is gonna be good, because just like \"Vampire's Suck\" & \"Epic Movie\" this movie was so poorly made it was really embarrassing",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely awful. Stay away from Friedberg and Seltzer films as much as possible. Few, if any jokes land, and the whole movie is just gross and off-putting.",
            "review_date": "2014-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painful to watch, yet I kept watching.",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "endless laughs from start to finish.\nopening scene is BOSS!",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What did you expect?",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrid disgusting could finish this movie I wasn't strong enough F",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Consider this a date movie only if you want to break up with that person.",
            "review_date": "2014-04-16",
            "source": "rt",
            "lang": "en"
        }
    ]
}