{
    "rating": 8.5,
    "release_date": "2006-03-24",
    "num_reviews": 330,
    "genres": [
        "Mystery&thriller",
        "Crime",
        "Drama"
    ],
    "summary": "A tough detective (Denzel Washington) matches wits with a cunning bank robber (Clive Owen), as a tense hostage crisis is unfolding. Into the volatile situation comes a woman named Madaline (Jodie Foster), a mysterious power broker who has a hidden agenda and threatens to push a tense situation past the breaking point.",
    "reviews": [
        {
            "content": "One of my favourite films of all time. Fantastic cast, filmography and twisty plot (my favourite kind).\nMy family hate watching films with me because, most of the time, I work out storylines, even unexpected ones, very early on in the process. However, Inside Man leads you down a path of prediction (i.e. the not-so-obvious conclusion), then suddenly the plot twists and you have to re-think your whole theory. \nMine changed several times during the film as it slowly drip-fed new information to the audience. Then, when it did reveal its very satisfying reveal conclusion, it still went that little bit further and provided another little twist at the very end. \nLove it. I have even enjoyed watching it several times since with people who have never seen it before by being entertained watching them trying to work out the plot. \nThoroughly recommend.",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very re-watchable movie with top talent doing what they do.",
            "review_date": "2023-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's not to like about this film? Inside Man is a beautifully made thriller with several plot twist and top of the class acting, simple put it's la crème de la crème of crime films.",
            "review_date": "2023-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. I did not see that coming.",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hours: and 09 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not always this weird returning to movies from the mid 00's and I think that says something about Inside Man. While it is technically a fascinating way to spin a heist movie - timeline hopping a little with an actually unusual and unpredictable heist - it comes off as feeling smarter, funnier, and more clever than it actually is. This is one of Spike Lee's few true blockbuster movies and I think he does a pretty good imitation of a blockbuster, but it in the end feels like it isn't entirely honest with itself and ultimately ends up feeling lost in the weeds of its own making.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea how this movie has so many good reviews. It isl rife with stereotypes, clichés and pointless dialogue. i've never seen so many award-winning actors in such a boring pointless venture.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clive Owen was fantastic.   Other than that very average, was expecting more with the cast.   Unless you are bored, much better options",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie takes the crime/heist genre and allows you to slowly makes you believe that this is going to be your run of the mill movie but then spins it on its head. When you have Denzel, you know your movie has a great chance to be great and they nailed it.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stellar casts, good story plot.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story but the movie did not need to be two hours. With the star-studded cast, the dialogue, although funny and clever in places, could have been crisper; scenes could have been shorter to keep the pace moving and fun. Denzel was great. He saves the film's loooong middle searching for the punch line.    Spike Lee gets a B- for directing.",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Denzel's best films, and the supporting cast is great too. Difficult to rate tgd plot without a spolier-alert.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge fan of director Spike Lee & and actor Denzel Washington,  however I personally found INSIDE MAN to be one of the most disappointing films in both men's filmographies. C-",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding plot, Clive Owen, and Denzel Washington make this the best non overly serious heist film out there. To expand, Heat and Heist are overly serious, Ocean's 11 and Bandits are full heist-comedy. Inside Man is an extremely happy medium.",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of Denzel’s best work. Sadly they cancelled the sequel which I think takes away from the somewhat lack of resolution in this one. Still a great movie",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-written, great cast/acting, stylish direction, an instant classic heist film.",
            "review_date": "2022-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. Some of the visual and audio techniques in this film elevate cinema as a whole, truly fantastic from beginning to end.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie and script. Everything in the movie is made incredibly and simply.",
            "review_date": "2022-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee is at his most mainstream with this clever and entertaining heist thriller. It doesn't really thrill all that much, and the payoff is underwhelming to say the least. And this being a Spike Lee film, there has to be a racial subtext. Still, the performances crackle with nice casting, with everyone taking their cue from a sturdy workmanlike Denzel in the lead. The pacing is fluid for most of the time, but the musical score feels off at times. Too bad this didn't meet the pot-boiler expectations its previews had promised",
            "review_date": "2022-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's Grade-A directing makes this a thriller that will keep you on your toes.",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was good, and very original. That said, I realized part way though that I had seen it before, yet didn't remember it at all, so maybe that says something?",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is actually a quite refreshing and different take on a bank heist film.  The standouts here are of course Denzel Washington as Keith Frazier and Clive Owen as our antagonist of sorts, Dalton Russell.  While not fantastic, it still does it's job to surprise and entertain us.",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "real good; smart plot & a great twist. & what a fantastic cast - Clive, Denzel, & Jody - they all fit their characters SO well. very well done. 10/10 would recommend.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, fun, entertaining movie. Some questionable writing/dialogue, but if anything you'd added to the fun. Worth a watch",
            "review_date": "2022-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wholeheartedly agree with Walsh’s review here. Like he said, audiences have come to expect so little these days that mediocre tripe like this gets good reviews. The police and hostages in this disaster of a film are all standard Spike Lee stereotypes, which populate his tribal (Walsh) conception of New York City. And that ridiculous, pounding soundtrack was laughably melodramatic and added nothing to the film. ",
            "review_date": "2022-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies Ive seen in a while\nand one of the best action movies I have ever seen\nits must watch\n great performance from the actors\njust wow",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the exception of a few stylishly executed shots, a New York locale and a brief social commentary about race, Inside Man is probably one of director Spike Lee's most ‘unSpike-like' films in his oeuvre.  Detective Keith Frazier (Denzel Washington) is assigned to handle a bank robbery in progress involving hostages.  Dalton (Clive Owen), the ringleader of the heist, has orchestrated the perfect crime and confidently manages his accomplices and hostages to ensure its success.  And then there is Madaline (Jodie Foster), a mysterious fixer who inserts herself into the drama.  Inside Man is a clever, well-executed thriller featuring strong performances from the entire cast and a plot that will keep audiences guessing until the final scene.",
            "review_date": "2022-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found the plot confusing at times with holes you could run a bus through.",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie about a robbery with a very well thought out plot and a really very nice development, it lacks a bit of tension to the viewer, but it compensates for it with a strong entertainment that keeps you glued to the screen",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an event movie lacking the depth of characterisation required for such a premise. Tonally it's a mixed bag as well.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look... the movie is pretty fun but watching films with oh-so-in-your-face casual misogyny is really annoying. I guess it's accidentally important as it reflects the attitude of filmmakers and writers at the time that it's being filmed. (2006) \n\nBut that doesn't forgive it, just like all social injustices it needs to be pointed at and acknowledged. \n\nAlso... often the detective dismisses, ignores, and interrupts important aspects of the investigation in order to engage in some swaggy dialogue. It's consistent, annoying, and unrealistic. \n\nThe way he attacks nobodys in the interrogation center is totally ridiculous and unprofessional ... and FFS that soft-focus vaseline lens.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel the guy just makes the best movies a must watch..",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good suspenseful intelligent heist movie with a nice cast and interesting twists. worth watching.",
            "review_date": "2021-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story, great cast, suspenseful, enjoyable. Hard to fault.",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is absolutely one of the best in the crime genre. Too bad the cast didn't have more time, because seeing them work was worth the cost of admission. To believe the pace is slow might denote a slowness in the critic, or perhaps just a mild retardation. Brilliant.",
            "review_date": "2021-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit too much on the interviews & flash backs, overall brilliant production. It's all about chasing out the skeleton from the closet. Solid casts orchestrate what the eyes saw the heart believe illusions trick.",
            "review_date": "2021-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My main issue with this movie was how illogical it all was. The first half is fine, yet the second half seems like a whole different movie. Lots of (what turn out to be) red herrings which make no sense at all, and what about Denzel's repeated talk about Big Willie and the Twins?",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you can endure Owen's horrendous American accent to get through to the end of the film, you will be disappointed. Worst heist film I've seen.",
            "review_date": "2021-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film has really good pacing and plot is interesting",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "85%. Not much action or violence but a cool plot and much more than just a bank heist. It goes a lot deeper and the story as to why it's happening is great. The detective work by Denzel is awesome. Great heist movie but not quite on the town's level",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "15 years after the first watching, what a good heist thriller this is! I hope that somewhere in film colleges one takes this as an example of how to make a heist film that's functioning great: from the superb cast (Denzel Washington, Clive Owen, Jodie Foster, Christopher Plummer), and a script that's far from clichéd, to being able to make the viewer think while at the same time being very entertaining. Some of the scenes will seem very current, since the hostages have to wear the same kind of masks as the bank robberies, so it's impossible to distinguish them. In addition, I was pleased to see a film in which a corrupt multi-billion bank owner gets a payback. A recommendation without the doubt.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an intriguing enough and overall good movie, but very underwhelming. Considering the reviews, I was expecting an exhilarating heist thriller. But it didn't live up to that, it's actually quite different that your typical heist movie. It's got its moments, it's got a few little twists and turns here and there, but in the end, it feels too safe and it could've been way more thrilling. \nBut on the bright side, it features a good score, which helps to wrap up some tension, and the film is supported by a terrific cast. We've got Christopher Plummer, Jodie Foster, Willem Dafoe, Chiwetel Ejiofor, Clive Owen and the great Denzel Washington to top it all off. \nOverall, Inside Man divided me a bit. It's a surely flawed pic, but still satisfying . It's no The Town (2010), but it still has a few things to offer. It just wasn't exactly the flick I was expecting. \nRecommended for genre fans.",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was alright \nGreat cast but lacking in thrills and it's too long",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not just your average heist movie but a captivating thriller with various intriguing plots meeting up, supported by solid performances of its great cast.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the ultimate heist movie! I had seen at least some parts before, but couldn't remember the details of the plot, which made it more entertaining to watch! It has interesting cinematography, intelligent writing, and really great acting by Clive Owen, Denzel Washington, and Jodie Foster. I think the sound mixing had room for improvement - we had to keep turning the volume up and down during different types of scenes and the music felt out of place. Anyways, I would recommend it to anyone who has not seen it!",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time. Think i have seen it at least 50+ times. Fantastic story and actor-performances all throughout the movie. My favorite line: 'Anyone else here smarter than me?!'. Great!",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great plot and plot twist, great actors. Watched it many times.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is probably the most commercial film ever made by Spike Lee. It's a fun entertaining crime heist thriller with incredible actors such as Denzel Washington, Clive Owen, Jodie Foster, and others. The script is well written with an intriguing plot that keeps us intriguing and asking for more ending with an interesting twist. Denzel kills it as he always does immersing himself in the role and commanding the film. Clive Owen is also spectacular who always brings its sense of wit to his performances although here he is sometimes limited by a mask. Jodie Foster as a secondary character also shines with a character that has ulterior motives. The film has some political undertones which are universal in Lee's films but here there not too on the nose. He brilliantly directs this film and gives a fun popcorn flick that's well directed, acted, and scripted.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie.  A unique plot with a lot of suspense.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An above average bank heist film that shows multiple sides of the story with a few twists. The acting was good, but a few characters could have been better and didn't serve much purpose (e.g. the lawyer). The plot felt somewhat fresh due to the alternating between the detectives/police and bank robbers. It was also borderline believable, although I doubt the escape route would have worked in reality. However, the cinematography and soundtrack were nothing special. The police interview scenes should've looked better and like the rest of the film rather than having a tinted/grainy appearance. On the other hand, the visual effects were all right. Nothing was great, but it wasn't bad.",
            "review_date": "2020-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee and his A++ cast nail this multifaceted caper flick and make it easy to stay engaged, even on subsequent viewings. 7.5/10",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better bank robbery movies in crowded field",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Realistic, which makes movies like this fun to watch. Good acting, wasn’t great considering the cast, but story itself makes it a great movie. ",
            "review_date": "2020-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best caper movies.  never a dull moment.",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a smart, well-executed heist movie. It's constantly letting the audience know that it's going to pull a fast one at the end, but keeps them guessing who and when and how. The top tier actor list does not disappoint, bringing the rich characters to life with a smooth aggressiveness that makes full use of their considerable talents. The pacing would normally be considered slow-burn, but there's enough to think about at all times that the pauses instead become room to think and let the plot breathe a little. Ultimately it thinks it's a bit more clever than it actually is and it takes too long to wrap up in the third act, but those are small criticisms for such a unique and well thought out story.\n\nClosest comparison: It's like Heist (2001) mixed with Silence of the Lambs, but with drama and intrigue in place of psychological horror.\n\nSetting: Detective\nPlot: Heist\nTone: Drama",
            "review_date": "2020-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie. I love heist movies in the first place and this was one of the better heist movies I’ve ever seen. The cast is fantastic and the story was great. I would recommend to anyone!",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good splice story. Bank heist with a hostage situation to it and there's more to it than initially meets the eye!\n\nDenzel doing what he does best and a solid performance from Owen throughout.\n\nProbably wouldn't rush to watch again, not a groundbreaking movie, but definitely worth the watch.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not among Spike Lee's best works, but it's an engaging bank heist thriller, with a smart and witty script, an energic pace, and unexpected plot twists that keep the narrative fresh and entertaining.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good bank heist thriller.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it, the way the characters interacted in a way that showed intelligence and planning was interesting and led to complex scenarios and unique situations.",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok. Ngl, I expected more than... well, I won't say. It had its moments and Denzel was great. I thought it tried to be more clever than it actually was and felt a bit pretentious at times. Yeah, it was ok. I guess",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong performances and some twits as well. If you like heist films this might be a must watch.",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To anyone that suggests that Spike Lee is incapable of producing films that rely too heavily on racial commentary, Inside Man is a solid counter. It's laden with twists to the point where many become painfully obvious from a substantial distance, but is overall an enjoyable heist film that features an all-star cast, even if certain talent (Ejiofor and Dafoe) feel almost criminally underused. Is it destined to become a classic in the genre, or appear as a defining performance for any of its actors? Probably not, but you can pop it on during a weekday night and go to sleep satisfied. (3.5/5)",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances and I considered a 4/5, but the ending didn't do credit to the rest of the film and it kind of dragged as it tries to tie up and chase down every loose end.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, a very good film that holds your interest.  clive and Denzel and Jodi are great. However, it features one of the most glaring blunders at the end - spoiler alert -\n\nHow in the world are all the thieves not descendants of the man whose home/possessions were stolen by the nazis?  Huge, gaping flaw.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic story line but stellar cast brings it home. Foster's character is a bit muddled but you forgive it amongst stronger leads. Good twists with a satisfying ending, could be excellent if it had stronger connection between characters and their story lines.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty slow burn but the acting and the ending make up for it. A twist no one saw coming. Solid movie ",
            "review_date": "2020-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if it's Spike Lee's best movie but unlike the rest, it's the most rewatchable. I've probably watched it 15 times and have only watched Do The Right Thing once",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting a spectacular heist movie but I got a good one instead. The cast was good, so were the plot, the conversations, the directing even the music but it wasn't great as I wanted it to be.",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best heist films ever made.  The thing about casting Denzel in this role is that you expect him to be very intelligent and able to go toe-to-toe with the master criminal, even though the early part of the film really did not set him up as a super cop.  The back and forth between him and Clive Owen really makes the film and helps maintain the pacing.  Jodie Foster adds a wonderful side story to the movie, keeping the movie from being boring by being one dimensional.",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure how I feel about this movie. Usually, if I finish watching a movie and still don't understand a central part of what the plot turns on, it irritates the heck out of me. I started searching for articles explaining it and ... most of the articles out there that were like \"let me explain the brilliant plot twist!\" didn't understand it either, or at least didn't have a *full* explanation that was satisfying and made sense -- particularly in terms of the motive for the whole thing. (Part of the twist becomes pretty clear by the end, but the bigger story and rationale behind that twist remains very unclear.) And then I finally found a comment thread that made it all fall into place... and if this theory is correct, one of the central figures in the plot is a minor character with a tiny number of lines. Which is kind of an interesting move. Thinking about it later made me think about the movie in terms of primitive accumulation and the ill-gotten sources of most fortunes. But maybe there's also a commentary here on the difficulty and partiality of accountability for the wrongs of the past.",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimately encompassing one too many dramatic reveals and \"1, 2, 3, cue the music!\" moments.",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From director Spike Lee comes the smart and intense crime thriller Inside Man.  When a group of bank robbers take hostages and lock themselves in a bank NYPD detective Keith Frazier is sent in to negotiate, but things soon take a strange turn when the bank's owner calls in a specialist to negotiate privately with the robbers on his behalf.  Starring Denzel Washington, Clive Owen, Jodie Foster, Christopher Plummer, Willem Dafoe, and Chiwetel Ejiofor, the film features an impressive cast that delivers some strong performances (particularly Clive Owen).  And Lee too does a good job at heightening the tension and at setting a foreboding tone.  Additionally, the script is especially well-written, particularly in how it sets up the heist and buildings intrigue by using flash-forwards of interviews with the hostage about what happened in the bank during the robbery.  Dramatic and exciting, Inside Man is a fresh take on the heist genre.",
            "review_date": "2020-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movie by Spike Lee. Plan and implementation of the \"perfect robbery\" all seasoned by the usual, wonderful and romantic cross-section of New York (and America in general) so dear to the director in any of his works. Excellent direction (which also grants some finesse at a technical level with highly sought after shots and sequence shot), excellent editing. Good acting.",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall, Lee succeeds in creating a gripping and original heist thriller, but cringy humor and unlikeable characters unfortunely drag the movie away from real acclaim.",
            "review_date": "2019-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee has never been known for his subtlety as Get on the Bus (1996) could be accused of literally spelling out it's message to you but his mid-2000s work has received praise for being more accessible. This film in particular is a clear attempt at making a mainstream, commercially successful product with occasional references to racial tension to ensure that the critics are pleased. I wanted to go with the film but it's plot was so preposterous that it was hard to care and the smugness with which the film went about it's business turned me off completely. Most heist thrillers are similarly ridiculous but this film had none of the introspection of Rififi (1955) or the emotional depth of Before the Devil Knows You're Dead (2007).\n\nDalton Russell, Clive Owen, attempts to rob a bank in Manhattan with the help of masked accomplices as he forces those inside the building to wear costumes and locks them in various rooms. The case is investigated by Detective Joe Frazier, Denzel Washington, with the help of Detective Bill Mitchell, Chiwetel Ejiofor, who is confused by the responses of those trapped inside the building. Complicating matters further is the fact that independent contractor Madeleine White, Jodie Foster, is determined to ensure that a safe deposit box does not have it's contents discovered. She works for the mysterious owner of the bank, Arthur Case, Christopher Plummer, whose possessions are inside in the safe deposit box and he refuses to tell her exactly what is inside the box. A late breaking twist turns our understanding of events on it's head.\n\nSadly the lead up to this twist drags on for far too long to hold our interest and the twist itself is disappointing as there are so many obvious plot holes that you can't help feeling cheated. Why would Case have kept the incriminating document and the diamonds? Who is White and what are her motivations? Not to mention the fact that the security cameras should have captured those in the bank before the robbery. Films that invest us enough in their concept during the first half are generally capable of shocking us with a twist but because I was never engaged it landed with a thud. Lee's execution of the reveal was also awkward as we see the opening scene of Owen speaking smugly to camera before he reveals information that comes out of field. We are angered as the film has set up it's premise as though the information he has provided us with would allow us to understand the ending but this is not true at all. When the out of nowhere twist arrives it has little relation to what we have learnt so there is no cleverness to the set up and it isn't gratifying.\n\nThe chaotic shooting style that Lee adopts also hinders the film rather than raising it above the average film within it's genre. When they witness the various hostages inside the bank getting dragged around or Frazier rushing around outside we get over the top camerawork that confuses the audience rather than involving them in the events occurring. I wanted to feel excitement as a group of hostages in jumpsuits screamed and various guns were pressed against various temples but I felt a surprising amount of apathy despite the considerable violence on displaying. The leery attitude that Lee takes towards women was also on display as all women were either sex objects or old, overweight women to be mocked. One hostage played by Kim Director has her breasts ogled by both Frazier and Mitchell but Lee seems to be reveling in the sexism rather than commenting on it and encouraging his audience to enjoy in viewing a woman only as a niece hunk of cleavage. Even Foster is often viewed as a sex object despite the supposedly powerful position she holds and it was disappointing to consider that despite making so many films Lee had not progressed as a filmmaker.\n\nThe performances all felt off as Foster in particular didn't seem to have a real sense of what register to play her character at. She was neither deliciously campy villain nor quietly commanding shadowy figure and although I wanted to hate her as you do a great villain I felt at a strange remove from her. This let a lot of the tension out of the film and I couldn't partake in the glee of seeing her cut down at the end of the film.",
            "review_date": "2019-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining play on heist tropes.\n\nSpike Lee's crime thriller Inside Man (2006) is a frenzy of fun heist sequences with great planning and clever writing. Inside Man plays with the very idea of what a heist is and how it can be carried out over the course of a film. Lee's direction is solid as he keeps you looking where he wants, so that you never guess the twists and turns of Inside Man. \n\nThe cinematography is good, but not the greatest among Lee's films. The lighting is oddly dark and the shots are just generally ugly looking or dated. The pace slows down towards the middle as there's too much fat spent on long interview sequences with the hostages awkwardly edited into action sequences. I understand why these clips are placed there, but they are not well executed like the heist parts themselves. Spike Lee could have trimmed Inside Man down to have a more focused vision.\n\nDenzel Washington is gripping as he desperately tries to negotiate with the bank robbers to save the lives of numerous hostages. Washington delivers a killer performance of gravitas and wisdom. His character is always catching up even when a step behind. Clive Owen makes for an intimidating bank robber as he brilliantly pulls off an intricate heist like few other crime movies. His strong leadership and undeniable presence makes Inside Man all the more unpredictable in nature as anything can happen with a precise criminal in charge.\n\nI really enjoy Jodie Foster's performance as the tough and resourceful mercenary brought in to help mediate between the bank robbers and the police. She's quick-witted and intelligent as Foster gives a steadfast performance as the manipulative and graceful fixer. I just wish Spike Lee would have used her in more of the film. She's introduced early on, has a few scenes in the middle, then is only there again for the second to last scene. What a waste of a genius actress.\n\nI like Willem Dafoe's police chief, but he only gets a few choice lines and interesting moments. Dafoe should have been given more to do, especially since Chiwetel Ejiofor is fun, but also gets nothing to do. Dafoe and Ejiofor are outshined by Denzel in every scene. Washington is just more magnetic and commanding of a force. Lastly, Spike Lee completely wasted Christopher Plummer, who does a great job seeing as he's given only a few lines, but he could have been a more present figure. He's there to meddle, but he is never overbearing or mysterious truly. The reveal about his character should have prompted a bigger reaction, but everyone is fairly unconcerned or unbothered by such a shocking revelation.\n\nFinally, Terence Blanchard's jazz score is excellent as per usual from Blanchard. I hear echoes of melodies he would later use for BlacKKKlansman with Spike Lee already. Blanchard's jazz has style, class, and energy. I'm glad he composed a fantastic score for Inside Man to up the ante of every scene's suspense.\n\nIn short, Spike Lee did a commendable job directing Inside Man, but it's not his best movie. Malcolm X and Do the Right Thing are far more inspired films compared to the above average thriller Inside Man.",
            "review_date": "2019-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good as it gets when it comes to bank robbery movies.",
            "review_date": "2019-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a little flat in places. It's not as good as The Town. But I was satisfied. ",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few sparkling moments joined by cornball dialogue. A brilliant premise failed by distracting camera work that offers nothing to the scene. And WOW the image this paints of women overall: scheming or stupid or whores. Once again, Spike Lee plays the race card so un-subtly, it loses its impact. Lee just never addresses race relations with depth or detail -- in this film the racial missteps by characters could be replaced with them barfing.",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart crime movie that has pretty good plot. Ya their is are tiny plot hole here and there, but most of them can be overlooked. If your a fan of bank heist movies then this a movie for you.",
            "review_date": "2019-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this movie. ",
            "review_date": "2019-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Flawless. One of the Best heist of all time beside the Thomas Crown's affair 1999.",
            "review_date": "2019-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is not your standard cops and robbers movie. It so much smarter, original, and vastly more complex. It's a brilliant thriller and crime drama that takes the usually formula in ways you'd never expect. It's a fascinating battle of wills. And it even brings some moral depth along the way.\n\nTo say that Inside Man has a twisting plot would be a vast understatement. This is the kind of movie where absolutely nothing is as it seems, no-one can be trusted, and everything you think you know is probably wrong. Not only is the bad guy's plan complex beyond belief, but there are so many players with their own, often inscrutable agendas. This movie keeps you- and most of its characters- guessing almost till the end. The whole thing is brilliant and confounding on the level of The Usual Suspects, although with a less ambiguous ending.\n\nAnd what an ending it is. It's the kind of blow you away twist that you'll never see coming, but that will instantly make sense and cast the entire story so far in a new light. And amazingly, the movie doesn't stop there, but takes the time to wrap up every dangling plot thread and provide full closure. Normally this would feel like the film had missed its exit cue, but here it works, and brings the film to an even more satisfying conclusion.\n\nAs Dalton Russel, Clive Owen is a criminal mastermind on the level of Kaiser Soze. When he says he planned the perfect heist, he is not exaggerating one bit. He has every detail planned out, and every possibility covered. At every step of the way he's ahead of the cops. And by the end, when you begin to understand his full motives, you want him to get away with it. Despite having his face covered in most of his scenes, he radiates a keen intelligence, and the calm smugness of someone who knows he has everyone where he wants them. Which makes his occasional bursts of violence even more shocking. I would call him one of Hollywood's best villains in years, except that I'm not sure if he's really a villain.\n\nDenzel Washington is also in full form as Detective Keith Frazier. Intellectually, he may not be on the same level as Russel. But he's smart enough to know when he's being played, and to admit what he doesn't know. Which in this case is far too much for his liking. But even without a full understanding of the situation, or the game his opponent is playing, he (mostly) knows what he's doing, and usually makes the right calls. His battle of wits with Russel is absolutely fascinating; like De Niro and Pacino in Heat, only with higher stakes and less margin for error.\n\nWith his calm, steady, and often surprisingly friendly demeanor, he's quite relatable, and his attempts to figure out just what the hell is going on mirror our own. But he's at his very best in the interview/interrogation scenes. With each of the witnesses and suspects Denzel goes the full range from friendly and sympathetic to intense and accusatory, while dropping in bits of frustration, weariness, and some great jokes too. And in the end, he brings a real smoothness and swagger that I'm sure owe a fair amount to Spike Lee's direction.\n\nJodie Foster is excellent as well in role of high-powered fixer Ms. White. We don't see as much of her as we do Denzel and Owen, but in every scene, she exudes a deep confidence and intelligence, combined with a willingness to do whatever it takes to get the job done. She's effortlessly manipulative and almost charmingly coy even as she's infuriatingly smug and aloof. Yet you can't shake the feeling that she has more of a conscience than she let's on. Although she plays her cards very close to her chest, we know what she's after from the beginning. The fun is figuring out how she's going to get it, and what that means for the other players.\n\nIn addition to the great performances and excellent screenplay, Inside Man is a superbly well directed movie. Spike Lee keeps the pacing tight and the suspense almost unrelenting. There's some very effective use of flashbacks and flash forwards to mix things up and better process what we've seen so far. Every scene is perfectly lit and composed, unless it's supposed to be obscured and grainy. While this isn't exactly an action movie per se, there are some very good action sequences and impressive pyrotechnics towards the end. And because this is a Spike Lee joint, there's a good amount of New York flavor despite the confined setting, and even hints of the city's racial tensions and civil liberties issues.\n\nIf there's any flaw or shortcoming to this movie, I'm at a loss for what it would be. Even the opening and closing credits are brilliant in their own offbeat way. Inside Man is tense, edge of your seat excitement from beginning to end, and far smarter than your average thriller.\n",
            "review_date": "2019-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best bank heist thriller I have come across, its focus on solid plot, many twists, fast pace, and smart humor makes it an entertaining watch. The superb casting and their performances only add to the charms of the movie.",
            "review_date": "2019-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorate movies . One scene pulls away from the tension of yhr film being the scene about the foreign language and decifering that but other than that astounding movie",
            "review_date": "2019-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was as professional as you would expect from that great cast. What I missed were characters and a solid climax. But overall a fun movie for a Saturday evening.",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movi that grabs your attention from the beginning and doesn't let it go! Clive Owen and Denzel Washington do a terrific job portraying their characters on this smart, fun and energetic bank heist movie.",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-directed, tense, and well-written by Russell Gewirtz with slick dialogue and a good story and has a great performance by Denzel Washington. Probably my favorite Spike Lee movie.",
            "review_date": "2018-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst Owen's, Foster's and Plummer's performances are strong, the script for this film creates two arrogant, unintelligent and ultimately unlikeable protagonists. Furthermore, the focus of the film feels unbalanced towards the finishing 3rd act as the shift between who the actual hero of the story is becomes diluted due to the unrequried and confusing push for Washington's sheepish character to still be the star.",
            "review_date": "2018-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "But how on earth did Clive Owen know about Plummer's dark history in this movie?",
            "review_date": "2018-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just SEen this film for the second time and am still confused by the meandering script and direction.\n\nGot the impression that most of the (good) cast were on autopilot, as was the director.\n\nIs it supposed to be a thriller, comedy or a drama? The music really didn't seem to fit the action nor the dialogue either.\n\nPlot Twist was novel but oveRall didn't enjoy it.....",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's probable most engaging direction in almost a similar narrative structure as his form continues his sense of subtle social communication in the challenging veins of the bigger event that has bitterly turned the table around the expected conventions of a heist plot with intellectually thought-out complex view, while benefitting from Washington and Owen's performances in their sly battle of wits trying to calmly figure each other out, mostly the former as the main casual engine of the film's thrills under perspective. (B+)\n\n(Full review TBD)",
            "review_date": "2018-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not particularly brilliant nor a complete waste of time, Spike Lee makes the heist genre his own with this taut thriller.",
            "review_date": "2018-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is one of those films that will glue the viewer to his/her seat throughout the whole film, and with a thrilling vibe that will keep the viewers guessing and an unpredictable twist like that, it will surely rip them from it.",
            "review_date": "2018-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee’s taut direction and cinematography along with the top notch performances of Denzel Washington and mostly Clive Owen help Inside Man to be a very intense thriller even when it’s more boring elements take over. ",
            "review_date": "2018-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clever cops and robbers caper, great actors, excellent direction by Spike Lee.",
            "review_date": "2018-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "which leave us only with the how..\n\nInside Man\n\nThe sense of urgency is kept alive throughout the course of the feature that helps the audience reach to the climax swiftly which may come off as a bit poignant, hoax and unsatisfactory too (for some viewers) but it surely is undeniably entertaining. Spike Lee's execution skills is what holds this tale with multiple characters that even though has \"seen-this-seen-that\" screenplay by Russell Gewirtz and predictable twists, still delivers. Denzel Washington and Clive Owen are convincing in their parellel roles that portrays two sides of the coin and is supported with a great cast like Christopher Plummer, Jodie Foster and Willem Dafoe. Inside Man hits hard and fast in its first act where the writing doesn't flinch on taking bold risks which keeps the viewers on the edge of the seat and even though the last act is a bit slow, one can always root for Denzel and his amusing conversations that is smartly written with other characters.",
            "review_date": "2018-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever, gripping with a good cast. A really solid thriller.",
            "review_date": "2018-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish, well paced action and suspense with a dynamic between the Denzel's character and Clive Owens character that keeps interested right through. A fun couple of hours.",
            "review_date": "2018-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing! One of the best bank robbery movies I've ever seen.",
            "review_date": "2018-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rich in dialogue, clever in its plot sequencing, and stylish in Spike Lee's urban feel, this is a unique heist movie that turns out to be more than initially thought. The back & forth exchange between Denzel's not-so-clean cop and Clive Owen's cunning thief is a stellar chess and checkers game, one that draws in audiences while still wondering what the heck is going on.",
            "review_date": "2018-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really was a perfect heist! A must watch for fans of the genre",
            "review_date": "2017-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Inside Man' is a fun bank robbery to watch.  It doesn't pretend to be something it's not, and is buoyed by the charisma of it's lead, Denzel Washington.  Spike Lee directs with nuance, and takes what could have been a clunky film and smooths out the rough edges.  It's a smart joint that should have your attention from the opening bell. Final Score: 8.1/10",
            "review_date": "2017-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SPOILER DOWN BELOW...\n\nThis movie was so lame.  The music is too hip sounding to make it sound like a thriller movie.  Don't waste your time on this ridiculous movie.  \nThe bank robbers kept threatening to kill anyone who disobeyed but they never shot anyone even those who disobeyed.  Why did Denzel play bad cop to all the hostages back at the precinct?! It was soooo over the top.  Jodie Foster's relationship with bank owner during their encounter was ridiculous as well.  \"The nuclear code numbers\" blah blah.  He's an owner of a bank not the Kim Jung-Un or whatever.  Why are they hassling the Sikh guy as well?! \nThe hostage who is like \"if they want to shoot me for taking off my mask then go on ahead\" then he starts yelling.  The hostage with the hearing aids can still hear even though his hearing aids aren't in his ears anymore? Why aren't the cops killing the three bank robbers who came out for the pizza? \nThis movie is the worst.  This is not a \"smart\" genre film as much as it was a complete waste of time.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is brimming with suspense and will definitely keep your interest the whole way through. It's intelligent, deep and unpredictable. Worth seeing.",
            "review_date": "2017-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Catchy heist movie by Spike Lee. Nice performance of Denzel Washington too.",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant with Denzel truly representin' and Clive cute and clever as usual...an Underrated Joint Film. I also adore",
            "review_date": "2017-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the second time I watch this movie.  The best robbery movie at all time...",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sure hit heist classic",
            "review_date": "2017-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What's the meaning of inside man? Who's inside the game....... seems to be the criticism to the wealth, while the candle stand implies the most iconic moment in the movie.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, but a little slow and odd at times.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had the feeling of a brian grazer production...perhaps would have ben better with Ron Howard taking the wheel...",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining heist movie with some good plot twists. Denzel Washington carries this film from start to finish with a good supporting cast as well. Clive Owen, Jodie Foster, William Dafoe, Christopher Plummer, and Chiwetel Ejiofor are all good as well. This is a good addition to the bank robbing genre. Good job Spike Lee.",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here's a film that rates just a little bit lower every time I see it.  In many ways it's a decent genre exercise.  A clear work-for-hire for Lee, but he clearly takes the assignment seriously and adds a lot of interesting touches to what could be generic fodder, and attracts a fine cast in the process.  What he can't really fix though is a screenplay that needed more work.  It has a good set up and at least one decent twist, but it drags it's feet during the middle hour and introduces entire characters (Jodie Foster) that are nothing but pointless red herrings.  In the end, I can't buy a critical plot point that without spoiling anything, involves my needing to believe that Christopher Plummer is at least 20 years older than he clearly is, and would still be the active chairman of a major bank even if he was.",
            "review_date": "2016-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clive Owen carries this smart heist thriller as best he can, but Inside Man is overall a forgettable experience.",
            "review_date": "2016-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is so rare a thing; to see one of those 'bank-robbing' movies and leave so satisfied with every aspect. Owen and Washington were destined to play their respective parts in the film and complement each other well. The plot was both engaging and unpredictable with subsequent plot twists being exciting and the outcome, unexpected. Without a doubt, this relatively unknown film is a 'diamond in the rough' of repetitive 'detective hostage mystery' films that seem to bore audiences to death.",
            "review_date": "2016-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee as always, great satisfying story with 0 mistakes, ultimate favorite",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not entirely Fresh nor Certifiable. This is a Spike-Denzel near cliche with Jodie just clinging to the vine. Almost overripe. And a tad slow in places with all the flashbacks. The end was only partially perfectly clear and should've been better. SPOILER ahead ... (close eyes quick)\n\n\n\n\n... a twist on Robin Hood.",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique storyline, great cast, a film that delivers.",
            "review_date": "2016-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half was great, an above average bank robbery movie with a great tone, some great cinematography, and even some laughs! Then the second half is not as good, losing everything good about the first half somehow. It was lost to the point that the second half felt like a different movie. Jodie Foster's whole storyline, and the bank robbers involvement, sucks. That should have been taken out, especially since the movie is too long. But, Denzel Washington, Chiwetel Ejiofor, and Willem Dafoe give outstanding performances throughout, which did help to elevate the bad stuff a little bit. But the ending is good. I think the movie's biggest problem is the writing, but the directing is a flaw too because it's at fault for not helping fix the writing to make the movie better.",
            "review_date": "2016-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fantastic movie with a killer cast. A Spike Lee joint that is sure to satisfy, you are hooked from the beginning to the end. Pay attention to details as even the smallest conversation is important.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is a very well directed bank robbery film by Spike Lee. I was engaged the whole time, and Clive Owen, Denzel Washington, and Chiwetel Ejiofor all were great, as well as Willem Dafoe and Jodie Foster. Filled with interesting subplots and great dialogue, Inside Man is a bank heist film done right",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely heist film.  Spike Lee at his best",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twists. And more twists. No arc to the story though.",
            "review_date": "2016-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A review coming soon...maybe in the 3rd act. Wait for it, wait for it...",
            "review_date": "2016-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary movie. Did you say cliché? That's what they thought. \"M. White: \"Off the record?\" K. Frazier: \"Off the... \" Everything about you is off the record. Just talk to me.\"",
            "review_date": "2016-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This script, pace and direction is excellent. The dialogue  is has such great swings from drama to straight comedy  so we'll transitioned. Denzel plays his part flamboyantly yet clever and almost heroic. fosters fixer is a great addition to the flow of the film.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid bank robbery movie with a well selected cast.  However, it left so many unresolved questions by the end, and unanswered motivations I would have preferred to see explained.  And for being a perfectly planned heist plan, they failed to realize that a single police dog would have blown the entire plot.",
            "review_date": "2016-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.0 stars.  I really enjoyed this movie.  I think it's Spike Lee's best.  Good acting all around, which is to be expected from actors like Denzel, Clive and Jodie to name a few.  I like how they cut between the heist and the interrogations.  I would recommend this one, especially if you dig bank heist movies.",
            "review_date": "2016-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever and original heist movie that just goes to show how under appreciated Clive Owen is. Entertaining from start to finish.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee directs this crime thriller about a bank heist. Again, Lee's pacing is an issue as the second half bogs down slower than grandmother's caddy.",
            "review_date": "2016-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought this was pretty great. I hope there is a sequel. What's with the Indian music at there beginning and end...just weird!?",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amusing in its own way, but I didn't understand it.",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining film, but nothing that will blow your socks off. The intrigue is there, and the movie entertains, but not something I'd watch again.",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fine Denzel movie. It ends up being a good heist movie with a great cast. There are some funny/great lines too. However, I take issue with the motivations of Clive Owen's character (Dalton Russell). He wants to stick it to this banker who has some skeletons in his closet, despite the banker guy trying to do good things in the world to make up for his past. What's the point of condemning a man who wants to make up for his mistakes? Fair or not, that thinking conflicts with my own morals, and as such, I shall think of the movie as just \"good\" instead of \"phenomenal\".",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its interesting promise turned out to be a story that is nothing new or special, but it benefits greatly from the performances of Denzel Washington and Clive Owen, even when the story ultimately wastes the talents of Christopher Plummer and Jodie Foster.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Inside Man\" tries to be far more intelligent than it actually is and it's attempts to push some agendas are glaringly obvious and short-sighted. To me, this is another mediocre offering in the police procedural and heist thriller genre, but, unlike other genre films of the same caliber, I didn't even find this one to be temporarily engaging.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a real treat.",
            "review_date": "2016-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In an unusual turn for Spike Lee, \"Inside Man\" is a crafty and engrossing heist film.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel played an excellent  Detective. Clive played a good role right beside him. A clever bank heist. Fun to watch and very well executed and engaging.",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nothing movie, boring, trying to be a witty English like crime thriller but it isn't, I wish I could get back the lost time I spent on this crap",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the life of me, I couldn't figure out how Clive Owen successfully robbed the bank.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Little Caper Film...",
            "review_date": "2015-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting down to the end",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Inside Man\" is not a story that I would expect to be told by Spike Lee.  He steps away from his typical racial themes to give us a lesson in deception.  This unique crime thriller intersperses police interviews with flashbacks of the bank robbery in question.  At first, the out of context interviews do not make much sense.  As the story progresses, the flashbacks give meaning to the interviews until the end reveals that... all of our assumptions were wrong!  The film alludes to (and even directly shows) how these criminals will pull off this heist, but you will still be completely shocked in the end.  You have to love a story that successfully turns the bank robbers into heroes and the cops into bad guys.  The intentionally convoluted story is supported by big-name actors who all live up to their reputations.  Clive Owen is truly terrifying as the criminal mastermind, Denzel Washington balances his heroic moments and his situational failures, Jodie Foster successfully contrasts Washington's straight-laced character with her shifty, sly role, Christopher Plummer provides the intrigue that makes us wonder what could be in his safe deposit box, and Willem Dafoe does exactly what you'd expect him to do in a gruff cop role.  The film makes for a great rewatch.  It has \"The Sixth Sense\" syndrome, where the twist blows your mind the first time but the film becomes a new experience with each subsequent watch as you catch more clues that you never realized were there.  \"Inside Man\" has some violence and swearing, but it is pretty tame for an R-rated film and worth watching for its complex story and rewarding twist.",
            "review_date": "2015-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Heist Thrillers I've ever seen its amazing and well done with thrills and twisted that will have you on the edge of your seat and its one of Spike Lee's best films. \"Two Thumbs Way Up\"",
            "review_date": "2015-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was one of those complicated stories making sense at the end.",
            "review_date": "2015-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Lee's on the top of his game he's terrific and add Washington and Owens and you've really got something.",
            "review_date": "2015-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just rewatched this and, man, I do love a good bank heist movie. This one by Spike Lee definitely qualifies; it is thoroughly entertaining.",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart & snappy elaboration.",
            "review_date": "2015-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic heist movie!",
            "review_date": "2015-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thoroughly enjoyed this thriller movie.\n\nThe movie is about a witty man who carries out \"the perfect robbery\" & how a brilliant hostage negotiator tries to catch the robbers and get everyone out safely.\n\nIt's set in one of America's most famous & historic banks. While the robbers are inside carrying out the robbery, the police patiently wait outside the bank for their ideal time to strike &take out the robbers & save the hostages.\n\nThe movie is performed with such finesse. The movie flows, keeps the viewer wondering and yet at the end there was no violence & nobody was killed. The movie seems very well scripted. \n\nThe movie has what seems to be unnecessary flash forwards to the hostage negotiator interviewing everyone from the bank to find out who exactly is responsible because nobody was caught.",
            "review_date": "2015-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great crime thriller with a great cast. Keeps you guessing till the very end.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#72\nIn Inside Man, his first major screenplay, Russell Gewirtz has approached the classic heist screenplay by employing several novel variations on the genre. In addition to riffing on tropes within the heist genre, he utilizes a brazen theatricality in the modus operandi of the crew pulling off the job. The elegance of this device is not fully revealed to the viewer until the end of the story. Truly, some of the intricately layered trickery by Gewirtz can only be fully appreciated through consequent viewings. The effect of this gives the viewer not only a front row seat to an intricate chess match between the characters of Detective Keith Frazier and our protagonist and mastermind, Dalton Russell; it also allows us just enough information to pique our interest without giving much away in terms of payoff. (Gewirtz)\n\tIn Save the Cat! The Last Book on Screenwriting You'll Ever Need, Blake Snyder dedicates a section of his book to defining not just genre types but also a deeper understanding of stories. At first blush, it may seem that Inside Man fulfills your run-of-the-mill Golden Fleece story. Snyder believes that, \"the theme of every Golden Fleece movie is inner growth\". (Snyder 27) Despite this, we are given a fully formed and completely capable protagonist in Dalton Russell. \n\tFrom the opening image we are face-to-face with Dalton Russell, delivering a very cryptic and collusive speech directly to the camera. In Spike Lee's audio commentary, the director points out the use of his signature double-dolly camera rig to push perspective and focus onto the brick wall while maintaining audience attention on the information being dictated by the static Dalton Russell moving towards the wall. (Lee, Inside Man) In the big, third act reveal scene, we are given a repeat of this opening speech with the same camera move in reverse. The effect of the speechifying Dalton Russell telling us his exact plan gains new significance as we witness him behind the wall during his week of confinement. \n\tI appreciated the Easter eggs that both Gewirtz and Lee sprinkled throughout the film and the screenplay. Gewirtz included multiple references to other films in the heist genre, including Dog Day Afternoon. Not to be outdone, Spike Lee followed that nod by casting two actors from Dog Day Afternoon.  During the pizza delivery/ bugging scene we get a double dose of nostalgia when the character delivering the pizzas is revealed as the same actor who delivered pizzas to Al Pacino in the aforementioned movie. (Lumet) On top of that, we are given a visual nod to one of Spike Lee's most critically acclaimed films as the pizzas delivered are from Sal's, the fictional pizzeria from Do the Right Thing. (Lee, Do the Right Thing - 20th Anniversary Edition)\n\tAside from the phenomenal acting job done by the cast, I feel the combination of talents; Spike Lee, Russell Gewirtz, Brian Grazer and the great casting job done by Kim Coleman served the screenplay very well. Not only was it well executed on the screen, it was also a fascinating read. It revealed just enough in the opening image to whet my interest while the introduction of supporting characters throughout the screenplay was handled very deftly. I've watched the film three times and my appreciation of the depth of character and intelligence given to Clive Owen through the script continue to grow. From page to screen, it's been very rewarding to see Dalton Russell brought to life, in all his mastermind glory.",
            "review_date": "2015-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just gets better and better with time. These are stars (Owen, Foster, Plummer, Washington, and Dafoe) who are at their peak, with a strong screenplay, and tight, tight direction. The story is meaningless and trivial, but from such a weak beginning comes a great act of fun, art and true entertainment. Well done.",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid heist flick.  Denzel is great as always.  This is one of Spike Lees better movies.  One of the ones where he's not as full of shit.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great adult thriller that manages to keep you guessing until the end.  Fine performances by Denzel Washington, Jodie Foster, Clive Owen, and of course Christopher Plummer.  Kudos to Spike Lee for going outside his genre and succeeding.",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really great cops & robbers movie with a moral twist and some great cinematography!",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exceptional heist flick. Spike Lee does it again. The script and the acting are perfect! For once a robbery movie that concentrates on intellect rather than violence. Three cheers for all!",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel is the goat. Good movie keeps you \"double thinking\"",
            "review_date": "2015-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best hostage & holdup movie.",
            "review_date": "2015-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an interesting way for a movie to go. There's a lot of respect between the characters. The beginning and end of the movie has really out-of-place Punjabi music though, which was extremely strange because I don't think anyone in the movie was Indian.",
            "review_date": "2015-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, not just your particular bank robbery, just very intriguing.",
            "review_date": "2015-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most Spike Lee movies are garbage and jaded, but this one is a masterpiece. The thinking, the acting, the plot are all top notch. One of the best heist films you will come across.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good plot & good way to end the movie",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite movies of all time! Great bank robbery with a twist. Spike, Denzel, Clive, kill!",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Spike Lee film in years but that's not saying much. The film is flawed, long and the ending is just plain stupid.",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really intelligent action thriller.  Great cast with solid performances all around and very good direction from Spike Lee.",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a solid movie",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty clever movie.  I didn't expect such a clever plot, frankly, in an American movie.  Good performances from master practitioners.  Loved it.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's starts off with bad music that doesn't fit the film and continues all the way through. The film is so cheesy with a bad script and questionable acting. Only made it half way through before turning it off.",
            "review_date": "2015-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The term \"anything but formula\" is what makes this movie the potential for great. What hamstrings this movie at times, though, is forcing you to follow along in places that they haven't done enough prep work to have you understand it.  Washington and Owen are fantastic in their roles, and Ojafor is fantastically understated in his performance, but many times, they have to overcome the complexity of the story to keep you involved.  They also finish the movie knowing the ultimate ending, but clunkily getting to it.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty average,too long bit boring at times and by the end of the film you feel the same way.but the cast was pretty good Clive Owen and denzil Washington can't go wrong lol",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a well constructed heist movie. The actors all play their characters well, and the creativity of the whole film was very impressive.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Denzel Washington paired with Clive Owen is a double-shot of fine acting. Not your typical bank robbery story; but one planned to the last detail. I had forgotten how much I enjoyed this film until I watched it again the other day.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again Denzel Washington plays the badass role, but he's overshadowed by Clive Owen's awesome performance as a bank robber who is both smart and calculating.  \"Inside Man\" is an intelligent, heist thriller that will keep you guessing and engage until the very end.  The wit and self-reference will entertain you.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an entertaining heist movie.... all the casts did an amazing job.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, great cast, and for a film that is confined to a small area surrounding a bank it dosen't ever bore.  It gets right to the point, mabey too quickly, and in doing so soils the rest of the film.  So that was the films biggest downfall, it spoiled itself in the first few minutes, and throughout the movie it keeps on doing it so we know at the end that Dalton gets away with the money.  It's a very physiological film, a mind game between a genius bank robber who has literally thought of everything and a detective.  That fact that Dalton takes hostages and knows exactly how to use them to his advantage always has you knowing that their lives are very much on the line.  The film keeps a steady pace, not racing ahead but at the same time not taking it too slowly.  It isn't an action packed crime film, but focuses from begining to end on the successful robbery of a single major bank.  The acting is great, Denzel Washington is one of my favorite actors and its no exception here.   Jodi Foster is very good also, as is the likeable badass criminal Clive Owen.  It has a great ending, finally one that doesn't end heroically happily ever after and we saved the day.  It's nice to see and does it in a believable way more or less.  The plot twist about what the robbers were really after was interesting, and didn't turn out to be the bad decision I thought it would be.  So ya it's a great movie, great acting and plot, complicated yet simple, and dosen't need to be full of action and shooting, which happens only once.",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, great ending and what a ride!",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great... from beginning to end.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie love the twist",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loses one entire star for the lame color corrected lighting.    I hate the fact the entire movie is set in hues of green. It is annoying at best.",
            "review_date": "2014-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is a heist film that makes the mistake of trying to be more than a heist film. Clive Owen makes a compelling criminal mastermind, and Denzel Washington is always great as a lead detective. You can easily see these two as formidable adversaries who are desperately trying to outthink one another. I loved how they intercut the interviews with the hostages in the aftermath of the crime with the events of the crime itself. It gave you some insight into how brilliant the crooks' plan was, and at the same time kept you guessing how it all ended. I do enjoy a good surprise ending as well, and I think this one would have been satisfying as well if it hadn't been spoiled for me in advance. Even knowing the twist of how they pulled off the heist, I think the movie could have held up. But, as I was saying, they made a critical mistake by trying to make this more than just a high-quality heist movie.\n\nThey throw in this entire storyline about the owner of the bank, and his desire to resolve the situation without letting his own secrets out. It's a pointless plot that seriously gets in the way of the film. Christopher Plummer is a brilliant actor, but he is so unnecessary to the plot of this movie. Then he hires a specialist played by Jodie Foster in one of the worst acting performances I've ever seen from a quality actress. Every time she comes on the screen the movie just stops in order to meander for awhile before getting back to the movie. Even worse is the fact that she, despite some big talk, proves herself to be absolutely terrible at what she does. Clive Owen is more in control of the situation than she is, and he's the crook! Then, of course, since Spike Lee is directing we have to make a point of throwing in some race relations. Sure it's a bank heist, but that doesn't mean we can't stop everything to watch the white cops jumping to racial stereotypes. If they had stuck with a pure bank heist film I think this could have been remarkable, but because they wasted half the movie I will never recommend Inside Man to anyone. They even diminished the twist ending by drowning it out with all these subplots wrapped up around it. Some focus and direction would have been nice.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie. The script was mediocre at times. However, the exceptional cast max out the dialogue. Spike Lee seemed to be having fun making this one as it's full of little quirks and tricks, but it works. They add to the story and I liked them.",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is a directorial achievement, featuring a cast of magnificent smooth-tongued actors and one of the best thought out crimes ever put to film.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought the story was well written. Didn't blow my mind, but it definitely came together well.\n\nA few blemishes. That Malcolm X shot (Denzel looks like he's speeding on a segway with people running behind him) was severely out of place. There is a shot with Clive Owen in the vault and it kind of jump cuts back and that was very awkward. There was some really awkward sound moments (aforementioned scene had loud choir ahhhhh ahhhh ahhhhh! music behind it when nothing was happening), another scene with farty trumpets. \n\nWillem Dafoe was featured too much for having such little of a role. And Denzel's partner is borderline retarded. Understand that the point was to make Denzel seem smarter, but make Denzel seem smarter, not just by comparing him to dimwitted detective. \n\nBut some of the other cinematography was very good. Good use of bird's eye view when Jodie Foster entered the bank. Enjoyed the over exposure when detectives talked to witnesses. Lot of good things going on in this movie.",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is a thoroughly enjoyable and thrilling movie with good all round performances that's well written and boasts of a screenplay that holds your attention for the complete 130 minutes. The whole ensemble is simply brilliant and the way the tension is built throughout along with the jump in time frames is put together really well. Its a well thought out movie that deserves your time and attention.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While there are a few loose ends in the script and a few improbable scenarios, Inside Man is an entertaining and captivating thriller that is boosted by fantastic performances and tension filled action and amazing direction by Spike Lee.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A new energic thriller from Spike Lee. It deals about a touching theme like racism meanwhile a bank robber is a step ahead of the police. Probably it could be shorter but it is so interesting , sometimes funny , and energizing that you could forget this small problem.",
            "review_date": "2014-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This promising material comes off surprisingly sloppy and underplayed.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thriller that turned into a comedy with smart ass dialogue and profanity which makes this film not to take seriouslly. It's dumb.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Spike Lee's films are usually over the top boring and racist this one was well written and directed beautifully. It does have clunky plot point where you question the believability of the plot but it was fun to watch.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day: Wednesday\nDate: 26 Mar 2014\nTime: 9.30 pm\nWith: Maa \nOn: Netflix",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Spike Lee, who started off making personal films about prejudice and race in America such as Do the Right Thing (1989), Jungle Fever (1991) and Malcolm X (1992). By the new millennium, he found it harder to get his brand of films made, but he got a hit when he decided to do this heist film written by Russell Gewirtz (Righteous Kill (2008)). It's a good thriller, but it requires attention. It begins when a group of workers dressed like painters walk into a bank in Manhattan, and take the customers and employees hostage. It's not long before the police get involved, and Detectives Keith Frazier (Denzel Washington) and Bill Mitchell (Chiwitel Ejiofor) take charge with the negotiations, meanwhile the bank's founder Arthur Case (Christopher Plummer) asks his fixer Madeleine White (Jodie Foster) to ensure the safety of the contents of a safe deposit box in the safe of the bank. The leader of the robbers, Dalton Russell (Clive Owen) has a much more bigger plan in mind, which he believes is the perfect robbery. It does feel a bit like Dog Day Afternoon (1975) at first, but there's a lot more to this film, and nothing is what it seems, and the pay-off, although it takes a while to get it, it well worth it. Lee has assembled a good cast, and he even plays around the the look and feel of the film as it unfolds.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie with some good performance from Washington and Foster...The heist is smooth, the flashback interviews are creative, and the underlying message is good. \nIt's a sort of unpredictable movie for once.",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good thriller. Leaves you wondering till the endâ¦ and you're still not completely sure of the true motive for such a grandiose heist. The highly intelligent mastermind has morals. Jodie Foster's character is a simple distraction which complicates the story.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An original hostage genre, though a I found my interest was lost a few times.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fairly clever, but it's all over the place with respect to tone and humour.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't as great as I've heard about this film. Slow in places but yet keeps you watching. Robbers were always one step ahead.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not as smart as it wants to be. At the end, I was disappointed.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances by Washington and Owen, a taut thriller from Spike.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love heist movies, and this is one of the best ones out there.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee is known for his tonal shifts, but Inside Man brings such great thrills and intelligence to a seemingly familiar subgenre of heist films",
            "review_date": "2014-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to watch it again!",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally overrated with a disappointing ending.",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well thought bank robbery",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee has just made one of his most entertaining & mainstream film with this high class thriller about Banks robbers. Great heist, great cast, amazing story. Two thumbs up for this great entertainment.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my more favorite heist movies, with an excellent performance by Clive Owen and a nicely layered script that gives away nothing until the very end.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a stellar screenplay and strong vision, Inside Man presents a fine entry into the volume of heist films. Director Spike Lee is able to keep viewers in the dark just as long as our protagonist is, ratcheting up the tension as the hours go by. Denzel Washington delivers yet another strong leading role, as the voice of reason in a crazy situation, while Jodie Foster and Clive Owen play their roles in the whole shebang quite well. The soft ending may not deliver the immediate satisfaction of a gotcha moment a la Ocean's Eleven or The Italian Job, but the intellect of the story itself eliminates the need for one. This is not the joint you'd expect from Lee, but a welcome one nonetheless, and his choice of projects in the future will be scrutinized to see if he will continue down this more mainstream path.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I always loved Spike Lee; and his heist movie, Inside Man, has a twist, which makes it unique among other heist movies. That's why I enjoyed it. Spike Lee is still a master of his workmanship; and Denzel Washington is still great at what he does.",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I always loved Spike Lee; and his heist movie, Inside Man, has a twist, which makes it unique among other heist movies. That's why I enjoyed it. Spike Lee is still a master of his workmanship; and Denzel Washington is still great at what he does.",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very smooth and cool movie that is well scripted and thought out.  The stars move through the situation with expert diction and presence making this a must see film.  Photography is at the places that you want it to be making this a visual delight.  The music is as humorous as some of the antics in the acts.  Nibbles: Belgian Full cream chocolates and Champagne.",
            "review_date": "2013-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nobody captures NYC like Spike Lee. Love his films. This is a really fun bank heist movie. Drags a little in the 3rd act, but a satisfying ending.",
            "review_date": "2013-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manages to stay interesting despite being mainly filmed in a bank with a few plot twists nobody could guess!",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie's only real flaw is the beginning. The first 20-30 minutes are fun in that \"typical action movie\" kind of way. This is when I started making predictions on where the story was going, and how it was going to end. Man was I wrong! This movie transformed into something awesome. The beginning felt disjointed, but when all the different characters started to meet each other and their storylines merged, what we get is a great drama with great acting, a well written script, and directing that pulls everything together. Even the music transforms from \"typical action movie\" music to a more jazzy film noir type music. Only points taken off are for the beginning feeling like a completely different movie. It felt like it didn't belong. \n8.2 out of 10",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had my attention! Was not bored for a second throughout the whole movie!",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really cool thriller, definitely see it! Clive Owen, Jodie Foster, and Denzel all have great chemistry together; excellent script and casting.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this in 2006, takes a lot away from the twist, because over the years, I've seen countless twists that could put M. Night Shamalamadingdong to shame. However, taking the movie into context, this is actually a very good and smart movie. At times it does tend to confuse you, but only for a minute. A very intelligent heist film that is made better by great performances by Washington and Owen. I read somewhere that Clive had problems at first, trying to portray the character through a mask, but I think he nailed all of his scenes, with a subtle yet intimidating menace. Jodie Foster was good in it, though it wasn't exactly a role that could only have been played by her. All in all, a very nice movie that will keep you thinking, with a nice little finish at the end. Take some time out of your week to watch this. 8/10",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie. It has great actors, a great plot, and overall its an action-packed film that's very engaging and very great.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film with a twist",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the first glimpse of the Inside Man looks like a repeated random heist, soon it takes you to a world of questions and discovery's. The movie is not only supported by a great story that you need to watch until the end to understand, but it also tells the \"ugly\" truth that everyone experiences in its own way. I wanted to know everything about the subject that was meant to be unknown. Inside Man delivers the truth by telling lies",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another wicked flick, good twists and turns, power full acting as always from Denzel. jodie and Clive not to mention an action/Drama flick with spices from spike Lee to make it a great watch",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense and thought provoking bank heist film that goes beyond the regular deliverance expected from heist films and continuously inserts clever ideas and twists into the story to keep you thinking until the end.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Jodie Foster scenes may be a little bit boring, the chemistry between Washington and Owen is amazing . Inside Man is an amazing heist thriller, never predictable in every scene and also amazingly written and acted.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever, intriguing, thrilling, thoroughly well directed. Inside Man is one of those few films that you'd beg not to end.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie! I especially love Spike Lee's signature directorial work.",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that deserves more respect than it gets.  To many, Inside Man has now become a forgotten movie but it does not deserve this treatment.  Some music choices and technical aspects bug me but that doesn't take away from the story that is presented.  A good crime movie that lets you root for both the good guys and the bad guys.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly thought this was a terrible movie. I did think that the directing was probably the best thing this movie had going for it. However, the entire movie is severely crippled by an illogical and unoriginal script with horrible dialogue and characters that are borderline impossible to care about. Nothing feels resolved in the ending, it just fizzles out. I honestly would have been more interested in seeing what this movie would have been like if Spike Lee wrote it instead of Russell Gewirtz.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice couple of twists at the end of this slightly above average heist yarn.",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A neat and classy heist without any guns blazing, shrieks all around or fancy cars driving in all corners. A very well made narrative and smart screen play does the trick. Denzel Washington, Jodie Foster and Clive owen enact flawlessly and make perfect use of the screen space. Absolutely fantastic movie and a treat to watch",
            "review_date": "2013-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever, intriguing, brilliant....\n5 Morgan Freemans",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "86%\nSaw this on 6/06/2013\nThey used the hit Indian song 'Chaiya Chaiya' from Dil Se(1997) in both the opening and closing credits, which was quite surprising really. Inside man is nothing new, but it is clever enough to stick apart from the generic stuff. The heist films does not have anything new to say mostly, they are just mostly done for financial benefits. I have liked only two heist films really well, The Rock(1996) and Speed(1994). These films were different in motive and prospect. Apart from them, I have found much interest in John Q(2002)which shows you the humane side of a hijacker and the reason behind his actions without reducing the character to a stereo type.\n\nWhen it comes to Inside Man, the film is mostly benefited by good performances from Clive Owen, Denzel Washington and Jodie Foster. The supporting characters don't really support well. This doesn't have a swift pace or the sort of revelation and outlook on good and bad as the critics say it to be. Just like the similar movies, it has a leading cop kept under the lens for money related events that took place in the past, a leading robber who alone talks much and who barks the orders and a fixer played by foster. Anyway, the way by which the robbers escape, the way they use the hostages for their escape and all are new, also is the concept of Inside Man.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Spike Lee film",
            "review_date": "2013-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not bad, too much language though.",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Inside Man\" is a clever heist film directed by Spike Lee, its full of surprises and is pretty satisfying.\n\nHis name is Dalton Russell (Clive Owen). Pay strict attention to what he says because he chooses his words carefully and he never repeats himself. I've told you his name, that's the \"who\". The \"what\" is a plan to execute the \"perfect bank robbery\". Why? Because he can and the only thing that can stop him is an ambitious hostage negotiator (Denzel Washington).\n\nThe script keeps you interested the whole time, it starts with a great opening scene that captivates your attention and just keeps the movie flowing right until the end. Clive Owen is brilliant as the mysterious bank robber and the pairing of Denzel Washington and Chiwetel Ejiofor as two buddy cops is hilarious (specially in the scene when they're interrogating a witness and can't stop staring at her boobs).\n\nIt has the multiculturalism of new york handled to its advantage, and like \"Rashomon\" it takes us from different points of view letting us choose what side of the story we're on. It has great twists in it and I love that it keeps it simple and never gets out of control.\n\nIts a crowd pleaser (which is strange being directed by Spike Lee) that will have you singing \"Chaiyya Chaiyya\" by the time it ends.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is all  Denzel Washington, Jodie Foster has only a bit part with a major character. It's really about the primary detective matching wits with the head bank rober.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good intelligent plot. Denzel is class as usual. Dalton the robber is switched on with a moral side as seen with the lil boy. Good always triumphs in the end though. Denzel films are always a very good watch",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic use of angles and shots by Spike Lee displaying NYC. Tight angled city block is the perfect setting for the action platform. Action inside the bank is constant on edge. Clive Owen is straight forward, and is convincing at his role. Police-'hostage' interviews were an intriguing idea but were not perfectly executed due to script flaws and imperfect acting. It's nice to see Lee hasn't lost the use of race related situations no matter the screenplay or the seriousness of the matter. The construction worker Kevin is played by talentless, over reaching and bravado oozing Al Palagonia who plays minor roles in most of Lee's films. Although he is a minor character I despise every time he shows up in his movies, especially knowing he gets the screen time for giving personal favors (Apollo Private Jets). Russel Gewirtz's script is picaresque on a scene to scene action basis but lacks any real meaning. The montage of possible outcomes when the police were planning on entering the bank was quite imaginative. The whole premise of the film relies on the final twist which is hardly a twist at all. The very ending is the most clever surprise that was in store and was actually a fortunate way to finalize the film The movie tries to be more then an action film but comes up short.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic action movie!!! and just love the actors!!!!",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "somewhat engaging through the first half but fell weak the second. lots of unnecessary spike-lee style details...",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant film one of my favourites",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good, so twisty and great acting",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a solid heist movie. Although it was made for political purposes, it was still enjoyable and highly suspenseful with twists and turns that satisfy in the end. It's smart.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, will keep you thinking right to the end!",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee hadn't made a decent movie, sorry, \"joint\" in a while, so he was due.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of what appears to be painters enters a New York City Bank, and lock the doors. One of them then disables the security cameras with a flashlight equipped with an infrared light. \r\n\r\nThey then reveal high-powered weapons, and ordering everybody on the ground. When they secure the place, they order all the adult hostages to strip down to their underwear, and put on clothing identical to their own. The strange thing is, they aren't interested in the vault. \r\n\r\nTwo NYPD detectives are assigned to the case, and head to the scene to negotiate with the robbers/hostage takers. One of the detectives, played by Denzel Washington, believes that there is a lot more to the story than the villains are telling the authorities through released hostages. \r\n\r\nThe bank's president (Christopher Plumber) has a secret in the bank that the hostage situation is taking place in, and to keep it secret he hires an independent negotiator (Jodie Foster) to go into the bank and put his secret into her hands to bring it out and away from the NYPD. \r\n\r\nThere are some real strong performances in this movie. Washington is believable in his role as a police detective/hostage negotiator. Foster, who is not in the movie that much actually, also puts forth a strong performance. In fact, the entire cast is good. \r\n\r\nThe script was strong, and interesting, although I think there may have been some plot holes. The flashback and interrogation scenes helped advance the story nicely. \r\n\r\nThe soundtrack was pretty unique. To me, many of the songs appeared to have African influences. There were no classic tunes everybody knows, and no annoyingly catchy songs that you'll be humming for a week after seeing the movie. \r\n\r\nThere are numerous twists in this film that are spread out just enough so you will notice them. Spike Lee did a very good job with everything in the direction of this movie.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is a good strong film with pleasing performances from Denzel Washington, Clive Owen, Jodie Foster and Willem Dafoe. The plot is interesting, the twists and turns are enjoyable and overall this Spike Lee film delivers on every level. I wouldn't go out of my way to watch it again in a hurry, but I wouldn't quibble a second viewing. Definitely worth a watch.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is clever and keeps you awake all the way through the end. Each character is more likeable than the other.",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee's attempt to make something mainstream is good but unfortunately it isn't great. Is this his fault? Likely not. He has made the most of what he has and put in a thriller that would put most to shame.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A clever plot and brilliant acting throughout",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not in the same league as films like Malcolm X, Do The Right Thing and Mo' Better Blues, but it is fun. Flawed (very), but fun.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was great for something that I didn't expect to be good.",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever heist film with great plot twists and good performances all around.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even a good Spike Lee film is shit.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man is instantly fascinating from the stylistic intro thanks to a special touch by Spike Lee in one of his best films.\nInside Man features a powerful lead from Denzel Washington, as well as support from Willem Dafoe and Jodie Foster.\nThere's also a very well written screenplay and a strongly intense mood with many thrills thanks in part to the intense soundtrack and great cast, as well as a fascinating story structure and interesting vary between tones from character perspectives. It also succeeds at telling it's complex story incredibly well and fascinates the audience in several ways.\nAlong with creative use of cinematography, a great soundtrack and an immaculately fearful atmosphere, Inside Man is one of the best heist films since the 1975 Al Pacino film Dig Day Afternoon.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slick thriller feels a tad silly, but performances are convincing such as washington, who never disappoints. smart, skillful and a script to remember.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omfg amazing movie especially for being inside the bank the whoel time.. the german nazi secret shit adds to it omg and the diamond in the pocket.. well done",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chris Owen is by far the best thing about the film. Pretty paint by numbers though. Spike Lee lets everyone down.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with music that makes it even better.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DIS IS WELL GD. BETTER THAN I THOUGHT IT WUD B!",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film here. Denzel never lets me down and a surprising good performance from Clive Owen. The plot was not that complex, but it still gives you a twist at the end that makes it all worth it.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie!!! Check it out...",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "flat story, but at least spike lee makes it look good.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting. a little bit slow in some parts but the ending worths the wait, great cast, great direction by SPIKE LEE!",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spike Lee crafts an intense film that is smart fast and rewarding. With a good attention to detail on different social issues that do not disintegrate from the intense pace whatsoever. There is not a lot of depth in the characters but the other things help you forget that. A clever heist film that may not be ground-breaking but stands it own ground. A great intense thriller.",
            "review_date": "2013-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inside Man impressed me by is intelligent plot and amazing acting by the crew. Denzel and Clive stole the show. Best bank robbery movie I've ever seen.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another Spike Lee movie and it didn't disappoint. The \"Chaiyya Chaiyya Bollywood\" intro nicely sets the tone for the movie.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice movie, loved the \"respectful\" robbery :)",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense look at real life situations.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We still loved this movie although the couple behind wouldn't shut the frak up.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not interesting enough",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good good movie.  Heists are usually good.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great half way through. Had no climax. Just ended",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent job by Spike Lee and all involved in this movie.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casting Jodie Foster most surely always will make me watch any film. Her choices hardly ever are wrong. Clive Owen was fantastic. Worth seing. Plus Willem Defoe as Darius hmmm :))",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really liked this film. Clive owen really played a good villan and i was actually scared of him just from his intensist he put into his roll. It was a very smart and thrilling film.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is great movie it kept me intertained and goin !!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really good film worth going 2 see",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember seeing this movie is theaters not really expecting much, but this bank heist suspense twister really blew me away. Not only for the very talented cast but the way it was shot and explained by the main antagonist. I loved the backstory to it as well. I wont give it away but every part of it was really well done all the way through. Terrific performances from Clive Owen, Denzel, and most importantly Christopher Plummer who gives a fantastic performance as always. Shout out to Willem Dafoe as well. I can't give away any details, but it you like generally fantastic movies, this is not one to miss for sure.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very smart movie. It'll suck you in right off from the beginning.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really really enjoyed this movie.  It was a bit slow at times, but overall was really well done.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well executed heist movie. The twists in the movie makes it more worth and enjoyable. Definitely worth a watch.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good plot twists but left me gussing at the end",
            "review_date": "2012-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had everything going to be a great film, and then the ending happened.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie! The casting was superb and the acting was just as good.  An awesome twist in the end that I should have seen coming.  Clive Owen is such a great actor.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slick, witty, absorbing...As soon as it starts with the indie music, you think this is going to be interesting. Liked the storyline, there was a few humorous parts e.g. He phones the guys mobile and it plays gold digger! Was expecting more action though and slightly more hostility from the bank robbers who seemed quite subdued. Denzel washington was instantly likeable with his cool police man role, while clive owen(slightly wooden) was just about convincing. Hopefully spike lee is just doing a text book no nonsense movie...not his best but still worth looking at.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Classic Tail where Denzel is a Hostage Negotiator.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bank robbery in New York has gotten out of control, and it's up to police detective Keith Frazier (Denzel Washington) to act as hostage negotiator and get the bank personal and customers out safely before things turn even worse than they already are. This turns out to be a tough case, since the leader of the bank robbers, Dalton Russell (Clive Owen), turns out to be a very smart individual, who has everything planned to perfection, and who throws up surprise after surprise for Frazier and his men. But while the people around Frazier are slowly getting more and more nervous, he himself does not lose his mind, and begins a high stakes battle of wits with Russell. Things are further complicated, however, when the mayor of New York introduces a mysterious woman to Frazier. This woman (Jodie Foster) wants to protect something that is hidden in one of the safety deposit boxes inside the bank, and she will stop at nothing to force Frazier to let her inside the bank and make sure nothing happens to the contents.\nThis all sounds like an intriguing premise for a thriller, but the movie goes a few steps further than just having an interesting plot. Because while Inside Man does hit all the right notes when it comes to keeping you guessing about what is really going on, it is also very successful in mixing the grittier moments with comedy elements. At times, Inside Man is very funny, but in a way that does not deflate the tension. The dialogue is sharp, with the conversations between Frazier and Russell being especially fascinating, and both actors are at the top of their game in this new movie. Washington's Frazier is an intense but laconic individual, who has a permanent smirk on his face but who reads the bank robbers intentions better than anybody else, while Owen is charismatic and fascinating as the mastermind behind the bank robbery. I was a little disappointed however with Jodie Foster's role. While her part is potentially fascinating, she does not really get the chance to do anything with it other than look cool and act tough. Yes, we all know that she is very good at that, but with a bit more background story, and a bit more screen time, her part could have been even more interesting.\nWith Inside Man, Lee showcases an interesting way of directing thrillers. He ignores the usual build up that you see in thrillers, which consists of an introduction, a chronological development of the main intrigue, followed by a final act in which everything is wrapped up neatly (even flashing forward several times, thus revealing some important developments before they have happened), and this only serves to make Inside Man a movie that is more than your regular suspense movie. I enjoyed this original approach very much, even though he does take quite a long time to wrap things up at the end.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good heist one .. with a PG twist",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's all good fun and Spike Lee should be commemorated on his efforts...but no one is ever in danger of failing and the side stories feel more involved than anything occurring within the bank. Thankfully our two veteran actors have enough gusto to keep everything interesting.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film well worth watching. A modern day Italian job.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly written film, Inside Man reminds us when films still had crafty twists and unpredictable conceivable outcomes.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect bank robbery",
            "review_date": "2012-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm never hugely impressed with Spike Lee films, for some reason. This one isn't an exception. But I do really like Denzel Washington, so it's certainly worth sitting through. It's a typical heist film with no major surprises, but it's not a complete waste of time.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}