{
    "rating": 5.5,
    "release_date": "2006-07-14",
    "num_reviews": 170,
    "genres": [
        "Comedy"
    ],
    "summary": "Posing as an abandoned toddler, a very small fugitive (Marlon Wayans) from the law tricks a couple (Shawn Wayans, Kerry Washington) into taking him in. Once there, the baby-faced thief endures the other man's attempts at fatherhood while waiting for a chance to take back the stolen gem he hid in the wife's purse.",
    "reviews": [
        {
            "content": "Ages 13 and older!!!!!!!!!!!!!!!!!!! LOL, the funniest 01 hour: and 38 minutes ever!!!!!!!!!!! In memory of John Witherspoon!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "Little Man ist eine Filmkomödie von Keenen Ivory Wayans. Wer auf schwarzen Humor steht, wird diesen Film lieben. Ja Little Man ist ein alberner und extrem kitschiger Film, aber zugleich eine großartige Komödie, mit viel Lacher und jede Menge Action… Kaum zu glauben, der Film hat mich ausgezeichnet unterhalten, ja ich habe mit Little Man gelacht und gelacht, denn ich liebe diesen albernen schwarzen Humor.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "One of the best comedy movies our family has seen, and even if you watch it time and time again, you will crack up. Other good ones are Death At A Funeral with Chris Rock.",
            "review_date": "2023-01-08",
            "source": "rt"
        },
        {
            "content": "Almost a 5 stars beside the nut shots but still a good flim",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "Ages 13 and older!!!!!!!!!!!!!!!! The funniest 01 hour: and 38 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring the Wayans Brothers: Marlon, Shawn, & Keenen Ivory!!!!!!!!!!! Also: the late John Witherspoon, and Kerry Washington!!!!!! And Tracy Morgan, and Alex Borstein!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-22",
            "source": "rt"
        },
        {
            "content": "Sonic King is the king of lord lord evil king",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "There is nothing funny about this movie, thus my 1/2 star rating.",
            "review_date": "2022-02-16",
            "source": "rt"
        },
        {
            "content": "Straight small man baby does straight man things. Gross, but consider the release date of the movie.",
            "review_date": "2021-08-04",
            "source": "rt"
        },
        {
            "content": "Literally the BEST MOVIE of all time. I mean it's terribly amazing, and something we should be so glad even exist, because no way in hell could that be made now. Try it, go head. Write, pitch, shoot, score, edit and CGI movie of a black man starring as a little person, who has to play a baby. Add in also hiring your entire family, from the score composer to director to talent. \n\nTOTAL WORK OF ART",
            "review_date": "2021-07-07",
            "source": "rt"
        },
        {
            "content": "i like this movie, very good",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "Funny, original, & romantic!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "Completely clueless, ridiculous, not funny and a waste of time.",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "I knew critics would hate this, I don't. Offers some awkward but acceptable laughs. Maybe.",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "it is a very well made film and it is funny.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "i dont see mopvies to laugh. i watch them to enbjpy, i loved this movie would reccomdnedd",
            "review_date": "2020-08-03",
            "source": "rt"
        },
        {
            "content": "Silly, offensive, derivative and goofy, but as expected with the Wayans brothers, it still offers a few laughs.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Bad movie, interesting concept.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "I have always loved this movie since I was a little kid. It absolutely funny and I would recommend.",
            "review_date": "2020-05-05",
            "source": "rt"
        },
        {
            "content": "Movie was stupid and funny extremely corny but lots fun.. great to watch with family!",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "This is a great comedy movie, the story and all takes away half a star but it’s not but for a movie that’s focusing more on comedy than story. This is a great movie to watch with friends and some mature family. A remake of this would do great today. ",
            "review_date": "2020-01-15",
            "source": "rt"
        },
        {
            "content": "This movie was awesome I loved it it was so funny I definitely recommend it ",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "5 star just for being so hilarious. Had a great time watching it with friends laughing my ass off!",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "Little man? more like Big Budget action film. one of the best films of all time",
            "review_date": "2019-03-01",
            "source": "rt"
        },
        {
            "content": "Its so bad its good,also its good to watch when ur high",
            "review_date": "2018-11-27",
            "source": "rt"
        },
        {
            "content": "I'm not tired of seeing it, i laughed and laughed with this movie",
            "review_date": "2018-10-10",
            "source": "rt"
        },
        {
            "content": "I watched this as a child and laughed and I still cant help but laugh at the immature humor lets face it us guys find this humor hilarious LOVE IT",
            "review_date": "2018-04-26",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 5.5\n\nRidículamente divertida.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "Little man bites Dinosaur Rex`s balls. THAT IS ALL!",
            "review_date": "2017-05-16",
            "source": "rt"
        },
        {
            "content": "Average enough, but fairly funny enough for what it is.",
            "review_date": "2017-02-05",
            "source": "rt"
        },
        {
            "content": "Seen in a time-span of 9 hours...Some fun moments ! The Booby-sexual jokes were nice to watch ....Just soso . SOMDVD",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "Best movie I've seen, forget the low scores, this movie has so many laughs packed in it, and a bunch of action.",
            "review_date": "2016-11-18",
            "source": "rt"
        },
        {
            "content": "Only 12% critics lmao? The critics can be such haters ??! This was a terrific movie unless your a crystal meth smoking critic ????!",
            "review_date": "2016-11-14",
            "source": "rt"
        },
        {
            "content": "A cringe-inducing comedy that unevenly balances crude humor and schmaltz.",
            "review_date": "2016-11-03",
            "source": "rt"
        },
        {
            "content": "Little Man is too little to offer anything.",
            "review_date": "2016-09-17",
            "source": "rt"
        },
        {
            "content": "One of those low level humour comedies, but it will certainly have you laughing.",
            "review_date": "2016-07-09",
            "source": "rt"
        },
        {
            "content": "Little Man tries to go for a funny movie. It somewhat gets to be funny, but not really. The trailer of this movie looked good, but when you see it it isn't as good. But, if you liked White Chicks you might like this movie. I wouldn't really suggest this movie.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "83%     Slapstick filled and hilarious, for those who enjoy the raunchy kind of humor. The raunchiness is strongly relied on by its illogical and cartoonish plot.",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "I laughed a couple times but overall, this movie was horrible!",
            "review_date": "2016-05-01",
            "source": "rt"
        },
        {
            "content": "how can you whach ð~¡",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "The face was so fake",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "I love this movie it's funny as shit",
            "review_date": "2015-11-25",
            "source": "rt"
        },
        {
            "content": "Little Man is, of course, a stupid parody, but is not anywhere close to Epic Movie, Date Movie, Disaster Movie, Meet The Spartans, Superhero Movie, Stan Helsing, dang, not even Scary Movie. There are countless funny moments in this movie, no stupid gags like Scary Movie 5. The plot is creative, and I just loved it. It is currently on Netflix, it is a funny, must watch.",
            "review_date": "2015-07-04",
            "source": "rt"
        },
        {
            "content": "This impossibly fatuous, crass and obnoxiously unfunny joke of a movie is quite possibly the worst I've ever made myself sit through. The lazy, infantile writing is truly abhorrent (let's not forget to mention that sexual assault and harassment are played for laughs), the performers should all be sentenced for crimes against the acting profession and the Wayan brothers, plague that they are to mainstream comedy cinema, should be forever blacklisted from Hollywood. I've never been so offended or insulted by the existence of a movie as I have this piece of vomit inducing rubbish.",
            "review_date": "2015-06-20",
            "source": "rt"
        },
        {
            "content": "Hilarious just great",
            "review_date": "2015-06-09",
            "source": "rt"
        },
        {
            "content": "Comedy cannot get any worse than this.",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "this is hilarious!!!!!!!!!!!!",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "I wat to see the movie",
            "review_date": "2014-11-28",
            "source": "rt"
        },
        {
            "content": "Ovo nije ni za tinejdzere........",
            "review_date": "2014-11-25",
            "source": "rt"
        },
        {
            "content": "Better than White Chicks not nearly as good as Scary Movie. The Wayans brothers are hilarious with just Marlon's facial expressions alone. If your familiar with their previous films you'll enjoy it.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "This is a funny movie not the best movie in general but a good comedy. An adult trying to act like a baby is a great idea for a movie but but it in a bad way. Good movie. Funny! Hahahahaha.",
            "review_date": "2014-09-11",
            "source": "rt"
        },
        {
            "content": "Watched this movie when I was a bit younger and was scarred by its sick moments. Now re-watching it and reflecting my views are still identical, SOME slightly laughable moments, just littered with distasteful jokes that will have you cringing.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "First of all there are movies out there with potential but do terribly on delivery.  This movie from the get go had no potential what soever.  There is no logic, no interesting plots (that is if this movie even counts for having a plot), and seeing that this is a comedy film has no laughs.  If i meet anyone that likes this movie I would want nothing to do with that individual.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "Wayans funniest movie",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "This was pretty awful.....",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Its NOT that bad. I mean sure the story doesn't make any sense but the humor from it cracks me up. Its a pretty funny flim and I enjoyed. Fuck the critics this movie is really good.",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Yes I like the movie",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "This movie can really not make sense at times if not a lot of times but the entertainment does pass. Defiantly not a boring movie and does have some funny moments. I thought it was somewhat touching in the end but it's not a great film. There's too many obvious moments that the little man IS A GROWN MAN. My grade for this movie? Just a C",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "White Chicks is so much better and funnier.",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "One of the most hilarious and underrated comedies ever",
            "review_date": "2014-05-08",
            "source": "rt"
        },
        {
            "content": "Funny Movie !!! LOL !!!",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "Way funnier than white chicks",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "This is the funniest movie ever",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "A good cast....not so good script!",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "I don't know what to call this movie. I would call it awful but not describing how terrible this movie really is.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "This is one of these films that is so bad it's actually funny! Nothing amazing here just a joke of a film with the Wayans brothers unleashed and ready to strike again with their bad jokes, cheesy humor & under the belt type of jokes... but you know what it kinda works and even though the film isn't great you'll still have a few laugh.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Another gimmicky comedy from the Wayans brothers, Little Man comes with the requisite raunchiness, but forgot to bring the laughs.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "funny as movie to watch lol",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "This is a great movie and funny too",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "I love it bcause it is funny",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "One of my Mayans-Brother favorites!",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "it's so funny I love it",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "Ridiculous and Juvenile But Quite Funny At Moments.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "A pretty funny comedy from the Wayans brothers. It was raunchy and funny. It all made sense, but the plot seemed kind of dry after awhile. Its still a lot of fun and enjoyable if you don't take it too seriously. It's just a funny joke of a movie that is kind of cute in a weird way.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Really good movie very funny.... Love the ending",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "So. Stupid. End it now.",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "Very funny and raunchy",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "I love this movie so much",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "Look at the poster, do I need explain?",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "A set-up for a comedy, but not a comedy.",
            "review_date": "2013-05-14",
            "source": "rt"
        },
        {
            "content": "It is generally a funny film but the stupidness is just too prevalent!",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "Worst movie that I ever watched it's that bad",
            "review_date": "2013-05-04",
            "source": "rt"
        },
        {
            "content": "I didn't find much of Little Man very funny.  Bizarre?  sure. Weird? at times. But truth be told, I was more disturbed by the film than anything else.  Seing Marlon as a little person pretending to be a baby was just... well... disturbing!",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "It is good want to see it again",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "this movie is so as\nawsome",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "This is so crazy but they are so funny.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "Very funny movie!! One of my favorites!",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "whereas White Chicks was funny and well done, this film is horrendous and you should avoid it like women avoid McLovin!",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Little Man comes with the requisite raunchiness, but forgot to bring the laughs.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Probably one of the most boring and stupidest comedies ever made. Maybe the Wayans brothers should stop acting for awhile.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "This movie so SO Funny! The Wayans brothers made a great team for one hell of a movie.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "this is a very funny movie",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Following White Chicks comes The Wayans Bros. second exercise in plain stupidity rather than the cutting edge humor of their earlier work.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Not funny, just boring and slightly insulting.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "It was funny have my ass laughing the whole movie",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "If your not a fan of the two Wayans, you will not enjoy this motion pic for sure...",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "LOVED IT!!! THE WAYAN BROTHERS DID IT AGAIN!!! THEY MAKE SUCH FUNNY MOVIES",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "Was a very funny movie well done :)",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "this is a well funny film",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "im a nerd so i hate how i knew how they did it and i always looked for the flaws n there were many",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "One star...and that's being generous",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "I want to c dat again",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "quite a good film to watch it has some laughs init",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Helllllllla funny!!!!",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "sucked an was stupi and not the funny stupid either though some of the imature ppl would say otherwise",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "Two crooks, one being only four feet tall, rob a jewelry place and steal a diamond. The diamond ends up in another ladies purse. So being small he pretends he's a baby and his partner leaves him at the ladies doorstep. The wayons bros. have a pretty good comedy here. Defiantly keeps you laughing from beginning to end. Defiantly has an interesting story with most of the actors being funny and keeping you still interested in the movie.  Defiant check this one out if you want some good laughs. It will defiantly give you them through pretty much most of the movie. This is a great laugh out loud comedy.",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "My baby luv this movie",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "its so stupid its funny",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "I SAW THIS BEFORE AS A BUGS BUNNY CARTOON!! FROM BEGINING TO THE END",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Standard film, mediocre, nothing further, worth one watch or two.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "\"Little Man\" is a stupid comedy, stupid because the jokes are cheap, the premise is ridiculous and because the film makers think that audiences will be stupid enough to buy into the film. Even if you are able to buy that a grown man could trick people into thinking that, because of his short height he is a baby/toddler, the filmmakers make the huge mistake of actually showing him alongside real babies, which completely destroys the illusion and makes you wonder how stupid these characters are. The jokes consist mostly of crotch shots, lame sex jokes (including a scene where \"Calvin\" pretends to be \"Vanessa's\" husband during the middle of the night so they can have sex, which is rape, not a joke) and characters looking bug eyed as a little man that is supposed to pass off as a small child does inappropriate things. It may have a few lonely laughs here and there, but this is a movie that's so stupid it's offensive. (Dvd, November 23, 2012)",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "probably the only wayans brothers flick I like",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "Half is better than it's worth but I wasn't sure if i gave it zero that plot would register as a rating.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Pretty funny comedy, Silly but just what we expect from a Wayans film, Worth a watch.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "this rocks its good as scary movie 2, 3,4 and date movie.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Fun movie. Definitely want to see it again",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "I thought this could ave een funnier",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "Another Great Comedy from the Wayan Bros....",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "funny movie with both brothers in it.",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "Please don't watch this crap.",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "it was preatty good!",
            "review_date": "2012-10-11",
            "source": "rt"
        },
        {
            "content": "A live action Looney Toon Cartoon, complete with soundtrack from old looney toon shorts. A few chuckles here and there but for the most part a huge waste of time. This film really magnifies how bad of an actor Shawn Wayans is. The strongest performance comes from John Witherspoon and Tracy Morgan. Other then that..skip, unless you need to entertain your neighbors kid for a few hours...",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "This movie was totally stupid",
            "review_date": "2012-10-03",
            "source": "rt"
        },
        {
            "content": "soooooo freakin funnnnnnnny",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "Watch once, enough for me.",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "Keenen Ivory Wayans Is Stupid.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "Oh my gosh this is so pitiful.",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "I got to watch it\nI want to download it",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "With a funny and cute idea, story and script, clever dialogue and lines, a perfect cast headed by Marlon and Shawn Wayans and Kerry Washington, funny apperances by David Alan Grier and Tracy Morgan, great directing by Kenen Ivory Wayans and exciting scenes and sequences, Little Man is a comedy that anyone can watch and laugh at over and over again.",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "i love this movie so funny",
            "review_date": "2012-08-30",
            "source": "rt"
        },
        {
            "content": "A few funny (and perverted) scenes but for the most part, dull.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "Funny but dangers little bastard",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "kinda stupid but funny lol",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "It funny my favorite movie",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "for god sakes hollywood get your shit together!",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "Hilarious. Could not stop laughing through the whole film. Terrific!",
            "review_date": "2012-08-10",
            "source": "rt"
        },
        {
            "content": "Funny. And I thought it was going to be crap! But it was really funny.",
            "review_date": "2012-08-10",
            "source": "rt"
        },
        {
            "content": "I saw this movie in the theatre..was pretty good!! (=\r\n\r\nI wonder if there guna make a sequel??\r\n\r\nI would go see it..(=\r\n\r\nYou shoould go see it, if you havnt!",
            "review_date": "2012-08-10",
            "source": "rt"
        },
        {
            "content": "I thought this film was Absolutley hilarious and a joy to watch! It's quite a unique movie and both wayans brothers do well! Great cameo from Tracy Mogan too! Not all the jokes work and it slows down in patches but most jokes work! Easily one of Wayans Brothers better movies!",
            "review_date": "2012-08-07",
            "source": "rt"
        },
        {
            "content": "a bit juvenile and not at the least comparible to there previews effort 'white chicks'",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "its a nasty show but funny",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "I just love this movie",
            "review_date": "2012-07-09",
            "source": "rt"
        },
        {
            "content": "Hilarious and fun !!!",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "Average laughs, but I expected more adult comedy.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Not bad for a comedy, some funny scenes but I have seen worse.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "Crude, Brainless, AND HILARIOUS!",
            "review_date": "2012-06-25",
            "source": "rt"
        },
        {
            "content": "Not the best from these guys but still it had its moments .",
            "review_date": "2012-06-19",
            "source": "rt"
        },
        {
            "content": "Was best movie till spider man",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "everyone knew that lil man wasn't a baby!! c'mon!",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "VERY VERY FUNNY!! Own it",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "Thought it was hilarious",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "I don't really give it 5 Stars",
            "review_date": "2012-06-05",
            "source": "rt"
        },
        {
            "content": "a really funny movie. great to watch w/ a bunch of friends",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "A original and kinda funny film from the wayans.",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "i lik it its funny sometimes",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "mite be really funny?",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "This is a pretty good movie",
            "review_date": "2012-05-21",
            "source": "rt"
        },
        {
            "content": "So bad, it's not even funny. Worst movie of all time. If you like this then fine, but you are dead to me.",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "That little guy was so funny!",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "hilarious you have to watch",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "love it ! i got your nose and u got mi nose yes u do .",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Funniest movie ever 2 me",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "LOL. I'LL TAKE YOU TO THE BUTCHER SHOP! EXTREMLEY HILARIOUS!!!",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "funny looking baby thing",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "this movie was stupid as hell.",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "Stupid, even for The Wayans.",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "my boys liked it I haven't seen it yet",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "this movie will crack you up",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "Very funny movie. IMO",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "This sucked A**!!!!!",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "F**k you Marlon and Shawn.  This is f**king unwatchable.",
            "review_date": "2012-04-26",
            "source": "rt"
        }
    ]
}