{
    "rating": 8.7,
    "release_date": "2006-04-07",
    "num_reviews": 230,
    "genres": [
        "Crime",
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "A case of mistaken identity puts a man named Slevin (Josh Hartnett) in the middle of a war between two rival New York crime lords: The Rabbi (Ben Kingsley) and the Boss (Morgan Freeman). While under the watchful eyes of Detective Brikowski (Stanley Tucci) and well-known assassin Goodkat (Bruce Willis), Slevin must quickly devise a plan to save his skin before his luck runs out.",
    "reviews": [
        {
            "content": "Slevin is maybe a bit overly cute, with its Tarantino-esqe unrealistically snappy dialogue and random violence.  Add to that, I am not a fan of mob flicks, and it falls into the same Glass Onion schtick where the third act retells the entire story with now too much exposition.  I would say also that you never really get enough time to know or empathize with the characters.\nStill, there is much to like here.  The pacing is brisk, the film looks good, and you get a dark twist I honestly didn't see coming.  I can also appreciate that which there are very violent scenes in the film, they are NEVER dragged out WB style.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "Pretty good, but at first the movie doesn't know whether it's a dark comedy or not. Clever ending. The Bruce Willis character should've been more developed, not so cryptic if he has a soft spot in his heart.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "As usual, the critics get caught up in their own lofty academic ideas of what a great film should be and crap on what is really just a great, visually entertaining movie with a satisfyingly cathartic story. If one had turned this into an anime, the critics would've been all over it, it would've looked EdGY EnOugh tO ThEIR TasTE.",
            "review_date": "2023-01-22",
            "source": "rt"
        },
        {
            "content": "delightfully throws away pointless moral sensibilties,\nbravo!",
            "review_date": "2022-11-23",
            "source": "rt"
        },
        {
            "content": "It's elaborate and clever, but I'm getting tired of it.\n2.9/5",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "I never knew where this movie was going but i always wanted to be there for the ride. Surprising and satisfyingly ending",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "I pride myself on guessing the ending of movies before they're finished. I thought I knew what was going on with this one. Boy, did it sneak up on me in only the way a great movie can. Not a-lot of films have quite this much personality. It's got an attitude that says \"look over here while I steal your wallet from over here\". YES, its a good movie with an interesting plot, but that describes a thousand other movies, what separates this is how stylised it is, how well written it is, how flirtatious, and deceptive it is. loved it, watched it a thousand times, still love it!",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "When I first watched Lucky Number Slevin in the late 2000s, I thought it was highly entertaining. Years later, it's still entertaining, but not as much as it used to be. I still really enjoy the dialogue, though, and it's fun to watch the twists and turns happen even when you know they're coming. It's not a great film, but it's an amusing, albeit violent ride to take every now and then.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Com uma direção inventiva e uma fotografia interessante, este filme entrega um roteiro bem amarrado e com surpresas muito recompensadoras.\nO elenco entrega um bom trabalho e alguns diálogos bem interessantes, a trilha sonora cumpre seu pape, e a música tema é ótima.\nVale a pena a experiência.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "A fun movie and somewhat funny but the twist was rather predictable.",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "AKA - The Wrong Man\n\nGood cast and well acted\neasy to follow but still surprising",
            "review_date": "2021-11-09",
            "source": "rt"
        },
        {
            "content": "Josh Hartnett plays Slevin, who just gets into town, gets robbed and then is mistaken by rival crime bosses for someone else, leading to many twists and situations involving a hitman.  \nLucy Liu, Bruce Willis, Ben Kingsley and Morgan Freeman costar.  \nFun flick full of action, comedy and violence.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "I loved this movie. And what can I say about the cast? Well for one I have a mad crush on Lucy Liu she's crazy hot just sayin. Great movie and great ending. Don't wana ruin it but it's good just shut up and watch it!",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "Loved the banter, good solid plot and excellent twist",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "If Lucky Number Slevin was half as clever as it believed it was, it would have been one of the finest films of the decade. As it is, its many convolutions and intricacies, along with talented supporters, along with a frenetic direction, only render it a diverting yarn. The main obstacle might be Josh Hartnett, who is not a career leading man. However, I think that the character of Slevin runs into a roadblock long before you evaluate the acting, because his character undergoes a sudden transformation for the sake of the plot's cleverness that jeopardises his emotional appeal. Lucy Liu is pleasant in her few scenes, and having Morgan Freeman and Ben Kingsley as rival crime bosses worked almost as well as it would be bound to on paper. Bruce Willis seems to enjoy himself as an assassin, even though you see hints of his inertia and woodenness that would give way to some late-career misadventures for paychecks. Stanley Tucci also shows up. Who doesn't like Stanley Tucci? I found that investment in the characters comes with difficulty after the twists run their course and the film concludes. For a film to waste so much time to build its protagonist and then contradict itself for the purpose of a twist requires an experience that overcomes initial frustration by offering up some superb acting or brilliant style to make up for it. Lucky Number Slevin possesses neither, and despite a good deal of action and an original set-up for a crime thriller, the end result is a slight disappointment.",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "Great cast, subpar script that thinks it's way smarter than it actually is. The \"snappy,\" reference-heavy dialogue is too mannered and forced. The plot twist is not all that surprising given what's shown at the start of the film. Extra demerit for getting a Phillies-related baseball fact wrong. (Tony Taylor did not play for the 1979 Phillies. He was retired by then. C'mon, man!)",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "Only a 51% huh? Yeah no this movie doesnt deserve a 51% it is way better then alot of shit. The characters are sarcastic and likeable and they had some pretty funny moments. It isnt the most predictable but still has moments where I knew where it was going. The two Main Anti-Heroes were great and the scene where Bruce Willis talks about Bad Dog's backstory was a very good scene.",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. The overall style of production is unique and the clever plot is written flawlessly. Would recommend to anyone.",
            "review_date": "2021-07-21",
            "source": "rt"
        },
        {
            "content": "It may try a little too hard, but it still works with its slick dialogue, style inspired by 90's neo-noir crime thrillers, and surprising twists.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "First off I didn't find it as Tarantinoesque as many of the so called \"top critics.\" Some similarities throughout but other than being nonlinear Slevin has a completely different feel. The movie is fast paced and should keep your attention. While not being a great movie, it's a perfect movie night watch. The writing is clever and witty with a light feel. I'd call this a blend of noir and a romantic comedy. The acting wasn't award worthy but fit the style and theme nicely. It wraps up nice and clean.",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "Tis a stretch but it's a damn good fun time.",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "i thought this was great! & what a cast; goodness. it's slightly predictable, but there's enough going on & an added twist or 2 at the end which keeps you on your toes. i think it's a very smart plot. smart plots are my favorite plots.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "Twist, after twist, after twist! Lucky Number Slevin is one of those movies that deserves more between three and three and a half stars. It's a great, neatly written film. But there are a couple plot holes here and there, which is why I can't quite give it four stars. But don't get me wrong, director Paul McGuigan's crime thriller is quite good. A stylish and bloody film, reminding me a bit of Pulp Fiction (1994), and quite a bit of humor to go along with it. And there are plenty of great actors in there. Josh Hartnett, Ben Kingsley, Lucy Liu, Bruce Willis and Morgan Freeman all make a very solid cast. Overall, it's a mind-bending movie that will not disappoint, I was entertained by it, and the ending is quite something. An achievement and recommended!!",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "A grossly underrated, highly stylized, fun pulp story with twists and turns.",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "I think it's a brilliant, witty, clever, intriguing revenge fantasy. Every member of the cast is superb, and the writer and director  both deserve medals.",
            "review_date": "2020-10-31",
            "source": "rt"
        },
        {
            "content": "Pro tip: when it takes the last half-hour of your movie to explain the first 80 minutes of your movie, you're trying too hard. You see this kind of mistake in other Tarantino copycat films like \"Smokin' Aces,\" \"Suicide Kings\" and even \"The Boondock Saints\" to some extent. Screenwriters trying to not only outsmart the audience, but themselves. It really doesn't impress. You see the twists and turns coming from a mile away and when they eventually land, you lament the fact that the filmmakers still find the need to explain how we got here. There's some charm and personality on display here and there, but I couldn't help but notice the \"everyone thinks that Quentin Tarantino is the best at writing dialogue? Well, I'll show them!\" sort of aspect to it all. You'd think that Tarantino alums like Willis and Liu would get wise to the knockoffs and counterfeiting, but here we are. I do miss Josh Hartnett, though. Remember when him and Lucy Liu were big draws at the theater? Also, remember theaters?",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "Lucky number slevin takes place in a world only the mind of a suburban teenage boy could postulate.",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "I think it's great story. Twist is visible if you take all the hints. But amazing looking movie and fun.",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "'Lucky Number Slevin' is a sleek pace movie with a solid cast who all do good work. As the movie goes along, it keeps you guessing.\n\nHowever, I feel like the tone and style of the movie is very messy. The movie starts off bleak, but then turns quirky and funny - with characters plucked out of a Guy Ritchie movie, and dialogue from a Tarantino movie. Later towards the end it turns into a hard hitting drama. \n\nFlawed, but enjoyable.",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "If you dont over analyze it, it's a fun movie. Great caste. Obvious but fun story. Good times.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "extremely violent but off the wall with some great performances, the twist end is fantastic as well.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "It's a disposable crime thriller, but it's light and fun. It tries a little too hard to be clever and cool, which backfires on it a little, but it still maintains a fun mystery throughout. It's a little more mean spirited than most and has a pretty killer ending; though I can't help but wonder how much stronger this could've been with the original conclusion intact...",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is about a man named Slevin. It tells the story of Slevin`s failure. His house is sealed and his girlfriend was left. He gets into criminal showdown.\n\nI love the action in this film. Josh Hartnett stars as Slevin, Bruce Willis plays the role of Mr.Goodcat and Lucy Lie plays the role of Lindsey. My favourite character is Slevin because he is very funny and smart.\n\nI think this is an ideal film for people who like complicated plot. Story is very intresting and there is a lot of action.\n\nGo and watch it soon!",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Underrated, entertaining, and fun action movie.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "This crime thriller was really good. Bruce Willis, Josh Hartnett, Morgan Freeman, Ben Kingsley, Stanley Tucci, and Lucy Liu did an excellent job in this movie. The plot to the movie was suspenseful and it had some twists near the end, which makes the movie great. This movie will shock and entertain you at the same time. It's a definite must see.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "Fantastic story! Guy Ritchie meets New York gangsters, sprinkle of sarcasm and dose of Bond. One of my all time favourites.",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "Quando un film esagera e cerca di essere ciò che non è e non sarà mai, si ha come risultato un prodotto ambizioso, scadente e difficilmente apprezzabile. Partendo dai dialoghi decisamente irrealistici e fuori luogo, il film pecca per la mancanza di una coerenza di fondo: da inquadrature governate solo da uno stile troppo accentuato, alle scenografie generiche e poco contestualizzate. Nemmeno una trama vagamente decente riesce a salvare un film che non ha speranze fin dal principio.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "Oh, so THIS is what Josh Hartnett should be doing…aloof comedy. The plotting here is more than a bit convoluted and a little too proud of itself, but the dialogue is fun, with great actors reveling in playing eccentric, high-wire characters. A dark good time that will leave your brain as quickly as it enters it.",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "great cast and interesting story-line to make the movie enjoyable",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "I like Lucky Number Slevin. Entertaining and rewatchable. Yes, I like to let it run again, even if I speed up some parts (more for lack of time than anything else). Still, another go at it lets you apreciate some subtle details. Yes, there are such. I admit it's a little bit comic-like, but I think it's not too imposing that way. I think it's a good, and sadly underestimated movie.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "These reviews are full of people who fancy themselves 'tuff guys' and/or 'intelligent'. Yet anything not fed to them on a platter is too much for their poor lacking brains to conceive. \n\nThis movie is amazingly well thought out. \n\nI'm sorry to the half of the population who are slow sheep. Your government raised you well(ï¿ 1/2 1/2 1/2~\"). Hopefully one day, soon, you can be the comensence having critical thinking human beings you ought to be. *Tisk*Tisk",
            "review_date": "2019-05-18",
            "source": "rt"
        },
        {
            "content": "If you like The Usual Suspects you'll love this. This movie is beyond good. If you don't like this movie something is wrong with you.",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "Seriously F*ck the TOMATOMETER's reviews about this? 51% ??! WTF is wrong with you? jealous ma'f*ckers?",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "Loved the script. The twist was pretty predictable but hartnett was so likeable you forgot it. Writing was fabulous best dialogue for a long while and the actors were all superb , 10 stars if I could. I watched it at least ten times and kept noticing new things in the background. What happened to hartnett ? Bring him back I say",
            "review_date": "2019-03-20",
            "source": "rt"
        },
        {
            "content": "Fun but flawed, requiring the shutdown of critical mental facilities more  than is normal even for this type of film. Also the miss use of two great actors, Freeman and Kingsley is \"criminal\". That said sit back and enjoy the ride!",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "WHAT a great twist of an ending. Critics know nothing. They're movie snobs. Look at average movie going public reviews. We're what counts. ",
            "review_date": "2018-12-22",
            "source": "rt"
        },
        {
            "content": "Entertaining and love the sets",
            "review_date": "2018-12-13",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is a great surprise- It takes from the best, namely Hitchcock and Tarantino in its approach to writing and directing and boy is it a ride. Keeping things unpredictable and breezy Lucky Number Slevin is a riot of a movie. The acting from everyone from Josh Hartnett, Bruce Willis, Lucy Lui to old veterans like Morgan Freeman and Ben Kingsley is great- you know they're all having fun. You should too- go see it. (Rather underrated Josh Hartnett film).",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is a surprise of a film- It takes from the best, namely Hitchcock and Tarantino in its approach to writing and directing and boy is it a ride. Keeping things unpredictable and breezy Lucky Number Slevin is a riot of a movie. The acting from everyone from Josh Hartnett, Bruce Willis, Lucy Lui to old veterans like Morgan Freeman and Ben Kingsley is great- you know they're all having fun. You should too- go see it.",
            "review_date": "2018-10-08",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is a surprise of a film- It takes from the best, namely Hitchcock and Tarantino in its approach to writing and directing and boy is it a ride. Keeping things unpredictable and breezy Lucky Number Slevin is a riot of a movie. The acting from everyone from Josh Hartnett, Bruce Willis, Lucy Lui to old veterans like Morgan Freeman and Ben Kingsley is great- you know they're all having fun. You should too- go see it.",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "I had a blast watching this movie, multiple times. i don't quite understand why critics dislike it. I even made this account to give it a better rating.",
            "review_date": "2018-07-28",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is a surprise of a film- It takes from the best, namely Hitchcock and Tarantino in its approach to writing and directing and boy is it a ride. Keeping things unpredictable and breezy Lucky Number Slevin is a riot of a movie. The acting from everyone from Josh Hartnett, Bruce Willis, Lucy Lui to old veterans like Morgan Freeman and Ben Kingsley is great- you know they're all having fun. You should too- go see it.",
            "review_date": "2018-07-26",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is my absolute favorite movie. All you really need to know about this movie is that its all-star cast-Bruce Willis, Josh Hartnett, Lucy Liu, Ben Kingsley, Morgan Freeman-all agreed to do this movie for free. And what a movie it is. The writing, directing, set design and editing are superb. \n\nThe viewer is sucked right in at the beginning. Slevin (Josh Hartnett) is mistaken for his friend, Nick Fisher-a gambler with many debts. Two rival criminal syndicates come to Nick's apartment, where Slevin is the only one home, to collect the debts. One gives him the option of waving the debt if he's willing to murder the son of the boss of the other syndicate. And then the rollercoaster ride begins. Strong-armed goons, crooked cops, a stalking hitman, a nosy neighbor and countless criminal thugs push Slevin around as he struggles to decide how to handle the situation. \n \nThe first time I watched this movie, I had to stop it about a half hour in because I knew it was going to be the kind of movie that I didn't want to watch alone. It's gripping and exciting with twists and turns and an ending that is difficult to predict. I love the uncomfortable feeling created in the scenes where Slevin is forced to meet with syndicate bosses while only wearing a towel and slippers. It's like a nightmare. It's the ultimate what-would-you-do-in-this-situation type of movie. \n\nAnd Lucy Liu is adorable! The entire cast put on an expert acting clinic in this movie. Even the smaller parts like Elvis and Sloe (performed by Bubba from Forrest Gump) where such wonderfully developed characters that all their silliness is believable. All the characters seemed like they had a life before the events in this movie, which is a sign of great character development. You'll definitely want to watch the deleted scenes for more Elvis and Sloe and the Israeli bodyguards. The director's commentary is interesting as well and worth watching.\n\nLucky Number Slevin is the perfect combination of cops and robbers, humor, mistaken identity and tension. This one deserves more than five stars. \n\n\"Tell it to the one-legged man, so he can bump it off down the road.\"",
            "review_date": "2018-07-11",
            "source": "rt"
        },
        {
            "content": "Trying too hard to be clever. Cloyingly stupid. Lucy Liu was painful to watch.",
            "review_date": "2018-06-16",
            "source": "rt"
        },
        {
            "content": "Great movie, keeps you guessing and amazing ending",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "Even with its somewhat convoluted plot (as long as you pay attention and you're not too pernickety, it probably won't have as much of an effect on how enjoyable it is as you might think), dialogue that is trying a bit too hard to be clever, and an ending that can only be described as a let-down, 'Lucky Number Slevin' is still, for the most part, a mightily entertaining action/thriller with a great cast and engaging characters.",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "A great cast, great sets, and a great score don't make this any less of a slog to get through.  On paper, it's a teenager's fantasy-booking of an action movie, but the shallow characterizations and over-complicated plot make it a mediocre shoot-'em up.  Points for aiming for something fantastic, but it just doesn't come together.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "Honestly don't see why the audience score is so high.  Good actors, but I feel like the revenge story/cliche is getting old.  I also somewhat saw the ending coming.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "I disagree that this movie tried to be too much like Pulp Fiction. I think this was a very cool & unique movie with its own feel. I believe that it's labeled a bit wrong...it should be crime drama, yes, to that there is no doubt, but there are so many moments that make myself & others laugh throughout the story that this is easily a partial comedy. There are some regular \"ha ha\" funny moments & also some dark humor (partly due to the main character's continued misfortune). Also..spot on casting job, perfection?!!!\n\nI recommend this flick!",
            "review_date": "2018-01-09",
            "source": "rt"
        },
        {
            "content": "Great cast, interesting plot and nice soundtrack. Competently used Tarantino-Richie-esque elements made movie visually appealing. \nI personally think that this film is a hidden jem. It's stylish, clever (most of the time) and has a rewatch potential.",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "Don't understand why this movie doesn't have all of the support from the critics. This movie is an absolute thrill! A must watch for a fan of the sleight-of-hand.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "A perfect example of when Rotten Tomatoes critics are out of touch with the real viewing audience. I saw this movie years ago and loved it, forgot about it and just watched it again and I think I'll have goosebumps for the rest of the evening. Fantastic movie, unexpected turns. Hard to follow for critics probably, but the general public doesn't seem to have trouble.",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "For a kick off Hartnett was a terrible choice for the lead. The twist is obvious from the get go. Kingsley and Freeman are great as always. It tries to be too clever and resorts to Tarantino type dialogue that doesn't work and at times seriously cringeworthy.",
            "review_date": "2017-08-06",
            "source": "rt"
        },
        {
            "content": "I thought this was a great movie.  Started off great, got weird, and then ended strong.  I was drawn to the set design and it's over the top wallpaper everywhere.",
            "review_date": "2017-06-20",
            "source": "rt"
        },
        {
            "content": "An extremely entertaining genre-jumper of a movie! Excellent dialogue, extremely nuanced characters, supreme cinematography and editing, and a story that with make you laugh, cry, and sh*t a brick at the same time! A must-see.",
            "review_date": "2017-06-05",
            "source": "rt"
        },
        {
            "content": "Great acting, great story!  Funny, interesting, suspenseful, sentimental...  I thought this movie had it all.  Thoroughly enjoyable.",
            "review_date": "2017-05-29",
            "source": "rt"
        },
        {
            "content": "As I continue my reviews with 501, I figured the best way to move forward was by taking a small step back to 2006 with Lucky Number Slevin.   Nearly 11 years ago, Slevin was overshadowed by a plethora of other major milestones in the movie industry like Casino Royale, The Departed and Children of Men just to name a few.  While none of it was difficult to predict and because it tried too hard to model itself off other movies of the same genre, Slevin takes a back seat to the aforementioned movies because of it's lack of desire to truly stand on its own.\n\nJosh Hartnett has always been somewhat of an enigma to me.  He's attractive enough to get the rom-com roles we've seen him in before, but not attractive enough to really make a dent in that genre.  He's a bit baby faced for roles involving gangster or tough-guy issues, but he pulls off  the desired cockiness with ease.  So where Slevin succeeds is when they let his attitude run wild.  They compliment that with an assuredly goofy performance from Lucy Liu and an almost comic-book-like appearance from Bruce Willis.  \n\nThe plot is jumbled, and while we get some good background info on the proceedings to start the film, most of the \"war\" between Morgan Freeman and Ben Kingsley's dueling gangster bosses is left to the imagination.  Instead of developing these two crime bosses, we get caricatures.  Stanley Tucci's police detective really comes out of left field with his revelation in an unsatisfying way because of his lack of involvement with the rest of the characters outside of standard police work.\n\nLucky Number Slevin won't wow you with its plot or capture you with its imagery.  The dialogue and interaction is just campy enough to put on a good show.",
            "review_date": "2017-04-10",
            "source": "rt"
        },
        {
            "content": "This movie had a lot of enjoyable elements. But I feel like the plot seemed a little too engineered. On the face of it it's an action comedy, but at times it takes itself too seriously and it has plenty of violence but very little action.\n\nThe most entertaining part of the movie is the interplay between the characters full of ridiculously funny one liners and come back's. But it seems like the direction of these performances are somewhat lacking, every interaction within the first 45 minutes of the movie seems like the same regurgitated Laurel and Hardy routine.\n\nIt's an OK flick with some snappy dialogue but I feel like the Writer is trying to pull off a magic trick that's not as impressive as he thinks which kind of brings down the film as a whole. But I'd say it's still worth a watch.",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "Brilliant! First class cast and a plot as tight as a ***** ***** ***** (nope, not sure what that stands for either - but it's tight). Keeps you guessing all the way through to the end. Clever and entertaining dialogue throughout.",
            "review_date": "2017-03-13",
            "source": "rt"
        },
        {
            "content": "it was ok not the best",
            "review_date": "2017-03-04",
            "source": "rt"
        },
        {
            "content": "5 stars aside from visual editing (180 line broken, etc)",
            "review_date": "2017-03-02",
            "source": "rt"
        },
        {
            "content": "Not bad, but the dialogue wasn't very real and the story was kind of weird and cheesy.",
            "review_date": "2017-02-27",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "Good watch, but it takes about 15 to 20 minutes to get used to the dialogue. It tries a bit too hard to be witty and cool but once you settle in it becomes fun. Hartnett, Willis, and Liu were all excellent in their performances.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Quirky, yet entertaining. Stanley Tucci and Ben Kingsley are genius in their roles.",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "This movie confusing as hell!! I didn't like this movie at all !!  It was good movie but crazy that it was two of them same guys the whole time.  I think they were twins or maybe he went back in time.  When they reveal an epic twist near the end , boy will it be an epic twist at the end that will leave you speachless!!! I really liked this movie a lot.  There is an epic twist at the end that could leave you speechless . . . Or should I say, Slevin!!  I didn't really understand this movie.",
            "review_date": "2016-12-24",
            "source": "rt"
        },
        {
            "content": "On the plus side: production values, interesting sets, photography, soundtrack, the \"tone\" of the film. On the negative side: Lucy Liu's character/performance was annoyingly unbelievable. It kept my interest for the most part. I was glad I saw it.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "Decent movie. It was cheesy, which I didn't like. But, the ending was surprising. It was an okay movie, but not very memorable.",
            "review_date": "2016-12-13",
            "source": "rt"
        },
        {
            "content": "A Hell of a lot better than most of the stuff out there. It doesn't need to be time specific.  All the actors are A+ and Lucy Liu is cute as a button.",
            "review_date": "2016-12-13",
            "source": "rt"
        },
        {
            "content": "A stylish and clever brain teasy-thriller. Shame it wasn't clever enough to avoid all the cliches.",
            "review_date": "2016-11-12",
            "source": "rt"
        },
        {
            "content": "This is a lively great put together movie. With snappy dialog and a plot that will keep you guessing until the end. Highly recommended.",
            "review_date": "2016-09-21",
            "source": "rt"
        },
        {
            "content": "Great cast!  I usually hate Josh Hartnett but he was ok here.  There were a lot of humorous undertones and some cool twists.",
            "review_date": "2016-09-20",
            "source": "rt"
        },
        {
            "content": "Great story with good acting",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "Ever since the first chapter of the film, the movie kept going and deliver the goods. Great movie to watch with a lot of twist to figure out. With great performance by Josh Harrett, and Bruce Willis, and the entire cast as well. Great suspense and some good action scenes, this is the type of movie that keeps you in it from start to finish. So for this being one of the best films to come out this year... I give \" Lucky Number Slevin \" a B.",
            "review_date": "2016-09-03",
            "source": "rt"
        },
        {
            "content": "Stylish crime thriller starring the long forgotten Josh Hartnett amongst other big names.\nThe film feels like it has strong influence off of other who dunnits from the 90's with snappy chat, cut-scenes and a somewhat tangled plot line.\nMaybe not quite up to the mark it wants to achieve but nonetheless a good film and fun watch.",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "trys to channel Tarantino and fails, as well as brig excessively and pointlessly violent. However, several parts are filmed interestingly",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "Very tight, visually cool, gets muddled a little bit.",
            "review_date": "2016-06-25",
            "source": "rt"
        },
        {
            "content": "The best film of all that I have seen",
            "review_date": "2016-06-19",
            "source": "rt"
        },
        {
            "content": "\"Trying too hard to be clever in a Pulp Fiction kind of way.\"\n\nUh, no? It wasn't trying too hard, the clever parts are objectively clever, and it's nothing like Pulp Fiction. Learn to review better, please.",
            "review_date": "2016-05-27",
            "source": "rt"
        },
        {
            "content": "Deeply contrived but somewhat diverting absurdity",
            "review_date": "2016-05-12",
            "source": "rt"
        },
        {
            "content": "A comedic, noir, love story and tale of revenge. (Can we have another theme please). Oh wait, we do: rivalry. Fun film, more violent than it needs to be. Lucy Lui wad great, I'd watch her do laundry, and the rest of the cast were all seamless. Entertaining for sure.",
            "review_date": "2016-03-06",
            "source": "rt"
        },
        {
            "content": "A brilliant film, That for most of it leaves you scratching your head and the plot feels like it could be a mistaken identity comedy film, But if you hang in there it's worth it as the plot unravels and it's full of great twists and turns and is very clever, All the cast were great I'm just surprised it didn't get more praise, It is one of them films where if you don't pay full attention it won't make sense as it's very detailed but it's great and definitely worth the watch.",
            "review_date": "2016-02-26",
            "source": "rt"
        },
        {
            "content": "The film sweats cool. I just wish someone had polished and cleared up the script before it was made.",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "Good movie, lots of plot twists.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "Slevin offers fleshed out characters, snappy dialogue, and great direction. Yet, the film is also messy, overlong, uneven. \nGrade: B-",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "There may be no doubt that Slevin is a film loaded to the hilt with over-confident stylistic qualities, but it is not at the loss of substance. Ultimately the complicated story line is translated via fantastically clear and kinetic direction that keeps events interesting, intriguing and entertaining. Some perfect casting choices leave Hartnett and Liu as an unexpectedly engaging on screen couple with oodles of entertainment value on offer just from their off-ball scripted conversations. For some this may be an overly convoluted affair, but for those wanting a film that keeps you guessing, interested and entertained, you can not really do much better. The pay off is great, the characters engaging, what is not to love?",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "This is a fantastic film -- I'm shocked that it wasn't more widely liked",
            "review_date": "2015-12-18",
            "source": "rt"
        },
        {
            "content": "My kinda film. Loved it from being to end",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "The critic rating on this movie is exactly the reason I don't give much credence to rotten tomatoes critic reviews. I really love this movie. Watching it now as a matter of fact. Does its job very well, reminds me of Kiss Kiss Bang Bang, which was even more convoluted than this film. Josh Hartnett's performance is actually pretty dang good, and you can't beat Sir Ben Kingsley's portrayal of the overtly Jewish Mob Boss, and Bruce Willis as a psychotic hitman. First time I saw this movie, I was really blown away with the ending. Still love it to this day. Even Lucy Liu, whose portrayal of the neurotic neighbor is sort of annoying, is fitting to the story.",
            "review_date": "2015-11-25",
            "source": "rt"
        },
        {
            "content": "Plenty of style, charisma, thrills, and plot twists to warrant a good watch, but it ends in such a way that you'll only need to watch it once.",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "This film was so much better than I had first anticipated... an underratedly great film.",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "Dizzy and overly complicated Pulp Fiction wanna be.",
            "review_date": "2015-09-14",
            "source": "rt"
        },
        {
            "content": "To this day, this film remains one of my favorites. The dialog between Hartnett and Liu's characters is fast-paced and witty. The plot will keep a new viewer guessing until the end. A bit surprised at the scores this has received!",
            "review_date": "2015-09-10",
            "source": "rt"
        },
        {
            "content": "It is an entertaining, clever, trickster crime story.  Just check up on \"Kansas City Shuffle\" as the key to this mystery.  Many body counters and gallons of blood.",
            "review_date": "2015-08-14",
            "source": "rt"
        },
        {
            "content": "All this has to offer is very clever plot twists.",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "It features an all star cast. Not too bad. Entertaining. Has it's moments. But when it was finished, all I felt was sad and depressed.",
            "review_date": "2015-07-25",
            "source": "rt"
        },
        {
            "content": "It was shot beautifully and the music was pleasant and you could see that it was directed well, however I have a few problems with this film. Firstly If you hear somebody waking you up in a middle of an empty airport, your first reaction wouldn't be to simply listen to them. You would feel nervous and unsettled especially, if somebody is talking to you about a crazy story. Secondly, if you open the door to a neighbour across the hall (whom you have met for the first time) you certainly and definitely wouldn't answer the door in a towel. I just feel that aspects like this could of certainly been avoided. Funny at times and the story wasn't too bad, just feel some things could of been avoided that could of made rhe movie so much better. it gets better mid-way and the end was pleassnt",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "good one but the end could have been more thrilling",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "Fun crime action flick with lots of red herrings and wrong turns to keep you guessing. Stylish beats out substance, since I can't remember much more than that...",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "I personally love this one a all-star cast a really smartly written script, an awesome watch.",
            "review_date": "2015-04-17",
            "source": "rt"
        },
        {
            "content": "It's a decent and entertaining (on the most basic of levels) suspense/thriller that has a slow start but good reveal and ending (although fairly obvious) along with some twists and turns that are good but not good enough.  It's been done before and been done much better.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "I love movies told piece by piece, where you're trying to piece together the puzzle before the big reveal at the end. While I think films like Vantage Point or Holes did it better, this is definitely a great film with a great cast.",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "This feels like a get out of jail for free card that the producers just made. You might not understand what's being said in this movie. That's okay, that's normal, that's just how smart the film is. Ugh, give me a freakin break! Only good thing about this?.....eh...Lucy Liu was hot! Not saying much though!",
            "review_date": "2015-03-31",
            "source": "rt"
        },
        {
            "content": "I think that those who compare this movie to Pulp Fiction are acting too harsh towards this masterpiece. Yes, Tarantino is a legend. Almost every script he writes is priceless. But this movie is awesome, and people who don't like it are just being fussy, that's all. I got mind-blown from the get-go. However, at the end I started connecting the dots. For example, when I saw Lindsey hugging Slevin at the airport, I knew she was wearing a bullet-proof vest when Goodkat shot her while she was at the morgue. I don't think that counts as me being a good analyzer or anything. Moreover, I couldn't believe that Goodkat could kill a kid, so at the end again, I knew he would train the kid to become an assassin just like him. I think the moment you see one thing you didn't expect at the beginning, you automatically begin to expect everything. The reason why I hate people rating movies, thinking \"top critics\" makes them gods is that, there are so many movies that people don't appreciate, and that really grinds my gears. Word of advice: try to read/watch everything with an open heart, or else you'll end up an old man in a wheelchair hating yourself, waiting impatiently for death to come.",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "A hidden gem...intricately plotted fantasy/thriller/comedy/romance. Beautiful PVs and all star performers cast against type. Have watched it twice - already.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "underrated. enjoyable and entertaining crime comedy.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Wasn't as bad as I thought it was going to be",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Clever, twisty-turny and somewhat stylized organized crime film.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Im the last person to see this , and its good",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "this is one of my favorite movies",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "I actually really loved this movie!  Kept me guessing most of the movie!  Good stuff!",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Don't know how you can't love this movie.  Smart, has action, love.  Star studded cast.  One of my favorites!",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Please don't waste your time watching this movie..",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "This movie was pretty freaking cool. It is unique, creative, and mind boggling. It gets better as it goes and it is clever and witty. It has twists and turns and makes more sense as you go so therefore it is entertaining and it had a star studded cast and gets overlooked.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "Interesting plot with great cast of characters!",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "The first time I saw this I was blown away. The dialogue is crisp and clever, and the characters are just as interesting. Definitely worth seeing at least once.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "With an amazing, unconventional cast that delivers undying wit and chemistry, this is in my opinion, one of the most underrated and undiscovered revenge thrillers of this generation.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "Clever and upbeat.  A highly unappreciated dark comedy/thriller.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "A good movie that is full of action and of chuckles, well worth watching.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "Favorite movie of all time",
            "review_date": "2014-05-30",
            "source": "rt"
        },
        {
            "content": "Good action thriller. Takes a little bit too long to get on with the main story. But when that happens, you're quite surprised.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "Satisfying. Pay attention.",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "It is well paced and with some interesting elements borrowed from here and there (Guy Ritchie and David Fincher) but has the weird feeling that you are waiting from some plot twist in the end. Anyway, is watchable enough and fun in some way.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Hilarious, smart and very interesting storyline that kept me hooked to see how it would all pan out. Lucy Liu was very cute in this, although I found all the characters (even the minor ones) entertaining.",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "Grade:Low 8/10\n\nLucky Number Slevin is a film that contains a bunch of elements that a\ngangster film needs, and also a dash of comedy that brings it all well\ntogether. With a big cast of familiar faces and performances to match\nreally, I really would recommend this, if not only to prove the critics\nwrong who don't like this film. I felt this film was safely very good,\nand here is why below.\n\nThe story is serious at most times but also doesn't mind being comedic\nand this makes it much more fun as you really get more interested in\nthe plot. It starts to get complicated towards the end but in a good\nway actually as the whole mystery and shocks that go on are revealed in\na simple and easy way. It contains fun moments too, unpredictable and\nthrows a few curveballs it just makes a very good piece of\nentertainment.\n\nJoh Hartnell in the main role is good, maybe not the best that could\nhave been done of this role but he works it well, Morgan Freeman and\nBen Kingsley as the two mob bosses are good as well but yet again they\nnever seem to do the role as well as it COULD be done, although it is\nsteady going by all three. I did however think Lucy Liu fitted her role\nvery well and portrayed a character that you didn't know much about\nreally.\n\nIt is written well and the script is the probably the strongest thing\nabout this entire project. Directed well too the more technical side of\nthis deals it's strongest cards and is why I rate as I have, the sets\nthough are dizzying and never seem to fit what is going on, or any\nserious note the film is trying to find, but they don't ruin this films\ncredibility. \n\nApart from the sets the main problem with the movie is that It wraps\nitself around itself in a sense and becomes very confusing at times,\nmostly is isn't but it happens at certain parts which niggle down it's\nrating. I said about the acting which I did say wasn't bad but what I\nwill say is that Bruce Willis completely wastes his talent in this with\na bad performance that somehow never fits in with this piece.\n\nThose who like a good old action and mysterious plot should enjoy this\nas that is exactly what it turns out to be by the end and can be hugely\nenjoyable. It isn't the best of gangster film but could serve to please\na fan of that type of film with it's two rival crime families, although\nthe comedy may take some gangster film fans away from this one.\n\nOverall I give this a low 8/10, it is a Safely Very Good movie but maybe not\nquite enough to be rated as Great. With this you seriously have to\nignore the critics who don't like this because it is hugely enjoyable\nif you just watch it straight, enjoy the curves it throws at you and\nyou will pleased by it hugely, If you start to look into this well then\nyou may feel it isn't quite up to scratch with others like this movie.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "Very annoying characters played by Josh and Lucy.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "Creative, well acted, and a clever script make this a tight wound action/mystery movie. Sort of confusing at first but once it comes around its a pretty interesting plot.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "Me lo ricordavo più WTF e incomprensibile il finale. Ed invece alla fine non è che sia una grande trama, anche se ci prova e sicuramente è superiore a molti altri film del genere che spesso hanno buchi nelle motivazioni.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "While it does have some great performances and a few sharp lines of dialogue, it tries too hard to be a Tarantino film and tries to save it's self with a galore of twist. Which is a bit entertaining but realise too much on it. But still, it has some funny and bloody moments that do make up for it and makes it enjoyable.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "A contemporary version of Hitccock's North by Northwest. Though a bit to \"blockbuster\" if that's even a saying anymore I found it to be quite entertaining. A good action thriller.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "kansas city shuffle i.e. \"supercazzola\"",
            "review_date": "2014-03-05",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin wants so badly to be a crafty little noir, yielding to a narrative that's too complex, characters that are too artificial, and production values that are too showy, that the film chokes on its own smugness.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "An average and predictable crime thriller smartly packaged. Deducted half a star for Lucy Liu's annoying character.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "I always thought this film was super under rated. It's a personal favorite of mine. One i've seen a whole lot of times. It may not be perfect but it's just so much fun.",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "Quirky and slick. Modeled after Pulp Fiction (which isn't a bad thing) - this is a fun comic-caper. Not laugh out loud, but entertaining and enjoyable even after the first viewing. If you like the genre - it's a must see. Oh! What the hell is with the wallpaper!?!",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "Great movie, hands up.",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "It's an ok film, the story is pretty good and quite twisted so you will get entertained till the end. Bruce willis and Lucy Liu are fun to watch. Josh Hartnett as an anti hero is convincing enough... It's a fun film to watch with your mates.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Pretty Good Movie!\nLoving the twist!\nAnyways everything just works out too good to be real!",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "My Favorite Action Film Is 1988's Die Hard.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "I actually wouldn't have been surprised to find out that this film was at least partially created by Quentin Tarantino. It's not as gory as his usual fare, but it has a lot of his usual elements in it. Outlandish situation, great and memorable characters, lots of quirky dialogues and it even has one of his trademark actor, in this case Bruce Willis, in an important side role.\n\nAnd this isn't a bad thing at all and I'm not saying that Paul McGuigan is ripping off Tarantino. Quite the opposite. It's great that there's another director out there that can produce a film of this quality and style. Because make no mistake, this is a great film. Easily one of the best I've seen in a long time.\n\nWhat captures me the most are the dialogues and the characters. The whole situation about two mobster at war with one another is nothing new, but it's taken to such extremes that it becomes something new altogether. It's something straight out of a pulp story or a comic book, but in a good way. It's outlandish enough that you can sit back and enjoy, because you don't have to treat it like it's supposed to be 100 percent accurate, but it's real enough that you remain invested in the fates of its players. The same with dialogues. Weird and odd enough to capture your attention, but also fun and quirky enough to keep that attention.\n\nThe plot is also surprising, unravels at the right pace and keeps you hooked till the very end. There are a few inconsistencies in the whole setup of two mobster silently glaring at each other across the street while their minions wage war beneath their feet, but it's nothing that would ruin the movie for you.\n\nWhat we have here is pure, undiluted fun. It's a movie of great characters, undeniable charisma and memorable scenes that all come together to form a cohesive whole. See it if you haven't already.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "A film that I enjoy watching over and over again. The start of the film is one of the best out there and the ending is one that pleases. Funny scenes among the violent and serious make this one to watch.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "A well written, well executed mystery in the vein of Kiss Kiss Bang Bang (though not nearly as funny).",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "Great cast. Lots of twists - it is, however, pretty violent. Really enjoyed the show.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Though predictable in some parts, it still delivers lots of plot twists",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "I'll start by saying the story, the twist, it's been done before, nothing new in this film, but it's rarely been told this well. Not a weak performance by anyone of the main cast and Lucy Liu actually surprised me with her acting chops.  \n\nI was put off seeing this when it came out, by friends who said it was dull, though I'm glad they didn't tell me or I simply forgot the twist.  I will add a note of caution, I could easily understand why some won't enjoy this film as much as I did, the style of the story-telling for one and the fact that the twist is well sign-posted, though it doesn't make it any less enjoyable for me.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "Entertaining as hell",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "Over the top, jumbled, and with a wise-cracking screenplay that tries way too hard",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "Plot twists all the way!  Great movie!",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "It was OK. Wasn't expecting much more really. Truly liked the twist at the end, though.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "A fast pace thriller that often has you struggling to keep as you try and figure out how everything is connected Slevin is well worth the price of admission despite having gone over without much of a fuss.\nIt deserved much more attention for it's quality writing and sleek well shot action not to mention the impressive line up of quality actors. Pairing Morgan Ben Kingsley and Morgan Freeman is enough to leave you dazzled and that's leaving out Bruce Willis who gets to play something a bit outside his usual realm.\nFor a film that revolves mainly around a case of mistaken identity the plot is not as simple as it sounds and from the very opening leaves you wondering how it's all going to work out.\nWith good action, a healthy dose of violence, and a dash of black comedy Slevin is an underrated film which doesn't disappoint and deserves more.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Very intriguing movie, requires at least 2 viewings to understand what exactly is happening. Plus Bruce Willis's character is pretty cool.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "51% favourable my ass, this movie rocks",
            "review_date": "2013-07-03",
            "source": "rt"
        },
        {
            "content": "84%\nLucky Number Slevin is over stylized, which is a reason for liking as well as ignoring this film. The acting involved is good from Willis, Josh Hartnett, Lucy Liu, Ben Kingsly and Morgan Freeman. This film is out of place for most of the time and it eventually makes some sense only in the end. Other than this, the film is just ok-ok and disposable after use!!! This film's duration is also something that I did not like much, it should have easily been made a 30 minutes short.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Loved this movie! Freakin fantastic!",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "great movie with one hell of a story of revenge and a Kansas city shuffle",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "When you see the stars and get a hint of what it is about Lucky Number Slevin seems like it could actually be really good. To be frank this film did not do it for me. It was set up to be a clever thriller/mystery with a solid starring cast. The plot was a little incomprehensible, the dialogue was unimpressive, the characters lacked depth, and at times I could not figure out if it was trying to be funny or serious. There were several cultural references such as Lil Abner, James Bond, and North by Northwest, but they were not used very effectively within the confines of the film. It seems like this is trying to be a Pulp Fiction lookalike with the same vibe as Tarrantino. Unfortunately it does not really work out so well. On a positive note I will say that the ending was decent.",
            "review_date": "2013-06-01",
            "source": "rt"
        },
        {
            "content": "Wow - this is a very cool flick. If you like twists turns, and really slick dialogue - this is your bag of fish.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "You can read my review of \"Lucky Number Slevin\" here - http://geektasticfilmreviews.blogspot.com/2012/09/lucky-number-slevin.html",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "good story and action",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "It's just God damn entertaining. Probably the only movie Josh Hartnett has done that I really like. And Bruce is Bruce. You ever heard of the Kansas City Shuffle?",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Great movie worth watching it a second time to see what you missed,",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Great flick - cannot believe that only 51% of fans liked it.  I'm usually in line with the fan reviews, not the critic reviews - I guess there is a first for everything.",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "love it, plain and simple",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "goooood action movie!",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Paul McGuigan, el director de la excelente \"Gangster No.1\", se aleja de su estilo temporal y se acerca mas a una mala imitacion de Quentin Tarantino con \"Lucky Number Slevin\".  Josh Hartnett interpreta a un joven que se encuentra en medio de una guerra de mafias, liderada por el Jefe (Morgan Freeman) y el Rabino (Ben Kingsley).  A ellos se les suma una medico forense (Lucy Liu), un asesino a sueldo (Bruce Willis) y un policia (Stanley Tucci).  Todos, a excepcion de Harnett, son muy buenos actores.  La pelicula es visualmente impactante y las sorpresas son verdaderas sorpresas.  Pero el defecto de McGuigan es la falta de construccion de personajes, cosa en la que un director como Tarantino es todo un experto.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "A movie can have enjoyable aspects, but it also needs a little thing called substance. It may try to have surprises, but they're as shallow as a self-centered person.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "I really was not expecting to like this and yet found myself  enjoying it. Lucy Liu is great in every scene she's in.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "This twist will hit you like a brick to the face! Superb film making! And Bruce Willis rocks as Goodkat!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Good movie. Not simply because of the obvious reason; Josh Hartnett, but how suitable he is for his role. This movie has an amazing story line and ending because it's unpredictable. Script in some scenes can be too long, but still acceptable. I just love how brilliant and smart both Josh Harnett & Bruce Willis planned their assassinations. I can watch this over and over again! I thought Lucy Liu & Harnett were pretty cute together too.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "This is a good all around movie. Great ending.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "I dont know how critics trashed this movie. Sure it was predictable at certain points of the movie, but it was well executed. In my opinion, the worst part of this movie was that it wasnt properly advertised. If it wasnt for IMDB, I wouldve never heard of it. In Bruge was another movie that I never heard of coming out in 2008 and turned out to be my favorite movie of that year, and Lucky Number Slevin was my favorite of 2007.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "i thought it was pretty funny, but then i like twisty stories",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "An enjoyable dark comedy that gets very dark, very quickly.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "bole la tengok kalo dah bosan sangat tak tau nak buat ape.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "woulda liked it more if I hadn't figured out the big 'twist' in the 1st 5 min of the movie.... pretty nice slick talk though.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "Awesommee movieee...nother mindhunter type movieee...u neeed to c da last scene to understand da 1st scene..",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "(rating change 4 - 3.5 just doesnt quite stand wit the fours) its certainly not perfect or mind blowing but i really do like these type of films, some may see the twists coming but i didnt and i taught josh hartnett was excellent.",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "Amazing, didn't want to see it, but a just went crazy for it and love it",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "This movie utterly and completely turned me off by the 90 murders in the first 15 minutes, including a little kid. I love how trash like this is rated \"R\" even though I think pointless violence is a lot more offensive and harmful to society than sex.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "stylish but made no sense",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Josh Hartnett totally should have gotten with Lucy Liu for reals.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Lucky number Slevin is a film which sometimes is too much of an effort. Combining a cast of Morgan Freeman and Sir Ben Kingsley it will look from a distance like a good film. But wait. It's a gangster movie. Must be even better. It has a newcomer. Great! But it isn't. A very confusing beginning sets the film up as a mystery and suspense, even though the two are different. The film is based around a classic Hitchcock plot maker, the wrong man. But it's not. Without ruining the film for you, a man is killed to make a man look like that man. The film is almost attempting to be like a Hitchcock but using New York as a setting and a horse race gone wrong. In the end the plot is quiet clever but has one of the worst most disappointing endings to a film I have ever seen. Good acting by the cast with Freeman Sir Kingsley stealing the acting credits, playing slightly different roles to their classic stereotype parts. Bruce Willis plays his gun-ho American part and Lucy Liu plays an odd role as the curious george girlfriend of the main character. Hitchcock would turn in his grave if he knew how his plot maker was being used. But I suppose for people who want an easy going film with it's up's and downs may love this film. The Rabbi and the something fighting against each other, the assassination's. It is perfect for those who like blockbuster's but with a certain point of sophistication and a decent plot.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Terrible start, such that I turned it off.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "In comparison with e.g. the new Skyfall-Bond, a ultra-high-budget-production with ultra-high-expectations, this genius thriller is head and shoulders better both concerning story and cast. The outline is brilliant, the actors, including Oscar-winners Morgan Freeman and Sir Ben Kingsley as well as Josh Hartnett and Bruce Willis, are at their personal best and even an accurate portion of humour was not missed by the fantastic screenwriters and at last Paul McGuigan, the divine director of this great masterpiece of modern cinema.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "Me rei mucho con los ingeniosos dialogos, muy bien trabajado el guión, con buenas vueltas de tuerca. Muy entretenida y buen reparto.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Ending was awesome, Lucy liu was annoying....",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "Lucky Number Slevin is a smart and thrilling noir crime drama.  After falling victim to a case of mistaken identity, Slevin gets caught up in a rivalry between two competing New York crime lords.  The cast is impressive, featuring strong performances from Josh Hartnett, Lucy Liu, Morgan Freeman, and Bruce Willis.  The storytelling is also especially good, and does a brilliant job building intrigue and unfolding the mystery as to who Slevin is and why he's being sought after.  However, the dialog is a bit too clever for its own good and comes off as a bit rehearsed and artificial.  Lucky Number Slevin has some rough edges, but it's entertaining and has a compelling story that's full of mystery.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Highly underrated movie.love it.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "A lot of fun and definitely worth your time. The development of Josh Hartnett's character ultimately proves to be the driving force behind the film.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "this movie is so good",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Some great twists and turns and some really awesome action.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "A better play than a movie. Overwritten and predictable only because you over think to understand what's going on. And there all the pieces unravel and the movie has to catch up to your intelligence. Oh no, now the movie has me talking like it too!",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Good twists and turns...funny and dark.. Overall enjoyable",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Slick.  Gotta love Ben Kingsley.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "are you familliar with the shmoo?",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Contrary to the critics I thought this was a brillant movie. The plot kept me thinking. Good acting from a marvelous cast. Check it out.",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "This movie has great action, great suspense, great acting, great story, a killer cast, and it just a great movie mystery movie. It's also has it's cute points with being a little bit romantic-comedy like. One of my favorite movies. I heard it's a lot like the Usual Suspects, even though I've never seen that one.",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "This wa a really godd film with a great cast. The storyline was amazing and it had a really good ending. It was well worth watching and Bruce Willis was excellent. If you haven't seen it give it a watch.",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "I am at a complete loss as to why so many critics dislike this film. I think it's brilliant and was well executed by all who were involved in this film. \n\nStamp of Judgement: Badass",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "this os a good action movie with quite a twist. i recomend that everyone should watch this mvie.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "A friend of mine had me watch it and Im glad it was a really good movie!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "I love you Lucy Liu!",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "i loved ygis movie funny action packed and a predictable but good story. over all enjoyed it",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Thought it was one of those boring mistaken identity - but turns out to be quite a brillant gem. Josh steals the show.",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "pretty good very twisty",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Pretty good storyline, loved the clipped Flim Noir style of dialogue",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Took a little to get started but was good in the end.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "by far my fav. movie of all time!!!",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Ace story, really good, kept you going all the way through",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Extremely good fun, quirky with sharp, too-clever-for-its-own-good dialogue. Some of the twists and edits  don't work too well, with some of the pay-off's seemingly out of place,  but there are so many strands to this  that it doesn't really matter and won't detract from what is arguably one of the finest crime thrillers of recent years.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Horrid wall paper, wonderful movie.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "A great flick. I really enjoyed this film. It was such a good story! I was so taken back by the turn around in the film. i loved it.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "love a good twist....",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "I know it's v old and heard many good things about this movie, but just got the chance to see it today..Loved the story and plot...interesting and should keep awake to understand :)",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Not bad. Good stuff.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "All time favorite movie!!!",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "This movie was okay.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "Two Words: Bad Ass.\nOne of my new favorite movies. Good plot. and Josh Hartnett really surprised me in this movie.",
            "review_date": "2012-12-15",
            "source": "rt"
        }
    ]
}