{
    "rating": 4.4,
    "release_date": "2006-08-18",
    "num_reviews": 190,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Two sibling cosmetics heiresses (Hilary Duff, Haylie Duff) must grow up quickly when a company scandal leaves them penniless. Though it is tempting to follow the advice of their board of directors and sell out to their biggest competitor, the gals decide to take matters into their own hands and save the company that their father built from scratch.",
    "reviews": [
        {
            "content": "Seemingly another of those vanity projects whereas the story isn't primary nor secondary focus, only the leading stars define what the film is, and their charm fails against their thin communicative storytelling which turned out blandly empty with zero interests to the point it would be surprising if its target audience actually find some sort of enjoyment. (D)",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilary and Haylie Duff go on a hunt to find the truth to their company of beauty. The characters the Duff girls play are rich socialites to bid poor and brings out the best in them with becoming closer to the people in the lower class to them when they were rich socialites and belonging to a new world they did not grow up in.",
            "review_date": "2020-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good movie to watch",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even the gr8 director Martha Coolidge (Valley Girl) can't save this hot mess",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I tell people that I watch any type of film, I really do mean it. Though I am a guy, I'm certainly not above watching chick flicks. However, that being said, chick flicks have also given me some of the worst film-watching experiences I've ever had that still scar me years after watching them. Sometimes I even shudder as I recall the experiences of watching them.\n\nI know there are female viewers that try to say that these films are escapist entertainment, much like what us guys watch when it comes to action films or gross out comedies, but even the stupidest of those films still have some level of respect for their viewers, even if it is rather minimal at times. With a film like Material Girls, it has no respect for its viewers. It views its audience as a bunch of prissy, whiny, stupid, glamor-obsessed girls with roughly the same brain cell count as a cardboard box, while throwing in a half-assed moral message that means nothing in the end.\n\nIt's a film that thinks if it sticks popular (At the time, of course) preteen icons for girls into a film, fashion, annoying pop music, romantic cliches so lazy you'll want to vomit, pop culture references, and a gamut of other things that plague chick flicks, that it can just get away with being a piece of shit because of its \"target audience\" which is quite shameful. Oh no, Material Girls, I'm not letting you get away.\n\nSisters Tanzie and Ava (Real-life sisters, Hilary and Haylie Duff) are two rich girls who spend all their time partying and shopping, as they inherited their late father's cosmetics company, even though they do nothing to help run it. They are simply riding on the cash flow from the company.\n\nBut, Tanzie still dearly misses her father, even watching an old TiVo recording of him promoting his cosmetics every now and then and refusing to erase it, despite pressures from her sister to do so.\n\nBut one day, their lives are turned upside down when a tabloid program claims that the company's cosmetic products cause terrible skin conditions, threatening to destroy the company, causing their assets to be frozen, having an angry mob after them, and losing all of their so-called \"friends\" in the process.\n\nWhile at home in their mansion, with an angry mob outside their gates, a fire is accidentally started, burning down their mansion and forcing them to stay with their maid, since their credit cards are no longer active and they can't stay anywhere else. They are now homeless, broke, jobless, and completely clueless as they have no idea how the outside works from their insular rich bubble of a world.\n\nBut, there is a ray of hope for the girls when a rival cosmetics company offers to buy their company for several million dollars. But, Tanzie refuses the deal, and decides to start an investigation into what is really going on at their company since she believes that they were framed, resulting in a series of supposed-to-be-funny shenanigans along the way as they investigate.\n\nI do enjoy a good comedy about high society or takedowns of rich people (Including celebrities), but Material Girls is horribly dissatisfying in its storytelling. Even by the most minimum standards of chick flicks, this storyline is vacant and hollow, doing only the bare minimum to have a story and one-note characters so that it can be considered a film. There was absolutely no effort or care put into the storyline. This is easily one of the most lazily-written films I've ever seen. The average viewer, even if they possess no writing abilities of any sort, could write a script that would look Oscar-worthy in comparison to this script.\n\nThe two lead characters are nothing but two spoiled, bratty bitches, while the Tanzie character only has the minute elements of being a semi good girl sort of character who is also slightly smarter than her very dim-witted sister, Ava. I never rooted for them and I never cared, even when their characters seemed to become smarter and learned how to be semi-normal people.\n\nEven with cast members like Anjelica Huston and Brent Spiner (Who also appeared in another horrible comedy, The Master Of Disguise. Were things really so bad after they stopped making Star Trek films for awhile?), the script does absolutely nothing with them, outside of simple caricatures, being possible lame villains, or red herrings in the story's abominable insertion of mystery elements that makes even the most generic of mystery films look masterful by comparison.\n\nIt also has absolutely nothing insightful to say about rich people, high society, regular life, clearing one's name from a false accusation, or anything all together. It's all about following two air-headed tarts who aren't even funny or interesting air-headed tarts (I should have Romy And Michele's High School Reunion again instead. Now that was a funny film about air-headed tarts).\n\nThe acting is horrible across the board. As much as I disliked A Cinderella Story, in which Hilary Duff was the lead star, I felt that she gave a good performance in that film and showed signs of being far more capable than what that film would lead the viewer to believe. Unfortunately, that aura is definitely not present in this film. Here, Hilary Duff is just annoying, though at least she's more tolerable than her sister. I'm not sure what sort of acting abilities Haylie Duff might possess, but she was beyond bad in this film. Together, they're both just annoying tarts that began to grate on my nerves within less than two minutes of watching this abomination.\n\nAnjelica Huston is shamefully wasted and her presence is practically nonexistent, though she is probably the best actress of the bunch by doing another bitchy sort of performance, which was mildly entertaining at times. No other cast members are worth noting, other than expressing sadness over seeing the decline of Brent Spiner's career.\n\nEntertainment? What entertainment? This film is so hollow and vacant, that even viewers with the most minimum standards for chick flicks will be hard-pressed to find anything of value in this film. It has only the most shallow elements of storytelling, characters so one-dimensional they are one step away from just being cardboard cutouts, horrible and unfunny jokes, and horrible acting. There is nothing to derive from this film other than brief moments of Anjelica Huston's performance which can be momentarily entertaining to watch.\n\nHumor? Are you fucking kidding me? For comedies I usually try to have an extra paragraph to dedicate to humor, but there is not one positive thing that I can say about the humor. There are no funny parts.\n\nMaterial Girls is a horrible film that has only a single redeeming quality thanks only to Anjelica Huston's performance. Other than her, there is nothing of value to find, even if you have even the most shallow of standards for this type of film. Avoid it at all costs if you want to keep your sanity intact.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty bad.......",
            "review_date": "2015-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BOTH DUFF SISTERS??? How could you go wrong?",
            "review_date": "2015-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best movie i've seen but it wasnt terrible",
            "review_date": "2015-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Material Girls isn't cinematic genius, but it's a nice try for the Duff sisters who have a great screen presence.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really enjoyed this movie great we chick flick :)",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like the song from the film and her sister too, this movie is okay but its wasn't great after all",
            "review_date": "2013-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly enough, if this movie had been the sad ripoff of Mean Girls I expected it to be, it would have been better. It tries way too hard to be more mature and witty than it is, and the acting is completely juvenile. With different actors and better production it could possibly have been half decent, but really there wasn't much hope for it right from the start.",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was good ultimate chick flick but still good. :P",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't see it all the way through, but I think it was alright.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good, but come on... Hilary duff's character is supposed to be a girl whos an heirest, but wants to become a chemistry major. kinda lame. But, other than that its good",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absoultley HORRIBLE.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a way funny show!",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice interpretation of life. In life, we are who we chose to be. We can choose to have life just like Norman did or chose to have a life to become a sinner. But in the end, we are loved.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was ok, but not much originality in the story. I liked it cos of the two sisters working together and being so close. I don't hav a sister and always wish I had one...",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was real funny and had a great moral",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man, the things you are willing to watch for your girlfriend.",
            "review_date": "2012-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious!!! Keeps u on they edge of ur seat",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I watched this twice",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly glossy and plastic, this riches-to-rags story doesn't even try to make an effort. Okay as a one time watch but you're not going to be recommending it to anyone.",
            "review_date": "2012-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didnt really like it.. expected it to be better ..",
            "review_date": "2012-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haylie and Hilary Duff are hot, sexy babes!",
            "review_date": "2012-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked!!!",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay movie, overly hyped...",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Always thought this was Hilary's worst film. I saw it in theatres and got out on dvd once or twice( for some reason). Too much superficial junk and some slight sexuality which was disappointing (mostly from Hilary's sister in the film though). I used to be crazy about Hilary, so I had to watch it. The only films I weren't ever interested in watching with her in them were the cheaper by the dozen ones, as they looked ridiculous and I HATE Steve Martin. The acting was shoddy and Hilary was so unlikable...urgh",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "disappointing especially since  i love hilary duff",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to add this movie to  my own collections.",
            "review_date": "2012-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoiled, rich girls.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sometimes family shouldnt work with each other. On this one, just that. Great story - about slow at times. But I loved it",
            "review_date": "2012-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie teaches a lesson",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good. I like seeing the Duff sister work together as sister. I guess maybe it can be confusing until the end but its a good mystery",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though some people will be excited by the appearance of Hilary and Haylie Duff in this movie and it has a great supporting cast headed by Lukas Haas, Anjelica Huston and Brent Spinner, Material Girls ultimately has a potential idea and story, but becomes a bad movie thanks to it's weak script.",
            "review_date": "2012-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a watchable movie I have to say, but it could be better and I agree that it's definitely a Duff movie as other critics say.",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hilary duff is awsome in this movie",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny at times but I feel like the story has been done in too many ways too many times.",
            "review_date": "2012-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "almost blew my 14 year old brains out on this date night.",
            "review_date": "2012-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilary and Haylie are beginning to grow on me, but one thing ive learned is the 2 bring each other down when making a movie together. This is a simple cause of too much of so little effort.\nSomething about this film reminded me of the \"simple life\" with Paris and Nicky but then some Erin Brockavich to add excitement.. more like stolen ideas with no brainer thought towards the character, Could this movie not branch out and find it's orginal style?",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Movie!  I think Haylie and Hilary were both just perfect in this movie and they are good Actresses!!!",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was alright, i though there would be more of a focus on their actual poorness and how they over come it instead of the whole detective situation. some parts should of just been cut out or made shorted because it was repetitive and boring!",
            "review_date": "2012-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny. I am a fan of the Hilary Duff films, I must say.",
            "review_date": "2012-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a great movie, but better than I expected. Somewhat predictable, but still had it's funny parts",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do like myself a good Hilary Duff movie, but this is NOT one of them. It's quite painful to sit through. For a romantic comedy it isnt very funny or romantic.",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was the best movie that i have seen",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a film, Material Girls fails to live up to even the limited corporeal goals of its title.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they learned how it feels to have all the power in your hands by having money to losing everything because of a lie...",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't even make it through. Just so...disappointing.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was quite interesting, but i dont think id watch it again",
            "review_date": "2012-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilary Duff is a decent actor, she's not bad. She has proven that she is worthy of better things. This is not one of them. Material Girls is one of the dumbest films you could ask for. We get some good actors, but they aren't in the film for a long time. The story is cliche' and predictable. The dialogue needs a lot of work becaues it seems as if it was rushed. The characters here are nothing near interesting and you don't care much about them. When they develop, there's nothing there that works. I think that the little girls that enjoy watching Hannah Montana should have fun with this, but everyone else will hate it very much.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really cool. When two spoiled brats get cut off from their fortune, they work together and get a taste of reality.",
            "review_date": "2012-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ugh! bad bad bad... half a star cuz at least there was a semi cute guy in it :P",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good girls day out movie!",
            "review_date": "2012-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Duff...  Sisters Rule!!  Big fan.  Movie was only okay though.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "come on Hilary! I know your better than theses Disney channel crappy heaps. the only thing this movie has going for it is the two diff sisters acting extremely badly with each other",
            "review_date": "2012-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was better than I thought it would be... It was really pretty interesting.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "different plot line but ended very well and with a twist",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not really worth seeing. the acting was horrible.",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was pretty good.....better than i thought",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny and heartwarming",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen it, love it no matter what any one says about the movie I thought it was great, go hilary and haylie!",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen it, love it no matter what any one says about the movie I thought it was great, go hilary and haylie!",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute movie, much better than I thought it would be.  Almost like Legally Blonde!",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just another chic flick movie.",
            "review_date": "2012-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10% cause the site won't let me go any lower.",
            "review_date": "2012-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superficial and boring.",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was an okay movie if u actually think about it it was crappyish very basic plot",
            "review_date": "2012-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny comedy! Two rich girls become normal citizens! Expect much hunor from two perfect girls!",
            "review_date": "2012-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Girly Girl Chick Flick if you ask me",
            "review_date": "2012-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty common story line . But good acting :)",
            "review_date": "2012-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I looovvvveeee this movie, hilary is my fave!",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being a hardcore Hilary Duff fan for about 2.5 years, I somehow missed this movie when it came out.  When I saw it on the cheap at a yard sale, I decided to pick it up; I figured it would be easy, lighthearted entertainment for car trips.  I started it about a month or so ago, and finished it tonight; you may think I wouldn't remember what happened during my first viewing, but not only do I not find any entertainment forgettable, this movie didn't have anything close to a convoluted plot.  So, what did I think of the actual movie? It was good in some ways, and not in others.  The plot was cute, and the ending was a bit of a surprise.  The actors did a great job, and it was awesome to see \"Star Trek: The Next Generation\" alum Brent Spiner play someone/something other than Data the humanoid android.  However, a higher use of profanity than I was expecting, as well as some crude remarks and immodest outfits, threw some serious grime into the mix.  One scene where Hilary Duff's character attempts to seduce a night watchman, and is thought to be a prostitute because of her skimpy outfit, was quite egregious for a film of this nature.  For those reasons, I couldn't recommend this to anyone under ten, no matter how much he/she likes \"Lizzie McGuire\".  Even for older moviegoers, this is something that is only worth a rental; unless you're a die-hard fan of one or both of the Duff sisters, or \"Addams Family\" star Anjelica Hutson, this probably isn't something you'll pop in again and again.  In short: If you're over ten and looking for a cutesy, silly comedy/mystery that doesn't involve a murder, then this one is for you.",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both terrible copies to Regina George.",
            "review_date": "2011-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually liked this movie! Pretty good if you ask me!",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fans of Duff and tweens everywhere can rejoice while everyone else is left to drool in their bordom.",
            "review_date": "2011-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only material in me was a bullet in my head when I shot myself multiple times while watching this movie",
            "review_date": "2011-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "eh it was alot like Cow-belles, except not as good. but the romance worked-ish =PP",
            "review_date": "2011-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find this very lovely",
            "review_date": "2011-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a cute movie",
            "review_date": "2011-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This hilarious, heart-felt film staring the ever-talented Duff sisters is one of my favourites. A great movie overall; plot, actors/actresses, script, ect.",
            "review_date": "2011-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did I watch this...?",
            "review_date": "2011-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The poster made the movie look creepy, like a \"What is Hilary staring at? Why aren't they dressed for the poorhouse? And who the hell made the poster look like they're sitting in a glass dome instead of waiting for the bus?\" kind of creepy...the movie, on the other hand, is a bland \"rich-girl-gone-poor\" story done millions of times.",
            "review_date": "2011-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fans of Duff and tweens everywhere can rejoice while everyone else is left to drool in their bordom.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like Cow Belles, this movie stars two sisters, one of whom was made famous by the Disney Channel. Both of these Disney girls have branched out into music (and I like both of them {for their acting and music} - for those who haven't seen Cow Belles, I'm talking about Alison Michalka of Aly & AJ). Cow Belles is a sweet little movie in which two little rich girls lose their fortune and have to work in a factory to learn the value of money and friendship. Material Girls is the same movie basically, only not as sweet. Same plot, same type of characters, same moral. Nothing original here - almost a complete copy except in one, the father is alive and in this one, the father is dead. Both movies came out in 2006... I guess the saying is true: there is nothing new under the sun. Here, the acting is decent; the girls look great... worth a look, but keep your expectations toned down. \r\n\r\nYou wrote this on 10/3/08.",
            "review_date": "2011-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a little ridiculous. Just, the story of it. Hilary and Haylie are very beautiful, and work well together, of course, but... it was just too cutsie and like I said, ridiculous.",
            "review_date": "2011-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was a tween when I watched this, so I liked it more then than I realise I do now. I wouldn't say it was a disastourous film but it wasn't one of Hilary Duff's best. It's your average chick flick although does educate you on how money isn't everything and the people in your life are much more important and worth more than money ever will be.",
            "review_date": "2011-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true Teenage Girl Chick Flick, but not Bad",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From riches to Rags, feel good chick flick",
            "review_date": "2011-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Agonizing in every sense of the word.",
            "review_date": "2011-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was okay! Nothing to write home about!",
            "review_date": "2011-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok story line; horrible acting.",
            "review_date": "2011-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not as terrible as its reputation implies it to be, I laughed -- at it's overall concept.",
            "review_date": "2011-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ava and Tanzie Marchetta have it all. The heiresses to a multi-million dollar cosmetics company, the girls approach life as one big party.",
            "review_date": "2011-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I spend time watching this.",
            "review_date": "2011-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Material Girls serves nothing more than another movie for Duff fans. For the non-fans? It's trash complete with helium voices.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny and the guys are hot",
            "review_date": "2011-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Material Girls is a disappointing film. Hilary and Haylie Duff did what they could with what they were given. The script is boring and terrible. Martha Coolidge did her best at trying to make this movie work. I was not impressed with this motion picture. I also would not recommend this movie.",
            "review_date": "2010-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched this movie three times, It is one of those movies that gets boring after a while but I thought it was good. I loved the romance that both girls Ava (Haylie Duff) and Tanzie (Hilary Duff) had with the men in the film. It is a good film to watch when you're bored.",
            "review_date": "2010-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awwwww....i thought dat it was nice.....but good 4passing boring time n also 4sleeping.....",
            "review_date": "2010-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, funny parts to it",
            "review_date": "2010-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've seen.",
            "review_date": "2010-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yep we would all expect this was going to happen. First of all Haylie actually acts better than Hilary and it isn't even got diddily squad behind it",
            "review_date": "2010-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chick flick great!!! Not much of the story to look at but fun to watch!",
            "review_date": "2010-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved Hilary Duff when this came out. For whatever reason it took me nearly 7.5 years to watch it. I regret watching this so much.",
            "review_date": "2010-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great teen chick flicj",
            "review_date": "2010-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a complete chick flick....:D",
            "review_date": "2010-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half a star... I coudn't put no stars on it.",
            "review_date": "2010-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVE THIS MOVIE SO MUCH I ALSO HAVE IT ON DVD!!!!!!!!!!!!!!!",
            "review_date": "2010-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie made me wanna get a shotgun so this would end",
            "review_date": "2010-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love Hilary duff but i hated this movie it was so boring",
            "review_date": "2010-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love\n\n\nHilary Duff, Haylie Duff,",
            "review_date": "2010-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does anybody ever like Hilary Duff movies? Not that I know of.",
            "review_date": "2010-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Materials Girls\" is about these 2 girls and there rich,but then there broke and they could just sell the company,but they don't so they have to get jobs to get money.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great and fun movie! love it!",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't as good as I suspected it to be but it was a laugh through-it movie.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really good kind of a rehash of the Olson twins movies",
            "review_date": "2010-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was too predictable...but overall ok i guess.",
            "review_date": "2010-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked it, it seems a bit like The Simple Life (you know Nicole Richie and Paris Hilton)",
            "review_date": "2010-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my God, this movie was so stupid! It was so predictable and utterly cliche, I can't believe I wasted my time watching this!",
            "review_date": "2010-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Obviously she took the recipe to a higher level.",
            "review_date": "2010-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a complete mess,from beginning to end.",
            "review_date": "2010-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lame plot, lame characterisation- -  the girls are really bi-polar and is just a really bad film overall--- although a few chuckles here and there- that's about it...",
            "review_date": "2010-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was weak all over.  1not a good plot 2 not good acting.",
            "review_date": "2010-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "shockingly horrible.",
            "review_date": "2010-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was pretty great.",
            "review_date": "2010-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not great, in-between all the cringe worthy girly mess there was a good message, but I just found it really predictable. Not one I would bother to recommend!",
            "review_date": "2010-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Judge \"What's your defense\"\n\nLawyer \"My client was bad, but at least he/she didn't make Material Girls\"\n\nJudge \"True...\"",
            "review_date": "2010-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could have been better",
            "review_date": "2010-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sigh 4%?\r\n\r\nLove Hillary ,Loved the movie.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love this movie... you can learn a lesson and probably other things 2",
            "review_date": "2010-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i had very low expectations for this movie, but in the end i could say it was good and i liked it, there were some cute parts in it.",
            "review_date": "2010-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To what standards are you comparing this movie? It is obviously aimed for the pre-teen and young teen audiences. It is not meant to mesmerize you with spectacular cinematography or special effects. In fact, I'm sure most if not all of the low ratings here are from people who are too old to enjoy this kind of movie. I am almost 18, and though I haven't seen this movie in a while, I remember enjoying it when it first came out. I might have a different opinion of it if I was to watch it now, but I don't think it is necessary to do that. Who cares if I would think less of it now? I enjoyed it when I was at the right age to see it.",
            "review_date": "2010-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun movie and the Duff sisters are pretty.",
            "review_date": "2010-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is funny and sweet.  Terrific feel-good flick for teenage girls, as long as they have involved parents who can reinforce that money isn't everything.",
            "review_date": "2010-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun movie, and the idea was nice.",
            "review_date": "2010-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot centers around Marchetta sisters Tanzie (Hilary Duff) and Ava (Haylie Duff), a pair of rich, spoiled Hollywood socialites living in Los Angeles who enjoy material things such as shopping and dating rather than caring about their late father's cosmetics company(Estee Lauder). When a major media scandal involving one of the company's products turns into an investigation, the girls find their assets frozen and must adjust to life without their fortune. Just when it seems like things couldn't get any worse, disaster strikes again. When a fire starts in their home, Ava quickly takes all her clothes while Tanzie, caring about her father more, takes her dad's TiVo and some clothes. They are tempted to listen to their advisors and sell the company to their biggest competitor Fabiella for just- \"only\" as they say- over $60 million each. While this means that they could return to the lifestyle that they were accustomed to, nonetheless they decide to honor their father's memory by trying to turn it around themselves. Finding inspiration in Erin Brockovich, the girls decide to get to the root of the scandal. In the end, the girls successfully manage to clear the Marchetta name and reclaim the company. Nearly six months after the scandal began, the girls are seen leading the company, with Ava as the CEO and Tanzie working as a lab technician & snaring a boyfriend.",
            "review_date": "2010-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this cute movie!!!",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought hillary could have done better work, but still, SUCH a good movie.",
            "review_date": "2010-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really boring... and bad.",
            "review_date": "2010-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing special... girl flick movie.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AHHHHHHHHHHHHHHHHHHHHHHHHHH LOVE THIS MOVIE LUV HILARY ND HAYLIE DUFf.I luv both of dem but i think haylie both is lil more prettier than hilary.still i luv both of dem in the movie nd luv dis movi!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2010-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really funny film and Hilary and Haylie are great actresses, and since they are also sisters in real life their on-screen chemistry really shows in the film. I love it!",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "im ashamed with myself for liking this movie",
            "review_date": "2009-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have this Dvd: I love this shows, greats, funny, laugh, etc.. :D",
            "review_date": "2009-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny but not hilarious and the plot has been used time and time again.",
            "review_date": "2009-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was hilarious! the duff sisters play well together and the plot is well thought out, if predictable...\nfunny dialogues!\nhilarious to see the spin on these truly \"material\" girls out in the \"real world\"!",
            "review_date": "2009-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was OK..but i've seen better acting by the Olsens",
            "review_date": "2009-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brainless, slow, and boring",
            "review_date": "2009-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HORRIBLE!!! the only good thing...Hillary Duff and even that isn't that good!!",
            "review_date": "2009-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not bad... girl power!!!",
            "review_date": "2009-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "everything didn't match up together nicely. lots of little things that didn't make sense.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Duff sisters were outstanding!",
            "review_date": "2009-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I walked out of the theater. This is HORRID.",
            "review_date": "2009-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the too long face of Haylie Duff makes me scared :|:|:| and she acts like an amateur.",
            "review_date": "2009-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No! No no no! Such a bad movie. So cheesy, and not in a good way.",
            "review_date": "2009-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That movie is SO funny! I remember one Christmas that i got that movie and i screamed my head off! I was so excited!",
            "review_date": "2009-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ladies night out film...",
            "review_date": "2009-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot centers around Marchetta sisters Tanzie (Hilary Duff) and Ava (Haylie Duff), a pair of rich, spoiled socialites who enjoy material things such as shopping and dating rather than caring about their late father's cosmetics company. When a scandal involving one of the company's products turns into an investigation, the girls find their assets frozen and must adjust to life without their fortune. Just when it seems like things couldn't get any worse, disaster strikes again. When a fire starts in their home, Ava quickly takes all her clothes while Tanzie, caring about her father more, takes her dad's TiVo and some clothes. They are tempted to listen to their advisors and sell the company to their biggest competitor Fabiella for just over $16 million each. While this means that they could return to the lifestyle that they were accustomed to, nonetheless they decide to honor their father's memory by trying to turn it around themselves. Finding inspiration in Erin Brockovich, the girls decide to get to the root of the scandal. In the end, the girls successfully manage to clear the Marchetta name and reclaim the company. Nearly six months after the scandal began, the girls are seen leading the company, with Ava as the CEO and Tanzie working as a lab technician.",
            "review_date": "2009-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "omg hilary and haylie its amazing",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilary Duff is a decent actor, she's not bad. She has proven that she is worthy of better things. This is not one of them. Material Girls is one of the dumbest films you could ask for. We get some good actors, but they aren't in the film for a long time. The story is cliche' and predictable. The dialogue needs a lot of work becaues it seems as if it was rushed. The characters here are nothing near interesting and you don't care much about them. When they develop, there's nothing there that works. I think that the little girls that enjoy watching Hannah Montana should have fun with this, but everyone else will hate it very much.",
            "review_date": "2009-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So boring and clueless...",
            "review_date": "2009-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "biggest crap ever seen in this genre (which is quite hard)",
            "review_date": "2009-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has Hilary Duff in it, which is good. The rest of the film is just a cliched mess. The two rich girls experiencing poor life is ridiculous, as they act like aliens, being unable to communicate or function in the outside world. These acts of \"humour\" just get more and more ridiculous to the point of sighs and groans. There's also a lot of misjudged editing techniques, such as, some of the most pointless split-screen action around. It's bubbly, cute and probably fun for it's target audience, but it has a very short shelf life.",
            "review_date": "2009-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only part I liked was when Joel and Benji Madden steal their car.",
            "review_date": "2009-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just for the stoopid dance that hillary does it gets a extra half mark",
            "review_date": "2009-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible.. I didn't even finish watching it all.",
            "review_date": "2009-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was good.",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's a dam good movie with the sisters duff",
            "review_date": "2009-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so awful... must sever own head... must forget the awfulness... GAHH!",
            "review_date": "2009-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I THINK THE DUFF SISTERS DID A GOOD JOB, IT WAS HILARIOUS",
            "review_date": "2009-08-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}