{
    "rating": 3.9,
    "release_date": "2006-03-10",
    "num_reviews": 50,
    "genres": [
        "Kids&family",
        "Comedy"
    ],
    "summary": "Deputy District Attorney Dave Douglas (Tim Allen) is a workaholic and frequently puts his job before his family. After taking on a case involving an animal laboratory, he becomes infected with a top-secret serum that transforms him into a dog. Life as a canine gives Dave new perspective on the importance of family, but before he can make things right with his wife and kids, he must sniff out the villains responsible for the serum.",
    "reviews": [
        {
            "content": "F**k this sh*t!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Good idea, bad execution",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "I rate this so high ONLY for the sake of my kids. Amazing and fun to watch with your children, but that's as far as it goes. As a whole, I'd probably give it 2 stars, weak story and a lot of cringe and hollow acting, the effects were sub-par at best. Several annoying plot holes.\n\nHowever, if you just want to watch a fun dog movie with your kids, it's great for the mindless and silly humor that's fun for the family.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Not funny Tim Allen go back to Santa clause",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "The most absurd thing about this is that Akon did a song for it.\n\nThis 2006 remake of 1959's 'The Shaggy Dog' is very bad. That's thanks to some lazy writing and humour, none of the jokes land while the plot - while I praise them for changing up the original - is so lame - their thinking seemingly just stopped at 'man acts like dog' and thought that'll do.\n\nAnother thing that hampers the film is the attempt at a heartwarming story with the main family, which is nauseating to see unfold. There's also a scene at the end where the dad (Allen) is stark naked in public and in front of his children, who have literally zero reaction and just stand there smiling ...\n\nWith that noted, I will say I didn't hate watching this. Tim Allen, whilst over-the-top and in your face at times, is a good cast to play this silly role - he stops the character of Dave becoming annoying, he's just cringey to me.\n\nThe casting is, actually, pretty good. Robert Downey Jr. and Danny Glover are involved, as are recognisable faces Spencer Breslin, Shawn Pyfrom, Philip Baker Hall and Joel David Moore. Rhea Seehorn, star of 'Better Call Saul', also appears - you could make a case that this is a prequel to BCS ...\n\nI have no idea why they decided to remake this, especially given they seemingly didn't put any serious effort into it. It's weird, cringe, dull and entirely forgettable. A poor film.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "It was funny as a kid, but it doesn't hold up to Disney standards, or even film standards, today.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "While cute and fun at times, it is pretty slow at first and it just all seems so slopped together. It seems like it would be a TV or straight to video movie, but somehow it made it to the big screen. I may be underestimating the budget slightly. It has a nostalgic mid-2000s vibe, but it is nothing remarkable.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Its humor is enough to make children entertained, but its derivative and uninspired story don't make it recommendable enough for adults.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "I don't know what's worst:\n\nThe nightmarish poster or Downey Jr. acting like a dog.",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "That movie is worse than \"An American Werewolf In London\".",
            "review_date": "2018-11-22",
            "source": "rt"
        },
        {
            "content": "I remember watching the original Fred MacMurray version of The Shaggy Dog and I always thought it was one of Disney’s lesser live-action classics. So revisiting that concept with Tim Allen in the lead role doesn’t seem like a great idea. This movie’s attempt at comedy always revolves around a man doing things like a dog, and it is never funny. Aside from the transforming into a dog part, the heart of the story is so clichéd that I’m not sure anyone actually wrote it or if they just copy-and-pasted from one of a hundred other Disney movies. “Dad’s too involved with his job, and is neglecting his family...will he ever wake up and see what he’s missing?” I’m sure you can write the rest yourself. The idea that the original dog in this movie is some kind of magical being that can be used to prolong life is already ludicrous, but then they double down by making it so he turns people into weredogs when they are bit. But all kinds of stupid ideas are taken in stride by the characters in this movie. People take the idea of Tim Allen’s character turning into a dog as if it makes perfect sense after the initial shock, and the fact that he continues to struggle with just telling people about it is frustrating. In fact the entire movie is frustration because so many plot lines could be resolved in seconds with a simple conversation but instead they take the most convoluted steps to make the movie feature length. The Shaggy Dog is what you get when lazy people start making movies without intention or purpose. It’s as if they just took a look at Disney’s catalogue of classics, looked for which one they could remake next, and didn’t put even an ounce of thought into a way of making it new or interesting. I cannot express this enough...there is nothing of value in The Shaggy Dog. It is not funny, it is not thought-provoking, it is not well-acted, and it is not entertaining in any way. Children might become dumber after watching this movie, so just avoid it like the plague.",
            "review_date": "2018-07-06",
            "source": "rt"
        },
        {
            "content": "Start laughing I remember watching this movie. Tim Allen is hilarious good movie show your kids ",
            "review_date": "2018-06-26",
            "source": "rt"
        },
        {
            "content": "Really not bad, pretty fun family film.",
            "review_date": "2018-06-13",
            "source": "rt"
        },
        {
            "content": "10/7/2017: Meh. A good cast, but very few funny moments.",
            "review_date": "2017-10-07",
            "source": "rt"
        },
        {
            "content": "Sure is silly and bad, but it's one of those movies that so bad that it's good because it's completely hilarious and stupid",
            "review_date": "2017-02-15",
            "source": "rt"
        },
        {
            "content": "The Shaggy Dog is purely fluff and fun for the kids, and is tolerate enough for the adults.",
            "review_date": "2016-08-11",
            "source": "rt"
        },
        {
            "content": "Shaggy Dog is a great Disney movie. Tim Allen portrays the role of a half human-half dog perfectly. This movie is hilarious and heartwarming. I would suggest this movie.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "Shaggy Doggy Dog is not Dogs.",
            "review_date": "2016-03-15",
            "source": "rt"
        },
        {
            "content": "I was under ten when I first watched this and I loved it, I know it's stupid and terrible now, but I can still enjoy it and relive the good old days.",
            "review_date": "2016-02-11",
            "source": "rt"
        },
        {
            "content": "it fact Dat dis is most pirfect movee of all Tim. if u donut agri wit me den u r a gey nigger fegget Dat no nutin.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "What happened with Tim Allen doing all these crappy Disney kids movies (excluding the first Santa Clause)? This movie had moments, to be honest, but overall it's a really stupid kids film. It was at least entertaining in some parts but if really felt cliÃ?ed and honestly the dog transformation thing was so stupid that it confused me. If you have really young kids then maybe watch this but really not worth your time, not even if it's just on TV.",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "Not a huge fan but Allen does have some charm in this movie but just nowhere near enough.",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "This movie was pretty fun film for the whole family!",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "Its a well-intentioned movie for sure that makes no use of the creative Disney team behind it.\n\nThe kiddos will love it though.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "no Tim Allen no the genius from toy story and the Santa clause accepts this piece of crap I remember this movie being so unmemorable in one ear out the other stupid plot horrible acting Tim was OK not enough to save this pointless movie this movie is a shaggy fraud",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Allen knows how to embrace his character as a real doggy! =D",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "The second best disney movie after wreck it Ralph. Tim Allen is a great actor and a great awesome dog. Woof woof. It's a classic.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "I liked this movie as a kid but mainly because I liked the original Disney version of Shaggy Dog and Tim Allen was my favorite actor at the time. Looking back at it now, this isn't really that good a movie. Nothing terrible and kids might like it but if you don't have kids who are interested in this movie, I wouldn't recommend this movie.",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "The Shaggy Dog is a poorly made, annoyingly written piece of work that confirmed Allen's sunken career when it came out. It's just another throwaway Disney flick.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "This movie. This fucking movie. Fuck this movie.\n\nSo it's a remake of some 1957 movie, which I'm assuming was good. This movie was not.\n\nThe plot is convoluted as shit. Basically, there's some magically dog, living with some monks in Tibet, and it's been alive for 300 years. Bad guy, Robert Downey Jr. (doing his best Tony Stark), is the second in command of evil co (the real name escapes me) that kidnaps the dog and tries to isolate the fountain of youth gene from the dog. Tim Allen (doing his best...well I don't know, he's horrendous in this) is second in command at the DA's office and he's prosecuting his precious twat daughter's teacher for trying to burn down evil co's lab. ALREADY, my fingers hurt from typing this retarded plot. This is just the basis of it. I didn't even get to the part where he's a bad dad.\n\nSo he's a bad dad, and you are reminded constantly of this. He wants his deep in the closet son to play football, but his son much rather awkwardly sing songs from Grease and be pestered by a random black girl (whose name is Plot Device) that challenges him to go to the Grease audition at the school, because she's his biggest rival or something. You NEVER SEE THIS AUDITION. It's only point is to drive home how clueless Tim Allen is at his son's gayness. Just another subplot in a movie that can't get the normal plot right. Why can't the son just not want to play football? I can understand the theme of a parent pushing a kid to do something they don't want to do (pageant parents), but why did they have to throw in character development for this stupid ass kid? He's awful.\n\nSo fast forward, Tim Allen is a bad dad (take a drink everytime he's a bad dad), the precious twat kids save the magical dog that escaped from the lab and the dog is an asshole and bites Tim Allen, because we're following SPIDERMAN RULES. After the bite from a radioactive spid...dog, we are treated to bad CGI of hairy germs taking over his blood cells, like we didn't already guess Tim Allen was going to turn into a fucking dog.\n\nSo instead of going to the hospital to get check out for RABIES (cause you know, you WERE bitten by a strange dog), he just goes to sleep. The audience is then assaulted with a sequence of scenes showing Tim Allen (the human) doing dog like things (sleeping at foot of bed, shoving face into bowl of cereal, growling in court). It's so ham fisted. Yet, how obvious this shit is, he has NO clue why he is acting strange. No seriously, not a clue. \n\nSide note: evil co guesstimated that the dog lives 7 years for every one year (like reverse dog years) but the dog is said to be 300 years old. But it doesn't...make sense? Does that math make sense? How does that work? Don't know why they included it. I can get behind a magical ever living dog...I guess. The more attention you bring to it, the more questions I have about it. As shit, now I have to ask these questions!\n\nSo there is no real backstory on the dog, which can be fine. Most people can accept that maybe this dog is just magical. But then they throw in this whole it's from Tibet and it's real name is Fuck This Movie (actually it was something like You R Phat or something). So...is this dog a dog? Or a human that turned into a dog? Did some monk master meditation and turned into the dog? The dog acts like a dog the whole time during the movie, UNTIL THE END, when you see the Tibet magic dog FUCKING SURFING A WAVE. So it can't just be a normal dog? Is it just a really hairy, short, Asian person? I thought maybe the dog would pass on this gene by biting, you know, passing the torch. I figured it was a human, who got turned into the dog and then he passes it on to another human. But this is way more thought than any of the seven or so screenwriters gave it, so fuck it.\n\nSo during all this shit, there is still a trial going on where Tim Allen has to prosecute the teacher...and then he does dog things in the court...and then Danny Glover (doing his best lethal weapon impersonation) tells him HE'S OFF THE CASE. Ahhh. That felt good. This movie is like a compilation of famous actors doing roles they did in much better movies. \n\nSo Tim Allen gets captured by evil co, Tony Stark injects the CEO with magic dog blood...which will knock him out for a few months and then when he wakes up, Stark will be the CEO and not him. THAT'S HOW THE MOVIE DESCRIBED IT. Then Tim Allen gets AQUAMAN powers and is able to talk to the fucked up animal monstrosities the lab had and they all escape.\n\nThis fucking movie blows. I'm wasting my time and wrists writing this. So they steal a car, he uses scrabble letters to tell his idiot family that the dog is him (hilarity also ensues as there are scenes of the old switch a roo, where the family thinks the magic dog is tim allen, but it's just a dog! so then they tell the magic dog to do stuff but it just sits there, and then the mom just sits there doing what she thinks is acting and staring at the dog with a slight look of confusion, or maybe constipation, and at one point she takes 3 seconds before she says her next line...and fuck).\n\nAlso, Tim Allen figures out you can go back to human if you sleep! or if you just  meditate enough! Fuck whatever.\n\nSo the most egregious part of this film is when Tim Allen gets stuck in traffic and he has to make it to court, he starts running and getting your heart beat up turns you into a dog, and he's running as a dog, then jumps off a building and says...\n\nTO INFINITY...AND BEYOND!\n\nFUCK YOU MOVIE. FUCK OFF. This movie can't stand by itself so it just steals from much better movies. FUCK THIS MOVIE.\n\nIn the end, Tim Allen bites Robert Downey Jr, tim allen questions the witness again (even though that's not how trials work, plus defensive council did not object to anything, plus never cross examined the witness which you are ALLOWED to do after the prosecution questions a witness...).....so after Tim Allen badgers the witness, JR does some dog stuff and people freak out and somehow that acquits the teacher from arson. THAT'S NOT HOW ANYTHING WORKS. Then he is immediately made the NEW DA (what happened to the old one?) then he immediately (off screen perhaps) books a trip to OAHU! NICE!\n\nThen we are transported to OAHU, where the family is watching that magical fucking dog catching a wave and the wife delivers the Oscar Winning Line of, \"I wish he didn't have to go back to Tibet\" O_O\n\nWHAT?! WHAT KIND OF LINE IS THAT? Plus, why the fuck DOES that dog have to go back to Tibet?! It's a fucking dog! The monks lost that dog for like weeks and they didn't give a flying fuck about him. Plus, they apparently are not concerned that a dog is RIDING A FUCKING WAVE. \n\nFUCK YOU MOVIE. I guess there was a tender moment where Tim Allen did tell his obviously gay son that he was okay with whatever he wanted to be. That was nice, I suppose. But then again, if he wasn't okay with it, it would just prove how BAD OF A DAD HE WAS (DRINK DRINK DRINK!)\n\nOverall, this movie could be categorized as something between a rock and a hard place, if that rock was made of a steaming pile of shit, and a hard place was a landfill full of steaming piles of shit.This movie physically hurt me. \n\nI understand these movies aren't supposed to be original. This movie is supposedly for kids. Yet, we've seen that you can make a movie that both kids and adults can enjoy (or kids enjoy and adults ball their eyes out over, I'm looking at you UP and Toy Story 3). But this doesn't even work for kids. If it's for kids, why all the sub plots? Why not more goofy dog CGI hijinx? It's just shit.\n\nBTW, the director, Brian Robbins, just directs garbage. He's directed this, Norbit, Meet Dave, Thousand Words...just plain bad movies.\n\nEven if you are in the mood for a bad movie, just skip this one. It's much too painful.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "Really terrible. I'm questioning the decisions I had to actually watch this.",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "It was a very funny and enjoyable live-action family comedy. It had great cinematography, special effects, cast, lots of laughs, adventure, music and a fun storyline. It's not as good as the original, but I still like this one. My favorite part of this movie was when Dave Douglas who acts like a dog was chasing the cat. I would recommend this movie to both kids and adults.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "The Shaggy Dog may not be original, but it is a decently entertaining family film with some entertaining performances from Tim Allen and Robert Downey, Jr.",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "Terrible. The real problem with this movie is not that it was bad, but that it panders way too much to the audience. You know those moments in movies that you don't want to happen, but in order for the movie to be good those moments need to be in there? Those moments have a name and in this case they needed something called dramatic irony. It's where we the audience gets what's going on, but the characters don't yet. A great example of this would be like in Romeo and Juliet. Juliet has just taken a sleeping potion, romeo thinks that she's dead and because he thinks that he commits suicide because he can't live without her. One good example of dramatic irony in this movie would have been that that they had found out Tim Allen was the dog at the final trial. But instead the characters were much smarter than they should have been and found out before the final trial started. There were so many good places they could have used the dramatic irony tool in this movie, but they were either too stupid to put them in or they were too afraid of displeasing the audience. And maybe we don't want to be pleased. Alfred Hitchcock even said this at one point in his life: \"Always make the audience suffer as much as possible.\" Admittedly there are some movies that are meant to please us like The Avengers for instance, but that formula works for the superhero genre not for this. Although if you want to be worshipped like a god by everyone who worked on this movie then by all means watch it.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "Great directing and acting this was a great movie",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Otra película que sigue la fórmula: buena idea, pésima ejecución.",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "wasn't to bad pretty funny",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "Unfunny jokes, terrible special effects, and plenty of wasted acting talent make this pointless remake of the pointless original film a complete waste of time.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "not bad... but not great",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Wasn't as bad as I thought it was gonna be, but it was still bad. Most of the jokes fall flat, but there was like two parts I laughed at, Tim Allen was bad as usual, but not as bad as he was on the last Tim Allen movie I watched which was Zoom. It had a few charming moments and a good performance by Robert Downey Jr. who always seems to be good in movies.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "An average family comedy that has that feeling of \"I've seen this before.\" It's not bad but not great",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "i have even seen this piece of shit",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "Can't beat a bit of Disney on a Sunday morning. I thought this was really funny, cheered me up. My dog enjoyed watching it too :)",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "prequel to iron man where iron man steals a dog off of some children",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "At least Robert Downey, Jr.'s in it. That's one good thing I could think of.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "A Tim Allen remake of the original Shaggy Dog. Not a good idea and there is something not that appealing about this film. The remake was unnecessary",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "The cgi at most times is creeepy...",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "it looks cool and funny and it looks like i would enjoy it",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Has Tim Allen ever been in a good movie?  Answer: NO",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Some younger kids may like it, but it fails to impress.",
            "review_date": "2012-12-16",
            "source": "rt"
        }
    ]
}