{
    "rating": 3.0,
    "release_date": "2006-03-03",
    "num_reviews": 150,
    "genres": [
        "Sci-fi",
        "Action"
    ],
    "summary": "In the late 21st-century, a vampiric disease modifies some people, imbuing each of them with superhuman strength, intelligence and speed. Worldwide civil war looms as normal people, feeling threatened by their enhanced brethren, demand the extermination of the group. One such transformed female (Milla Jovovich) finds herself caught in the crossfire when she becomes the protector of a boy who is perceived to be a threat to humanity.",
    "reviews": [
        {
            "content": "Good movie nice acting",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The repetition of the action scenes play like an avant-garde joke about the indistinguishable nature of Hollywood fight scenes. Think Warhol's soup cans, only with actors posing with swords.",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie since the idea of this movie is very interesting",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was so bad it was fascinating. The pacing in this is so bizarrely off...the first 40 minutes are nonstop stupid over the top action that never breathes and than we slow down to boring expose nonstop back to terrible final battles. The cinematography is atrocious with HORRIFIC CGI sweeping shots, over the top action, shot with bizarre obnoxious camera angles for good measure. Half the time the shots have a glossy color saturation to them as well that's distracting and looks like some kind of lubricant is on the screen. The music isn't bad as much as it puts you to sleep during boring expose and makes it even worse. It's just used in bad ways. The editing is horrible as well. The crowning achievement aside from the CGI is without a doubt Milla Jovovich. Her character Violet is so over the top, out of place, exaggerated and stupid while always trying to look like a badass its fascinating. It brings the level of acting to the type of performances you see in Kazam or The Super Mario Bros. Movie. This is so bad it's good at least the first 40 minutes. If you wanna see something awful but good just watch the first 40 minutes of this and than turn it off.",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite sci fi action movies. If you can look past the bad 2006 cgi, the acting, the sets, the music, & the plot are amazing. The outfits in this movie & the way she changes the colors of her outfits are top notch! I used to watch this movie at least once a week as a kid & now watching it as an adult I'm glad it holds up. We need a remastered version of this movie so we can watch it in all it's glory.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it.  Terrific Milla jojovich",
            "review_date": "2022-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually its a nice movie to watch, the story is non-existant. Good movie to watch while you are doing your laundry and searching for good movies to watch.",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What could've been definitely was not. This is such a terrible movie from start to finish. From the cheap CGI, the cinematography resembling a 90's desktop screensaver, and the acting? Oh the acting is abysmal. All of it is a no for me.",
            "review_date": "2022-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great inspiration.",
            "review_date": "2022-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like the film. it's just one of those style over substance - turn off your brain and enjoy the ride. Plus Milla Jovovich in sexy outfits is ALWAYS a plus. ",
            "review_date": "2022-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can not seriously tell whether or not the terrible animation was a stylistic or i-dont-give-a-cap choice. Either way, I didn't mind it.",
            "review_date": "2022-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like the ahestetic and fight scene, a bit videogame-like. Good fitting music too. The story is nonsensical at best, seems like the plot of every generic scifi dystopian movie thrown in a blender. Worthwile experiment, would watch again.",
            "review_date": "2022-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strange sci-fi story with often hilariously bad acting and cool swordplay!\n\nDirector Kurt Wimmer (Equilibrium) somehow lost all his taste, yet delivers an all style with little substance for his science-fiction action-thriller Ultraviolet (2006). I cannot believe Kurt Wimmer directed the beautiful and touching Equilibrium as well as the gaudy and melodramatic Ultraviolet. I do have a soft spot for Ultraviolet as it's so bad that it is genuinely entertaining.\n\nIt's hard to believe that Ultraviolet was constantly used in blu-ray advertisements for ultra-violet high definition as the Sony digital cameras used for Ultraviolet look hideous now. Why does every person have a glow to them? Ultraviolet's CGI is horrendous. Visual effects artists Steven Calcote, Neil Greenberg, Victor Wong, and Rongguo Fang made near video game cutscene level garbage for the wide shots of the city and ships flying awkwardly. It looks like Playstation 1 level graphics. The glowing purple fringes of Violet's hair looked neat and the practical effect of the flaming swords in the darkness is killer. Ultraviolet's effects are so hit or miss.\n\nArthur Wong Ngok-Tai's cinematography has all these inspired wide shots that look neat still and his hyper stylized camera work makes the sword and gunfights look cool at least. Alongside Kurt Wimmer's frenetic direction, Ultraviolet stabs, shoots, and slashes into glorious mediocrity. Choo Sung Pong's production design looks like its $30 million low budget. Many of the sets just look like Hong Kong and China where Ultraviolet was filmed. The sci-fi buildings are neat in a way, but never believable. Bernardo Trujillo, Chong Kwok-Wing, and William Kan's art direction is too cartoony to ever feel grounded. Roberto Bonelli, Chung Kim Wai, and Rufina Lo's sparse set decoration is minimalist for that sci-fi feel. It can also feel empty though.\n\nThere's plenty of style to Wimmer's direction with Ultraviolet's sleek and sterile world, afraid of disease, but there's just too much of everything. We never get to know Violet as it's all running around shooting people. Wimmer's writing just rips off The Matrix' action with Underworld's world and vampire lore and blood concepts to Blade's swordplay style. Ultraviolet has a place in my heart as one of the most entertaining bad movies ever made. Editor William Yeh's rapid and confusing cuts are so bafflingly bad. It looks like a parody of itself during the fights and the conversations look slick, but often veer off into the absurd. It's infamously terrible for a reason with awkward dialogue and hilariously bad acting from the supporting cast. \n\nMilla Jovovich is surprisingly fun as Violet with her lethal threats and killer sword choreography. She's a real action star and even delivers a bit of dramatic acting that can be bad, but she's not the problem with Ultraviolet. Cameron Bright is pretty deadpan as this sympathetic sick kid. Nick Chinlund is outrageous as the way too over the top dictator. His final fight is cool alongside Milla Jovovich, but his delivery is so mid-2000's. Sebastien Andrieu is awful as this strange French rebel. William Fichtner is fantastic and empathetic as Garth with a more sincere and nuanced performance. He's just a great actor even in garbage. All the other supporting actors are horrible, but laughably so, honestly.\n\nComposer Klaus Badelt's score has epic symphonic elements and fun techno throughout Ultraviolet, so I cannot complain about the music very much. The sound team came up with intense gun firing noises, but mixed these noises too quietly compared to the blaring score. The sword swinging noises are great. I actually love costume designers Joseph A. Porro and Jackie Cheng's skin tight bodysuits for Milla. They're colorful, sexy, and cool. They always show off her tight abs with a bare midriff among her ever changing tops and pants with these knee high boots. The purple wig on Milla is very pretty. Gemma Waugh and Marie Nardella's make-up is lovely for Milla as she looks angelic.\n\nIn all, Ultraviolet is a fairly fast paced 87 minutes of over the top acting and even crazier action sequences within this ultra serious sci-fi story. Can you believe this was actually about a vampire causing disease and a ruthless dictatorship that Milla Jovovich slashes through with her rectangular sword?",
            "review_date": "2022-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It's Milla time!\" Yes, I confess, I watched this to see Milla \"Violet\" do her thing in this flick. I loved her, loved her, loved her in The Fifth Element and her Resident Evil work was okay too. Ultraviolet has a barely acceptable plot, somewhat engaging screen adaptation, very impressive CGI overall, top-notch cinematography taste & vision. Milla looks spectacular and action scenes were well-done. I enjoyed 90% of this bombastic sci-fi, heroine extravaganza. Nanotech'd weaponry and bullets \"from outta nowhere\" was a new twist for me but how they could be fashioned so incredibly fast is beyond the hard-science I understand -- unless the weapons and ammo pre-existed in some quasi-energy-matter state, superpacked in storage for rapid retrieval. The 10% of the movie that failed me was the CGI'd motorcycle chase looked a but comic-booky in spots and NOT realistic. Never mind what Violet pulled off was essentially impossible, it just looked a bit unfinished in the CGI arena, textures not added in spots, breaking glass looking too drawn versus really breaking, small stuff really but it is just that sort of special effects that makes special effects NOT special. If you can tell is is CGI-done then it is subpar work. You shouldn't see most special effects other than slo-mo, ramping and the stuff we all were wow'd by in The Matrix. One last beef -- how in the world does Violet dodge 25 or thirty gun experts shooting at her at close range from 360 degrees surrounding her? Sure. maybe the first couple guys are stupid enuff to die in crossfire but ALL of them doing that? Please So, overall decent flick.",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A vampire must protect a human child from both humans and vampire alike along the way she becomes a surrogate mother.",
            "review_date": "2022-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good concept. Terrible execution. If you only listen to one thing I ever say, make it this one- do not watch this movie. You will be on your deathbed wondering why the hell you sat there for an hour and a half wasting away.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This reprehensible trash reads more like a broken jigsaw puzzle than competent action thriller. The cast, that is chalk full of talent make up the pieces, but the braindead writers couldn't piece them together.",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I simply don't know.",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another failed attempt at a Super Heroine Movie!",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie doesn't have to make sense to be entertaining. The story was something we've seen and heard in some form or another, many times. But the visual world created (even when obviously CG) is really quite something. I see hivemind herd-mentality kicked in for the reviews on this one.",
            "review_date": "2021-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like mila watch it she's gorgeous otherwise don't bother ridiculous over the top action",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most romantic movie, and full of action!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics say it's forgettable, I disagree.  It's memorable in its awfulness. I saw it in the theater and was dismayed that such a bad movie was released to theaters and not just straight to DVD. I tried watching it again on Hulu, but couldn't get past the terrible plot and bad cgi. It's just the worst movie I have ever seen. Got to a half-hour in on Hulu before having to give up.",
            "review_date": "2020-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good watch, could watch again, and can recommend.\n\nThis is certainly something different.  It's a different approach to vampires (hemophages), it's a different approach to sci-fi, and it's a different approach to corporate dystopia.  Oddly, the Umbrella Corporation from \"Resident Evil\" is the closest of which I can think.\n\nMilla Jovovich is entirely capable of performing high action sequences, and carrying the movie, which she does wonderfully.  I don't doubt that she has some pull in the production process, but the problems in this are mostly the weak character work and the \"I have this really cool idea I'd like to do on screen, it'll be totally different than anything else out there.\" of it all.\n\nSome of it (nose plugs) are actively distracting, and other things are just odd choices (squared off sword), while there are cool concepts (dimensionally printed weapons), and scenes that just look cool even if they're not especially practical or sensisble (swords on fire in the dark).\n\nMy only personal gripes are day walking vampires, weird foley sounds for the guns (most are right, but it is hard to tell on made up guns), and why in the hell people with guns would charge someone instead of firing.\n\nI think this movie holds up as good as it did when it was released, and I have a good time re-watching it.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved and still love this movie, I watch all the time, yes somewhat cheesy effects at certain parts but I don't blame acting/actors for that... \n  still a top movie for me!.!",
            "review_date": "2020-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cgi do i even have to say anything else?.",
            "review_date": "2020-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the film has it's moments visually, but the script is incoherent.",
            "review_date": "2020-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mila is so gorgeous to look at. Too bad the movie isn’t. Terrible special effects could’ve been forgiven if the story or plot were interesting. They weren’t. And enough with the long pauses before an action scene is to take place. They used that schtick literally every time someone pointed a gun at Mila. Boring. You can skip this one ",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why oh why does this eye gouger exist? Milla Jovovich absolutely sucks at acting and the CGI of this movie was already dated upon release. Why would any sane person greenlight this pile of manure? Absolutely pathetic.",
            "review_date": "2020-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We enjoyed it. Solid script,  great action sequences and Milla gives 100 percent.  It's entertainment people!!",
            "review_date": "2020-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The exact kind of film that would have seemed to have had a swath of potential in the mid-00's that it could have been a half-decent low-budget sci-fi action-thriller. But now the dust has settled and tastes have changed, I think to everyone it's clear that there was never a modicum of potential in this car crash of a film and even if Wimmer had full creative control, it got an R-rating, or it had a bigger budget, it would have undoubtedly have still been disgusting.\nDisgusting on the eyes (what's with all the smoothing?), disgusting in the visuals (those effects! Ouch! Those set colours!), disgusting on the ears (where are the sound effects? What's going on with those levels??!!), and disgusting in plot and dialogue (it's not cool, it makes no sense).\nIt could have been a smart spiritual-successor to Equilibrium (which in itself is a fun but completely terrible diversion) but it's an objectively bad film, even the action is either poorly conceived, executed, or edited to oblivion. The cast (except for the seldom terrible William Fitchner) are comically bad, the tech doesn't make sense, the soundtrack is as ugly as the world and so, so, so many scenes are just laughably bad. As a comedy or a farce it's a goldmine. As a movie it's a dumpster fire.",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful woman fights to save a kid who was meant to die. I actually went to see Ultraviolet In theaters when it first came out with one of my closest friends. Sixteen minutes into the movie, he walked out to the screen next door to watch Dave Chappelle's Block Party. Yes, it is that bad and, honestly, I'm surprised he even lasted that long. What's my excuse? I don't know, I'm guess I'm a glutton for bad-movie punishment. I paid the dime so I was forcing myself to do the time.\n\nActing: 0\n\nBeginning: 3\nNo, it doesn't take sixteen minutes to decide this movie is horrible. It's really more like ten. The beginning sets the movie up in no particularly clever way. It explains the laughable Blood Wars and tries to get you to care about the main character. I'm currently watching it right now and the nose plugs alone are killing me. You'll understand that reference if you decide to take the awful journey that is this movie.\n\nCharacters: 5\n\nCinematography/Visuals: 2\nDuring the making of this, someone actually presented the idea, \"So how cool would it be if the main character could change outfits on the spots like three times in every scene?\" The worst part is, someone actually agreed with that dunderhead. The outfits are only a smidge of what makes the cinematics so bad. The special effects are a nightmare which bog down the actions scenes. The world itself is so cardboard that you feel like a backdrop will fall down at any moment. I really don't know what the angle was here.\n\nConflict: 3\nEvery single bodyguard in this world should be fired. I really don't think the main character gets touched the entire movie as she tears through people left and right. My annoyance level was through the roof with the weak action sequences from start to finish. They were focused too much on making things look cool than they were having actual scenes with meat.\n\nEntertainment Value: 3\nAfter you get done cringing at how bad this movie is, you will finally settle in. You might just have a laugh or two at how utterly ridiculous and stupid this movie is. That, to me, is worthy of a 3.\n\nMemorability: 4\n\nPace: 3\nAt one point during the movie, when they had a chance to dive full into more action, they decide instead to have a sequence where the main character and the boy she is protecting stop to play at a playground. This should tell you all you need to know about how slow this movie moves. The fact that you really don't understand what's happening the entire movie only serves to make things even worse. Nightmare.\n\nPlot: 5\nI am being very generous. I will admit I do have a soft spot in my heart for sci-fi as I feel there are a lot of moving parts with character building and world creation.  With Ultraviolet, it's not just bad sci-fi, it's bad PERIOD.\n\nResolution: 4\n\nOverall: 32\nI will leave you with this: Sitting through this movie will make you a dumber person. That is all.",
            "review_date": "2020-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why does this movie exist?",
            "review_date": "2019-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultraviolet is a film that can only appeal to the mindless. It is an exercise in frustration. . This is another one of those pointless action superhero movies that unfolds like a video game in which the viewer is unable to participate. On more than one occasion, I have written that there's nothing more frustrating than watching someone else play a video game. Now I have found an exception to the rule - watching someone cheat while playing a video game. Because that's what the makers of Ultraviolet do: cheat. The live actors appear as computer generated as the backgrounds. Considering the lack of humor and emotion displayed by the performers, one might assume that their only participation was to allow their three-dimensional images to be programmed into a computer and reproduced. Ultraviolet falls short of mark set by Aeon Flux, and that bar is already so low that even a dwarf would have trouble doing the limbo under it.",
            "review_date": "2019-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a lot of fun. It's campy and cheesy, but it also feels like a comic book.  Pay attention to the way the scenes are framed and the use of color. This movie will not appeal to the critics, but it will to some comic book readers.",
            "review_date": "2019-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now for a movie that was in theatres I was not impressed it was beyond below par for cgi but if it were to be considered a b class movie I'd be more behind it. Acting 4 out of five, animation 2 out of five 5 plot 2 out of 5 overall ability to watch 3.5 out five. It was entertaining enough but not something I would search for to watch again.",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK run-of-the-mill sci-fi actioner, mildly entertaining, but absolutely predictable. ",
            "review_date": "2019-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although some ok action and special effects, it can't be saved from wooden acting and a half-assed story",
            "review_date": "2019-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Just...wow. Without even having seen the IMDb rating to expect a disasterpiece of epic proportions, I found myself really, really not liking Ultraviolet. I wanted to like something from this movie but it just...didn't. The script is cringier than romance in a Star Wars prequel, Milla Jovovich's performance was terrible (yet she gets a full star because which straight man can say no to an action girl who's in midriff-baring clothing for nearly the entire movie?), the action sequences, while cool in concept and likely looked much better when they were storyboarded ended up being incoherent, boring and one-sided, not to mention jarringly bloodless, something that is more nitpicky when you notice that the bad guys are in white clothing in a brightly lit room and the visual effects. My goodness, the effects. I can see why Kurt Wimmer stuck permanently to writing after this movie because the effects are some of the worst I have seen in a 21st-century blockbuster in quite a while. Theyre so blatantly unfinished! It doesn't help that the movie's really short which had a clear effect on the movie's pacing. So yeah, for a spiritual successor to Equilibrium, Ultraviolet falls flat on its face.",
            "review_date": "2019-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have you ever seen a movie that looked this fake before? Ultraviolet is a monumental disaster. It has some of the worst effects in history, an incomprehensible and boring story, and terrible overacting. All of this creates one of the most unpleasant action movies of all time. In addition to being one of the worst movies made in the 2000s. DON'T watch it! Unless you want to see a digital reminder on what not to do when making an action flick.",
            "review_date": "2019-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is bold and silly, relied on effects that did not exist, but is not self-aware at all.",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a truly underrated movie. I just wish a second movie had been made starring Milla.",
            "review_date": "2019-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultraviolet is a prime example of how computer effects will never trump good old narrative storytelling no matter how sophisticated they come to be. One problem with this film is it tries to be pretentious and yet does nothing but dazzle us(read: hit hard over the head) with style. The tone of the movie is one of high art, but it stinks like a landfill. It doesn't matter that the acting is wooden, the storyline is incomprehensible, and the action sequences are plodding. All the filmmakers care about is that there's a dash of panache to the proceedings. It's hard to argue that Ultraviolet has a unique look. The live actors appear as computer generated as the backgrounds. Considering the lack of humor and emotion displayed by the performers, one might assume that their only participation was to allow their three-dimensional images to be programmed into a computer and reproduced. MillaJovovich- never a strong actress- is at home here but even she can't salvage much. Ultraviolet is a waste of time.",
            "review_date": "2019-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A blanant rip-off from Resident Evil!!!",
            "review_date": "2018-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "can you give half stars. the only reason anyone should ever Milla Jovovich. thats it.. other wise its terrible. I mean the other actors aren't bad either, but this movie.. why was it even made?",
            "review_date": "2018-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love sci-fi  film; this film is amazing",
            "review_date": "2018-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is a bit weak towards the end, but the cinematography and action scenes are top tier stuff. Milla seriously rocks this, and that alone carries the movie to a solid seven points.",
            "review_date": "2018-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mostly boring and hard to follow",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly awful. What a complete waste of time watching this! Even the lovely Milla Jovovitch couldn't rescue it.",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 stars because I got to see Milla Jovovich's belly button for 1 hour 28 minutes.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb boring forgettable mishmash garbage",
            "review_date": "2017-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uninspired and unwatchable. A waste of time and talent.",
            "review_date": "2017-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It´s a testament to Milla Jovovich´s perfection that I watched this entire Aeon Flux rip-off ridiculousness from beginning to end. Literally the only good thing I can say about this movie is that they make Milla look great in that hot futuristic Aeon Flux way (not that she needed her face photoshopped for the entire movie though), but that´s not a stretch. I do guess I enjoyed myself by going \"wow, that was terrible/awful/ridiculous/what!? every two seconds.",
            "review_date": "2017-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It´s a testament to Milla Jovovich´s perfection that I watched this entire Aeon Flux rip-off ridiculousness from beginning to end. Literally the only good thing I can say about this movie is that they make Milla look great in that hot futuristic Aeon Flux way (not that she needed her face photoshopped for the entire movie though), but that´s not a stretch. I do guess I enjoyed myself by going \"wow, that was terrible/awful/ridiculous/what!? every two seconds.",
            "review_date": "2017-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After his masterpiece we got this, whatever it was meant to be it certainly failed. A giant mess with boring characters and dull story line;",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really difficult to focus on the awful story with the terrible \"cartoon-y\" CGI.",
            "review_date": "2017-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie. A lot. I like that the lead is a woman, and that she is totally badass. The colors in the film are emphatic and bold, but also neat, clean and crisp. The film feels very futuristic, and the architecture of Shanghi helps with that. The overall look of the film is very cool!\n\nThe film has a logical plot, but moves very fast. I understand that the director and Jovavich were shut out of the editing phase of the movie, and were both very angry about what the studio did to shorten the film and emphasis action over story. Too bad that we'll never get to see the full 122 minute film, as the cut scenes might have added in more of the human interaction the final film gives short shrift to. Nevertheless, the film is fast paced, the fight scenes are choreographed like a cross between martial arts and dancing, and it looks good. Also, she kills 700 guys in black armor; she's no slacker. \n\nI'll agree that the film plot is thin, but there's enough there to make me care about Violet, and to cheer her on when she goes to rescue six. 700 men, guys! That is some female warrior badassery the likes of which we don't usually get to see. Mila may have disavowed the film, but I like to watch it once a year, just to image a world where a woman could be that strong, that determined, and that indomitable.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Forgettable movie with over the top action, bad dialog, bad special effects and a very odd storyline.",
            "review_date": "2017-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is comically horrible.",
            "review_date": "2016-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is actually not much to report. The plot is not quite uninteresting, but the CGI / greenscreen effects and the dialogues are very weak.\n\nGenerally I consider Ultraviolet for a weak film.\n\nI rate it with 2 and half stars.\n\n\nFor action lovers, not recommended.",
            "review_date": "2016-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The BMW motorcycle does not sound nicely like a 2 cylinder boxer engine would, it sounds rather like a 4 cylinder engine! just a cheap fake!\nDo moviemakers think the audience is stupid or what?",
            "review_date": "2016-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm only giving this one star because it's Mila Jovovich, otherwise it's crap!",
            "review_date": "2016-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film I've seen that I can remember since I saw it yesterday. Fast-forwarded most of it because so boring.",
            "review_date": "2016-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "l had heard this was a must see did not realixe that they ment it only if you wanted to see the absolute  worst movie EVER made, including winner of dumbest movie with s nonsensical plot, retarded action sequences the only movie that you feel your iq dropping as you watch it!",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I strongly disagree with the critics on the Resident Evil series, which I find fantastically entertaining and for what they intend to be, very adept. But unfortunately, a good thing only goes so far in the movie world. Ultraviolet is the worst of the Resident Evil series, blended with copycat Matrix bits and a suffocating dose of Japanese stylization. The results are bland and extremely confusing. At times, it's shameful just how bad Ultraviolet's CGI is. All too often, the best sequences are cut away from, likely due to budget and effects issues. It's a real shame too. The cutting shot that Ultraviolet takes at radicalism of all forms is admirable and in the right light, it could have been something, or at least entertaining. As is, it's hard to even admire Jovovich, one of my favorite female action stars. Not worth your time or your pawn shop dollars, as it turns out.",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This show was very interesting. Milla is compelling. The killing looks more like dance or poetry as the movie takes you through a comic book feel in a dystopian world full of metaphor and masonic and Christian symbolism.",
            "review_date": "2016-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God what a disaster, can see this shit anymore!",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this movie a lot. It's entertaining and fast paced. The acting could be better but I liked it because of Milla Jovovich and the action scenes. I've seen better movies but this is 100% eye-candy to me and hey, I like what I like.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whatever this was supposed to be, or what it might've been in it's original form, I don't know yah, but what's up on the screen finally is no less than a blatant style steal from The Matrix, and its that without any of the supporting scripting fills to prop it up or fill it out. I'm a fan of Milla J. but this was a chore to endure.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "11,- and 90 min. of my life I will never get back.",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This would have been better off as an animated video, rather than a live action. The CGI was poorly executed and the plot was overly used and very lazy.  I fell asleep trying to watch this.",
            "review_date": "2015-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that we all knew would be terrible and it sure was just that, The story is old and has been done so many times, The action was poor and pretty lifeless, The effects were terrible, Poor acting and the script felt like it was written by teenagers, It's silly and corny it feels like a cheap PS2 game, The only reason it has a full star is because I have a soft spot for Milla Jovovich and I think she was only in it for the easy pay check.",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a stylistic, stunt/action movie. Milla Jovovich's performance as an ass-kicking, live-by-the-sword, bad ass makes this movie worth watching. The sci-fi tech/fights are cool too. The movie relies too much on CGI which at times comes off as cheap looking, and the plot was thin at best. If you are into these types of movies you will enjoy it, if you want depth this might not be for you.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incoherent action scenes, generic characters, laughable effects and unwatchable filters. Only things going for it is It's somewhat slick directing and Jovovich.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely top notch science-fantasy with a unique visual style that makes an all time fav of mine and my daughter's.",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good movie. Hoping there is a sequel. It feels like it finish.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unabashedly stylish, almost campy at times. The motorcycle chase sequence was certainly a bridge too far but a lot of the fights work quite well - at least as brain & eye candy. (And really, what more does one want from a film like this?) I actually found myself drawn to the lonesome badass, Violet. There's one scene where she succumbs to grief and despair that moved me more than happens in most jaunts of this type. It's probably just as well that it didn't do well enough to get a sequel, but this picture ranks high on my \"guilty pleasure\" list and I know I'm not the only one.",
            "review_date": "2015-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Table so called a superhero movie that nobody has heard about until watch mojo puts this movie on top 10 best action sequences in movies but is a movie starring milla jovovich. Their are two things that I like in this entire movie, hence me giving this movie two stars for two good things, but hey I'm giving this movie a chance, I never give this treatment to other makes but this garbage fun movie is an exception. Now for my two good, the action sequences because they are alright crazy and hilarious to watch, their so cheesy that's it's fun to watch, and milla jovovichs character violet and she appeal to the audience, that's the only reason that somebody would see this movie at all, it's because the poster for this movie is milla jovovich and her skinny stomach showing, not for oh it's some kind of superhero movie. But without milla jovovich I would give this movie a half star but she's in it so it's still terrible, but not as terrible. The story is garbage, just terrible , but still like milla jovovich s action sequences, but besides that the connection of 6 and milla jovovich just do not click, it's just dumb.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie good movie saw holl movey this time on crackle so yha good",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not nearly as bad as it's made out to be. It's watchable, entertaining and has a great central character (Violet) brought to life by Milla Jovovich, who delivers a solid performance. The downside is that some of the special effects are crap, the action sequences are badly choreographed and the dialogue is clichéd and cheesy.\nIn conclusion, Ultraviolet is an inventive, watchable, action/sci-fi flick, that will only appeal to a certain audience. 6/10",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second time around with this one.  I still liked it but I still don't understand it in full.  Lots of action and fast paced.",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has great production design and therefore looks really good. Other than that, it's a complete waste of time.",
            "review_date": "2014-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't get why people take this so seriously, It's easy Step 1. Switch off brain; Step 2. Enjoy.\n\nHow is it so different from a lot of high budget blockbusters? A lot better than many modern blockbusters. Plus I bought mine for £1.00 Win-Win Situation.",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You might scoff at my 2.5 stars, as bad as this movie is.  The bottom line is this: I was entertained somewhat by it's two redeeming qualities- The production design and fight scenes are really cool, and Milla Jovovich is SO insanely hot as Violet... Her looks alone wouldn't have been sufficient but she has an awesome presence and a talent to entertain. Outside of that, Ultraviolet is so ridiculously stupid it's comical.",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is NOT a cool movie. Let the UltraTerrible special effects tell you right away.",
            "review_date": "2014-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just like the rays the title describes, \"Ultraviolet\" is bad for you & you will feel burned. & why must Milla Jovovich imitate Selma Blair w/ that hair? Incidentally, the director was also in the forgettable new \"Flipper\" series (w/ also starred Jessica Alba).",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you are in a Bolivian hotel room, having a Tony Montana moment, this movie keeps you entertained :) I also love seeing Mila's midriff.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could put negative stars I would",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half of the action looked like a bad videogame. It's premise was interesting, but fell flat before I even bought the ticket.",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaw-dropping awful in every single way. The fact that the movie actually takes itself very seriously just leads to extra unintended laughs. It's mercifully over in under 90 minutes.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Right from the start when you walk into a theatre to watch a film like this one , you know it's going to be so over the top & shameless it will at least be fun! Well this film is far from being a masterpiece but i found it very fun to watch, well paced and Milla Jovovitch is very nice to look at. an incredible B movie to watch with friends and a keg of beer or high as a kite.... only ways to fully enjoy the joke!",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think I may be one of the only few people who like this film and nobody will change my opinion on that. May not be that original but who cares, I like it and I hope you do too.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good fighting sequences and a basic plot line.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A highly generic piece of crap of bad unnecessary proportions. The acting is as crap as it can be, the fight scenes are generic, mindless, and forgettable, the scenery is a bunch of crapola, it looks like an unfinished cgi city. The story, plot, and writing are all really really really bad. Really just a bad sugarcoated copy of Resident Evil.",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apt for those who believe that FX can make a whole movie. I liked the story, and, come on, Milla Jovovich stretching and bending...",
            "review_date": "2013-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great science fiction movie...!!",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible film.  Do not waste your time on this dreck.  The plot... LOL--Not.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No-brainer sci-fi thriller.",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why is this download taking so long going on 4hours",
            "review_date": "2013-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the story is not bad, but the CGI is awful!",
            "review_date": "2013-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the definition of a mixed bag. The visuals try to look like a comic book and are very stylized to try to cover up the atrocious special effects. (Seriously, there are GameCube games with better graphics than this movie.) Sometimes the stylizing/cover-up works really well, and sometimes it doesn't. A lot of the visuals are creative and truly stunning, and sometimes they're garish and harsh to look at. The story isn't very deep or complex, but the world of the film is creative, and I liked the imagination that went into the characters and the fight scenes. Some serious moments really work, and some are unintentionally funny. It could have been a lot better, but honestly, I kind of like it. It gets a lot of mileage out of the premise, the visual design and the fight scenes. It's not great, but I'd watch it again.",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of rip-offs right here, story's a lot like Moore's V for Vendetta and all those gun-fu are from Equilibrium. Nonetheless it's fun film.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting premise - weak script.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"My name is Violet, and I was born into a world that you may not understand.\"\n\nYou got THAT right, lady!\n\nAnd I counted 3 times she rehashed that line (this is a world that you may not understand)...it may have been even more times than that, I wasn't paying full attention, sadly...She reused that line so many times in the narration, it's as if it was some lame attempt to EXCUSE the convolution of the story and environment in which the story took place. Oh, right lady....it's NOT that the STORY is weird (and not in a cool way)and poorly executed...it's that I DON'T \"get it\". It's not YOU, it's ME...Geez, it's not enough of an insult that I paid as much as I did to see this...you have to insult ME too?\n\n Please skip this...Even if you like Milla Jovovitch....in fact, if you DO like her, see Resident Evil instead: at least THERE you'll get a split-second peek at her coat hanger chest pegs and find out whether or not she's a real blond. No spoiler alert from me, go find out lol.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a weir movie that I like for some reason I cannot put my finger on. The story is not incomprehensible. It is simple. Vampire is a disease. There is a cure. Add a big-brother element and some gun and sword play, place the plot in the future where helicopters still exist but motorcycles can defy gravity, and you have a flashy quirky comic book movie. Not deep, just fun, for the most part.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad storyline, bad effect, bad in all sides of aspects, maybe entertaining for the audiences, but for the professional movie reviewer, it's worthless to be watched",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those movies that I watch no matter how bad it is",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kurt Wimmer's adaptation of this comic book vampire isn't the strongest in its genre but its action pieces are well set up. And although it does not have an all star cast, the actors play their roles the best they can.\n\nFor my full review of Ultraviolet (2006), check it out on this IMDB link: http://imdb.com/title/tt0370032/reviews-884",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the cgi looks like a video game at times....boooo",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only thing good about this movie was the special effects. The plot was horrible. The commercial is misleading, it is nothing like how it was advertized.",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weak plot paired with yawnfest processional fight scenes. Eurgh.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skipped this movie untill I found it previously viewed at a video store out of state for a low price. Glad I waited. I think I lack a hormone or matured past the need to see a sexy woman weild guns and swords and kill anyone who comes in contact with her. The sci-fi concept or backstory was interesting, and I personally would have liked to see it flushed out more. I think more intellect and less violence would have balanced this movie out to a better picture.",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unwatchable. Have up after 15 minutes.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was a rip-off",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bizarre action fan-service art-house flick that works surprisingly more than it doesn't.\n\nTotally underrated curio. It's a bit like Takashi Miike crossed with Jean-Luc Godard. No joke!",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really really really good movie",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film great action",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One rogue warrior is bent on protecting her race - and seeking revenge on those who changed her life forever. Milla is ok in this film",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Supremely confusing and  unbelievable. The effects seem rather low class and leave a lot to be desired. Was there a script at all or just a rough one page outline?",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milla Jovovich's hot bod isn't nearly enough to carry this movie... Don't even waste your time with it.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn Kurt. You got a bigger budget yet managed to forget everything that made Equilibrium great. Namely a better cast and coherent story.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I despise this film.  Everything about it thinks it's better than what it is - from the self-involved script, to the flat acting, to the god-awful special effects.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible action and good story",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can read my review here - http://geektasticfilmreviews.blogspot.com/2012/10/ultraviolet.html",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Colorful, scintillating and blooming... Milla is stunning as an action  leading actress... For me,  this is enough as a technical action/fantasy and sci/fi motion pic...",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie was Awesome! i saw this in theaters in Taipei, Taiwan at the village Warner Theaters. although it was poor marketing cause i had no idea it came out or what it was about. i just saw the poster in chinese and i was like F it lets go. the only reason why it didnt get a 5 star was cause it was to weird that X-men 3 was coming out a month later and both movies had the same plot and same ending?????????????????",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the action scenes are good but looks more like dances because they are too coriographed...its an ok story line though",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. Bland all over.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mila was only reason why I watched",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed Milla perfect body",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks cool a cross between Resident evil and Blade :) oh and Milla :)",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was entertaining.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lets put it this way the graphics for the year it came out was eh but all in all id say it was good enough to buy the movie and watch it more than once. the fighting scenes were awesome and the actors were great, but there were some disappointing moments. like i said it was pretty decent.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best works of art in recent cinema, this movie is a visual treat from the word go. It just sucks that everything else is terrible.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milla Jovovich's Performance is Great! but i can't get the fact that it's Bad!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow. SO terrible. gets a half star for showing Milla's belly for most of the movie, but i'm trying to figure out how I got this so high up in my netflix queue. The writing was just... terrible. the fight scenes, terrible. the effects... terrible. the acting, terrible. this movie gets 4 stars of terrible. Just, terrible.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stopped watching after 10 minutes, even though Milla Jovovich is smokin'",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Milla Jovovich's worst film and it truly does show. The direction is awful, the only redeeming qualities are Milla even though her performance is off as well as some superb action scenes that are edited awkwardly but other than that Ultraviolet is a disappointing stylish off-beat action thriller. 2/5",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid and enjoyable.  I don't ever expect greatness from any movie anyway.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT FILM !!!!!!!!!!!!!!\r\nLOVED COLORS !!!!!!!!!!!!!!!!!",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        }
    ]
}