{
    "rating": 9.0,
    "release_date": "2006-03-17",
    "num_reviews": 530,
    "genres": [
        "Action",
        "Mystery&thriller"
    ],
    "summary": "Following world war, London is a police state occupied by a fascist government, and a vigilante known only as V (Hugo Weaving) uses terrorist tactics to fight the oppressors of the world in which he now lives. When V saves a young woman named Evey (Natalie Portman) from the secret police, he discovers an ally in his fight against England's oppressors.",
    "reviews": [
        {
            "content": "sublime filme ,político social ,el personaje principal trasmite esa melancólica y poética esencia entre  sufrimiento y fortaleza ,trama dramáticamente idónea con temas reales muy bien manejados como la corrupción y abusos de poder en la sociedad, esta grandiosa historia acompañada de magnificas actuaciones ademas de ser finamente fiel a su material de origen forman un filme de alta calidad cinematografica .",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "One of my all time favourite movies. It looks great, has impressive performances throughout (especially from the two leads), is superbly directed, a great score and actually has something signifant to say. It's obviously based upon the equally wonderful British graphic novel written by the genius Alan Moore, so the fact that it has a fantastic storyline is no surprise but the fact its been adapted to the big screen so superbly most certainly is. A magnificent film that will remain with you long after watching it.",
            "review_date": "2023-03-16",
            "source": "rt"
        },
        {
            "content": "V for vendetta script is a masterpiece. Pacing makes you travel in emotions, you even forget you are watching a super hero movie and just get immersed into an epic drama",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "The best rebel hero movie, that brings chaos to rebuild something. An ode to Guy Fawkes. Very good the Hugo and the Natalie. Remember, remember..",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "There is a reason I watch the movie every November the 5th, because the movie is that good!",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "My second favorite movie of all time.\n\nTells a story that is just as relevant today as it was when it was written - when a people fear their government instead of a government fearing it's people. When it's become fascist. \n\nThe movie updated the graphic novel and did a good job, considering when it was updated.\n\nAnd while I have lost respect for the original author, it is like the line in the movie, \"and ideas, Mr. Creedy, are bulletproof.\"\n\nMust see and if you enjoy it, read the graphic novel. Pass along for the future and \"remember, remember, the 5th of November.\"",
            "review_date": "2022-12-25",
            "source": "rt"
        },
        {
            "content": "O filme acontece em uma sociedade inglesa distópica, que após enfrentar uma guerra contra os Estados Unidos, sucumbe ao regime do ditador Sutler. Ele se aproveita de toda a crise para ganhar as eleições e se utiliza de leis totalitárias, censura generalizada da mídia e tortura dos opositores para se manter no poder. Dessa forma, não há nenhuma liberdade em seu regime autoritário, tudo passa por um filtro antes de ser publicado e todos estão alienados ou conformados com essa situação, visto que por medo da guerra, a população prefere trocar a liberdade por uma falsa sensação de segurança.\n\nSendo assim, o governo retira qualquer indesejado que esteja contra a ideia hegemônica do ditador, sejam eles homossexuais, negros, muçulmanos e outras minorias. Nesse contexto, surge o protagonista V, que basicamente é a personificação do sentimento de liberdade, mas sob um tom terrorista e anarquista, ao menos na perspectiva do governo, pois pela ótica dos cidadãos ele é um herói ou alguém que leva esperança. Para isso V pretende chamar a atenção do povo em relação ao que o Estado está fazendo, no entanto, faz isso através do medo, assim, essa será uma das poucas vezes que nos encontraremos torcendo para um \"terrorista\".\n\nEm virtude disso, essa é uma história com questões delicadas que vão lhe fazer refletir sobre qual o preço da liberdade, o que estamos dispostos a pagar por ela e nos faz extravasar o sentimento de insignificância ao sermos controlados pelo governo, nesse caso totalitário, uma vez que é ele que deve temer o seu povo e não contrário. Logo, mesmo com um roteiro mais minimalista, sem muita ação, temos com uma boa fotografia e uma excelente discussão temática, tonando a obra deslumbrante, principalmente para quem gosta de filosofia e sociologia.\n\nContudo, o filme não chega a ser genial, pois ainda que seja bem envolvente temos muitas passagens entediante, um vilão que é caricato e pouco relevante, tanto que quase não tem aparições. Dessa maneira, várias das cenas que não contém o protagonista se tornam fracas, em exceção a investigação feita pelo detetive Finch, no qual, nos empolgamos com o mistério a ser resolvido e a \"libertação\" da personagem Evey, quando ela está presa. Portanto, V de Vingança é uma obra de fácil digestão, já que não foca em diversas outras questões que poderiam ser aprofundadas e se retém ao tema da liberdade, criando, brilhantemente, sua marca nesse aspecto.",
            "review_date": "2022-12-15",
            "source": "rt"
        },
        {
            "content": "Natalie portman but with a bad case of Stockholm syndrome",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "Este filme é ótimo em todos os aspetos",
            "review_date": "2022-12-01",
            "source": "rt"
        },
        {
            "content": "please help your friends also Watch this .",
            "review_date": "2022-11-24",
            "source": "rt"
        },
        {
            "content": "This movie is everything you'd want from a movie about V. Dark, visceral and full of great philosophy and gothic atmosphere, with standout performances by Hugo Weaving and Natalie Portman.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "A valorous and valiant tale of vigor and victory over a vindictively violent government of vulgar vitriolic villains. Vicariously allowing viewers to value the vast virtuous vivification of freedoms from tyranny. Perhaps verbose on validating or venerating V as a concept or a person V for Vendetta is a film that is vibrant and vivid depiction of combating a dystopian authoritarian rule of the UK. Masterful characterization, excellent and interesting dialogue, beautiful cinematics and compositions, V for Vendetta is truly a movie that will remain a lauded cult classic for years to come.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "Un exellent film qui montre ce qu' était vraiment le fascisme en faisant un bon parallèle avec l'ocupation N*zi de l'Allemagne.",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "very good plus extra characters bc it made me",
            "review_date": "2022-11-09",
            "source": "rt"
        },
        {
            "content": "Genuinely one of the best superhero movies there is, because it doesn't stop at incredible fight sequences, amazing performances from the stars, and a deeply compelling plot - it explores the social issues associated with a tyrannical government.",
            "review_date": "2022-11-09",
            "source": "rt"
        },
        {
            "content": "Watching this in 2022 makes me sick.",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta\"\nThis film review will be about \"V for Vendetta,\" and a spoiler of the movie can be seen in this review. \"V for Vendetta\" is a movie taken from a book by Alan Moore, written years ago before wars and government problems were initiated. This movie begins when experimenting, and everything goes wrong, killing innocent people to get to the point they wanted to be and creating a government that assures keeping people safe, but not freedom. Finally, one guy finds a way to escape and returns for revenge. He always says to remember the day, the 5th of November, because he wanted to make people get united and fight against the government. Also, as he said, \"people should not be afraid of their government. Governments should be afraid of their people.\" In his journey, he finds a girl; to me, she was his redemption at some point because her love reminded him that he was loved. He had something more to fight about but also feared who he was. The mask and Valerie are the two main elements of this story because Valerie is the reminder and the power to fight, and the mask represents himself and the people he is fighting for.\n\nThis movie was a window for the future; now, we can see that political violence is happening and that, like the movie, many people thought that the government sent the covid. Now we know a virus hit our world, causing so many deaths, probably without reason; that's what many think, right? So, this movie is about power and politics. It can be from the power of love, people, a change of life, an act of killing, and then the turning of a page. It can be fascinating how the system can bring us all together to challenge an ideal or power and that if we come together to fight for the same goal, we can indeed change the world, being possible to create new realities, but, of course, we can do things in a non-violent way. The significant purpose or message that this movie has is that we must come together as people to challenge power, which is true because a mass of people fighting for the same objective can be more powerful than a government, for example. Additionally, how the power of people and love united can win, no matter the reason you are fighting for, in the end, it will succeed.\n\nIn conclusion, this is a great movie, and there are so many learning experiences that everybody can get from this movie, but this movie should be seen by adult audiences or parental guidance because there are some sensitive scenes. Critiquing this movie can be complicated and tricky because the topics that this movie talks about are very challenging and powerful topics to talk about during these days. Also, in the end, this movie answers any questions that, as the audience, we can have, is not the typical ending that everybody expects. Still, it is a great movie that shows how the power of incorrect people can cause so much danger, but the hope and unity of a group can win any situation.",
            "review_date": "2022-11-03",
            "source": "rt"
        },
        {
            "content": "The film V for Vendetta reveals the main protagonist from a visually stunning, thought-provoking political standpoint with a story with unique set pieces that are rather entertaining. This film will dive the audience into an epic storyline driven by a tremendous supporting cast. The film brings a science fiction thriller approach that will captivate the audience to dive deeper into the world and the storytelling. Based in Britain, that's under a totalitarian dictatorship in the future causes, a man in a unique mask inspires the people of Britain to rebel and plan to blow up the parliament. I thought the dialog was done exceptionally well throughout the film, and at times it reminded me of Zorro. There was a big emphasis on politics throughout the film that, in my opinion, could be cut out. If you go into this film expecting a lot of action, you'll be somewhat dissatisfied as it is slower-paced than you would think. I thought the actress Natalie Portman did a great job of diving deep into her role and giving the audience one of her better performances in her movie career. One of the best scenes with her character, Evey, was incarcerated. Evey wakes up in a facility, which is a rather traumatic scene as she's sobbing, her head is shaved, and she's tossed into a damp cell. The only reason why she's taken out is to be interrogated and tortured. It reminds the audience of the treatment people to receive in unjust legal systems, such as in this movie. Another memorable scene done quite well by Natalie Portman would have to be the scene where a man is about to rape her, but she's saved by the mysterious man in the mask that goes by \"V,\"  and she witnesses him blowing up the Old Bailey. Afterward, Evey is taken to an underground room, which is referred to as the \"Shadow Gallery.\" The ending was a rather jaw-dropping conclusion as it gave the interpretation that people change, but you can't make that happen yourself. Overall, I thought this film would be great for anyone interested in a good science fiction thriller with a good bit of drama.",
            "review_date": "2022-11-03",
            "source": "rt"
        },
        {
            "content": "V for Vendetta, director by James McTeigue, using elements of the 2000's to create this dystopia future. From the beginning the audience is clued into that there is a bigger picture. While the start may be a bit slow the movie takes off when V makes his first appearance. From the soundtrack in the background, and to the well-done fight chorography between V and the two guards does well to pull its audience attention. However, if you are someone with children I would; I am advised to say the movie is not for children reasons range from violence to heavy topics, also for the clothing that some people are wearing could be a little revealing and nudity. It could teach the children the wrong lessen like violence could be used for good, but for children it could mean they can be as violent as they want and just say it was for the good. For adults, I can understand that the parliament should do better and stop with curfew because they deserve freedom and if they want to be outside at twelve in the morning then they can. \n\n\tPart way through the film it almost feels as if they were trying to make a light out of a dark event, but I do not see it that way because they were basically mocking V, who was a science experiment that got burned over hundred percent of his body and forgot who he used to be.  They do however know how to make a plot twist of making it seem as Evey was caught by the guards, but V got to her before the guards did, but in doing so V wised for her to be able to not be afraid of death so he subjected her to a bunch of torture and shaved her head. \n \n\tThe storyline was good, and it felt relatable because these days we are stuck fighting for our own rights for who we want to be. Example was how the chancellor used his power to round up homosexual and throw them into prison. Even in our current time we the people find that It's hard to make the government listen to what's happening and that's portraited was happening in this movie.",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "The movie V for Vendetta is a mysterious, action-packed movie set in England in 2020. However, this is not the England people think of today; in this movie, the British government has become oppressive and taken away many freedoms of its citizens. Throughout this mysterious movie, horrific details begin to reveal about the British government. The main character, a guy by the name of V, does all he can to reveal the truth and seek revenge. After V stumbles upon a young British woman by the name of Evie, the two more or less team up to avenge the British government; the more the movie progresses, the more secrets are revealed, and the more questions are asked. The movie's biggest question is, who is V? Why does V seek vengeance on the government? Not every question can be answered in this movie, but it will definitely leave you with a better understanding of who V is and how the government has affected his life. \n     Critiquing this movie on its originality is tricky because there are countless movies out there about an oppressive government becoming too powerful and keeping secrets from its citizens. However, this movie shows its uniqueness by having the character V. This critique also goes into how well the characters were portrayed in the movie. V is a mysterious character who can come off as creepy, weird, or even evil. His character was so original it was hard to decipher how to feel about him until the very end because, at different points in the movie, you could not see his true intentions. There are many twists throughout this movie which also helps contribute to its originality. However, one unoriginal or predictable aspect was V's feelings for Evie. It followed the \"bad guy falls for sweet innocent girl\" plot but in a very subtle way.\n     Another criterion to evaluate is the dialogue in this movie. The dialogue throughout this movie can sometimes come off as confusing, especially when V is introduced; he even confuses Evie. For example, at the beginning of the film, he follows a rhyme scheme making him sound poetic, which just came off as confusing at first. However, as the movie progressed, and V's personality was easier to understand, so was his dialogue. V and Evie's personality traits are expressed through their dialogue. Evie comes across as a sweet innocent, ordinary girl, while V comes across as a harsh and heartless man.\n     The movie does a great job answering the audience's questions while still keeping them on their toes. It is an excellent movie for anyone who loves action and fighting scenes. It is not your typical happy-go-lucky movie, and the end will throw you for a loop. Overall, this movie has many unique and memorable aspects shown through the characters, their dialogue, and the story plot that you will not find anywhere else.",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "The use of strong imagery and the way the characters perform and develop in V for Vendetta make the film come together as a way for it to be entertaining for the people who are watching. I will talk about some things that happen in the movie so I am putting a spoiler alert. At the beginning of the film, we get introduced to the main character, a masked man who goes by the name V. The mask that V is seen with throughout the film is to hide his identity, but the mask also has a permanent smile on it. The smile on the mask could be a way for there to be a more creepy tone to the film. Many other things may add to the film's tone, but another one is that most of the scenes in the movie are shot in very dark lighting. V is very mysterious and lives in England under a government that many may see as a dictatorship. Towards the beginning of the film, V is seen as he is going to be the villain of the film, but as the film progresses and things begin to unfold, one could say the government is the actual villain. People living in England obey the government out of fear, except V, who stands against them and says in one of his famous lines, \"People shouldn't be afraid of their government. Governments should be afraid of their people\"(V for Vendetta). V stands against his government as a form of revenge which he believes can be a form of symbolism. He believes that the chaotic and disastrous things he does will send a message to the people he is trying to reach. In this case, it's the government, and people will remember what he did and for what reasons. The character's performance and development improved how well the film was written. V was masked the entire film, but as the watchers, we still managed to see and feel his emotions. V also met a girl named Evey Hammond, whom he cared for and saved from being punished by their government. Evey could feel and understand V's emotions even with being masked the whole time because even though V never showed his identity, he was still vulnerable around Evey. Soon after, Evey and V began to bond and created what seemed like a romantic relationship between the two. With the government seeing V as a terrorist, many people disagreed with the government and began to follow V and support his ideas, including Evey. V for Vendetta is known as being an action film, but it carries a solid underlying meaning. The film can also be a way for us to relate to it because we've had protests and riots happen all around the United States to get the government to see us and make a change. Overall I think V for Vendetta was a good film with a relatable meaning that many people can relate to.",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "As I viewed this movie it had many things that stood out to me. The use of alliteration soared throughout and added true meaning to the words, \"V for Vendetta.\" This thriller gave off a lot of hero vibes as \"V\" fights to make things right and bring justice. However, there are a lot of twist and terms that keeps the viewers on the edge of their seat!\n\tThe use of literary devices caught my eye several times in this jam-packed movie. For instance, V says, \"the only verdict is vengeance.\" This was a use of alliteration. He later adds some rhyme scheme. An example of this was, \"Remember, remember, the fifth of November.\" I thought this was crucial in this scene because it set the tone and made it more ominous. It was notable that soft music played as he said these lines. \n\tI believe there were also references to the Christian faith and the Bible in this movie. One of the examples I heard was from the beginning of the movie. One of the \"finger men\" had said this line, \"Spare the rod, spoil the child.\" This grew my interest because it reminded me of scripture I had read in the past. (The Bible states this in Proverbs 13:24) Overall, this movie has a similar sequence to the story of Paul in the New Testament. For example, Paul had low points and was in jail, but miracles helped him to be set free. In \"V for Vendetta,\" Evey is also put in a cell as she has to overcome the mental and physical struggles of being separated. \n\tIn conclusion, I would rate V for Vendetta as an eight out of ten. This movie has a lot of action to keep the viewer interested, however, there are parts when it can slow down and become less interesting due to the lack of action. This movie uses the right amount of music, literary devices, and attention grabbers to keep the audience wanting more. I believe this movie is worth the watch because there are numerous tie ins to everyday struggles, we go through",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "The film adaptation of V for Vendetta is a film full of impactful themes, a well thought out and constructed world, and several memorable characters, even if the characters that exist in this world can often be underutilized. This is done through broody and unforgiving settings that will leave viewers rooting for characters that in other films would be villains. Following the main character who is essentially a terrorist and having the viewer rooting for them by the end is something unique to this film \n\n \n\nTo better understand the thoughts and motivations of characters it is first important to understand the world they inhabit. Set in an alternate history version of the United Kingdom, V for Vendetta sets out to create a dystopian fascist society for its events to take place within. While well done for the most part, scenes involving setting up the world can be a bit tacky. For example, a particular scene revolving around the assault of a key character comes across as tacky and unnecessary. However, this is the exception and not the rule as the scenes involving the fictional British news company and a shadow government do a great job to portray a heavy-handed fascist government. This is helped by giving the audience individual characters that act as the face of the evil government in the movie. \n\n \n\nThe film follows two main protagonists, one who calls themselves \"V\" a vigilante whose motivations unknown to the viewer, seeks to change society in a violent revolution. The second protagonist being someone named \"Evey\" as they simply seek to survive in dystopian society. Both characters heavily carry the best moments of the movie, their interactions serving as key turning points throughout the entire film. V, whose identity is unknown is a mysterious figure whose multiple motivations will leave the viewer constantly questioning if this character is the one, they should be rooting for. \n\n \n\nAside from the protagonists the film features several detailed characters that are a very mixed bag of quality. The main villains who are being ordered around on a massive television screen by the \"High Chancellor\" while sometimes coming across as mustache twirling, serve their purpose at driving the movie forward. However, this can be a bit draining as some characters seem to only exist to serve their main purpose in the plot, and then hastily written off. This happens in the form of very important characters in the movie never having their motivations properly explained. \n\n \n\nOne of the most notable things about the movie is its well thought out themes. The most integral one is the theme of fear, and how that can be used to rule over a populace, and in the case of the movie a fascist government. This theme relates to multiple characters in the film as they seek in their own ways to overcome this fear, and to not let it rule the actions that they take. Many audience members will find this relatable, as fear deterring one from their proper path is something that many people can relate to. \n\n \n\nV for Vendetta is a solid film and while it can be a bit messy with its messaging at times, the sum of its parts is greater than the whole. Many viewers will have multiple messages in the film that they relate to, even if they are blown up to great proportions in the film. With a solid slew of characters, a world to get lost in, and resonating themes V for Vendetta is a film that most people will enjoy.",
            "review_date": "2022-10-28",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever made. ",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "Best DC movie of all time",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "One of the best of comic history movies",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "国内豆瓣下架了，特来烂番茄评分，时刻警惕极权主义！！！",
            "review_date": "2022-10-18",
            "source": "rt"
        },
        {
            "content": "One of the best comic book adaptations with an excellent choice of players and performance.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is an extremely brilliant film! The story, writing, visuals, performances, characters, action, and set pieces are all fantastic. I wish we could get more movies like this from DC.",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "Promises much and delivers little.\n\nThere are points in the movie where it becomes obvious the writters changed track.  the result is a meandering mess that underwhelms.\n\nIn the end you will end up despising this move for the 2 hours extra sleep you could have gotten.",
            "review_date": "2022-10-05",
            "source": "rt"
        },
        {
            "content": "Perfect other than Natalie Portman's accent.  Better than the source material.",
            "review_date": "2022-10-03",
            "source": "rt"
        },
        {
            "content": "Really cleverly written movie with just as interesting dialogue. V was sure to catch my attention and i would've very much liked to get more of an insight on his character",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "A avoir vu une fois (ou 5) dans sa vie...",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "I understand that it won't appeal to some but to me this is my favorite movie of all time. It never talks down to its audience as it lays out an impressive story that captivates and makes the audience think about what is wrong and right. It's characters are all amazing as they all have their flaws and strengths making them seem like real people. It is inspirational and always helps me to know that there is a brighter future when things start to go south. I hope you enjoy as it gives you a story that takes itself seriously and goes all out.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "Excellent. I love the",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "its great! unfortunatelly there cant be second part of this masterpiece",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "Probably the best CBM i've ever seen, 10/10",
            "review_date": "2022-08-26",
            "source": "rt"
        },
        {
            "content": "su narracion poderosa y sus escenarios deslumbrantes logran entretener al publico",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "My top 5 movies of all time",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta\" is one of my favourite films (in my top 5) and I especially love V's character. I just want to babble on for a minute about V's character in the movie compared to the comic book. I like both variations of the character (just for the record).\n\nIn the comic book, V feels like his character is more scripted, as if he was preparing to be in a play (and, yes, I know he is referring to famous poems and old English language). He uses riddles and he is more mysterious and dark than the V in the \"V for Vendetta\" film. V in the film has more of a spark of humanity in him. He laughs, he yells, he uses his hands more often, and he speaks more casually in conversation (take for example when Evey wakes up to find V is making her and egg with toast).\n\nI hope you enjoyed my rambling :)",
            "review_date": "2022-08-08",
            "source": "rt"
        },
        {
            "content": "This is one of the great must see films of our time.  If you haven't seen the film stop reading and go watch it.  I think anyone who tries to understand the world we live in today will appreciate and love this film for it's parallels, theme, and feel.",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Movies is great. It's fun moving and emotional wish I had seen this when it came out. Ignore the negative comments definitely a must watch.",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "I love this film more than I love my children. I'm convinced that anyone who thinks differently is a fascist and can go right to hell.",
            "review_date": "2022-07-31",
            "source": "rt"
        },
        {
            "content": "Thought provoking and inspiring.",
            "review_date": "2022-07-11",
            "source": "rt"
        },
        {
            "content": "This movie has aged so well. mandatory viewing. Valeries letter is my favorite part. so compelling",
            "review_date": "2022-06-28",
            "source": "rt"
        },
        {
            "content": "Every part of this movie is great -  story, casting, soundtrack, cinematography,",
            "review_date": "2022-06-18",
            "source": "rt"
        },
        {
            "content": "I watched this again today after around 15 years not seeing it.  I appreciated it more than upon first viewing, especially because of how some things are relevant to our contemporary reality, especially as it pertains to growing authoritarian rule.  Without getting too deep, this gives reflective people much to think about.  I wish that unseating tyranny were only as easily accomplished as in this movie.  The movie seems to put government at the seat of all encompassing power when I think the truth is more that international corporations and institutions have supplanted and subdued nation states.  One thing about Natalie Portman, she's a good actress, but I always have difficulty appreciating an American actress speaking with a British accent.  It just doesn't seem believable to me, and hearing a British accent from an American actor or actress often makes me think people sound more pompous.  Interestingly though, if a British actor/actress speaks in an American accent, I don't find it nearly as annoying, in fact, I'm perfectly fine with it.  Natalie Portman played her part well though, and truth be told, she's easy on the eyes.  I'm glad I took the time to rewatch this.  It's decent and it was worth my time.",
            "review_date": "2022-06-14",
            "source": "rt"
        },
        {
            "content": "(May 26, 2022) I didn’t really like the plot very much even though everyone seems to love it. I don’t know… it’s just not really my type of movie. I loved the action in it though. RATING: 10/20 (🍅50%)",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "In a dystopian England, Adam Sutler the chancellor gained power through the citizen's fear of crime and disease ripping its way through communities, this power gained from the citizen's fear has resulted in a fear-corrupted England. Curfews and an abusive police force called \"The Fingerman\" dominate without repercussions until our wide vocabulary protagonist V aims to instigate a revolution, to give England freedom. Uniquely styled with a deep but also fun plot, V for Vendetta is one of my favorite films already. Natalie Portman's performance feels a bit off compared to some of her other work, but moving aside from that the character of V with a great performance from Hugo Weaving will keep you hooked, and keep you wanting to rewatch. Some of the best writing you'll see in a comic book adaptation and an ending that sent shivers down my spine with the combination of music, anticipation, and character connection it's a masterpiece of a film.",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "This movie changes worlds",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "This was a great movie.  👍",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "Very well put together and absorbing from beginning to end",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "this is the future for the world if people keep ignoring and let Chinese Communist Party take over.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Thrilling and thought-provoking, it truly had me engaged and interested.",
            "review_date": "2022-03-20",
            "source": "rt"
        },
        {
            "content": "The foresight on this film is astonishing. Governments in 2020 copied sections of the movie like for like ... it's for your own safety, you know?",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "The political lectures in this movie is surprisingly better than I expected! I really love how the face of v was never shown & it was said that they all are V. I wish wb had made more movies like this.",
            "review_date": "2022-02-13",
            "source": "rt"
        },
        {
            "content": "Expertly crafted from a technical standpoint, \"V for Vendetta\" is an immersive experience driven by striking imagery, intriguing themes and a captivating sense of mystique. On the other hand, it doesn't shy away from exposition, occasionally inconsistent pacing, pompous fanfare and derivative screenwriting genre tropes, and would have benefited quite a lot from more meticulous establishing of the dystopian setting so as to avoid falling back on generic ideological tenets.",
            "review_date": "2022-02-04",
            "source": "rt"
        },
        {
            "content": "The film hits home in 2021 when authoritarianism, disinformation, and nationalism are on the rise. I love how the puzzles come together throughout the movie. Only issue was Natalie Portman's bad British accent.",
            "review_date": "2022-02-03",
            "source": "rt"
        },
        {
            "content": "The story is certainly memorable, the themes are highly thought-provoking and it's possibly Natalie Portman's best vehicle yet.",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Pretty good movie. Of course, watching a fictional right-wing tyranny while living through a left-wing one is pretty laughable, but it's still thought-provoking.\n\nExcellent acting, soundtrack, and drama.",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "V for vendetta was an odd, yet intriguing film;\nwhile the main storyline was relatively simple,\nthis did not take the enjoyment away from this\nthought provoking piece. Natalie Portman's\nperformance was fantastic, along with the rest of\nthe cast. Great film would recommend.",
            "review_date": "2022-01-11",
            "source": "rt"
        },
        {
            "content": "Nie byłem przekonany, bo maski Guya Fawkesa walą mi tandetą. Film brudny, inspirujący, choć naiwny",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Absolute master piece. I can never get sick of watching this.",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "I remember the movie being really good.  Now with what's been going on in the world, much of the background of this movie I think shows many parallels. Give it another watch and pay attention to the backstory.",
            "review_date": "2021-12-21",
            "source": "rt"
        },
        {
            "content": "Great movie, a lot of philosophy to think about.",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "If a superhero or savior or freedom fighter movie is made it's should be made in this way. Story of the movie is strong and characters were so well played. Screenplay was extraordinary. DC needs to make more films like this, where a hero character is completely shown and can connect with peoples.",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "Ridiculously fake, bland, and odd. The plot was predictable and nonsensical. These types of dystopian stories usually are, but this was especially bad. People can't survive being burnt alive and don't have time slowing superpowers, most people possess the ability to think and reason, V could somehow afford thousands of masks that probably wouldn't have even be produced under the circumstances, nobody can survive hundreds of bullets for that long, young children typically don't participate in doing graffiti and going to protests/rallies, it was obvious the main character was being held hostage by V rather than captured, and so on. The characters were silly, with V being excessively skilled and talkative for a man who lived alone underground, the main character running away immediately and coming back, detectives with no brains, the stereotypical religious man who liked children, etc. The main character's background was also generic. The ending was dreadful, some of the dialogue was rather cringe, the pacing could have been better because the timeline was messy, the acting was generally unimpressive, Natalie Portman had a bad British accent, there was limited action, the cinematography was dull, the visual effects were dated, the sets/props/costumes were make-believe, and the soundtrack was nothing special.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Visually superb, very well acted, superb manipulation from McTeigue throughout and throughly engaging from start to finish.",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "Interesting premise, pacing feels sluggish at times but otherwise worth the watch. I can see this film becoming a cult classic in years to come.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "I enjoyed this film. I would recommend seeing it.",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "Fantastic, and worryingly prescient, considering the events that have taken place around the world from 2020 to 2021.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "Given that this movie was released in 2006, the similarities to our society in 2021 are scarily familiar. The plot depicts a government that uses manufactured \"fear\" to manipulate its population into giving up their civil liberties in return for \"protection\". The government uses tactics such as terrorist threats, killer viruses, selective news and mass surveillance to keep its population in line. The masses are placated and distracted with cheap sensationalist tv trash. At this point, you could be forgiven for mistaking this review for a commentary on our current society. Make no mistake, this movie well deserves a 'must see' rating. 5 stars for pace, script and superb performance all round. Add this one to your collection ASAP.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "Absolute classic. Must see.",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is a legitimately mesmerizingly excellent film, telling a puzzle-box of a story, filled with an intense amount of emotional catharsis, showcasing amazing cinematic production values, a potent Directorial vision, and best of all, actually has something of genuine meaning to say.  It's not only a clear message but it's a very powerful one, and while it was an exaggeration, it did seem relevant during the Administration at the time, and seems considerably more as of recently.  Hugo Weaving is able to convey a more intense emotion than most other leading characters, and this is purely with his voice and mannerisms, as his face is invisible the entire movie.  This is seriously bolstered by amazing Direction which not only gives the movie an intense cinematic flair, but really knows how to punctuate and accentuate each of the more emotional beats of the movie, of which there are several.  It's climactic and entertaining, but poignant and surprisingly hard-hitting, and honestly I think it's one of the most powerful and impactful Political movies ever made.",
            "review_date": "2021-10-14",
            "source": "rt"
        },
        {
            "content": "Amazing movie great acting, writing is incredible and cinematography is a gorgeous absolute masterpiece of comic book genre and a good adaptation of the graphic novel that shows the danger of authoritarian government and limiting of persons basic freedom that is closely related to how real-life fascistic governments work. 10/10 worthy artistic masterpiece.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "As an action movie- V for Vendetta is a fun time with some thrilling sequences and memorable performances from both Portman & Weaving. It isn't the brilliant social/political critique that some people seem to think it is. While clearly borrowing heavily from some of the great political fictions- this is not even close to 1984, Animal Farm, or Brave New World by any stretch of the imagination.  The message is vague & general enough for people of various political inclinations to conclude this is a film that preaches their own beliefs. Obviously totalitarianism is bad, but this movie is a pretty simplistic depiction of totalitarianism & its effects on a society. The bad guys (in this story only being the top authorities) are cartoonishly evil, while the citizenry is depicted as innocent, apathetic, zombies who only can be shaken from their stupor by explosions. The complex reality of a totalitarian society, and the fact that citizens often carry as much of the blame as the immoral leaders they follow, is completely breezed over. A major issue I have **SPOILER** is the middle act where V fools Evey into thinking she has been captured by the government and then imprisons and brutally tortures her for days, (if not weeks or months? the timeline isn't made clear) before finally convincing her that death is imminent . They breeze over the fallout of this evil, insane act by V as him simply trying to \"cure Evey of her fear\". After a quick scene of dialogue where Evey is understandably enraged at the psychotic, violent behavior of V- things quickly move along. Shortly after she is seen mourning his death and justifying his actions as necessary- with the writers clearly assuming the audience will feel similarly. Sorry, but I don't think it's possible to have a character act as an evil psychopath, and then remain as the protagonist who we are meant to root for. The attempt to justify it by saying Evey needed to be freed from fear is laughably bad, and is terrible writing. V's action here also invalidate any moral superiority he wants to claim over the government. He is essentially the exact same monster they are, committing atrocities in the name of the means justifying the ends.",
            "review_date": "2021-09-14",
            "source": "rt"
        },
        {
            "content": "First of all, I never read the graphic novel it was based on so I cannot compare the movie to that. Second, I am American so I cannot view it from a British perspective-and I've noticed a lot of Britons and/or readers of the graphic novel disliked this film.\n\nBut I did already know that Guy Fawkes was a Catholic terrorist who tried and failed to blow up both houses of Parliament in response to the British persecution of Catholics in his era. (We Americans aren't complete ignoramuses after all.) Yet the character V, who evidently models himself on Fawkes, supposedly intends to destroy the fascist government ruling Britain by blowing up Parliament and other major British symbols, evidently with the effect of returning the country to something better-anarchy? Democracy? The movie simply ends after Big Ben and Parliament are blown apart.\n\nThe totalitarian government uses Christianity as a means of oppression, even though modern Britain isn't strongly religious. Also, a homosexual has a copy of the Koran and loves its poetry, which is tantamount to a Jew enjoying Mein Kampf, neither of which are symbols of freedom. And what of V having a basement full of forbidden antiques-how would someone like him have the time and energy to accumulate all this? And how does he manage to make and send all those masks to the public in a society where everyone and everything is being watched? That spoiled things right there-along with all the people donning V costumes and walking up to Parliament, past armed soldiers, unmolested? The whole thing gets ridiculous.\n\nAnd as for V himself, he's supposed to have been badly burned in a fire which ruined his flesh, yet he's super-adept physically and can speak normally. And he personally deceives and tortures his protégé to cure her of fear-and she still sticks by him and speaks admiringly of him in the end.\n\nThere's more, but I think I said enough already.",
            "review_date": "2021-08-29",
            "source": "rt"
        },
        {
            "content": "Entertaining and interesting and stylish. No need to pretend there's any political substance or any serious allegory.",
            "review_date": "2021-08-15",
            "source": "rt"
        },
        {
            "content": "Esta pelicula es emocionante, visualmente atractiva y algo realista con la realidad de los gobiernos",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Fantastic adaptation of what communist Victoria has become",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made! Eerily similar to what is happening in America today. However, it is the left that is rising to power, gaslighting and controlling the country, not the right. ",
            "review_date": "2021-07-09",
            "source": "rt"
        },
        {
            "content": "As someone who hasn't still read the comic, I must say it's very entertaining and not rushed,\nuntil the third act, where the \"Gran finale\" doesn't hit as powerfully as expected and promised.",
            "review_date": "2021-06-16",
            "source": "rt"
        },
        {
            "content": "Beatiful film, impressive screenplay, a story telling that thrilled me from the beginning to the end.",
            "review_date": "2021-05-21",
            "source": "rt"
        },
        {
            "content": "A quick explanation, I'm a bit of a fan of the original, maybe if I wasn't I would like it more... The problem is I feel like the movie just messed up so much of Alan Moore's work. Important scenes were removed or simply mashed together. The character's and their relationships to each other were entirely changed. And the ending felt like it took the grandeur of the original and made a farce of it. But maybe I'm being a little too harsh, it wasn't exactly terrible, just make sure to read the graphic novel first.\n70/100",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "A more fitting title would be \"P for Portman\"",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "Simplifying, a masterpiece",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "One thing is to adapt, another to completely butcher the graphic novel. To give them the benefit of the doubt it's not eassy to adapt Moore's work, but to make people belive this is what V stands for is sacrilegious. Beyond this it's an awfully directed film, there's too much wrong with it from how they are speedrunning the entire plot, making the powerful moments lame, spoon feeding exposition,... It juts doesn't end. It truly feels like an insult to the people who reed the comic. \nIf you happen to be reading this and think im just a hater please go to the original work and come up with your own conclusions.",
            "review_date": "2021-04-16",
            "source": "rt"
        },
        {
            "content": "When V for Vendetta released in the cinemas, British critics called the film \" very superficial \" so decided not to go and see it in the cinemas. Then bought a DVD in 2007. I thought the film was ok.\n\nWith today's current climate I can easily say that the film almost predicted that what kind of crazy world we would live in. Some people would be offended by the story. I must say this is absolutely the film's ultimate goal anyway.\n\nV for Vendetta has aged very well in many ways and a must-see",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "Filmmaking perfection.",
            "review_date": "2021-04-09",
            "source": "rt"
        },
        {
            "content": "I remember watching this film when I was younger and I loved it. Now watching it again   now that I'm older and I still really enjoy this movie. The acting is good, the action is on point and the message is good. Just a great movie",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "Very good adaptation of one of the darker stand alone comic stories out there. 15 years on it still stands up beautifully.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "De las mejores peliculas que he visto.",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "Hands down my favourite movie of all time! A total guilty pleasure for me, I watch it at least once per year and it never gets old.",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "Truly Unique\nThere are some that will, upon seeing this film, say that it was akin to Andrew Lloyd Weber attempting to make a political statement: overly dramatic. These people would be well served to remember that the symbol of drama is a mask, which certainly begs one important question- Why, if you are so put off by an overtly dramatic motion picture, would you choose to see a movie that stars as the (anti)hero a man in a mask? I just saw this film at an advanced screening and I must say it is nothing short of uniquely brilliant. Entertaining from the start, V manages to combine a strong socio-political message in a compact and highly intense experience. Infused with issues and concepts that pervade in the global political climate of our times, this movie is endowed with a tremendous timely relevance that belies its trappings as a mere action adventure.\n\nThe acting, the cinematography, the effects, and the general vision of this film all lead me to believe that it will likely receive a cult following. It is only my hope that the message of this film will come to summarize the history of our future ascendancy to true liberty.\n\nAsk not what your country can do for you, but what you can do for your country. In the meantime, go see this movie.",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "I was blown away by how much I liked this movie. Holy crap. V is one of the most interesting characters I've come across. His lines are all but poetry, and he is able to captivate the audience without ever taking his mask off. Plus, I thought the actions scenes were really well done, and I'm usually not that entertained by them. Very thought-provoking reflections on politics, definitely resonated with they modern day.",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "he entertained me and is politically committed",
            "review_date": "2021-03-04",
            "source": "rt"
        },
        {
            "content": "LOVED IT. Rather timely. Great plot and loved the cast.",
            "review_date": "2021-03-03",
            "source": "rt"
        },
        {
            "content": "This movie is reallyyyy goooood. Amazing political thriller. Natalie Portman give an amazing performance as well.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is an interesting film. There is a lot of action and violence. However, it was hard to understand. I think teenagers will enjoy it for the violence, but not the plot. This is because there are stronger themes demonstrated that we will most likely not catch. One is the symbol of V, or what he represents. Now the answer could be that he represents revenge, but I feel there is something deeper. However, the main theme of freedom is clearly presented.",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "Top 10 favorite movies",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "Awesome and iconic film",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "seems to be aging nicely",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "An extremely underrated film which near managed to predict the future, just in the wrong political direction.\nHuge Weaving does amazingly, I absolutely love V. He's nearly willing to go to the same lengths as those he fights against, but he's just shy, partly because of what remains of his humanity.\nNatlie Portman, i'm conflicted about, she acts well, her near solo portion of the film has an important message, but i can't say i enjoy watching it that part much. It resonated emotionally though.\nThe movie doesn't have that much action, but what is there is most excellent, when V does his 'fancy karate gimmicks' its quite good.\nFor some reason people who dislike the film say the ending is bad, but I disagree, the ending is the most powerful part in my opinion, that when its left up to people, they will err on morality rather than not. That V, his mask, was a symbol, an idea, ad that can transcend one person, or even many people.\nThe movie has some small problems, i'd give it a 9.75, and would recommend it as required watching considering 2020 happened.",
            "review_date": "2021-01-11",
            "source": "rt"
        },
        {
            "content": "Brilliant film. Incredible script, great acting, and terrifying yet exhilarating. One of the most underrated films, in my opinion.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "The movie for V for Vendetta is an insightful portrayal of the graphic novel version Alan Moore had illustrated. Both the graphic novel and movie are about the dystopian society in which the regime Norsefire control England. The story conveys the conflict between the oppression of fascism that the authority inflicts, and the desire for the citizens to rebel against the suffocation. \n\nIn general, there are various differences between the graphic novel and the film depiction of V for Vendetta. For instance, during the beginning of the film, Evey was depicted as girl who was desperate to leave V, and had even confessed to the priest to save her. Following this, she chose to escape V and consequently met Gordon. In comparison, the graphic novel gave the impression that Evey was on V's side and supported him. This is because she had played along in a few of V's schemes and she didn't try to escape, on the contrary, V had told her to leave. In general, these subtle portrayals of Evey can have different impacts on the readers. For instance, by having her be on V's side from the beginning reflected that majority of the citizens are against the Norsefire and it also portrayed V through a heroic lens (ironically, despite the fact that he destroys and schemes). On the other hand, the other portrayal was a more realistic response to being in Evey's position, taking into consideration V's capabilities and murders. \n\nIn addition, the resolution of the film concluded with all the citizens wearing V's masks. This is extremely different from the graphic novel, and it offers strong symbolic significance. The mask itself symbolizes the defiance against the government and the oppression they inflicted. The fact that everyone chose to wear a mask at the end reveals that majority of the people were against Norsefire, which in turn creates the impression that the people are more powerful as a whole. By having V by himself wearing the mask, left him alienated from majority of people. This thereby expressed that he was the only one—or one of the minority—who felt this way about fascism. By having him alienated, emphasizes how powerless he is towards his cause. However, with the incorporation of everyone wearing a mask, emphasizes that he is not alone, thereby bringing power to the people. Along with this, the concept of all the citizens wearing masks lessens the significance of V's identity, and more of the concept of V.\n\nOverall, though there may be several variances between the graphic novel and the film, both are very anticipating and immersed with symbols and allusions.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "It starts so well.  Again, that long v-word speech is a glory to behold but nothing as dialogue-clever happens again.  There are lots of highbrow characters coveting their highbrow works of art and porn (Stephen Fry I'm a looking at you).  And the only prole-characters we meet (the girl with glasses et al)  seem a bit like mindless dress ups.\n\nIt's not bad, but I was getting bored by the end.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is not perfect, but it is still kick-ass enough to warrant watching at least once. It's not doing anything most other films haven't done in the past, but its cool style and character writing are truly something to behold.",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "Always loved it and Natalie Portman is a treasure. Watching it in 2020 during this \"pandemic\" will have your brain spinning",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "I didn't realize that this was also produced by the same people who directed 'The Matrix'. I'm not a fan of this. The story just wasn't compelling. I didn't connect with either of the protagonists to the point where I was cheering for their success or afraid for their failure. The script tried too hard to be poetic and deep. I never quite got the connection to the opening scene. (Did they forget to circle back?) It's not completely meritless, but I just wasn't emotionally engaged in this story.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "Perfect. Well written, directed and acted. Best film I've seen in years.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "This is a phenomenal movie that is slowly and terrifyingly becoming reality with its totalitarianism. This fictional government is becoming true in so many countries. That being said, this movie is powerfully acted (particularly Portman and Weaving), beautifully shot, flawlessly edited and well-directed with some great action sequences.",
            "review_date": "2020-12-07",
            "source": "rt"
        },
        {
            "content": "6 bags, V cared all along he just had a funny way of showing it! when this movie came out, it seemed like an impossibly bleak, dystopia vision of the future. Now, we call it Tuesday!",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "V for Very good, with a few flaws and weak character development. ",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "Crazy off the rails storyline; always engaging even if it sometimes seems artificial and superficial often; Portman excels as expected at the edges of emotion and physical action",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies ever! And I saw it on November 5th!",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Great political movie.  Hugo Weaving was amazing as V.",
            "review_date": "2020-11-08",
            "source": "rt"
        },
        {
            "content": "Anarchy leading the way to revolution!\n\nJames McTeigue's political action thriller V for Vendetta (2005) is a phenomenal masterpiece adapting Alan Moore and David Lloyd's graphic novel of the same name. You will be engaged by the creative action choreography, cool visuals, and absorbing performances. V for Vendetta forces you to ask yourself what you think of your own government and responsibilities as a citizen with rights. V for Vendetta is one of the coolest and most memorable pictures I have ever had the pleasure of watching. Do yourself a favor and give V for Vendetta and Moore's revolutionary ideas a chance. I'm sure you will enjoy it and one day appreciate its deeper ideas.\n\nNatalie Portman is devastating as the likable and sympathetic young revolutionary Evey Hammond. Her shaved head is striking, but it's her hurt eyes, shaking body, and tender voice that captivate just as much as her lovely looks. Portman is an outstanding actress and V for Vendetta is one of her best roles alongside Leon the Professional, Black Swan, and Jackie. She has sincere chemistry with Hugo Weaving's mysterious and majestic V. \n\nWeaving's commanding body language and deep voice give V the gravitas and presence necessary for V for Vendetta to be so powerful a picture. Weaving delivers monologue after monologue, joke after joke, slash after slash, explosion after explosion, and mesmerizes you entirely throughout V for Vendetta. Hugo Weaving gives us one of cinema's most magical performances just with his expressive body language and vulnerable voice. Weaving is certainly one of the greatest actors who ever lived.\n\nStephen Rea is compelling as Chief Inspector Eric Finch. His face rumbles over each clue and gives each piece of information meaning. He's a fantastic stand in for the audience slowly uncovering the dread truth of V for Vendetta's secrets. Rupert Graves is excellent as his observant and steadfast partner Dominic. Stephen Fry is funny as the television comedian host Gordon Deitrich with his natural charm and silly persona of whimsy. Tim Pigott-Smith is perfectly stern as the cruel SS parallel Creedy. \n\nNatasha Wightman is peerless as the lesbian lover Valerie Page in the moving montage in the middle of V for Vendetta. Imogen Poots is wonderful as a young Valerie Page. Eddie Marsan is fun as the cowardly sycophant Etheridge. Roger Allam is disgusting as the vile conservative reporter Lewis Prothero. Ben Miles' Dascomb fits the ever loyal media leader following the government's every word aptly. Lastly for the cast, Sinead Cusack is great and touching as Dr. Delia Surridge.\n\nMcTeigue's masterful direction is completely enthralling as you are thrust into a moving story that parallels real life crimes against humanity carried out by Adolf Hitler, Margaret Thatcher, and Donald Trump's tyrannical conservative administrations. The concentration camp comparisons and lesbian life story told in the middle of V for Vendetta are as brilliant visual storytelling as any director has captured. He tells Moore's important and influential story about how fascism can rise to power after tragedy through a vulnerable and angry general population grown complacent to atrocity. Moore significantly shows how a government controlling the media, military, and police can censor all with propaganda and control the public with fear and violence. \n\nLilly and Lana Wachowski brilliantly adapt Alan Moore's original words for the silver screen with a deft understanding of how he desired to demonstrate how anarchy can combat fascism in England and elsewhere. It's a shame Moore doesn't like this adaption because V for Vendetta remains one of the most striking films you'll ever see.\n\nMoore's writing is visceral, intelligent, researched, compelling, thoughtful, and timeless as we've sadly seen dictator after dictator come to power across the globe in similar fashion to Sir John Hurt's Chancellor Adam Sutler. Rest in peace to one of humanity's greatest actors as Hurt intensely commands your attention as the ferocious and raging authoritarian leading the hateful, racist, Norsefire political party that parallels modern day Republicans far too close for comfort. Hate breeds hate and V for Vendetta teaches us that only the brave citizens willing to die to stand up to evil powers can snuff out such hate-mongering flames.\n\nMartin Walsh's editing is slick with clever cuts to similar looking characters, expressive montages, and harsh cuts during action all for a smooth and hypnotic feel to V for Vendetta. It's a solid 132 minutes, but feels half that length. Adrian Biddle's cinematography keeps faces zoomed in and action as wide as possible for a stunning dichotomy. Owen Paterson's production design looks futuristic in as realistic a way as possible for this dystopian London. All the black and red set decoration is striking and unforgettable. The knife trail special effects are timeless and as cool as anything physical combat sequences ever filmed.\n\nDario Marianelli and Benjamin Wallfisch's score is mesmerizing. All the classical compositions are nice choices for inspiring a beautiful political revolution. I adore Natalie Portman's shaved head haircut and V's Guy Fawkes' mask. His all black cloak and armor make him appear like a shadow or an idea of a superhero for the masses that we so desperately need. In all, I suppose we'll all have to act, vote, and organize every election to keep authority in check.",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "One for the ages. Brilliant way to spend the fifth of November.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "I loved V for Vendetta. It has action, well-written characters and a strong plot. Spectacular performances by Hugo Weaving and Jane Foster, as well. It is a social debate and a strong story! I loved it.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "Great story line, well designed & delivered lines, lots of action.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "Way too long. Preachy. A descent story lost it's own self righteousness",
            "review_date": "2020-11-04",
            "source": "rt"
        },
        {
            "content": "First time seeing on the big screen- so excited to see this at this time!",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Saw this for the first time during 2020 (COVID) and was blown away!  Natalie Portman is excellent, and the storyline in some ways applies to the current political strife.  Even down to the virus implications.  Outstanding!",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "ALWAYS been a favorite. For going on 15 years now. I was THRILLED it came back to theaters.",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Alan Moore's V for Vendetta is a literary classic that sheds light on the hypothetical injustices in modern London. The story is set in the late 2020s and draws many parallels to the present day between the way the government was portrayed, the media's depiction of the events occurring, and the way people didn't question any of it until someone brought an idea to light. Whether you love or hate this film, you can't change the fact that the script/dialogue and casting are ingenious or that the themes are influential. \n\nV for Vendetta depicts a modern London under the rule of a fascist Chancellor Sutler. Throughout the movie, V, played by Hugo Weaving, is seen as a controlling hand that changes London for everyone around him. V is protective of Evey Hammond, played by Natalie Portman, from the very beginning of the film. Everything he does seems to be to help someone else. He begins by protecting Evey from others, so she returns the favor. He tries throughout the movie to help her see his perspective. They help each other throughout the movie to see the world in a new light. V helps Evey to see the truth about the fascist government and what they were trying to keep hidden as well as his reasoning for his actions throughout the movie. Evey gives V the chance to learn to love again. \n\nA crucial detail that makes a movie what it is is the script and the dialogue between characters along with the characters themselves. V for Vendetta did not disappoint in this aspect. With lines that are delivered beautifully by the actors and actresses, the script packs a powerful punch. The script, dialogue, and casting all come together to get the theme of freedom across. \n\nIt could be argued that this movie is a bit of a controversy. While it was good, certain details can't be overlooked. For example, V and his ability to completely take over British television. Since the movie is set in a futuristic time and a fascist England, you would think that national broadcasting would have plenty of security and be difficult to hack. However, V makes it seem simple and can broadcast with no issues. Another example is how easy it was for V to send mass mail packaging; I'm talking hundreds of thousands of items delivered to the people in London. Those details along with the fact that this movie encourages government overthrowing make it a bit of a controversy. \n\nThe story depicted in this movie is both heartfelt and eye-opening. The lack of romance between the characters allows the story to progress without interruption or distraction from the plot. V for Vendetta reveals the dangers of discrimination and hate towards others as well as the impacts of authoritarian rule.",
            "review_date": "2020-10-29",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is a dramatic thriller about a vigilante known as V who protects the life of a woman named Evey. As she's about to be attacked by a group of men, V's heroic characteristics come out to save her. This movie tells that V wants to save this girl's life and the world from corruption and control within the government. One of the great qualities this movie has is the effects and action throughout the film. The acting is outstanding even when the main character is under a mask. V uses quick gestures and super-human strength. He is the masked manipulator that has no problem resorting to violence to save the world. The relevance of this action-driven adventure is spot on. When the movie came out in 2005, it felt eerily dystopian. The political issues and ideas that occur in real-time are taken a few steps further without seeming unrealistic in the film as people view it today.\nV is exceedingly well-spoken. V is a man who wants tyranny to end and uses eloquent language, at times, with alliteration to make his point. The movie begins with, in my opinion, the best quote of the movie. \"Voilà! In view, a humble vaudevillian veteran, cast vicariously as both victim and villain by the vicissitudes of Fate. This visage, no mere veneer of vanity, is a vestige of the vox populi, now vacant, vanished. However, this valorous visitation of a by-gone vexation, stands vivified and has vowed to vanquish these venal and virulent vermin vanguarding vice and vouchsafing the violently vicious and voracious violation of volition. The only verdict is vengeance; a vendetta, held as a votive, not in vain, for the value and veracity of such shall one day vindicate the vigilant and the virtuous. Verily, this vichyssoise of verbiage veers most verbose, so let me simply add that it's my very good honor to meet you and you may call me V.\" He literally describes the entire movie in one long passage full of alliteration; essentially, V is saying that he is neither villain nor victim but is seen as both. He seeks to help the good and eradicate the bad. Followed by, oh, in case that was hard to understand, my name is V. The script is chock full of well-written lines that show a seemingly villainous man in a light of intelligence and freedom. At one point, he is near death and states, \"Beneath this mask, there is more than flesh, Mr. Creedy. Beneath this mask, there is an idea. And ideas are bulletproof.\" At times though, I found myself wishing that I had a dictionary and closed captioning to really understand what V was really trying to say.\nAs the film comes to an end, the resolution was upsetting. The storyline is so dramatic I expected more. I anticipated finding out the masked vigilante's true identity and him being this living hero. In the end, V notifies people of the date on the Fifth of November. He said the significance of the date in a news broadcast that he took over. He said for people to meet on that day and march against the controlling and evil government. Evey, in the end, explains V was her father, mother, brother, herself, etc. She said people would remember what he did for the world, but she will remember who he is for all he did for her.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "Its decent, the highly enticipated ending was kinda shit.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is a 2005 dystopian political action film directed by James McTeigue 🍿 \n\nIt's good 🙂\nI'd recommend it if you like this genre 👍🏼\n\nPEOPLE SHOULD NOT BE AFRAID OF THEIR GOVERNMENTS. \nGOVERNMENTS SHOULD BE AFRAID OF THEIR PEOPLE.",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "It's perfect!\nOne of the best movies ever made.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "One of the greatest comic book films ever. Outstanding performances from Natalie Portman and Hugo Weaving. It was interesting to see the UK government ruled by a Far Right political Party and America going into civil war for the 2nd time. Evey and V had an excellent relationship. V for Vendetta is actually my favourite political film ever.",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "Incredibly apropos. May be one of the most important films for 2020, right up there with CONTAGION. A must see...again.",
            "review_date": "2020-09-16",
            "source": "rt"
        },
        {
            "content": "Pretty good action movie starring Natalie Portman. I'll forget this movie in about a week.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "A great thought-provoking film on how corrupt societies can be rescued by the people. Nice acting and decent action films. The heavy symbolism and poetic justice may be much for some, but the film still stands with its plot.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Es interesante que sea una película muy poética, la trama esta bien ejecutada, tiene personajes memorables y fascinante visualmente hablando",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "V For Vendetta is a hidden gem in my opinion especially when you have the balls to make a movie about a terrorist only 5 short years after September 11th 2001 the story is fantastic! And the action sequences are worth the build up absolute must see for anyone that loves the matrix or the comic book or you can see it yourself",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "Just watch it now in 2020, and draw your own conclusions.",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "An excellent adaptation of Alan Moore's iconic graphic novel. A brilliant political and social satire with stylish visuals, thought-provoking and relevant themes, thrilling action sequences, a gripping narrative, impressive set pieces, compelling performances and a dark atmosphere, making it a disturbing but intriguing and nonetheless entertaining viewing experience.",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "This was very entertaining and thought-provoking. A lot of countries should have a masked man like this.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "Probabilmente uno dei film più insensati che abbia mai visto. Si lascia guardare fino alla fine, ma è una visione passiva e a tratti incredula. Il soggetto sembra essere stato scritto da un bambino appassionato di superereoi. Il protagonista compie imprese eclatanti... semplicemente perché è il protagonista. Se ne va in giro a dispensare frasi fatte e troppo spesso insensate sulla vita e sul perché fa ciò che fa, ma nel frattempo continua a uccidere come se niente fosse. Si innamora della co-protagonista... semplicemente perché è la co-protagonista. In alcuni tratti in cui il film avrebbe dovuto rallentare per spiegare meglio ciò che stava accadendo (la genesi di V, solo per citare un esempio), invece si ha la brutta sensazione che tutto scorra asettico e sterile. In altri punti trovano tuttavia il tempo d'inserire scene del tutto trascurabili e (di nuovo) insensate. Terribile.",
            "review_date": "2020-08-13",
            "source": "rt"
        },
        {
            "content": "Interesting at all\n\nToda iconografia relacionada ao V é, no mínimo, interessante. Acredito que nos dias de hoje, o filme leve o público a uma discussão bem interessante e necessária. Claro que já vimos um cenário parecido com o do filme na vida real diversas vezes. Mas porque o repetimos? E nessa década em específico, nunca foi tão fácil encontrar um grupo de ódio sobre diversos assuntos.\n\nA voz de V é muito peculiar e bem interpretada. Gostei muito de não terem mostrado seu rosto, o que seria um apelo hipócrita. Natalie Portman não me convence muito, mas devo admitir que ela é esforçada. Gostei também de Stephen Rea como uma espécie de Detetive. Se tratando do personagem, acredito que o desenvolvimento deve deveria ter sido mais impactante, mas eu entendo que o propósito foi entregue e concluído.\n\nPor fim, o filme tem um enredo gostoso de se acompanhar. A face misteriosa do V carrega um suspense imenso. \"O que, quando e porque?\"\nAqui as respostas são satisfatórias e refletem muito bem a realidade.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Great film with some very interesting and compelling themes as well as great performances.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "V for Vendetta was directed by James McTeigue and written by The Wachowski Brothers (The Matrix trilogy). Starring Hugo Weaving, Natalie Portman, Stephen Rea, and John Hurt.\n\nBased on Alan Moore's amazing, eye-opening and futuristic graphic novel, this movie takes place in a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.\n\nThis movie is very controversial, back when it came out in 2006 people said that this movie is encouraging terrorism, it came out 5 years after the 9/11 tragedy, and that wasn't a good time for a movie like this! People started judging this movie, and it didn't get the appreciation or the ratings it deserves!\n\nAlan Moore himself didn't want his name to be written on anything in the production, not even on the screenplay, he didn't even see the movie, he skipped all the premieres, and he said that he feels \"vindicated\". This movie is one of the biggest controversies of all-time!\n\nWhat upsets me is that people seem to forget that this is just a comic book movie and that it's even very faithful to the 1989 graphic novel, but people weren't so aggressive on the graphic novel because it came out in time that the internet wasn't such a big deal, but when the movie came out, which wasn't that very much different of the graphic novel, they were so aggressively criticizing it, just like what happened with the 2019 Todd Phillips' Joker, which is very sad because people don't look at the movie as a whole and get what it's trying to tell us or show us, they just look at one minor thing and they just sit down and trash it!\n\nThis movie is NOT encouraging terrorism, it's encouraging our demands for freedom, and to take what authority is taking from its people, in the form of a \"terrorist\", though I don't like to call him that!\n\nNow let's talk about the movie itself.\n\nFirst of all, what's so hard to neglect, the performances! Everyone in this movie did an amazing job, especially Hugo Weaving who was wearing a mask for the whole runtime, and still we could see and feel every emotion and every reaction and his face, he delivered an amazing character without even seeing his face! And that was great, I liked that for the whole movie we didn't get to see his face at all and that even when he took off his mask in one scene his face was so shadowy that we couldn't see it, that shows that, as he said, the mask is now his face and not the one beneath.\n\nNatalie Portman is also great in this movie, everyone is great in this movie, there isn't one bad performance or even a character that was badly built, everyone was great!\n\nThe plot is very intriguing, it's very easy to start this movie not that interested, and within a couple of minutes you just get very hooked, and that's where McTeigue shines, he built this atmosphere, and this futuristic world in a way that can keep you very intrigued in no time! The plot is so smart, and the movie can help it but to get even better with each scene, the movie is always going up intensely and smartly, it never loses its mystique nor its heart!\n\nWhat McTeigue has done amazingly was the editing, though it didn't always work, and we'll get to that later, for the most part, the editing is what makes this movie very good to look at, because visually, and I don't mean special effects, this movie is just beautiful! That shows in a lot of scenes, for instance, the scene where Evey was on the rooftop, and she was walking under the rain, feeling like she's being reborn, and the shots where V was coming out of the fire, feeling like he's being reborn as well, were merged in a way that makes this scene beyond perfect!\n\nThe screenplay is also very well-written, every line was well-crafted, smart dialogue that makes this movie amazing and intriguing.\n\nYou know a great movie when you look at the main characters at the beginning of the movie, and then you check them out again at the end of it and you see how different they are, and how good they were developed, this movie has one of the best characters development in comic book movies! You take a look at Evey's character and you see her at the beginning, a very simple and nice girl, who's not that brave but still trying to protect herself, you see her at the end, and I don't wanna get into spoilers, and you just can't believe that this is her, she took her time to be \"reborn\" and that made the audience care about her very much. The same happened with a lot of characters, and a lot of characters you look at them thinking that they're not that important, or you think of them that they're those a-holes, but when you get to know their secrets or their backstories you just can't help it but to love them as well!\n\nSome people will go to watch this movie expecting a ton of action sequences like The Matrix, even the trailer showed us that this movie is gonna have a lot of action sequences, but no, this movie doesn't have a lot of that, and a lot of people will get disappointed, but for me, I don't care, the movie has a couple of that, and that was enough for me, it's the drama and the thriller that intrigued me and made me entertained, so here's the thing, don't go to this movie expecting The Matrix, it has a couple of action sequences, but that's about it, this movie is a crime, drama, and thriller.\n\nThis movie is not by any means perfect, it has a couple of flaws, and what bothered me was some of the editings, I know I said is that this is where McTeigue shines, but some of it just didn't work, for example, there's a scene with V and Evey watching the TV, and the news of the death of a certain character is being broadcasted, she asks him if he's behind this, and he confirms it, she asks him if he's gonna do it again, and he says \"yes\" and the scene ends, for me, it felt unfinished, I thought that there will be more, some kind of a conversation about why he thinks to kill is the answer, but there wasn't, and that happened often in this movie.\n\nWhat I also didn't like was the exposition scenes, it happened more often, it wasn't badly made or anything, but it was frequently used, and it didn't work for me because the movie seemed smarter than this to me.\n\nIn the end, V for Vendetta is a great comic book movie, if you liked the graphic novel, I don't see why would you hate this movie, just forget what everyone's saying about this movie, and go see it for yourself. I'm gonna give V for Vendetta an A-!\n\nThank you, guys, for reading my review, more are coming on your way!",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "Government creeping grab of totalitarian power during the pandemic was eerily foretold in this movie.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "A good screenplay with worthwhile performances by Natalie Portman and John Hurt",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "Defiantly a underrated movie that deserves much more praise than current ( sorry comic book films )that Warner bro's have made and is still relevant to this day. It's remarkable and any audience who knows about politics can relate and understand this film Natalie Portman should've earned some type of acting award in the films and the Wachowski's too that have made another timeless film that will never get old.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is full of ideas—some of which reach fruition, others do not. It can be blunt, it can be playful, it can be effective, or it can be confounding; it's really what the watcher makes of it.",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "It's a very good movie but im not a fan of the sudden romance between the two main characters we dont need a romance in every film aight especially since V dies at the end of the film. It's a very good movie and provokes thoughts and V is just a badass. I feel like they could have done a little bit more with the main Cop of this movie but besides that it's a very good film",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "Engaging, stylish, vintage and noir, V for Vendetta created an unlikely hero and a cult to follow with a complex and gripping storyline, and some absolute stunning performances by Hugo Weaving and Natalie Portman",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "This sci-fi thriller was very good. Natalie Portman, Hugo Weaving, and the rest of the cast did a spectacular job in this movie. The plot to the movie was very suspenseful and dramatic. It's about taking on a powerful government one person at a time and bringing hope to a nation. If you haven't seen this movie yet, I suggest that you check it out sometime. It's a definite must see.",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "A harrowing future wrought with disease, fear and political corruption. Poetic dialogue and a compelling narrative elevate this above your standard action flick. The parallels between this movie and the real world are alarming, but poignant.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is all over the place and a film that is hard to apply a traditional scoring scale to. It is tonally all over the place and uneven. The acting and action [which dries up after 1/3 of the way through] are both great though.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "So cheesy but that's why I like it. Plus the iconic Guy Fawkes mask is enough for these stars alone.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "This is an awesome film. Hugo and Natalie play their parts to perfection. This movie really gets you to thinking.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "Hugo Weaving is incredible as V. The script is so apt, especially today, and it's very well done!",
            "review_date": "2020-06-08",
            "source": "rt"
        },
        {
            "content": "Formulaic, and so annoying to have a main character in an expressionless mask the entire film. ",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "Definitely on the top five of my all-time favorite movie.",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "Terrible movie. Had good aspects, but the whole torture thing with Evie was terrible. She thanks him for torturing her? What the hell? After that the movie was just edgy and praised V for everything when the whole point was for you to question whether he was the hero or the villain. Hah! You think it had a good message? It had an obvious message for the whole governmental power thing and a terrible message on who should be considered a hero. I hear it was handled much better in the comics.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "A thought-provoking masterpiece that is extremely relevant in today's world.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "ما الذي يجعل مجموعة من البشر خائفين من الثورة ضد نظام ظالم، مع تمتعهم بالتفوق العددي والكيفي، وكيف يمكن ان يلهم بطل واحد شعبا باكمله ويجبره على تجاوز مشاعر الخوف.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Visually stunning and full of thought provoking and poetic dialogue, V for Vendetta is a triumph. It approaches obnoxiousness but pulls back just in time to earn your trust. Tremendous performances by Natalie Portman and Hugo Weaving are you enhanced by cinematography that leaves the viewer delightfully entranced. 5/5. ",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "This movie is really good, Evey Hammond (Natalie Portman) and V (Hugo Weaving) have some amazing chemistry with each other throughout most scenes. Also, this movie has got an interesting plot with some really good camerawork during most of the fight scenes and some of the other main scenes throughout this movie. Finally, it's got some really powerful and hearted scenes throughout with some really good effects which do hold up quite well. The only effect which sort of bugged me was probably the blood effect, it was very mixed for me there would be moments where it looked really good and some where it looked like the Mortal Kombat 2 blood effect. Overall, it's a really good movie with some amazing actors, an interesting plot and some really good bloody fight scenes, worth the watch.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "Allot of similarities to today. Disease, totally controlling govt's.  Media propaganda on steroids.",
            "review_date": "2020-03-30",
            "source": "rt"
        },
        {
            "content": "\"Ideas are bulletproof.\"\n\nWith that one line, V for Vendetta solidified its place in movie history.\n\nV for Vendetta is a beautiful masterpiece! Though there seem to be some plot holes, this movie presents its message well and is damn quotable.\n\nV for Vendetta takes place in a near-future dystopian Great Britain. It's a world where an unjust totalitarian regime takes over the government. The movie makes us question what role we have when governments are no longer just.\n\nThe lineup and acting are superb. There couldn't have been a better cast to help deliver the message behind V for Vendetta. \"V\" delivers his lines with absolute charisma and charm. There are many, many quotable lines from this movie.\n\nThe plot leaves the audience sitting at the edge of their seat as they learn more and more about V's world. The action is bloody and satisfying. The film leaves enough action to keep the heart pumping but not so much that it distracts from the story.\n\nSet design is well thought out. The use of color, darkness, and artwork adds another layer of subtlety that's beyond the initial viewing. The use of dark and dreary Great Britain with the well lit and beautiful past says a lot about the movie.\n\nYet, I will have to take off a half-star for some plotholes. EV's and V's relationship dynamic seemed forced in some areas. The matrix-style knife throwing did seem out of place and aged. And why did the comedian do what he did? Even so, V for Vendetta is a great movie.\n\nBut that ending, oh my! Instant chills!\n\n5/5. A timeless classic.",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "With an all-star cast at the height of their immense talent, stunning action sequences and a beautiful character journey, I firmly believe this is one of the best made movies of its decade.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "This loVe story and powerhouse film needs a sequel.\nThe last domino remains standing.\n-------\nV for Evey\n\nAfter the subway train rolled into the tunnel, Evey and Finch watch the destruction of the House of Parliament. Evey takes advantage of Finch's overwhelmed, fixated attention to the event and bolts into the darkness. He doesn't take chase.\n\nShe arrives at the Shadow Gallery, breaking down into a mournful despair of losing V. Exhausted by depression, weeping uncontrollably, she lays upon his bed  and \"cries a river\". The Gallery had been prepped for Evey's stay. V had stockpiled food and other supplies to assure Evey could remain in protective isolation for months, to avoid detection or capture, if she was lucky enough to return to his sanctuary.\n\nAs the subway train had rolled into the tunnel, a slight movement of V's mask indicates he's not dead but extremely weak from his injuries. Having briefly passed out in Evey's embrace, V regains consciousness aboard the train and overhears Finch and Evey's exchange, knowing too that Finch would see his body, presumed dead. Opossum.\n\nV's flash memories of Evey, her fears, tears and love, overwhelm V's initial plan to depart this world and \"meet his maker\". He wore protective armour to confront Creedy, hoping to survive his assassination but not fearing a lethal finale. \n\nThe last domino - which remained standing - represents V and Evey as one entity. They did not topple after the chain reactions they catalyzed.\n\nMoments before detonation, V drags himself to the rear door and plunges onto the tracks, crawling along the rails, away from the impending fireball. The meeting with his maker has been cancelled.\n\nOn the streets above, the aftermath of the destruction, viewed by thousands, ignites an even bigger firestorm - full rebellion and mass anarchy. Norsefire was extinguished. The democratic will of the people gains momentum in the days and weeks following, erupting in sweeping reforms and protests despite steadfast opposition from dwindling Norsefire supporters.\n\nJust before dawn, an exhausted Evey is partially asleep, her eyes bloodshot from the tears, the pillow soaked. She hears shuffling, knocking in a distant hallway. Concerned, but not fearful, of a possible police take-down or Fingermen, she grabs one of V's knives and sneaks towards to sound. She is astonished, dropping the knife.\n\nHe is aliVe, barely. V slumps over to Evey and is helped to the bed. Blood-soaked, dehydrated, damaged furthermore, he recalls his memories of Evey and his intense love for her. V had wanted to abandon his life in the new world but he could not abandon Evey after all. Evey deserved more than a memory of V and V yearns to be with his beloved soulmate.\n\nAs V lays in the bed, Evey removes his boots, comforts him with blankets, tends to his wounds and offers water through a straw knowing how he was unwilling to remove his mask. As Evey briefly turns away, reaching to the nightstand for the water bottle, he pulls his mask up, revealing his face only to her. She turns toward him with the water and is momentarily paralyzed with shock. She glances over his features and slowly manuevers the straw towards his lips. He drinks the bottle empty, exhaling in relief. Evey, staring directly into his eyes as V extends his un-gloved hands, gives him a gentle, prolonged  kiss on the lips.\n\n\"Thank-you\" he replies in a whisper. He falls asleep with Evey at his beside.\n\nBy evening, he is gently propped up with pillows and Evey helps him to turn to his left side to change his bandages. He quietly requests an extra blanket as he feels cold. As a fresh blanket is carefully pulled toward his right shoulder, and his exposed hand is positioned for comfort, Evey's hand caresses his forearm as she snuggles up against his back. V's head lifts slightly and lowers back onto the pillow as he sighs with a sense of relief and peacefulness. He cradles her hand and the two drift asleep, embraced, keeping each other warm, secure and united.\n\nEarly morning, V awakens to Evey's offer of an egg and spinach omelette. Spoon fed, he devours the whole delicious meal. Evey asks if he wants more and replies \"perhaps a little later, near lunchtime. It's very good.\" Evey helps him to the bathroom and promptly orders him back to bed to rest further. \"oui mademoiselle\" he replies to her compassionate directions. \n\nAt lunchtime, as Evey is preparing another omelette, she turns to find V slowly approaching the kitchen table. Wearing pajamas, V had taken a refreshing shower and wanted to dine with Evey. He had never eaten a meal with anyone in his home before. She cuts up his food but coddles him to feed himself, assisting him to pick up his fork. \"And straight back to bed when you're done eating, Mister. You need to rest\" she whispers, nuzzling against his ear.\"oui mademoiselle\" he replies again, followed by a kiss on her cheek. \n\nFor weeks, she helps him get out of bed to bathe, encouraging him to walk, stretch, regain his physical strength. She helps him with basic physiotherapy manuevres, rotating his right shoulder socket, knee bends, gentle back massages. In a bath robe, he soon relishes in slow, gingerly sword fights with his statue suit of armour, its bullet-ridden breastplate reassembled. V and Evey strengthen and heal each other, as the world outside also heals.\n\nAs Finch is completing his report of the bombing, he falsifies his recollection of events and claims that he witnessed Evey and a dead V were both aboard the train and therefore had both perished in the event. No more suspects are believed involved nor sought. Case closed.\n\nSociety undergoes more democratic, civilized re-structuring amidst new elections. Criminal charges are brought against hundreds of Norsefire Fingermen and their associates. Citizens stroll the streets without fear of persecution or attack. V, having lost some of his fighting finesse, remarks to Evey how difficult it would be to continue as a freedom fighter vigilante. Evey responds \"you don't have to, it's not necessary, you're retired now\". V chuckles. They embrace and he asks her to dance, again.\n\nOn the following November 5th, V and Evey take an evening walk, both wearing Guy Falkes masks, as do so many others citizens, and blend into the street celebrations. Later in the night, from a rooftop, they embrace each other as they reVel in a new world they both inspired to create.\n\nThey are amongst us in our reVelution.",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "The polarity of emotions, politics and ideologies make this one of the most moving films I've seen. How it ends is heartbreaking, not for the destruction of a building(s) themselves and their fascist tenants, but for the demise of a freedom fighter's belated sense of love and longing.\nI would immensely anticipate (through \"hope and wait\") for a sequel with an unexpected twist:\nhttp://members.distributel.net/~artemis/vendetta-sequel.txt\nV deserves a better fate with Evey and Evey deserves more than a memory of V.\n\nV for Vindication, V for Valor",
            "review_date": "2020-03-10",
            "source": "rt"
        },
        {
            "content": "It's good. ‏‏‎ ‎‏‏‎ ‎",
            "review_date": "2020-03-07",
            "source": "rt"
        },
        {
            "content": "Truly a great movie. Strong plot, colorful special effects, excellent acting. So here in one review and you can't meet it. \"V for Vendetta\" is a film that is not talked about. You need to see him. And then you yourself will understand everything. He made me think a little and stop using Telegram. I do not want control over myself - I use Utopia p2p.",
            "review_date": "2020-02-28",
            "source": "rt"
        },
        {
            "content": "Important piece of film about why government can not have more power then the people.",
            "review_date": "2020-02-15",
            "source": "rt"
        },
        {
            "content": "V for vendetta is a modern, thought - provoking masterpiece.",
            "review_date": "2020-02-09",
            "source": "rt"
        },
        {
            "content": "It is really diferent to the comic and it have some \"Imagination\" in it. But you know, it works well, the action scenes are good, dynamic and interesting. Also the argument of the movie feel really \"anarchist and amazing\" so, it isn´t the best but it really works.",
            "review_date": "2020-02-03",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie!",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "If you can get past the terrible accent Natalie Portman wears in this masterpiece it's a fantastic movie written with superb dialogue.",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "I catch it whenever I can.   Always thought provoking.",
            "review_date": "2020-01-11",
            "source": "rt"
        },
        {
            "content": "Portman's wooden acting aside, this is a great movie. Daring, exciting and with some great dialogue from the source material, V for vendetta is an important message for our times. Whilst Moore has distanced himself from any adaptations of his work, this is an entertaining film with a cautionary message that must never, ever be forgot.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "A thoroughly engrossing and bizarre thriller. Based on a comic, it does what every adaptation sets out to do, portray an excellent story to a big screen audience. It does a brilliant job creating a sense of leadership fear and it provocatively captures the atmosphere of a society charged for rebellion. It is visually stunning, darkly colourful and flamboyantly subtle.\n \nIt does over exaggerate it's points a little and dwell on the action scenes a little too long. However, it has some really good ideas and manages to deliver on most of them. If nothing else, it is an engaging movie and that is why it has become a Cult Classic.\n \nIt turns out V is for Very Good!",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "I watched this Film twice to really understand it and I enjoyed it",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "it's a very exciting movie and has an unexpected ending",
            "review_date": "2019-12-05",
            "source": "rt"
        },
        {
            "content": "Amazing commentary on how easy totalitarianism can infiltrate even advanced societies like the United Kingdom and raises the question of if we're already living in it. Along with this are great performances including the legendary Natalie Portman amoung others, and an exciting plot with many twists that keeps you on the edge of your seat right up to the very end. The visuals are stunning for the budget and the presence of V, the protagonist, is ominous in the best way possible.",
            "review_date": "2019-11-25",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies, \"Remember, remember the fifth of November\".",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "Good movie, decent plot, great cast, Relatable characters, Hugo is strong as V, it follows the comic book so it'll make fans happy, and a ending that is beauty. I recommended strongly for comic book lovers and non fans",
            "review_date": "2019-11-19",
            "source": "rt"
        },
        {
            "content": "A movie definitely worth many watches to appreciate it in full.",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "Verily, this vengeful video production, full of violence, is not at all vague in its vehement societal views, and is full of both valorous and vindictive characters. A venerable film that should be viewed!",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "If you don't like then the problem is you. Not the most action packed movie of its type but man is it good. Thought provoking and inspiring. It gets better with every watch ",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "Perfect movie to see in the theater.  Never lets up on the gas pedal from start to finish.  I LOVE this movie!",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "Enjoyed the storyline. i feel like i was missing something from V and his character",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "Eu adorei esse filme",
            "review_date": "2019-11-02",
            "source": "rt"
        },
        {
            "content": "My favorite film, since it debuted in the US in 2006! The hardest part is getting past the somewhat cheesy title, otherwise...holy moly! Regardless of your political leanings, the superbly written script and monumental performances by the cast takes you on a journey into the human condition, the complexity of the human heart during a spiritual and societal awakening, but also challenges one's preconceptions about what is morally praiseworthy but not necessarily morally obligatory and vise versa, and how those philosophical idioms can vary wildly based on an individual's identity and the current political climate.\n\nA conservative will see V as the hero fighting against a socialist, oppressive government, making his beloved people aware that the power is ultimately in their hands, not the government's. He attempts to help them understand that the rights with which they were born, and their lifestyle choices therein, do not make them inferior or undesirable to some greater 'utopian' ideal. \n\nA liberal will see V as a member of any number of marginalized groups, subjected to the most horrible of biological experiments for the advancement of those in power. Having had enough, he took a stand and fought against tyranny and bigotry while maintaining his beautiful humanity till the very end. \n\nOthers will see where V fits all of the above regardless of political leaning...\n\nV for Vendetta conveys a sense of the preciousness of national identity and how individualism blends with, but is equally separate from, such an identity, and howcis it not a product of a person's environment so much as it is innate and sacred. Precious enough to die for! Maintaining true to yourself, your beliefs (religious or otherwise), and respecting others's regardless is a central theme in this film revolving around the importance of maintaining personal integrity. \n\nYes, the film is violent, bloody, and cerebral, but it is also raw and heartwrenching as well as touching and very sad. Without spoilers, the ending is not only completely necessary to conclude the film handsomely, but it is also difficult to watch and digest. \n\nNat grew so much as an actress between 1999 and 2006, I'm just gonna say that much, and Hugo Weaving is basically the Lord of the Geeks... So this performance is probably one of his best as the man behind the mask, though he wasn't originally the Wachowskis choice for their masked man. \n\nWatch. This. Film! \n\nWatch it without interruptions, without distractions and erase all preconceived notions about it. Have a willingness to see yourself in not only the main characters, but in the people and the symbolism throughout. \n\nEvery single character represents a part the human heart within all of us:\n\nThe frightened young woman who is just trying to keep her head down and get by suddenly being thrown against her will into a whirlwind of events that change her life and her destiny forever. \n\nThe masked enigma, a man who does have an identity but chooses to convey a different one in order to send a message to his people, a man who is willing to lay down his life for what he loves and believes in most. V is a human being who endured some of the most heinous acts against him, and it transformed him into a fluid entity, as much a symbol to his people as he is a living, breathing flesh and blood man. A man who hurts, who hates, who loves, and a man who can die.\n\nThe masses, so focused on group-think and blending in so as not to arouse government suspicions for being a separatist or radical. Or the child, in all the innocence of youth and a representation of anyone's son or daughter, becoming the catalyst needed to finally make the light bulb turn on in the people's heads.\n\nOr maybe the police inspector and his partner, two men aware of the atrocities committed by their government against its own people, conflicted in wanting to do the right thing while upholding corrupt laws, and staying alive in a time where enemies are in every dark corner and behind every desk. \n\nApproach this film with an open mind, and pay attention to the beautiful symbolism throughout. Wherever you are, in whichever country you live, I promise you this movie will touch you and effect you in ways you never thought possible. You will not come away disappointed, and like me, may even come away with a new set of eyes with which to view the world around you, and your place in all of it.",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "One of my top three movies.",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "''Remember remember the 5th of November, the gunpowder treason and plot. I see no reason why gunpowder treason should ever... be... forgot.''\nOh this movie. This... movie. Yes, it may be completely different compared to Alan Moore's graphic novel. But will you care about this even after watching this movie ? No. Cos the movie is just so superb. Hugo Weaving as V is more than just a refined, deadly and philosophical (ok... and a bit psychotic) gentleman in a coat and a Guy Fawkes mask. He's an idea. An idea that's not only bulletproof but one that also catapults this movie in the Instant Classics category.",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "v from vendetta is one of DC Vertigo's best movies. \nThe story presents the United Kingdom under the control of a dictatorship regime, ruled by high chancellor Adam Sutler. Hugo Weaving's character manages to be the symbol against the regime and encourages the people to fight for their freedom. \nI started to like it in the Vertigo derived movies and for me it was one of the best, if not the best.",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. I watch it every year. ",
            "review_date": "2019-10-03",
            "source": "rt"
        },
        {
            "content": "A movie that is very politically based. A very dark setting from start to finish. A rememberable performance by Hugo Weaving, showing his strengths as an actor. It has some plot holes and faults, but most are forgivable. The final fight scene is visually impressive but constant cuts and overuse of slow motion really ruins that scene for me. This movie was a little over hyped for me.",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "Pretentious excessively long claptrap",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "If you are able to see the meanings behind the action you have to recognize it's a masterpiece.",
            "review_date": "2019-09-20",
            "source": "rt"
        },
        {
            "content": "Stunning visuals with a storyline that is more valid now than ever. V For Vendetta has a lot to say, as long as you have the attention span to sit through it all. ",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "This movie was great the first time I saw it, but it' become even better with successive watchings. In fact it's one of my most rewatched movies. The story is cohesive and well-paced. Some of the critical reviews saying this is rotten... I just can't fathom.  Maybe they were mislead by the marketing that said this would be another Matrix-style movie.",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "This is a very politcal and thought-provoking film, but manages to refrain from being preachy by two virtues. Firstly, it is set in a distopian alternate present the is so significantly different from anything existing in the world today that it is remanded to the realm of alegory. And secondly, there is bound to be something in this film with which the viewer will disagree, or at the very least be challenged to think about, no matter what his political leanings. While the Brittish take the view that Guy Faulks was wrong for trying to overthrow the parliament, the film takes the much more American view that \"Governments should be afaid of their people\", thought the cast is largely Brittish. It takes much more time to delve into the philosophy than the writers' previous film, The Matrix, but still contains an excellent action scene near the end. Outstanding performances from Hugo Weaving and Natalie Portman, and absolute one time must-see.",
            "review_date": "2019-08-23",
            "source": "rt"
        },
        {
            "content": "V for president 2020! ",
            "review_date": "2019-08-21",
            "source": "rt"
        },
        {
            "content": "V For Vendetta is an excellent movie. The first half is awesome. Though it does get a little lost in it's second half. ",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "\"Bloody\" in Politics vs. Propaganda is V. Sends a bold message about Government controlling Media mixed with historical accounts of Guy Fawkes. Direction and Cinematography where among the superior of superhero movies of it's time. The Wachowski's last great movie as executive producers.  ",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Unlike most comic book adaptations emerging around the mid-2000's, V for Vendetta (2006) boils to a crescendo of a finale that is both thought provoking and inspiring. An absolutely satisfying film that is a must watch- period.",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "Uno dei migliori film della storia del cinema",
            "review_date": "2019-07-20",
            "source": "rt"
        },
        {
            "content": "It carves the idea of the movie on to you by perfect storytelling and scenery.",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Such an incredible movie on so many levels. The cast is stellar and V is one of the best vigilantes of all time.",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "Great movie, my favourite one so far.",
            "review_date": "2019-06-14",
            "source": "rt"
        },
        {
            "content": "I LOVE this movie. I've watched it so many times and it speaks so much truth ",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "While slightly deviating from the source material, for its own sake, V for Vendetta still remains timely, thought-provoking, and surprisingly visually pleasent",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "A great movie, loved the visuals and the overall tone and pace of the film grew on me very quickly. Weaving gave \"V\" a great personality.",
            "review_date": "2019-05-03",
            "source": "rt"
        },
        {
            "content": "While V's acting was quite good, the graphics well-done, and the message dark but true, I was mostly confused and let down by this movie. Very little explanation goes into the plot besides government corruption. Evey is a nauseatingly weak character with romance budding all out of a blue, especially in the aftermath of torture.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "V for Vendetta (2005): 6 out of 10: Ah the law of unintended consequences. You seek to adapt a 1982 graphic novel about Thatcherism and convert it to a too clever by half attack on the Bush administration and the war on Terror and you end up with a love sonnet to Timothy McVeigh. Uh-oh.\n\nV is Timothy McVeigh from the fertilizer bombs to the horrible Waco style fire flashbacks it is of all people McVeigh behind that mask. (In reality, Guy Fawkes and McVeigh shared a similar philosophy. The only difference being Fawkes is famous for failing.) Now obviously the filmmakers were to busy ripping off 1984 and Phantom of the Opera to notice this. The film itself is quite entertaining in a mindless sort of way. The script is full of self-referential pseudo-intellectual quotes, and all the cute little British people say things like bullocks. (I have never actually heard an Englishman say bullocks anywhere besides an album cover. It's interesting to note that the British press hated this film with a passion unmatched by any in recent history. I guess they aren't as pro-bombing of Government buildings as Americans are.)\n\nThe films bad guys are all evil mustache twitching, child raping psychopaths while the good guys are all innocent liberals. The idea mind you that the people will automatically rise and support the bomber against the big corrupt government is a fantasy right up with we will be greeted as liberators and Jodie Foster will love me if I shoot the President. Nuance doesn't enter into the picture.\n\nWhich is a shame because the movie had an excellent chance to make a statement had it been willing to go off the rails a little bit (pun intended) and put some shading on these characters. In all fairness to the filmmakers, Timothy McVeigh was also a pretty one-sided character. The only difference is where I come from he is the bad guy.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "One of the best movies I’ve ever seen",
            "review_date": "2019-04-16",
            "source": "rt"
        },
        {
            "content": "V for vendetta is a thriller directed by James McTeigue. The film stars Hugo Weaving as V and Natalie Portman as Evey Hammond.\n\nThe acting was really good from all the cast especially Hugo Weaving as V I felt that he gave a charming but deadly performance. I also really liked Stephen Rea as Eric Finch I felt that he gave a realistic performance.\n\nThe characters were portrayed and written very well especially V sadly Evey got a little annoying toward the middle, but then she did redeem herself toward the end.\n\nThe cinematography was done with care and had some really beautiful shots. \n\nThe setting I personally love with the futuristic England under control by the government.\n\nThe set design and props were done extremely well from the colour to the building designs.\n\nThe costume design I personally really liked especially toward the end with all the citizens.\n\nThe style of the film is great from the colour scheme to the story. I especially liked the red against the black I found that it gave a menacing feel to It. \n\nThe practical effects were done very well especially with the action.\n\nThe special effects were also very good except for one scene involving two knifes. It wasn't the worst but it wasn't as good as the rest of the effects.\n\nThe action was done really well from the directing to the end product. I especially liked the action when it involved V. \n \nThe dialogue though stylistic was done very well especially with V's character.\n\nThe film also had very good editing with some really sound edits.\n\nThe music fit the film really well and had one of my favourite songs in history.\n\nThe story I don't want to give away, but in my opinion it was a great experience to see fold out.\n\nThe film also had some comedy mostly with the character V.\n\nThe film in my opinion had really good atmosphere especially in the second act.\n\nThe film is also a little emotional, but I don't think it's enough to cry over.\n\nThe film I found was really enjoyable and one that I could watch again and again and never get bored.\n\nI did have one or two nit picks, but in the grand scheme of the film it barley takes away.\n\nOver all the film is a unique and Wonderful experience. Over all I give it a 9/10 - one of the best",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "Some of the action might be a bit choppy, but V for Vendetta is extremely entertaining. Its great visual effects and Hugo Weaving's iconic portrayal of \"V\" is more than enough to satisfy even the strictest of viewers. There is also a great message about rising up against political propaganda within its great style and environment. Another great film from the Wachowski's is now on your hands.",
            "review_date": "2019-03-18",
            "source": "rt"
        },
        {
            "content": "One of the best comic book adaptations of all time.",
            "review_date": "2019-03-16",
            "source": "rt"
        },
        {
            "content": "The anarchism is nothing like that. The comic has a different soul aswell.",
            "review_date": "2019-03-12",
            "source": "rt"
        },
        {
            "content": "this is a good movie.",
            "review_date": "2019-03-10",
            "source": "rt"
        },
        {
            "content": "Excellent acting, dialogue, story, and ending. This is a much watch.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "As for movies which put politics into their movies, this one rocks. It diverges from the comics, but the story line is coherent and Hugo Weaving's performance is excellent. awesome movie.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "Hugo Weaving at his best, movie is fantastic",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "V for Vendetta displays a spectacular hero while it displays a activist side and a heroic side.",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "Next step on the way: Agorism?",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite films! I love V and what he stands for!!!",
            "review_date": "2019-03-01",
            "source": "rt"
        },
        {
            "content": "An INCREDIBLE, POWERFUL & POLITICALLY CHARGED comic-book adapted masterpiece that TRULY shows & proves that the revolution will NOT BE TELEVISED. A+",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "I love this movie and I must be one of the few that don't hate Natalie Portman in the movie.",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "One of the best movies i've ever seen if it wasn't the best\nWe all know the traditional idea of a superhero\nSupersenses, stranger suit and for sure super power\nAnd there is always a villian from space wants to kill him .....etc\nWhat I noticed in those movies is how are people really need the superhero to protect them, the humanity and the earth from annihilation\nNow, let's talk about the real world\nThe first script about our annihilation is by us\nNuclears,Explosions and wars\nFor example hitler when 50 million human in the second world war\nNow who's our real villian\nHitler\nAnd if v was in this situation he would kill hitler before the sww and he would save the 50m people\nThat's the hero we really need in this world\nNot what humans in traditional superhero movies need\nThe villians are us HUMANITY\nWhat I first liked in v for vendetta is the Idea that we all should respect\nThe idea of creating a superhero we really need in our world\nWe don't need a supersenses or suits \nWe need an idea\nBecause ideas are corruption proof\nMy rate : 95%\nV",
            "review_date": "2019-02-22",
            "source": "rt"
        },
        {
            "content": "awesome movie!  seeing bad guys get whats coming to them never gets old.",
            "review_date": "2019-02-20",
            "source": "rt"
        },
        {
            "content": "o filme Ã (C) perfeito em muitos aspectos um deles Ã (C) a crÃ­tica polÃ­tica que carrega, e muito fiel as HQs oque fez com que muitos adorassem o filme",
            "review_date": "2019-02-12",
            "source": "rt"
        },
        {
            "content": "This movie touches me in my heart and soul every time. Hugo Weavings ability to convey emotion with just his voice and mannerism always amazes me. His rich voice and delivery of his lines makes this movie for me. It also does not hurt that he is a badass with a blade. Natalie Portman does a wonderful job being the vulnerable/fearful Evey. Her accent drops off a little bit sometimes, but I love her transformation throughout the movie.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "The message is powerful . Great story of authoritarianism and revenge",
            "review_date": "2019-02-06",
            "source": "rt"
        },
        {
            "content": "Has elements similar to the Matrix where you want to roll your eyes because they seem a little overacted, but is also similar to the Matrix in its brilliant blending of philosophy, politics, and unique form of storytelling. Stop worrying about whether V has convinced you of anything and it is a classic",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "An incredible film, with a deep message, fantastic pacing, definitely a must watch",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta takes place in an alternate vision of Britain in which a corrupt and abusive totalitarian government has risen to complete power.\"\n\nAlternate vision of Britain? Lol! More like very near future vision of Britain.",
            "review_date": "2018-12-23",
            "source": "rt"
        },
        {
            "content": "Absolutely one of my favorite movies now.",
            "review_date": "2018-12-20",
            "source": "rt"
        },
        {
            "content": "Well-filmed but plot is a hammer hitting a cantaloupe.",
            "review_date": "2018-12-02",
            "source": "rt"
        },
        {
            "content": "truly one of the most underrated films that I've ever seen",
            "review_date": "2018-11-21",
            "source": "rt"
        },
        {
            "content": "What can I say about this movie. I love the story,",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "A wonderful movie where the people in the government are held accountable for what they did and didn't do. This is what is happening now in our American government.....where is our \"V\"!",
            "review_date": "2018-11-07",
            "source": "rt"
        },
        {
            "content": "It was fine I guess. Just love the “V” ALLiteration Monologue the most. :)",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "I was blown away by V For Vendetta. A comic book never entices me as it does other people but this film was a pleasant surprise. First-time director James McTeigue is relentless when it comes to pacing, rarely letting things flag for extended scenes of flabby explosion. And if there are times when V for Vendetta is overwrought and chaotic, those lapses are easily forgotten in the midst of the rousing nature of the experience. From a visual standpoint, V for Vendetta bears the earmarks of a comic book-to-film adaptation: rich images, deep shadows, and strong iconography. Do not miss this film under any circumstance.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "This masked vigilante is some kind of nerd talking all fancy like that. It's funny and ironic how John Hurt plays a man trying to escape and change society for the good in 1984, but here in this movie, he's trying to control it, manipulate it, and destroy it. If only the news would get hijacked the way V did in the movie. \n\nAhh, the media with all there lies and propaganda. The way they can manipulate and construe the truth to keep people sedated and in fear. V's got great taste in art and everything. Thats pretty damn good how they made 'the voice of London's' death almost like a metaphor. He always spouted out vomit so now he dies vomiting. \n\nI love how the bishop of all people calls Evie a whore and a bitch. It's like whoa! Religion flew out the door years ago! That gag show skit with the Chancellor was great and of course he gets butt hurt about it. I do have to give it up to Natalie for being such a champ and being ok with getting her hair buzz cut. That's a statement in and of itself. \n\nIt sucks that she had to got through so much hell and anguish, but in the end she came out not fearing death anymore. Reborn, if you will. Shit, V's fancy with those knives. Seeing all the masked civilians gave me goosebumps and brought a joyful tear to my eye. See, if only people can have the guts to do something greater than themselves. But nope, people only care about themselves and what they got and what they can buy next week and materialistic things.\n\nVery inspirational and moving movie. I just can't believe that it was shown on big tv channels like FOX. This movie definitely goes down in history as one of those big political statement movies.",
            "review_date": "2018-10-21",
            "source": "rt"
        },
        {
            "content": "This film manages to combine crippling terror with awesome, awesome, awesome, super cool, simply stunning action, visuals and acting. Hugo Weaving was amazing and he played the part very well, every time V came on screen I was surprised and impressed at his performance. Natalie Portman was great as well, her emotion was conveyed so well that all she had to do was blink for the audience to understand her thoughts. The introduction of the two main characters and the scene of them meeting was (in my opinion) the best dialogue in the entire movie. The supporting cast mattered and felt like real and relatable people. the downside to the movie, however, is a fairly weak plot and slightly disappointing 3rd act (except the knife throwing scene and the explosion of parliament).",
            "review_date": "2018-09-18",
            "source": "rt"
        },
        {
            "content": "Good film based on a anarchist freedom fighter revolutionizing in certain ways by prolonging them throughout the film in hopes of wreckening the corrupt British government & giving it light.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "A sensationalized vigilante is caught running amok with an Assault Cuirass and somehow we're supposed to sympathize with an effigy because of an inability to relate? Exploiting a failure to simplify is not an excuse for retaliation.",
            "review_date": "2018-09-10",
            "source": "rt"
        },
        {
            "content": "People like this Junk?",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "Watch this if: Dystopian political thrillers with a hint of fantasy and comic book vaneer are your thing.\n\nWritten by the Wachowski sisters, V For Vendetta is a story of war against political oppression and it feels excitingly subversive. Real life anarchists have been holding Vendetta as a symbol of their activism ever since it hit theaters in 2006. We were particularly excited by Natalie Portman's performance. She holds her own in this dark, sinister thrill ride. It left us with a dizzying feeling of excitement and possibility for a new future.",
            "review_date": "2018-08-30",
            "source": "rt"
        },
        {
            "content": "Was two thirds of the way through before I realized I was listening to Elrond/Agent Smith.\n\n\"There are 872 songs in here. I've listened to them all, but I've never danced to any of them.\"",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta\" is oppressive in nature, violent and stirs up a rather intriguing story. It's also visually appealing in every way.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "Honestly this movie is phenomenal. It inspires ideas that need to be said, because after all \"People Should Not Be Afraid Of Their Governments\"",
            "review_date": "2018-07-13",
            "source": "rt"
        },
        {
            "content": "Amazingly tense storytelling with several climaxes throughout the plot where other movies barely have one. Actors are great, though surprisingly, Weaving delivers the best performance - even though he's wearing a mask the entire movie.",
            "review_date": "2018-06-29",
            "source": "rt"
        },
        {
            "content": "Pretty good action movie starring Natalie Portman. I’ll forget this movie in about a week.",
            "review_date": "2018-06-28",
            "source": "rt"
        },
        {
            "content": "muy buena,de las mejores",
            "review_date": "2018-06-25",
            "source": "rt"
        },
        {
            "content": "4.5/5.  V for Vendetta has aged extremely well and is very relevant to modern society.  Apart from the 3rd act fight scene, everything about this movie is great; the acting, the story, the message.  It's powerful stuff and extremely engrossing.",
            "review_date": "2018-06-03",
            "source": "rt"
        },
        {
            "content": "a great way of looking at the future. this movie makes you think after it's over. also made really good",
            "review_date": "2018-05-12",
            "source": "rt"
        },
        {
            "content": "It IS good. These bad reviews are government plants.",
            "review_date": "2018-05-02",
            "source": "rt"
        },
        {
            "content": "that is why it is all over. V!",
            "review_date": "2018-04-14",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite movies of all time. While V is the fire, Evie is the water. He is scarred, she is beautiful. He found his purpose in hate. She found hers by love. And these opposites attract in a way that is incredible to watch. Great acting and a story that is thought-provoking.",
            "review_date": "2018-04-06",
            "source": "rt"
        },
        {
            "content": "HOLY SHIT, THAT'S HOW YOU MAKE A MOVIE",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "A decent comic book story but one that truly offends fans of the comic (ME). I honestly found this movie stunningly bad in some parts but visually stunning and poetic at others making it a pretty unbalanced story. Natalie Portman's acting was very hard to watch but Hugo Weaving's was amazing. Some stand out scenes were the flashbacks to the detention center and the scene were he confronts the doctor. Another beautifully made moment was really the whole revolution and the flashbacks to Valerie's life.The good action scenes (there aren't many) were the scene in which V makes his last stand as he cuts through the fingermen in a vicious slow motion fight with blood flying left and right but also the scene at the news station in the hallway which was well made with V's vicious and matrix-esque fighting style. The movie was overall enjoyable and fun for the average moviegoer.",
            "review_date": "2018-03-25",
            "source": "rt"
        },
        {
            "content": "\"Remember, remember the 5th of November\". This is a very polarizing film. Some love it. Some find it offensive. Which side of that pendulum do I fall on? The movie is very philosophical and challenges the mindset of many types of people. The action is well done, albeit a little dated. The dialogue is very well written (especially V's). Something i enjoyed about this movie is that everything fits together and makes for a great conclusion. My sole complaint is that V's backstory is not very developed, and glossed over. Another aspect of this movie I enjoyed is that V is never unmasked. Because as he said, there is a face underneath his mask, but does it matter? Its all about what he believes in. Ideas are bulletproof.",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "Despite the leeway that you must give in the comic to film transition, I don't think it quite covers why V should be an arsehole for indeterminate or nonsensible reasons, or why the plot simply doesn't make any damn sense at times. Where Watchmen succeeds (though mostly in the extended versions), V for Vendetta fails entirely. It's still an entertaining movie, but it lacks that any sort of definitive punch, particularly in light of the open-endedness of the original comic. The music is great and the action fantastic, but under the minorly thought provoking Master Race Caste Dystopia, it's just another action flick, once and gone. If you want something meaty, read the comic. Next!",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "What can I say, this movie was amazing. Hugo Weaving and Natalie Portman were on their A game. It's hard to put into words how much I loved this movie.",
            "review_date": "2018-03-09",
            "source": "rt"
        },
        {
            "content": "Visually impressive, superficially entertaining but an insidious underlying political message most will be passively oblivious to. As, indeed, was probably the intention.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "Title: V for Vendetta\nStory/Writing/Message/Plot:\t4\nCharacter/Acting:\t\t4\nMusic/Sound:\t\t\t3\nCinematography/Editing:\t4\nAge/Originality:\t\t\t4\nTotal:\t\t\t19/25\n\nabsolutely beautiful. The story, tempo, character, acting, everything is well played to bring balance and harmony in this film. Hugo Weaving's acting without any facial expression is just magnificent and due to him having a mask on, V's emotion is spoken out very well from the body language that Hugo brings in. Every minor posture change speak to us how V is feeling at the moment. It reminds me the Japanese Nou-men play where actors are to put on a mask and describe the characters feeling using their subtle body movements. We also cannot forget the mightily acting of Natalie Portman bringing in an insecure Evey who transforms into a very strong character in the end. Every actors chosen in this film is spot on and their acting do not eat away other character but brings great balance and harmony overall. I really think James McTeigue done a brilliant job uniting the team in which the end result was beauty in film form. The music also well describe the moment and executed in the best timing. This is a masterpiece I can watch unlimited time and still do not get bored out of it. Just absolutely beautiful.",
            "review_date": "2018-02-05",
            "source": "rt"
        },
        {
            "content": "An amazing movie, plain and simple. Hardly anything to  complain about- character development, plot, supporting cast, everything is outstanding. Only one thing that could've been done better- more Sutler! Chancellor Sutler was criminally underused. But that's hardly a major issue, and does not take away from the enjoyment of the film.",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "Truly beautiful movie. There are a few minor problems I had with it (such as who helped V carry Evey back to her cell and where was she getting her clothes from while staying at his house) but other than that, it was amazing. The cinematography? is nothing special, except towards the end there is a shot of everyone in the streets that is breathtaking.",
            "review_date": "2018-01-17",
            "source": "rt"
        },
        {
            "content": "Truly beautiful movie. There are a few minor problems I had with it (such as who helped V carry Evey back to her cell and where was she getting her clothes from while staying at his house) but other than that, it was amazing. The cinematography? is nothing special, except towards the end there is a shot of everyone in the streets that is breathtaking.",
            "review_date": "2018-01-17",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is as fun, flamboyant, verbose, and stylish as its title character. Admittedly the pacing and editing is frenetic at times and the production design a little plain, although I like the regular flashes of red used throughout. Weaving's character is compelling and intriguing, and even though he's behind a mask he's more expressive than Portman's blank-faced turn as Evey. But there's a feast of great British character actors in this too, and it's no surprise that anarchists continue to turn to this emotive film for inspiration. ",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time... if you haven't seen it you need to watch it.",
            "review_date": "2017-12-30",
            "source": "rt"
        },
        {
            "content": "Painfully political. Aside from the political force feeding, everything else was good. Just be prepared going in. ",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "A cautionary tail in the time of Trump.",
            "review_date": "2017-12-27",
            "source": "rt"
        },
        {
            "content": "One of the greatest Revenge films of all time, alongside The Count of Monte Cristo. You know its gotta be good if Natalie Portman is gonna shave her beautiful hair off on camera for it. Excellent character development, perfect plot, and many special moments make V very vantastic!",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "It’s good. Not one of the greats, but it’s satisfying. ",
            "review_date": "2017-12-11",
            "source": "rt"
        },
        {
            "content": "A very smart action movie with things to say about the current state of the world. Natalie Portmon is also great in this movie.",
            "review_date": "2017-12-04",
            "source": "rt"
        },
        {
            "content": "Amazing film- they managed to infuse action with a strong political message. The only platform fascism deserves is one with a noose!",
            "review_date": "2017-12-02",
            "source": "rt"
        },
        {
            "content": "In 2027, the world is in turmoil and warfare, with the United States fractured as a result of prolonged second civil war and a pandemic of the \"St. Mary's Virus\" ravaging Europe. The United Kingdom is ruled as a fascist police state by the Norsefire Party, helmed by all-powerful High Chancellor Adam Sutler (John Hurt). Political opponents, immigrants, Jews, Muslims, atheists, homosexuals, and other \"undesirables\" are imprisoned and executed in concentration camps. On November 4, a vigilante in a Guy Fawkes mask identifying himself as \"V\" (Hugo Weaving) rescues Evey Hammond (Natalie Portman), an employee of the state-run British Television Network, from members of the \"Fingermen\" secret police while she is out past curfew. From a rooftop, they watch his demolition of London's main criminal court, the Old Bailey, accompanied by fireworks and the \"1812 Overture\". Inspector Finch (Stephen Rea) of Scotland Yard is asked to investigate V's activities while BTN declares the incident an \"emergency demolition\". V interrupts the broadcast to claim responsibility, encouraging the people of Britain to rise up against their government and meet him on next year's Guy Fawkes Night outside the Houses of Parliament. During the broadcast, the police attempt to capture V. Evey helps him escape, but is knocked unconscious. V takes Evey to his home, where she is told she must remain for one year. V then kills Lewis Prothero, Norsefire's chief propagandist, and Anthony Lilliman, the Bishop of London. Evey offers to help, and uses the opportunity to escape to the home of her boss, comedian and talk show host Gordon Deitrich (Stephen Fry). In return for Evey trusting him with her safety, Gordon reveals prohibited materials, including subversive paintings, an antique Quran, and homoerotic photographs. Meanwhile, V confronts Dr. Delia Surridge, who had experimented on him and many other \"undesirables\" 20 years ago at Larkhill concentration camp; seeing her remorse for her past actions, he kills her painlessly. After Gordon performs a satire of the government on his show, his home is raided and Evey is captured. She is imprisoned and tortured for information about V, with her only solace being a note written by actress Valerie Page, a former prisoner who was tortured and killed for her lesbianism. Evey is told she will be executed unless she reveals V's location. When she says she would rather die, she is inexplicably released, and then finds herself in V's home. It turns out that V was the one who had \"captured\" her at Gordon's home, and staged her imprisonment and torture to free her from her fears. The note was real, passed from Valerie to V when he was imprisoned. He also informs her that Deitrich had been executed when the Quran was found in his home. While Evey initially hates V for what he did to her, she realises she has become a stronger person. She leaves him, promising to return before November 5. Reading the deceased Surridge's journal, Finch learns V is the result of human experimentation and has been targeting the people who detained him. Despite being stonewalled by the government, Finch searches for the true identity of V, tracing him to a bioweapons program in Larkhill. Finch meets William Rookwood, who tells him that the program, which was directed by Sutler (who was then Undersecretary of Defence), resulted in the creation of the deadly St. Mary's Virus. He further reveals that Creedy, a leader of the Norsefire Party, released the virus onto English soil, killing 100,000 British residents and framing the outbreak as an attack by a terrorist organisation. The Party, which promised security in times of social instability, used the ensuing wave of fear to elevate Sutler to the newly created office of High Chancellor and win an overwhelming majority in Parliament, becoming the elected government. Finch later discovers the man he met was V in disguise, and though he initially disbelieves the story, his faith in the Norsefire government is severely shaken. As November 5 nears, V distributes thousands of Guy Fawkes masks, and the population questions party rule as the nation slowly descends into anarchy, ignited when one of the Fingermen makes the mistake of shooting and killing a young girl committing vandalism, only to be killed in turn by a mob of enraged citizens. On the eve of November 5, Evey visits V, who shows her an explosive-laden train in the abandoned London Underground, set to destroy Parliament. He leaves it to Evey to decide whether to use it...\n\nEbert and Roeper gave the film a \"two thumbs up\" rating. Roger Ebert stated that V for Vendetta \"almost always has something going on that is actually interesting, inviting us to decode the character and plot and apply the message where we will\". Margaret Pomeranz and David Stratton from At the Movies stated that despite the problem of never seeing Weaving's face, there was good acting and an interesting plot, adding that the film is also disturbing, with scenes reminiscent of Nazi Germany. Jonathan Ross from the BBC blasted the film, calling it a \"woeful, depressing failure\" and stating that the \"cast of notable and familiar talents such as John Hurt and Stephen Rea stand little chance amid the wreckage of the Wachowski siblings' dismal script and its particularly poor dialogue.\" Sean Burns of Philadelphia Weekly gave the film a 'D', criticizing the film's treatment of its political message as being \"fairly dim, adolescent stuff,\" as well as expressing dislike for the \"barely decorated sets with television-standard overlit shadow-free cinematography by the late Adrian Biddle. The film is a visual insult.\" On Alan Moore removing his name from the project, Burns says \"it's not hard to see why,\" as well as criticising Portman's performance: \"Portman still seems to believe that standing around with your mouth hanging open constitutes a performance.\" Harry Guerin from the Irish TV network RTÉ states the film \"works as a political thriller, adventure and social commentary and it deserves to be seen by audiences who would otherwise avoid any/all of the three\". He added that the film will become \"a cult favourite whose reputation will only be enhanced with age.\" Andy Jacobs for the BBC gave the film two stars out of five, remarking that it is \"a bit of a mess... it rarely thrills or engages as a story.\"\n\nTo re-see \"V For Vendetta\" was a bit unfulfilling as I honestly don´t think it´s not as good as I thought it was when it came out. I have never red Alan Moore´s thought-provoking graphic novel, but I know of it, and I think the plot and conceptual idea is quite intriguing. It´s complex, tense in a way, layered and you can´t but cheer for the anti-hero V despite some of his actions that are as vile as the methods the government he despises use. The main focus is fear and how the government use it as a weapon to control and make sure that people do what they are told. And the antidote is vengeance via V and his methods. The problem here is that even if \"V For Vendetta\" is based on a graphic novel it somehow becomes too cartoony for its subject matter and you struggle with buying into this futuristic society and its protagonist. The problem is as well the editing, the acting is not always spot on (specifically Natalie Portman is not convincing in her role as Evey and the overacting from for example John Hurt was not of my liking) and the comical structure that appears at certain points in the film doesn´t work but rather create an unbalance. You simply feel disappointed when the film is over. \n\nTrivia: The original comic series was originally created by Alan Moore. However, following his negative experience with From Hell (2001) and The League of Extraordinary Gentlemen (2003), Moore decided to reject all money and credit from Hollywood on any adaptations of his work. Thus, he gave all the money he would've gotten to the artist who drew the character with him, and rejected his own \"created by\" credit from the film.\n\nV wears a mask in the guise of Guy Fawkes, who is most famous for his involvement in the Gunpowder Plot of 1605, which he was placed in charge of executing, due to his military and explosives experience. The plot, masterminded by Robert Catesby, was a failed attempt by a group of provincial English Roman Catholic conspirators to kill King James I of England (the Sixth of Scotland), his family, and most of the Protestant aristocracy in one swoop, by blowing up the Houses of Parliament during its State Opening.\n\nAlan Moore, writer of the original graphic novel, greatly disliked the film, criticizing the script for \"having plot holes you wouldn't have gotten away with on Wizzer and Chips in the 1960s\". He ended cooperation with his publisher, DC Comics, after its corporate parent, Warner Brothers, failed to retract statements about Moore's supposed endorsement of the film. Joel Silver said at a press conference that Lana Wachowski had talked with Moore, and that \"Moore was very excited about what Lana had to say.\" Moore disputed this, reporting that he told Wachowski \"I didn't want anything to do with films. I wasn't interested in Hollywood,\" and demanded that DC Comics force Warner Brothers to issue a public retraction and apology for Silver's \"blatant lies\". Although Silver called Moore directly to apologize, no public retraction appeared. Moore was quoted as saying that the comic book had been \"specifically about things like fascism and anarchy. The words 'fascism' and 'anarchy' occur nowhere in the film. It's been turned into a Bush-era parable by people too timid to set a political satire in their own country.\" This conflict between Moore and DC Comics was the subject of an article in The New York Times on March 12, 2006, five days before the U.S. release. In the New York Times article, Silver stated that about twenty years prior to the film's release, he met with Moore and David Gibbons when Silver acquired the film rights to V For Vendetta and Watchmen. Silver stated: \"Alan was odd, but he was enthusiastic and encouraging us to do this. I had foolishly thought that he would continue feeling that way today, not realizing that he wouldn't.\" Moore did not deny this meeting, nor Silver's characterization of Moore at that meeting, nor did Moore state that he advised Silver of his change of opinion in those approximately twenty years. The New York Times article also interviewed David Lloyd about Moore's reaction to the film's production, stating, \"Mr. Lloyd, the illustrator of V for Vendetta, also found it difficult to sympathize with Mr. Moore's protests. When he and Mr. Moore sold their film rights to the comic book, Mr. Lloyd said: \"We didn't do it innocently. Neither myself nor Alan thought we were signing it over to a board of trustees who would look after it like it was the Dead Sea Scrolls.\"",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "Better than a provocative and violent super-hero movie is a social and politically relevant and symbolic one, whose plot can be transferred into more complex standards. \"V for Vendetta\" proves how much the genre can improve itslef and inspire its audience. The Wachwoski Sisters and James McTeigue did an excellent job in crafting this masterpiece! Hugo Weaving was the perfect casting choice for the role, no other gentleman could perform the excentric protagonist. As well as Natalia Portman, who could manage to be as important and engaging as V, she was terrific. Almost everything here was!",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "Superb!!! Have seen it occasionally on the 5th of November as well!",
            "review_date": "2017-11-04",
            "source": "rt"
        },
        {
            "content": "V For Vendetta: Skillfully ventures into the philosophical ideals of a venal goverment. Being Valaint, Valid, Vast, and Vehement. V For Vendetta is strangely intriguingly as a Superhero film as well being a Verisimilitude drama film.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "I believe that the character speaks for himself. The movie is but a well produced extension of his glory. Although, with all of the conflict occurring in our modern era, you may feel disgusted by this masterpiece. Don't let prejudice deteriorate the artistic qualities of the character and the film.",
            "review_date": "2017-10-11",
            "source": "rt"
        },
        {
            "content": "V for Vendetta follows the story of Evey, a young woman living in an alternate, totalitarian version of Britain who after a run in with the secret police is rescued by a masked vigilante named V. Hugo Weaving plays the verbose and theatrical V to a tee and is thoroughly intriguing and engaging throughout. Natalie Portman's performance as Evey is also excellent and her character development and relationship with V is well done if a little unbelievable after what V does to her. My biggest issue with the film however, as a film set in England, with mostly English actors (and Hugo Weaving's completely convincing English accent), Natalie Portman's appalling English accent is incredibly distracting and off putting and sometimes it's hard to look past that and focus on her performance. John Hurt also plays a wonderfully dramatic villain, most likely completely aware of the irony with his previous role in 1984. Overall, it is an entertaining and thoughtful film that stands apart from a lot of other comic book adaptations,",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "exceptional movie, it's a must see and spell binding while in these ...times",
            "review_date": "2017-09-27",
            "source": "rt"
        },
        {
            "content": "Movie was visually and intellectually refreshing.",
            "review_date": "2017-09-12",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies I've ever seen !! There's basicaly nothing really bad I can say about this film, it's entertaining, smart, and the performances by both Natalie Portman and Hugo Weaving are epic. This is, by far, the best movie that involves politics and action, and probably the best British film ever. Fantastic movie and certainly recommended !!",
            "review_date": "2017-09-08",
            "source": "rt"
        },
        {
            "content": "An overly dramatic in a Shakespeare kind of way, English movie with a bit of weird romance over an old mystery.",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "A striking political action film, complete with a thoughtful and relevant plot and a strong cast. Tonal issues are present throughout however and action sequences occasionally border on gimmicky. V for Vendetta still remains a strong Wachowski flick, however, thoughtful and enjoyable.",
            "review_date": "2017-08-07",
            "source": "rt"
        },
        {
            "content": "Packed with amazing action sequences, excellent performances and thought provoking political and social pronouncements, V for Vendetta is one of the comic book movies ever made.",
            "review_date": "2017-08-04",
            "source": "rt"
        },
        {
            "content": "Probably one of the most underrated comic to big screen adaptions. Although not very faithful to the source material the film is a political commentary that is ever so fascinating to watch.",
            "review_date": "2017-07-30",
            "source": "rt"
        },
        {
            "content": "V For Vendetta is AWESOME. This movie is so good. There are no problems with this movie. Everything in this movie is so great. It's not great but it's meant to be really fun and quite entertaining. It's exactly what she would expect from the people who made the matrix.",
            "review_date": "2017-07-29",
            "source": "rt"
        },
        {
            "content": "Beautifully written, expertly performed. absolutely horrifying.",
            "review_date": "2017-07-22",
            "source": "rt"
        },
        {
            "content": "One of the best comic book movie adaptations till date! Actually split between this and Dark Knight for the best title though.",
            "review_date": "2017-07-17",
            "source": "rt"
        },
        {
            "content": "Consider this film a thematically-timeless, thought-provoking entertainment, as well being frighteningly prophetic, in the political genre with points to take in as a supplement to the nature of real-life politics. Also, however, how thematic it is towards politics within a graphic novel adaptation that probably speaks some agreeable truths, it isn't without conflicting views even when the antagonistic forces are clear while the protagonistic forces are rebellious with few dark, level-succumbing turns. Overall, the film is quite entertaining typically consisting clever writing and really good performances, along with the characterization showing an accurate portrayal of the deemed conspiracy in politics. (B+)\n\n(Full review TBD)",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "Epic!! Pure awesome!!",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "With its thought-provoking themes and The Wachowskis' excellent screenplay (Yes, I'm a Wachowski fanboy. Been one ever since The Matrix trilogy changed my life and helped action movies finally gain my respect), V for Vendetta is not only smart but also is another visually stunning Wachowski flick. Natalie Portman and Hugo Weaving are both compelling. Weaving, in the role of the mysterious V, delivers excellent lines especially during a television broadcast and in his first appearance a crap ton of alliteration with the letter v. Who knew the siblings had such a fluent grasp of the English language? I think leaving his origins a mystery help the viewers decide for themselves what he looks like. Hell, we never even learn his real name or even his face. The poster says Hugo Weaving but is there really an Agent Smith underneath the mask or is it something that's not pretty at all? It's not as heavy on action as other entries in the Wachowskis' filmography, either as directors, producers or screenwriters. But I think it's because it wants to focus more on the story and on its themes than on \"kill, kill ,kill\". With its subject matter regarding politics and the convincing interaction between Portman and Weaving's characters, V for Vendetta gets a V for Valour in discussing its said political themes. Yes, I had trouble finding a positive verb starting with v that fitted with the movie. *sigh* The things I do to make the review...not 100% crappy.",
            "review_date": "2017-07-12",
            "source": "rt"
        },
        {
            "content": "One of the best looking films of its time, there's just something cool about V for Vendetta. The tale is thought provoking, but people will come back for the other, more impressive features. The Portman capture scene goes on for a bit too long, dragging things out more than it should.",
            "review_date": "2017-07-06",
            "source": "rt"
        },
        {
            "content": "A portrait of politics and revolution in a thrilling way with free declamation speeches.",
            "review_date": "2017-07-01",
            "source": "rt"
        },
        {
            "content": "V for Vendetta excelled my expectations; great cast, great dialogue and very touching.",
            "review_date": "2017-06-21",
            "source": "rt"
        },
        {
            "content": "Pretty unique and some cool action but kind of boring",
            "review_date": "2017-06-18",
            "source": "rt"
        },
        {
            "content": "An amazingly bold story. While not a 100% faithful adaptation of a great comic book, the movie manages to weave several characters story arcs into a final montage. If you appreciate well written monologues and being asked to think during your entertainment then you might just find this to be an epic revelatory movie.",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "It wants to be more profound than it is, but V for Vendetta leaves audiences confused and slightly cheesed-out.",
            "review_date": "2017-06-01",
            "source": "rt"
        },
        {
            "content": "a classic that still rings true today",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "Great movie! Loved the acting, plot and characters, definitely a movie worth watching.",
            "review_date": "2017-05-19",
            "source": "rt"
        },
        {
            "content": "V For Vendetta counts with a refreshing story context for the slasher genre. The dialogues were clever as the the visuals were dazzling and the fight scenes well-filmed. The problem of this movie was the lack of preocupation of making something with more plot twists or with an unpredictable narrative. Since the beggining until the end I could easily predict every scene after the scene and that turned the movie less interesting that it could have been. Natalie Portman wans't a bad choice for the main role, but she didn't nailed it too, failing in transmit some emotions to the spectator.",
            "review_date": "2017-04-28",
            "source": "rt"
        },
        {
            "content": "A respectable movie. While it wasn't completely entertaining to me, the meaning behind the movie made it worth watching. The action sequences were very good especially with a comic book character no one's seen anything of. Overall, the movie felt a bit lackluster but the story made it great.",
            "review_date": "2017-04-24",
            "source": "rt"
        },
        {
            "content": "Loved V in this movie.  Natalie Portman, not as much, but she did pretty good for most of it.  Aside from a big lull in the middle, it was an awesome movie.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Excellent film, would def watch again!",
            "review_date": "2017-03-27",
            "source": "rt"
        },
        {
            "content": "inspiring in the way the film is presented",
            "review_date": "2017-03-25",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen!",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "Its incredible....Very powerfull movie.. it makes you think...  and it will prolly make you cry",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "As good as any movie gets, in my opinion.",
            "review_date": "2017-02-25",
            "source": "rt"
        },
        {
            "content": "Great movie I'd say this is the best comic book movie with powerful moments and well handled the,es like terrorsim.",
            "review_date": "2017-02-24",
            "source": "rt"
        },
        {
            "content": "Classic....\n\nLines are very rich. Story is engaging",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "amazing movie, about the struggle between the people and a tyrannical government",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie",
            "review_date": "2017-02-22",
            "source": "rt"
        },
        {
            "content": "A great if flawed movie",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "Can't help but get sick of this movie after the first 30 minutes of scripted melodrama.  \"This is important!  This is dramatic!\"  Yea, we get it.  Just tell the story and stop selling.",
            "review_date": "2017-02-08",
            "source": "rt"
        },
        {
            "content": "Great film. One of those films I can watch again and again.",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "I don't think the creators of this film knew anything about guy fawkes or oral politics, but it makes for good entertainment. Spoiler, that loser never shows his face.",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "CULT STATUS ALL OVER! And 10 Years later, look where we are in politics. becomes quite present again. Masterpiece",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "Plodding, boring story with a couple of spectacular explosions that's greatest success was convincing people Guy Fawkes and his gang were somehow anti-government and a symbol of resistance against tyranny.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "People seem to forget that this movie, albeit a great testament for an idea against a tyrannical government, is still just a superhero movie. That being said, I can forgive the scenes which are \"unrealistic\" while enjoying the sentiment that comes only when you see a government bow to its people. Spectacular symbolism.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "Superb \nExcellent performances \nAmazing CGI\nA V is such a a bad ass \nLate but very good",
            "review_date": "2017-01-30",
            "source": "rt"
        },
        {
            "content": "Visually stunning and exceedingly clever! I love it!",
            "review_date": "2017-01-27",
            "source": "rt"
        },
        {
            "content": "V For Vendetta is a graphic novel written by Alan Moore that dives into drama, thriller, action, suspense and mystery. V For Vendetta is an excellent film that takes you on a ride from start to end. It gets slow but it doesn't effect the film. Hugo Weaving and Natalie Portman put on wonderful performances, especially Hugo Weaving as V. This film is very artistic and provocative. It's a personal favorite, I always enjoy whenever I can watch this masterpiece and work of art.",
            "review_date": "2017-01-16",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie of all time. The storyline is great and the way that they gave it that somewhat realistic feel makes it awesome.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "one of the greatest comic adaptation of all times. beautiful!",
            "review_date": "2017-01-13",
            "source": "rt"
        },
        {
            "content": "this is my favorite movie",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "Comic book story of a super Guy Fawkes giving hell to the power that be, which happens to be a sort of dictatorial funny guy preying on the population, in a futuristic england. The story is too much fantasy but Natalie is so good in it, she ankors it very well. Considering how Guy Fawkes was hated by englishes, it is surprising that a Catholic rebel could inspire so much.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "Comic book story of a super Guy Fawkes giving hell to the power that be, which happens to be a sort of dictatorial funny guy preying on the population, in a futuristic england. The story is too much fantasy but Natalie is so good in it, she ankors it very well. Considering how Guy Fawkes was hated by englishes, it is surprising that a Catholic rebel could inspire so much.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "Cool action/suspense - movie , not a boring moment  , great explosions and a jumee Natalie Portman !",
            "review_date": "2016-12-12",
            "source": "rt"
        },
        {
            "content": "I saw this movie several times because I loved it, don't know why is this underrated. It should has won an OSCAR for best director but unfortunately it hasn't. This is best superhero movie after The Dark Knight and Rises. Hugo Weaving has done excellent job here in this movie and also has really nice costume. If anyone hasn't seen this movie U should see now. THIS IS FANTASTIC MOVIE.",
            "review_date": "2016-12-01",
            "source": "rt"
        },
        {
            "content": "Critics rating for this movie is a proof how dump and shallow minded every critic who didn't give this movie a full score. Since its release and it's connected with November (remember remember the fifth of November).",
            "review_date": "2016-11-13",
            "source": "rt"
        },
        {
            "content": "Probably the best political movie that exist. Everything about it is just fantastic.",
            "review_date": "2016-11-13",
            "source": "rt"
        },
        {
            "content": "A Great Comic Book Adaptation By The Creators Of The Matrix Trilogy\nThe Best Thing About The Movie Is How Well Directed This Movie Is And The Not Best Thing About The Movie Is There Very Few Action Sequences As They Were Showing On Trailer But That Few Action Sequence Was Also So  Awesome And Every Character In This Movie Is So Well Written I Loved It And It Is One Of The Most Underrated Comic Book Adapted Movie Of All Time",
            "review_date": "2016-11-13",
            "source": "rt"
        },
        {
            "content": "V for Vendetta provides a great experience through the entire movie, taking the great characters of V and Evey, V for Vendetta makes an already great graphic novel into an even better movie",
            "review_date": "2016-11-11",
            "source": "rt"
        },
        {
            "content": "Literally my favorite movie of all time.   Every action and word means something.   It is visually stunning and perfectly casted.  I can watch it over and over and never get tired of it.",
            "review_date": "2016-11-10",
            "source": "rt"
        },
        {
            "content": "Good to see that BS from 2006 didn't hurt this classic",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Like a Tarantino without any of his flare for dialogue. A comic book movie fittingly realised with comically bad English accents.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Hard to enjoy a movie that is based on ideas that you are bitterly opposed to.\n\nGuy Fawkes was a traitor who would be called a terrorist by today's standards. He tried to bomb parliment and would have killed hundreds had his plot not been foiled. So for the main character to be chosen to associate with this monster is wrong.  Next, there were supposed to be parallels drawn to the Bush presidency? I don't see this but I do believe it's wrong to try and demonize a president who tried to uphold the office with dignity and acceptance of the democratic process, which he did, even if you disagree with his policies.\n\nFinally, if the themes that are supported in this movie don't disagree with you then the scene where the \"protagonist\" takes 100 rounds and in his death throes still has the energy and speed to deliver 30 fatal knife wounds to as many soldiers ruins the movie. Its just so unrealistic I don't know where to begin.\n\nThat's my take on this movie.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "An excellent movie with some great discussion points, some fantastic action, and a great story line.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Whether it was directed by James McTeigue or the Wachowskis, V for Vendetta is a riveting political action-thriller and one of the best comic book movies of the 2000s that is very well-directed and has great visuals, smart writing, outstanding performances by Natalie Portman and Hugo Weaving, and thought-provoking political commentary with some awesome action scenes to boot.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Grade - B-\nIt's highly entertaining throughout and poses some thought provoking ideas, all supported by stunning visuals and good performances. However, its screenplay is a bit of a mixed bag, and some of the ideas intended to be philosophically meaningful come off as ridiculous and, ultimately, silly.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Badly amateurish in its production, acting, writing, direction, or all four at various points, but its still an effective story thanks to the great strength of Moore's work and the good taste in casting. The the kind of film that I really do enjoy the most. Basically entertaining while seriously challenging.",
            "review_date": "2016-10-30",
            "source": "rt"
        },
        {
            "content": "Love the movie..its kinda like what's going on right now....with the water thats poison...really makes you think",
            "review_date": "2016-10-24",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is the directorial debut of James McTeigue, and it stars Hugo Weaving, Natalie Portman, Stephen Rea, and John Hurt in a dystopian political thriller that is based on the same comic book by David Lloyd and Alan Moore about   England being under command of its ruler in the distant future, and when Evey Hammond (Natalie Portman) almost got attacked by some people, a vigilante that wears a Guy Fawkes mask saves her, and kept her for a while as other people will start looking for her also, which she starts to figure more about his plan before November 5th has come in. When I first watched this film years ago, all I remember from it is that it has one of the best writing that I've seen in a film in years, so it was something to look forward to when seeing it again, and to my surprise, V for Vendetta turned out to be one of my favorite films. Hugo Weaving is amazing in this that you can only hear his voice and not see his face, and he's very intimidating even with the mask on. Natalie Portman is great as she usually is, and when she has to act like she lost her feeling of her emotions, it's better acted than I saw from Will Smith or Jaden Smith in After Earth. Stephen Rea does a good job of acting monotonous, and John Hurt is really good as the villain as I never seen him play that type of character. The characters are very three-dimensional, even with the subtle backstories from V whom we still don't know his identity, but wouldn't care about it as the characters are a lot of fun to watch. The writing by The Wachowski Brothers is at it's A game as the lines are clever, it tells some Bible quotes that are related to this story, and it's clever that when you think it'll lead this way, it goes to a different direction that surprised me. Even if there's a lot of exposition as The Wachowski Brothers usually write their films that way, but it's done in a well executed way that I didn't care. The political allegory is really clever, and it gives in to a lot of thought-provoking moments that gets people to think differently after watching this film. The action scenes are entertaining to watch, and the effects look really good with the explosions, and the setting that it takes place as it's a bit different in a way that takes place in the nearest future. The story is brilliantly told that it gets more crazy, but really fits to the tone of this and doesn't go over the top or cartoony. It's a lot of fun to watch, and it has a heck of an ending that I absolutely loved. V for Vendetta is a masterpiece for me that I understand why people still wears a Guy Fawkes mask to represent V for what he stand out for.",
            "review_date": "2016-10-13",
            "source": "rt"
        },
        {
            "content": "On the one hand, a blockbuster action movie even attempting to make a statement on modern democracy (the references to the Bush administration and the Nazis are all but subtle) is laudable, and the film has its strengths- Weaving, Rea and Fry are great in their roles, the editing and story flow are fast, but never overwhelming, and some scenes like the domino montage are genuinely chilling. However, ultimately, V For Vendetta falls into mediocrity with its many, MANY plot holes (often deriving from the changes to the source material), its lackluster set design and, most importantly, in how unreflected, black-and-white and yet confused its message is. V is a hero in everything he does, his killings of nameless men in police suits or cartoon villains are glorified, so is the psychological torture of Evey, and that is never questioned. The film is sending a message on the power of ideas and the people while not allowing the audience to have their own ideas about the proceedings (again, V is a hero and the goverment are all but called Nazis, John Hurt's absurdly over-the-top performance doesn't help either) and stating that Norsefire manipulated the people in the movie, granting them amnesty from them electing Norsefire in the first place. The goverment SHOULD be scared of their people, but how can they be if you don't make them think for themselves and blindly follow symbols and icons.\nThis isn't be the intelligent action movie we deserve- however, in how simple its message is and in how unsubtlely it conveys it, it may be the one the public needs.",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "One of my absolute favorite movies of all time!  Love it because it really makes you think...",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is without a doubt a book-to-screen movie gone bad. While trying to simultaneously trying to achieve a biting social commentary while remaining a nail biting action thriller, the true purpose and spirit of the movie is lost.\n\nThe thread of red roses the film was meant to keep constant the message that not one is above scrutiny in a society and that due this equality, it is everyone's job to scrutinize the government that governs them. However, this thread often gets lost in the film.\n\nI also believe that the so called \"romance\" between V and Evey was beyond forced. There was no need to include it within the film, and if anything it detracted from the storyline itself. It was underdeveloped and useless to the storyline and character arch. While V and Evey's friendship or even mentorship would have sufficed, the writer's sacrificed the point of story to fulfill the needs of middle aged housewives watching.\n\nWhat I did appreciate about the movie was the foreshadowing early in the film with the parallelism of V and Evey's scenes. For a viewer that is paying attention, these scenes allow you to understand early that while Evey may not understand it yet, her and V are more alike than they are different.\n\nOverall, the film left me unsatisfied and underwhelmed. The social commentary however did ring true: a government should be afraid of its people not the other way around.",
            "review_date": "2016-09-29",
            "source": "rt"
        },
        {
            "content": "This film represents very well the current situation in which there are some countries and suggests the true meaning of justice with clear ideas. A very good movie, that takes us to a future in London, adapted by James McTeigue. The main idea is good and innovative. The key to the film is its protagonist, who is hiding under the nickname V and is personified by Hugo Weaving whose face we will not have the possibility to observe. It is a complex character, full of motivations and ideas, he is reproached as a crazy person, as terrorist, and acclaimed as a hero by others. V is a mysterious being, and we will not get to know thoroughly, but  he will be able to inspire us all sorts of feelings: sometimes we feel fear when we saw him appear, and sometimes irrational confidence. But V will not be alone, and that is where Natalie Portman, Evey, a girl who develop a close and special relationship with the masked man enters. In addition, a number of characters evolving guide the flow of the film.",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "movie kept me entertained the whole time.",
            "review_date": "2016-09-27",
            "source": "rt"
        },
        {
            "content": "In 2005, I was blissfully enthralled by Natalie Portman in her follicular heyday, so I didn't quite appreciate the philosophical core of this visually and aurally stunning film. I love the high angle shots in the onyx, low-lit war room, with all those contemptuous whites of eyes staring up at the oppressive video feed of our corn-grilled chancellor. I love Dario Marianelli's soaring arpeggios and was surprised that I hadn't taken notice of him until \"Atonement\" in 2007. I love the brilliantly paced and lovingly lit second act when Evey is taken prisoner and we learn Valerie's heartbreaking story.\n\nI must also give kudos to the impressive cadre of British thespians that I was unfamiliar with before. Stephen Rea's yammy face and the smallest twitch of his lips convey Inspector Finch's every disguised exasperation at the tyrannical government he's tasked to protect, and this time around, I was truly invested in his character arc. Ben Miles of \"Coupling\" is also quite high of power and forehead.\n\nNatalie Portman's accent falls off at times, but the lispiness seems at least consistent, and her performance throughout is every bit as good as her Oscar-winning one, though I do think she plays too coy during her \"confession\" with Father Lilliman so that she seems to be toying with him to aid in V's plan instead of seeking asylum for herself.",
            "review_date": "2016-09-27",
            "source": "rt"
        },
        {
            "content": "The best way i can go into detail with this film is by talking about the writers of the film: The Wachowski's. If your big into film, you're well aware of their contribution to Hollywood with their really only famous work of art 'The Matrix' and...not much else. Well that was if you forget to mention another film while not directing wrote for director James Mcteigue that you might be aware of: V for Vendetta. Now going into this film, i didn't really know or have any expectations since i'm not well aware of it's source material from DC and, like most  mainstream audiences, knew it's signature mask and social commentary it contributed. And honestly after giving this film a shot, what were my thoughts on it? I thought it was pretty damn great. While, sure, not without it's issues in dialogue that, for the Wachowski's isn't much a surprise when you look at what they've been up to since this film, and also in story and pacing I would say the positives in V for Vendetta does deliver with cinematic quality that for a post-Matrix duo could deliver on. Thanks to: wonderfully made shots and direction by James Mcteigue, a very balanced and also inventive script by the Wachowski's, some good political statements that not without it's silly moments is still provocative and also insightful to it's overall mythos and real-life equivalents, a good lead cast from Natalie Portman and ESPECIALLY Hugo Weaving, a often times slow but well executed pace, great action set pieces and also special effects for 2006, and a well done story that even if not adapted 100% from the comics works on it's own merits overall, I think delivers really well as a film that stands on it's own without being compared to it's source material. Though sadly, this would be the last time this duo of writers, the Wachowski's, would be able to prove their cinema taste as films like Jupiter Ascending & Cloud Atlas would soon show that they haven't been making well films since.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "As nice as it was to see the dictatorship taken down, so much of this movie was heavy-handed. The entire relationship between Portman and V was cringe-inducing, especially the torture sequence. I realize the target audience is younger, but the fight scenes were so campy!",
            "review_date": "2016-09-24",
            "source": "rt"
        },
        {
            "content": "Great movie to watch.",
            "review_date": "2016-09-12",
            "source": "rt"
        },
        {
            "content": "Natalie Portman can do no wrong.",
            "review_date": "2016-09-08",
            "source": "rt"
        },
        {
            "content": "A blockbuster ripe with action & thrills but with a poetic and thought provoking nature. This cult classic is moving, and lots of fun.",
            "review_date": "2016-09-05",
            "source": "rt"
        },
        {
            "content": "Brilliant movie. Dark, twisted, and you won't see anything coming,",
            "review_date": "2016-09-01",
            "source": "rt"
        },
        {
            "content": "V for Vendetta must be one of the most underrated movies of the past 20 years. \nWatch it. Put it away for a few years, then watch it again.  And again.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "One of the best and most important movies I have ever or will ever see.",
            "review_date": "2016-08-21",
            "source": "rt"
        },
        {
            "content": "Didn't like the changes they made from the book as they were unnecessary. But overall mostly enjoyable.",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "Honestly one of the best movies ever made. Remains riveting while delivering a thoughtful message. An emotional piece with amazing performances all around and wonderful cinematography.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is not as faithful to the novel as it should have been, but the intriguing story is there and told by great actors giving believeable performances, making it a thrilling, compelling and entertaining movie with a great message.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "The idea is fresh. The story is well written. The actings were good. The message? Profound.",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "one of best performances of Natalie Portman..thought provoking movie...kinda weird but still one time watch..overall Good",
            "review_date": "2016-07-01",
            "source": "rt"
        },
        {
            "content": "Really wish Natalie Portman  was NOT in this. It would have been so much better without her.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "Fun, edgy, and surprisingly relevant, but a little too pretentious for my blood. No doubt that it had a lot of important things to say, and it looked visually stunning, but it was just a little too preachy for me.",
            "review_date": "2016-06-25",
            "source": "rt"
        },
        {
            "content": "Que tonto fui al esperar tanto para verla,  como dirÃ­a calamardo \"Tantos AÃ±os desperdiciados ð??¢\"",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "Stylish action accompanied by a timeless political ideal.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "A very inconspicuously twisted film. As the movie progresses it reveals more tricks it has up its sleeve leaving you in perplexed numerous times. I like it and it keeps the audience intrigued and wish there were more films like this out there.",
            "review_date": "2016-06-14",
            "source": "rt"
        },
        {
            "content": "Though nice dialogue and ideas. Purpose seems to evade me.",
            "review_date": "2016-06-08",
            "source": "rt"
        },
        {
            "content": "V For Vendetta is a movie packed with good performances, the story is a hit or miss story for many people, and it's based on the foundations of a very interesting topic which has been used in many movies, but not like this.",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "V For Vendetta (2005) ??? 132m. D: James McTeigue. Hugo Weaving, Natalie Portman, Stephen Rea, John Hurt, Stephen Fry. Well-done adaptation of comic series about freedom fighter in bleak British future taking revenge on the city's tyranny; he plans to overthrow the entire government with the help from a young woman. Action-thrilled, often thought-provoking, even lyrical at times, with a surprisingly provocative (and relatable) role for Portman. Written by the Wachowski brothers. If only it could escape its comic book ambiance!",
            "review_date": "2016-05-27",
            "source": "rt"
        },
        {
            "content": "This is one of the best comic book to film adaptations I've seen. Hugo Weaving is amazing and Natalie Portman is good as well. I won't say anything else. Just watch it.",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "Einfach ein großer Film!",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "4.5/10 — \"Pretty Bad\"",
            "review_date": "2016-05-14",
            "source": "rt"
        },
        {
            "content": "A masterful film that is absolute must see if you either consider yourself a film fan, love comic book adaptations, or you need some thought-provoking material.  Alan Moore should be proud of this adaptation",
            "review_date": "2016-05-09",
            "source": "rt"
        },
        {
            "content": "Exciting and interesting movie.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "Ebbene, come si fa a non amare questo film?! E' unico e non riesco a trovargli nessun difetto. Il messaggio è forte e chiaro: ci si può liberare da qualsiasi tirannia, collaborando insieme e avendo una forte convinzione nella libertà.",
            "review_date": "2016-05-05",
            "source": "rt"
        },
        {
            "content": "Part revenge movie, part political commentary, part sci-fi, all engaging.  V is the human embodiment of anarchic disdain for over-bearing government. As thought provoking as it is paranoid, and as beautiful as it is disturbing. My only complaint is its slowness of pace and lack of a rather lacklustre  final showdown.  John Hurt was absolutely brilliant as the sinister chancellor.",
            "review_date": "2016-05-04",
            "source": "rt"
        },
        {
            "content": "My thoughts: that's a lot of v's, nice allusions and BOOM!",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "Excellent, poignant, political action film, V for Vendetta is one of a kind.",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "A neutered version of the source material played up for the strange action scene choices, but still manages to convey a few big ideas almost thoughtfully.",
            "review_date": "2016-04-16",
            "source": "rt"
        },
        {
            "content": "People should not be afraid of their governments...governments should be afraid of their people.\n\nGeorge Orwell is one of my favourite authors and 1984 one of my favourite books, so it was easy to see the parallels between V for Vendetta and 1984.  Fun fact: John Hurt who played the Big Brother esque Adam Suttler also played Winston Smith- the hero of 1984.\n\nThis was a great film.  It has particular relevance in today's society and it has some great performance particularly by Hugo Weaving as V.  With his face obscured by a mask, he uses his voice and body language to brilliant effect.\n\nRead my full review for more: http://goo.gl/nNn1DQ",
            "review_date": "2016-04-16",
            "source": "rt"
        },
        {
            "content": "Such a great movie with lots of political plot involved. Loved it",
            "review_date": "2016-04-11",
            "source": "rt"
        },
        {
            "content": "Great cast. Exciting and great story. Been wanting to see it for a while and was worth the wait.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Ten years later, I finally see V For Vendetta. While the script can be Shakespearean in one moment and schmaltzy the next, this movie's substance comes from its still-relevant analysis of the rise of fascist governments. So pop on a Guy Fawkes mask, remember remember!",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Brilliant film with a powerful political message. V For Vendetta provokes the ideas of everything you thought you knew about politics. Bringing back the ideas of the founding fathers and the philosophy of a proper government, the film is set in a futuristic totalitarian government that imprisons its citizen whom live in fear.\n\nHugo Weaving's character, V, is the man with a plan. You cant help but to admire V as he stands up for what is right against the evil of the government. However, everything is so beautifully executed that it's almost romantic. V has such a poetic way that he speaks about his ideas on justice and politics. Hugo Weaving masterfully created a memorable character without using a single facial expression. \n\nAdditionally, Natalie Portman performed one of her most definitive performances as Evey. Evey is an unlikely commoner to become the face of a new generational revolution. She is the character that we draw to as she resembles the audience. We both are enlightened by V's philosophy and vision for a better future and you cant help but to have those ideas resonate with you.\n\nV for Vendetta is the perfect film to enlighten yourself with political ideas in the most entertaining way.",
            "review_date": "2016-04-09",
            "source": "rt"
        },
        {
            "content": "Utterly brilliant and subversive film.",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "Powerful, emotional, and gripping, this is one of the greatest comic book movies ever, and it's in my Top 5 favorite CBM list. Hugo Weaving is brilliant as V and Natalie Portman is also great as Evey Hammond. Let's not forget Stephen Rea's performance as well.",
            "review_date": "2016-04-07",
            "source": "rt"
        },
        {
            "content": "The second half of it and Mr. Weaving's performance throughout the narrative makes this one worth a try. Coming from a major studio, the ideology's bland treatment is expected. Under a more capable direction (Verhoeven perhaps?), the latter might have been amended.",
            "review_date": "2016-04-06",
            "source": "rt"
        },
        {
            "content": "At first glance, V for Vendetta used to appear a typical action film with an almost invincible protagonist. But history proved that first impressions are a subjective principle, and V for Vendetta had much more material and content to demonstrate both ideological as violent and visceral. A script and exceptional cast and a good company plot is what makes this film a very remarkable among many of its kind.",
            "review_date": "2016-04-04",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta\" is a voluminous, visually-striking vigilante video with a vague vision, but it's agenda less so.",
            "review_date": "2016-04-01",
            "source": "rt"
        },
        {
            "content": "Remember remember the fifth of November\nWhen I first watched V for Vendetta I didn't know much about it. However I have always had a fascination with darker comic book movies such as The Crow and some of the Batman's. I am going start by saying that the character of V played brilliantly by Hugo Weaving is one of those characters that will be remembered and is an instance classic. This in truth is 1 of my favourite Natalie Portman performances, she is just so full of determination and curiosity and it's infectious.\nThe scene where V and Evey first meat is truly tremendous. V saves Evey from some men trying to rough her up, she does hold her ground, V shows off some kick ass moves and a very versatile vocabulary (see what I did there). One of favourite things about V is he is an antihero yet he still views himself as a sort of freedom fighter who is standing up for the opposing government. \nThe reason why I love this movie so much is the true determination to do what is right and the casualties that had to happen. V was a broken body but a free soul that wanted to make a difference and he did so. Was everything planned, I don't know but all I know is this movie is a must watch and truly is amazing",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is directed by James McTeigue and  written by the Wachowski brothers. The film stars Natalie Portman and Hugo Weaving as political enthusiasts looking for a change in their anarchist society. I enjoyed V for Vendetta. The film has a very interesting story that gives great dark, yet comical vibe. The film dives into a strong political atmosphere while exploring the emotions through Portman and Weaving's character. McTiegue's direction offers stylish camera work, intense action sequences, and great setting. He makes sure the film balances itself with its political rave and crime thrilling aspect. Hugo Weaving and Natalie Portman both give really impressive performances. Their chemistry on screen holds the film together and is very entertaining to watch. My biggest issue with the movie is that I felt around the third act the film lost its strong momentum that it had earlier in the movie and it really just stalled for awhile.  In the end, V for Vendetta saved itself with an amazing climax scene that was every bit satisfying. V for Vendetta is an impressive film all around that should not go unnoticed.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "Great acting, gets the point across. That being said, go pick up Alan Moore's graphic novel and read the damn thing! IT'll blow your mind!",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "Just rewatched it after many years! Better than ever!",
            "review_date": "2016-03-15",
            "source": "rt"
        },
        {
            "content": "Incredibly unrated film. Excellently directed and an even better message. Well done.",
            "review_date": "2016-03-14",
            "source": "rt"
        },
        {
            "content": "One of the all time best graphic novels actually came out to be a great movie. Also, awesome symbolism!",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "I love the plotline of V for Vendetta.  A dystopian future, where one man creates a movement against an evil government which oppresses and kills people, is a superb framework for a story of the fight for freedom and justice.  I love that the protagonist is never unmasked and lives in anonymity, because it puts the focus more on his actions than on his identity.  There are so many great moments in this movie that it would seem ridiculous for me to list them all, but I was invested in every little scene.  Hugo Weaving has the perfect voice for V, and I was certainly glad that he didnâ??t talk primarily in words that start with v through the whole movie because that would have become annoying.  The supporting cast was all wonderful as well, filled with many amazing British actors (most notably the maniacal performance from John Hurt.)  I want to go on and on praising this movie, and telling you how it is one of my new favorite films, and Iâ??m going to put it right into my Top 20 films of all time, but I canâ??t do that.  Thereâ??s one thing that just kept gnawing at me through the entire runtime of this movie, and itâ??s not going to be a popular opinion I bet.  My problem is that Natalie Portman is so flat and virtually expressionless as Evey.  Occasionally she shifts from her standard slack-jawed look of befuddlement, but when she does it always feels like someone trying to act.  I never think â??look at the suffering that Evey is going through,â?? instead I think â??does Natalie Portman have to make that face every time she tries to squeeze out a tear?â??  Itâ??s so bad that I genuinely had to ask myself at the end of the film, would I watch that again?  So a movie that I loved is brought down significantly by one performance, but if you donâ??t have the same issues with Natalie, then this is a movie I would absolutely recommend.",
            "review_date": "2016-02-25",
            "source": "rt"
        },
        {
            "content": "Gorgeous. Pure beauty. A wonderful \"terrorist\" movie, showing the real meaning behind England's government.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "I'm not really sure why, but for some reason I always have to watch this movie at least once a year...preferably a few days into November.",
            "review_date": "2016-02-04",
            "source": "rt"
        },
        {
            "content": "Un excellent film remplis d'excellentes répliques. Un très bon scénario complexe avec des personnages intéressants",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "More of the same in dystopian film making complete with evil giant heads, and ham fists.",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "Cool on so many levels that it instantly became a classic.",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "One of the rare times that the film exceeds the book.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "The Natalie Portman film festival continues. Why doesn't this look like a graphic novel? The parts that do, that are properly stylized, are beautiful  and engaging. Much of the rest is a lot of dull and sometimes confusing talk.",
            "review_date": "2016-01-28",
            "source": "rt"
        },
        {
            "content": "Riveting,powerful and intriguing.",
            "review_date": "2016-01-18",
            "source": "rt"
        },
        {
            "content": "This movie was great. Natalie Portman and Hugo Weaving had amazing chemistry on screen, and the buildup to the more than satisfying finish was top-notch.",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "this movie is too legit to quit!",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "An action packed and thought-provoking thrill ride with complex characters and stunning cinematography. Weaving and Portman give excellent performances.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "exceptional and entertaining!",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "a criminally underrated comic book movie v for vendetta makes our main character V feel more human than in the comic",
            "review_date": "2016-01-05",
            "source": "rt"
        },
        {
            "content": "Remember remember  the fifth of November\nWhen I first watched V for Vendetta I didn't know much about it. However I have always had a fascination with darker comic book movies such as The Crow and some of the Batman's. I am going start by saying that the character of V played brilliantly by Hugo Weaving is one of those characters that will be remembered and is an instance classic. This in truth is 1 of my favourite Natalie Portman performances, she is just so full of determination and curiosity and it's infectious.\nThe scene where V and Evey first meat is truly tremendous. V saves Evey from some men trying to rough her up, she does hold her ground, V shows off some kick ass moves and a very versatile vocabulary (see what I did there). One of favourite things about V is he is an antihero yet he still views himself as a sort of freedom fighter who is standing up for the  opposing government. \nThe reason why I love this movie so much is the true determination to do what is right and the casualties that had to happen. V was a broken body but a free soul that wanted to make a difference and he did so. Was everything planned, I don't know but all I know is this movie is a must watch and truly is amazing",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "Hugo Weaving is amazing in this film. He is perfect as V. Natalie Portman did good too but it really is Hugo who carries this movie. There is so much to quote in this movie, its awesome. V as a character can get extreme at times but he is still no less bad ass. Its an under rated movie to say the least.",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "Overall good film, the story was smooth. Only thing that bothered me was that it felt like it was a copy of George Orwell's 1984 book.",
            "review_date": "2015-12-07",
            "source": "rt"
        },
        {
            "content": "great performances and casting. good plot and good effects. only complaint is the poor action.",
            "review_date": "2015-12-02",
            "source": "rt"
        },
        {
            "content": "A really enjoyable movie. The story is interesting and the acting is good. The movie makes you hate and love V at the same time. Natalie Portman does a great job and is easy to empathize with. I definitely recommend this movie. Especially on Nov 5.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "one of those scary movies because you see it coming true.\nthis is one of my Favorite movies, and is about a 100 times better then the Matrix. A great  film everyone should watch.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "maybe It is not the best movie I've  ever seen,but for someone who is waiting for a hero or changes even the ideas of V was gorgeous!",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "Top 5 movie of all-time!!! Great film!",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "\"V for Vendetta\" is a story about revenge. Simple enough, but it also contains some thoughts I'd dare call profound, along with solid performances and several iconic moments that will stick with you. Is it a faithful adaptation of the graphic novel by Alan Moore? Not really, but like any interpretation or adaptation, it's ok to deviate from the source material as long as the end result is good and the spirit remains. It's not like this movie is going to barge into your house and burn every copy of the comic after all.\n\nSet in an Orwellian-like England, Evey (Natalie Portman) happens upon an extraordinary man, a masked vigilante simply known as V (voiced by Hugo Weaving). Think of V as a cross between Edmund Dantes (from \"The Count of Monte Cristo\", you uncultured swine!) and Batman. Is he a terrorist, or the savior the country has been silently praying for? Either way he's out for blood and seeking to take down the totalitarian government, partially because it ties into his own mysterious past. \n\nBased on the graphic novel written by Alan Moore and illustrated by David Lloyd, this 2006 release but varies wildly from the pages that originally brought the characters to life. I'm torn to which I like better. Here, V is seen as a heroic vigilante and less like a wildfire spawned from the discontent of the masses. Other changes set the story in more contemporary times and there is less emphasis on the tyrannical government. The amount of characters is significantly reduced and most of the sub-plots are gone, replaced with more backstory on the world. It makes for a product that's significantly less intellectual and more action-oriented, but there is still a pretty solid brain rattling in that Guy Fawkes mask.\n\nWhat works best is that viewing the picture feels empowering, even while never leaving the real of complete fantasy. V is a charismatic hero that makes the whole rebellion thing look easy. He's such a larger-than-life character that he transcends the limitations of the media and goes on to inspire rebellion and power to the audience with his eloquent speeches, incredibly intricate plots and moments of kick-ass kung-Fu. The 17th-century conical hat, the black outfit (cape, gloves, tunic, trousers and boots) and the \"face\" with the shoulder-length wig of straight hair and the Guy Fawkes mask are incredibly iconic. It's that right mix of theatrics and realism. With the film's big climax, set a on the 5th of November no one is ever likely to forget... it's no wonder that visage has become a symbol for disgruntled youths looking to rebel.\n\nThere are numerous bits of dialogue that will stick with you and shake you out of your sluggish existence, lines like \"Ideas are bulletproof\" and \"There are no coincidences, only the illusion of coincidences\" and probably most iconic of all \"People should not be afraid of their government, government should be afraid of their people\".  Those are my personal favorites. There is a long speech where V introduces himself so eloquently phrased it makes you want to pause the scene and rewind it over and over until you've memorized it.\n \nV is a character you are instantly drawn to and want to learn more about, but he's not the only compelling player. We've got an avatar for the audience, a sidekick to our superhero in the form of Evey. She's got plenty going in both in the way she interacts with V and how she transforms over the course of the plot. The two characters have an interesting relationship that switches between hero & damsel in distress, aggressor & victim, mentor & pupil, lost soul & savior and there's a hint of romance thrown in. These characters begin on not necessarily opposite sides, but on very different planes of thinking. As their interactions are shown on screen, you will flip between whom you associate with more closely. While some of the in-depth sub plots from the novel are gone, I feel like the ones that remain keep the film afloat. \n\nThe action is memorable and well shot, particularly during the sequences when V gets to really show off him karate gimmicks against a slew of opponents. There are several big explosions throughout the movie, nerve-wracking turns, tense decisions made, and all balanced with some moments of deep reflection/contemplation. A particular highlight in the set design is V's lair, which is reminiscent of a museum and an antique store in desperate need of a serious clearance sale, but quite striking. You'll find a ton of theatrics and moments that will have you pumped, excited to see more.\n\nWhen it's all over, you might even have learned a thing about how you ultimately feel about revenge. If not, hey at least you saw a blood-pumping action movie about not taking no guff from nobody. There's a lot of re-watch value contained in the 132 minute running time and you're going to praise the Home Video Gods when you realize turning on the subtitles makes it a whole lot easier to memorize the epic speeches delivered throughout. I find myself itching to watch \"V For Vendetta\" every 5th of November, if only so I can pretend like I can recite every line and sound as majestic as Hugo Weaving, or capture a sliver of the work that inspired the film. (On Dvd, November 5,",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Great setting and atmosphere, with near flawless action sequences.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "V for Vendetta (2005) has always been one of my favorite movies, I had to break down and watch it again last night in order to get a refresher; it's still perfect in every way. The cast in V for Vendetta couldn't have been any more perfect featuring stars like Hugo Weaving, Natalie Portman, Rupert Graves, and many others; perfection to the letter. Being that this film was released in 2005, the film still sits beautifully up to date and accurate in today's film technology if not better in some ways. The story-line says it all and with that story it is held in high regards for humanity to hear, what a masterpiece.\n\nThe cinematography is a work of art, perfectly selected music for each scene, eye candy for the masses in hopes of understanding the messages and so much more.\n\nV for Vendetta (2005) will always be one of my favorites and highly recommended for the world to see.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "It is like great experimental theature.  Full of fun and emotion and surprises.  It is intense to the point of reckless and VERY theatrical.  What's not to love?",
            "review_date": "2015-10-24",
            "source": "rt"
        },
        {
            "content": "This is a brilliant movie. It brings together great action with well put together story about distopian society. The performances are amazing also.",
            "review_date": "2015-10-14",
            "source": "rt"
        },
        {
            "content": "Pulling together elements of \"A Clockwork Orange,\" Batman,\" and some of the best noir & political thrillers, \"V for Vendetta\" is more than just fighting words.",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "A frustratingly almost-great film!",
            "review_date": "2015-10-10",
            "source": "rt"
        },
        {
            "content": "If you were hoping for a page for page adaptation of Alan Moore's great graphic novel, you're probably gonna be let go by this. However, this movie surprisingly holds well on its own and I actually recommend this.",
            "review_date": "2015-10-04",
            "source": "rt"
        },
        {
            "content": "good idea, badly carried out",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "One of the most ambitious films I've seen in a long time! Sure, the script is clustered with so much information, plus some of the scenes felt rushed, but thanks to an intriguing premise and an awesome protagonist, \"V for Vendetta\" shines as both a political thriller and an emotional ride about overcoming and stopping oppression. Bravo!",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "Very multidimensional and thought provoking. A little Phantom of the Operaesque. Well done, though. Excellent performances by Natalie, Hugo and others.",
            "review_date": "2015-09-16",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen, every minute only increases my interest in history, and the references to reality are very well achieved. 5 star, is one of my favorite movies.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "the sad thing is that it's a clear message to take action before things get that bad \n\nit's a great movie from some of my favorite graphic novel",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "Ideas are bulletproof. The movie is, however, not.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "great movie with interesting concepts and creative scenes and situations. great acting by natalie portman, and an amazing score. very moving and deep movie. not your traditional superhero movie, but what it lacked in action it made up for in substance (2 viewings)",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "A masterpiece and such a deep thought provoking movie. This is the type of movie you can get into conversation and debates with friends for hours after seeing it. Every time I re watch it I find something new and thought provoking about it. It's a fantasy totalitarian British state but with countries still living under that control today and in history it paints a picture of how a government can manipulate a democratic fee country with fear to force them to give up their freedoms for protection from the government. So real a possibility that it scares you. Especially after the Patriot act",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "Strong political themes and a stylishly dark tone gives 'V for Vendetta' intrigue for the first 30 minutes but the movie's promise vanishes by the end as we frustratingly don't learn enough about the two protagonists because of the movie's teasing flashback storytelling. Also we have to deal with a poor Portman who had clearly not come out of her acting shell until 'Black Swan'.",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "Visually exhilarating, provocative and disturbing. No doubt, a significant input of talent was involved in the creation of this film. However, i do object to the excessive violence, as well as the association of conservatives and Christians with the creation of the totalitarian state in the movie.",
            "review_date": "2015-08-28",
            "source": "rt"
        },
        {
            "content": "Anonynous' call to arms.",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "Visually stunning,politically bias and nice action sequences about sums it up.",
            "review_date": "2015-08-23",
            "source": "rt"
        },
        {
            "content": "Watch it if for nothing else but to see how effectively voice can be used to convey emotion. V has no living eyes - he has only a mask - and yet it's quite easy to connect, even in silence. The dialogues are so different from the usual, they are a real pleasure.\nThe story though, starts off as a revolutionary and peters off as a Vendetta, to a large extent - but no other way would it work! The performances, color schemes, places of living, the way of talk - it's nothing but a beauty on all fronts.\nMust watch.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "Idealistic and ambitious, 'V for Vendetta' is a film involving the transformation of ideas to shape humans and their choices to oppose the oppressive. Moreover, it is well-executed and has a strong narrative structure.",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "Epic movie, amazing!",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "I know not why this movie should ever be forgot.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "(One of my personal favorites.) This film is one that keeps viewers on the edge of their seats, leaving them with a lot to think about. Hugo Weaving and Natalie Portman both shine as the main characters, both having opposing points of view about the world. But as some would say, \"opposites attract.\" Anyways, this is a movie that will definitely be worth your while.",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "Altohugh the pacing is a little off, V for Vendetta is otherwise a great movie, and VERY underrated.",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "This movie opened my eyes and I've changed my political views because of it. Great movie !",
            "review_date": "2015-07-15",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is not your average comic book movie, it manages to convey a deep message while also providing the thrills and set pieces the genre is known for.",
            "review_date": "2015-07-08",
            "source": "rt"
        },
        {
            "content": "This is now my new favorite movie!!!!! I loved the acting, the action, the story, just EVERYTHING ABOUT IT!!!!",
            "review_date": "2015-07-08",
            "source": "rt"
        },
        {
            "content": "A very thought-provoking and inspirational movie. While the directing could have been better, this movie is very memorable for it's performances, style, music, story, and message. The writing is phenomenal, and the character of V is one that is portrayed amazingly by Weaving. This movie makes you conflict with what's right in the movie, and keeps your interest 100%. The music also adds an element of power to some great scenes. Overall, very memorable and, just like V's idea, leaves an impact. 9.25/10",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "I assume that it's a tribute to Guy Fawkes. \"V,\" like Fawkes, was bold.",
            "review_date": "2015-07-04",
            "source": "rt"
        },
        {
            "content": "Watched V for Vendetta last night and it was really well done. You can't go wrong with Natalie Portman for one and just the story. The fact that it can actually exist in the world today. The false propaganda to isolate a country and make them believe that in other places in the world there is wars and disease outbreaks when there really aren't. The story was well told. My only gripe with it was the blood with the attacks.",
            "review_date": "2015-07-01",
            "source": "rt"
        },
        {
            "content": "Tremenda película. Una historia bien contada de principio a fin. Quisiera conseguir la novela gráfica original para leerla.",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "Amazing movie! In my top 5 for sure.",
            "review_date": "2015-06-20",
            "source": "rt"
        },
        {
            "content": "While the political message seems very familiar, V For Vendetta is stylistic in symbolism and Hugo Weaving is so awesome as the V character. Natalie Portman though felt miscast.",
            "review_date": "2015-06-14",
            "source": "rt"
        },
        {
            "content": "Truly a great film. The truths it tells through lies can be amazing. The story along with the plot and setting just fit so well.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "Powerful movie, highly recommended.",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "Amazing movie, the acting is truly great which is interesting to say considering you don't even see the main characters face. This movie is deep in so many levels if you actually read into it, from the political aspects to the interesting slight dialogue about at the USA and even the subleties of the Chancellors appearance. Even with that depth the movie is one that can be watched over and over due to the incredible action scenes.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "Almost makes me want to rebel.  Hugo Weaving single-handedly takes on the government.",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "Awesome. A must see for people in this age. Through a pseudo superhero story, it is a criticism of oppressive government and an explanation as to why we need to protect our rights.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "Amazing great film. Loved it from start to finish. Great acting and story.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "The first time I watched it, I loved it. I was fifteen years old, I was a social outcast, and I enjoyed the idea of an ostracized, wounded man rising up against the oppression of the system. As an adult, I see a moderately suspenseful drama that takes itself too seriously, whose political propensities are so obvious that only a self-absorbed melodramatic teenager could miss them. The only vendetta this film has is against political conservatism; it replaces President Bush with a fictitious corrupt British fascist regime and uses emphatic arguments to make the point that conservatives have been making for a very long time: too much government is a bad thing. Some of V's points are valid, but they are lost amongst the left wing, redefine marriage message and the explosions. Teenagers everywhere will think the writers knew the very soul of American struggle. Adults will see this for what is: Leftist Hollywood creatively pushing its agenda.",
            "review_date": "2015-05-15",
            "source": "rt"
        },
        {
            "content": "Politically strong and very well acted, V for Vendetta is an anarchist's dream come true, but the film in its own right can be enjoyed thanks to Hugo Weaving's brilliant portrayal of the radical V.",
            "review_date": "2015-04-19",
            "source": "rt"
        },
        {
            "content": "Interesting movie, a corrupt and evil government, being defeated by only one man, code name V.  Everything about it is well done, the acting is good, the script is good, and the action is pretty darn cool.  The masked man, or V, is a very cool figure, and could be called an super hero I guess, with unrivalled skills of hand to hand combat.  He's voice is muffled at times beneath his mask, making some of his many long speeches confusing at best.  He is however an absolute badass, so that makes up for everything.  The bad guys in the government are cool characters too, just doing their jobs and not entirely knowing the bad their government has done.  Natalie Portman plays the star of the movie, but her importance is overshadowed of that of her saviour, V.  She's also strong hearted, and a very good character who is well played.  Overall it's a very good movie, although some scenes can be slow at best.  V hunts down and kills some key members of who killed that thousands of innocent civilians in their tests, and it was shown without mercy.  I was actually surprised at the amount of death, blood and simply dark subject manor that I didn't really expect.  V's last stand against the soldiers in the sewer was very well done and awesome to watch, and turns out to be one of the best scenes of the entire film.  The killing is efficient and bloody, and the cinematography is very well done.  Overall very good movie, with the exploding parliament building a great way to end off their success, although the explosions could have been better.",
            "review_date": "2015-04-16",
            "source": "rt"
        },
        {
            "content": "I understand what the creators were going for and I am pro-Revolution, but this film fell a bit short of what I expected.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Still remains one of my most enigmatic and engaging movies...what's not to like?",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Brilliant - something to watch again and again",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Great movie sad ending, best saying ever is \"a man can be killed, but an idea is bullet proof\"",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "................I feel unclean for not seeing this movie until now. \n\n................I feel like this filled a hole in my soul that has been left unfofilled for years now.\n\n................I think this might be my favorite comic movie of all time next to Batman Begins.\n\n.....thank you James McTeigue and The Wachowskis.....thank you so much for being such great filmmakers.",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "\"I, like god, do not play with dice\".\nA brilliantly written movie and well made. Hugo's performance despite the mask is a testament of amazing acting.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "An amazing adaptation of my personally favorite book. V for Vendetta is an action-packed, gritty and modernized telling of the classic tale about political revolutions. With heavy themes handled very well, amazing actors and actresses with many emotionally powerful scenes and moments.",
            "review_date": "2015-03-04",
            "source": "rt"
        },
        {
            "content": "90%\n----------\n5.0  -  Hugo Weaving\n4.5  -  Natalie Portman\n4.0  -  Stephen Rea\n4.0  -  Stephen Fry\n4.0  -  John Hurt\n3.5  -  Tim Pigott-Smith\n3.5  -  Rupert Graves",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "It took me a while to get around to seeing this movie but I liked it.  One probably I need to see again to catch everything as certainly a viewer won't the first time around. One major theme is what we would we all sacrifice for security. And what would be the cost of getting it back. I thought the acting performances were great, always been a John Hurt fan whether he's a villain or an alien host.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "When this was first released I liked it a lot, and as the years have passed I find I only like it better.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "\tReview is personal, amateurish, and has spoilers\n\n   V for Vendetta is the comeback for the Wachowskis after the Matrix trilogy. The movie was based on the graphic novel with the same title. Though Allen Moore (Author of the graphic novel. Movie is based on this) absolutely hates this film, it is still loved many people around the world. Well, V is pretty cool Hugo Weaving's acting is very impressing. The mask of Guy Fawkes is also well known due to this movie. \n   The main focus of the movie is resistance against the government. The world of 'V for Vendetta' and our world are very different. It is a world where England has a fascist government during 2020 and a party called norsefire that believes in totalitarianism. There is a conflict between anarchism and fascism throughout the whole movie. V is the one representing anarchism and the English government is the one representing fascism. The government is very secret to its citizens and people. It shows nothing true and tries to trick the people by showing fake news through the channel BTN. Also, norsefire is quite similar to many aspects from George Orwell's 1984 and the beliefs of Adolf Hitler. It must be no coincidence that the High Chancellor is named 'Adam Sutler' in the movie. The government is trying to conceal everything V does in the movie. The government's sins are also revealed in the incident 14 years ago. 14 years ago, the British government killed non-white people, Muslims, gays, lesbians, in the Lark hill Prison. V was a survivor from this place and that is why he despises the government. V is the one that wishes the citizens to stand up. He desires the government to be afraid of the people, not the people be afraid of the government. V believes in anarchism and wishes to overthrow the current government. V wears a Guy Fawkes mask because they are both similar. V and Guy Fawkes both go against the government and they eventually die. However, unlike Guy Fawkes at that time, the people of England get together and take over the beliefs of V. The people stand up against the government just how V wanted. \n   The movie was enjoying and also wanted to tell the audience a message. It wanted the audience to also remember and stand up against what they are afraid of.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Great movie with a great message, we are currently living most of the things this movie show us",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "like the matrix this movie changed my perception for the world",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "One of my favorite cult films. All around entertaining. Great performances by the leads and supporting cast. Such an iconic character brought to the big screen. I would recommend this film to anyone looking for more then loud bangs and little to no story.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "Stylistically it's amazing but the plotline is occasionally too convoluted to get through. Full review later.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "V for Vandetta's story is ultimately timeless, its politics are crazy real, and its acting is powerful. It questions what really are are morals and how we're watching the world burn. V for Vandetta is very entertaining and a true masterpiece of the modern world.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Imagine this film remade but instead of V the main character is Russell Brand.\n\nYep. It'd be as shit a film as it is an idea in real life.",
            "review_date": "2015-01-21",
            "source": "rt"
        },
        {
            "content": "V for vendetta \nIs the 2nd best DC movie ever but best graphic novel live action ever to me a must buy 9.7",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "Really good despite not quite living up to the source material.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "A very dark and very brilliant comic book adaption.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "* 1984, 451, The Prisoner",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "Its the Wachowski Brothers, so its going to heave awkwardly handled political ambitions.  I don't think it really succeeds as a dystopian future warning movie, but it is has superb action scenes, and as a violent action movie I liked it better than any of the Matrix films, whose more over the top set pieces seemed less kinetic and imaginative to me.  A mixed bag, but some choice bits in the bag.",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "This is the best government corruption film ever made. Hunger Games was built off of this!!!! This movie will make you.....................hopefully....................THINK!!!!",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "graphic novel is awesome and so is the movie",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "A rebellious film with the most gripping revenge, V is a striking icon with the Guy Fawkes mask for many to this day. This movie initializes a new birth for a corrupt society, and with the dramatic life events that happen to everyone, the movement of this story is teaching and showing literally that no matter what, your environment can change who you are for the better or the worse. This movie has a remarkable touch of mystery behind it and grabs one's mind into wondering what is really happening around us that we're not informed of. The mask is a very large icon for many who have the anarchist type of outlook on their society and for the rebellious ones who see past the lies. Revolutionary comebacks of England's society stands strong, with V's face unmasked but moved by the ways of truth and words.",
            "review_date": "2014-11-19",
            "source": "rt"
        },
        {
            "content": "\"Artists use lies to tell the truth, while politicians use them to cover the truth up.\" I'll never forget that quote. It certainly captures the essence of the movie. Though the story is fiction, the idea is as true as can be.",
            "review_date": "2014-11-18",
            "source": "rt"
        },
        {
            "content": "A violent and very interesting movie, more phycological than physical. 79/100",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "As I get older I recognize that this is not the film masterpiece I thought it was when I first saw it several years ago. However, it is still one of my favorite movies with some wonderful action sequences and some poignant social commentary.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "bloody brilliant movie",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "Remember Remember the 5th of Nov !! A movie perhaps ahead of its time",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "probably the best pro terrorist sci-fi movie ever made. I watch it every Fifth of November.  Remember, remember! \n    The fifth of November, \n    The Gunpowder treason and plot; \n    I know of no reason \n    Why the Gunpowder treason \n    Should ever be forgot! \n\nIt is a lot to think about. Violence should never be the answer.  Sometimes we make exceptions; like with the American Revolution. If things get the way they are in V in the future, what would we do? What would I do? what would you do?",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "A revolutionary fantasy that implies that destruction is good because something better will follow - even without a plan for any sort of creation to follow the destruction. Historically, that's seldom the case; but it's a nice fantasy.\n\nYoung dissatisfieds especially glom onto this sort of easy revolution that focuses on the exciting romance of tearing down but doesn't include the hard work of creation and building (V-masks were a not-infrequent sight among the Occupiers who monopolized parks and smashed a few windows a few years after the movie).\n\nThe cool, richly appointed revolutionary lair and dramatic outfits heighten the romance as well.\n\nGreat performances. Beautifully designed and shot. A stirring movie.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Watched having not read the comics, enjoyed it, plenty of mischief in an Orwellian England.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Very good sicoal commentry. and very though provoking.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "A stunning and visceral take on politics and a modern classic of cinema.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is a really dark and gritty movie about a futuristic fading society full of crime and murder.With thought provoking moments and great acting this movie is definitely worth anyone's time",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "Willing to take more controversial story telling over mindless action, V for Vendetta stands as unique comic book film, that is visual striking, expertly written, at times thought provoking, and well acted.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Enjoyable and nice that its full of British actors. Better than the usual Hollywood drivel you see these days.",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "More and more applicable every day...",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "i enjoyed this movie.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "This movie is seriously awesome. It's set in a dystopian Britain where a tyranny has taken over and a freedom fighter who goes by V, is aided by a girl and together they try and fight back. This movie blew my mind and in my opinion, it's one of the greatest comic adaptations ever made. It has a great cast, great setting, and has great acting. This movie was so believable it felt like it could really happen. This is one of the best if not best dystopian futures in a film. It's great.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "I won't lie, the movie and plot is done with such excellence that its almost unprecedented. But there is something dark and mysterious about this film. Watch this and tell me you don't feel something dark stirring in your soul.",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "Thought-provoking, exciting and well-acted, \"V for Vendetta\" is a great achievement from the Wachowski brothers. This movie really is compelling and exhilarating, and is definitely worth a second viewing.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "Loved it! Inspiring, Thrilling, Funny.",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "V for Vendetta is a really dark and gritty movie about a futuristic fading society full of crime and murder.With thought provoking moments and great acting this movie is definitely worth anyone's time.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "This was a great movie! Good cast, good plot, good story line. Hugo Weaving and Natalie Portman are great together. Great movie!",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Its narrative is quite contrived and melodramatic - but in this case, it really doesn't matter. Its powerful message is hammered home with great intensity, supported by an excellent cast and great visuals. V for Vendetta will be a fantastic thrill-ride for some, and a strongly-worded cautionary tale for others.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "A Politically Astute And Compelling Adaptation!",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "87%\nHaunting and poetic, V For Vendetta is a splendidly-acted trip.\n\nVERITABLE: 72%",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "This movie was a very interesting social and political movie, as well as a slick action movie. This movie is a must see rebel-film, that comic fans will enjoy as well. I really liked the mystery behind V, and am glad many questions were left unanswered about him. Remember, remember the fifth of November!",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites. Portman and Weaving were magnificent. Brilliant story, fabulous direction. And thankfully no sequels.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "Loved Natalie Portman, although the movie was disturbingly dark with themes of oppression, genocide and anarchy.",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "A flawless movie except they rammed the homosexual scenes far too much.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "a very thought provoking film with a intricate and thought provoking storyline.\nportman and weaving are brilliant in this film",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "a thought provoking, brilliant film with excellent chemistry between portman and weaving",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "So grim and full of vengeance - just what a rotten society needs.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Americanised pap. Stick to the book.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Well acted and excellently scripted, \"V for Vendetta\" is one of few action movies that is as  notably (and suprisingly) thought provoking as it is.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "One of the best films I've seen\nDespite the fact the V for Vendetta has been out for a number of years I only witnessed this film recently after seeing the high ratings online. I have to say that I am highly impressed by this film. The film portrays a realistic future with a fascist government in control of Britain. I found this highly thought-provoking about how government's operate behind closed doors. In particular I was impressed by the Goebbels-like spin doctor tactics employed by the regime in the film. In the film the audience are objectively shown the actions of V and can recognise the difference between the propaganda and the reality. The film raises philosophical questions such as are machiavellian responses justified and the correct response to an omnipotent totaliterian regime? Like any futuristic works of art this film is an allegory to our own increasingly panoptic society and examines the role of government. As well as carrying a strong political message this film is slick and stylish and packed full of action and is a thrilling watch from start to finish.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "The dialogue and ideologies of the movie is what makes it stand out.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Violence, brutally meaningful.\nVengeance, gleefully served.\nVoice, symbolically empowered.\n\nV is more than just a letter. It is a symbol. It is the mask that we all have underneath, but not the one we dare wear. It is the past we suffer, the present we exploit, and the future we create. \n\nThis tale is Venomous with its themes, slowly but surely injecting them into the minds of the characters and the audience.  \n\nIt is also Vicious with the tongue twisting truth, pulling itself into the spotlight and revealing the disturbingly decaying body of hope.\n\nTwo bits of wood, and controversy is sparked. Give it some gunpowder, and realisation is kindled. A red bird goes up in flames, and a silhouette disappears from the scene like the ash it produced.\n\nWhile showered with Shakeperean language and a timeless moral, what really makes this piece of art visually and mentally explosive is its Vigilance. \n\nA Vendetta could be brought to the oppressors with a gun, but a phoenix society will only be reborn with a gun and a mask. Its ambiguity makes it more than relatable and certainly invincible. \n\nHe says that the mask is who he truly is, not what's underneath (lol @ Batman). He also claims that this mask is made of ideas and ideas...are bulletproof. \n\nEnough said. \n\nP.S. oh, and Natalie Portman is as effortlessly tremendous as ever. Even as a baldie.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "For some reason, I have an urge to watch this every other day. From the action scenes to the social commentary, this movie satisfies my entertainment needs.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "This was one amazing movie",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "A good political Thriller with solid act from it's actors.",
            "review_date": "2014-07-23",
            "source": "rt"
        }
    ]
}