{
    "rating": 8.9,
    "release_date": "1997-10-10",
    "num_reviews": 290,
    "genres": [
        "Drama"
    ],
    "summary": "In the San Fernando Valley in 1977, teenage busboy Eddie Adams (Mark Wahlberg) gets discovered by porn director Jack Horner (Burt Reynolds), who transforms him into adult-film sensation Dirk Diggler. Brought into a supportive circle of friends, including fellow actors Amber Waves (Julianne Moore), Rollergirl (Heather Graham) and Reed Rothchild (John C. Reilly), Dirk fulfills all his ambitions, but a toxic combination of drugs and egotism threatens to take him back down.",
    "reviews": [
        {
            "content": "Julianne Moore in a great role and our introduction to some many other great actors. Keep directing...",
            "review_date": "2023-02-11",
            "source": "rt"
        },
        {
            "content": "A brilliant film.  Captures its characters over confidence and stupidity perfectly.  Set against a 1970s/early 80s porn backdrop, what's not to like.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "Pretty well done movie that is good at describing the times & the place but isn't deep",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "This movie has all the PTA magic and more. While its not the most complicated structured movie, i can throughly enjoy the themes its tackeling. Everybody was great in this movie, with the stand-out of course being Mark Wahlberg. PTA brings his magic to the table again, long takes, great screenplay and gorgeous locations, great movie",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Interesting but in very bad taste. Sort of in line with all the weird stuff from Hollywood Epstein etc. Not anything I would recommend.",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "filmaço, a maneira como é contada a história da pornagrafia vhs, dos astros de 70 do inicio 80, grande filme com grandes atores.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "A truly significant film on many levels however the subject matter may come off as a bit too sleazy or degenerate for many viewers. I can confidently say this is easily one of the best films of the 90's overall. In my book this immaculate capturing of the 70's and sensitive handling of the themes and characters make this film stand next to other 90's all-star entries like 'Heat', 'Eyes Wide Shut', 'Shakespeare In Love' and so on.",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "fan-freaking-tastic! one of the best PTA films, so pure and honest and hilarious and absurd and over-the-top, but somehow never gratuitous.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Great direction and story telling, how one can take this bold topic to this another level. Camerawork is so effective, too. I'm not interested in the porn industry, but this film is beyond that. All the supporting actors are perfect, I personally don't like the leading actor though. Heather Graham is so good.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "The best acting performances from Burt Reynolds and Julianne Moore!",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "Great Movie that depicted what it was really like back in the hedonistic seventies. Morality was at an all time low and Americans discovered pornography on video !",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "Mark Whalberg, the late Burt Reynolds and Phillip Seymour Hoffman, Heather Graham, Julianne Moore, Luis Guzman, Thomas Jane, John C. Reilly, Joanna Gleason, and Don Cheadle \nPaul Thomas Anderson directs an all-star cast in the San Fernando Valley of 1977\nFamous adult filmmaker Jack Horner comes across Eddie Addams\nEddie's life seems to be going nowhere and even his mom can see that \nSoon he changes his stage name to Dirk Diggler and makes it big in the adult entertainment industry \nBut Eddie falls victim to his addiction of fame, drugs, and egotism slowly crumbling everything around him \nThe first half of the movie is all fun and games. But the back-half of the movie is a sort of punishment for those fun and games from the 70s to the 80s\nFinally the latter half is an excruciating descent into desperation and stupidity \nThis was a comeback for 70s actor Reynolds even if he hated the movie garnering Oscar praise and this does clock in at 2 and half hours \nThis is still a stylish and electric tragicomedy and ultimately, is about love, acceptance, and finding your place in the world\nYes this is an adult entertainment opus but it's very spot-on capturing the 1970s feel of the X-rated genre of filmmaking\nWhalberg magnifies the screen with his presence playing this man that succumbs got violent mood swings and is unable to perform \nPlus this had Anderson emerge as a filmmaker considering he had a real-life fascination with the subject matter growing up\nYou can tell the authenticity is there since the director even hired real-life adult film stars\nAnderson has a passionate and painfully honest depiction of the American soul eliciting something similar to a punk band's first records — pure fiery brilliance \nHe perfectly captures the ambition, style and freneticism of the era in the gorgeous grainy cinematography and the characters who feel like an indelible part of the landscape's makeup \nA story of a man that can be spat back out from the fame that gave him a purpose in a world of exploitation \nAnd a fantastic take on a Golden Era that nobody wants to remember and it's pretty relevant",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "An interesting portrayal of an \"actor\" struggling to find work.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "Perhaps a bit overlong, but quite good overall and Wahlberg proves his worth as an actor. Hoffman and Moore are terrific here as well.",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Love Anderson and pretty much everything he puts out the sound track was so good! the story was also good came pretty strong full circle and really shared the nostalgia of the time. the soundtrack and clothes really made this movie for me. it was Also so good to see Mark Wahlberg in this kind of Character.",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "7 years ago- A killer soundtrack takes center stage on a movie with amazing and out of nowhere action sequences and well done, real characters. Also, Alfred Molina.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "With the masterful cinematography meeting a nicely-written rags to riches tale, this is one of the better films of the 90s and easily amongst PTA's best work.\n\nLink to full review: https://jwoffscript.com/films/f/boogie-nights-review",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "This is one of those films that I was ridiculously overdue in seeing; finally getting to it, it made me laugh, it gripped me and as with all PTA's films it was technically flawless with excellent performances. I wasn't expecting it to be quite such an effective tragicomedy about a bunch of ludicrously self-obsessed people; and perhaps because it was that, it didn't move me the way a film like The Phantom Thread did. I have no doubt it has rewatch value, and there are lots in it pointing toward his even better films to come.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "[9/4/21]: I brought up the absurdity of it, but how when it takes a serious tone with Don Cheadle's character, it does so seamlessly. PTA has a mastery of tones. We genuinely care about these characters that are only displayed as goofballs earlier on.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson's amazingly gritty and compelling story of the world of pornographic film industry of  the 1970's.  This one takes a seedy underworld and brings humanity and drama to it.  The performances by Burt Reynolds, Julianne Moore, Philip Seymour Hoffman, and Heather Graham and more are what makes this one truly an amazing ride.   Mark Wahlberg is very good, and although he is the star it is all that surrounds him that make this one so good.   The Direction, the costume design, the cinematography all make you feel like it is 1977.  This is very adult.  It is gritty, but it is very good and very watchable.",
            "review_date": "2022-06-28",
            "source": "rt"
        },
        {
            "content": "If you want a movie to define the Porn industry in the 1970's and 1980's, this is it.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "What starts as a hilarious raunchy comedy takes a surprising, but earned turn towards drama halfway through. The audience really feels the consequences of the lifestyle choices each character makes and while sympathizing with them, we still have some good laughs along the way.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "I do not understand the hype about this movie. It is absolutely grotesque (and I don't just mean the pornography). The characters are annoying, there's not one of them with a light presence or funny trait. It is longer than it should be; 120 minutes would have been more than enough. Its plot is very typical, think like Purple Rain, Flashdance, Saturday Night Fever… The main character wants to \"get there\" and they do and then problems arise and then suddenly bam everything is solved. However, Paul Thomas Anderson does a great job at directing. The movie catches the vibe of the late 70s and early 80s accurately, especially taking into consideration that it's depicting an area which is not usually depicted in movies (pornography production). It perfectly describes several issues that could arise from working with (or being in relation to) the field. The soundtrack is also carefully picked.",
            "review_date": "2022-03-18",
            "source": "rt"
        },
        {
            "content": "The film starts being a little disappointing, but quickly it takes off with a great direction from Paul Anderson, and with a really good story.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "game changing film.... amazing and brills",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "P.T. Anderson's Boogie Nights would appear to be the counter argument to William Blakes sentiment that \"the road of excess leads to the palace of wisdom.\"  The multitude of characters in the film, all fueled by sex and drugs and disco music, thrive in their hedonistic pursuit of pleasure while engaged in the Hollywood porn industry in the late 1970s, only to crash to earth as their addictions and greed take hold of their lives as the decade turns.  Great performances from an impressive cast, a fantastic script, and brilliant direction from Anderson (check out the remarkable opening shot) make the film, despite its length, impossible to turn away from.  It's daring, brave, insanely stylish, insightful and, perhaps most importantly, wildly entertaining.",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "This is such a weird movie. I liked many things about it, although I think that sort of happy-hollywoodish contaminated ending screws it up. I'd still recommend it though. It's a cool movie for sure.",
            "review_date": "2021-08-31",
            "source": "rt"
        },
        {
            "content": "I have trouble seeing the \"masterpiece\" quality in Paul Thomas Anderson's works, I just find them \"good\" usually.",
            "review_date": "2021-08-29",
            "source": "rt"
        },
        {
            "content": "Another great movie that features a song by Melanie \"Brand New Key\" which is a very sexual song if you look deep enough!!!!",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "This movie was absolutely fantastic and it's easily Mark Wahlbergs best performance.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "Well, this has gotta be one of the most cringiest movies I've ever seen in my entire life.. However,  Marky Mark Wahlberg is one of the most sexiest men on the entire planet. He's also one of my favorite actors, so I bite my tongue while my brain overloads by trying to fathom the immense amount of cringe through the entire film. I mean,, well, he was pretty young at the time… (Now he's Mr. Big Dick Energy Badass Sexypants! X'D) Also, I think it's absolutely hilarious that he keeps that prosthetic shlong as a souvenir to this day.",
            "review_date": "2021-08-19",
            "source": "rt"
        },
        {
            "content": "people that don't like pta films are probably the same people that loves the fast and furious movies, ",
            "review_date": "2021-08-17",
            "source": "rt"
        },
        {
            "content": "Beyond Awful. Beyond comprehension that anyone gives this a 93% or 89%. In what universe?",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "The absolute best movies either glue me to the screen or open my mouth wide open. This movie did both. The first half is a good build up but the real gasp of everything comes in the second half. Really I just think everyone should watch this movie.",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "don't remember if saw this in the theater or rented at Blockbuster back when. probably the latter. even so, i did remember most all of it, and it was an error to wait all this time to give a second watch. that's how good this movie is. Bravo.",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "This film features some really bold acting choices. Many of the characters, as written, behave poorly, act out badly, and display their baser aspects with out a care. The actors behind these portrayals do so boldly and without flinching. A tragic, cautionary tale, this is a film that should be seen by every lackluster student in high school. Yes, life offers shortcuts. The shortcuts work, but only just often enough to attract the naive and lazy -- rather like casinos -- into believing in them. \nIt is also a tale of compromising in the face of realities and finding what feeds your true passion. Dreams are no substitute for a solid plan. Luck, like lightening, strikes rarely and unpredictably.\nIn the background was one of the better retrospective soundtracks -- and faithful to the years in which the story is set. \nAside from its uses as a warning, it is also, in part, just fun to watch.",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "Love, love, love this beautiful film! This is one of the greatest films of the 1990s. Pure art!",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "A terrific look at the adult film world. ",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "جسورانه، سرگرم کننده و متفاوت",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "77%. Movie has a phenomenal soundtrack. Love the 70s era it takes place in. Great cast also. John C Reilly is awesome in it. Not high on the rewatch list but it's kinda funny and it's an entertaining plot. Probably came across better when it came out",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "it's got a great soundtrack & a great cast, but other than that i'm not sure why people like this film as much as they do. nothing special happens & it's about twice as long as it really needs to be.",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made. It could not be better.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "By the end of the movie after all the sex, drugs and general debauchery, it took me by surprise to realize the movie was really about family. And then that pleasant feeling was immediately ruined by Marky Marks's junk.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "Couldn’t make a better film. ",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "Raccontare un ambiente come quello del cinema pornografico è molto complesso, farlo negli anni '90, con i limiti della tecnologia e delle restrizioni molto più stringenti sui contenuti, è un'impresa titanica.\nAccurato, divertente e veritiero, Boogie Nights è un ottimo prodotto; onestamente nella seconda parte si prolunga leggermente troppo la fase discendente del protagonista Dirk Diggler.",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "A very well shot film that captures the tone of the time period very well. There were also some very good performances. It wasn’t a home run but it was a solid film worth a watch",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "Boogie nights is a great movie. It's star studied cast includes, Mark Wahlberg as Dirk diggler ,the man with a monster penis,  and when I say MONSTER, I really do mean A MONSTER PENIS. Alongside giganticock is leading lady Heather Graham. And let me Tell you folks she is stunning,  and you even get to see her amazing body with a full frontal nudity shot right at the beginning. Truly something I would have given both my pinkies to see as a child. Rounding out the cast is the all-time great actor Burt Reynolds playing director Jack Warner with his sexy wife xxxxxxxxx played by the lovely red headed Julianne Moore. To sum everything up, Boogie Nights is a fun ,sexy ,and very entertaining movie. And the only reason I didn't give it five stars is I'm jealous of Mark wahlberg's amazingly large penis lol. So sit back, grab a bowl of popcorn, and your favorite worn-out sock, and enjoy the show 😜",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "Wild and entertaining movie.",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "Fun watch. Mark was great and convincing.",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "\"Boogie Nights\" is by far Mark Wahlberg's best performance ever. Who would've not wanted to be an adult movie star? Didn't anyone want to get even a slight sneak peek  inside their lives? I know for sure many teens really wished to know how they live, as much as they wanted to see a movie about it. \"Boogie Nights\" starts off more of as a feel-good Saturday night movie for a one-time watch with your girlfriend or boyfriend, but, once it gets to the middle, everything literally changes. At some point you don't understand what's going on because of the amount of events that is happening, but once you finally start getting what's happening, you start feeling worried. You start to get the feeling of a person's life literally going from highest highs to lowest lows in just a matter of minutes. I adore this film a great much, because of how many controversial topics and problems it raises, which are still actual up to this day. Juliana Moore also looks stunning in the movie, as you get to live through her short, but really memorable role. Every single song that plays fits the theme well, every single side character is amazing in his or her own ways, as there was not a single moment, where I cringed from someone's performance. The dialogue is what makes this movie tense and what turns it into a drama-thriller and the ending is something that leaves you really shocked, but you will only get it once you will watch the movie, you'll see what I am talking about.  The setting is very well picked: every single party feels like an actual party, every single \"film\" made feels like if it is actually being filmed. This movie just takes the idea of a life of adult movie star's life falling down and just takes everything it can out of it. This is a real must watch, but of course, if you are mature enough. A lot of scenes require somewhat preparation, as it is not an easy movie to watch. \nStrong 9/10, the best ever Mark Wahlberg's role and a breath taking plot.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "Six bags, some naked people, some cameras, a couple nosebleed ODs, and one special thing. There are a lot of great actors in this movie who are old today so its fun to see them so young in their careers, back in the 70's. I can't remember them all but you got Don Cheadle, Marky Mark, John C. Reilly, Willam H Macy, Heather Graham, Burt Reynolds, Julianne Moore, and Mark Wahlburg (and Julianne more ON Mark Wahlburg). In that scene where Clarice and Marky Mark do it the first time, she was sure feeling those \"good vibrations.\" It was really cool and surprising how they set up the 2004 Punisher movie and Spiderman 2 because you see the Punisher (again played by Tom Jane) undercover and trying to bust Doc Ock, who is in his crazy college days as a maniacal coke dealer. Also, it is cool that Marky Mark and Dr. Steve Brule could both be in a movie WITHOUT Will Ferrel, 'cause back then, he was just a guy on SNL and not a movie star. He's also not much of a star now, if you have read my reviews of Eurovision and Downhill, they fucking sucked. Heather Gram was looking mighty cute as Roller Girl, but I do wonder if she ever took her skates off for a shower / wash / powdering. It could get kinda nasty if she never takes them off, and it's dangerous if you're skating around the pool or a BBQ or in the kitchen. Safety first, but this was the 70s, so you don't see a lot of safe sex in the movie. Especially the first time Clarice and Marky Mark do it. So suspend your disbelief for these small fantastical touches since they heighten the drama and give more character to the film. This one's for the ladies because you see Marky Mark at his prime and hanging dong. He's not always on top as Dirk Diggler though, and its this journey of highs and lows, set against the immersive retro backdrops that take you back in time and to the gentle heart that makes this film such a winner. The real message about movies whether they're pornos or Disneys is that they don't make 'em like they used 2!!!",
            "review_date": "2020-10-08",
            "source": "rt"
        },
        {
            "content": "Great fantastic phenomenal crazy movie starring Marky Mark, burt Reynolds, John c Riley, Heather Graham, Philip Seymour Hoffman, Julianne Moore, and a lot of other great actors. This movie is crazy, it has everything a rated r movie should have. I enjoyed pretty much every second of this film especially when Marky Mark is on. He steals the show and I can't wait to watch this movie again. Great casting and fantastic acting. I feel every characters emotion and I need that more in movies.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "For almost the entirety of its runtime, \"Boogie Nights\" is captivating and exhilarating. This movie just grabbed me from the getgo and kept my interest the whole way through. It creates a world that isn't always the cleanest but is constantly intriguing. A big part of this movie that really works is the characters. Pretty much every actor in this movie gives an exceptional performance. The movie hits many emotional notes and its a rollercoaster getting to the insane finale. Overall, this is one of those movies that doesn't feel long despite being over two and a half hours and genuinely had me invested in the characters and storyline.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Bringing the classic rise and fall storyline to a wonderfully vibrant and unvarnished vintage pornography industry setting, Boogie Nights opts for engrossing character development and long, single shots to keep viewers engaged consistently. With Reynolds, Moore, Wahlberg, Reilly, and Cheadle each providing wonderful acting quality, and even smaller roles filled up with some legitimately top-tier supporting cast members in Macy and Hoffman. The storytelling is of such quality that the film can wander in and out of subplots with ease, completely independent of the time previously ascribed to them (Cheadle in particular seems almost separate from the remainder of the film on the whole, but it doesn't necessarily seem out of place). The narrative twists and familiarity with violence seem to bring Tarantino to mind; the cinematography and score are both top-notch. But sewing it all together with such a commercial and unvarnished look at sex is where the real innovation and shock lies. (4.5/5)",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "Having not seen this in quite awhile, it's strange seeing this in 2020 where marijuana is now legal, cigarettes are deader than dead, internet porn is at it's apex, and a pandemic is sweeping the world and shutting down much of the sex industry.  When all else fails... the soundtrack keeps this up and rollin'.  Without the soundtrack, and almost 35 years later, this movie still has a lot of character and a style all it's own.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "Reminds me of a Tarantino movie. Many ridiculously comical senses. Absolutely awesome cast.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Awesome movie!\nBoogie Nights is my favorite Paul Thomas Anderson's movie. Is very original and the Scorsese tribute is wonderful, and the actors performances too. Absolutely robbed at the Oscars! 8.9/10",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "I had absolutely no idea Mark Whalberg could actually act before seeing this. He's actually superb and the cast generally are outstanding. It's a brilliant film with so many stand out characters. We would all set our morals to one side for Rollergirl. Cheadle's character is gold but actually everyone is loveable. A top film with a stand out cast all on top form.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "A competent meditation on the porn industry containing good performances and a consistent pace.  I found the 2nd half of the movie which highlighted the downfall of these people's lives far more engrossing than the 1st half.  It successfully addresses the futility of this lifestyle (sex, lust, drugs) and how it affects those involved after they leave it; some have to return because it's all they're good at.  I was also appreciative of the minor details such as the fact that many \"celebrities\" in this industry come from broken homes and/or dysfunctional families.  Unfortunately the characters weren't that compelling for me as a whole.  I found Mark Wahlberg to be hit or miss, occasionally feeling miscast.  Nonetheless, 'Boogie Nights' is widely regarded as a classic but I wasn't blown away.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "Very good, even in 2020. I will say I deducted half a star because towards the end the scenes were drawn out and extended for no reason. They could've cut out 20-30 minutes of the movie.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "A masterpiece. One of those movies you can't stop watching -- and can watch over and over.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "There wasn't much interesting going on if you don't count the nudity.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "Director Paul Thomas Anderson makes something interesting out of a lot of ingredients. The screenplay is fertile with good storytelling potential and the superb cast is up to the challenge.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "This movie brings back the days when I was 20 years old.Great flick to to lots of bong hits and drugs.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "A mostly realistic look at the porn industry during the 1970's, which on the surface looks exciting while just underneath lies true ugliness. Fantastic turns by the cast, including Mark Wahlberg, Julianne Moore, and Burt Reynolds. Flashy, gaudy,.. perfect.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "This is a V E R Y large cock. 10/10!",
            "review_date": "2020-05-31",
            "source": "rt"
        },
        {
            "content": "Like everything I've seen so far from Anderson, this feels more like a character study, but thanks to the outstanding screenwriting, the character is a whole industry and the study remains detailed and really well-done. It could've been a lot shorter, though.",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "Both a love letter, a critique and a satire of the porn industry, it's a groundbreaking film because of its bold screenplay, strong direction and outstanding performances from its ensemble cast, specially Mark Whalberg.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "An absolutely amazing film",
            "review_date": "2020-05-05",
            "source": "rt"
        },
        {
            "content": "A masterful look into the excesses of the 70s and beyond",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Very good film by director Paul Thomas Anderson. A must-see film for everyone in the world.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "The screenplay is lacking in genuine conflict most of the time, and Boogie Nights suffers for it; it's just not engaging enough.",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "Awesome movie! Has great writing and has a surprising amount of emotion, music is awesome too",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "I think that 3 stars is a good rating for this movie, 70's themed movie about people in the porn industry. Good cast and acting, story and plot great soundtrack, I would say this is a go to movie for me, give it a watch it's pretty good.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "P. T. Anderson never goes wrong.\nAnd Boogie Nights is probably one of my favourites from this director, though it is really hard to pick one (or even three).\nThis tale, painted with such crisp colours by the actors, tells of broken people, of the rise and fall of those who followed a dream thinking it would never end, of the bigotry of society and how easily it judges a world they're uncomfortable with.\nA punch in the guts. A masterpiece.",
            "review_date": "2019-10-03",
            "source": "rt"
        },
        {
            "content": "A quirky story of a group of misfits in a strange business to most of us who are far more commonplace, but they form their own sort of family and seem happiest when they are all together in the only world where they fit in.Very well acted with an excellent cast.",
            "review_date": "2019-08-30",
            "source": "rt"
        },
        {
            "content": "A very well made look into the porn industry in it's golden era that's not only a fun and hilarious watch, but it's a well made character piece and very, very frank and to a point disturbing in some places. Mark Whalburg shines here as Eddie \"Dirk Digler,\" Adams a dropout who lives in a shitty home with an abusive mom. He has no brain or any normal aspirations but against all odds he meets a top porn producer and finds his way into the porn industry where becomes the top dog. Along the way he bangs a lot of women and wins a ton of awards but also gets addicted to coke and his life comes falling appart. \n\nWhat makes this unique is the effort in giving the side characthers their own arcs. Burt Reynolds gives the best performance of his career as the porn producer in which he got an Oscar nom, he's really really good in this and def earned it. You also get great performances from Julliane Moore and Heather Graham as the porn babes, and you have William H Macy, Don Cheadle, and Phillip Seymour Hoffman as the tech guys who have their time to shine. Macy has a lot of heavy dramatic scenes and does excellent. Cheadle has a lot in the 2nd half and ends up the most likeable character in the piece.\n\nThe third act's really really out there but it ends a fun ride.  As a time period film it demonstrates it well but there were a few missed opportunities character arc wise that just made it a little from perfect for me. Still a very solid film none the less.",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "Long before Paul Thomas Anderson explored human psychology, this film had long existed. Two and a half hours has never been tiring and Anderson managed to make everything unique. Conflicts, characters, sets, all are very detailed. A satire comedy in the form of a depressive drama or melancholia, \"Boogie Nights\" provides a very impressive, total viewing experience in exploring its theme. And of course, the last moment before credit, at least you can see how big Walhberg's penis was. Just God, is that real? I'm just speechless about that.",
            "review_date": "2019-07-27",
            "source": "rt"
        },
        {
            "content": "One of Mark Wahlberg's best films!",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "Some very cool aspects to it.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "Great movie, acting, casting are all top notch.",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "Didn't quite know what to expect from this movie. I guess it captures the 70s-80s-atmosphere quite well for a movie that was made in the mid 90s. But it falls short in many ways: scenario, rhythm, 70s style...",
            "review_date": "2018-12-28",
            "source": "rt"
        },
        {
            "content": "Boogie Nights: Simple yet a bit subtle, this second major debut from Paul Thomas Anderson is a lesser version of Eyes Wide Shut with with a mix of Goodfellas and Scarface, one less thought provoking and philosphical.",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is the work of an auteur. It is hard to imagine a 27 year old making this ensemble cast into an excellent flowing drama set in the pornographic industry of California. But then that kid is Paul Thomas Anderson- one of our current masters of cinema, it shouldn't be surprising. Mark Whalberg doesn't play too far from his real self in my opinion but it works for him. Ably supported by the likes of William H Macy, Phillip Seymour Hoffman, Heather Graham and many more who would become Paul Thomas Anderson regulars Boogie Nights is a movie not to be missed.",
            "review_date": "2018-10-22",
            "source": "rt"
        },
        {
            "content": "Despite sometimes feeling imitative of Tarantino and Scorsese, P.T. Anderson delivers a robust work of complex storytelling set in the 1970s porn industry while also being completely self-aware-revealing the nihilism of its times and the narcissism of its protagonist-and never failing to entertain thanks to its acute sense of humor, smart script, excellent cinematography, and great performances.",
            "review_date": "2018-10-06",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is a film with impeccable casting a lovey score and an enjoyably frantic final half hour.  It's is a film that will be adored by cinephiles for its exuberant approach to its off kilter topic.",
            "review_date": "2018-09-29",
            "source": "rt"
        },
        {
            "content": "Great fantastic phenomenal crazy movie starring Marky Mark, burt Reynolds, John c Riley, Heather Graham, Philip Seymour Hoffman, Julianne Moore, and a lot of other great actors. This movie is crazy, it has everything a rated r movie should have. I enjoyed pretty much every second of this film especially when Marky Mark is on. He steals the show and I can't wait to watch this movie again. Great casting and fantastic acting. I feel every characters emotion and I need that more in movies.",
            "review_date": "2018-09-16",
            "source": "rt"
        },
        {
            "content": "It's horrible and boring.",
            "review_date": "2018-09-08",
            "source": "rt"
        },
        {
            "content": "Boasting phenomenal performances from a cavalcade of celebrities like Burt Reynolds, Julianne Moore, and Mark Wahlberg, 'Boogie Nights' takes on bold themes with nonjudgemental ambition as well as explores the deep, emotional state of its characters.",
            "review_date": "2018-09-08",
            "source": "rt"
        },
        {
            "content": "P.T. Anderson's breakthrough movie is a funny, dark, and surprisingly sometimes emotional movie with great acting and a well-written story and good camerawork by Anderson.",
            "review_date": "2018-09-07",
            "source": "rt"
        },
        {
            "content": "Not since Robert Altman's 'Nashville' has a film felt so epic and intimate at the same time.  Anderson deftly balances humor, tragedy and comedy (sometimes all in the same scene) and gives each character a shining moment.  Familiar themes of familial bonds and loss of innocence   are given new life with Anderson's superb direction and approach.",
            "review_date": "2018-08-28",
            "source": "rt"
        },
        {
            "content": "Everything about this movie is perfect. The tone, cast, story, cinematography, the messages, and the music. A surreal, over-the-top, opulent film, with some of the best characters and acting to ever be on screen.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is a 1997 American drama film written, produced and directed by Paul Thomas Anderson. \n1001",
            "review_date": "2018-06-21",
            "source": "rt"
        },
        {
            "content": "One of my top 5 films of all time. Why? Start with the soundtrack. Then add crazy characters, and an up and down storyline. It’s happy, then sad, then happy, but it works. Script writing is flawless. ",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "Way better then (most) porn.",
            "review_date": "2018-05-14",
            "source": "rt"
        },
        {
            "content": "PTA skillfully strips away the glamour to reveal the sordid side of pornography, but takes too long glorifying it to make his reveal effect.",
            "review_date": "2018-05-14",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time. P.T.A. is a master in storytelling, and this movie is the perfect proof of that",
            "review_date": "2018-04-25",
            "source": "rt"
        },
        {
            "content": "we've all done bad things..\n\nBoogie Nights\n\nThe adrenaline rush never wears down even though the feature fluctuates a lot through this more than 150 minutes of journey and this is where it stands alone; the sheer sharp and cunning script of it. Paul Thomas Anderson has its name written all over the frame that is perfectly balanced on this character and plot driven feature where if not for his execution, it would have been difficult to pull off such a powerful script. Mark Wahlberg is brilliant in his portrayal and is supported well enough by a great cast like Julianne Moore, William H. Macy and Heather Graham. Boogie Nights not only has enough content to feed the audience but is celebrated with a great conviction with the help of stellar performances, amazing background score and explicit editing and execution.",
            "review_date": "2018-04-16",
            "source": "rt"
        },
        {
            "content": "Strengths: Paul Thomas Anderson mostly did a masterful job directing this film. He captures the right things to make these characters work in their settings. He also got the best out of his actors, because some talented people give some of their top performances ever. Mark Wahlberg (Eddie/Dirk) is strong, while Burt Reynolds (Jack Horner) and Julianne Moore (Maggie/Amber) seem to steal the show. John C. Reilly (Reed) is really funny, while Heather Graham (Brandy/Rollergirl) is possibly at her best. The soundtrack is extremely fitting. I also must commend all the behind the scenes people, as the sets and costumes are easily some of the best things about this movie. Don Cheadle (Buck) was also quite good, as were Phillip Seymour Hoffman (Scotty J.) and William H. Macy (Bill). Lastly, it's quite interesting to see the toll the porn industry takes on the lives of the people involved.\n\nWeaknesses: It's egregiously long. There's no need for this movie to go for two and a half hours. You really feel it as it nears the third act. While the story is good, I don't think it ever quite touches great territory. There are several side plots that feel like they're a bit extra. I understand what the Bill storyline was meant to showcase, but it wasn't needed. Even Buck, who was a fun character, felt off to the side a bit. As good as Anderson was as the director, a few of his shot choices were odd. There were moments when the camera lingered on seemingly unimportant things. Also, while all the characters were fully developed, I didn't feel a need to root for many of them in most situations.\n\nOverall: People hold this movie in very high esteem. It's good, but I wouldn't consider it a classic or anything like that. The running time is a real problem, damaging the overall enjoyment of this film. If it was closer to two hours, it would've worked better.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Its runtime goes longer than it should, but Anderson's Altman-esque look at the selling of sex and the people who work in the industry is a poignant and often funny pleasure. The production and costume design of the 70's is superb and the acting is masterful. Anderson's empathetic view of people struggling for meaning and success in a dark industry is beautifully handled.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "its interesting movie",
            "review_date": "2018-03-22",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.0\n\nUna historia de redención y con un gran reparto que hacen de Boogie Nights un memorable film sobre la persecución de los sueños.",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "Still Mark Whalberg's best movie this film is both funny and touching. The strong cast helps out a lot but this is a classic that is just a little bit too long.\nStill a memorable film.",
            "review_date": "2018-03-15",
            "source": "rt"
        },
        {
            "content": "****\nPaul Thomas Anderson is a director I have a lot of respect for. I've kind of watched his career backwards, starting from Inherent Vice and, whilst I haven't quite seen all his work, I have to say his earlier stuff appeals to me more. Whilst 'Magnolia' is undoubtedly his masterpiece; one which I doubt he'll ever beat, movies like 'Boogie Nights' show him in his unrefined, yet most daring stage. Although this movie is way too long, and feels rather messy in its construction, it also demonstrates some of Anderson's most experimental work. The fluid camera movements, the excellent soundtrack, all backed up with some fantastic performances meant this was one hell of an entertaining ride. You feel the length (no pun intended), and it sometimes feels a little meandering in its plotting, but at the same time it manages to sweep you up into the chaos of this world. This is an endlessly enjoyable ride, and it's all the more fascinating when you compare this Anderson to the Anderson of today.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "Hard to believe that Anderson did such a fantastic movie at such a youn age. I really love everything about this movie, maybe Mark could have been better but it is not bad. A great stroy about yotuh, broken pleople and unconventional bonds between them that can even be describe as a family. Every single character is a whole world and Paul T Anderson knows how to develop each one so deeply and in a wonderful way. Also the soundtrack is just amazing. Every single PTA movie is just a masterpiece and very well done in evey sense, it is one of those directors that cnnot do wrong and all of his movies are just right",
            "review_date": "2018-03-03",
            "source": "rt"
        },
        {
            "content": "Dopo due intense visioni posso dire di aver trovato il capolavoro che stavo aspettando da P.T. Anderson, un regista che come secondo film dimostra di avere un talento incredibile. Il tema può lasciare spiazzati in un primo momento, ma se ci si lascia trasportare da tutta la perfetta ambientazione in stile anni '70-'80, dal cast stellare, da una sceneggiatura cruda e divertente e da una regia mozzafiato, allora ci si rende subito conto che è un'esperienza che va ben oltre le aspettative, che va ben oltre il tema esplicito e volgare che tratta. La storia coinvolge fin da subito grazie ad una narrazione che ha ritmo e non presenta punti morti. I numerosi personaggi secondari sono interessantissimi e cooperano con un gran protagonista, forse il miglior personaggio interpretato da Mark Wahlberg. La regia di Anderson è il tocco finale che eleva il film a livelli altissimi, con piani sequenza incredibili uniti a musiche caratteristiche e coinvolgenti e grazie anche ad alcune scene fanno riflettere e rimangono impresse nella mente anche a film finito. Nel complesso si tratta di un film completo, che presenta tutto ciò che si può chiedere da un'esperienza cinematografica, un grande capolavoro che merita di essere ricordato come uno dei migliori film degli anni '90.",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "In a rare instance, P.T. Anderson casts a net so wide, he can't properly contain or resolve the contents within; despite energy and panache oozing from the film's pores.",
            "review_date": "2018-01-05",
            "source": "rt"
        },
        {
            "content": "For a movie about the porn industry, there's too many gun shootings and not enough porn",
            "review_date": "2017-12-23",
            "source": "rt"
        },
        {
            "content": "My favorite movie (sorry Shawshank, we had a good run), Boogie Nights tells the story of Eddie from Torrance as he goes from a high school drop-out washing dishes in Reseda to an adult film superstar overnight when he and his big, bright shining star are incidentally discovered at work. \n\nSet against the backdrop of the porn industry in the San Fernando Valley, it neither glorifies nor demonizes the industry and it embodies America itself as it moved from the carefree hedonism and decadence of the late 1970s (which symbolically end here with a literal bang) to the ensuing consequences and malaise of the early 1980s.\n\nWe follow Eddie (aka Dirk Diggler) as he struggles with handling his new found fame & finding acceptance and a sense of family that he never got at home. We experience his highs & lows as well as that of everyone else as they struggle with their personal relationships, drug use and their place in a changing industry as the \"art-form\" essentially goes from classical music to dubstep.\n\nFeaturing a deep ensemble of characters that are all complex and well-developed, Boogie Nights weaves multiple story arcs seamlessly and uses contemporary music from the era to perfectly set the tone for each scene. As Eddie says in the beginning, \"Everyone's blessed with one special thing\", but this movie has everything going for it. Five stars only because there isn't a sixth star and I would give at least 4 stars to the Brock Landers/Chest Rockwell movies within the movie as well.",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "Interesting film that slipped under the radar on its release in 1997.\nThe premise seems rather unfashionable. The late 1970s adult entertainment industry.\nThe main star is Mark Wahlberg who begins the film in 1977 as teenager Eddie Adams. His life is literally a car crash. Further education is really not his forte rather fornication is!\nNo what I mean is he becomes adult entertainment star Dirk Diggler. Under the direction of Jack Horner (Burt Reynolds) he becomes a top porn star.\nThe film isn't a porn fest rather it shoes the rapid rise of Diggler and the equally rapid fall due to drug misuse and age as the film focuses on the 1980s.\nFeaturing an excellent soundtrack of my childhood including the likes of 99 Red Balloons!\nThe cast is quite good including the already mentioned Wahlberg and Reynolds. Julianne Moore, the late Philip Seymour Hoffman and William H. Macy who suffers a shocking end to the 1970s.\nDirected by young filmmaker Paul Thomas Anderson the 155 minute runtime is enjoyable.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "Brimming with energy, fantastic characters and a strong, heartfelt story that discusses a genre of film that isn't talked about, Boogie Nights is a masterpiece.\n\n5/5 stars",
            "review_date": "2017-11-21",
            "source": "rt"
        },
        {
            "content": "8,5/10\n\nNot since Scorsese' Goodfellas have the exhilaration of success and uncontrolable madness of defeat been captured this vividly in cinema.",
            "review_date": "2017-11-05",
            "source": "rt"
        },
        {
            "content": "One of the best PTA movies.",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "There isn't a single bad performance in this movie. There isn't a single major narrative flaw in this movie. So why not 5 stars instead of 4 1/2? Because the porno scene is so uncomfortable and difficult to watch that it somewhat brings the rest of the movie down. However, this is the original work of an auteur by the name of PT Anderson and he's had a 20 year hot streak since this gem.",
            "review_date": "2017-10-05",
            "source": "rt"
        },
        {
            "content": "Boogie Night is about finding your family with porn industry as a theme.",
            "review_date": "2017-09-16",
            "source": "rt"
        },
        {
            "content": "As much ink was spilled (or something other than ink, hehehe) over Burt Reynolds' work, this was really Mark Wahlberg's iconic performance. PT Anderson elevated what could have been B-movie sleaze to pop art and tragedy. Amazing.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "I wish six stars was and option.",
            "review_date": "2017-08-22",
            "source": "rt"
        },
        {
            "content": "Funny and entertaining but too long.",
            "review_date": "2017-08-04",
            "source": "rt"
        },
        {
            "content": "#1 best movie ever made, no flaws perfect story of fame and deception",
            "review_date": "2017-07-29",
            "source": "rt"
        },
        {
            "content": "Im usually not a fan of erotic porno films but there are two exceptions, one is Stanley Kubrick's Eyes Wide Shut, the other is Paul Thomas Anderson's Boogie Nights.",
            "review_date": "2017-07-08",
            "source": "rt"
        },
        {
            "content": "A film made up of an ensemble of incredibly stupid characters, that all manage to captivate, and present themselves as (somehow) endearing. I've seen \"Boogie Nights\" listed under every genre imaginable on various different websites and store shelves. To me it's always been a very dark and intense comedy, but I can see how it works as a straight-up drama for some people. It manages to cover a lot of different moods and tones without feeling scattered, and the soundtrack feels intoxicatingly upbeat. The story is phenomenal, and P. T Anderson's imagination seems to have been non-stop when it came to the events and situations the characters find themselves in. But, as with most of the writer/director's films, the characters are the biggest source of intrigue here. As I mentioned before, they're all really dumb. Some more than others, but they're all quite dumb. But they're also passionate and have an obvious desire to love someone or something, and it makes them sympathetic and engaging to watch on screen. The performances here are nothing short of fantastic. The film also portrays the passages of the decade or so it takes place over with an extreme attention to detail. It's very believable, and incredibly atmospheric. It's not hard to understand why \"Boogie Nights\" is a classic. It's an absolute masterpiece.",
            "review_date": "2017-06-14",
            "source": "rt"
        },
        {
            "content": "Thoroughly entertaining, and probably Paul Thomas Anderson's most accessible film for mainstream audiences. Highly recommend starting here if you haven't seen PTA's body of work.",
            "review_date": "2017-05-11",
            "source": "rt"
        },
        {
            "content": "The story-telling is quite attractive.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "For more than an hour we are seduced by glitz, glamour, dance, joy, fun, games, music - it's a trip.  The second hour is arguably another genre, radically turning on us as the consequences of falling from a peak are met.\r\n\r\nMark Wahlberg is sensational; incredibly focused, vivid in his portrayal, consistent to the attitudes of the story, but always entertaining.  He gives the fight with his mom a comical twist that could hardly be given any direction beyond what the performance must intuitively know in order to get that idea across; he's determinedly present.  In the faux coke-dealing scene at Rahad's (Alfred Molina), there's this hopeless gaze that comes over his face as he realizes the impasse of his circumstance, which we all feel as an audience; the situation is absurd, and the odds of escape don't look good.  Look at his eyes, they numb over, each moving off in different directions - I'd imagine that could only happen to a person caught in such a situation in real life, but to act this seems impossible.  He also develops a strong independent activity in the form of a few karate moves that thread him through key points of the picture, including a hilarious award ceremony, and a brilliant homage to Raging Bull's ending in front of the mirror.  Watching Eddie develop as Dirk Diggler, one gets the sense that as we are all truly born to do something in life, most definitely Eddie is a pornographic godsend.\r\n\r\nI love that this giant 13\" protrusion in Dirk's pants is left to the imagination until the very end of the picture.  My compliments to the whole third act finale, which neatly tied up everyone's story in a way that so many films frustratingly leave unresolved.  It's really perfect, and a nice little comeback from some pretty awful circumstances.  It makes the film less judgmental, that we could get behind these characters and actually see them end up okay, a nice little family.\r\n\r\nAnderson's staging is amongst the best in the history of the craft, with long camera moves, but no wasted space between tracking/dolly moves, quickly picking up the action of the next set of characters, getting into their vibe, their story, and getting a sense of how interconnected everybody is.\r\n\r\nWhat an amazing cast all around.  Don Cheadle as Buck Swope achieves a total presence through the relation of his various appearances, the 80s New Years party Rick James look being my favorite.  This is when everything is budding for changes, including Buck and the girl who will eventually be by his side - they are losing interest in this business and want to do something more legitimate.  A new mustached character is introduced, one who will lead Dirk and Reed down a dark, godforsaken path.  And then there's the culmination of Little Bill's (William H Macy) crisis with his cuckolding wife, which perfectly transitions us into the next phase of the film.",
            "review_date": "2017-03-28",
            "source": "rt"
        },
        {
            "content": "Really captures the feel, and the look of the 70's. I also love how PT Anderson doesn't preach about how drugs are bad. Or how sex is bad. He just tells a story. One of my all time favorite movies.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Classic 90's movie. Mark Walhberg is great as Diggler",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "An unsettling film about what goes on in the pornography industry. Wahlberg plays a young rising star in the industry trying to make a living in this dark world. It's a little overrated, aside from an interesting subject, the film itself has very little to offer.",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "a brilliant movie funny and dramatic",
            "review_date": "2017-02-24",
            "source": "rt"
        },
        {
            "content": "5 out of 5 stars! This was a really great film! My kind of film! A really powerful, harrowing, yet fun, original and interesting tale. I wish I had seen it sooner, but I'm so happy I finally got around to it! I really like stories that focus on the 70s as it seemed like such an interesting, exciting, and transitional time period for the world, music, film, and the culture at large. This conveyed a lot of that very well.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "I don't know why I've put off seeing this for so long, it's absolutely awesome.  The pacing of this movie makes the 2:30 run time feel short and in the end I was ready to keep watching more.  From super fun and light-hearted to dark and extremely tense this movie runs the gamut of emotion.",
            "review_date": "2017-01-26",
            "source": "rt"
        },
        {
            "content": "Loved this as a kid. Very entertaining with a great cast.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "Leave it to Paul Thomas Anderson to make a movie about the porn industry into a funny, dark, effecting drama.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "Favorite Mark Wahlberg movie (except Lone Survivor).",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "With a solid plot, skillful cinematography, a great soundtrack, three dimensional characters and the committed efforts of a talented cast, Boogie Nights is a 90s masterpiece.",
            "review_date": "2017-01-09",
            "source": "rt"
        },
        {
            "content": "The film does a good job in humanizing people who are usually demonized or objectified.",
            "review_date": "2016-11-30",
            "source": "rt"
        },
        {
            "content": "The Porno industry, following big-willie Wahlberg into an adventure of making movies with passion. Reynolds is very great, with great charisma leading a scene with a vision, though no talent. Success turns to cocaine, cocaine turns to the fall.",
            "review_date": "2016-11-16",
            "source": "rt"
        },
        {
            "content": "Energising and brilliantly shot. Boogie Night's performances and writing makes this a memorable late night classic.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "It's a bit long, but Boogie Nights does a good job of portraying an admittedly familiar tale of the rise and fall of those rapidly achieving great success with little guidance, all while tackling an interesting and not often portrayed subject.",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is definitely a niche film. You need to have an understanding of what you are getting into when you begin. Yes, this movie takes place in the 70's and 80's and yes, it is about the porn industry. I really enjoyed how characters were woven into the story and expanded upon. I most definitely plan on re-watching this in the future.",
            "review_date": "2016-08-15",
            "source": "rt"
        },
        {
            "content": "Very interesting look into the late 1970s and early 1980s pornography industry. The drugs and sex are very much a part of this film. Mark Wahlberg, Julianne Moore, and Burt Reynolds are all excellent in this film. The script is very well written and gives us a very clear trajectory for Dirk Diggler (Wahlberg) throughout the film that ends very appropriately.",
            "review_date": "2016-06-22",
            "source": "rt"
        },
        {
            "content": "Boogie Nights plays well with our juices and imagination till the last second when it appears to reveal its big deal but it is nothing close to our big imagination.",
            "review_date": "2016-05-26",
            "source": "rt"
        },
        {
            "content": "Fantastic performances all around, and Paul Thomas Anderson's direction is flawless. The film paints a vivid and complex picture of the adult film industry in the '70s, and it takes the subject matter seriously and masterfully. The only downside is that the movie is a little too busy at times and could've done without a few of the characters and their subplots.",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "A feature laced with excellent performances from its outstanding ensemble cast, Paul Thomas Anderson's fully realized vision of the porn industry is realistic to the point of disbelief and thoroughly rewarding for those who can last the lead character's tough journey.",
            "review_date": "2016-04-17",
            "source": "rt"
        },
        {
            "content": "Filled with great performances from all the actors and directed brilliantly this film looks at the porn industry and what happens after the cameras are off great film 4/5",
            "review_date": "2016-04-16",
            "source": "rt"
        },
        {
            "content": "Insightful, fun, and emotional. Boogie Nights give the viewer a peak behind the curtain of a taboo business that informs, entertains, and follows diverse and well-written characters that are an absolute blast to watch. Boogie Nights is \"PIMP!!!\"",
            "review_date": "2016-04-12",
            "source": "rt"
        },
        {
            "content": "A hugely-ambitious work that brings together a brilliant cast (okay, so Wahlberg may not always be brilliant but he really is here!) and beautifully intricate and convincing characters who all exist in the same vacuum of boobies and 70's 'staches. \n\nCertainly the closest that Paul Thomas Anderson ever came to really being similar to Tarantino and, whilst I'm glad that he went his own way, I must say that this one is right up there with the likes of Pulp Fiction when it comes to stories jam-packed with engaging characters and some action to boot.\n\nThere's a strong mix of comedy and drama, with neither ever being shoved in your face. Instead you are just kept constantly interested as you watch each character move through the motions, with Anderson kindly giving them all a shining moment in there somewhere. \n\nOf course, the downside to this kind of approach is that so much goes on over the course of two and a half hours that you may find yourself wishing that a little more had hit the cutting-room floor.\n\nStill, there aren't many serious films about the porn industry. There also aren't many films with Don Cheadle selling stereos whilst dressed as a cowboy (there's only this one, in fact). Most importantly though, there aren't many films that can string together so many unique and interesting characters, allow them to live within such an odd and niche world, and still leave you feeling like no-one was shortchanged- neither the characters, nor the viewer.",
            "review_date": "2016-03-29",
            "source": "rt"
        },
        {
            "content": "Yet another masterpiece from Paul Thomas Anderson.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "They almost got it right. Then, they completely. One of the biggest and wholly issues that I have with this film is the last half or less. Absolutely worthless and garbage and could have been thrown out. For lack of a better reasoning and to avoid spoiling, when the film shifts gears with the characters' focus in the '80s, the film goes completely downward. \n\nBasically, it gets really boring and includes a lot of pointless details that could have been removed which doesn't help the need for resuscitation of an already long film. Acting, excellent. Music, great. Character development, great. Acting choice, brilliant. The cast was nailed perfectly the film flows very nicely, pacing is great. The film is considered a comedy drama, but I barely noticed the comedy because the drama was so overwhelming. It's a very interesting and good film and is for the most part, highly recommend by me.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "One of the only good Wahlberg performances, and this one was by far the best. Extremely entertaining and packed with future stars, Boogie Nights is bold and brilliant.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "I better keep this short. Boogie Nights is a movie that is not for me. This gave me the same feeling I get when I watch a gangster movie. What I mean is, about 30 minutes in I start to ask myself questions like \"Am I supposed to care about these people??\" \"Why would I ever want to spend two and a half hours in their world??\" Others can go ahead and enjoy it, I am not programmed right to find this entertaining.",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "Whenever someone mentions this movie, I chuckle. Not because of the obvious nature of the film; but by how awesome it is.  It is a masterpiece.  The directing, music, script, and the superb cast make this movie what it is.  I can't help but feel that this movie is alive when watching it as it's been filmed at that very moment.  It makes me recall 'Pulp Fiction' when I first watched it.  I'm not that huge of a Mark Wahlberg fan but this movie proves he can act.  Burt Reynolds is amazing as the sleazy director.  Julianne Moore is sensational as the drug addicted mother; the Academy dropped the ball on not giving her the award that night.   My only complaint is the third act when the 1980's start and it kinda loses it's momentum but it's a small nitpick in a great film.  It's literally one of my favorite movies of all time.",
            "review_date": "2015-12-24",
            "source": "rt"
        },
        {
            "content": "Another one of my all-time favorite movies, \"Boogie Nights\" gives an emotional and sour reality behind the pornographic industry in the 70s and 80s. Paul Thomas Anderson uses clever camera and storytelling techniques that make it more interesting and easier to follow. In my opinion, this movie is one of the most underrated gems of the 90s, and it deserves more attention from general audiences.",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "At times indulgent, but I say that almost as praise. BOOGIE NIGHTS is another smashing ensemble feature by Paul Thomas Anderson, the film that put him on the map. Julianne Moore is just perfect. It's a dizzyingly original American classic, especially when the 80's starts off with a bang and everything becomes deliciously dark.",
            "review_date": "2015-11-29",
            "source": "rt"
        },
        {
            "content": "The second half was really well done",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "PTA's \"Boogie Nights\" is just a really good movie. It features (mostly) great performances from its fairly large cast and fantastic direction from one of the greatest living filmmakers and one of the greatest American filmmakers to ever live. The only downside to how it was directed, and a general problem with a lot of PTA's work, is that lengthy dialogue sequences aren't shot too dynamically. A lot of it is simply shot/reverse shot close-ups. Sometimes this works really well when you have a great actor and a great script (as is the case with Mr. Anderson's masterpiece There WIll Be Blood), and although the script was not bad by any means, it really lacked something that made listening to these people talk a bit trying at times. Perhaps it felt repetitive, I'd probably have to re-watch it to determine exactly why. I was really interested to see how Paul Thomas Anderson would tackle a subject like the 70's porn industry, but he's a man who can make anything fascinating. The movie is (mostly) rife with humor that pokes fun at its subject and is always entertaining. I'll admit my mind started to wander from the movie during the last half hour, although it wasn't dull in any way. This is a movie that has a large cast of characters, which can sometimes really hinder a movie, but PTA pulls it off so well (mostly with the brilliant opening shot of the movie). However, the greatest pitfall of this movie is none other than it's lead: Marky Mark. I know it is an unpopular opinion, but I think Mark Wahlberg just isn't a good actor. He just didn't convince me in this movie. I just see Mark Wahlberg in every movie he's in, he's never his character. However, everyone else is great. Once again, this is just a pretty damn good movie, but Mark should definitely have stuck to rap. He spit some pretty hot fire, yo.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "There are stories, and there are collections of interesting scenes. This movie is the latter. No amount of intriguing characters, great performances, or awesome direction can fix that.\n\nIt may be time for me to admit to myself I plain don't like Paul Thomas Anderson's writing.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Funniest movie ever.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "with its quirky characters funny script and fantastic performances from its assembled cast, particularly from Walhberg in his breakout role, boogie nights is a must see for people who like odd movies",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is a informative and interesting story that will keep you engaged all the way through with it's all star cast, slick direction and Mark Wahlberg's performance",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "I enjoyed the 1970s and early '80s atmosphere. It was dark but it could've been darker. I love the way Dirk starts out so innocent, and even in later scenes, when he's on the way down, he's shown as somewhat feeble-minded: I've never seen this done before. Perhaps if the main character had been a female, this feeble-mindedness would've been called sexist and degrading. Somehow the least convincing actor was Reynolds. On the whole, a fine movie. Glad I finally saw it, 18 years after it came out....",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "I've been debating between 4 1/2 stars and 5 but I can't give it 5 just yet. It'll most likely happen in the future, just like with TWBB and The Master.",
            "review_date": "2015-09-14",
            "source": "rt"
        },
        {
            "content": "M-F\n\n8.2\n\n[Paul Thomas Anderson]",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "Interesting take on the porn industry",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "Though set during the final years of the Golden Age of Pornography, you won't find yourself getting turned on by the sensational \"Boogie Nights\"; it's about the world  of erotica, but is, unsurprisingly, hardly erotic itself.  It looks at porn not only as a business but also as an act of human nature a handful of untalented citizens choose to perform on camera simply because they don't have enough self-confidence to do anything else with their lives.  Giving up the cherished virtue of intimacy is no problem - we'd be doing it anyway, they tell themselves as they slowly but surely get asphyxiated by the deluge of sleaze that takes over their lives.\n\tOne such individual is Eddie Adams (Mark Wahlberg), a high-school dropout who works as a nightclub busboy while his alcoholic mother (Joanna Gleason) berates him for being a loser without a future.  So he considers himself lucky when he's noticed by porn producer Jack Horner (Burt Reynolds, giving one of his finest performances) and is taken to San Fernando Valley to begin a quick-footed career.  With his youthful wiliness acting as a front for his well-endowed persona, he becomes an instant sensation, going by the glorious stage name \"Dirk Diggler\" in the process.\n\tLike regular fame of the Old Hollywood sort, Eddie is enchanted by his newfound life: drugs are at his beck-and-call, women kiss the floor he walks on, and he, only a few months into his crude career, is labeled as a star comparable to John Holmes, winning more Adult Film Awards than anyone else in the industry.  \n\tBut to live under such a filthy psychological roof can only do harm - termites have to come around sooner or later - and Eddie, despite his original satisfaction, finds himself continually disjointed from reality, the drugs soon becoming too much, the women too much, the attention too much.  It isn't long before \"Boogie Nights\" begins to turn into \"The Rise and Fall of Dirk Diggler\"; if it weren't for the happy-ish ending, maybe that title would have stuck.\n\tA film with the plot of \"Boogie Nights\" might sound vulgar, but, as the second film of the now sought-after Paul Thomas Anderson, it is anything but: it's a character study comparable to the fast moving epicness of Altman's \"Short Cuts\" or Tarantino's \"Jackie Brown\".  It travels quickly from black comedy to drama to black comedy over and over again, looking at the porn industry through both a satirical light and a deeply serious one.  We can laugh-and-point all we want at its fixtures' self-important realities, believing that having sex for a living is really a talent; but we can also look in horror as their world soon evaporates as their cocaine adoration becomes a problem, as arousal is no longer much of a possibility, as the mere dropping of their real name is able to destroy what they've come to know about themselves.\n\tAnderson's direction and writing is so monumental because it is able to find the humor and the darkness in the grimy situation, all the while maintaining a nonjudgmental handle on the icky setting.  He doesn't see his characters as objects like the people watching a porn film do - he rather looks at them as desperate people who acted hastily in their youth and are forced to endure a lifetime of pain for that initial agreement.  Whether they choose to become a porn mainstay or a porn drop-by is up to them, but the decision to appear in the first place will haunt them for the rest of their lives.\n\tWe see this as Eddie loses his place as the 1980s make their way into porn and he dissolves into piles of drugs, as the maternal Amber Waves (a terrific Julianne Moore) finds herself in the midst of a custody battle as her past marriage catches up to her sordid present, as the doe-eyed Rollergirl (Heather Graham) eventually realizes that dropping out of high school wasn't such a good idea after all.  Most heartbreaking is when Buck Swope (Don Cheadle), pregnant wife in hand, leaves porn and decides to start a business; but as he's asking for a loan, he is denied the money because of his long-ago mistakes.\n\t\"Boogie Nights\" seems to climax left and right as reality soon sets in; it's so brilliant because it experiences life through Eddie's youthful eyes, originally unassuming and finally, damaged.  The film is initially warm, inviting, and sun-soaked - but every single day afterward, the industry loses the honeymoon magic of its first few days.  Anderson's lightly maintained satirical eye during the first act of the film is notably luminous, and as he descends into off-kilter grit later grit, it feels like a natural progression.  The bold first ending (aka the wake-up call of Dirk Diggler), which sees the protagonist and a couple other coke-headed losers attempt to swindle a playboy out of $5,000 for coke (which is actually baking soda), is unpredictable and explosive, matching the capricious fickleness of the rest of \"Boogie Nights\".  It pools together every mood Anderson introduces us to during its 155 minutes.\n\tTake away the porn angle, and \"Boogie Nights\" would still be a standout ensemble character study.  Anderson doesn't rely on the gimmick of onscreen faux intimacy - he is more interested in the effect that it has on the people who devote their lives to giving a physical connection up for money.  An early, funny scene, where Eddie makes his debut alongside Amber, is just as sad as it is funny: between takes, Amber coos compliments to him like she's his mother, as if she's praising him for a soccer win, an academic triumph.  It's funny because audiences see the scene as sexy, the performers as a job, and we, as voyeurs, guffaw at the sheer fakery of porn.  What's sad, though, is that the performers don't see the toll committing such acts will have on them in the future, that audiences think that what they see on screen is real.  Thankfully, the world Anderson concocts makes \"Boogie Nights\" the furthest thing from cheap.  It's the real deal.",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "-IGNORE THIS \"OUT OF FIVE\" RATING\n4/4\nSmashingly effective study of a group of filmmakers in California in the late 1970s and early 1980s. Strikingly well cast; Walberg is perfect as the kid who dreams of being a star, and Reynolds delivers a powerhouse performance as a well known and respected director. Paul Thomas Anderson creates a vivid, exuberant, gripping, sometimes funny view of the movies not explored yet, and includes one of the most intense scenes ever filmed.",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "A técnica de Paul Thomas Anderson, tanto como diretor quanto como roteirista, é enorme e transborda nesse filme, que conta ainda com um elenco extremamente coeso e de alto nível.",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "It's amazing that Paul Thomas Anderson challenged to portray people in the pornography industry . He portrayed such people with pathos  in the golden age of 1970s to declining age of 1980's. Casting is also great. Julian and Phillip are Oscar actors and Mark, Burt, John, Don and William are Oscar Nominees.\nSome actors and agents were negative to be casted because of its subject but the big work exceeding two and half hours of play time is impressive and worth seeing as far as you don't have prejudice against the people working in the pornography industry. it was nominated for Best Supporting Actor Awards, Best Supporting Actress Award and Best Script Award in Oscar 1998.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is the Goodfellas of the Porn Industry. A great main character played by an underrated actor who deserved an oscar nomination for the performance. A great supporting actor and actress, and the rise of the hero who goes to the top and then falls when drugs take in. It's amazing how close the two films are. boogie Nights reinforces why PTA is one of the greatest directors of the 2000s. Though it came out in 97, it still a great film. heather Graham is amazing as the iconic rollergirl, Julienne Moore is stunning and headstrong as the Vulnerable Amber. Burt Reynolds who did the stink pile Striptease the year before  revived his career. The film has no flows other than being a bit too long and some graphic scenes that go too far. But it's a staple in the film industry and needs should've been nominated for Best Picture in 97, with the only film i consider that year that matched it is Good Will Hunting.",
            "review_date": "2015-08-01",
            "source": "rt"
        },
        {
            "content": "Making a movie about porn when your career is just beginning to take off is a ballsy (sorry) move, but hindsight has since shown that Paul Thomas Anderson knew what he was doing, and then some. His sprawling epic about the rise-and-fall of a skin-flick entourage is explored in intimate detail in this star-studded homage to the success and excesses of the '70s porn industry. Anderson does nothing to tame the subject matter for the big screen, but he doesn't fall back on shock value to keep you titillated (sorry again.) The two-and-a-half hour runtime is used to paint a mosaic, building up the characters involved, making their relationships the primary narrative drive, making Boogie Nights more a film about family than boning on celluloid. And if that doesn't put you in the mood (last one, I promise), you can revel in the stylistic flair Anderson brings in the form of intricately engineered tracking shots, lascivious color, and more camera trickery than you can shake an 8track at. Cinematic and torrid in equal measure, by pretty much any measure this is all the film you could reasonably want or need",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "PT Anderson's \"Boogie Nights\" is a great movie. It is difficult not to enjoy it. In many ways the film still feels like a free-form-jazz-reworking of Robert Altman -- if Robert Altman ever made a movie about the 1970's porn scene descent into VHS oblivion. \n\nEvery member of the cast is great. But John C. Reilly and Mark Wahlberg steal the whole movie. \n\nThe sadness and tragedies we see are mixed with deeply comical moments. And it is interesting to me how iconic this film's final scene has become.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "It's an authentic capturing of an era so much so that we forget that it was released in 1997. Boogie Nights is not for everybody, but avid cinephiles will be satisfied in knowing that it's a well-made film.\n\nTelling the story of Dirk Diggler (Mark Wahlberg), a young man who enters into the world of pornography in the 1970s and garners instant popularity. \n\nPaul Thomas Anderson does such a great job putting his imprint on everything he releases, and this is no exception. The details of the time period are so unerring.\n\nAlthough it's not my cup of tea, that's about the only complaint I have. Everything from the acting to the energetic script to the brilliant characters make this film a technical masterpiece.\n\nThe whole piece is about change and finding yourself. And it's even present in the most self-assured characters. \n\nOne of the standouts in this film is Julianne Moore who plays Amber, a confused-on-the-inside motherly figure for Dirk. She exudes so much confidence to everyone she knows, meanwhile twinkling some of her own confusion out of the corners of her eyes for those that aren't so wrapped up in their own lives.\n\nIt praises hedonism, but at the same time carries a disdain for it. Almost like it believes that one must experience the good and the bad in order to make their own opinion. But is it correct? Or can we learn from the prime examples that are set by the characters in this film?\n\nTwizard Rating: 84",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "REVIEW #200! Boogie Nights is a great satire on drugs and porn in which a casual industry of porn movies finds itself in a paradox enforcing casual products but at the same time requiring a formal and disciplined production process caught up by Mark Wahlberg's character's irresponsibility landing him into desperate poverty and Don Cheadle's character realizing that he is disqualified from earning business loans for this.",
            "review_date": "2015-07-10",
            "source": "rt"
        },
        {
            "content": "P.T. Anderson with yet another Pretty Terrific flick. I give this one 5 out of 5.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Perhaps an amazing film foe when it was released back in 97, but less appealing after almost 2 decades. The explicitly and nudity perhaps was perceived braveness back then, but I found it less unique now a days. My biggest struggle with the movies was the 'so what' piece of the whole thing... While there are a lot of amazing piece in the movie but none of them get to a final destination and a 'aha' menet!",
            "review_date": "2015-06-18",
            "source": "rt"
        },
        {
            "content": "\"Boogie Nights\" is a conventional cycle of stardom story told against the backdrop of an unlikely industry. It also flaunts a talented cast, and stand out direction from Paul Thomas Anderson.",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "Personal Top 10 all time. Mark walhberg at his best and so many good characters with great acting behind it. Makes the 70's look so cool.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "One of the most unique films of the 90's. All star cast, brilliant, memorable performances from the whole cast. Brings out some dark potential you wouldn't expect from certain actors and actresses. Simply unexpectedly good.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "An unflinching take on social history with unforgettable characters.",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "A wild ride with some inspiration from Tarantino and Scorsese. Quite an unexpected ending.",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "Every performance hits in this well written and received movie that have such rich characters.....trust me,I'm not overstating this.",
            "review_date": "2015-05-03",
            "source": "rt"
        },
        {
            "content": "I thought this would be fitting for the Eve of the Labour Day. Actions fitting the spirit of the traditional student celebrations: sex, booze and roller-skates. Well, it did fit that. Mark Wahlberg (yes, abs in order), John C. Reilly (ALWAYS the cellophane man from Chicago,yuk), Don Cheadle (yes, he could sell anything), PSH (weird as usual) and heather Graham (pretty in sulk). The saving grace were Burt Reynolds and... Julianne Moore. For the rest, pretty much pointless. I guess there was redemption and stuff in the end but still...",
            "review_date": "2015-05-01",
            "source": "rt"
        },
        {
            "content": "Style over substance",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "I feel if a movie is going to go past the 2 hour mark, and especially if it's going to go past the 2 and a half hour mark, it better have a damn good reason for doing so.  I don't really know that Boogie Nights does.  Every character has an arc, there's tons of stuff going on, and a lot of it feel could ultimately be cut out.  It feels like a really long script that never got cut down.  I love the idea of a film set in the porn industry, since it's such a bizarre world to explore, but I don't think it needed to be this much of an epic.\nHaving said that, there's nothing in the movie I didn't like, I just felt like there was too much of all of it and it kind of overstayed its welcome.  But I still liked it all.  I liked Wahlberg's story of a rising porn star, I loved Burt Reynolds as the legendary porn producer, I liked the journey through the decades of porn from the golden age to the modern age, and it had enough heartfelt drama to keep me invested while still being just an all-around fun movie that I really just plain enjoyed.  It's a damn entertaining movie that given a few cuts could have been damn near perfect, but as it stands its overlong pacing issues keep it from greatness.  I didn't love it, but I came very close.  I really really liked it.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "Brilliant, fun, and above all intelligent, \"Boogie Nights\" was Paul Thomas Anderson's first major accomplishment that cemented his place as the defining auteur of this generation.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "A killer soundtrack takes center stage on a movie with amazing and out of nowhere action sequences and well done, real characters.\n\nAlso, Alfred Molina.",
            "review_date": "2015-03-29",
            "source": "rt"
        },
        {
            "content": "PTA really brings out the best in whoever he works with. This is easily my favorite Mark Wahlberg performance, and I was quite the fan of him prior to seeing this.\n\nPhilip Seymour Hoffman was such a presence on screen in every performance; no matter how big or how small his role was. RIP",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "Flawless soundtrack and perfect aesthetics to set the stage for this story.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Just a perfect movie. One of the all-time greatest.",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "A masterful script of a touchy subject matter. Performances and camerawork were all outstanding.  Hard to believe Anderson was so young hen he made this. It feels like the work of a veteran filmmaker at the top of his game.",
            "review_date": "2015-03-04",
            "source": "rt"
        },
        {
            "content": "Extremely well shot, well written and well acted, \"Boogie Nights\" is a fitting coming out party for director Paul Thomas Anderson.",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson's porn epic is a masterpiece of film making. hysterical dark comedy blends with graphic realistic sex scenes and perfect characters to create a really fascinating and mind blowing character study. The acting is sharp, the writing is spot on, the directing is masterful, the cinematography is beautiful, and the way character arcs turn out is very satisfactory, if not disturbing. very very very smart movie and a great introduction to Paul Thomas Anderson.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Is still, such a great film.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "One of the best films of the decade!",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "Driven by its ensemble of strong characters and bold themes, P.T. Anderson shows off his impressive storytelling skills with Boogie Nights; a nonjudgmental and unflinching portrait of the world of porn that's less about sex and drugs (although there is plenty) and more about the authentic relationships of the very human characters.",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "A good attempt at telling John Holmes' story of breaking into porn and his downfall while trying to mask that it was about John Holmes. This movie is definitely a quasi-documentary drama that relies on very solid acting to keep the audience interested. I still don't know why I liked it so much, but I did and do! Solid acting.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "An incredible performance from Mark Wahlberg and some incredible direction makes this unmissable stuff. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Pretty good film, way too long though",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "I don't use this word much but this movie is amazing!",
            "review_date": "2015-01-21",
            "source": "rt"
        },
        {
            "content": "Weird film i probably needto watch it again",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "Anderson gives a good ride into the secret industry with a great performance by the star cast.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "\"I just wanna keep rockin' and rollin' and makin' better pictures.\" \nThe drug deal scene towards the end of the film is one of the best scenes ever put on film.",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "An excellent ensemble and having P.T. Anderson master his style after only one film, Boogie Nights is a modern classic.",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "Sexy, stilished drama",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "Not for the faint of heart.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "An epic romp through the 70s and 80s porn world, its somewhat overlong but indelible all around. Unbelievable music choices, which relentlessly carry nearly every scene.",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "86%\nWatched this on 12/12/14\nBoogie Nights is a movie with strong characters who are distinct from each other in all possible ways and the movie finds time to give all their stories space. Much like the other works of the director, the film starts out slow, but kicks up on pace. It's one of the best erotic movies ever made and the action packed second half is mesmerizing. The performances are all tight and the light look upon porn industry is also good.",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "Fantastic piece of work from one of my favourite directors",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "An perfect example of film making at it's most incredible by paul thomas anderson with powerhouse acting by it's great ensemble cast. First half of the film was very enjoyable, seconds half of the films gets more darker. Totally sums up the personal life of pornographers. That was probably the best performance by Mark Wahlberg but Burt Reyonals was the best of them. Storyline was top notch, it was like watching the  Goodfellas version of porn.",
            "review_date": "2014-12-03",
            "source": "rt"
        },
        {
            "content": "This is an interesting film, because the plot was very straight forward. But it's the incredible directing and the incredible acting that completely made up for it! The costumes and everything really captured the essence of the 70s. And it was a sexy movie of course with Heather Graham! And the comedy timing blended perfectly with the film. This is an easy film, following the life a pornstar in the 70's!",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "Absolutely BONERIFIC BABY!! A scrumptious cast coupled with a succulent storyline! Wahlberg is solid and John C. Reilly totally rocks!! It sizzles with it's fun, edgy, groovy dialogue. A MUST SEE!!!!",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "A powerful and hard-hitting tale of success and fame despite its raunchy subject matter.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Propoganda seksual dan pornografi.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "Uma comedia original sobre um assunto pouco comum, com bons desempenhos e uma história interessante ...mas demasiado longa.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Was my favorite film for a long time, and is utterly fantastic, but Anderson's youth is clear.  Flashy and beautifully shot, with amazing scenes throughout.  Breakout film for maybe the best living director we have.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "How have I never seen this???",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "my second favorite movie of ALL TIME",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "Favorite movie of all time",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "O.V.R 6.5/10...the Godfather film of Pornography",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Bold, emotional, hilarious and unforgettable. This '90s masterpiece takes the classic rise and fall story, but plays with it in the '70s porn industry and pairs it with strong and ambitious themes. An extremely talented ensemble cast delivers a plethora of skillful performances. Paul Thomas Anderson is a master and he hit an amazing creative stride very early on in his career with this near flawless character study.\n\nThis film, however, studies the porn industry as a kind of single collective character. It's shallow, vain, naÃÃ,Â¯ve, and relatively unintelligent, but we see that these are human beings with aspirations and goals in life, people that are capable of love.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "\"Everyone's blessed with one special thing.\"",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is a sharp, well directed film, which tackles bold themes with great confidence. Unfortunately, the results aren't always as unique as one would desire, though for all the plot's down points and lulls, there is a great deal of social commentary, filmed in a way that keeps you invested all throughout.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "Boogie Nights Is A Epic Tale Of Porn.Had A Strong Cast.Mark Wahlberg Delivers A Excellent Performance.Paul Thomas Anderson Delivers A Incredible Masterpiece.A",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "PTA turning great actors into pornographic stars. what should i say about this? GENIAL!",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "This movie tells a similar story to Almost Famous but manages to be more enjoyable based on its superior casting, varied cinematography and more believable plot.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "Great ensemble. Took a while for me to really get into it, but the wait paid off.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "Drama and comedy indeed!",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "I own one of the original Dirk Diggler oil paintings from the movie (the first one seen, that Jessie is painting).   So yeah, I think this movie is the best of all time!",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "gets worse with every re-watch",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "A little too long IMO, still it's an amazing film. P.T Anderson, as always, creates the most drastic and amazing scenes in cinema. Music's amazing too.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Mark Wahlberg as a thug...not shocked :-O  Burt Reynolds with a pornstash.  Loved the humour.   Loved the supporting cast.  Entertaining.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Not gonna lie, gotta tip the hat to Paul Thomas Anderson for turning such pornographic materials into something not only watchable and tolerable, but also cynical and comedic. My favorite character has got to be P.S.Hoffman, tho' he only played a small part, he killed every scene he's in. In general, it's a good movie with an interesting storyline, but certain parts are a bit  lengthy, unnecessary and kinda distracting.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson's controversial film Boogie Nights remains great to this day. The raunchy subject material is handled in a sleazy, raw kind of way-- exactly what was intended. Character development is surprisingly good, and the direction is excellent. Haters of the film most likely can't handle the pornographic material. But, the movie captures the 70s porn scene very well, and the film is excellent, albeit a little too long.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "One of my personal favourite from 90's. Great moviemaking.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Intresstingly shot, bravely executed starpower and an intressting set of characters that makes you satisfied.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "3.8 out of 5 stars - 7.6 out of 10 stars - 76%",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "Well made look at the pornography industry. A",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Acting: phenomenal. Truly. Great depiction of truly sad, broken people. Almost couldn't watch it all. Phillip Seymour Hoffman broke my heart. Wanted to punch Eddie's Mom in the face. Appreciate what it was, but would I ever want to watch it again? Never. Ugh.",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "There's enough to love about Boogie Nights - the music, the acting, the costumes - to help get over the weird direction choices and slightly overstuffed script. There are some magical scenes in Boogie Nights, the performances by Wahlberg and Reynolds are excellent, and to say that Phillip Seymour Hoffman steals every scene is an understatement.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "This is the kind of movie that keeps you interested in spite of its 2 1/2-hour length. The cast members play their parts brilliantly, to the point that they seem totally real. In fact, the characters here seem more real than in most other films I've seen, and that takes some damn good acting. The story is very well-engineered, with driving plot twists that keep the story going, and there's plenty of room for real character development. Of all the films that are set in the 1970's but were released after that decade, this film manages to recreate the 70's beyond the usual style and music. It recreates the distinct glamour of the 70's, but it also recreates the highs and lows, along with the carefree ethos and mentality of the people in it. They do just as good a job at establishing the right mood. The first half of the movie is presented with ecstatic highs, while the second half, which is set in the early 80's, is presented as the point where everything starts coming down. This, I feel, is what makes this movie a classic. Everything about it was done just right, and it was a rich, occasionally funny, and satisfying experience.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "With the help of a consistently smart script, Boogie Nights is darkly funny and rooted in the flaws of human nature, casting a light on the last days of porn's golden age in an even-handed way.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "this movie was crazy and unpredictable",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "The very best of Mark Wahlberg",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "The Last 10 Seconds!!!\nDirk Diggler!!!\n69 ME!",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "This is bold and brilliant stuff.  I haven't seen this for about a year but it left an impression on me... an elaborated review will come when I watch it once more.  Anderson is probably best known for \"There Will Be Blood,\" but this movie equals it in greatness.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "[img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "There's little more odious and disinteresting than the straight porn world.  Gratuitous drugs, violence, and profanity for little apparent reason.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "Every sweeping camera, groovy soundtrack tune, and immersive performance leave no doubt that this is one epic of a character study. The character, is Sex.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson is a master film-maker and his direction, suave, and style boast 'Boogie Nights' as being a fantastic film. The music, the clothes, the  70's itself create a smooth aroma surrounding Anderson's intense look into the porn industry and the people in it. By the end this movie is not just about the business but about peoples dreams and the many choices made to either fulfill it or crush it. Its funny how Anderson handles the uneasy topic of porn- he never glamorizes it or demeans it but instead does both and leaves it to the viewers conscious to decide whats right and wrong.",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "About the best you could expect from a biopic of a porn star - unless the makers wanted to portray it in a more negative light. \n\nWorth watching...",
            "review_date": "2014-04-29",
            "source": "rt"
        },
        {
            "content": "Tem um excelente e romântico retrato de transição entre a década de 70 e 80. Talvez a única coisa que possa incomodar seja a falta de colocar em discussão a moralidade. http://www.santuariodomestreryu.com.br/2014/04/sessao-critica-boogie-nights-prazer-sem.html",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "Genius storytelling and well-developed characters along with a great soundtrack and inventive cinematography make this film a classic. Not for everyone, but definitely a must see for any film enthusiast.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson's  BOOGIE NIGHTS is a soulful, vibrant and uncompromising epic on the pitfalls of controversial artistic expression, hedonistic life and above all, the significance of familial relationships. A pulpy yet profound masterpiece.",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "One of my favourite ever films, this masterpiece is both a breakthrough flick for Anderson and Wahlberg and an amazing, compelling story of the secrets of the porn industry.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "A movie that is styzlied and maturely written with a VERY strong second half",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "SPOILERS!\nThat was pretty damn disappointing. I've heard so much good stuff about this movie, and PTA is one of the best directors around in my opinion, but this film just really wasn't that good, not in comparison to his other films at least. Maybe it was the selfish characters, or the fact that a lot of them, who near the end of the film were at rock bottom, suddenly changed their lives around for no apparent reason, with no motive to do it what so ever. I mean it's not like it was shown that they all had some revelation, right? They just went from the bottom to the complete opposite in a matter of minutes! Unfortunately My friends, that's just called lazy writing. Plus, Diggler was just shown to go back to his life of porn, but isn't that kind of the thing that messed him up in the first place? Was it trying to say that he's an idiot that didn't learn anything from his experiences? I don't know, but either way it was disappointing. \nDespite my rambling criticism, it wasn't all bad, I mean I have given it 3 stars. I really liked how it showed the changing attitudes to porn as time went on, the directing was fairly good, as was the acting, and despite all its flaws it was an entertaining film to watch with its multiple character backgrounds; although it seemed like some of them weren't quite finished...\nMaybe I should let PTA off and use the excuse that he was a young director/writer at the time, but i think i preferred his first movie, Hard Eight, to this. It really baffles me that this movie is so highly praised, maybe I'm the idiot, maybe I just didn't get it, I hope that's the case.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Boogie Nights weaves a vast tapestry of interesting characters, while P.T. Anderson unwavering look at stardom with all its pitfalls. The cast is amazing, led by Wahlberg, but features notable performances from almost every principal. The story is perhaps everything you might expect, with not many surprises, but the way its delivered makes up for any predictability. Anderson's use of longer scenes and longer takes doesn't let the characters escape the viewer and given the world it portrays, they kind of mirror the way they are used in the porn industry, as shown in the film. The soundtrack is a little crowded with perhaps too much music, but some songs really hit the spot. All in all, it's recommended, because the talent on display is just to good to ignore.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Engaging movie with solid acting by everyone.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "I felt the movie did an excellent job of immersing the viewer into 1970's 80's porn life, but not really my thing overall.  I got dragged along to go see this.....",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Felt unnecessarily long and boring in spots, but it's an interesting analysis of the  dirty truth about porn.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen. It turns from one type of movie into an entirely different one by the end.",
            "review_date": "2014-04-02",
            "source": "rt"
        },
        {
            "content": "Mark Wahlberg is a baby and so adorable but watching a movie about 80s porn stars didn't do it for me!",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "Loved this film. The fact that it's 2 and a half hours long doesn't even play a factor as you simply can not keep your eyes off the screen the whole time.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "\"Hey, are those lizard?\n\nNo, they're Italian. I'm gonna f**kin' buy these.\"",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Although slightly derivative of the style Scorsese & Tarantino, Boogie Nights was PT Anderson's giant, wave-smacking splash onto the American movie scene. His talent is on display here in spades.",
            "review_date": "2014-03-13",
            "source": "rt"
        },
        {
            "content": "Great film. Cool cast. The performance that made Mark Wahlberg's career.",
            "review_date": "2014-03-13",
            "source": "rt"
        },
        {
            "content": "if you haven't seen this movie your life is incomplete",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "This is a horrible awful disgusting movie. About 4 people die in the most awful way. Heather Graham is great as normal but she cannot save this creey movie.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "I can't think of many better movies.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Such an incredibly told story about young man who goes from high school drop out loser to a major success in the adult film business with the guidance of adult film director Jack Horner (nominated Burt Reynolds), but then struggling to juggle fame, drugs, and trust.\nA career-making performance made by Mark Wahlberg, so surprised he wasn't nominated for an Oscar.\nGreat film.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "Boogie Nights can, in many ways, be compared to this year's own Wolf of Wallstreet, with it's fictional semi-biopic format and bitchin' period piece vibe. I don't think there's ever been a cast assembled this tight and this talented before or since. Everyone is giving the performance of their year, no doubt recognizing how incredibly juicy their dialogue is. Excellence par none in every way.",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "one PT anderson's best",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is a story so beautiful in an environment so chaotic that leaves you marveling at how a film could be so impressive. Paul Thomas Anderson sits comfortably on the top of the film-making world.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "Loooooovvveedd it!!!",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "As someone who is adamantly opposed to the porn industry, I can't believe that a) I watched this film, and b) loved it.  Paul Thomas Anderson is the man.",
            "review_date": "2014-02-16",
            "source": "rt"
        },
        {
            "content": "A film that is highly acclaimed and high praised as Paul Thomas Anderson's Masterpiece rings false with me. This is a film that seems to have taken too much influence from other films. It often feels too much like a downgraded version of Goodfellas with pornstars. The ending steals from another Scorsese film, Raging bull. So for a director who is bursting with originality with great films like (There will be blood, Punch-drunk love and the master) ends up making a movie during a time in his career where his first 3 efforts were decent, but not without it's major faults. The few positives of this film was it's objectiveness on the porn industry, the tragic lives of each character and it's excellent performances. However, by the end of the movie I felt exhausted. A great commentary on the porn industry, but not a great movie. But it is still a pretty damn good movie.",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "A wild ride well shot and extremely well written...look if you must, be prepared to go to the dark side later and prepare yourself for the unraveling from the 70s to the 80s",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "Una película estrambótica con toques de comedia y un final para taparse los ojos...",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "why this film is so highly acclaimed is completely beyond me! went to see it with several friends on its release and not only did we all almost die of boredom and fall asleep but the cinema lost half its audience during the screening with people walking out with terminal depression setting in. Burt reynolds apparently has distanced himself from this film over the years and their is plenty of reason to as a film that is supposed to represent a truly exciting decade fails to egnite. The film took 2 and a half hours to finish and an audience member said at the end \"thank f--- for that!\" and judging by his expression and tone i dont think that meant he'd enjoyed it!",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is so great!  Great performances, great writing, great storytelling.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "Broken people find family within the disco infused porn industry of the late 70s/early 80s. Wahlberg was elevated to A-list status by this film, while the rest of the ensemble is rock solid. The direction of P.T. Anderson is second to none.",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "Paul Thomas Anderson best film. Ever.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "A classic in every sense of the word, Paul Thomas Anderson's audacious sophomore effort is all kinds of cool, takes you on a high ride, smacks you as it dives back to Earth and has enough in the tank for another go. Peppered with healthy doses of Scorsese and Altman, Boogie Nights is the kind of film that flatters the imitated, all the while dancing to its own (rock n' roll) groove. The attention to detail and commitment from the cast and crew is seen in every (explicit) frame, often bordering on the darkly funny to smack-dab violent. The balancing act between character, circumstance, fate and honest to goodness talent is seen in full display with Boogie Nights both in front and in back of the camera.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Exuberant and funny, 'Boogie Nights' is one hell of a movie, with an incredible ensemble cast.",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "Feels very much like a blend of Pulp Fiction and Requiem for a Dream.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Well, Philip Seymour Hoffman just died, so much like I did with Peter O' Toole, I'm going to write a review of one of his movies (even though he's no more than a bit part in it). What's weird is that I just watched Boogie Nights for the first time last night, and then I woke up this morning to find out that Hoffman is dead. Huh. Maybe the next movie on my itinerary should be Justin Bieber's Never Say Never. Anyway, Hoffman was a great actor who starred in both some of my favorite (The Big Lebowski) and some of my least favorite (The Master) films of all time, but the consistent high point in even his worst films were his performances, which had depth and range. He will be missed.\r\n\r\nSo: Boogie Nights. Directed by Paul Thomas Anderson (who also did The Master, by the way), this film is an intense and graphic showcasing of Hollywood life in the 1970s-- specifically the porn industry. It stars Mark Wahlberg as an up-and-coming (no pun intended) porn star named Dirk Diggler and Burt Reynolds as the director who \"discovered\" him. Interestingly enough, Reynold's character is a terrible director who makes shit for a living, and is still a pretentious ass about it... which is exactly what PTA became in his later years. Oh, the irony. Anyway, although this movie does lack the air of self-importance and arrogance that has plagued PTA's recent movies, it does lack something that the others do: A frickin' story.\r\n\r\nBoogie Nights showcases a slice of Americana that is a good chunk of why other countries hate us so much. And no, I'm not talking about porn (that's part of it though), I'm talking about the 1970s. Anderson takes great lengths to recreate the air of decadence, amoralism, and seediness that plagued that decade, but he doesn't actually build a story around it. Wahlberg's character is a whiny little bitch who doesn't really connect with the audience in any way (his defining feature is his apparently 13-inch penis, so yeah, don't watch this movie if you're not prepared for that), and he never really does anything throughout the course of the film. One would think that a movie about such a subject would finish off with its characters in a spiral into darkness, a tragedy like Requiem for a Dream or The Fly. But for some reason, Boogie Nights concludes its tale of filth with a fairytale ending: Wahlberg pulls his life out of the gutter, Reynolds returns to making movies, and the audience wonders if this couldn't have been accomplished in less than two and a half hours. Why would you end a movie like this on such a high note? It almost justifies what the people in it are doing. Not that I'm looking for some sort of hellish, morbid conclusion to it all, but there has to be some reason for why I just sat through the film.\r\n\r\nStill, I can't entirely write off Boogie Nights, as Anderson's direction is admittedly quite vibrant, and the characters and dialogue are spectacular. It creates a Pulp Fiction-y vibe, and although it's not quite capable of reaching the pure and unbridled insanity that is a Quentin Tarantino movie, it still impresses. Wahlberg, who isn't a very good actor, is given a lot to work with here, and even though his character often comes off as annoying, you still want him to make it to the end of the film. With a supporting cast that includes Hoffman, Julianne Moore, John C Reilly, Don Cheadle, and Heather Graham as the unnamed \"Rollergirl,\" there's really not a high probability that this would have been bad. Even though the runtime could have easily been trimmed down a bit, I can't seem to pinpoint many scenes that I would edit out. This dark comedy only really works when all of its randomness is joined together in one glorious amalgam of sex, drugs, and chaos. For better or for worse, it's one of the most demented movies out there.\r\n\r\nFinal Score for Boogie Nights: 7/10 stars. I really wanted to like this movie more, as everyone calls it PTA's best film, but I honestly couldn't get as into it as I should have been. The ending really killed it, but there is no heart to this movie in general, and much like The Wolf of Wall Street, its emptiness cannot be combated by the cheap thrills it delivers. Maybe if it had had a more charismatic lead actor, playing a more sympathetic character, it would have been better. But it settles for being a slightly above-average movie about porn and drugs... in which nobody actually says the word \"porn.\" Also, did we really need to see Wahlberg's penis at the end? I'm not a prude (although it was gross), but it kind of destroys the illusion of the movie. Much like Steven Spielberg revealing the aliens at the end of Close Encounters, it doesn't leave anything to the audience's imagination. And that's not something movies should do.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "From shot to shot to shot, Boogie Nights mixes together wit, confidence, creativity, and perfectly executed shock value into a truly remarkable whole. In short, this is one of the best movies I've ever seen.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "The story is about a young man has a gift, his gift gets him praises. He uses his gift to get into the porn industry in the 70's. This is the story of him and his gift. When I finished watching this movie I didn't know what to think of it. but for a while I came with the words to say about this movie and that it amazing. this movie has a big cast and all of the actors did a outstanding Job in they roles.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "Boogie Nights is well-acted, interestingly non-judgemental and it transports you to its era beautifully, but its running time is a challenge and it is never as deep or poignant as it could have been.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "A full fledged masterpiece and one of my personal favorites of all time. Perfectly castes and acted roles with a picture perfect screenplay and fantastic direction from PTA.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "did people actually enjoy this?",
            "review_date": "2014-01-17",
            "source": "rt"
        }
    ]
}