{
    "rating": 9.4,
    "release_date": "1997-09-19",
    "num_reviews": 310,
    "genres": [
        "Crime",
        "Drama"
    ],
    "summary": "Three policemen, each with his own motives and obsessions, tackle the corruption surrounding an unsolved murder at a downtown Los Angeles coffee shop in the early 1950s. Detective Lieutenant Exley (Guy Pearce), the son of a murdered detective, is out to avenge his father's killing. The ex-partner of Officer White (Russell Crowe), implicated in a scandal rooted out by Exley, was one of the victims. Sergeant Vincennes (Kevin Spacey) feeds classified information to a tabloid magnate (Danny DeVito).",
    "reviews": [
        {
            "content": "Liked everything about this movie.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare perfect film. Everything about this film is amazing from the cast, their acting, story, directing, cinematography, editing and pacing I can't recommend this film more, an absolute must see! It absolutely should have won best picture that year!",
            "review_date": "2023-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is just perfect and the cast is just amazing.",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not an expert on Kim Basinger movies, but she is excellent in this one.",
            "review_date": "2023-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 02 hour: and 16 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Ages 17 and older!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, perfect in every way.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than Chinatown. Yeah I said it, and I'm not taking it back either",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie with different twists and turns and has exceptional acting. For whatever reason it did not get much of a push in the theater, but it is really a must watch.",
            "review_date": "2023-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies ever. A masterpiece of atmosphere, with each shot vibrant with revelations waiting to happen. Excellent narration, perfect casting and masterful tempo. Both beautuful and exciting.",
            "review_date": "2023-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an interesting story with an impressive ensemble cast.",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super!! Sunday night watch",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great performances, (despite the recent news) Kevin Spacey is so good. I am a Sucker for detective movies and this one is an Hollywood clasic. The screenplay feels really old school, but still refreshing. The production design and editing or top notch. Overall a movie i Will definitely revisit someday, BECAUSE it was amazing!",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I suppose that means that an overly esoteric plot should be viewed as intelligent and clever.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting. But the story just felt stale. Still enjoyed watching it. ",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie acting ever by an ensemble! With the best adapted screenplay ever written!",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible story with jaw-dropping moments and outstanding performances!",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the movie in some parts for sure! I liked how angry and aggressive Russell Crowe got in some scenes and how he acted and there were some dramatic murders and interrogation scenes that served the movie well for what it was meant to be. I do feel like they underutilized Kevin Spacey though (who I normally love and who is normally given more opportunity to be quite animated with his performances) and they also had too many crime subplots going on instead of one main thing to focus on. Guy Pearce and Kim Basinger did fine, as well as Danny Devito. In the end it was slightly overrated but I'd watch it again!",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfection in 2hrs 18 minutes. Perfect character development, story line and pacing, this movie faintly provides a realist view of policing back in the day.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long-winding cops conspiracy drama slowly develops into an interesting action...",
            "review_date": "2022-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely plot with great acting from the entire cast. Could watch it a thousand time over.",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolute blast from start  to finish. kept me on my toes and the deaths felt chilling real like the godfather",
            "review_date": "2022-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic cop thriller. The arcs of the three main characters weave together into an ever-thickening plot that hits an explosive and satisfying conclusion. Though, with so many moving pieces, the film suffers from a lack of clarity at certain points.",
            "review_date": "2022-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crime films from this era all have a certain air to them - a little dry with the dialogue, very writerly...honestly a little tough on my attention span - but the twisty tale LA Confidential tells feels very pioneering for its time for openly portraying cops as villains. At face value in 2022, there's many more gripping crime thrillers than this, but it's always interesting to see how we got to where are.",
            "review_date": "2022-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fiercest neo-noir ever made about police integrity and corruption.\n\nDirector Curtis Hanson's neo-noir crime mystery L.A. Confidential (1997) is absolutely captivating with bloody shootouts and corrupt police everywhere. Curtis Hanson really wrote and produced a neo-noir film in the 90's that's as hard hitting and shocking as the old 1940's noir pictures like The Maltese Falcon, The Big Sleep, or This Gun for Hire. L.A. Confidential is a blend of The French Connection, Chinatown, The Untouchables, Mississippi Burning, Goodfellas, and The Silence of the Lambs. You are given shadowy nights and sudden bursts of violence from Hanson's technically masterful direction. It's such a matter of face nihilistic film that shows you all the grit and grime of L.A. I really appreciate Hanson just showing you everything and never needing to explain the gritty details upon rewatching L.A. Confidential. Justice is delivered, but not always to the right people.\n\nHanson's direction delivers upon intriguing confidential mysteries, sizzling hateful buddy cop rapport, heroin rackets, shady drug deals, violent grisly murders, brutal abuse, sleazy nudity, shocking victims of rape, racist profiling, underground porno profiles, suspicious homicides, and high class Hollywood prostitution rings with ladies of the night that look like movie stars. L.A. looks horrifying here without all the Hollywood glamour. L.A. Confidential is not for the faint of heart or idealists, but its morality comes from its condemning judgment of all the police corruption. Curtis Hanson is essentially asking what is the real difference between law enforcement and law breakers. Is there any justice for police committing crimes?\n\nWriters Curtis Hanson and Brian Helgeland's blistering screenplay adaptation of James Ellroy's novel is fascinating. Clues are hinted at and intricate mysteries pile up seemingly without connection until the final reveal. They show the virtues of attempting to be a good cop in a systematically racist, violent, and corrupt police force. Everything feels hopeless when a lone decent policeman wants to change his police department. But he even succumbs to personal gain at the expense of other officers. I love that you actually see the disgusting, corrupt, and regressive retaliation from all the awful corrupt cops against whistleblowers and snitches. L.A. Confidential really demonstrates exactly how and why police corruption starts, continues, and protects officers from repercussions. L.A. Confidential's main theme is a nihilistic viewpoint of all cops being bad at heart, whether from corruption, perversion, or rage. Few screenplays have navigated such complex mysteries, clues, and characters with such visceral style.\n\nGuy Pearce finds himself in a comparable good cop role as Willem Dafoe in Mississippi Burning and Roy Scheider in The French Connection. His cold attitude is a nice juxtaposition to Crowe's viciousness. His callous snitching, calm and clever multiple interrogation sequence, and brave finale shootout. Pearce is incredibly nuanced as he slowly shows doubts in his legit process as he questions his entire motives. You see someone who might have been good lean into depravity like any other cop.\n\nRussell Crowe plays the hard cop with a mean temper and a no nonsense attitude like Gene Hackman in Mississippi Burning and The French Connection. Crowe is fearsome in his brute force interrogations and subtle in his depiction of trauma that lead to him wanting to beat every woman beater. You witness a formerly deeply moral man resort to violence endlessly, even against women. Crowe shows how in his righteous fury, he never notices that he is really working the same case as Spacey and Pearce.\n\nKevin Spacey fittingly plays a corrupt sleazebag policeman out for fame and redemption. Spacey is hilarious as he is seedy. James Cromwell is excellent at subtly portraying his disdain for Exley ratting out his fellow cops and his refusal to resort to violent methods. His every line delivery is chilling.\n\nDanny DeVito is very funny as the tabloid photographer and reporter out for stories and cash. Kim Basinger gets dressed up with similar peek-a-boo bangs and dresses like the adorable and iconic Golden Age of Hollywood starlet Veronica Lake. She's an alluring femme fatale with daring realism and sultry sex appeal. Basinger feels so lived in as this rather tragic heroine. David Strathairn is perfect as the cavalier porno producer that gets Hollywood hopeful girls in his prostitution ring.\n\nEditor Peter Honess keeps you in the moment with really sharp cuts from moment to moment with a breakneck pace. He gives you every angle in a room before a shootout. His neat cutting style is class and tells a dark story about corruption with every detail imaginable laid right out for you. 138 minutes fly by due to Honess' quick editing. He passes by time with a few select cuts that make sure L.A. Confidential's slick story is a coherent one. \n\nCinematographer Dante Spinotti's gorgeous shots are beautiful with shadows cast on cars and guns alike. His neat perspectives around corners and up close to faces reminds me of Jonathan Demme's style of close-ups for The Silence of the Lambs. There's a sick voyeurism to all the nudity and brutality being in the dark limelight. He holds shots for the horror and emotional scenes alike. I'm always stunned by how well shot L.A. Confidential is especially the midnight finale.\n\nProduction designer Jeannine Oppewall recreates 1950's Hollywood from bars to lavish homes. William Arnold's art direction leans into rainy days and curious faces. Jay Hart and Louisa Bonnie's set decoration brings the past to life with old antique furniture and props in every scene. You never doubt what era you're looking at during the movie. Peter Donen's visual effects make for gory gunshot wounds and slit throats.\n\nComposer Jerry Goldsmith's music is full of nostalgia for an older time, while also feeling a pounding rhythm for the intense action. I love Goldsmith's scores and L.A. Confidential features some of his finest melodies and musical ideas. Ruth Myers' costumes lean into classic Veronica Lake and Marilyn Monroe dresses, while every man has the 50's suit standard. Lance Anderson's hair and make-up does up Kim Basinger like she's Veronica Lake or Marilyn Monroe with the wavy locks, peek-a-boo bangs, and crimson red lips.\n\nIn all, I love L.A. Confidential for Curtis Hanson's meticulous investigation style direction and ruthless acting all around.",
            "review_date": "2022-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the quintessential glamorous Los Angeles, crooked cop, cop who plays by his own rules, cop who plays by the book's rules, and high-end prostitute story. The twists keep comin' and they don't stop. The plot is layered and buttressed by an ensemble cast that includes, but is not limited to, Guy Pearce, Russel Crowe, Kevin Spacey, Danny DeVito, Kim Basinger, and James Cromwell. The interrogation scene is top-notch; the shootout scene is delightful. There didn't seem to be a storyline wasted and I appreciated their interconnectedness, but I must've missed something concerning the Nite Owl massacre because I was not pulling on that thread at all. The roller-coaster relationship between Ed (Pearce) and Bud (Crowe), culminating in the aforementioned shootout, is the highlight of the film. I don't think L.A. Confidential wow'd me like it did both critics and audience on RT, but it's definitely a solid, comprehensive movie about the dark side of early 1950s Los Angeles.",
            "review_date": "2022-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my fave films of all time but be warned.  you have to pay close attention, the dialogue moves very quickly.  not one to kind to listen to and occasionally look at the screen.  get ready to give it your undivided attention, it will be worth it i promise",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sonic I think I'm going to get a big boy and king king",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great fun movie about a time when Los Angeles was still making a grand effort to \"Come of Age\".  While much of it is Hollywood Propaganda, it's still has a seed of truth that was mostly replaced by professional Police/Sheriff services in 2nd 1/3 of the 20th Century.  The story line and lives of simple people is interestingly displayed.",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very, very enjoyable with real depth .",
            "review_date": "2022-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good mafia-based caper, with a stellar cast. Not necessarily the most gripping storyline, but it plays well enough. Nothing particularly special, mind",
            "review_date": "2022-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LA Confidential is as brilliant as you perhaps expect it is. From the thrilling screenplay to the aesthetically pleasing cinematography, there is a lot to like about this 90's noir showpiece\n\nThe performances from all involved are brilliant. I particularly enjoyed Russell Crowe's intense and ferocious portrayal of Bud White, while Guy Pearce provided the intelligent and calculated base to play Edmund Exley, and finally Kevin Spacey brought the sly and wise humour that embodies his character Jack Vincessens. These are all heavyweight actors who all produce a career best performance, they all bring something richly different to a heavy narrative that requires attention. Couple these with the psychotic nature of Cromwell's character, Dudley Smith, and this film has about just everything a detective narrative needs. Kim Basinger's performance alone is great\n\nThe screenplay from Brian Hegeland and Curtis Hanson is perfect, a very precisely told neo-noir story that has its twists and turns placed brilliantly. \n\nThis is an essential noir film to watch, it's paced very well too meaning the runtime rarely drags, a brilliant film from Curtis Hanson",
            "review_date": "2022-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a fan of mysteries and thrillers and who likes a lot of the cast (such a great one on paper), expectations were high for 'LA Confidential'. And 'LA Confidential' didn't disappoint at all, it is an outstanding film on all levels and should have won the Best Picture Oscar of 1997 and won more.\n\nVisually, 'LA Confidential' looks great. The photography is both audacious and stylish, suitably the story and genre superlatively. A good music score also helps and there is an appropriately haunting one courtesy of one of the greatest film composers ever. Curtis Hansen directs superbly, it has a lot of style and how it balances everything is so cleverly done, he hasn't made a better film and to me it's the best directing of his entire career.\n\n'LA Confidental' richly deserved its Best Screenplay Oscar. No other film that year came close to the film's rich character development, complexity and its refusal to fall into cliché territory. All the characters are compelling in their realism and none of them feel stereotypical or one-sided, actually breaking the mould of good cops and bad villains. The story is gripping in its intensity and thrills, with plenty of unexpected twists and turns, and very rare a dull moment.\n\nThe acting is exceptionally full-blooded and there isn't a single weak link. How Russell Crowe, Guy Pearce and Kevin Spacey weren't nominated for Oscars is unfathomable. Spacey in particular is brilliant, though Crowe is appropriately hard-nosed and Pearce has rarely been better.\n\nJames Cromwell and Danny De Vito also shine. Cromwell is chillingly insidious and De Vito has never been slimier. Whether Kim Basinger deserved her Oscar win is up for debate, to me it was a very worthy win where she gives her role hard edge and charm.\n\nIn conclusion, superb film-making and an outstanding film on all levels. 10/10 Bethany Cox",
            "review_date": "2022-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what a big screen movie should look like. Too edgy to get a major budget now.",
            "review_date": "2022-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite movie of all time. If you want to watch a great movie, that's interesting and entertaining then this is the one!",
            "review_date": "2022-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie , one of my all time favorites with a top line cast and story that captures 1950`s L.A  essence perfectly . Have watched it numerous times and the magic never fades .",
            "review_date": "2022-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderfully crafted movie from the start to the very end and this would have been a 10 out of 10 if we did not have to remember so many names thrown at us and so often at that.  The ending came together so very nicely and after my thinking on so many misbeliefs other than the outcome.  That is all just good direction!  Great performances and a wonderful music score!  9 out of 10 all day long!",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I often confuse this film with Mulholland Falls (1996), which figures: a year apart, gritty crime dramas set in 1950s LA. Heck, watch these back-to-back and join in my confusion! Both great flicks.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really my cup of tea...but did appreciate the acting of the all star cast that was assembled",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just outstanding, all round - plot, characterisation, cinematography, the amazing Kim Basinger, the brutish but loveable Russell Crowe, the stylish and slick Kevin Spacey, the wirey but honourable Guy Pearce. Love it.",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deliciously 1950's Hollywood crime yarn that boasts an absolutely loaded ensemble cast – not to mention that nearly 25 years removed from its premiere, the cinematography, direction, and switchblade-shape editing hold up as a visual feast. However, what may have been a sure fire experience for the average 1997 viewer in terms of having their mind's \"blown,\" is regrettably marred by the last few decades of overly-contrived or just lazily constructed denouements – so be sure to suspend your disbelief and *really* allow your brain to completely shut down before you start watching this one…otherwise, it's not at all a stretch to say one could predict every single narrative beat, (especially how it all shakes out), from DeVito's admittedly-gripping introductory narration. 4.0/5.0",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little hackneyed at times, but still a strong movie with intense performances in the backdrop of a mystifyingly jig-jag plot.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best noir / crime movie you will ever see.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A practically perfect neo-noir thriller, L.A. Confidential's smart writing, brilliant acting, great direction, magnificent, immersive production design, memorable characters and Dante Spinotti's seminal camerawork as well as solidly choreographed shootouts make this a true contemporary classic of the genre that's completely lacking in the \"dull moment\" department. Is that enough positive adjectives to provide the necessary reassurance that this thriller is, indeed, a great film?",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely phenomenal. This is how to make a movie (Marvel and the other marketing driven studios that make \"films\" today should take note!)",
            "review_date": "2021-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish and beautifully true to its genre. Not sure what Kim Basinger did that was so Oscar-worthy.... The performances are very good, though.",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's thrilling, tense, fully entertaining, beautifully designed and reconstructed and it offers three great, great performances (it's a lot of fun to even discuss who offers the best), but it leaves you absolutely nothing when it's finished.",
            "review_date": "2021-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely a great neo-noir!",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great script, that really shouldn't have worked as well as it did, granted the amount of characters and plotlines. Incredibly written main characters, that have more than one side to them. Superb neo-noir setting and visuals that leave 50's LA a casual backdrop to the story, instead of an overly stylized window dressing. Goldsmith's score is excellent as always.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The three main characters and their dynamic personalities really make this film a must-see. A movie with a complicated or on the verge of having a complicated plot is always an enjoyable watch as long as the film isn't too complicated. The art direction and cinematography are exceptional in the film.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just one of the greatest movies of all time. Practically flawless.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what movies were made for; good old-fashioned entertainment",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm struggling to think of any ways in which L.A. Confidential could be improved, so it's a 10/10 from me.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film Noir with outstanding performances from Russell Crowe and Guy Pearce.  It's interesting to watch characters with completely different values interact with each other.",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a star studded cast, this throw back crime drama hits all marks.  Guy, Kevin, Russell, Kim, Danny and the list continues... were very solid in their performances.  Good gritty, gumshoe type drama.  I enjoyed all the twists and turns on this ride.  I would classify this as a must see neatly tied up film.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the past 50 years.  Great film noir, epic detective flick.",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With perfectly written and acted characters, this film is a very good police story.",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential, Curtis Hanson's affectionate nod to the film noirs of yesteryear, is a movie that is virtually impossible to dislike.  The labyrinthine plot includes murder, rape, drugs, prostitution, good cops, bad cops and a host of other unseemly subjects but never loses its focus despite its incredible complexity.  The primary characters are three police officers (Guy Pearce, Kevin Spacey, Russell Crowe), each with their own distinct personal agendas and, thanks to the fantastic script and remarkable performances, fully developed personalities and motivations.  While there might be some temptation to take notes to keep things straight as the film unfolds, things wrap up nicely before the final credits roll.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best noir films of all time! Kim Basinger is a goddess!",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It takes its time, but when going at full-speed, L.A. Confidential stands the test of time as one of the greatest suspense thrillers.",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie mystery is amazing! One of the best crime movies ever!",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid crime noir with several twists. The acting was top notch, the plot was far fetched but entertaining, the pacing was reasonable, the action was well done, and the setting and props all looked authentic. However, you can argue that most of the characters were unlikeable, and the film did turn into a romance in places. The ending was also questionable. On the other hand, the cinematography, visual effects, and soundtrack were excellent.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoiler Alert\n\nOverrated.  Good cast, sets, and okay story.  But I thought several things were lacking.  The main characters were mostly unlikeable simps, all putting debauchery ahead of ethics.  The ending was cheesy.  The music could have been a lot better if they had used famous songs.  The story was a little far fetched.  It's hard to believe that cops, in their 50s and 60s with rank, would be interested in becoming crime kingpins, risking their careers and livelihoods.",
            "review_date": "2021-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, latter day gangster movie, only this time, it's the police who are the main protagonists. Elements of Heat of The Night and Mulholland, but far superior. Even at 3 hours, it doesn't let your interest wane for long. I found the meteoric rise of Exley far too incredulous, particularly surrounded by cops prepared to stab each other in the back at the drop of a hat. That being said, there are some stellar acting turns in this, right down to the bit part players.",
            "review_date": "2021-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece. This is what the great noir films of the late 40's and early 50's wanted to be but weren't allowed to be.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a good one. It has a great cast of actors AND characters and is a great thrilling ride. The characters are likeable and the story is also pretty good. I do kinda feel like the plot twist where Kevin Smith was a dirty cop was rushed but it was still good.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a lot of these older movies that get crazy high ratings and I've never heard of. So I try them because it's near unanimous that it's a good film. And I think it must be because a different generation saw them when they were new and liked them. And we haven't heard much of these movies since. They're maybe not on tv very often or whatever so we don't see a lot of them. So the older generation that saw them when they were new reviews them highly and there's no newer generation watching them and reviewing them negatively to regress that rating back toward the mean a little bit. I think that's the case with this movie. I just couldn't get into it. I'm not sure what is so interesting about it. Maybe it's just not for me.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still can't believe those two men take care of a whole troop so easily at the end. But happily the justice won.",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is brilliant a must watch crime film. I enjoyed every second of it.",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like shooting and action this thriller is for you.",
            "review_date": "2020-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "La Confidential has one of the best plot twists and environment.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not just the drama through all the film and the final twist, but the stellar cast and the finest performances give ‘L.A. Confidential' a perfect result.",
            "review_date": "2020-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great somewhat action lot of talking la noire movie starring Kevin spacey, Russell Crowe, guy Pearce, and some blonde lady off the street who won an Oscar for this movie, I wouldn't give her an Oscar but the academy is weird. So basically this movie is the video game to movie adaptation of la noire.",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In early 1950s Los Angeles, LAPD Sergeant Edmund \"Ed\" Exley (Guy Pearce) is determined to live up the reputation of his father, famed detective Preston Exley, who was killed by an unknown assailant whom Exley nicknamed \"Rollo Tomasi.\" Already isolated from other officers by his intelligence, work ethic, and idealism, he volunteers to testify against them in the \"Bloody Christmas\" case in exchange for promotion to detective lieutenant. He rejects Captain Dudley Smith's (James Cromwell) advice that a detective should be willing to beat a confession out of a suspect or shoot him in the back if necessary for the greater good. Plainclothes Officer Wendell \"Bud\" White (Russell Crowe), whom Exley considers a \"mindless thug,\" is obsessed with viciously punishing woman-beaters. White confronts former cop Leland \"Buzz\" Meeks, a driver for Pierce Patchett, whose Fleur-de-Lis service gives its prostitutes plastic surgery so they resemble film stars. White hates Exley because his partner, Dick Stensland, was fired thanks to Exley's testimony. With the city's gangland kingpin Mickey Cohen imprisoned for tax evasion, Smith recruits White to torture out-of-town criminals trying to gain a foothold in Los Angeles. Sergeant Jack Vincennes (Kevin Spacey) is a narcotics detective who moonlights as a technical advisor on Badge of Honor, a TV police drama series. Sid Hudgens (Danny DeVito), publisher of the Hush-Hush tabloid magazine, pays him to arrest celebrities whom Hudgens photographs for his magazine. Exley investigates an apparent botched robbery and multiple homicide at the \"Nite Owl\" coffee shop. Stensland was one of the victims. Exley and Vincennes arrest three African-Americans for the murders; they later escape from police custody and are killed by Exley in a shootout that also kills a fellow officer. Exley is decorated for bravery. However, a Mexican girl, Inez, who was raped by the African-American men around the time of the murders, admits to Exley that she falsely reported the time they left her in order to try to get them arrested for the Nite Owl massacre. She tells him that she \"did what she had to do for justice\" because otherwise \"nobody would care that they raped a Mexican girl from Boyle Heights.\" Exley realizes that this admission places their guilt for the Nite Owl murders in doubt. Although the police department considers the Nite Owl case solved, Exley and White independently investigate it and discover evidence of corruption...\n\nRotten Tomatoes critical consensus reads: \"Taut pacing, brilliantly dense writing and Oscar-worthy acting combine to produce a smart, popcorn-friendly thrill ride.\" Film critic Roger Ebert gave the film four out of four stars and described it as \"seductive and beautiful, cynical and twisted, and one of the best films of the year.\" He later included it as one of his \"Great Movies\" and described it as \"film noir, and so it is, but it is more: Unusually for a crime film, it deals with the psychology of the characters ... It contains all the elements of police action, but in a sharply clipped, more economical style; the action exists not for itself but to provide an arena for the personalities\". In her review for The New York Times, Janet Maslin wrote, \"Mr. Spacey is at his insinuating best, languid and debonair, in a much more offbeat performance than this film could have drawn from a more conventional star. And the two Australian actors, tightly wound Mr. Pearce and fiery, brawny Mr. Crowe, qualify as revelations.\" Desson Howe's review for The Washington Post praised the cast: \"Pearce makes a wonderful prude who gets progressively tougher and more jaded. New Zealand-born Crowe has a unique and sexy toughness; imagine Mickey Rourke without the attitude. Although she's playing a stock character, Basinger exudes a sort of chaste sultriness. Spacey is always enjoyable.\" In his review for The Globe and Mail, Liam Lacey wrote, \"The big star is Los Angeles itself. Like Roman Polanski's depiction of Los Angeles in the '30s in Chinatown, the atmosphere and detailed production design are a rich gel where the strands of narrative form.\" USA Today gave the film three and a half stars out of four, writing, \"It appears as if screenwriters Brian Helgeland and Curtis Hanson have pulled off a miracle in keeping multiple stories straight. Have they ever. Ellroy's novel has four extra layers of plot and three times as many characters ... the writers have trimmed unwieldy muscle, not just fat, and gotten away with it.\"\n\nCurtis Hanson´s gripping crime noir drama \"L.A. Confidential\" based on James Ellroy´s book is truly a treat still today. Great story with crime, corruption and justice as the centre pieces set in L.A. and with great characters and a great ensemble to portray them. The three main characters played by Russell Crowe, Guy Pearce and Kevin Spacey are all in top form and they all lift eachother to greatness in this film. Great direction by Curtis Hanson with James Ellroy's source material as the base and he manages to take us back to Los Angeles in the 50s via solid cinematography and great environments/props. The film grossed $126 million worldwide and was critically acclaimed. It was nominated for nine Academy Awards, including Best Picture, winning two: Best Supporting Actress (Kim Basinger) and Best Adapted Screenplay; Titanic won in every other category L.A. Confidential was nominated. In 2015, the United States Library of Congress selected L.A. Confidential for preservation in the National Film Registry as \"culturally, historically, or aesthetically significant\". \"L.A. Confidential\" is a fine piece of film in my book.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest take on the noir since the decline of the genre's heyday in the '50s (yes, Chinatown included), with fewer long stares into the distance and walks down deserted streets, instead substituting relentlessly engaging pacing and a host of interesting characters. Plenty of \"turn in your badge and gun\" and \"how's tricks?\" moments to provide the nostalgic atmosphere. Chock full of star power and commensurately great performances, even if it feels that some of the characters (particularly Basinger's Bracken and a bit of Crowe's White) feel sidelined at points to allow for Pearce to get additional screentime. One of the best aspects of this film - every character has at least one fatal flaw, resulting in a conflict of who is the \"least worse\", and an environment ripe with opportunism. Should appeal to both fans of the Bogart era and modern action aficionados alike. (5/5)",
            "review_date": "2020-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty close to perfect.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know a movie is great when i cant predict the whole thing.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way the story interconnects and brings everything together, paired with a 50's Hollywood backdrop = absolute winner.",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant depiction of film noir with direction that is fast-paced but still creates characters with depth and charm. The story is complex and mysterious, but worth it. Highly recommended when you are in the mood for a heated detective tale in a corrupt and seedy world.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good cop (person), bad cop (person), complex human nature",
            "review_date": "2020-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effective drama with a great cast and some equally great characters.",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see the influence a movie like this had on future video games like L.A. Noire.  Good movie overall.  Fast paced, well acted with fully realized characters.  Good handling of its time period as well.  I can't quite put my finger on why I didn't love it; could be because I felt it walked a very thin line between style and substance, leaning more on style for the most part.  It's an expertly crafted movie overall.  Check it out if you're into noir films, as this is a love letter to that subgenre.",
            "review_date": "2020-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neat and polished police thriller with a decent soundtrack. Not much to fault in the film but it's a simple mishmash of multiple cop thrillers, there's nothing unique or memorable about the film. Imagine I'll have forgotten the whole plot within a couple of months. Simple entertainment though.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite realistic in terms of how police treated investigations back in the day",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cop thriller done right",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece. If only all movies were made like this.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a fantastically entertaining movie that quite feels like it could've been made back in the 40s-50s! i can NEVER get enough of this film; one of my favorite movies of all time! as much as i can't STAND Kevin Spacey anymore, he's BEYOND BRILLIANT here, as is the luscious, sexy Kim Basinger (in one of her best performances EVER!) as the gorgeous \"Veronica Lake Lookalike\" Call Girl; she wholeheartedly and totally DESERVED the Supporting-Actress Oscar she won! one of the best films of the late 90s for sure!",
            "review_date": "2020-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart and captivating experience, that I would compare to \"Chinatown.\"",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A forgotten classic. Great story, cast, and action. I recommend this to anyone. It is an amazing movie.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential examines the corruption at the heart of the apparent paradise of 1950s Los Angeles through the eyes of three detectives -- the idealist Ed Exley, the brutal Bud White, and the sleazy Jack Vincennes. The intricate plot, well-written dialogue, and Oscar-worthy acting combine to create a mesmerizing neo-noir masterpiece.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great way to honor old classics!  This movie is definitely an old-school detective yarn, played exquisitely by each actor from Basinger to Rifkin .  If only there was a way to replace Kevin Spacey :(",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though Kim Basinger's character is a pointless developtment, the rest of the plot is really well-tied and the directing is precise.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great film. It's olny made better by the fact that it came out on the exact day I was born.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*SPOILERS AHEAD*\nL.A. Confidential, a new noir film, is a decent film. It is not awful, but it is not a great film either. The film has many good aspects, but many that take away from what the film could have been. It also fits every aspect of a noir film and lends itself greatly to the genre. \n\tThe acting in the film is average as well. Kevin Spacey, who plays Jack Vincennes, does an average job. His acting was done well, but there was no hint of any emotion or thought in his eyes. It drew away from the plot and intensity of many of the scenes. Russel Crowe is almost unrecognizable as Bud White. He plays the short-tempered, highly emotional, rebellious character, \"the bad cop\", very well. It is a nice thing to watch on the screen and he draws attention and holds it very well throughout the entire film. Guy Pearce, who plays Ed Exley, did an average job as well. He does a good job portraying the \"good cop\", but most of the time, he looks more psychotic and the villain of the film, until the true villain is revealed. Lynn Bracken also does a good job portraying the typical damsel, noir women. \n\tThen the casting of Danny Devito is overall very confusing. He is a very comedic actor and to place him in a very serious, intense film took away from it. It would have been better to cast someone like Johnny Depp or Morgan Freeman. DeVito must have been cast for comic relief to the intense film, but it didn't provide that and took away from the message and story in the film.\n\tNext, the sets and costumes do a very good job of portraying the 1950's. It is very easily recognizable and helped the film as well. Helgeland's screenplay however, is a little mis-written it seems. Many lines and phrases said in the film, appear way to modern to be said in the 1950's. \nThe plot of the film itself is very confusing itself and hard to follow along with until the very end of the film. The subplots take too long to come together into one major plot. It is hard to follow each subplot as well. The film definitely has Criminal Minds, Law and Order: SVU vibes, but it tries to push the plots to fill a movie length. But many aspects of the plot are admirable. The showing of police brutality, especially in the 1950's and what has occured in today's society, was very well done and important to be seen in the United States. Also having a part of the central crimes in the plot being a paid escort service was nicely done as well. It showed an aspect of society not really talked about or mentioned, when it is important to talk about in our modern society and how it was going on even in the 50s and hints at the industry being around before that as well.\nMany angles and scenes in the film were impressive as well, such as the shoot-out at the end and the interrogation of the three black suspects. They were very well done. The Bloody Christmas scene was well shot also, but hard to follow with the confusing plot, but the angles and camera work were very impressive in a lot of the film.\nThis film, when it was made, was trying to usher in a new noir era, but because of new crime television shows, it did not achieve it. This film definitely would have been better if it was turned into a tv series or mini series, like The Act. The noir era served better before the creation of television shows and modern dramas and while the effort is duly noted it was not very effective. \nFinally, the film was surely worth doing. It did test whether or not a new noir era could come into this century. It also showed newer audiences what a noir film is and gave a great nod to the noir era. The film also gave audiences an interest in crime dramas, as it was made in 1997, before many new crime television shows started and \"You heard it here…. On the Q.T., and very Hush Hush.\"",
            "review_date": "2020-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems like this movie is never talked about anymore, and I can't remember the last time I saw it come on pay cable.  But it is one of the all-time greats, and even should have won the Best Picture Oscar in my humble opinion.  (\"Titanic\" was very good, but not as good as \"L.A. Confidential\".)  It boasts one of the greatest casts in the history of cinema, and it is the movie that made Russell Crowe a star.  Russell's portrayal of Bud White is maybe the best thing about the movie, but the entire cast turns in outstanding performances--even Kim Basinger, as evidenced by her Oscar win.  The plot will keep you guessing--and although it gets convoluted, it never cheats (although you might have to watch it twice to catch all the nuances).  If you enjoy an intelligent, thought-provoking movie and somehow missed this one, then check it out now!  It is a 5-star movie all the way, I promise you!!",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A damn good noir film with a great cast and twists ",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only thing motivated to see this movie, Is the video game \"LA Noire\" but after watching this movie I came to know that video game might be made on based on this movie",
            "review_date": "2019-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great cast, I loved this movie!  Watched it again recently and it still seems so fresh.  Must see! ",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great actors. Great script. Great scenery of the L.A./Hollywood at this time. Great tension/thriller kind of atmosphere.",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So interesting and engaging, very well-written and perfectly cast. Each character is unique and remarkably characterized. Guy Pearce plays Ed Exley, the tightly-wound \"good\" cop with strict perceptions of morality, who is trying to live up to his father's standards. Russell Crowe plays Bud White, the intemperate \"bad\" cop, who isn't afraid to do whatever it takes to get the bad guys, even—no, especially if it includes violence. Kevin Spacey plays Jack Vincennes, the exhibitionist narcotics detective who seems to be in it for the money and the fame. On a list of the best all-time cop movies, L.A. Confidential is right up there with The French Connection.",
            "review_date": "2019-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bucket list film with an all-star cast and a thrilling story filled with turns that will have you on the edge of your seat ",
            "review_date": "2019-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very straightfoward, classic crime movie. Entertaining, but a few parts didn't age well for modern sensibilities.",
            "review_date": "2019-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "La Confidential is the 3rd best cops and criminals flick. Dirty Harry 1st. The Untouchables 2nd. And this 3rd.  ",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My familiarity with director Curtis Hanson largely came from the terrific films In Her Shoes (2005) and Wonder Boys (2000) before having seen this film but even with the tainting that the presence of Kevin Spacey brings to the film I think this may be his best film. I'm not usually a fan of crime drama films but this movie tells it's story so compellingly and features such memorable characters that you can't help but be drawn in. I would even venture to say that I think it is the best film nominated for Best Picture in 1997 and probably should have won over Titanic (1997) which I think makes a mockery of the romantic epic genre which I usually adore.\n\nThe by the book LAPD detective Ed Exley, Guy Pearce, teams up with the talented but combustible Bud White, Russell Crowe, as they attempt to defeat the perpetrators of the \"Bloody Christmas\" murders. They are diverted from their task when a rivalry develops between the two of them and their associate Detective Sergeant Jack Vincennes, Kevin Spacey, realizes that the murders that the murders of various prostitutes is related to police corruption. White begins a relationship with prostitute Lynn Bracken, Kim Basinger, while Exley and Vincennes find evidence of the corruption but it is revealed that it is their superior Captain Dudley Smith, James Cromwell, who is heading all of the corruption. Exley and White team up to take down all of those who head the corruption and both get their happy endings.\n\nThe film is obviously very stylish as it sets up a world in which L.A. is a sort of paradise even though it is just seething with criminality and potentially dodgy behavior hidden among the few self-righteous, moral individuals like Exley. I liked seeing all of the 1930s décor and costumes and especially the shots of various locales in Los Angeles as they feel as though they are capturing a very specific time and place and contribute to the moody, evocative feeling of the film. Even the police building which appears on screen several times sends a little thrill up your spine as the film builds tension which is sure to be unleashed in the workplace of these men who devote so much of their lives to their jobs which appear to dictate so much of their lives outside of their jobs and in their personal lives.\n\nThe plot is also skillfully pulled together by the screenwriters as we spend so much time confused at how all of these seemingly disparate events will connect to each other and yet the finale brings everything together. When it does reach it's exciting climax you are completely on board as you feel the deep anger of our three and eventually two protagonists at the wrongness of the institution they work within. I felt joy at their victory because their characters had been set up as more than just your average buddy cop pairing, we knew about these men and their personal lives, their relationships with women and their dead fathers. Even though it is difficult to root for Kevin Spacey the fact that his character also dies makes the film not necessarily as bad as it could have been. Films like Lethal Weapon (1987) don't have the impact that this film has because their characters seem so outlandish and are so hard to care about in addition to being surrounded by a less complex plot that is less gratifying when it gets wrapped up.\n\nThe one thing that I will fault about this film, is not really the fault of the film, but Kim Basinger's win for Best Supporting Actress has always irked me. I think she does very good work in Fool for Love (1985) but I would hardly call her a ‘great' actress and when nominated alongside performers like Julianne Moore in Boogie Nights (1997) and Joan Cusack in In and Out (1997) the weaknesses and flatness of her performance can be more closely dissected. I think she is very well used as she is convincing as the sort of beautiful older woman who could charm an angry young man into having a real relationship but there is never a moment where I am amazed by Basinger and her abilities.\n\nDespite my minor complaint I actually think that the film is fantastic and you should absolutely watch it.",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible, on so many levels. Actors give spectacular performances. The many subtleties make it a masterpiece.",
            "review_date": "2019-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I got the attention of L.A. Confidential, I immediately realise that it's directed by Curtis Hanson, the same guy who directed The Hand That Rocks the Cradle. It had some big stars in this like Kevin Spacey, Russell Crowe, Guy Pearce, Kim Basinger and Danny DeVito. It had a good story about three police officers and detectives investigating the \"Nite Owl case\" and other stuff. Kevin Spacey is Det. Sgt. Jack Vincennes who moonlights as a technical advisor on Badge of Honor, a popular TV police drama series. He is also providing Sid Hudgens, publisher of the Hush-Hush tabloid magazine. Russell Crowe is Officer Wendell \"Bud\" White who is in love with Lynn Bracken and he investigates the Nite Owl case where his partner is killed. Guy Pearce is Det. Lt. Edmund \"Ed\" Exley who is investigating the Nite Owl case. His father is murdered by a man who Exley nicknames \"Rollo Tomasi\". I kinda like the part where the police and criminals are fighting at \"Bloody Christmas\". The story is great and well written and it is faithful to the novel which is based on by James Ellroy. Kim Basinger is really good as Lynn Bracken, the directing style is immense when something goes wrong and the police are on the crime investigation and the cinematography is great. I know I say that quite a lot but what can I say? They immense. As much I loved it for it's story, directing, editing, art design and cinematography and everything about this. L.A. Confidential is a impeccable neo-noir crime film filled with characters, mystery and beautifully crafted set pieces. If you guys haven't seen it then I would definitely recommend you watch it. It is very good, really fantastic and very Hush-Hush.",
            "review_date": "2019-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "many people overlooked this one don't its a great movie",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great story. long with mostly talking but never lost my interest. well made, well acted, good dialogue, great characters. emotionally investing (about 2 viewings)",
            "review_date": "2019-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, quick and brilliantly written, LA Confidential captures the complex relationship between the police and the public (and also interrelationships between the police) in Los Angeles in the 1950s. The performances by all the actors were phenomenal and makes it hard to take your eyes off the film at any time. Brilliant!",
            "review_date": "2019-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "93%. 2/5/22: 2nd watch. Masterfully written, and great performances lead to a captivating mystery with a very satisfying end.",
            "review_date": "2019-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great.",
            "review_date": "2018-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crooked cops. The mystery and allure of Hollywood in the '50s. Death, double-crossing, and secret alliances. Paparazzi waiting to get that one breakthrough picture. These are just some of the elements that make Curtis Hanson's L.A. Confidential one of the most exhilarating noir thrillers to reach the screen in recent memory. With a script that pays homage to the films of the '40s and '50s and may remind some viewers of the likes of Chinatown, L.A. Confidential proves that every period piece thriller doesn't have to go the way of travesties like Mulholland falls. It takes L.A. Confidential nearly two and one-half hours to spin its tale, but the time passes remarkably quickly. There's hardly a wasted moment in the entire movie, and director Hanson maintains tight control of every scene.",
            "review_date": "2018-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly paced and shot movie that marries deep thought with entertainment like few can. The star studded casts give incredible performances and the cinematography and editing let the brilliant story come to life. Cinema in its purest form, a true classic and an absolute must see.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are these three cops ... Jack Vincennes (Kevin Spacey) is a mildly corrupt cop who loves his prime assignment as technical adviser for a television cop show.  Bud White (Russell Crowe) is a violent thug that consistently directs his violence to trying to good.  Ed Exley (Guy Pearce) is an extremely ambitious, straight arrow that nobody likes.  The three of them are thrown together on a case that involves a bunch of people shot to death in a diner, a ring of prostitutes who look like various movie stars and a large amount of missing heroin.  Anyone who's read any of James Elltoy's L.A. novels knows the joys buried in his densely plotted noir crime novels, and this is the only adaptation of his work that really does it justice.  It's highly streamlined, dropping quite a few plot threads from the novel, but that seems to be part of the reason it works so well.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite films of all time.A great adaptation from a complicated but yet great novel. A classic that everyone needs to see.",
            "review_date": "2018-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is truly the best movie of all time with its incredible direction, all star cast, killer script and a shootout scene that'll get your heart pumping. It's definitely a movie that everyone should see and should have won Best Picture and Director over \"Titanic.\"",
            "review_date": "2018-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you give a movie 6 stars?",
            "review_date": "2018-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good noir plot and execution. This is an engaging view that plays out like a 1940's detective novel.",
            "review_date": "2018-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it dips in the middle, LA Confidential's strong characters and complex plot carry it from arresting start to gripping finish.",
            "review_date": "2018-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies I've ever seen!",
            "review_date": "2018-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great somewhat action lot of talking la noire movie starring Kevin spacey, Russell Crowe, guy Pearce, and some blonde lady off the street who won an Oscar for this movie, I wouldn't give her an Oscar but the academy is weird. So basically this movie is the video game to movie adaptation of la noire.",
            "review_date": "2018-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense direction, smart writing and an all star cast make L.A. Confidential a neo-noir masterpiece of cinema ",
            "review_date": "2018-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 50s cop thriller with twists, turns, and plenty of action.",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently revisited this one. Absolute 10/10 noir. At the time, development was hesitant to cast Crowe and Pearce, due to their unfamiliarity. Fortunately for them, they did a knock-out job. Easily on my short list.",
            "review_date": "2018-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. Full of intrigue and a great whodunnit story line.",
            "review_date": "2018-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A-. I could definitely watch this again and still enjoy it. It had some surprising twists (and I always appreciate when a movie's plot can throw me off from the predictable).  It was well paced/fast-paced; not beating around the bush for the slow thinker to figure things out. It doesn't baby the viewer or insult their intelligence like many films. The acting was good too. It did have a few clichés though.",
            "review_date": "2018-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When we see the city that attracts all to come to such places when beauty, fame, drugs, money and affordable family households bring those from far places to this place when it is booming. When we see such place everyone goes to read up on all the headlineattractions we see it features all the low and high places of Hollywood's rich and famous doing bad things. When what the top finest police officers are attracted to in such places are those who are low & dirty to see they are behind bars. When what placeÂ we see attracts readers we see the relationship between low and high places working together when everybody gets what they want. When what others see in high places they know they are not attracted by the underhandedness those belong to.Â \n\nWhen we see what attraction we hold for our fellow officer to show those their rightful place to go beyond the law. When we see for others what attracts them to law are being in such place they hold the badge to its highest regard when its meant for righteousnessÂ & justice. When what we see such places of law hold are places those are attracted to, when its violence, corruption, women, loyalty, righteousness and payouts. When there are plenty of news in such places we don't see and do see to know what is out is attractedÂ what's happening out and what's in is attracted to whats in when those who got a good thing they don't want to be on the out and out and in and out.Â ",
            "review_date": "2018-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly good and well portrayed throughout. Excellent performances and well worth the time taken to watch this movie.",
            "review_date": "2018-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every scene perfect, amazing pacing.",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting good. Script, not so much. Audio was terrible.",
            "review_date": "2018-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A neo noir that, like Chinatown, delves into the corrupt underbelly of glitzy Los Angeles; but the similarities end there.  Whereas Chinatown is taut and intimate L.A. Confidential is bruising and boisterous, bursting at the seams with barely-contained violence.  With fully-realized characters and an expansive, intricate plot L.A. Confidential is a rare Hollywood hybrid that functions as both a thought-provoking character study and exciting popcorn fare.",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the most perfect cop story ever put on film.",
            "review_date": "2018-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "come to los angeles..\n\nL.A. Confidential\n\nA well set out webs of sub-plots that is ready to flip on cue with some awe-struck moments and brilliant performances, L.A. Confidential is that rare crime-drama that puts spotlight on scary issues.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have to choose between this and Chinatown, do yourself a favor.  Destroy the Chinatown dvd and go with this.  The Hollywood ending takes away slightly from the impact of the story but the plot keeps your attention.",
            "review_date": "2018-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have knocked 20 minutes off without suffering, but otherwise great",
            "review_date": "2018-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "****\n'L.A. Confidential' is an excellent crime-noir, and has all the ingredients you would expect from such a genre: great acting, a twisty-turney overly-complicated plot, a love interest, and plenty of shoot-outs. It's well-made and engaging, and features a classic score and impressive cinematography. It's not perfect - the ending is a little weak, I thought. Without spoiling anything, I think it would have been much better to reveal the truth instead, and this would have been more in-line with the characters also. Despite this, it's still a great watch and a classic noir that should be seen.",
            "review_date": "2017-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A Confidential is a near-great film because it's in the 90's, and it recreatesthe film noir of the 50's, and, that's exactly when the film takes place. The glam, the labyrinthine complexity of the story, the crime, the corruption, nothing misses.",
            "review_date": "2017-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shoulda beat Titanic for best picture. One of the greatest movies ever made.",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great flick with a great cast! Possibly Guy Pearces best performance in a movie?!",
            "review_date": "2017-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With top-notch performances, a brilliantly written and complex plot with great twists, as well as a huge amount of development within the arcs of the multiple characters, 'L.A. Confidential' is a masterpiece of modern-day noir cinema. Despite so much going on, it's never confusing or messy, not wasting any screen time on something that doesn't advance the story. It's atmospheric and wildly entertaining with everything coming together for an explosive finale that will have you thrilled to no end.",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is another film-noir inspired masterpiece that reminds us why many films take influence in the genre's style",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is an incredible movie. Curtis Hanson does a fantastic job of directing this movie. He somehow manages to merge three different cops storylines all perfectly together with each other. This is definitely an old school crime noir film.  The acting is fantastic from Guy Pierce, Russell Crowe, and Kim Basinger. This film has a great script, fantastic cinematography, and amazing acting. This film will keep you on the edge of your seat and you are always guessing to who the bad guy is. My only flaw with the film is that I wish they would of ended it a few minuets before because I disliked a decision they made that felt a little unbelievable, other than that this is a perfect film. This is a must see film! One of the great crime drama's of all time!",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had a hard time understanding the many characters. A second viewing might allow me to fully appreciate this film, but I don't think a second viewing will happen.",
            "review_date": "2017-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-paced and unpredictable, LA Confidential makes good use of its impressive script.",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good movie, where the characters have their own unique personality and style that conflicts with one another, but works out well for everyone to work together. Great Film",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is very well acted by its great cast, but otherwise immensely boring and almost unwatchable, weakly developed in characters, so uninspired and needlessly complicated in its storyline and technically not that well made too. It is one of the most overrated films I have ever seen and I am thoroughly baffled at why everyone loves it so much.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good noir film that brought the world russel crowe and guy pierce",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a Chinese spectator, I can not  admire more when it comes to L.A.Confidential in many regards. Without a single detail missed, the director delivered us a complex but tremendous clear- cut story full of many kinds of characters, more precisely, different faces of sorts of men who work as a same title: policeman, plus the picturesque motion image of L.A. especially,that L.A. in 1950s. the movie definitely push the boundary ahead with regard the same category. \n\nThree different cops, say, Edmond is that politician kind who wholeheartedly want to climb to the top of heap, never give a damn about rumors that may come from his colleagues, and officer Bud, who believe that justice must be served and maintained only by violence, because this is what those villains do to the society, which should be used against them either. Sergeant Jack, who works as a real movie star in the bureau for the reason that he just always can grab some tabloid information and can bust scandal stars by privately collaborate with  so-called \"Hush-hush\" magazine''s editor.\n\nIn my view, these three policemen are by no meas technically that exemplar-kind, they all in a way lost themselves as time goes. However, a vital point: Night-Owl murder case somehow connected them to each other, and just because of this, some signs of human nature were made appearing as the deep dive into that case goes. Take one line for example. \" Why'd you become a cop?\", a simple but evocative and profound question must arouse that conscience which may have long gone in Jack's heart. Of course, such a veteran like Jack impossibly forgot his motivation, but that doesn't matter, what matters was that he must realize he should take his own responsibility for his job's sake, and we do not have to bother pointing out the inside change of Edmond. Ironically, a man died in front of a gun who not long before had done asking another man \"even if it means paying the consequences\", while the latter probably was flirting with that hooker and enjoying his time. Maybe, in a way, we can consider it a sign indicates accomplishing one heavy task sometimes brings a certain risk either, the screenplay just chose Jack and wrote this character dead. Till the end, Bud got what he yearned for and so did Edmond. Power and women, two seems by any means undetachable elements made their different ways head to two different people's palms, and that indeed made this impeccable thriller open exciting new territory while still basing on classic structure of police-and-bandit film.\n\nL.A. Confidential, deserves no less than four-stars ranking if totally reaches no more than five. Well-designed screenplay(albeit it based on that novel), fantastic performance of characters, ravishing landscape, impeccable background music, all without exception made this movie stand out.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both the film and score are easy equals, and great companion pieces, to Chinatown. A bevy of supporting star talent allows Pearce to shine in his own starmaking turn.",
            "review_date": "2017-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movie of all time. I love that the tree main characters have different personality's",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film has a complex and at times mystifying plot involving organized crime's decline in Los Angeles and the dirty cops who fill the power vacuum thus created. Each cop and detective gets their own distinct personality and character which drives the story. It also makes for a rich portrait of a workplace in that the culture of the LAPD is exposed and shown to be a product of the identities of the officers who make it up and the decisions they make when confronted with conflicts and roadblocks to their ambitions. There's suspense, wonderful ensemble acting, a great soundtrack, and well-chosen settings that make a great portrait of postwar Los Angeles. This film is a loving tribute to the worlds and the styles of Film Noir and Raymond Chandler garnished with more contemporary attitudes towards the police.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really great noir thriller.  The story locks us in from the first moment and doesn't let us go until the odd coda.  Everything works beautifully in this film, but special kudos to great performances from all the leads and even the secondary actors.  They are all portraying great characters, and do it beautifully.  It is impossible to choose the best from amongst Crowe, Pearce, Spacey, Basinger, DeVito and Cromwell.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie for SO many reasons. Always the right thing to watch in any situation.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pacing can sometimes slow to a crawl, but when it gets good, it gets GOOD! B",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A juicy and entertaining little noir that somehow manages to never putter or trip up.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two years after delivering us the great The Usual Suspects (1995), Kevin Spacey goes on this other epic crime adventure, with the help of impressive actors, Guy Pearce and Russel Crow. L.A Confidential is a wise movie, with even some suspenseful moments, which is more common in horror movies than serious crime movies, some entertaining gun fights and bloody scenes, and the 1950's settings was a terrific choice, it sets the mood just right. Recommended !!",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is a prime example of a crime movie. It manages to keep  keep a long storyline exciting throughout the whole movie and bring across an atmosphere the viewer can really feel himself into. Enemies become friends and friends become enemies, but L.A. Confidential extends imaginations of a corrupt political system to new dimensions. When the pursuit for justice becomes self defense or even revenge, L.A. Confidential is just getting started.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the novel of the same name by James Ellroy. A strong, well made, well cast, American crime drama set in the 1950s. Guy Pearce, Russell Crowe, James Cromwell, Kevin Spacey, and Kim Basinger all help to make this film memorable.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I got to say about \"L.A. Confidential\" is that it's the massively memorable crime drama/thriller of the year of 1997. \"It's very engaging, entertaining, unpredictable and a total knockout.\" The performances by the cast is well acted. \"This ensemble cast give award winning performances in this film!\" The directing by the late Curtis Hanson is very well directed. The screenplay by Brian Helgeland and also co-written by the late Curtis Hanson is flawless. The cinematography and choreography is great. The score by Jerry Goldsmith is good. Finally, the effects are good as well. \"I have to report that \"L.A. Confidential\" is a unmissable. - An instant classic movie!\"",
            "review_date": "2016-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good as an LA crime drama can get. Once it starts it never stops.",
            "review_date": "2016-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was no stopping Titanic in 1997, iceberg be damned. James Cameron's epic disaster movie had all the momentum of the times, and yet it's a smaller movie that captured more of the critics and was far more deserving of the ultimate Oscar prizes that year. L.A. Confidential was based upon a James Ellroy novel that many argued was unfilmable. Enter journeyman director Curtis Hanson and novice screenwriter Brian Helgeland, and the pair stripped the book down from eight main characters to three, kept the spirit and essence of the book alive while rearranging the storylines for large-scale popcorn thrills. It's been nearly twenty years since L.A. Confidential first seduced big screen audiences and its powers are still as alluring to this day. It's a neo noir masterpiece.\n\nIn 1950s Los Angeles, not all is what it seems. The captain of the police, Dudley Smith (James Cromwell), is looking to keep the peace in the City of Angels as outside criminal elements are looking to fill the void from Mickey Cohen going to prison. Three police officers of very different stripes find themselves on the edges of a complicated murder case stemming from a massacre at the Nite Owl cafe. Ed Exley (Guy Pearce) is the son of a famous police captain and wants to rise up the ranks as quickly as possible. He's a political animal and unafraid of ruffling feathers. Bud White (Russell Crowe) is a bruiser of a man who enforces his own level of justice when it comes to men who beat or harass women. Jack Vincennes (Kevin Spacey) is a happily shady officer who serves as a consultant for a hit TV police procedural. The Night Owl case takes them into many sordid corridors of sex, money, and power, including Lynn Bracken (Kim Basinger), part of Pierce Pratchett's (David Strathairn) stable of prostitutes meant to look like movie stars, the mysterious self-serving sources to tabloid journalist Sid Hudgens (Danny DeVito), and good cops and bad cops on the controversial L.A. police force.\n\nThis movie is a master class in plotting and structure, enough that it should be taught in film schools. By nature noir plots are meant to be busy and mysterious, and a guarantee for mystery is a Byzantine plot full of plenty of suspects, dispirit elements, and strange coincidences that eventually coalesce into a larger picture. The beauty of what Hanson and Helgeland have done is that they have made the script complex yet accessible, able to lose one's self in the tangled web of intrigue but still able to see how all the myriad pieces fit perfectly together by the conclusion. There is an efficiency to the screenwriting that is mesmerizing. It all seems so effortless when you're with storytellers this gifted or who have a divine connection to the source material. Forgoing the customary slow builds of recent film noir like the oft-cited Chinatown, L.A. Confidential just moves from the opening narration. Within the first 25 minutes, the movie has expertly set up all three of its main characters, what defines them, their separate goals, the obstacles in place, and previews how they will intersect into one another's orbit, and then the Nite Owl case explodes. Every scene drives this narrative forward. Every scene reveals a little more depth to our characters or fleshes out a superb supporting cast. Every scene cements that contradictory theme of the glitzy allure and unseemly darkness of the post-war City of Angels. My only quibble is that before the truncated third act the movie resorts to a few easy shortcuts but by that point Hanson and Helgeland had more than earned their paces. This is one of the greatest modern screenplays, period (WGA listed it as #60 all-time).\n\nThere are so many remarkably assured sequences but I want to emphasize one in particular - Exley's interrogation of the three Nite Owl suspects. \"Oh I'll break him,\" Exley promises his superior before entering into the first interrogation room. At first you're with the other officers and morbidly curious with his arrogance. By the end, your jaw hangs in amazement at the intuitive pressure this man is expertly applying. It's a terrific moment that allows Exley to masterfully manipulate three different men, taking pieces and running toward accurate insinuations, building momentum and clarity. Each man is different and each man offers a new piece of the overall puzzle. A slight reference by one unlocks another's confession. An overheard sound byte pushes another into self-defense. I'm convinced it was this scene that ensured robust and thorough interrogation was a crucial element of the gameplay for the 2011 video game L.A. Noire, a noble misfire that definitely looked to replicate Hanson's film as a user experience.\n\nNoir is one film genre with a visual code that can get the best of directors, but Hanson played this to his advantage. Classic noir is filled with criminal activity and the allure of sex and violence, typified perhaps best in the position of the untrustworthy but oh-so-sexy femme fatale. Yet the majority of film noir was produced in an era of censorship thanks to the implementation of the notorious Hayes Code, making sure that audiences didn't enjoy the sordid elements too far. Free of these restrictions, some modern filmmakers take the opportunity to revisit the noir landscape and fill in the blanks of old, furnishing an outpouring of unrestrained exploitation elements. Brian DePalma's 2006 film The Black Dahlia (also based on an Ellroy novel) gets drunk on this mission, though \"restrained\" has never been a word I would associate with DePalma's filmmaking anyway. My point, dear reader, is that it's easy to get lost in the superficial trappings of the genre: sexy dames, corrupt lawmen, temptation, shootouts, schemes, and chiaroscuro lighting. It's easy to dabble in these elements because they're so nostalgic and celebrated.\n\nHanson did something different with his 1997 masterpiece. He builds upon the audience expectations with noir but he doesn't let his complex story and characters come second to the visual spectacle of the famous genre. L.A. Confidential is in many ways a movie that straddles lines; old and new, indie and Hollywood classicism, and film noir and drama. It's an adult film that doesn't downplay its darkness, brutality, and moral ambiguity, yet when it comes to those exploitation elements, especially sex, it's almost chaste. The relationship between Lynn and Bud seems refreshingly square, like it was pulled from Old Hollywood. The entire movie feels that way, an artifact that could exist any decade.\n\nHanson was something of a journeyman for most of his career, directing competent thrillers like The Hand That Rocks the Cradle and The River Wild. As Variety film critic Owen Gleiberman wrote in his eulogy for Hanson (he died in September 2016, a fact I shamefully didn't know until writing this review), after 25 years in the industry the man became an earth-rattling auteur after the age of 50. That is a rarity. Who knew the guy had something this singularly brilliant within his grasp his entire career? The care he puts into the screen is evident from the opening montage onward. There's an elusive magic to the filmmaking on display, a bracingly divine sense of how to move the camera for best effect, how to escalate and deescalate audience nerves. He knows his story structure and characters inside and out, but he also knows how to play an audience. His time making serviceable studio thrillers certainly helps him during the film's climax, a bloody shootout that's also a mini-siege thriller.\n\nHanson also assembled an incredible crew to enable his vision. The technical elements recreate the early 1950s L.A. time period with beguiling immediacy; the cinematography by Dante Spinotti (Heat) gives a sense of the darker elements just under the surface without having to overly rely upon the film language of staid noir visuals. Peter Honess' sharp editing provides a downright Thelma Schoonmaker-esque musical orchestration to the proceedings, especially as the multiple storylines and developments spill onto one another. Speaking of music, the score by Jerry Goldsmith (Star Trek) is thick with the jazzy overtones of the genre. It's a score that simmers with sexual tension and malevolence. The casting director deserves a lifetime free pass. There are a whopping 80 speaking parts in the movie, and each person is a great hire that builds a richer film.\n\nWhile the plot of L.A. Confidential sucks you in right away, its characters take hold the strongest. Film noir is one genre that has a codified cheat sheet of character archetypes, and this movie fulfills and subverts them, finding surprising and gratifying ways to further round out these figures into complex and nuanced human beings. The three main characters all provide a different approach to law enforcement and when we see them start to work together it's a wholly wonderful turn of events. Bud is the muscle, Exley is the brain, and Vincennes is the charm, and each one attacks the Nite Owl case and its subsequent leads from different angles that best apply to their set of skills. Each of the three characters discovers new pieces of evidence, new contacts and suspects, and when they start to work together it not only provides a payoff with the combined evidence but with the satisfying nature of their teamwork. That's because they become better people when they work together and each moves closer to some moral redemption.\n\nBud is the loyal cop with a hair trigger and a penchant for being a white knight to abused women. His personal history of abuse makes him seek justice, often by his own fists. He has a rigid moral code of right and wrong and isn't afraid to cross lines to achieve it. He's also tired of being a bully and wants to be more than just the muscle. Exley is a straight arrow with a strong sense of moral righteousness and a mind for politics. He knows how to play sides for his own gain. He's not afraid of making enemies within the department, and his opportunistic choices create many. He's trying to forge his own path outside the shadow of his father, a famous lawman who was gunned down by a random purse-snatcher (\"Rollo Tamassi\"). He has to learn that he can't do everything on his own. Finally, Vincennes is in many ways the face of the department as an ambassador to the world of TV and film. He's succumbed fully to the glamour of Hollywood but he's also full of profound self-loathing, trying to count how many compromises he's made in life and where it's gotten him. The appeal of the old life is crumbling and his detective instincts are reawakened, spurring Vincennes into the fray and surprising even himself. It's extremely rare for any movie to successfully develop more than one protagonist, let alone three, and yet L.A. Confidential achieves this milestone so that when we alternate perspectives there isn't a drop in viewer interest. Each man brings something different and interesting, each man reveals new hidden depths, and each character is fascinating to watch in this setting.\n\nThe gifted actors take the already excellent written material and elevate it even further, turning an already sterling movie into one of the all-time greats. Almost twenty years later, it's fun to see these famous actors when they were young and, arguably, in their prime. Spacey (House of Cards) was on a tear at this point in his career, between his two well-deserved Oscar wins, and having the time of his life in every role. His character seemingly has the least complexity, a man who knows he's sold out but believes himself to be enjoying the ride, but Spacey offers poignant glimpses of the man behind all that oily charm and sly glances. There's a scene where he stumbles across a mistake of his making and the subtle, haunted expression playing across his face is amazing. The man was capable of expressing so much, and still is. Crowe was still a couple years from his big breakout in 2000's Gladiator but he put himself on the Hollywood map as Bud White. He's a coil of anger and pain looking for an outlet, and Crowe is magnetic as hell. His glowers could burn right through you. Pearce (Memento) was another knockout that solidified leading man status thanks to his performance as the rigidly self-righteous Exley. He's a character that thinks he's above moral reproach, and his humbling is a necessary part of solving the case. Exley is constantly surprising his peers and it feels like Pearce does the same, showing exciting new capabilities from scene to scene, from his stirring hire-wire act with the interrogation scene to his understated glimmer of fear through a poker face. These three performances are golden.\n\nNobody better represents sleaze than Danny DeVito's character and the man brings a merry lechery to his tabloid journalist/exposition device. His unquenchable thirst for the worst in humanity to sell more papers feels even more sadly relevant given the media climate that contributed to the recent presidential election. Kim Basinger (Batman) won an Oscar for her somber performance, which reinvigorated her career. She's good but I can't help but feel that she won the Oscar in a weak field (my choice would be Julianne Moore for Boogie Nights). David Strathairn (Good Night, and Good Luck) is enjoyably nonplussed as a man who specializes in delivering vice. James Cromwell used every bit of audience warmth associated as the loveable farmer from Babe and used that to his advantage. His pragmatic police captain is a father figure for Exley and the audience and perfectly sets up a turn that leaves the audience spinning even twenty years later.\n\nThere are little details the could go unnoticed but confirm for me just how much thought was put into L.A. Confidential. Exley is chided by his superiors for wearing glasses as they think it makes him look weak. As the film develops and he gets more immersed in the Nite Owl case, his compulsions against violence and rash judgment start to waver about the same time he stops wearing his glasses, a subtle symbol of his difficulty to see things for what they truly are. I enjoyed that our introduction to Lynn is in a liquor store and she's wearing a winter cloak that strongly resembles a nun's habit. It's a memorable costuming choice and also suggest Lynn's penchant for straddling the line of devotion. The Patchett \"whatever your heart desires\" line of high-class prostitutes has allusions to our current media culture of celebrity worship and personalized sexual fantasies. It naturally ties into the exploitation of the dream factory of Hollywood that takes young ingénues with dreams in their head and squashes them pitilessly. It's not the first film to explore the darker side of the film industry but that doesn't make its themes lesser.\n\nL.A. Confidential feels like the noir thrillers of old but stripped down to its essentials and given a new engine. It's something that celebrates noir thrillers of old and Old Hollywood but it isn't so lavish to either the genre or older time period that it loses sight of its own storytelling goals. The elaborate plot is complex and intensely engaging while still being accessible, populated with memorable and incredibly well developed characters, each given their own purpose and own insights that contribute to the larger whole. Hanson's lasting accomplishment is a near-perfect masterpiece to the power of story structure and characterization. The three lead detectives are compelling on their own terms and the movie keeps them separate long enough that when they do come together it feels like a payoff all its own. Hanson recreates the world of classic film noir and makes it his own, using new Hollywood to lovingly recreate Old Hollywood. It's the kind of movie I can watch again and again and discover new depths. It gave way to a wave of success for its participants. Hanson never quite delivered another movie on the level of L.A. Confidential, though I'll posit that In Her Shoes is an underrated character piece. Helgeland has become a go-to screenwriter for many projects low (The Postman) and high (Mystic River) and became a director for A Knight's Tale and 42. It's a movie that plays just as strongly today as it did almost twenty years ago, and that's the mesmerizing power of great storytelling and acting. L.A. Confidential is a lasting achievement that proves once more the power of our darker impulses. It's stylish, seductive, smart, subversive, and everything you could ask for in a movie.\n\nNate's Grade: A",
            "review_date": "2016-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More than just a murder mystery movie with a wonderful cast, this film shines in a way I haven't seen in quite some time. I watched it because of its similarities to a newer movie I had my eyes on \"The Nice Guys\", and while that film is good, this one takes the cake.  The perfectly capture that old school Film Noir feel, without being beholden to the time period. If it wasn't for some of the set details and props, this could be a movie set in 1997. Its based on a series of novels and never got a sequel. It is almost unlike anything else I've seen recently, as far as successful cop movies go. No stories in the 2010's have as much mystery and suspense in them.\n\nOf course there is corruption in the police force and one of our main characters is out to wade through all of that regardless of the consequences. The ensemble cast does a bang up job, with the new comers (at the time) Pierce and Crowe carrying this movie brilliantly and Kevin Spacey + Kim Basinger doing great work as well. Kim won an Oscar for her performance.  The eventual three-way romance was a little forced but this movie had a ton of things to do in 2 hours.  How could one forget Danny Devito? Playing a sleazy tabloid journalist, who still brings his brand of gravel voiced humor to this relatively serious role. \n\nLA Confidential had over 80 speaking roles and balances them well, with characters leaving their mark and eventually coming back up as a point of reference, moving the story forward. There were also many different plot threads that do not get too convoluted as the story goes, which is a problem with many films today. The mystery keeps you hanging on and an hour in you are still curious to who the antagonist is. But when you find out, you are then stuck with wondering how they would ever take them down.  The characters are flawed, real humans with motivations that many other cop movies have, but acted to perfection.",
            "review_date": "2016-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is a 1997 American neo-noir crime film directed, produced and co-written by Curtis Hanson.. \nThis new-noir crime film contains many well-known actors. It is a well-paced story, with a few twists and turns along the way. I thought that there were a few scenes towards the end which didn't quite fit, but overall this is an enjoyable and well-acted film. \nAAN 1001",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Age or repeat viewings don't dull the impact of this movie. If anything it gets better. Absolute classic.",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pulplier than when pulp went to pulptown, only higher class. A modern noir (not neo, since it's really too similar to the original noir films), it's a textbook in how to make a movie's visuals enhance the tone. Intense and bright, often simultaneously, it's violence is consistently surprising as it explores the moral ambiguity of justice with huge side of bubblegum. Like a season of golden-era TV shoved into 2.5 hours, its unwieldy, engaging, and fun.",
            "review_date": "2016-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie, simple as that.",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie! This is such a great adaptation of the novel, trimming down the sprawling story to fit the big screen and keeping all of the suspense. Crime noir at it's absolute best!",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Frankly I consider this movie as perfect both in cast as in its script and development.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An awesome crime film.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great noir style atmosphere that keeps you on your toes as you follow through the investigation of the multilayered characters.",
            "review_date": "2016-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I can't poke any holes in this film - casting is good, pacing moves, story is well-told - I just didn't like it.  Fundamentally, I think it simply comes down to my not gravitating toward the look and feel of this type of film nor did I care for the subject matter.  The story then didn't resonate enough for me to stay fully engaged the entire time.",
            "review_date": "2016-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe, Guy Pearce, Kevin Spacey and Kim Basinger perform top notch in a 50's noir cop drama!",
            "review_date": "2016-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This modern film noir is the closest we'll get to the gems of the 1940s and 1950s. The look, the feel, and the mood of films such as The Killing, Double Indemnity, and The Maltese Falcon are all excised in L.A. Confidential. Films with an all star cast usually never live up to the hype or expectations, but this one does.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1950's style noir with terrific pacing: Spacey, Crowe, Pearce and Basinger enough said",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To me this is the best film of 1997.  It perfectly blends nostalgic film noir with a griity police story, set in the center of the movie world of Los Angeles.  The dialogue bristles with bite and the suprises are refreshingly...unexpected. A real triumph.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent script and interesting characters make for a fun neo-noir thriller",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, well-acted and slick.",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Astonishing movie. The story is original and so well-written, the characters are all captivating and and fun to watch in different ways, the direction is beautiful, truly capturing the dark essence on the beautiful background of Los Angeles during the 50s, and the performances are all perfect, each one doing well go make us feel for the characters, especially Crowe and Pearce in their breakout roles.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern film-noir done perfectly right. Truly breathtaking!",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down my favourite movie.",
            "review_date": "2016-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most perfect films ever made",
            "review_date": "2016-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting film that morphs into a homo erotic bromance between Bud and Ed with Lynn as the surrogate.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I came to see because I live in LA. Movie is ok",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterfully written, and great performances lead to a captivating mystery with a very satisfying end.",
            "review_date": "2016-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent screenplay and gun shootouts throughout. Captures the period very well.",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, engrossing, intriguing, superbly acted and sexy - L.A. Confidential's wanderings through morality and corruption on the police force has a grip strong enough to match its noir predecessors.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is nearly flawless and instantly moved to the top of my personal favorite's. I say even my top 25",
            "review_date": "2016-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly excellent period piece that pays tribute to old school hardboiled detective films. Firstly, the movie is dripping with atmosphere - fully engulfing you in this world of betrayal and violence. But of course what truly sells it are the performances. There's not a dud in this cast and everyone brings their A-game, especially Kevin Spacey as the sleazy Detective Vincennes. One thing that should be said though: make sure that you stay focused on the film from beginning to end. The dense plot and mystery can be difficult to follow if you're not paying 100% attention. To some, this can understandably be a detriment, but it's still no excuse to miss it.\nWho would like it? If you love gangster or cop dramas, noirs, or the players involved, then you won't be disappointed. Again, be warned though, watch it on a night when you're mentally prepared.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "B\nGood cop movie, predictable to the end though, good not great suspense",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The least obscure film noir ever.",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one's def up there with the greats of all time!",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film benefits from a sophisticated plot and a star filled cast.",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This screewrite hasn't mistakes, it's perfect. \n\n10/10",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting characters and awesome plot twists. Crime movie plays to its best.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Benefiting from strong writing and effortless performances, this brilliant neo-noir follows not one, not two, but three 1950s L.A. detectives.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Detective story, murder, mystery, suspense, thriller all of the ingredients that make a worthwhile ride for myself and I am surprised this was never under my radar. I loved the pacing and the scenes were gripping from start to finish. Simply great, no more words need to be added.",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice modern noir, a splendid homage to the classic film noirs and the 50's generally. Notice the music that resembles On The Waterfront.",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic movie that never hides what it really is, a damn good detective story.",
            "review_date": "2015-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Radiating confidence beat for white knuckle beat, this expertly sharp shooted adaptation of James Ellroy's brilliantly Byzantine slice of L.A. Noir is as much a high-minded mystery as it is sinfully entertaining. One quarter of the crime fiction maestro's LA Quartet (The Black Dahlia, The Big Nowhere, and White Jazz round out this A-Level book series), the novel is smart, serpentine, and seemingly too unwieldly to transcribe for the screen. Screenwriter Brian Helgeland, however, somehow hard-boils the dense puzzler and rich - practically living and breathing - characters at its center into a boozy black confection. Speaking of black, darkness bleeds into every frame - be it location or metaphorical - but this motion picture isn't steeped in shadows as a noir throwback. Rather, director Curtis Hanson frames the action with a very modern approach, naturalistic lighting and period detail as background but never lauded over at the front and center. No, that spot gets reserved for the hard-hitting star-making performances, be it Russell Crowe's feral blunt-force cop, Guy Pearce's bookish scheming detective, Kevin Spacey's slick angle-playing dick, James Cromwell's political blarney-spewing police captain, Danny DeVito's mischievious sleazy tabloid writer, or Kim Bassinger's manipulative femme fatale (deservedly Oscar-winning). The pace emerges as the true star, however. Impossibly, Hanson and Helgeland turn this ridiculously complex nearly 500-page thriller into a taut 138-minute police chase, cynicism and seduction fully intact.\n\nIn this R-rated detective tale set in 1950s LA, three policemen - one strait-laced (Pearce), one brutal (Crowe), and one sleazy (Spacey) - investigate a series of murders with their own brand of justice.\n\nChinatown rules this roost. That said, LA Confidential will always get compared with Roman Polanski's 1974 LA Noir classic, the crown jewel of hard-boiled detective tales on film. Whether a compliment or backhanded compliment, this comparison short-sights the shear genius of translating Ellroy's wholly unique style. Stripped down in words but somehow loaded with ripe, ridiculously researched detail, his prose seems spare but packs a deeply and multiply rooted punch. It's easy to characterize him as a Dashiell Hammett or Raymond Chandler aping scribe, but his immersive plotting takes readers to an entirely new and involving mantle of crime writing. Granted, it's a dark cab ride but the fact that Hanson and Helgeland short-cut the dense wordsmithing without losing the pulp speaks highly of their adaptation. They capture his jazzy verve using a modern edge that pits us all on a 5-Star collision course with one of the most absorbing City of Fallen Angels films of all time.\n\nBottom line: Asphalt Jungle Love",
            "review_date": "2015-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director, Curtis Hanson (The River Wild, and 8 Mile) directs a crime thriller set in the 1950's. This film is filled with a great cast of actors who all deliver great and powerful performances. This film is filled with suspense and has some great and intense action sequences sprinkled throughout. This film is a modern take on noir films set in the 1950's, and is based off of the James Ellroy novel, L.A. Confidential. This is one great leap for director, Curtis Hanson, as he's directed some pretty great films (The Bedroom Window, The Hand That Rocks the Cradle, The River Wild, 8 Mile, etc.) The list goes on. This is a must see for everyone!",
            "review_date": "2015-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got around to watching for the first time. Supremely entertaining \"neo-noir\" thriller with fantastic cast (Russell Crowe, Guy Pearce, Kevin Spacey, Kim Basinger, and others). Won 2 Oscars but could have won many more if it wasn't up against that year's mega-blockbuster, \"Titanic.\"",
            "review_date": "2015-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is quite possibly my favorite movie of all time. All the performances are fantastic and the crime that our \"heroes\", Kevin Spacey, Russell Crowe and Guy Pearce, get caught up in. It's also impossible to mention Kim Basinger's stellar performance which carries the entire movie. Highly recommend to anyone who's a fan of crime movies.",
            "review_date": "2015-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is an amazing detective/ mystery movie that is near perfect. This film is an absolute masterpiece and one of the best ever made. This film has a really great cast and everyone is fantastic, you have Russell Crowe, Guy Pearce, Kevin Spacey, Kim Basinger and Danny De Vito. The acting is phenomenal and all the characters are very likable. Russell Crowe is fantastic as the hot head officer who doesn't follow the rules too much. Guy Pearce was amazing as the officer who just wants to do good and follow the rules, he was probably my favorite character in the film. Kevin Spacey was brilliant, I love how he starts the film as the asshole, fairly corrupt cop but by the end he's so likeable and one of the best characters. Kim Basinger is also brilliant, her character is somewhat cliche and she's not in it as much as I thought she would be but she was still great. This film is fantastically directed by Curtis Hanson, I can't think of anything else he's done but he directed this film so well. This movie gets the time period really well and it's also brilliantly shot and gorgeous to watch. This film is also really tense, there are loads of twists and turns and you have no clue who to trust. This is also really funny, there are some really funny bits with Kevin Spacey, there's also a really funny scene with Guy Pearce and Kevin Spacey questioning a woman in a bar that was really funny. The finale of this film is brilliant, the hotel shoot out is great and the ending is very satisfying. L.A. Confidental is an amazing film that everyone should see. It has great acting, great writing, great direction, it's just a masterpiece and I can't really any think of any major problems. It's one of my favorite films. A+",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yesssss Guy Pearce yessss. Good movie. Hard hitting, grimy and fast paced. Also a whole bunch of great actors. One of those movies that's really devoted to just men and doesn't care about anything else. Lot's of those out there, huh?",
            "review_date": "2015-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It feels a little messy to start because of the way it jumps, but when it all ties together in the classic fashion, its very satisfying. Some great leads (no pun) and a stylish setting make the film very watchable",
            "review_date": "2015-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A Confidential  is one of those rare movies that has a great cast of famous actors and a good plot. Three detectives who investigate a murder of a police-officer all unite and yet have different agendas. The corruption and easiness of committing a crime from the 50's spring out in this movie. It makes you think how much we take for granted in the 21st century when it comes to crime and government. I was at a total shock to see who died in the movie. Totally didn't see it coming and thought it was legendary.",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal film, held together by the brilliant triumvirate of Spacey, Crowe and Pearce - in that order. Basinger is solid as the femme fatale, but not at all Oscar worthy.",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"L.A. Confidential\" is a noir film done so well, and executed so flawlessly, that one can barely classify it as such.  The closest thing to \"Chinatown\" made in the last twenty years...",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a cast.  \nNow that's a story deliciously told.",
            "review_date": "2015-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely entertaining mystery which had me thrilled and intrigued until the very end. Nearly 5 stars on this one.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sharp as a tack and constantly gripping. Fabulous performances from all of its well-rounded cast.",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With great performances throughout its impressive cast and an intriguing mystery it is well worth the watch.",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast, but the story was not captivating enough for me.",
            "review_date": "2015-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like Goodfellas and Chinatown, this is another crime drama that I watched and wasn't wowed by, though I enjoyed it well enough. Maybe it's another case in which I'd have to see it when it first came out to really understand its influence.\n\nI enjoyed the second half a lot more than the first half. In general a lot of the movie was convoluted, although I blame myself more than the actual movie for not fully understanding how all the pieces fit together. I'd probably enjoy it more upon rewatch, because I felt a little disoriented throughout my first watch, trying to juggle the characters and motivations.\n\nEverything snapped more into place for me when Exley and Jack teamed up, and even more when Exley and Bud teamed up. I like the idea of having three different cop protagonists all involved in their own cases, exploring different leads that tie together in interesting ways (another thing that would undoubtedly fascinate me more during a second viewing). The various dynamics among the three men are interesting because there's no one who's completely likable. Exley is probably the most likable, with his strict morals, but he's also selfish and manipulates his bosses to get the promotion he desires. And stoic Bud is violent and occasionally seemingly unemotional, but his violence is for a good cause when he's putting away abusive husbands and rapists. So when Bud attacks Exley and then the two team up, it's satisfying and surprising, because each of the protagonists has been relegated to their own private storylines, investigating the same things in different ways.\n\nI liked the Exley and Bud team-up, and I like how the movie ended, especially with the climactic battle with them trapped inside the house. And I definitely liked Exley finally deciding to do something outside his strict moral code, shooting Dudley in cold blood because he knows Dudley would probably be able to weasel out of culpability. So though some of the movie was a bit hard for me to follow, and though Bud's survival at the end seems a little fakey, I definitely finished the movie with a positive opinion about it.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my top 22 films",
            "review_date": "2015-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very entertaining type noir detective film with a great cast, story and acting.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good as ever for a mystery.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the years best movies,this crime drama has it all...great characters,slick story and no wasted motion or time.",
            "review_date": "2015-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best police thriller ever seen!!",
            "review_date": "2015-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie, with some great Australian actors.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gets more and more interesting as the story and mystery truly unfolds and as more layers are introduced. Definitely a classic of the crime-drama genre.",
            "review_date": "2015-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A+... from start to finish.",
            "review_date": "2015-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished watching L.A. Confidential. Wow! Such an amazing crime-drama movie! I am impressed. And what a twist!",
            "review_date": "2015-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love a good murder mystery, but L.A. Confidential is a great one. What really makes this film shine is the fact that, even when the truth becomes obvious and there's no mystery left, I was still on the edge of my seat waiting to see what happened next. I can't remember the last film that had me this engaged to the point where I couldn't stop watching even for a moment. I think at the time Guy Pearce was a relatively unknown actor, but this role was a perfect way to introduce himself to Hollywood. He plays Ed Exley with this intriguing mix of determination and integrity. You never know what to expect next from this character because he seems to be simultaneously interested only in himself, and interested in upholding the law to the letter. I've never been a huge fan of Russell Crowe's acting, but if you're going to use him, this kind of lunk-head enforcer role is great. He doesn't have to portray the kind of nuance that many of the other roles require, so he is excellent as Bud White. And I have learned to expect nothing less than perfection when movies have Kevin Spacey in the cast list. I don't even know what to say, but his performance as Jack Vincennes is 100% spot-on, even his mannerisms in the jailhouse brawl fit his character perfectly.\n\nThere's lots of other cast members I could go on and on about in L.A. Confidential. James Cromwell is great, Danny Devito is wonderful, etc. However the only flaw I found in the film was Kim Basinger. I was not impressed with her performance because she seems to hold only one or two expressions throughout the movie, and I struggled to ever pin down whether we were supposed to think she was having real emotional reactions or if everything was an act. Her entire role in the film felt somewhat tacked on as if we needed a femme fatale in order to further shoehorn this movie into the film noir genre. That's not to say I didn't appreciate some of the ways they incorporated her into the plot. Using her as the catalyst to get Bud White angry with Ed Exley was a stroke of scripting genius. In fact with all the praise I've heaped on the cast, the script writers deserve infinitely more. They crafted a great story that is loaded with unexpected twists and turns, and it holds together extremely well looking back on it. Many murder mysteries with plot twists tend to feel a bit contrived at some point and fail to make sense when you scrutinize them in any way. This seems like a film that will excite me just as much on a second viewing, and it is definitely one that I want to watch again. L.A. Confidential is a great film that was both thrilling and intriguing, and it made more than 2 hours fly by as if it was no time at all.",
            "review_date": "2015-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible writing, amazing acting, and immersive set pieces come together to create one of the best films of the 90's.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A period piece and a cop film rolled all in one? Yes please, and featuring some of the defining actors of our time while they were still coming into their own, L.A. Confidential is a genre defining piece of work.\n\nNo scene goes wasted in the film, filled with fast-paced action to accompany strong dialogue. The cop movies of the 2000's borrow much from L.A. Confidential, but don't do the genre justice quite in the direct and lean way of this film. Guy Pearce must be singled out for his restrained yet captivating role as Lt. Exley, while James Cromwell plays a fine elder role.\n\nLike an onion, the layers of the film insist on the viewer's peeling, which makes the ride that much more fun. L.A. Confidential is a movie that should and will be remembered.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just 100% riveting and phenomenal acting.",
            "review_date": "2015-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie with a good plot and fantastic cast of actors. It's based in an era where cops were tough and corruption was considered getting the job done. Need more movies like this.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This neo-noir flick about police corruption in 1950s Los Angeles is a great way to spend an evening. Pretty much everything works in this film from the performances from it's top notch cast, to the set and costume design, to the tight script that perfectly builds up it's mystery and seemingly unconnected tangents into a wonderfully constructed end. Any fan of mysteries or film-noir will get a kick out of this exquisitely made film.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nicely done background!",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't remember how good it could have been in 1997, sorry. Digital era saved the cinema...",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly suspenseful film noir with some great direction from Curtis Hanson. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It manages to capture all the essence that makes a movie great. Oscar level performances along with great direction puts this up there amongst the great crime dramas of all time.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really stilish and enthralling noir crime story.",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good 50's style cop movie with a modernized take.",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect crime thriller that can keep you on the edge of your seat.",
            "review_date": "2015-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense crime thriller with many twists and a complicated but well structured plot. Set in the fifites LA Confidential has a perfect cast composed of Guy Pearce , Russel Crowe , DeVito, KIm Basinger  and Kevin Spacey.",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard not to admire L.A. Confidential for its sophisticated screenplay and solid performances - Pearce at his staunchest, Basinger at her most sensational, and perhaps Crowe at his most sympathetic.",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is a terrific thriller with excellent acting, direction and characters.",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guy Pearce is one lucky man. I rarely use the word \"classic\" when speaking of any films of made in the last tweny years but two of his films are easily modern noir classic - Chris Nolan's Memento and this. L.A. Confidential is a masterpiece built around brilliant writing and impeccable acting all around.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(46%)\nI cannot help but feel that this is more than a touch overrated. And although it is a good movie without much doubt, I just don't understand the buckets of a admiration that so many people have towards it. Yes it's well made and acted, but it's also flat, overly long, and quite a joyless watch too, while the plot is nothing that hasn't been done many times before with its good cop caught between his corrupt allies and superiors. One thing that this does do well is that it feels like an actual portrayal of the darker side of life back then, even compared to the original movies of that period, with its swear laden script and more explicitly sleazy elements that wouldn't have passed through the censors back in the 40s-early 50's. This overall thanks to its better elements is worth a look, but I don't feel it's the modern classic many claim it to be.",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best noir movie to come out in a very long time. Guy Pearce and Russell Crowe knock it out of the ball park.",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most well written movies ever made. I was hooked from beginning to end.  if you enjoy well crafted mystery thrillers, check out this one. it's a must see.",
            "review_date": "2014-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I finally watched the 1950's police drama L.A. Confidential. I am not a fan of police movies as the films are often ridiculous.  Setting the movie in the 50's offsets much of this problem for me as police work in the 50's is nothing like it is now, so the errors are not as glaring.  That may be one reason that I loved this movie despite the overall premise.\n\nThe movie is visually striking.  The cinematography and lighting are beautiful.  The set design and costumes are excellent.  Basinger's costumes and makeup were excellent.  \n \nThe film had great fleshed out characters.  Each of the protagonists had their flaws. Bud White (Crowe) has good intentions, but has fallen victim to noble cause corruption.  Jack Vincennes (Spacey) also wants to do the same thing but seeks the trappings of stardom and that he sees and is willing to bend the rules to achieve them.  Ed Exley (Pearce) comes across as the straightlaced idealist but in reality he is actually the most complex and pragmatic character.  He is unwilling to plant evidence or beat someone into confessing but he is willing to lie to cover up the truth if he can gain prestige by doing so.  They combine efforts to see that justice is served and the truth comes out; only to cover it up, ostensibly for the greater good.  Basinger was 44 when the film was released.  By Hollywood standards that is older for a sexy starlet.   The makeup and costuming choices for her showed that she is a little older but still amazing sexy.  The effect was to show that her character, a celebrity lookalike prostitute, is past her prime but still a beauty.  Her bedroom shows that she still wants to be the innocent dreamer she was when she left Arizona and headed to L.A.\n \nThe film is rich and highly entertaining.  I give it 5 / 5 (Must See).",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Chinatown unsurpassable as entertainment. First film I realized how good Mssrs Crowe and Pearce were. Devito Bassinger and Spacey ethics also are superb in a wonderful adaptation of a great Ellroy novel.",
            "review_date": "2014-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this for the 2nd time. And 17 years I now really can appreciate it. Brilliant film!",
            "review_date": "2014-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With standout performances from the burly Crowe and the textbook Pearce LA confidential is a smart, absorbing and suspensful thriller",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot has more twists than a pretzel! And it's just as tasty!",
            "review_date": "2014-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the 90s, and that's saying a lot as that particular decade experienced a renaissance in film.  There is so much to love about this movie and not just the great noir story and great acting from an incredible ensemble.  There is so much attention to detail with costuming, sets, locations, and art direction that it's just a gorgeous film to watch.  If only all Hollywood films could be so efficient in combining style, quality, and entertainment in such an effective fashion.",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, engaging and complex, Hanson combines a great cast and a stellar writing department to create a thrilling crime epic.",
            "review_date": "2014-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the most riveting ,suspenseful, and charismatic neo noir crime, mystery, drama with even more riveting performances from a huge dominating cast which includes Guy Pierce,Russell Crowe,Kevin Spacey,Danny DeVito,James Cromwell,and (the woman who won the oscar for her supporting role in this film) Kim Basinger.",
            "review_date": "2014-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Takes multiple viewings to truly appreciate. Rolo Tomassi!",
            "review_date": "2014-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a really underrated film for its time. review to come",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. I can't believe that I didn't get to see it until 17 years after it came out. Very good acting by Crowe and Spacey. Excellent.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential is very enjoyable if you can keep up with the fast pace and quick dialogue. The script is smart, but still delivers on the thrills a mystery suspense movie should have. On top of that the film features very strong performances across the board.",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Great characters.",
            "review_date": "2014-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film with all-around fantastic performances. What I enjoyed most about it was that it had wonderful pacing, and is filled with gritty visuals.",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though entertaining and well paced this film isn't memorable in the slightest. The film is like on fast forward not letting anything sink in. Another problem lies where in most movies you can identify with a key scene or object. (Forrest Gump: Chocolates, American Beauty: Rose Pedals) This one sadly doesn't have any. It reminded me of Chinatown... a bit too much.. you know watch that instead.",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It falters towards the end, but a slew of fine performances, character interplay, and neo-noir style bring out the dark vibrancy of L.A. Confidential.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very intriguing, well-directed, well-acted movie.  Awesome cast here for sure.",
            "review_date": "2014-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film great cast with a great story.",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"L.A. Confidential\" is an utterly engrossing neo-noir thrill ride, combining classic noir elements with stylish violence, a terrific script, a brilliant cast and a breathtaking plot.\n\nSet around 3 cops in the L.A.P.D. during the early 1950's, we follow a strict by-the-book detective, a tough-as-nails cynic and the classic \"Hollywood\" detective as they work through a web of corruption and deception as they attempt to discover the source of a spate of murders, following the incarceration of local crime boss Mickey Cohen. There are more twists and turns than on a rollercoaster, leading to some intriguing places.\n\nThe cast is top notch. The three cops are played by Russell Crowe, Guy Pearce and Kevin Spacey, and they are backed by a strong supporting cast that includes Kim Basinger, James Cromwell, Danny DeVito, David Strathairn and Ron Rifkin. (For fans of \"The Mentalist\", it also features an early performance by Simon Baker).\n\nIt truly is a brilliant watch, and the stylish violence mixed with classic noir gives it a timeless feel. In fact, if I had to describe this film in one word, it would be Hollywood.\n\nOne of the greats.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LA Confidential is a spotless and classy film, offering entertainment, top notch performances, excellent settings, perfect pace and a well crafted storyline. Truly one of the great crime dramas.",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"L.A Confidential\" is one of the most riveting cop dramas ever put on film. It really is a true gem and worthy of all the praise it has received since it's release. The performances here are top notch especially from Russell Crowe, Guy Pearce, Kevin Spacey, and Kim Basinger who are all at the top of their game here. The script is really good and has a lot of smart dialogue in it. The film has a really good and well-thought out plot as well. It also has some great cinematography in it as well. As the film progresses we get to know more and more about the characters and their jobs which makes us feel like we're on this journey with them and it's like we're experiencing their dilemmas and not just watching it from our seats outside of the film. The only problem I had with it was that it was a little slow at the beginning and it took about 15 minutes to get going. But that's a minor complaint in an otherwise fantastic cop drama that had me riveted from start to finish. Definitely make sure you give this film a look.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Film noir. Whats great about the film are the three characters. No matter who you are in the audience, you're still able to identify with at least one of these detectives",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an enthralling plot with a star studded cast that deliver elite performances there is nothing to hate about this movie",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nI was impressed with L.A. Confidential, though not as much as I wanted to be. The film' story is not easy to completely comprehend, there are details in there that could only be picked up if one has seen the film enough times and gives it the attention it deserves; I was only able to pick up a couple of things but I did find it difficult to wrap my entire brain around it, this was the same feeling I had when I first watched Chinatown. The film's plot is definitely interesting, one doesn't have to completely understand it to know that, and I was happy with the fact that the film doesn't repeat itself in order to remind us what the objective is; if you didn't pay enough attention then too bad. I guess I regretted not giving this film the attention it deserves. The film shows us the life of a policeman in Los Angeles, we are able to see it from all sides via its three protagonists; Jack Vincennes, Wendell \"Bud\" White, & Edmund Exley. The film establishes its characters through their actions rather than what they think or feel, as it never allows us to get in too deep with its characters. This approach allows us to feel immerse in its atmosphere rather than spend most of our time contemplating about our characters. Though I am not trying to say the characters are written in shallow fashion, as the film does spend enough time with them and allows each one to be distinguishable. Curtis Hanson, the film's director, is primarily more concerned with the film's look and feel rather than giving us something uniquely deep. The film takes inspirations from many of the classic film noirs and crime films, but elevates it to the standards of contemporary cinema. The first thing I noticed when coming into this film was its sense of style, one can truly feel its presence and the film knows it is trying to be homage to the noir/crime genre; the style definitely kept me engaged with the film, I didn't care if I only understood very little of the story because I was more interested in absorbing the cinematography handled by Dante Spinotti and score composed by Jerry Goldsmith. The aspect of the film that impressed me the most is the acting. There are some damn good performances in this film, particularly Kevin Spacey, Guy Pearce and Russell Crowe. They played their roles with such intensity and also awareness, as Hanson wanted the slight banality in their performances to pay homage to the classic noir figures. I was a little disappointed with Kim Basinger as her performance felt a little empty, making it difficult for me to care for her character, regardless of how important she actually is to the plot. L.A. Confidential has its ups and its downs but the negatives aren't enough to stop me from wanting to go back to the world that Curtis Hanson has created here.",
            "review_date": "2014-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my new favorites.",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exploring the circumstances of good men undergoing corruption and the need for necessary evils in effectively serving out justice, L.A. Confidential is both a throwback noir echoing the brilliance of 1974's Chinatown and a morality tale told with a distinct finesse. It is intelligent, stylish, well paced, provocative, well acted, and entertaining.",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When your combining the actors in this movie along with it's sizzling script - the result is nothing short of high octane fun. \n\nCrowe, spacey, Pearce, Cromwell all show the big guns in the field of acting here. Every time one of these characters are on the screen it's mesmerizing. The adaptation proved to be a very worthy installment. \n\nThe script has balance gritty cop drama, with murder mystery suspense, all while balancing a love story. The acting choices make this story prove worth the ride. Very intriguing and vice gripping story and performances make this crime story one for the ages.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Won two Oscar's.  great movie",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Film-making 101. This is perfection - acting, story, editing, cinematography, score, period-setting and costumes. Mr. Hanson hit the home-run with this one. And, I'm at a loss of words how Titanic won the Best Picture at 1998 Academy Awards over this gem!",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neo-noir doesn't get much better than this.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only reason this masterpiece lost all of its well-deserving Oscars was because it was in competition with an overrated epic.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With enough crackling dialogue to help audiences through the convoluted script, and star turns by Crowe, Pearce, Spacey and Cromwell, LA Confidential is a prime neo-noir crime classic.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything comes together perfectly in this film, Rolo Tomassi.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a Film.\nIncredible Acting, Writing, & Direction\nVery Compelling and Well Paced Story\nAnd Suspenseful Development make this one of the best films I've ever seen.\n10/10 (A+)",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enough characters to fill half a dozen movies. But its biggest achievement lies in its ability to develop them and allow the audience to look at the world through their eyes. This story about crime, deceit and corruption with masterful performances by Spacey, Crowe and Pearce delivers at every level and is as satisfying as a cup of hot chocolate on a cold winter's night. Great watch!",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, thrilling crime drama with powerful leads and a vivid story.",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Densely layered and visually enriching.",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Densely layered and visually enriching.",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this when it was first released and love it. Russell Crowe is full of repressed rage and Kevin Spacey is at his sneaky best. Watching it again on TV it has stood the test of time. Very reminiscent of Chinatown with its story of corruption and lust in the underbelly of 1950s Hollywood. One if my all time favs.",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly acted, incredibly well written and filled with tension. The result:  L.A. Confidential is a captivating crime drama done right.",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie it has everything",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weirdly, out of all the performances, Kim Basingers was easily the most forgettable, and yet she won an Academy award for it. Most have been a terrible year for supporting actress performances. \n\nAnd her character is probably my biggest flaw with the film. So bland. And yet we are supposed to see her appeal as to why the characters want her. OTHERWISE. I very good noir movie.",
            "review_date": "2014-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A. Confidential (1997) - 8,5\n\nThrilling, funny, intelligent, powerful and a feast to the eyes, I only have praise to shout about the movie's ability to entertain. Haven't seen such an accomplished cop thriller in a long time, I'd say that in \"L.A. Confidential\" the formula was polished to near perfection. Money, corruption, personal interests, crime, moral struggles, sex, media, public opinion and even Hollywood, many of the traditional ingredients of the genre are explored, albeit vulgarly, in a sapiently dense script. This movie overflows with contagious charm stemming from the mixture of typical Hollywood narrative profile, well acted characters, wonderful cinematography that flirts neo-noir visual, scenic style reminiscent of David O. Russel and Scorcese, soundtrack that couldn't possibly complement the pictures in motion any better and a captivating plot with the necessary twists. Although there's nothing really new here, the cinematic accomplishment of this movie never fails to keep me engaged in the story, either at the edge of my seat or in indulgent contemplation. All in all, everything very well crafted in a movie that rides us through unexpected ordeals against organised crime in the City of Angels. Directed by Curtis Hanson, \"L.A. Confidential\" is the ideal popcorn movie for me, entertains like few others, nothing distracts from the experience, it's accessible yet smart ... and has a very happy ending so it doesn't hurt anyone's feelings (just in case...). Jokes aside, top-notch entertainment hands in hands with fine cinematic craft cannot go wrong. I enjoyed Kevin Spacey very much, such a great talented actor playing Jack Vincennes with humor and charm to spare. Great stuff, recommended!",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting is its strongest point, but you can't overlook the clever story and dark photography.",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest American thrillers of the 90's!",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "L.A Confidential explores everything in the underground world from drug users, corrupt cops, intelligent prostitutes and just about everything else in between. Guy Pearce, Russell Crowe, Kevin Spacey and Kim Basinger lead the charge in this epic portrayal of underground Los Angeles in the 1950's.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a film! Worth seeing twice because of all the characters involved. The performances were right on point and the plot was very intriguing",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies during the 90's solid story and amazing performances kim basinger was stunning she deserves the academy award that she got for her role",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I waited a long time to watch this and I wasn't disappointed. Stellar cast and acting. Classic story. Tightly edited.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid Neo-noir thriller whose weak point is its sometimes unengaging and disjointed plot. However the cast, the script, and the tone of the film are all impeccable, creating a movie which demands to be seen.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        }
    ]
}