{
    "title": "Evil Dead II",
    "rating": 8.2,
    "release_date": "1987-03-13",
    "genre": [
        "Mystery",
        "Thriller",
        "Fantasy",
        "Horror",
        "Comedy"
    ],
    "summary": "Ash (Campbell), the sole survivor of \"The Evil Dead,\" continues his struggle with the forces of the dead, with his girlfriend Linda. The two discover a mysterious tape recorder and hear the voice of Professor Knoby reciting passages from the Necronomicon, or Book of the Dead. The professor's words invoke a spell that unleashes the spirit ofAsh (Campbell), the sole survivor of \"The Evil Dead,\" continues his struggle with the forces of the dead, with his girlfriend Linda. The two discover a mysterious tape recorder and hear the voice of Professor Knoby reciting passages from the Necronomicon, or Book of the Dead. The professor's words invoke a spell that unleashes the spirit of evil alive in the remote forest surrounding them. Watch in terror as the plot sickens and the supernatural demons invade the cabin on a gory crusade for human victims. In desperation, Ash attempts to escape his horrific fate by battling with the gruesome ghouls with the help of some unexpected visitors. However, he discovers that he is no match for the unspeakable creatures lurking behind every door, and waiting beyond every corner. (Anchor Bay Entertainment)… Expand",
    "critic_reviews": [
        "The gaudily gory, virtuoso, hyper-kinetic horror sequel/remake uses every trick in the cinematic book, and confirms that Bruce Campbell and Raimi are gods.",
        "Using the same breathless pacing, rushing camera movements and nerve-jangling sound effects as before, Raimi drags us screaming into his cinematic funhouse. Delirious, demented and diabolically funny.",
        "Thanks to Sam Raimi’s inventive style and Bruce Campbell’s hysterical performance, the horror-comedy genre has grown into a legitimate genre, but Evil Dead 2 will forever be the king.",
        "I wholeheartedly love Evil Dead II. It's a great midnight movie, and one of the best horror-comedies ever made.",
        "In many ways even more hellish and stylish than its predecessor... A horror cult classic.",
        "Not so much a follow-up as a ruthless self-parody, Evil Dead II ranks as one of the most visually inventive, relentless, and truly original films ever made.",
        "But Evil Dead 2's rampant inventiveness and manic energy have ensured that it will endure as a cult classic.",
        "For those with a taste for outrageousness and an appetite for horror, there's no juicier meal than the Evil Dead movies.",
        "Sam Raimi’s sequel/remake is full-on gore slapstick, more Tex Avery than Dario Argento.",
        "The grubby, low-budget intensity of the film gives it a lovable quality that high-tech movies wouldn't have.",
        "A deliriously cinematic experience for those with a taste for Grand Guignol, this is a relentlessly energetic nightmare world where quite literally anything can happen--and does.",
        "More an absurdist comedy than a horror film, Evil Dead II is a flashy good-natured display of special effects and scare tactics so extreme they can only be taken for laughs.",
        "The acting is straight out of '50s B movies. The exposition is clumsy, the sound track corny, the denouement silly. Then again, who said bad taste was easy? [13 Apr 1987, Style, p.b4]",
        "The effects are just as delirious this time around, but the nightmare poetry has vanished, along with the sense of archetypal purpose and narrative inevitability that held the jack-in-the-box original together."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Horror films don't get much better than this. Perfectly balances slap-stick comedy and horror. It's hard to believe the director of Spider-man Sam Raimi got his start here. My favorite horror movie by far.",
            "review_date": "2011-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is possibly one of the wackiest and hilarious films ever released. Sam Raimi returns once again to the horrors of the Book of the Dead, along with star Bruce Campbell, the king of B-movies. The plot is pretty much the same as theThis movie is possibly one of the wackiest and hilarious films ever released. Sam Raimi returns once again to the horrors of the Book of the Dead, along with star Bruce Campbell, the king of B-movies. The plot is pretty much the same as the original; Ash and his girlfriend Linda  venture to a cabin in the middle of a dark and unidentified forest. Ash finds a strange looking book and when he recites passages from it, he ressurects a dark spirit in the woods, and summons all kinds of crazy demons and monsters. The blood flies in some very imaginative ways. Heads get lopped off, demons get blown up and numerous people get zombified. It also has a focus on comedy thats just adds to how entertaining this movie really is. In sum, a great movie to watch on Halloween night an one of the most unique horror films around.",
            "review_date": "2011-04-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Truly the wackiest and funniest film on this planet. Raimi and Campbell rock. They should make Evil Dead IV. The eyeball scene rocks. Raimi may have made a brilliant Spiderman but his Evil Dead series are his original masterpiece. It should Truly the wackiest and funniest film on this planet. Raimi and Campbell rock. They should make Evil Dead IV. The eyeball scene rocks. Raimi may have made a brilliant Spiderman but his Evil Dead series are his original masterpiece. It should win Oscar for Best Actor Campbell, best Director, Raimi and Best Costume Design.",
            "review_date": "2006-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead 2 is a remake/sequel that replaces the dark humour of the first film with a more slapstick approach that the series becomes well known for later on. I still prefer the original over it but Evil Dead 2 is and always will be aEvil Dead 2 is a remake/sequel that replaces the dark humour of the first film with a more slapstick approach that the series becomes well known for later on. I still prefer the original over it but Evil Dead 2 is and always will be a fantastic sequel that lives up to the original.",
            "review_date": "2013-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't get it, I just don't get. I read everywhere that this was an awesome movie, Empire says; from what I believe are user votes, that this was the 46 or something best film out of 500. I know that doesn't entirely mean that it is thatI don't get it, I just don't get. I read everywhere that this was an awesome movie, Empire says; from what I believe are user votes, that this was the 46 or something best film out of 500. I know that doesn't entirely mean that it is that good just because a magazine says so. But this was so interesting, I had to watch, and when I did, I was so confused. So from what I can tell this is the first horror movie to include intentional laughs in it, even before scream. So I thought: well this will be fun to watch. When it was done though, I had this feeling of me just not understanding why people love this movie so much. Personally I think the last one was okay, it definitely scared me at certain parts and was real gross. The same can be said for this; in my opinion. There're moments where it's being funny, more so than the last one, but only at one or two moments. This is probably most appreciated by those who really love horror, or just understand film a bit more than I do. Until I do understand, this film will be listed as: okay, in my book.",
            "review_date": "2013-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "After The Evil Dead, Sam Raimi wanted to fix up the series and, create something different. A remake/sequel of The Evil Dead, Evil Dead II is one of the best comedies of the 80s.",
            "review_date": "2018-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A little too much, cheesy and gory. But entertaining and I had some good laughs.",
            "review_date": "2019-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a staple of our Halloween season in my house.  My daughter and I watch it every year and absolutely LOVE it!  Creepy yet cheezy and a whole lot of fun to watch!  Our favorite scenes are when Ash battles his own hand.  Tons of BloodThis is a staple of our Halloween season in my house.  My daughter and I watch it every year and absolutely LOVE it!  Creepy yet cheezy and a whole lot of fun to watch!  Our favorite scenes are when Ash battles his own hand.  Tons of Blood and Laughs!",
            "review_date": "2011-11-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead 2 is a delightful mix of eye-popping gore, wacky special effects, hilarious slapstick comedy, deliciously campy dialogue, and Bruce Campbell's best performance yet. Groovy.",
            "review_date": "2013-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "With amped up production value comes a perfect blend of black comedy, horror, nostalgia and unbeatable atmosphere. Great cinematography and direction from Sam Raimi and Bruce Campbell gives a fantastic hammed up performance as Ash a long withWith amped up production value comes a perfect blend of black comedy, horror, nostalgia and unbeatable atmosphere. Great cinematography and direction from Sam Raimi and Bruce Campbell gives a fantastic hammed up performance as Ash a long with the films hilarious comedic tone. A great, if not the best entry in the awesome franchise.",
            "review_date": "2013-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Funny and sometimes cheesy (intentionally), yet with Campbell in the lead this movie is just a cult classic. Raimi made a perfect blend of horror, haunted-house and dark-comedy movie, with a really nice atmosphere and special effects. OverallFunny and sometimes cheesy (intentionally), yet with Campbell in the lead this movie is just a cult classic. Raimi made a perfect blend of horror, haunted-house and dark-comedy movie, with a really nice atmosphere and special effects. Overall recommended.",
            "review_date": "2013-03-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Compelling horror/comedy sequel to the intense, terrifying original.  The acting could be better, but the effects are top knotch and the direction is brilliant.  Bruce Campbell is a comedic genius.  His physical comedy is inspiring andCompelling horror/comedy sequel to the intense, terrifying original.  The acting could be better, but the effects are top knotch and the direction is brilliant.  Bruce Campbell is a comedic genius.  His physical comedy is inspiring and entertaining to watch.",
            "review_date": "2012-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis surpasses the original one in my opinion. It's a horror and a comedy so you'll be scared and be laughing at the same time. This is quite possibly the most outrageous film I ever saw, especially the laughing scene. If you just want movies that have logic then pass this, but if you're open minded, then you should watch this, but watch the first one too since it's also pretty good.",
            "review_date": "2012-09-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Maximum visceral impact is what \"Evil Dead 2\" is all about-- and it delivers. The brilliance of \"Evil Dead 2\" is found in its psychotic blend of over-the-top gore, and it's fantastic sense of humor. Not a sequel so much as an elaborateMaximum visceral impact is what \"Evil Dead 2\" is all about-- and it delivers. The brilliance of \"Evil Dead 2\" is found in its psychotic blend of over-the-top gore, and it's fantastic sense of humor. Not a sequel so much as an elaborate do-over, \"Evil Dead 2\" amps up the ghastly laughs to generally thrilling results. As in the first film, director Sam Raimi lets out all the stops and plays on almost every cinematic trick in the book. Although the movie is obviously indebted to any number of sources, the film has an infectious energy all of its own.\r After a high-speed recap and continuation of first film's ending, Ash (Bruce Campbell) ventures out to that same lonely cabin for a romantic weekend with his girlfriend (Denise Bixler). There he discovers the same tape recorder again. When the voice reads a translation of the \"Book of the Dead,\" a vicious evil force awakens in the woods, and rushes into the house, and all hell breaks loose once more. Despite \"Evil Dead 2\" being more of a rehash than a sequel, it's the tone of the two movies that are significantly different. While the original is more of a conventional horror movie, the sequel ventures into full-blown surrealism. While both movies contain moments of humor, \"Evil Dead 2\" raises the comedic stakes.\r Campbell's performance shifts to match the needs of the humorous script, and Ash is now all swagger, spitting out one-liners and taking on the forces of darkness with style. The overall intensity and old-school effects give the film a lovable quality that high-tech movies just can't provide nowadays. An acknowledgement to Mark Shostrom's prosthetic makeup and the camera work of Peter Deming and Eugene Shlugleit. Vivid, utterly unique, and quickly paced, ''Evil Dead 2'' is one of the goofiest, goriest movies this side of the grave.",
            "review_date": "2013-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quite similar to the first film and it pretty much follows straight on from where the last one finished up, and while the special effects have improved I think the first one is just that tad better. Definitely still entertaining enough andQuite similar to the first film and it pretty much follows straight on from where the last one finished up, and while the special effects have improved I think the first one is just that tad better. Definitely still entertaining enough and Ash provides most of the laughs, but it was a little more on the corny side and almost more of a comedy this time around, which wasn't always a bad thing either. Now I'm pumped though because I've seen both the originals and all prepared for the remake!!",
            "review_date": "2013-04-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Full of blood, guts, gore and more blood, guts and gore. Evil Dead 2 is not very different from the first movie but it's a successful formula. Lots of cheesy dialogue and ancient curses reminiscent of 1950's B movies so outrageous andFull of blood, guts, gore and more blood, guts and gore. Evil Dead 2 is not very different from the first movie but it's a successful formula. Lots of cheesy dialogue and ancient curses reminiscent of 1950's B movies so outrageous and completely insane that you really don't care. Perhaps not as brilliant as many make it out to be, but good entertainment to make you laugh and enjoy yourself.",
            "review_date": "2013-12-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Similar but completely different to the first one.\r While the first one definitely tries to be more serious, the second one really does take everything with a wink and a little dance. Weird analogy but let me explain... There would be aSimilar but completely different to the first one.\r While the first one definitely tries to be more serious, the second one really does take everything with a wink and a little dance. Weird analogy but let me explain... There would be a scare, which would represent the 'wink', and then the scary thing would laugh, and then everything would suddenly almost Disney style. But with blood.\r I loved it.\r From the weird descriptions, it should be noted that it has been a long day, and this film gave me a bit of a boost that I needed.\r The best way to put this review is that it firstly puts you straight into the action, which at first is admittedly a little jarring, as I had no idea where I was for a second, and then, as they say:  does indeed hit the fan'.\r I just enjoyed it.\r ... This is probably one of the worst reviews so far.",
            "review_date": "2013-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A horror with more comedy than its sequel, but manages to be just as original and refreshing from the mindless slashers with magic monsters. The 'evil' in 'Evil Dead II' is more of a freak show than something actually terrifying. But Raimi'sA horror with more comedy than its sequel, but manages to be just as original and refreshing from the mindless slashers with magic monsters. The 'evil' in 'Evil Dead II' is more of a freak show than something actually terrifying. But Raimi's filmmaking style keeps you entertained, both screaming and laughing.",
            "review_date": "2014-07-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "by far the best horror movie of all time. It's funny, stupid, and gory. What's not to like here?\rI enjoyed every second of this film and I'd highly recommend you go watch this RIGHT NOW!!!\rIt's on Netflix, well at least in Canada it is. Ifby far the best horror movie of all time. It's funny, stupid, and gory. What's not to like here?\rI enjoyed every second of this film and I'd highly recommend you go watch this RIGHT NOW!!!\rIt's on Netflix, well at least in Canada it is. If I could I would rate this 12/10. I hope this helped and you should definitely watch this sometime.",
            "review_date": "2014-09-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead II is proof that Sam Raimi and Bruce Campbell were the gods of low budget filmmaking, proof of the incredible intelligence and stupidity of the horror genre. Evil Dead II is among the best horror comedies ever made. No much needs toEvil Dead II is proof that Sam Raimi and Bruce Campbell were the gods of low budget filmmaking, proof of the incredible intelligence and stupidity of the horror genre. Evil Dead II is among the best horror comedies ever made. No much needs to be said from Raimi's spot on direction and Campbell's iconic, ridiculous parody of the action hero, Evil Dead II combines ludicrous amounts of gore with ludicrous amounts of hilarity, what more could you need?",
            "review_date": "2013-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead II: Dead By Dawn is a breathtaking part 2, worthy of expectations from both fans and critics about the sequel of the original renowned movie. Bruce Campbell returned as a sole survivor after the event in The Evil Dead, and this timeEvil Dead II: Dead By Dawn is a breathtaking part 2, worthy of expectations from both fans and critics about the sequel of the original renowned movie. Bruce Campbell returned as a sole survivor after the event in The Evil Dead, and this time he is even better with unpredictable, fearsome performance, which precisely matched Ash's mysteriously dangerous psychological behavior when he had his arm chopped and his girlfriend decapitated. Concisely speaking, Sam Raimi's terrifying direction, successfully combined with Campbell's breathtaking acting, produced a somewhat better horror cult classic with a higher level of blood, gore and visual elements that would leave viewers forever scared ****",
            "review_date": "2014-06-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can't believe but love the way they went with the tone for the trilogy. Still with enough jumpscares to still be loosely classed as a horror but with a ton of awesome comedic moments and one liners. Acting suits itself better here as it'sI can't believe but love the way they went with the tone for the trilogy. Still with enough jumpscares to still be loosely classed as a horror but with a ton of awesome comedic moments and one liners. Acting suits itself better here as it's being campy horror comedy. The stupidity is racked up to 10 and the direction is still pretty brilliant overall with some absolutely cracking scenes on display. Possibly my favourite, but i do love Army of Darkness a lot too. The film gets more evidently silly as it progresses, and you'll love every moment of it!",
            "review_date": "2015-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead returns as a good sequel its epic , horrorific , and awsome . but why at the last scene Ash ends up back in time ??????????????????????????? . Grade A+",
            "review_date": "2014-04-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's easy to see , from the beginning of the film, \"The House 2\" is a sequel to \" The House \" , but that takes a few moments a remake of the original. This time, however , Raimi wanted to include elements of the grotesque and comic , makingIt's easy to see , from the beginning of the film, \"The House 2\" is a sequel to \" The House \" , but that takes a few moments a remake of the original. This time, however , Raimi wanted to include elements of the grotesque and comic , making the film a real B -movie.\rAll this, contrary to what you might think , is not a defect, it helps to make the film a true gem that entertains from the first minute . Let's be clear that the B-movie does not need to be in the film of low quality, there are geniuses like Sam Raimi, in fact, that in movies at the highest level as \"The House 2\" , manage to insert elements typical of these films, alzandone further the level. There is , therefore, no need to say that the film is one of the greatest cult cinema history , as well as a horror film that deserves the highest of the stars.\rThe dominance , however, of these elements wants the judgment of the film to be assigned considering it as a B -movie.",
            "review_date": "2014-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's not as scary as its ingenious predecessor, but \"Evil Dead II\" is still highly entertaining and probably even more interesting than \"The Evil Dead\". It's mostly a string of disconnected crazy scenes for the first thirty minutes, but theIt's not as scary as its ingenious predecessor, but \"Evil Dead II\" is still highly entertaining and probably even more interesting than \"The Evil Dead\". It's mostly a string of disconnected crazy scenes for the first thirty minutes, but the movie finds itself, and it becomes more coherent and creepy. If you liked the first one, I definitely recommend this one.",
            "review_date": "2014-09-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Plot/Summary,After a relaxing cabin vacation doesn't go as planned,Ash,is left with three dead friends,an undead girlfriend and an angry evil spirit on the loose. As nightfall approaches,Ash must prepare again to battle the legions of thePlot/Summary,After a relaxing cabin vacation doesn't go as planned,Ash,is left with three dead friends,an undead girlfriend and an angry evil spirit on the loose. As nightfall approaches,Ash must prepare again to battle the legions of the damned if he wants to make it to dawn.\rMy Review\rThe last time we saw Ash he was going insane and man the beginning of this one shows. He go's insane and that scene where he is laughing and he images the things around the house laughing really shows. Eventually the daughter of the first man who said those evil translations on the tape goes to the cabin and finds Ash and thinks he killed her mother and father when all along he's been trying to survive the evil they brought back once more. Bruce campbell still plays Ash with greatness i don't know the names of the other actors who played the other characters but i will say that they did great as well. I love how they change the evil zombie in the basement from the guys girlfriend to the womens mother and father.",
            "review_date": "2016-03-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nEvil Dead 2 is part of the select few sequels that can be considered superior to the original. Ash Willaims is once again one of the best film protagonists of  all time. And he gets even cooler when he replaces his hand with a chainsaw. Like the first film, this film is incredibly gory and brutal and definitely not for the faint of heart. Overall, this is an outstandingly great film and even better sequel",
            "review_date": "2017-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Groovy!Good sequel not as great as 1st one!Music and sound-effects were amazing and chilling,screenplay was good,story was good but felt little bits and pieces of prequel.acting was good but sometimes it felt horror spoof!visuals were notGroovy!Good sequel not as great as 1st one!Music and sound-effects were amazing and chilling,screenplay was good,story was good but felt little bits and pieces of prequel.acting was good but sometimes it felt horror spoof!visuals were not that great and most importantly jump scares and silence both were amazing just like 1st one but in this it felt repetitive,starting was good right into business the setup was good and it was surprising to watch nice addition to characters but they felt little off whereas in 1st one the side characters felt important.as we move in story at half time it felt way to over the top the scares were good but the camera angles and reactions and repetitive attack didn't work out to me.the book and hero of past at climax felt amazing end to story. some scenes were amazing like head into hand and hand cutting scene,eye ball into mouth it was extreme,the recreation of wife's head-shot at start and jump scares,overall overrated compare to 1st one but good sequel and entertaining horror flick!",
            "review_date": "2020-05-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWhat it lacks in atmospheric horror, it makes up in sheer action and intensity. Evil Dead II is a worthy sequel of a classic, blending together horror and comedy, and throw in a little absurdity and over-the-top action sequences that will quench your thirst for gore. Though the film still suffers from cartoonish scenes and bland acting (except, of course Bruce Campbell), the films makes up for it by giving the viewers exactly what they want and more. Though the first film was leaning on more horror, and in my opinion, the best of the two, this still is one-of-a-kind and fresh, even though it's just another rehash of the previous film, although more action-packed and gratifying.",
            "review_date": "2020-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant sequel to the first one, I'd honestly say this one is better than the 1st and the 3rd for a fact, those ones are still good but this one is way better.",
            "review_date": "2020-07-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“That's right... who's laughing now... who's laughing *now*?”",
            "review_date": "2020-03-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For me, Evil Dead II was better than the first one. The camera work and special effects were better than the first one. The cinematography was good and action scenes were furious. Some scenes which were intended to be serious, were funny.For me, Evil Dead II was better than the first one. The camera work and special effects were better than the first one. The cinematography was good and action scenes were furious. Some scenes which were intended to be serious, were funny.Director should have continued the story from where the first part ended but instead he changed the story little bit which I think was not the right decision. He should have continued with the story and added the details of the book as he did afterwards. Overall, this one was better than the first one. Many say that first one is better but I don't think as it is filled with more details, action and horror.",
            "review_date": "2020-10-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The second one might be the better one and is in the pantheon for how to do sequels right. This movie kills it and is so ahead of its time. A instant classic and just amazing movie. So good and so entertaining even today.",
            "review_date": "2020-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "just a masterpiecei really have to say something else i guess (something real funni)",
            "review_date": "2022-03-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Among the greatest horror movies of all time, my personal favourite. It is brilliantly directed by Sam Raimi and wonderfully acted by Bruce Campbell. This is one of the most entertaining movies i have ever seen. I love the slapstick humourAmong the greatest horror movies of all time, my personal favourite. It is brilliantly directed by Sam Raimi and wonderfully acted by Bruce Campbell. This is one of the most entertaining movies i have ever seen. I love the slapstick humour mixed with horror. All of the movies elements combined lead to it being one of my favourite films of all time, and a must see for fans of the horror(/Slapstick Comedy) genre",
            "review_date": "2013-12-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It tones down the horror in favor of comedy, but all in all it's still one of the craziest horror flicks of all time. You really never know what to expect as there are unpredictable moments that come one after another. It's all brought toIt tones down the horror in favor of comedy, but all in all it's still one of the craziest horror flicks of all time. You really never know what to expect as there are unpredictable moments that come one after another. It's all brought to life with visual effects and tricks that no one uses today anymore. Granted it looks dated, but it's visual tricks are still all the more exciting and different. It's clear that this is pure imaginative horror-comedy.\r I just wish it was more horror and less comedy. It's not a scary movie. It's also not a particularly funny one. It's still entertaining, but it's strength lies in it's incredible weirdness as well as with Raimi's imaginatively twisted scenes and Campbell's performance. It's easy to see why this one became a cult-classic. It's unlike anything you've ever seen before and I really wish more horror movies would be this unique nowadays. It's not the best horror-comedy, but it's still worth a watch for hardcore genre fans. Overall I give it a 6.8/10.",
            "review_date": "2014-10-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Let's start of by saying i absolutely hate ''The Evil Dead'' (1981), so i didnt start watching this movie with high expectations (they were rock-bottom actually) and still, did i too, hate this movie. ''Evil Dead 2: Dead by Dawn'' is noLet's start of by saying i absolutely hate ''The Evil Dead'' (1981), so i didnt start watching this movie with high expectations (they were rock-bottom actually) and still, did i too, hate this movie. ''Evil Dead 2: Dead by Dawn'' is no different than ''The Evil Dead'', because they're practically the same movie, only with slightly better effects and SOME interesting things, maybe 1 or 2. That's why i gave it 1.5/5 in stead of 0.5/5\r Since ''The Evil Dead'', and ''Evil Dead 2: Dead by Dawn'', are practically the same movie (It isnt a sequel, it's just a remake with a slightly bigger budget.) my exact critcisms apply for this movie too. I, yet again, thought this movie was neither funny nor scary at all. (Except, again, the awfully cheap jump scares, which is just a talentless way of scaring the audience) The acting is horrendous and hammy (yet again), there is no atmospheric tension (yet again), and the movie's scares solely rely on jump scares and gore, which is the worst kind of horror, the plot is extremely simple yet it has many plot holes (Less than the first one however), the solution to the film's main problem is abominable (It made even less sense than in the first one), the structure/ outline of the story is pretty bad too. It is cheesy, silly and poorly made, with awful acting and many filming and continuity errors.\r I have nothing more to say, except that i'm even less excited for ''Army of Darkness'' than i was after watching ''The Evil Dead''",
            "review_date": "2016-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the worst and ridiculous horror movie ever made. I can't quite fathom why someone considers it a good movie...",
            "review_date": "2021-01-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the greatest horror films ever made. It is a horror film and it is a tongue-in-cheek comedy. Everything about this is pretty much spot on. There is plenty of violence, there is much comedy, it is very fast paced yet it stillThis is one of the greatest horror films ever made. It is a horror film and it is a tongue-in-cheek comedy. Everything about this is pretty much spot on. There is plenty of violence, there is much comedy, it is very fast paced yet it still remains jumpy and edgy. It really has to be seen for anyone who even has a passing interest in horror. This is the pinnacle of the series, it takes everything that was setup in the first film and builds upon it. The third film has a more action orientated and the ‘remake’ more of a horror leaning, the series is probably the most similar of the following franchise entries. This is not a remake of the first but the first 6 minutes is a recap. The rest is a rollercoaster of horrific images and stunning effects considering the budget with insanely over-the-top acting and enough dark humour to keep anyone happy. Thoroughly excellent film, memorable and entertaining.",
            "review_date": "2023-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the top 5 horror movies of all-time. A true classic. Campbell's hand-possession scene should be required viewing in every acting class on the planet.",
            "review_date": "2005-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A good sequel and a fun film. The only thing I do dislike about this film series is that in each one the continuity changes. A great cast of characters.",
            "review_date": "2013-12-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's better than the first movie, but that's not saying much. It is definitely more self-aware than the first one in the sense that it barely tries to be a horror movie, but it still fails to lean into that enough for it to be a slasher or a spoof.",
            "review_date": "2022-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Contains spoilersEvil Dead 2 could almost be described as a horror comedy masterpiece.Where to start.\nBruce Campbell's acting has improved so much since the last part.\nHis acting is very unique and nobody can be so charismatic, badass andContains spoilersEvil Dead 2 could almost be described as a horror comedy masterpiece.Where to start.Bruce Campbell's acting has improved so much since the last part.His acting is very unique and nobody can be so charismatic, badass and funny at the same time.Overacting is very hard to master and Bruce mastered it. Which doesn't mean he can't be serious.You can laugh at his grandiose funny moments, but you can also take them seriously.It's very rare for a character in a horror movie to go through such character development.One of the few horror movies where I can believe that the character is as strong as his opponents.This film is incredibly creative and the practical effects are still worth seeing today.In the fights between Ash and Henrietta and Ash and rotten apple head you can see what you can do with the right budget.The secondary characters also worked well in the film and I love how Army of Darkness is built on.The plot isn't the focus, but Ash's development into a unique character that has gone down in pop culture history.This film has endless iconic scenes.E.g. the scene where Ash saws off his hand, the dance scene of Linda, the head scene of Linda, the fight against Henrietta and rotten apple head, the scene where Ash replaces his hand with a chainsaw, the scenes with Ash's possessed hand, the surprising one end, etc. But what was funny about the film? The plot isn't funny, and the characters don't make many jokes. Most of the scary scenes are also the funny scenes.It's the implementation.Even the exposition scene is visually beautifully implemented.Even the demons still look impressive today.The practical effects never disappoint in an evil dead film anyway.",
            "review_date": "2023-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Evil Dead 2  is an Okay in the inside, But this movie is very overrated the comedy is hit or miss and the direction from Raimi is meh, if you don't agree on me watch army of darkness insted.",
            "review_date": "2023-03-05",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 62
}