{
  "title": "Jaws: The Revenge",
  "rating": 3.8,
  "release_date": "1987-07-17",
  "summary": "Chief Brody's widow believes that her family is deliberately being targeted by another shark in search of revenge.",
  "critic_reviews": [
    "Lorraine Gary has some affecting moments as Ellen, but Jaws the Revenge is mild and predictable, the very things an adventure movie should never be.",
    "Jaws the Revenge is not simply a bad movie, but also a stupid and incompetent one - a ripoff.",
    "Angry fish travels to the Bahamas for the Christmas holidays, plotting revenge against the family of a vacationing New England widow (Lorraine Gary). Noel, noel, a charming gift idea with suggestions of inverted seasonal myth—until director Joseph Sargent swamps it all in antimythical literalism and predictable lunchtime theater.",
    "Jaws is looking a bit long in the tooth these days. As the venerable series (b. 1975) sets off on its fourth paddle around the pool, Jaws the Revenge is definitely dragging its tail fins. Give a poor fish a break.",
    "Significantly worse than the rest of the series, this film is one of the worst flops in recent cinema.",
    "While it's mostly just a matter of waiting till feeding time, there is a hint that somebody was trying to foist some Symbolism onto the shark: as mother and son suffer an attack of the Oedipals, the creature keeps popping up grinning. Sadly, this attempt at a bit of Art (which could have had hilarious consequences) is ditched, and the film concludes with a few people getting chewed before a messy happy ending amid chunks of exploding shark.",
    "Even the special effects are lame in this one, offering a latex shark that is about as realistic as a fake goldfish. Poorly directed by Joseph Sargent, who relies heavily on blood and fast editing to create tension since there certainly isn't\r\nany written into the script.",
    "Pacing leaves a lot to be desired and the moment-of-attack sequences, full of jagged cuts and a great deal of noise, more closely resemble the view from inside a washing machine.",
    "In a wicked mess of unmatched water shots and dreadful interior airplane sequences, the characters outlined in little blue halos, the performances range from the mortifying to the merely immemorable. Against all odds, Lance Guest and Karen Young manage to be warm and credible. Podgy but game, Michael Caine, bravely attempts mouth-to-mouth resusitation on a role which is little more than anecdotes strung together. It is not his finest hour.",
    "The director, Joseph Sargent, doesn't bring out any of the possibilities in the material -- not even the scary ones. And Michael Caine is wasted, though not completely. He manages to provide at least a little suspense, even if it's the extracurricular sort, by raising the question: Will an Oscar winner be allowed to become fish food?",
    "Abetter title for Jaws The Revenge would be Jaws The Refund. A refund is what a lot of people who go to see this picture will demand. This Time It's Personal, the tag line for the new film's ad campaign, doesn't seem quite right either. This Time It's Terrible would have been more accurate.",
    "There's more suspense in On Golden Pond. And when the predictable ending comes, it has none of the titanic man-versus-beast struggle of the original. It all happens so quickly, you wonder if you've missed something. But, no you haven't, because there it is -- the familiar calm sea . . . of credits."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "So easy as this: sorry, stupid and awfully acted (and also written); Jaws: The Revenge is an unnecessary, dull and pathetic sequel for a once-proud saga.",
      "review_date": "2017-09-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original Jaws is still (quite rightly) regarded as a cinematic classic and, as is so often the case, executives were determined to rinse every last penny they could from the franchise. This is the result.....You wouldn't even think theThe original Jaws is still (quite rightly) regarded as a cinematic classic and, as is so often the case, executives were determined to rinse every last penny they could from the franchise. This is the result.....You wouldn't even think the pitch for this movie, one in which a shark is apparently out to get revenge on the Brody family for killing the great white in the original (no this isn't a comedy), would get past an initial meeting but it somehow actually made it all the way to being filmed. Every element of this movie, from the script to the direction to the acting, is downright awful and even at a running time of less than an hour and a half it felt like it dragged on forever.",
      "review_date": "2018-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An awful movie when compared to the original or even Jaws 2. Jaws: The Revenge does everything right when you want to do everything you can to kill a franchise. If you watch the respectable Jaws 2, you hear a line uttered that goes asAn awful movie when compared to the original or even Jaws 2. Jaws: The Revenge does everything right when you want to do everything you can to kill a franchise. If you watch the respectable Jaws 2, you hear a line uttered that goes as followed, \"Sharks don't take things personally, Brody.\" Apparently noone told the studio that during the pitch meeting for this complete **** of a film, its a garbage film with none of the tension or taste you get when you watch Jaws. Its a disappointing end to a once-proud series",
      "review_date": "2019-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is probably the worst film that I have ever watched. I have no idea what in the name of God was going on in the mind of the filmmakers as they created it. Poor Michael Caine.",
      "review_date": "2017-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "HorridGood lord this film was godawful, It’s so stupid that it makes Patrick Star look like a Harvard graduate.",
      "review_date": "2019-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely hate this movie. It's not even scary it's just boring. The acting is awful and so is the plot. They try to add new things which just make the sequels so bad.",
      "review_date": "2017-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I will just make this simple, the best thing about this movie is how they kill the shark. Everything thing else is basically a waste of time and this movie should not exist.",
      "review_date": "2017-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you thought Jaws 3 ruined your childhood, wait until you see Jaws: The Revenge. It is one of the worst movies I have ever seen in my life. It also has some of the most silliest most laughable writing I have ever seen in a film. I don’tIf you thought Jaws 3 ruined your childhood, wait until you see Jaws: The Revenge. It is one of the worst movies I have ever seen in my life. It also has some of the most silliest most laughable writing I have ever seen in a film. I don’t recommend this movie at all! I would avoid it at all costs!",
      "review_date": "2018-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now Let's get to Universal's Rock Bottom Movie, Jaws: The Revenge, Now this is Definitely the Worst Movie Ever Made, The Plot is Just the Shark going out for Revenge on the Brody Family, Sounds Stupid and Pointless, and there are some ReallyNow Let's get to Universal's Rock Bottom Movie, Jaws: The Revenge, Now this is Definitely the Worst Movie Ever Made, The Plot is Just the Shark going out for Revenge on the Brody Family, Sounds Stupid and Pointless, and there are some Really Bad Closeups on the Shark, which looks pretty Bad, and the Shark looks Completely Fake compared to one in Jaws 3-D, This will forever be the worst movie ever made.",
      "review_date": "2019-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quite possibly the dumbest and most insulting movie Universal Studios has ever given us. I have respect for Lorraine Gary for reprising her role in this movie, but everything wrong with this film can be found from start to finish.This movieQuite possibly the dumbest and most insulting movie Universal Studios has ever given us. I have respect for Lorraine Gary for reprising her role in this movie, but everything wrong with this film can be found from start to finish.This movie sacrifices what could have been satisfying character arcs for the pointless and weak storyline this movie actually has to offer. At no point does Jaws: The Revenge actually manage to take itself seriously. We’re led to believe that Roy Scheider’s character from the first movie was supposedly “killed from the fear” of the sharks, despite having killed two sharks already. Another flaw is that the kills are literally impossible to take seriously. (Especially that kill on the banana boat, lmao.) Just stick to watching Jaws and Jaws 2. Those are the only good movies in the entire franchise. How? they are good because the studio actually put effort into them.",
      "review_date": "2019-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "one of the worst jaws movies ever! i hate this movie! but the first 2 movies are okay!",
      "review_date": "2021-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWow. This is the second time the Jaws franchise has a bad sequel! It is so horrible, it is one of the worst films of all time! I hate it so much because this is the equivalent of a broken toilet cleaner.Jaws 4: The Revenge is about another shark, named Vengeance, appears and kills Sean Brody. Ellen Brody is very upset and moves to the Bahamas to visit her other son, Mike and his family. However, guess who else arrived in the Bahamas? Vengeance, the stupid and fake shark is back! Only 2 shark kills in the entire film(3 in theaters) and the way the shark is killed, except on TV, is dumb and ridiculous. Vengeance was not as bad as Brucetta(shark in Jaws 3-D), but the whole movie is worse than Jaws 3-D. Jaws 4: The Revenge has the same plot as the other 3 films and it's not scary, bad characters, bad development, and bad shark. So, don't watch this disappointment. It was pathetic and very unnecessary.",
      "review_date": "2017-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJaws The Revenge Is just boring The very beginning Right when Shawn gets eaten the camera is moving so much I have no clue what is happening The Shark looks horrible when it turns it looks like someone is turning it in this movie and makes noises just why and it screams like a lion at the end in this movie Elien Brody sees The shark when someone else is getting eaten She does not even witness the shark attacks she randomly sees it It's just very boring I do like Jake as a character that is really it and the end was not good either I watched the alternate ending which is better to me I give Jaws The Revenge I give an F",
      "review_date": "2021-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Jaws: The Revenge was indeed the final chapter in the Jaws movies and the last sequel starring Lorraine Gary from Jaws and Jaws 2 and Michael Caine. Made in 1987, Jaws: The Revenge has some good moments like the guy who goes out at night onJaws: The Revenge was indeed the final chapter in the Jaws movies and the last sequel starring Lorraine Gary from Jaws and Jaws 2 and Michael Caine. Made in 1987, Jaws: The Revenge has some good moments like the guy who goes out at night on his boat and gets ripped apart and killed by the shark. This movie is certainly better than Jaws 2 I don't care who disagrees because it's fact!!! So in this case I give Jaws: The Revenge a 8 rating.",
      "review_date": "2020-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think it not bad it is good and the story is good too I think it is the fun movie.",
      "review_date": "2021-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Man, people really hate these last two sequels, eh?I don't even think 'Jaws 3-D' is as awful as most fellow reviewers think and that's the case again with 'Jaws: The Revenge'. It's bad, but it's not *that* bad. It makes little sense, thoughMan, people really hate these last two sequels, eh?I don't even think 'Jaws 3-D' is as awful as most fellow reviewers think and that's the case again with 'Jaws: The Revenge'. It's bad, but it's not *that* bad. It makes little sense, though to be fair it is from a franchise that is all about a huge human-killing shark; despite sharks, in fact, not actually being all that keen on our rotten flesh.Michael Caine is somehow in this. Well, I say somehow... a trip to the Bahamas and a nice paycheck likely made it entirely logical from his view; as he reportedly stated himself. Lorraine Gary, meanwhile, spearheads an average support cast. Speaking of whom, I did find their dialogue and interactions to be very unnatural and forced.5/10. There are many, many worse films out there though.",
      "review_date": "2022-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWow.  Wow! This movie is so horrible I am laughing in the stands watching the cut-rate action scenes, my God! The shark roars like a lion, somehow has a psychic relationship with the Brodys, survives out of water, and explodes like a balloon when poked with a mast! My God, they could not even use original footage! Razzie well-earned, my friend.  The acting was also quite horrible too.  Lorraine Gary had probably one of her worst, most annoying performance ever.  It’s not her fault, though.  It was Joseph Sargent’s.  This is why everyone acted so horribly in this rubbish movie, maybe except for Michael Caine.  However, this movie, in some respects, was better than Jaws 3-D, with some continuity picking up, with Lee Fierro coming back to reprise her role as Mrs. Kintner, the mother of Alex Kintner, who fell victim to a shark attack in the good “Jaws.”  Oh, how far we have fallen from there.",
      "review_date": "2022-10-24",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 30,
  "genres": [
    "Adventure",
    "Thriller",
    "Horror"
  ]
}