{
  "title": "Lethal Weapon",
  "rating": 8.2,
  "release_date": "1987-03-06",
  "summary": "Riggs (Mel Gibson) is a volatile, unregistered risk-taker, known as a \"lethal weapon\" by his law enforcement colleagues. Murtaugh (Danny Glover) is the conservative detective with a solid reputation. Forced to form an uneasy alliance, they begin to unravel the mystery of an apparent suicide that turns out to be murder -- and more. [Warner Bros.]",
  "critic_reviews": [
    "For his first produced screenplay, Black took the best clichés from his favorite movies and honed them until they cut. Lethal Weapon’s heroes were edgier. And thanks in large part to the all-in commitment of director Richard Donner and producer Joel Silver, its chases and shoot-outs were more destructive. This one modestly budgeted genre exercise pumped hot blood back into a stiffening body.",
    "In a movie with the energy of this one, we're exhilarated by the sheer freedom of movement; the violence becomes surrealistic and less important than the movie's underlying energy level.",
    "Lethal Weapon opens with a shot of Mel Gibson in his birthday suit and just gets better. Likewise we meet costar Danny Glover in the bathtub, fêted by his family on his 50th birthday. This endearing double exposure introduces us to the vulnerabilities of these superduper heroes, an odd couple of cops who mature into friends as they quell crime.",
    "After watching Gibson and Glover grow accustomed to each other, develop trust and confidence in each other and charge bullheadedly into dangerous situations, you can't help but hope there's a \"Lethal Weapon II.\" It would be one of the few times a sequel would make sense and dollars.",
    "This is one of the best of the subgenre, an action-packed movie that delivers adrenaline jolts with both barrels while not skimping on character development and wry humor.",
    "Gibson is truly frightening as the cop about to go into orbit, and Glover is a standout as the down-to-earth lawman with very much to lose.",
    "Stylish and brutally violent, the film escapes the usual clichés of the ex-soldier fighting a war back home by virtue of Gibson's blue-eyed smile.",
    "The film is all fast action, noisy stunts and huge, often unflattering close-ups, but it packs an undeniable wallop.",
    "The pace never slows, the jokes never miss and the stunts never disappoint in this macho-dream of an actioner.",
    "Lethal Weapon is a film teetering on the brink of absurdity when it gets serious, but thanks to its unrelenting energy and insistent drive, it never quite falls.",
    "The atmosphere, the buddy stuff and the flashy setting don't make up for the fact that the main story is too distanced throughout much of the movie. Further diluting the film's intensity is the scene structuring; far too often lame expository scenes serve to advance the plot or explain the backstory.",
    "Unfortunately, director Richard Donner doesn't pay much attention to text, subtext, or anything else; his 1986 film is empty glitz in search of a style, with arbitrary action substituting for ordinary narrative coherence."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "One of Mel Gibson's better efforts, but it still has more than its share of cliche's. It is indeed very fast paced and has some great action sequences. I am not at all a fan Mel Gibson, so it may effect my rating. Others may enjoy it more.",
      "review_date": "2009-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "They don't make em like this anymore. Unabashed macho testosterone fest with just enough vulnerability & humanity to make us gals weak at the knees. Glover's gentle puppy dog eyes as he rolls his head around before taking his man They don't make em like this anymore. Unabashed macho testosterone fest with just enough vulnerability & humanity to make us gals weak at the knees. Glover's gentle puppy dog eyes as he rolls his head around before taking his man out with one shot, and Mel's wild law man on the brink crossed with that kooky little-boy streak (\"I'm hungry\") - potent magic potion, this. Guilty pleasure? Maybe. But I feel no guilt at admitting that I've watched this franchise a number of times.",
      "review_date": "2008-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Lethal Weapon is a fantastic start to the best buddy-cop movie franchise of all time. The chemistry between Gibson and Glover is fantastic strait from the off. Lethal Weapon is just a classic film all round.",
      "review_date": "2012-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very strange movie for me, mostly thanks to Mel Gibson as Riggs. He has weird hair, weird accent and his way of taking down bad guys is totally ridiculous. Thankfully, Danny Glover gives a more or less normal performance that reallyA very strange movie for me, mostly thanks to Mel Gibson as Riggs. He has weird hair, weird accent and his way of taking down bad guys is totally ridiculous. Thankfully, Danny Glover gives a more or less normal performance that really stretches the intentional difference between the two. Gary Busey is also quite strange. Also the end fight between the two is plain silly. Gibson and Busey deck it out in the mud and rain near the end surrounded by gun wielding police officers. Why doesn't Riggs just let them arrest Busey? Questions like these really make you wonder what they were aiming for when they shot this movie. Music is good and there are some good action scenes, but the rest isn't worth watching.",
      "review_date": "2011-05-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The chemistry between Gibson and Glover makes Lethal Weapon (and the series as a whole) untouchable. The first film is arguably the best buddy cop movie of all time and an instant classic.",
      "review_date": "2020-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Following the death of his wife, Los Angeles police detective Martin Riggs (Mel Gibson) becomes reckless and suicidal. When he is reassigned and partnered with Roger Murtaugh (Danny Glover), Riggs immediately clashes with the older officer.Following the death of his wife, Los Angeles police detective Martin Riggs (Mel Gibson) becomes reckless and suicidal. When he is reassigned and partnered with Roger Murtaugh (Danny Glover), Riggs immediately clashes with the older officer. Together they uncover a massive drug-trafficking ring. As they encounter increasingly dangerous situations, Riggs and Murtaugh begin to form a bond. Riggs' volatile behavior might just help them apprehend the criminals -- if it doesn't kill them both first. The most successful installment in a phenomenally successful series, Lethal Weapon helped redefine action movies for the 1980's and 1990's. I'll give Lethal Weapon an A+.",
      "review_date": "2018-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mel Gibson and Danny Glover star in Richard Donners original action classic thriller, Lethal Weapon (1987) .. After a woman jumps from a high rise building Mel Gibson (Riggs) and Danny Glover (Murtaugh) are two cops who join forces toMel Gibson and Danny Glover star in Richard Donners original action classic thriller, Lethal Weapon (1987) .. After a woman jumps from a high rise building Mel Gibson (Riggs) and Danny Glover (Murtaugh) are two cops who join forces to investigate the case and bring down the badguys. Gary Busey plays a good villain in Lethal Weapon and the acting is great by all the actors and it's a good action film with funny moments and plenty of violence and explosions and this film involves drugs. Lethal Weapon is a good film but not as good as the sequel, Lethal Weapon 2.",
      "review_date": "2020-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was the 5th action buddy cop movie that I felt like I needed to say it was a good movie.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest action movies of all time, even the climax can't hold it back.",
      "review_date": "2007-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good movie with some brutal scenes and great performance from Mel Gibson. Although the plot is a bit simple it also has some ideas, that are indeed true (CIA trading with drugs).",
      "review_date": "2021-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Completely unrealistic to today's standards, HOWEVER (before everyone click the 'hate' button) I do enjoy this movie. It was released when buddy cop movies were at a high and when loss and anger could be solved by shooting everyone in the room.",
      "review_date": "2016-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love this movie ssssssssssoooooooooo much its awesome! I LOVE THE WHOLE QUADRILOGY! But its Unique, Great charecters, Great Bad guys, Great plots, Great Lines, Great guns AND RICHARD DONNER NAILED IT!!! I think this quadrillogy defines MelI love this movie ssssssssssoooooooooo much its awesome! I LOVE THE WHOLE QUADRILOGY! But its Unique, Great charecters, Great Bad guys, Great plots, Great Lines, Great guns AND RICHARD DONNER NAILED IT!!! I think this quadrillogy defines Mel Gibson as an actor, same with 1 2 3 AND 4!!! This movie should'nt get a 7.8 IT NEEDS TO BE HIGHER This movie Beats Rambo, Bourne and callaghan. about the same as Bond and die hard... but if you want a great movie night that has Cussing, Explosions, Great Actors, Guns and Agreat director YOU HAVE IT!!!",
      "review_date": "2014-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This may have been the first \"buddy\" movie where a slightly unhinged police detective is paired with a stodgy \"by the book\" old timer detective.  Their interaction and growing friendship is what makes the film so great.  I don't have thatThis may have been the first \"buddy\" movie where a slightly unhinged police detective is paired with a stodgy \"by the book\" old timer detective.  Their interaction and growing friendship is what makes the film so great.  I don't have that many DVDs but this one is in my collection.",
      "review_date": "2015-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In a world where weapons become a primary use and sticky situations never exist, there's only one guy that can live up and play by its rules and that's Mel Gibson! One guy... no, screw that, add another guy in there since he needs all theIn a world where weapons become a primary use and sticky situations never exist, there's only one guy that can live up and play by its rules and that's Mel Gibson! One guy... no, screw that, add another guy in there since he needs all the attention he can get, but who are we supposed to get? Hire Danny Glover since he needs attention along with Mel Gibson. Ok, not one guy anymore? Nope. Ok good. Let me start my script all over again. In a world where weapons become a primary use and sticky situations never exist, there's only two guys that can live up and play by its rules and that's Mel Gibson and Danny Glover! Let me present you.... LETHAL WEAPON!",
      "review_date": "2016-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Crazy And FunLethal Weapon has terrific performances from Gibson, Glover, and Busey, fantastic humor, fun action scenes, and lovable characters.",
      "review_date": "2019-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i'm too old for this ****Lethal Weapon\n\nIt has some loop holes and weird illogical scenes but then it has a different plot line compared to the other buddy-cop movies and Mel and Danny whose chemistry is off the hook since their charactersi'm too old for this ****Lethal WeaponIt has some loop holes and weird illogical scenes but then it has a different plot line compared to the other buddy-cop movies and Mel and Danny whose chemistry is off the hook since their characters are written with depth and sincerity.",
      "review_date": "2018-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is one of the most interesting action films of the Eighties and started a brief, but interesting, film franchise. The key plot point is the collaboration and friendship between two substantially different policemen, but who haveThis film is one of the most interesting action films of the Eighties and started a brief, but interesting, film franchise. The key plot point is the collaboration and friendship between two substantially different policemen, but who have just been paired by their bosses: Murtaugh is an experienced middle-aged cop, disciplined in methods, married, a father and very attentive to his family ; Riggs is a police officer who has worked for several years in the Narcotics division and is experiencing severe depression, with suicidal tendencies that lead to impulsive, violent and risky behavior. Both are assigned to investigate the apparent suicide of a prostitute who is the daughter of a longtime friend of Murtaugh's, and who may be associated with a group of drug traffickers.In addition to the film having a good police story, the huge difference between the two protagonists and the way they manage to learn to respect and collaborate makes this film a good entertainment piece. It's not a movie made for thinking, nor is there a real mystery behind the crimes. It is an action-oriented film, punctuated by a light, intelligent and well-placed comedy. It's a movie made to enjoy and entertain.Much of the film's success rests on the back of its protagonist duo: Mel Gibson gives his character a bold, insane and intelligent aura, making good use of the opportunity and protagonism to popularize and leverage his career. Danny Glover is not far behind and offers us a mature, more restrained and intelligent performance. There are still several other actors, but none of them received material capable of allowing them to be highlighted.Technically, it's a regular action film, with elegant but understated cinematography, well-constructed sets and uninteresting costumes. The most notable technical aspect is the visual, special and sound effects department, which provides us with a job well done and realistic. There are lots of explosions, wrecked cars and insane fights that oscillate between the epic and the far-fetched, and the movie sometimes overdoes its spectacularity. The soundtrack is forgettable.",
      "review_date": "2021-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gibson and Glover have a good chemistry and the film is one of the best in the buddy cop genre. It's also the best in the Lethal Weapon franchise and one the best 80s action films.",
      "review_date": "2019-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fun and entertaining and A iconic classic!the screenplay was brilliant all the time the feel and environment of 80's and the calmness was amazing.the Chemistry of both Mel and Danny was iconic there small small fights and amazing build-up ofFun and entertaining and A iconic classic!the screenplay was brilliant all the time the feel and environment of 80's and the calmness was amazing.the Chemistry of both Mel and Danny was iconic there small small fights and amazing build-up of friendship was great,Danny as a sweet family man cop and Mel as insane bad-ass there Duo was fun to watch,the music was phenomenal the starting Jingle bell theme was amazing.the story was good and the whole investigation and twisted case was engaging to watch,the starting intro to both was amazing and love there 1st meet with the gun and \"i'am to old for this\" it was iconic,the whole family interaction and boat thing was amazing,the rooftop jump case and the situation held by Mel was hilarious the starting jump case was like simple but the whole turn of tables at half-time involving bigger threats it was damn exciting,the kidnap and sniper rescue plan was amazing then the whole turn of events and torture for info it was disturbing then the escape and chase was intense and the fight at last was awesome the whole ending sequence was fast-paced and entertaining,it was such simple calm movie the situations and action it felt amazing,the whole movie was amazingly entertaining and it's a iconic classic the best buddy cop movie of 80's and till now maturely,it's Fun and awesome movie!",
      "review_date": "2020-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is quite a fantastic buddy-cop movie, the way it understands that the “buddy” part is as important as the “cop” part.",
      "review_date": "2023-01-01",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 35,
  "genres": [
    "Action",
    "Thriller",
    "Crime"
  ]
}