{
    "rating": 8.4,
    "release_date": "2013-07-12",
    "num_reviews": 135,
    "genres": [
        "Hindi"
    ],
    "summary": "The story of runner Milkha Singh (Farhan Akhtar), called \"the Flying Sikh,\" shows his loss in the 400-meter finals at the 1960 Olympics.",
    "reviews": [
        {
            "content": "An Under-rated Sports movie the the whole world can enjoy, with a heavy back story of how Milkha singh suffered during the partition on India - Pakistan, and he Rose to the top, Chasing the world Record for 400m race. Just Great Cinema!",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best biopics.\n\nAlthough whole India was aware and proud of our flying sikh, this movie made us aware of the struggle, ambition, hard work Milkha Singh had throughout his life. Farhan Akhtar has nailed it in his acting. Story, Screenplay, music, every element is just perfect. I would recommend this movie to each and every human on this planet, one of the best motivational stories.",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike most normies, I already knew who Milkha Singh was. I had heard about his losing in the Rome Olympics, and the moment I began watching the biopic I felt it was just going to be a whitewash of his image. All his actions will be justified. But as the film progressed I realised this is not the case. This is one of the best biopics I have ever seen. Considering there are barely any good biopics (and also the fact that I hate biopics), there wasn't any competition anyway, but it did set a bar.\n\nBhaag Milkha Bhaag is a coming of age biopic. It begins at the time just before independence and carries on to the 1962 Asian Games. Milkha's entire family is murdered during the partition and he goes to join the army. From there he gets fascinated to be an athlete. He is never shown to be a good guy. He has his own share of flaws, even though his intentions are never to hurt anyone. He just ends up doing things he should not do being the naive villager that he is. Finally he grows out of that personality and becomes the Flying Sikh that he is known as.\n\nThe score, the cinematography, the acting, everything is on point. Farhan Akhtar looks very much like the young Milkha Singh. Normally when we think of the time of the independence we only think of very cultural, conservative families. We never think of some fun loving loafer that Milkha was. Milkha Singh has himself confessed that this film is mostly true, so it's not like the makers of this film are just showing all that to market their film. The only problem I have with this film is the overuse of details. I understand that this is Milkha Singh's life being depicted as a person and not as an athlete, but there were many storylines that went absolutely nowhere like a swimmer who tried to kiss him, or what finally happened of Biro.\n\nI'd say this is undoubtedly one of the only good biopics Bollywood has ever made, the others being MS Dhoni: The Untold Story and Once Upon a Time in Mumbaai (if that counts). Normally I completely trash biopics, but not this one. This one has made me have really high expectations from all biopics.",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great film but no need from the filmmaker Rakesh Omprakash Mehra to dig deep into the athlete's personal affairs which distracted the viewers from his achievements.",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While many of the nuances in Rakeysh Omprakash Mehra's sports biopic 'Bhaag Milkha Bhaag', are undone towards the period approach of the film, it all is bound again by the solid performance and dialogue of its principle strength: Farhan Akhter. The actor delivers a beautiful performance as the Sikh sprinter despite the lacklustre writing. Thankfully, the music also propels the game in the correct direction. \nBut doesn't any of it not matter, when the direction is insipid and boring? Nevertheless, what keeps the film astoundingly afloat is it's maturity. The film isn't a childish and whimsical portrayal and gives us a bolder picture to the portrayal of the flying Sikh. Thankfully, the heart's also in the right place.",
            "review_date": "2020-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One star for story. Minus four for worst actor Akhtar",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "84%\nSaw this on 21/8/16\nAn ambitious film that manages to lose hold of the predictability because of a taut execution. Farhan Akthar is remarkable as Milkha.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping take on the life and achievement of the sports icon.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a movie that is worth watching for the sports in it that the nation did not follow. It takes a movie to bring someone's achievements into light. Exhilarating performance by Farhan Akhtar. Run time is a bit of let down with 3.07 hours",
            "review_date": "2015-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the life of Milka Singh a.k.a. The Flying Sikh, this movie unexpectedly turned out to be an amazing movie. Farhan Akhtar gave his best performance as an actor yet and was the life of the movie. The movie wouldn't have been same if it wasn't for him and the brilliant direction by Rakeysh Mehra.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie! Good Star cast. Awesome songs! Got goosebumps during the finale race...Deducting half point for adding few unnecessary scenes!!",
            "review_date": "2015-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This won Best movie at the 2013 Filmfare Awards, so I got down to watching it tonight, after my hindi teacher recently recommended it. Farhan Akhtar gives an outstanding performance as Milkha Singh, the real life Olympian runner from India, who began his life in India as a child refugee who fled Punjab during the 1947 partitioning after witnessing his parents being killed. It's an inspiring story that reminds us of the power of the human spirit. Especially poignant is the part where Milkha visits his old village in Pakistan and sobs to recall everything, then finds out an old friend survived. After this take place, the imagery of him running alongside his young self at the end is really poignant. The child is smiling again. Healing.. Beautiful! I like the music score too, especially the tunes with banjo :)  The director is Rakeysh Omprakash Mehra, who also directed Rang de Basanti and Delhi-6. I rank this No.2 after Delhi-6.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Bollywood Sport Movie EVER ..No words to say.....All Must SEE .",
            "review_date": "2014-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare sports biography done right from India, anchored by an astonishing performance from Farhan Akhter (the least of which is the amazing physical transformation he achieved solely for the film). There are attempts of myth making, but it all make for a rousing experience for more than 3 hours.",
            "review_date": "2014-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great biography drama with oustanding technical aspects. A master work.\n\nhttp://harianfilm.wordpress.com",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was just okayish. watchable once.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, Inspirational, Farhan Akthar is brilliant",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess the most obvious thing to say about the movie is that it keeps reminding you that its unnecessarily long. There are too many scenes which one feels could have been left out completely. The cast did their best but they did not look like their roles were very well defined. All in all its a good education on the life and trials of Milkha Singh but fails to rise above a biography feel.",
            "review_date": "2014-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akhtar's determination towards the movie is just great",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an inspiring performance by  Farhan on Milkha Singh's biopic. A movie for everyone.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would have rated this movie a bit weaker if it wasn't an Indian movie. But being one, it deserves recognition and applause for setting outside the stereotypical Bollywood and for celebrating a true national hero.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best indian film ive seen in my liife",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Om Prakash doesn't disappoint at all, proving he is not a one hit wonder. Loved it and really enjoyed it!",
            "review_date": "2014-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely well made biopic but possibly on a made-up premise. The dramatization includes the blaming of a key loss on Milkha's tortuous past which leads to the climax involving competition with a competitor who perhaps never was. All that said  a good watch with some real heart-warming moments.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well made movie. Based on true events a good historic lesson for the current generation too.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant performance by Farhan Akhtar...",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "still a touch below chak de india, but a well directed movie. and an impressive job with the make up and costumes. farhan akhtar and milkha singh being the real beneficiaries of this movie.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mind-blown! Farhan steals the show...",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an engrossing, moving, and very well directed biopic. It continually inspires you and at the same time keeps you very interested. Despite its 3 hour runtime, I never really found myself bored but I did prefer certain segments over others for sure. The movie also hits a lot of mature and emotional themes that resonated for sure. Despite the dark moments, the film is ultimately an uplifting one that will leave you with more of a happy feeling since its a story of triumph and perseverance.",
            "review_date": "2013-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't understand the hooplah........\nOkay, it was good. Some funny and emotional moments (with a lot of melodrama). But the movie was not great.",
            "review_date": "2013-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely disappointing.",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a word, epic. Farhan Akhtar shines in this biographical piece on Milkha Singh. The acting, direction, musical score, etc is all very well executed. Very impressive movie that ia bound to leave you feeling good after.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This isn't the first time a great life has been turned into a mediocre movie. Mehra fails to find the real story and drama in the film.",
            "review_date": "2013-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic acting by Farhan Akhtar. But the movie was too lengthy to hold interest till the end. But a good movie if not great.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a very nic movie ....but censor board cud have done smthin .. :P",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan can be seen giving it his all in this biopic but I only wish other actors or the director or the team would have the done the same. The editng was pathetic. The scriptwriting was abysmal. Songs were okay but Sonam Kapoor was her usual self. Humour was placid. Length and pace was off. I really hope we make better films as a country. I am giving this movie any rating because of the hard work and art displayed by the lead actor.",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan can be seen giving it his all in this biopic but I only wish other actors or the director or the team would have the done the same. The editng was pathetic. The scriptwriting was abysmal. Songs were okay but Sonam Kapoor was her usual self. Humour was placid. Length and pace was off. I really hope we make better films as a country. I am giving this movie any rating because of the hard work and art displayed by the lead actor.",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akhtar's performance here puts his still-young acting career on equal weight with his justly celebrated one as a writer, director, and producer.",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "superb!!do watch it even if you havn't ran a 100metre race in your junior classes yourself :D\n\nthe movie unravels the story of one of the few legends of indian athletics-milkha singh.\nnice work by farhan and ably supported by sonam....the shift from the cute innocent love story between milkha(farhan) and biro (sonam) to the fight to outrun the world was really well scripted..hats off to Mr.Rakeysh omprash mehra and Mr.prasoon joshi for the brilliant and smart scripting and screenplay...it made the peaple stand and take notice of how much hard word,dedication and planning goes into winning a medal in athletic or any sport....it makes u realise even to win 100 metres race he trained like an ox and a horse for 100 miles day in and day out and used all his negative memories n thoughts from the killing of his family during india - pak partition or the lost of his love and how he channelised all that energy into reaching his goal...made us love and respect the flying sikh even more :)\nbrilliant work guys,just brilliant!!",
            "review_date": "2013-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most amazing biopics ever",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well made movie by an ace director and a wonderful actor featuring the life of an ace Indian runner and Olympian Milkha Singh, 'The Flying Sikh'. Rakeysh has managed to show the athlete's childhood, upbringing, stints with love, struggle, training, losses and victories (both in sports and conquering the dark corner in the heart) beautifully without making it cumbersome and boring. The movie constantly shuffles between past, further past and present, but due to smart editing and direction, the final impact is not confusing but good. In fact, 'Bhaag Milkha Bhaag' is one of the best edited Indian film in spite of its duration of 3 hours and 9 minutes!\n\nAny movie that covers the partition era is bound to have scenes entailing - mass massacre, bloodshed, loss of loved ones, children turning orphan, fear and trauma amongst civilians, violation of women etc. And for this very reason, many of us like to distance ourselves from such movies as it is very disturbing to watch such depictions again and again. All brownie points should be awarded to the makers of the movie to show it all, but in bits and pieces and with such adaptations that as an audience you tend to get the right message without cringing in your seat!\n\nDark corners created in our hearts during childhood are the most difficult ones to bear and cure and they haunt us throughout our lives effecting our participation and success in one or the other way. Curing such a devious dark corner is the focal point of this movie and it has been executed very effectively.\nHats off to Farhan Akhtar for pulling off such a difficult role i.e. a role that demanded the physicality of an ace athlete and expressions of a rustic north westerner who is not well educated, has seen the trauma and pain of partition of India and Pakistan and still has managed to transform himself into a gold medalist in spite of various barriers thrown in his way. It is difficult to imagine that Farhan is the same man who started his film career by directing the quintessential metro guy flick 'Dil Chahta Hai'. It goes without saying that this lad has grown miles and bounds as an actor as well as a person.\n\nActingwise, apart from Farhan, Divya Dutta and Pawan Malhotra have done very good job. Divya has simply stood out as the selfless motherly sister who simply adores her kid brother 'Milkha' and silently bears the struggles and exploitations of life suffered by the women of that era who had to bear the losses of partition as well as boisterous (read domestic violence) nature of their husbands. Pawan has also stood out as the loving and inspiring army officer who had a great hand in the making of 'Milkha'. He is very natural in emoting the expressions of judgement, pain, pride, kindness, victory etc.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rakeysh Omprakash has done it again, he has gifted bollywood with another inspiring movie. Farkhan Akhtar has played his role beautifully too. Totally worth the money and time, and by time I mean 3 hours. Yes its a long movie, but i dont think you'll regret spending your 3 hours on this movie.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"There are triumphs, both in front of and behind the camera, but they often get overshadowed by a story that tries to do too much.\"",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't be missed by any stretch of imagination .  Each and every bit of this movie just \"INSPIRES\".",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If There Was A Limit Of Giving More Than Five Stars Than I Would Hve Given It....!\nThis The Best Hindi Movie I Have Seen Since 3 Idiots......!!",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best film of 2013!!..this one is sure to sweep all the major awards next year..especially the Best Actor for Farhan Akhtar!!",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a story that tries to do too much, therefore turns into a never ending bore",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best way this story could have been told, but then again, watching such an inspiring figure's story, however it is made, leaves you with quite an effect. An important story which needed to be told.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice && inspirational  Farhan Akthar is awesome !!",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the best movies that I ever had the opportunity of watching... The intense emotions portrayed in this movie glues the audience to their seats and outweighs the factor of length!",
            "review_date": "2013-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akhtar both runs and acts his heart out in this rather long yet triumphant recounting of Milkha Singh's struggle as an athlete.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Koi majaal hai ki Pakistan k samne India Haar jaye! Tu Bhaag Milkha! :D\n\nThe movie's first race in which Milkha Singh triumphs was against a Pakistani and the story ends with the same cliche! Except for that and many other reasons (too many dance numbers, sonam kapoor, etc) the movie was a nice watch. Farhan's hard work and Pawan Malhotra's delighful performance saves the day.\nLittle over hyped and extremely long!",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant in technical aspects, mehra directs the film none less than a celebration....the execution is spot on. Bhaag Milkha Bhaag is one enjoyable biopic.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well made rendition of a truly inspiring Milkha Singh. Farhan Akhtar does a fantastic job as always of living the role. Slick editing and screenplay.\nOther than the movie being 30 min too long, it's a great show.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's based on true facts, brilliant work from Farhan, you can see from his body how much of effort he put in.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sprinting through the 400m track, Milkha Singh flies with a dream to win glory, with purpose to shine for his country and reason, to overcome his weakness. Honed by expert coaches and disciplined by the Army, Milkha Singh achieves what no athlete could with his background. \nThe finest visionary filmmaker, Rakeysh Omprakash Mehra (R.O.M) introduces Milkha's childhood to delineate the events and circumstances that made the orphaned refugee a world class athlete. The inspiring real life story is nothing short of epic on the cinema screen with Farhan Akhtar, embodying a soulful portrayal of R.O.M's envisioned protagonist. \nThe parallel storytelling smoothly transitions between the humble beginnings of young Milkha, the events of partition that led to him taking refuge in Delhi's camps and his rebellion against his circumstances that made his coal-blackened hands hold the Indian Army's guns. It was at the Army camp that Milkha got the opportunity to represent the country as a runner and it wasn't until he went through rigorous training and transformation to fight his inner demons to overcome his horrifying past, that we see Milkha's ultimate success and recognition as the Flying Sikh. \n\n\tIt all begins with the race at the Roman Olympics when Milkha Singh failed to clench victory. A distraught Milkha has the opportunity for reclaiming glory in Pakistan, where his original home and memories remain. Those memories are of a fun-filled childhood when he ran barefooted across open fields. Those memories are also of him running away from his village where he witnessed the slaughter of his family. Partition drove Milkha to the refugee camp in Delhi where he reunited with his sister, only to run away from his circumstances to liberation. Stealing coal from moving trains and a rebellious zeal were the premise of Prasoon Joshi's outstanding lyrics for the song Zinda that plays through his transition. This song will remain an anthem for the ambitious, driven youth. \nLove takes over Milkha's life with the innocent Biro charming her way into his heart. But Milkha's inability to find a respectable livelihood separates him from his love with a newfound ambition. The Indian Army is where he learns about respect and a cross-country trial was where his talent was recognized. Milkha had been running all his life. He ran for fun, he ran from fear, he ran to rebel and he even ran for milk. It was now time to run for glory. \nMilkha Singh poured sweat and blood while training. While being completely dedicated to running, his affair with an Aussie girl prior to the Melbourne Olympics distracted him from the cause and he failed to qualify. Disappointed with himself, Farhan portrays the raw emotion with punishment in front of the mirror. His next goal is to break the 400m world record and when the aims are that high, so are the training grounds. R.O.M has showcased Ladakh in all its desolate beauty. One can appreciate the harshness of the environment where Milkha trains rigorously for yet another transformation, this time a more physical one. Farhan's painstakingly developed brawn is that of an athlete and one has to applaud his genuine effort. \nOver time, Milkha Singh achieves success on the track and unimaginable glory for the nation. However, after the Roman Olympics, even the Prime Minister urges him to run in Pakistan but that land is a deep scar in Milkha's memory and he will have to fight his demons to overcome his weakness. With renewed focus and nothing to distract him from running to the finish line, Milkha attains the title of the Flying Sikh with his epic victory.\n\n\tRakeysh Omprakash Mehra has brilliantly visualized an inspiring story of the legend, ofcourse adding his own dramatic elements, and given us a masterpiece to live by. In familiar styling of setting distinct color tones for flashbacks and using ultra-slow motion photography, he greatly enhances the visual feel of several important scenes. Rather than straying into prolonged sequences of Milkha Singh's accomplishments on track, Mehra focuses on the events and circumstances that made the Singh the Flying Sikh. The events of partition, loss of parents, life in the camps, stealing as a means of survival, losing love to society's cliches, finding respect in the Army and mentoring by his coaches were the influences that shaped the young man into a world-class athlete. \n\n\tFarhan Akhtar had spent days with the living legend, understanding his character while transforming his physique to appear athletic. His dedication to the character and his own contribution to its depiction are truly remarkable feats because you do see him as Milkha Singh and not Farhan Akhtar. That, in itself is one of the greatest achievements of an actor; to immerse into the character so deeply that the audience fails to recognize who you really are. Farhan's sincere performance gives us a much needed insight that no documentary could have. In essence, he briefly re-lives Milkha Singh for the generations that did not witness his glory. Such a performance is to be cherished and must hail accolades at ceremonies. \nSonam Kapoor in a brief role as Biro is charming and vital to the story's evolution. Japtej Singh as young Milkha is versatile with his emotions and has a good understanding of the character's circumstances. Divya Dutta is a great talent and has been used wisely by Mehra to bring an emotional balance in Milkha's life. Yograj Singh as National team Coach Ranvir Singh is simply outstanding as Milkha's progressive mentor. Perhaps the most heartfelt and genuine performance is of Pawan Malhotra as coach Gurudev Singh. His emotions are keenly felt and as exemplary an actor as he is, one must appreciate Mehra's casting that brought the best out of him. \n\n\tShankar-Ehsaan-Loy's return after a lull period justifies the time spent in creating the score for this film. From the uplifting background score to the petulant theme of Gurbaani that is enhanced by Daler Mehendi's passionate vocals, the trio have variety and pertinence for the film's subject. While Mera Yaar, Rangrez, Slow-motion angreza are tracks that could be edited to make the film tighter, they are still melodious tracks to listen to. Arif Lohar's Bhaag Milkha Bhaag is a subtle anthem for his training in Ladakh but its effect is definitely uplifting. The rock version by Siddharth Mahadevan is inspiring and suited to the end credits. Maston ka jhund is catchy, fun and similar to Khalbalee in its effect. But the film's best track is the powerful Zinda that catches the spirit of Milkha Singh. It's the song that works while passing cars on the highway, in the gym, bathroom, while running or even jumping over train compartments. Kudos to Siddharth Mahadevan for its captivating vocals. \n\n\tRakeysh Mehra has adroitly used technologies to enhance the film's emotional feel. Milkha's feet running over sands, him running over train compartments and crossing the finish line in slow motion are visuals that one cannot erase from the mind. He captures the essence of the dedicated athlete for whom running meant more than just a sport. It gave purpose to his life. Prasoon Joshi's writing is yet again commendable and has more impact when visualized by Rakeysh Mehra. \n\n\tThe hard work put in by everyone in the film is apparent in its realistic depiction. The sincerity is keenly felt and the passionate portrayal of Milkha Singh is warmly embraced. There might be a song too many and a sequence or two prolonged, but Milkha Singh's story is an important one nevertheless because it reminds us that there are no shortcuts to success. It comes at the cost of sacrifices, buckets of sweat and ounces of blood in its journey. \n\n\t- 9.488 on a scale of 1-10.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once a while there comes a story that actually touches your heart and makes you inspired, Bhaag Milkha Bhaag (Run Milkha Run) is one of it. Phenomenal! Capturing the real life story of India's greatest runner, Rakeysh Omprakash Mehra has done a fantastic job. Biggest credit should go to Farhan Akhtar, his performance deserve a standing ovation. If there is one reason to watch BMB aside to Milkha it is to watch him. National award for sure next year! Sonam was beautiful but such a short role. Overall, Bhaag Milkha Bhaag is one of the best mainstream films to come out of Bollywood for 2013 which surely win many accolades in next year's award. Salute to Milkha and Farhan! Dont miss it! Watch it!",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akthar is a true performer..",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an incredible movie! If a bit long and dramatic by Hollywood standards, it makes you think about what it means to be a great person and a great athlete - very inspiring!",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie,great acting...A must watch....though all parts of the movie may not be true(inspired by a true story NOT based on it).",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an entertaining and at times glamorized biopic :)",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie, one of the best Indian movies I have ever seen. 5/5.",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant for what it is. An inspirational galore with amazing cinematography and soundtrack, though unnecessarily long. Farhan Akhtar stands out with his amazing acting once again.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painfully slow, cliche dialogues, love at first sight ...(?), very unimaginative direction.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie, one of the best Indian movies I have ever seen. 5/5.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akhtar's sincere and heartfelt performance and some inspired moments of direction by Rakeysh Omprakash Mehra make up for melodrama and an overindulgent running time. This is an inspirational and soaring tribute to a sporting legend.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The themes of sports, history and emotion were linked in a creative manner throughout this film, and maintain a comfortable hold of the audience's emotions. Although Bhaag Milkha Bhaag did have subtle prominence of Bollywood melodrama, it also inspired charmingly.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely brilliant film based on the true story of Milkha Singh.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day: Sunday\nDate: 6 Oct 2013 \nTime: 10.00 pm\nWith: Maa, Azeem\nOn: HDTV",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story telling , could have been more precise . Good cinematography !",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well...what can i actually say about this movie? only one thing i guess,,EPIC!! this historical movie based on Milkha Singh's life may be a new face to the whole indian cinema.This very meaningful and special movie has shown its worth in a very limited time i would say,BMB is basically exceptional in its way of portraying survival of an inspirational individual and obviously the way he fought his way through his circumstances.\"THE MAN IS STILL LIVING HIS DREAMS\"",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bhaag Milkha Bhaag is the epitome of what a Sports Biopic is all about, stirring performances, slow motion pieces, emotional background and goose bump inducing moments galore.\nRakesysh Om Prakash Mehra who gave us Rang De Basanti but also Dilli 6 is in supreme fettle and is blessed with Farhan Akhtar in the title role. What is something that this fella can't do!! After wearing the hats of talented Director, passionate script-writer, soulful singer and now wonderful method Actor. Lawrence Olivier the legendary actor when confronted about a scene done by Dustin Hoffman in which he was not supposed to have slept for three days, as to how he did it, Dustin said he actually didn't sleep for 3 days. Sir Olivier retorted that ''Why don't you just try acting''. Robert De Niro trained as a boxer for Raging Bull and fought boxing matches in Brooklyn and gained 27 kgs while Christian Bale lost 27 kgs for 'The Machinist'.\nIn the 18 months of diligent preparation for this film, Farhan Akhtar transformed himself into Milkha Singh and while watching the film you are really made to believe that you are watching a young Milkha Singh and not an actor. There is always the chance that all the build-up in the tiring preparations may go to waste if the actor is not able to handle the gravitas of the role by Farhan nails it. The muscular build-up on the lines of Brad Pitt in \"The Fight Club'' gives more than ample credence to his being perfect for the role and his emoting grows leaps and bounds from Rock On days. Sonam Kapoor shines in a small role where she smiles and blushes at the right moments in the right doses to leave more than a lasting impression. It's the supporting cast that takes the cake and the cherry led by Divya Dutta who plays Milkha's elder sister and makes your eyes wet every time she in on the screen,oozing maternal instinct in extreme doses, Pavan Malhotra and Yograj Singh (father of cricketer Yuvraj Singh) as the coaches of Milkha Singh elevate the film to Cult status. The songs are in line with the tempo of the film and the Cinematography uses the various color palettes to amplify the different eras in the movie timeline. Prasoon Joshi spins a good yarn and Rakesh Mehra is the perfect Captain of the Ship, even putting in a blink if you miss role as a Pilot. This inspirational film shall become the next Movie after Chak De India to be played over and over again to various Motivation seekers and could be a good shot at the Foreign Film Oscars if the makers are ready to trim 30 minutes of the film to make it crisp and more impactful.\nBMB brings to light and focus the Flying Sikh in all the well-deserved glory, which many of his fellow country men are not aware in its entirety.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring, emotional and a brilliant tribute.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watchable once. Not bad.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just go watch it! It's movie of the year! Terrific performances and what a great story!\n\nMust watch! Repeat: DO NOT MISS",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "quite an inspiring biopic",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a single wasted scene in this gem. Collector's item. Do Not Miss! Although, I think Farhan Akhtar's acting needs to improve a bit. His attention to detail in getting the look and feel of the character, and the director's attention to the movie in general was awesome. They deserve many more stars for that.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all the stars are only for Akhtar and the fabulous cinematography.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's such a great story and a legend to be aware of, to get an idea of his(Milkha Singh's) time. In doing so, the movie delivers a great entertainment to the audience, however, too much attention to detail and overkill at many instances/scenes, the movie overshadows and loses focuses on what could have brought it a straight 10/10.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A steady biopic based on the life of athlete Milkha Singh, Farhan Akhtar delivers an good performance on screen for the role of the athlete. The film has an alright story, but its worth the watch!",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine cinematography. Acting could have been much better. Looks amateur. Still waiting for a true story movie from India that would satiate me completely.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best biography bollywood has produced.",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the flying sikh !!!!",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does the film reach the platinum standard set by Jo Jeeta Wahi Sikander? Sadly no, but Farhan does deserve an applause. Terrific camera work for the races though..",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS THE BEST MOVIE EVERRRRRRRRRRRRRRRRRRRRR!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best things about this movie are Farhan and the dances!",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 star movie in bollywood. .after long time.",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The media can be a cruel and unforgiving foe. With it's short term memory it can create a hero, and destroy a man within a rather short timespan. This is echoed in the real life story of Milkha Singh, who before now had ceased to be a household name in India despite his many remarkable accomplishments. Director Rakeysh Omprakash Mehra and writer Prasoon Joshi do not mask this fact. Actually, its one of the most poignant and subtle statements made in the film minutes into its opening. The news headline reads \"Milkha Singh, the great Indian tragedy.\" I was immediately intrigued. \r\n\r\nThe events unfold amidst a fascinating time in India's history, often referred to as the golden years, following India's independence where nation building and patriotism covered a dark and murky blot on the map that stems from the partition of India, and post-independence Pakistan. Farhan Akthar gives a brilliant performance befitting of a glorified hero, but reveals a soft and broken side to Milkha's character, that makes him seem almost ordinary. The extraordinary was the unbreakable spirit, the dedication of a human being to achieve the unattainable, to face unthinkable adversity and emerge to face yet another. Filmmaker Rakeysh Omprakash Mehra and actor Farhan Akthar put Milkha Singh's name back on the map and re-introduce him on the world stage. The actor trades in his clean-shaven, urban and hip good looks for an appealing 'Son of Sardar.'  His transformation throughout the film is remarkable.  \r\n\r\nThe narrative unfolds in a series of sometimes disjointed flashbacks, in which Milkha finds himself a victim of cruel and unpredictable circumstance. The character's simplicity is endearing. He's often alone and finds refuge in good friendships and romance. He must make something of himself and that leads him to the army. Here he learns discipline, and finds his hidden calling. His time in the army makes for some great comedy. The Jawans (enlisted men) provide comic relief and one of high points of the movie with Maston ka Jhund, a wicked Bhangra which displays Farhan Akthar's dancing ability. The track by Shankar Ehsaan Loy is memorable, as is O Rangrez the ethnic romantic ballad and Gurbani which is sure to give you goosebumps. The supporting cast provide some stellar performances notably Pawan Malhotra, as Milkha's army coach, who becomes a father-figure to him, Divya Dutta as Milkha's older sister, and 12 year old Japtez Singh, who landed the role of a lifetime as young Milkha Singh. He delivers a brilliant and energetic performance that will warm your heart. He has a winning smile and is well on his way to being a true charmer. \r\n\r\nFilmmaker Rakeysh Mehra tells an interesting story and backs it up with references from history. The cinematography, captions, slow motion and old film reel are very reminiscent of his Documentarian past. I didn't mind it so much. The indian audience and some film critics were not impressed by the sometimes slow pace of the film, and the painstakingly slow-mo moments which are meant to have you savour the moment. I don't know why we are so rushed. If something is so good, why do we feel the need to rush right through it. I think of it like a good stage performance, after tons of practice, you get up on stage and deliver a masterpiece, but you don't hear it in the moment, you can barely recall the seconds to minutes that it took place. All of a sudden the audience is on their feet roaring, and you take a bow (or run an extra lap) and attempt to savour the moment in all it's glory. I can only imagine an athlete telling his story some 50 years later, reliving every 50-second 400m race, dissecting what went right, and not so right. Seconds that changed history, and marked his transformation from ordinary to extraordinary. The slow mo isn't for us. \r\n\r\nDirector Rakeysh Mehra clarified in several interviews that this is not the story of an athlete, it's not a film belonging entirely to a sports genre. Naturally track and field play a a huge role in the narrative, and the races ran superbly by Farhan Akthar, will get your adrenaline going. His physique is remarkable and anyone who watches competitive track and field will note his posture, demeanor and athleticism which is flawless. It's easy to forget your watching an actor, who has trained for the role, and get immersed in the character, as Farhan becomes Milkha Singh. The film is really about the triumph of the human spirit, and the ability to shed the shackles of your past, but it doesn't hurt the sports genre either. For any athlete looking for inspiration they will likely get it here, and for a culture that fails to put much emphasis on talent and vocation, over financial stability and prestige in intellectual pursuit, will hopefully prompt a second look. This is the aspiration behind the film; Milkha Singh sold his story for 1 Rs. in the hope that the proceeds generated will fuel a nation of athletes. \r\n\r\nNow I'm not one to get star struck and it's no secret I detest the term 'hero' which refers to the male lead in Bollywood films. My 'hero' is the most often the script, and sometimes the director. Rakeysh Mehra delivers another monumental film as a follow up to Rang de Basanti (2006) which achieved cult status and challenged the nations idea of patriotism. The impact of this film remains to be seen once the dust settles but I have a feeling it won't be too far off from that. The script is sometimes flawed, and I would've hoped for something a little more fluid. But unquestionably the hero in this film is Farhan Akthar who delivers a performance of a lifetime. The director turned actor doesn't have many films under his acting belt, but each is memorable with his performances. His dedication to transform his body into that of an athlete does wonders for the authenticity of this character. Farhan Akthar etches a lasting image in Indian filmography with this performance and carves a place in history for Milkha Singh with this role.",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ITS VERY NICE MOVIE I LOVE IT\nFARHAN AKHTAR ROCKS THIS MOVIE. SUPPERBBBBBB",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest, I was not expecting much from this movie, I found the trailer boring but one of my friend dragged me to watch this movie and I must admit I liked it a lot. I'm speechless by Main lead's acting, he was really good and convincing, you can see all that hard work put into this movie, I had great time watching it.",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A full masala musical with lots of action, unconvincing drama, romance & comedy. Dragged at times, dramatized to make the film a commercial effort. Wish it coulda been more like Paan Singh Tomar, a fine movie nonetheless. Thank god a foreigner made 'Gandhi'!",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan lacked the look of a convincing sardar.. however that was backed up by a very strong plot and bitter reality! Overall worth a one time watch!",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie... very inspiring....\nhats off .......milkha singh , farhan akhtar, rakeysh omprakash mehra..",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is \"inspired from a true story\".. there is a clear difference in the verbatim..!\nthe Cinematography and special effect stand out. The Music and Background Score are a big plus..\nDivya Dutta, does a fablous job.. while Prakash Raj was wasted in a short role.\nRakeysh has made sure, the movie has rich graphic content, and foreign locations.. kinda commercialized, and sarcastically justified.\nI dont considerr Farhan to be a good actor, but he hass amazed me throughout.. with the makeup, body language, fitness and his dialogue delivery. \nI hvent found it \"INSPIRING\",  but a decent watch..@MILKHASINGH #RESPECT.",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Sports Film from India so far. Very inspiring, emotional, and simple, all at the same time. Farhan Akhtar did a great job!!!",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is about the story of Milkha Singh the great Indian runner, soldier, and hero. The film evokes patrioism like never before, a masterpiece... Farhan Akhtar as the flying sikh has not only given a career best, its probably best performace seen years he was Milkha Singh, he better get ready for all the awards. Divya Dutta, Pawan Malhotra, Yograj Singh, and Prakash Raj also give superb performances all were MINBLOWING!!! Dir ROPM has given his career best film and that saying alot for the RDB maker, he gave the film his heart and soul, take a bow sir. Overall this is a film not only Indians should see but the whole world needs to experience the heroic life of living legend the flying sikh MILKHA SINGH!!!",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long for a story which could be told in about 30mins but keeps you going only because of the stellar performance of Farhan Akhter",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.Salutation to Milkha Singh .Kudos to Farhan Akhtar,the director and to the full team of Bhaag Milkha Bhaag.......................................Hats off!!A Must Watch!!!!",
            "review_date": "2013-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farhan Akhtar does an incredible job - at 3 hrs 8 mins it can get a little tiring in the second half but this is one of the year's best. Highly recommend",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some scenes were gruesome, some were very tragic, all in all, despite some shortcomings, I learned a lot about a legend and had a great time. 4 stars!",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Longer but worth watching in theater.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lengthy but worth it!",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, making a biopic is not an easy task. Take away the fun and the drama and there is a huge risk of turning it into a documentary. Add too much of it and you rob it of its essence. If it's a commercial film, it has to have the right blend that makes it entertaining and also moves the viewers.\n\n\nMilkha Singh is a name I have grown up with. The Flying Sikh! The man who turned his tragic past into a life of learning and victories! \n\n\nI could have never imagined Farhan Akhtar essaying this role. But then there are only a handful of actors who become the character that they are portraying. Aamir Khan and Farhan Akhtar sit right at the top of that list. From the body language of a boy from Punjab to the dialect and demeanor - Farhan gets it all right!! The naivety, innocence, enthusiasm, angst, anger, disappointment and uncertainty of the character are all played out with such brilliance that you forget that you are watching an actor playing someone else. His unrelenting spirit and the will to be the best rub off on you. Milkha becomes India and Farhan becomes Milkha!  \n\n\nIt is a great story already and now it has been filmed in the best possible way. There is humor aplenty and heart touching moments in equal measures. Partition scenes in particular are hurtful and sad! \n\n\nAll the actors are exceptional. Sonam (un!)fortunately has nothing much to contribute. Not sure if she would have done any better had she had more scenes. Divya Dutta is exceptional as the big sis. Almost every scene involving her moves you to tears. The boy who plays young Milkha is outstanding! And so are both the coaches. \n\n\nMusic is inspiring and fun and goes brilliantly well with the mood of the film. Hats off to the cinematographer for making every scene look like an unforgettable piece of our history. Also, great set designing, particularly in the post independence scenes! Stylists did a great job turning Farhan into an adorable Sikh boy, and Farhan too has worked so hard not just on his body but the total look of the character and he looks fabulous!!\n\n\nI feel it could have been slightly shorter, but that is totally forgivable, considering what an awe-inspiring story it is! There is not a single dull moment and probably after Lagaan, this was the first time when I witnessed people clapping, cheering and crying (tears of joy) all at the same time! \n\n\nThis film is all about passion - The Director's, the actors' and most importantly the legendary Milkha Singh's!\n\n\nA must watch!",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimate movie , perfectly crafted ...must watch...",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie...must watch...take bollywood movies to new level",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little long, but Farhan stole the show.. worth a watch in the theater",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The length of the film is simply overpowered by Farhan's steely performance as Milkha Singh and Bollywood withstanding the melodrama never gets to the point of being overdone. It is not the story of running and winning against all odds but rather the story of fighting our own fears and demons. It is not Rang De Basanti but it will do.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice story. Good presentation. But could definitely have been half hour shorter. Enjoyable watch nonetheless.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an inspiring film. Memorable and earnest  performance by Farhan Akhtar.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rarely give a movie 5 stars, but this movie is near flawless.  Length would be it's greatest flaw.  The performances are amazing, especially Farhan Akhtar's performance as Milkha Singh.  Amazing.  This is a \"must watch\" movie for any Bollywood fan.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie - Rakeysh Omprakash Mehra does a remarkable job of showing the biography of one of India's finest athlestes untold stories. As similar to his last movie - this movie unfolds from past to present - going back and forth yet keeping the audience engrossed in the life of the athlete plus showing the pain of the partition era.  Farhan - he is turning out to be a revelation as an actor and does real justice to the character. He does bring out Milkha Singh alive on screen and does justice to the role. This movie is arguably one of the best sport movies ever made. The grit,determination and perseverance with which the character is played out is what really stands out . Final word - Bhaag to the nearest theatre to catch this wonderful biography of the Flying Sikh :)",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece.  This is world class cinema.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Runinspiring ! Worth a watch even for the non-runners. A bit too long & a little dramatized yet great. \nIt's interesting to note that there no Bollywood movie made on any cricket but there are two on runners !",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit too long, but still worth a watch.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch!! Hat's off to cinematography and screenplay. No one could have done it better than Farhan Akhtar :)\nRakeysh Omprakash Mehra-Another feather added to his cap :)",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "http://theblahqueen.com/bhaag-milkha-bhaag-movie-review/\n\nIts an average movie.. watch it for Farhan akhtars acting if u want to !!",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best inspiring movies I have seen in years,It has action,comedy,drama and Romance...I would love to give it 5 star but Sonam Kapoor takes my half Star away....... Farhan Akhtar you are Dude ..... Hats Off",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tagged a biopic by its team, BMB awfully looks like a movie laced with best of the commercial treatments Bollywood garnishes its offerings with to satiate the cravings of masala movie lovers. It is everything but a serious cinema on the life of an unsung Hero, Milkha Singh.\n\nBMB should outrightly be dismissed as an overly hyped and a well marketed movie. I pity for movies like Paan Singh Tomar which was made at a budget of a meage Rs. 4 crore (compared to Rs. 30 crore of BMB) and had all the right ingredients for a biopic. Atlast, movies like BMB reassure the fact that we still have a lot more Indian sportsperson(P.T Usha, M.S Dhoni) whose stories are waiting to be told on Celluloid in a much more somber and sincere manner.\n\nRead full review at www.vjmoviews.com",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you dont want to miss even a single minute of this",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The overlong bio-pic about the \"flying Sikh\" doesn't quite take off. But still its a one time watch.",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing Movie.....\nAn awesome work done by the entire cast and the director.\nHats Off to Farhan Akhtar and Omprakash Mehra",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "milkha misrepresented as a bollywood hero! :(",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the unfortunate example of where the whole is much less than the sum of its parts.\n\nThe movie, based on the life of Indian legend Milkha Singh, tends to get lost in its own grandeur and quest for technical brilliance.\n\nMilkha Singh is a true legend for the way in which he has overcome unthinkable odds and a tremendously traumatic childhood to become an example for the youth, especially of today, who seem to take life's luxuries for granted.\n\nThe problem with the movie is that it is \"based on a true life\", thus keeping you wondering what parts of the movie were true, and what is cinematic license. This, in my opinion, does water down the greatness of our very own Flying Sikh.\n\nA runtime of 3hrs 8mins (time spent is almost 3hrs 30mins thanks to the interval and ads) is far too long and there are many scenes which really do not move the narrative forward and really begin to test your patience. I think that Mehra got a bit carried away in the editing room and indulged himself a bit too much.\n\nThe performances are very good.\n\nFarhan Akhtar, playing the lead, looks every bit the part, but unfortunately he is totally unconvincing the minute he opens his mouth. No evidence of a Sikh youth, brought up in the hinterland, in the accent. Sounds just like he did in Rock On or Zindagi Na Milegi Dobara. That said, he excels in every other aspect. Clearly having devoted his all to looking and running like Singh, the effort pays rich dividends.\n\nSonam Kapoor, as Singh's love interest, has really what one would call a \"guest appearance\" and plays her part satisfactorily and efficiently.\n\nPavan Malhotra, as Milkha's coach and mentor, is simply fantastic. He looks and sounds the part in a way that you would never, not for a moment, believe that he is not a sikh!!\n\nThe star of the show, however, is Divya Dutta who plays Singh's sister. Her pain, anguish and internal conflict are so well portrayed without even an ounce of melodrama. The more sentimental of you people had better be warned to carry a big enough hanky or napkin or towel, depending on your disposition.\n\nThe music by Shankar-Ehsaan-Loy (look out for Loy's cameo in one of the songs!!) is top notch. The song that really stood out was \"Havan Karenge\", this will be a big hit in all the clubs etc for sure.\n\nThe cinematography is par excellence, with locales and scenes really well captured.\n\nSo, as you can see, I have only had praises for all departments of the movie, but can still only give it 2.5 stars, and this is the problem.\n\nI would definitely recommend this movie to you, but only so that you can get a sense of what odds Milkha Singh has had to overcome in his life, and also how pure determination, hard work and sincerity can make you achieve goals and targets that you may think are beyond your reach.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best biographical movies made in Indian Films. Starting is a bit similar to another great movie \"Paan Singh Tomaar\". Farhaan Akhtar was so realistic that you will imagine Milkha Singh himself is acting. Rakeysh OPM, \"captain\" of the movie continued his love affair with Dilli and done a fabulous job. This might be India's Oscar pick for this year and Farhan will get most of the awards. One or two of the songs could have been cut short to make this movie even better. A must watch.",
            "review_date": "2013-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It really is a challenge to adapt a real-life story into a powerful script, but Rakeysh Omprakash Mehra amazingly achieved this feat with flying colors.  This is definitely up there with Rang De Basanti as one of the industry's best dramas. Farhan Akhtar performed brilliantly, proving once again that he is as good an actor as he is a director.",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story but I just wish the editor had done his job and cut atleast an hour off the movie...",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main actor Farhan Akhtar is certainly a superhit, the only who could come close to Sharukh Khan. His physical presence, his abilities to play the star and to play the insecure are unmatched in modern indian cinema. The movie itself is a simple, sometimes too simple, too formualic biopic, and before the end I was sure the only reason for this movie to be made was the extraordinary sexscene with a pretty white girl, and the typical indian patriotism against the pakistani. But after the ending I was also convinced that the 8/10 stars on IMDB and here are deserved. Even with all the flaws.",
            "review_date": "2013-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good adaptation but long.. and stretches in too many details..",
            "review_date": "2013-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfection is what the theme of this film is. Absolute genius work my Mehra rightly chosen as the director by the real Milkha Singh to tell his story. But a national award & tons of best actor awards are waiting for Akhtar for his role. Simply brilliant! Slightly stretched on the story but you only realise that on stepping out of the cinema. Excellent camera work too.",
            "review_date": "2013-07-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}