{
    "rating": 7.6,
    "release_date": "2013-11-01",
    "num_reviews": 70,
    "genres": [
        "Drama",
        "Sci-fi"
    ],
    "summary": "In 2092 the last mortal human (Jared Leto) on Earth reflects on his long past and thinks about the lives he might have led.",
    "reviews": [
        {
            "content": "All choices made is the right choice",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "A bizarre and ambitious movie that it fails to execute its premise to perfection but regardless it's worth watching for its ambitious ideas.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "Jared Leto...You either love him, appreciate him or you ask yourself, \"What the hell did I just watch?\" Frankly, I appreciate actors who put it all on the line for the story, the writers and trust the production crew to simply do their job. He always seems to pull it off somehow and that continually pulls me in. He'd be perfect for a \"Black Mirror\" episode...reprisal.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "The more I watched the better it got.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "Could've been better if some believable conclusion was made. Just like modern philosophy where nobody seems to give clearer answer about the universe, the movie just doesn't know how to properly conclude the story. The beginning and the middle made a lot of good ideas to ponder, but once it moves toward the end, the movie eventually can't decide which one of the many chaotic unsatisfying philosophies (I wouldn't dare call them science) to stick to, so takes one of the many worse ideas with some melodramas to pull the heart strings of the audience.",
            "review_date": "2022-11-17",
            "source": "rt"
        },
        {
            "content": "I almost didn't finish watching due to it being so tedious to watch.   I skipped ahead out of curiosity.  I don't think I missed anything important, and I probably skipped half the movie, but at the end it actually finally made sense.    I can see why people watch it multiple times because the first time you watch it, it's a lot of \"WTF?\"\nGreat cinematography, great acting, just too hard to watch.",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "More philosophical drama than outright sci-fi, MR. NOBODY is ambitious in everything from ideas to execution. Impressive visual effects and skillful transitions support a complex three-story narrative that allows for some deep inquiry. The film is overlong, however, and indulges in aspects of the stories at the expense of the larger whole, obscuring some of the ending's possible impact. A worthwhile watch with tempered expectations.",
            "review_date": "2022-10-13",
            "source": "rt"
        },
        {
            "content": "This is an awesome film that requires in-depth analysis. Much quantum physics, psychological, and scientific theories are subtly included in this story plot. It can be confusing at first; hence, it is important to rewatch it.",
            "review_date": "2022-10-09",
            "source": "rt"
        },
        {
            "content": "Weird fun artsy movie. a bit long, but still good.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "Sens przeplatany z absurdalną abstrakcją. O czasie, życiu, wyborach, konsekwencjach, miłości i przemijaniu",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "I love any movie that makes me think deeply about time and the possibilities of life. This one will have you think about it for a long time.",
            "review_date": "2022-05-18",
            "source": "rt"
        },
        {
            "content": "I am very surprised by the ratings of this movie! I find it very interesting in the concept, well written and well-directed. It's one of my favorite movies and I would recommend it 100%!",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "It's not like any thing I have seen before, truly unique, can't imagine the effort exerted to direct and act in this film; it's a philosophical idea and a concept made in a very soulful way. it's a shame it wasn't given the proper chance to be shown, cause it's an excellent film!   \n\nit's a half a star away from perfect cause I felt some scenes in the 15 year-old period were redundant, but maybe that's because I watched the longer version.",
            "review_date": "2022-03-25",
            "source": "rt"
        },
        {
            "content": "It's an excellent movie, with Mr Nobody (2009) and name is Nemo (Latin)=Nobody showing how it's a masterpiece of motion picture...\n\nFrom this film, actor, Jared Leto's portraying Nemo and then you never know he will later become a bald old man, as Paolo Gucci in House of Gucci,  (2021 )...",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "Pretentious for basically being ‘Don Juan' crossed with ‘Benjamin Button' and ‘Forrest Gump' then given a sci-fi twist.  Started out promising only to end up too melodramatic, too relationship driven, too soft hearted, too drawn out, too ambiguous throughout, and too long in the end.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "It takes effort to watch, it's too long for how little coherent message it has to transmit, but there's something enjoyable about the style of it that doesn't allow me to take it down to a 6/10.",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "Spoilers: What? Sort of epistemology meets cinematography meets astrophysics meets all you need is love meets Alice in Wonderland meets Benjamin Button. The joke is that at 118, evolutionary humanity-science-medical technology has made this guy the last mortal, which means Nemo's time has run out, but at the end, time has reversed so he gets the last laugh because his time ain't up after all. Sheese. The epistemological question is the key: How do we know, how do we know what we know, and are we kidding ourselves about knowing anything? Any piece with Jared, Diane, Sarah, Juno, Rhys, Natasha can't be all bad and they all delivered. So just when the human race figures they have it licked and nobody dies, all of reality going back to the Big Bang and forward may well reverse at some point and time may reverse, too, changing everything yet again. Putting all this thought into film, making it coherent was quite a challenge, and the coherence frequently devolved into chaos, which was the plan. So, in the end, it was fine to focus on Jared at his many jumbled ages, because we can relate to a guy's experience, comparing it to our own. So what is the point of the exercise? Is it just nobody knows much? So what do we do? Not all that much till it ends, which it probably will end -- or not. The moral of the story is Slaughterhouse Fiive-ish, as Billy Pilgrim hangs onto Montana Wildhack (Valerie Perrine) on Tralfamador in perpetuity. Nemo hangs onto the one captivating phenomenon that he was drawn to most in life: Anna. An eternity with Diane Kruger ain't a bad way to go. Better than digging a ditch. Maybe Lennon had it right when he sang: \"I just believe in me, Yoko and me -- that's reality.\" Gotta look in awe at the creativity here, Van Dormael up with von Trier and others of the most imaginative, daring and gutsy filmmakers. We didn't know from minute to minute what was going to happen next in this one, reality mixing with wishes, dreams and hopes. Hey, ain't that life? Not sure how they cobbled together the dough to even film this. Way better than Every Movie, Sequel 9. This is art house fare, surely for filmophiles, as you have to bring a lot to it, and uses the title ironically, as Nemo is not nobody, he is somebody we kinda like, as all of us are somebody, but it leaves open the  possibility that he really is nobody, and us too, just to emphasize the weakness of all our definitions in such a vast and incomprehensible time and space continuum as is this universe or multiverse, 14 billion or so years old.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "I had to watch the movie three times before I began to understand it! I am a physics major and the ideas of time and space are hot topics of physicists. The ideas in this movie are as if Back to the Future and The Eternal Sunshine of the Spotless Mind were shmushed together. The lead character, Nemo/Mr. Nobody lives different lives in many timelines. One minute he's old and the next he's young; he's living with one girl and simultaneously living with another girl. The movie follows him through his different lives. That's what 'new physics' says - that there are many worlds, each with its own events. I guess if I'm living in another universe, I'm not writing this review. I'm dancing at my wedding. I doubt this movie will appeal to many people - they'll feel lost - like, what the heck's going on? But if you let your mind accept that maybe we all live many lives, you can enjoy the movie. The more I watched it, the more I liked it.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "When will this movie never end?  And why must protagonists always have long hair and make them look a girl.  Sorry but I could not sit this one out!!!",
            "review_date": "2021-09-11",
            "source": "rt"
        },
        {
            "content": "This is an amazing film, if you can find the time and, mostly, the attention required to fully enjoy it. Also, it demands multiple viewings. It's certainly not meant for the casual moviegoer, but for those who like non-linear and complex storytelling. Also, the  original soundtrack by Pierre Van Dormael is absolutely moving.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "This might be a movie that needs to be watched twice, but the bottom line is the non-linear timeline lacks clarity. Otherwise, it raises some great questions about mortality and paints an enjoyable picture of chaos theory.",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "A movie tailored for every professional liar with an identity crisis.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "In that family of films where you need to read an explanation on what it's about before seeing it. Either that, or watch it twice with the explanation in-between. Love the ambitious reach and it's pretty well done.",
            "review_date": "2021-04-11",
            "source": "rt"
        },
        {
            "content": "It is hard to follow, but very interesting and worth a watch.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "Great film. Kept me interested the entire time and it made me horny for love.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "Jaco Van Dormael shows how much of a playground film making can be.",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "I have to wonder how this superb 2009 release slipped under my radar, but I'm certainly glad I found it. This ambitious attempt at answering many of the big questions about the meaning of life, love and what matters does a tremendous job of exploring these topics and in a way that's entertaining, enlightening and informative. Fans of the metaphysical, like yours truly, are sure to feel sufficiently nourished after watching this one, as it provides a cogent, accessible treatise on these subjects, effectively incorporating them into a thoroughly captivating narrative. Admittedly there are a few stretches where the pacing lags a bit, but that's more than made up for by the film's inventive visuals, brilliant production design, excellent soundtrack, clever editing, and fine performances by Jared Leto, Diane Kruger and Sarah Polley. Think of this one as a fusion of \"What the Bleep Do We Know,\" \"Cloud Atlas,\" \"What Dreams May Come,\" \"The World According to Garp\" and additional offerings, and you've got an idea what this one is like. However, if you're unwilling to open your mind to some cutting-edge thinking presented here, then skip this one, as it's not likely to be to your liking. But, if you enjoy the unconventional and thought-provoking, this one will be right up your alley. If nothing else, this legacy release is definitely a refreshing change from all of this year's mediocre awards season offerings that are being erroneously passed off as \"masterpieces.\"",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "This movie was crazy Coll! I just loved it and its take on time  and life. Add to that that it was a visual feast! It held me fascinated the whole way through and what a journey it was! Exactly how to describe it,  I couldn't ell you, but I wouldn't have missed it for the world!",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "I hope that it was intentional, but i found this movie extremely tedious, it seems to never get to the point, it's a straight line (or multiple straight lines) from the start to the end.\nGreat example of a great idea but bad developed.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "What a total mind fuck this movie was. Nothin. Made sense the entire time and it felt like a millions Stories were thrown at us at once. I never knew it it was good while watching it, but I had to make it to the end. \n\nJenn and I discussed this movie afterwards and we both kind of figured it out and it made us love the movie and really appreciate it for the masterpiece it was. Leto was incredible 5/5",
            "review_date": "2020-09-13",
            "source": "rt"
        },
        {
            "content": "This movie was really good, plain and simple. The music choices were amazing, the multiple story / timelines were interlaced well and shot beautifully. The actors were well cast and even after several watches, still an enjoyable movie.",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "Its complex, philosophical and ambitious themes may be too confusing and distracting for some, but these themes show the intelligence and competence of its storytelling, which makes it a smart, intriguing and cerebral sci-fi, with stylish visuals, impressive production values, well-crafted narrative, solid direction and superb performances.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Box office $3600. Generous. I guess better than watching paint dry.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "This film has what every sci fi film should aspire to..wit, whimsy, interesting science and a stunningly effective use of it. Science fiction should be, afterall, about scientific concepts, not just about cowboys and indians into space.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "Worst movie ever!!  Don't waste your time. Nobody will give me back the hours that I've lost. Trust me",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "it's not that you can do anything just because it's a movie.\nVery bad movie.",
            "review_date": "2020-06-22",
            "source": "rt"
        },
        {
            "content": "Beautifully made with stunning visuals, alternative universe & the difference each choice in life makes, the story follows Nemo (the always watchable Leto) on his deathbed in the year 2092 & traces back to when his parents divorced as a child & all the possible choices he could have made & the future they held.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "A complete life changing experience. A deep look into the memories, decisions and regrets.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "فيلم يتناول فكرة الإرادة الحرة، والاحتمالات اللانهائية أمام الإنسان بعد كل قرار.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "This movie is Amazing! it is unique, interesting, philosophical, excellent cinematography, excellent acting, excellent pacing, just What Isn't great? The very ending could have been better, but that's about it. I mean I'd like to spoil it, but it's not worth it because the movie is such a high-quality and brilliantly presented cinematic experience! The ending just had a continuity problem that was a bummer, but it wasn't terrible in any way and not worth a score degrade at all, because mostly my dislike of this Very ending was just personal taste. I also didn't Not-like the ending, but I wanted a connection. I don't think this spoils it in any way, and it will be clear by the end what I am talking about.\nThis is one of my Favorite movies, and it is definitely worth the shelf!",
            "review_date": "2020-04-02",
            "source": "rt"
        },
        {
            "content": "A nice story, perhaps, about the different directions life can take given the choices one makes, but ultimately going nowhere. Jared Leto shines, and many of the cast (particularly Sarah Polley) do as well, but they are failed by a story afraid to make its own choices. afraid to commit to one. Better than a lot, sure, but not that much better.",
            "review_date": "2020-03-25",
            "source": "rt"
        },
        {
            "content": "Meh.  Philosophy 101 idea, with interesting visuals.  However, as story telling it is extremely weak.  When Malick does stuff like this, at least he brings the art and impressionism.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "I'm pretty sure I liked this movie when I watched it long ago, but I can't really remember it! Oh well!",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "Very beautiful film that addresses the theme of possible ways to go in life where each choice has its own consequence. The film is very particular and interspersed with beautiful and very thoughtful parts to parts a little too strange for the film itself. However the film is very nice and intrigues quite the viewer who asks questions throughout the film and waits for the moment when everything will be explained to see if his theories were right or not",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "It's epic and one movie that you have to see.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "Very long, meandering, and difficult to discern meaning. It's an attempt to understand purpose via choice. But apparently that choice originates in the vision of a nine year old. Potential meaning surfaces now and then as one fluctuates between certainty and uncertainty. This movie is good for someone without answers to life's greatest questions. Interesting, but ultimately a waste of time. Bottom of the bin and forgotten for you. And that's my nine year old's choice.",
            "review_date": "2020-01-22",
            "source": "rt"
        },
        {
            "content": "Interesting take on superposition and choices we make.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "I think this movie is absolutely fantastic, but it's not a movie for everyone. If you say you really disliked it, I would completely understand. If you like slow, thought provoking movies, give this a try.",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "Best soothing experience you want to have and a great experience to be an avant garde movie means experimental a true combination of love science fiction comedy and a bit of information also.A good package of all these but u must be patience till first 10 to 20 minutes after u will get a mind soothing experience.Must watch.",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "My all-time favorite movie because it's exactly how I think the world over.",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "We cannot go back. That's why it's so hard to choose.\n\nMr. Nobody is definitely one of my favorite movies. I had the opportunity to see it again 10 years after his release (in a wonderful director's cut version) and I am convinced that he is aging very well. \nInitially it was not taken into consideration in my country (Italy); then in 2016 the Italian distributors perceived the enormous success they had decided to take it to Italy. My advice is to watch it in the original language (you can find it on Netflix); dubbing,in my humble opinion, is done in a hurry and doesn't fully make the beauty that the film carries with it. \nWhy did I like this movie so much? \nFirst of all, Jared Leto's performance is incredible, he really manages to extricate himself in a myriad of different roles with great skill. \nThe soundtrack and the non-original songs that accompanied the film are perfect (including Where is my Mind by Pixies, great!). \nThe film is complex, opens up a tons of readings and generates many questions, to watch and to review and to comment on. \nAnd finally, from a technical point of view, thanks to a very creative montage that creates a nice rhythm and a sensational photography is a pleasure for the eyes. \nIn short, for me it is highly recommended.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "Exceptionally built, both visually and storywise. ",
            "review_date": "2019-07-26",
            "source": "rt"
        },
        {
            "content": "It's my favourite movie, I've watched it like a million times. I love how Van Dormael maneges to mix up so many philosophic and scientific theories and translates it to a very compelling visiual. For some it might take to watch it a few times to get it, but I think the director really rises to the challenge. (It's my humble opinion)",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "Choice ... Life ... ",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "I have soothing memories of this movie. With reserve I give it the best rating after watching the trailer. Truly one of a kind",
            "review_date": "2019-06-16",
            "source": "rt"
        },
        {
            "content": "2.5 hours was just too long for what this movie was attempting to present  There is much better Sci-Fi out there.  I would rather have watched 2.5 hours of the science show  Nemo was hosting that they showed snippets of.  I got the \"choice is everything\" theme about 30 minutes in, the other 2 hours had some cool enough visual and what exactly is going on weirdness, but I feel that was 2 hours of my life I could have been doing something, anything better.",
            "review_date": "2019-05-30",
            "source": "rt"
        },
        {
            "content": "Extraordinary sci-fi story.",
            "review_date": "2019-05-15",
            "source": "rt"
        },
        {
            "content": "Muy buena, exquisita banda sonora",
            "review_date": "2019-05-14",
            "source": "rt"
        },
        {
            "content": "Mr. Nobody was directed by Jaco van Dormael. Heï¿ 1/2 1/2(TM)s also a screenwriter of this film. It stars Jared Leto as Nemo and Diane Kruger as Anna. The film won two Golden Lion at the Venice Film Festival.\nThe film is set in America in the 1980s and 90s. It was filmed on location basically in Belgium.\nItï¿ 1/2 1/2(TM)s about old last mortal men in the world who try to remember his own life story. Nemo is confused in thoughts for all film, but in the end he remember everything and become the happiest men in the world which means immortal. The most moving scene is meeting Nemo with Anna after they lost themselves for along time.\nThe amazing music of Mr. Nobody was written by directorï¿ 1/2 1/2(TM)s brother Pierre van Dormael. Itï¿ 1/2 1/2(TM)s the first thing why I strongly recommended this film. Another reason to see Mr. Nobody is gripping plot. The film turned out unpredictable and unforgettable for me!",
            "review_date": "2019-03-05",
            "source": "rt"
        },
        {
            "content": "The beginning started out a little rocky but then the interweaving of all of the very interesting stories with a great intersection at the end.",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "Long & bizarre but ultimately entertaining.",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "Good acting, excelent script, really good and hard working editing, beautiful photography, bullseyed soundtrack and about my favorite cinematography. A real peace of art, Mr Nobody was a hard story to tell, something never seen before, and they nailed it!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "Visually the movie is a masterpiece\nThe acting can be cringe worthy at times but honestly I love the tangled narratives and script",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "muy buena peli te deja siempre con la cara pegada en la pantalla y siempre tiene ese toque de misterio que hace no la pares de ver",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "An ambitious concoction of quasi-philosophical and meta-scientific cogitations. More a transfixing visual experience than a fully rounded work of auteur cinema, as an overly convoluted and somewhat unresolved narrative trajectory prevents true masterpiece classification.",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "This is a very well done but also very complex and strange movie. If you get it, or at least if complicated movies that require full focus and reflection are your thing, you're most likely going to love it. If not, you might want to skip it. Everything is brilliant, from the writing to directing to acting. There are a hundred ways to interpret the movie but romantic me likes to see it as a tale about true love. I would also recommend watching the extended version; yes it adds 15 minutes to an already long movie but it's worth it.",
            "review_date": "2019-01-01",
            "source": "rt"
        },
        {
            "content": "Itï¿ 1/2 1/2 1/2(TM)s an exploration into the bending of time and space that is overly ambitious and complicated, and is as unenjoyable to watch as Interstellar is enjoyable on the same theme. Truly it exists just to be exhausting. Itï¿ 1/2 1/2 1/2(TM)s literally like the filmmakers just got real drunk or high, or both and thought they had good ideas.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "This movie is art in life form...I cannot even begin to explain how it has completely changed my perspective on life...I'm just lucky to have come across such a spectacle.",
            "review_date": "2018-12-03",
            "source": "rt"
        },
        {
            "content": "Jared Leto prior to perfecting his \"craft.\"",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "I watched this on a whim not really expecting much and I can see how this movie isn't for everyone, but it resonated very deeply with me and brought me to tears more than once. Years later and I still find myself thinking about it from time to time; it stuck with me in a way that very few films ever have.",
            "review_date": "2018-10-14",
            "source": "rt"
        }
    ]
}