{
    "rating": 8.8,
    "release_date": "2013-09-27",
    "num_reviews": 130,
    "genres": [
        "Drama",
        "Action"
    ],
    "summary": "In the mid-1970s, charismatic English playboy James Hunt (Chris Hemsworth) and Austrian perfectionist Niki Lauda (Daniel Brühl) share an intense rivalry in Formula 1 racing. Driving vehicles that are little more than gas-filled, rolling bombs, Hunt and Lauda burn up the track, all the while pushing themselves to the breaking point of physical and mental endurance. Meanwhile, the women (Olivia Wilde, Alexandra Maria Lara) in their lives can only watch as both drivers risk death with every lap.",
    "reviews": [
        {
            "content": "Interesting enough I found this movie pleasing. Not that the writer had a clue but the action was pretty damn good.",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. Bruhl & Hemsworth give phenomenal performances. The racing scenes are phenomenal and filled with adrenaline. This moves effortlessly between the two characters and their triumphs and trials building to a great ending. This is without a doubt a film everyone should see at least once.",
            "review_date": "2023-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another winner from Ron Howard!",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the 2000s. Adrenaline, tension, emotions and fun perfectly combined in this very successful film.",
            "review_date": "2023-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well cast, well acted, good action, and a great story.  This movie was very well done.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely worth the watch. Bruhl's portrayal of Lauda is flawless and Hemsworth provides a surprisingly good performance as James Hunt. One area that annoyed me was Hesketh and Hunt's mechanics. It felt as if their characters were overly stereotyped to what Americans think British people are like and I found them really annoying and cringe worthy. But the racing sequences are truly very good and overall a strong movie!",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great racing movie and great tribute to a true story. Great acting",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably a three-star if you're not a fan of formula one, but the great racing sequences combined with a watchable portrayal from Thor as one of F1's most enduring characters James Hunt, and Bruhn's earnest portrayal of maybe the toughest man ever to put on a racing helmet brings the story to life for a modern audience who may not necessarily understand the risks and camaraderie of earlier generations of F1 racing.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply amazing - everything about this movie just worked (I can watch it 100 times and still like it - not because of fast cars and beautiful girls, but because of the story, acting...",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced, compelling characters.  If you liked Ford vs Ferrari, you'll like this,",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a new Formula 1 fan, this movie was a great action packed retelling of of one of the most notable rivalries in Formula 1. By the end of the movie, you appreciate each driver for what they valued most in life as well as their attitudes on the racing track.",
            "review_date": "2022-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/10 Great and dramatic formula 1 movie. Highly inappropriate intimate scenes, but still a great movie. Perfectly demonstrates how heated formula 1 can get.",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Brühl did such an awesome job on this movie.",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eehhhhhh it was fine. Definitely not my thing. I did appreciate where it took Nikki's character in the second half. But God I despised the obnoxious color grading (although that might have just been my roommate's tv) and the overall story for most of it felt pretty generic. Overall, an ok movie that I'd be happy to never watch again.",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, so the movie starts out feeling pretty superficial and vapid with the whole, \"Ohh I'm a fast driver and women want to have sex with me, look at how hot I am, I'm a playboy\" sort of thing. It definitely feels like a Hollywood blockbuster sort of movie, I'll just say that. James Hunt seems like an annoyingly prideful person with a super inflated ego who thinks way too highly of himself. While Niki Lauda seems kind of arrogant and haughty. I'm only 15 minutes in and I can already tell that the biggest problem with this movie is that the main characters are unlikable. \n\nI guess I find it pointless and silly that the whole story is about two guys who hate each other and their rivalry that continues to persist through the years. To me it's like, meh whatever lol. For a movie that's grounded in reality and acts as a biopic, it feels pretty unrealistic sometimes. They over-glamorize certain things which makes it look phony or ridiculous. \n\nFinally some great genuine humor when Niki and the pretty girl get stuck in the countryside of Italy and they're trying to get a lift and a car stops only to show its two Italian guys fanboying over Niki instead of paying attention to the pretty girl. It sucks to see that it wasn't until Niki had a bad accident that he became more human and humbled. But I guess we each have to go through our own problems, trials and tribulations in order to become a better version of ourselves. That was really admirable of Niki to go back and race in a Grand Prix only just gotten out of the hospital. I like how James sort of became protective over Niki - bashing that one rude reporters face in after his stupid question to Niki. You can tell James feels guilty and really bad for not supporting Niki's suggestion that rainy day. What I don't understand is why the frick didn't they postpone the race? Those conditions were extremely dangerous and hazardous to drive in, yet they still went on with it. I guess the head honchos of the Grand Prix in Japan didn't care at all about the drivers safety, unbelievable. \n\nI think the most interesting aspect of the movie was how complex the relationship between Niki and James was. The rivalry started out legitimate, then it turned into a media sensation, but then at the end it was all just for show. In the end, they had a respect for one another and kind of looked out for one another. I thought that was pretty beautiful. Niki learned to be more human and friendly, while James learned to be more humble and less of a show off. It actually turned out to be quite a beautiful story of how a rivalry can actually become a meaningful experience where two people can learn and benefit from one another. Niki was smart, he took precautions and lived a slower life while James was more live fast die young, and die pretty young he did at age 45 from a heart attack. An interesting and complex relationship between two people that hated each other but ended up being something prosperous for one another. \n\nOverall I thought it was a good movie, even though I almost gave up during the first half. Luckily, the second half picked up and it got much better, with the story becoming more gripping and exciting. I think what I loved most of all was seeing all the changes in the relationship between Niki and James and how each one learned from the other and benefitted in some way. They pushed each other to become better. The movie does suffer from a plethora of cliches, but I understand that it's based on a true story so its whatever. The movie also serves as really good commentary on how we present ourselves to the world vs. how we really feel inside. In the end, even though it was a good story, I don't think I'll be watching it again. I do recommend it though.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two well matched leads tell a harrowing story of competition, the film built up by Ron Howard's attention to bombastic visuals.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both of the main actors just nailed it and I love it. however it was a little dramatised with it all but overall a smashing movie",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two well matched leads tell a harrowing story of competition, the film built up by Ron Howard's attention to bombastic visuals.",
            "review_date": "2022-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This racing movie is about much more than just racing, and you'll find yourself just as engaged in the human drama as you are watching the cars fly around the track.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like RUSH has a tendency of living life in the fast lane and putting everyone on the edge of their seats while telling about the legacy of James Hunt and Niki Lauda very perfectly.",
            "review_date": "2022-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An almost unbearable movie to sit through and complete... The screen was so pouring with humanity and at the same time extreme brutality and malevolence.. This is clearly master class of art and a scathing reminder of some of the darkest pasts of our country and of this country's worst and most evil part of it's legacy. Insanely great performances, incredibly screen play and a superb score.",
            "review_date": "2022-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie. The battle between Hunt and Lauda was awesome, but even more incredible was the comeback of Nicki Lauda. He came back to race in Formula ! just weeks after his huge accident and whilst in terrible pain. An astounding man.",
            "review_date": "2022-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest race car movie you will ever see and one of the best sports film you will ever see.",
            "review_date": "2021-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie, isn't like a documentary but it's narration and story telling is just spot on. I liked this movie a lot because, it's not about race cars; it's about respect.",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, but light. Similar to Borg vs. Mcenroe, but I think better.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie got me into F1 and now I watch every race weekend. The picture is incredible and the story of these two is one worth watching and doing some research about. From everything I’ve looked at, the movie is extremely accurate. Stand out acting from both Hemsworth and Brühl. They were perfect choices for these roles.",
            "review_date": "2021-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really well made sports drama powered by two great performances from the stars.",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The documentary is better but still a great film . A film for petrolheads. The actor who plays lauda is a standout",
            "review_date": "2021-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie that was pretty accurate. Could've been more exciting",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible storytelling with excellent acting and pace.  A very well done film from start to finish.",
            "review_date": "2021-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining & all-around solid!",
            "review_date": "2021-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fabulous movie.  Director Ron Howard has such a great ability to tell a story with emotion, excitement, thoughtfulness, and intensity.  Two rivals emerge from a battle of wills, daring, and different moral calculations to care and respect for each other.",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Six years before Ford vs Ferrari earned attention in the awards season, Ron Howard beat them to the party. The parallels run rampant, with both films involving racecar driving, two male protagonists, and plenty of high-octane competition scenes. The relationship between Bruhl and Hemsworth, unlike Bale and Damon, manifests as a rivalry rather than a working relationship. The way in which the two develop their relationship satisfies the viewer, yet feels contrived. In the moment, one feels the thrills and the painstaking analysis in the contrast of the two men's approaches, but this contrast reeks of oversimplification and lack of nuance. Bruhl performs marvelously and Hemsworth decently, despite being outshone. Alexandra Maria Lara probably chews the most scenes after these two, despite Olivia Wilde also being around, but both of the relationships around these two felt slightly underdeveloped and unfocused. It was nice to see a familiar face in Stephen Mangan, although he had little to do. Natalie Dormer's involvement irked me, as she was sexualised from the first moment and then discarded. I understand that this reflected the life of Hemsworth in all of its profligacy, but I feel she possesses more talent than that role offered. All in all, I find FvF preferable in the niche category of racecar films.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie's success is primarily thanks to the great real-life story that it's based on, but it's well-executed both by the actors and cinematically, particularly with the thrilling race scenes. ",
            "review_date": "2021-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in the golden age of Formula 1 racing in the 1970's we bear witness to one of the greatest rivalries in the history of all sports entertainment. The electric and flamboyant Englishman, James Hunt(Hemsworth) and the brilliantly driven and methodical Austrian, Niki Lauda. On and off the track these rivals clash yet while maintaining the upmost respect for one another and the sport of racing. With a hair pin margin for error, both men are willing to risk it all for the ultimate glory of becoming champion. \n\nThe great Ron Howard had certainly cemented himself as one of the greatest directors of our time even before this glorious film. The set up of shots during all the races were impeccable leaving you feeling like you're in the race yourself, bravo to the cinematographer. With Hans Zimmer helming the score we hear the tone set beautifully. The deep introspects of each respected driver was also very well done with no wasted moments. Daniel Bruhl played his role with magic portraying the real drive and obsession it takes to be champion. Chris Hemsworth is also quite impressive also, portraying the hotheaded, overcompensating playboy quite naturally.   \nAll in all the extreme attention to detail makes for a completely perfect film.",
            "review_date": "2021-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 2,0",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All characters feel so shitty, they are all assholes. Can't relate with any of them. I don't understand it. Very hollow. Very shit. 2 hours of my life lost.",
            "review_date": "2021-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rush provided a quality made biopic from Ron Howard, centering on the rivalry between Niki Lauda and James Hunt during the 1976 F1 series.\n\nI would imagine this is much more enjoyable and interesting if, like me, you come into this knowing nothing about the actual history.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike most rivalry films, rush makes both sides of the story a good one with good intentions from both characters. This makes you care for both of their fates and less about which one of them inevitably wins the final race.",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good performances.  Just not my cup of tea.",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A passionate sports drama with Daniel Bruhl, brilliantly selected for the role of Niki Lauda. The scene of the famous accident on the racetrack is a masterpiece of technical perfection ...",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty standard fare for Ron Howard. Hemsworth was surprisingly competent as Hunt. Brühl was a bit better, but then he had a more interesting role as far as personality and story line together. He certainly looked the part, so good caster there. Neither of the main female actors were given much to work with as far as developing their character or showing much need for range. \nBut I enjoyed this version of the true story of these two key figures in Formula One racing history. The driving sequences were effective and showed again Howard's skill with action sequences. 3 stars",
            "review_date": "2020-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense racing scenes. Interesting character development.",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rush is a great movie to watch with your family or chick!",
            "review_date": "2020-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really great film, if you love Formula 1, actually, you don't even need to like Formula 1 to appreciate this film as its more about the people, their differences, and how they achieved what they achieved.",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best racong movie ever",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a rather serious movie, so not much interest in rewatching it, but very well-made",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rush has some solid acting performances, but there were some narrative issues. The burn victim part of the film was pretty horrible to watch, and there were some unnecessary sex scenes. The action was entertaining for a driving film, and the film did provide a decent backstory for the main characters. The film felt like it was probably accurate to the real events, but I haven't looked into that. The pacing was fine, the visual effects and cinematography were decent, and the soundtrack was also ok. Far from the best film, but it's one of the better driving films I've seen.",
            "review_date": "2020-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good for the big screen but not so much for watching on your TV at home. This was pre-Thor if I remember correctly.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films I've ever seen. The excitement of the driving scenes was nowhere near enough to cancel out the awfulness of every other part of this film. Nauseatingly sexist (women speak for less than 5 mins combined, and every one with a speaking part is shown naked at least once).",
            "review_date": "2020-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An expertly crafted sports drama with exciting race sequences and strong lead performances from Chris Hemsworth and Daniel Brühl.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly really good and even it being a true story makes it even more amazing, the cast do really good for what they're given, especially James Hunt (Chris Hemsworth) and Niki (Daniel Brühl) they give probably the best performances throughout. \n\nAlso, the makeup artists do a fantastic job with certain characters and it honestly looks real for the most part, which is really good. \n\nFinally, the story is outstandingly brilliant and honestly there's some brutal and bloody scenes throughout this movie, which I wasnt expecting but it still adds to the movie being really good. Last thing here, I think the race scenes were quite fun and entertaining and I really liked them. \n\nOverall, I'd honestly say if you like true stories and racing movies, this is the movie for you. Its honestly, worth the watch.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than 'Ford v Ferrari', 'Rush' surprised me with it's amount of dramatic heft and the layers within the 2 lead character's relationship and rivalry.  James (Hemsworth) and Niki's (Bruhl) conflict can be likened to that of Kirk and Spock; one is logical and by-the-book, while the other is a wildcard who lives every day like it's his last.  This dynamic makes for a highly entertaining interchange between Hemsworth and Bruhl who give individually great performances.  'Rush' didn't need to be a 2 and a half hour pseudo-epic unlike the aforementioned film I brought up at the beginning.  Clocking in at 2 hours, it was paced better, far more engaging, and had characters that I actually cared about.  Not many racing movies have crash sequences that were this potent for me.  Whenever one of the main characters crashed, I myself feared for their lives and safety.  In the end, while it can't escape some of it's genre's conventions throughout the movie and more so the finale, 'Rush' manages to be an example of a genre movie that doesn't have to be average thanks to its tropes.  It takes these tropes and executes them in a unique way thanks to a strong script and evident care from all involved.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is there to say, it's excellent.  Unquestionably the best racing movie ever made.\n\n4 1/2 of 5",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTELY AMAZING!! Even people who are not into sport movies will definitely love it! Full of suspense.",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rush is a unique take on Formula One legends Niki Lauda and James Hunt. I love the racing sequences, Chris Hemsworth and Daniel Bruhl's performances, the direction, the story and the sound effects. This movie is a good take during the 1976 Formula One because this event was huge because of Hunt and Lauda. Overall, Rush didn't disappoint me not even by a small percentage. This movie is great for racing fans or Chris Hemsworth and Daniel Bruhl fans.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ron Howard managed to turn a dumb spectator sport into a pretty decent movie!",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's off to a slow start, character development gets left behind. Few laps on, and a bit of drama takes the lead but dull cliches are fast on its tail. Luckily half way through the race (film?) we finally start caring about  the characters and excitement jumps to first place. Decent finale, but minus points for the dull intro.",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story about great pilots of old days",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film truly takes you for a ride. Top notch cast, and the driving scenes put you in the stands along with the rest of the fans. ",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mixed with great dialog and intense visuals Rush is the fantastic tale of the Rush-Hunt rivalry.",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before there was Ford vs Ferrari, there was Ron Howard's Rush. Unlike the former, Rush focuses much less on the odyssey of crafting the perfect machine and instead focuses on the drive behind the drivers, specifically the brutal rivalry between Niki Lauda and James Hunt. Daniel Buhl and Chris Hemsworth are both perfect in their roles as the two tenacious men. There interplay is what gives the film much of its electric energy. At first, their relationship seemed to boil down to cliched trash talk, but it soon develops into something much more compelling. The film explores the way that both men need to be at each others heels (or tires) in order to thrive. This connection sways between hatred and admiration throughout the course of the narrative and doesn't quickly fall into the predictable track of hidden friendship. Ron Howard controls all of these dramatic elements with a strong and assured hand. Anthony Dod Mantle's frenetic style, that is present in all of his works with Danny Boyle, is very advantageous to the wild action of the speedway. However, I find the dynamic lighting and dark color palate to be less favorable, as it makes everything look like one of Zack Snyder's graphic novel adaptions. It takes the film out of reality when what it should be doing is portraying the dangerous reality in theses true events. Despite this, the racing sequences are quite good and I would have liked for them to get more screen time. Hans Zimmer's score is as mesmerizing as usual. ———————–Overall: Even with sublime work an all technical levels, Rush manages to get it's greatest win with a true story of man .vs. man .vs. fate that will should surely get you heart racing. ——————–Highlight: There are more than a few unexpected turns and bumps along the narrative that could have been agonizingly straight-forward.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s probably best if I start by saying, there are few recreational activities that I care about less than car-racing. I am an avid fan of sports films, but this isn’t really a sport, so Rush doesn’t get any benefit of the doubt from me. That’s not to say there’s nothing good in this movie. The character work from Daniel Brühl and Chris Hemsworth is great, and that’s what gets you invested in the story. Niki Lauda (the man that Daniel Brühl plays) proves to be the most fascinating person in the film, because he has such a uniquely abrasive personality, and yet shows that there are some emotions underlying that rough exterior. I was definitely interested in where his journey would end up. The fact that this was all based on real events made it that much more powerful, knowing that he had overcome so much in his life to be a success. James Hunt (the man that Chris Hemsworth plays) is much less fascinating. He is simply a jerk that seems to care about no one. That’s where Rush lost me. The one lame “save the cat” moment that they give Hunt is not nearly enough to make me like him. The end didn’t click all that well, because I couldn’t buy that one conversation and a single good deed could turn their rivalry into a friendship. I was afraid he was going to remain the protagonist for the entire film, and his tedious relationships would become an important plot point. Thankfully, later on the movie focused in on Lauda much more, and his intriguing marriage. I enjoyed aspects of Rush more than I expected, particularly the acting, but it never could get over the hump to be a movie I loved. Frankly, I think an ESPN documentary on the subject would be a bit more effective.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced and highly entertaining from the starting line, Ron Howard's 2013's \"Rush\" gives you an indepth look at one of Formula 1's most historic figures early in his career. Chris Hemsworth (hot off his first Avengers film) and Daniel Bruhl (of Inglorious Basterd acclaim) are tremendously likeable in their on screen rivalry, with Bruhl's edging a victory as a spitting image of the famed Niki Lauda. Combine these performances with the stunning vision of Ron Howard and you can feel the tension with every hairpin turn as you try to decide who to cheer for. An adrenaline packed lap around the track, Rush is one of the best things to come out about an italian racecar driver that doesn't have a banana trailing from his car.",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ironic, this movie simply... rushes",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie. I thoroughly enjoyed this movie. ",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's good, but not so much. It's a tipical yankee movie... It's made like so much movies that all we see.",
            "review_date": "2020-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular performance by Daniel Bruhl and Chris Hemsworth. Rush not only gives you the thrill of watching the race, but lets you immerse yourself into the story. It made me laugh and cry, completely gripping me until the end. A must see movie!",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece. Ron Howard’s best films in years. This incredible true story is both moving and inspiring. A must-see.",
            "review_date": "2020-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mostly a mixed bag narrative wise, but Howard does stage enough effectively harrowing race sequences to warrant a viewing.",
            "review_date": "2020-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This auto racing movie was really good. The rivalry between James Hunt and Niki Lauda was very memorable. Chris Hemsworth and Daniel Bruhl did a fantastic job as the Formula One drivers. The plot to the movie was really good and it was very inspirational and dramatic. Even if you're not an auto racing fan you would still enjoy this movie. I recommend it.",
            "review_date": "2020-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Ron Howard compresses time-lines and introduces some fictions to the movie but for understandable narrative and continuity reasons. The two protagonists are played excellently by the leading actors and the on-track action is exciting enough to satisfy petrolhead fans along with the human dramas that are played out. The feeling left at the end, at least for me, was one of deep respect for Nikki Lauda and a sense of awe at the chutzpah of James Hunt.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie ever. Worth a watch",
            "review_date": "2020-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a really nice movie, that you might enjoy ;)",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film looks fantastic and is the best formula 1 movie out there. This might even be the best racing movie out there too. Chris Hemsworth and Daniel Bruhl deliver great performances and really being the Hunt vs Lauda rivalry to life. The film is very well shot. The racing scenes are exciting and sound great. This movie does everything right and is an easy 10.",
            "review_date": "2019-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best racing movie ever made with epic Hans Zimmer music, what more could you ask for.",
            "review_date": "2019-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best motorsport movie ever made. \nThe focus is the story of Hunt and Lauda, but also the humans behind and around the machines they command, and the environment they fight to be and survive in. And it does so masterly, and with great historic and technical accuracy, while getting under the skin of the main characters.",
            "review_date": "2019-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Brühl is Niki Lauda. He hits every mark. This film fires on all cylinders.\n",
            "review_date": "2019-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool film, especially for a Formula 1 follower like myself. Impeccable casting for the leads, with a very interesting story.",
            "review_date": "2019-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whether you like or follow the sport of motor racing or perhaps know the story that took place between Hunt and Lauda is irrelevant. This film has a deep personality played out by contrasting gladiators of Formula 1. There are no lightweight performances here. Drama doused in Race Fuel. Well worth a watch from beginning to end. 10/10",
            "review_date": "2019-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rush follows the true story of a two formula 1 champions competing against eachother. The film is beautiful, tense, thrilling, serious, and features some very strong performances from Chris Hemsworth and Daniel Bruhl.",
            "review_date": "2019-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(89/100)\nRush is an exhilarating story about two men with a passion for the same job but with different ideologies, and the movie portrays these two men excellently. I'm, of course, talking about James Hunt and Niki Lauda, portrayed by Chris Hemsworth and Daniel Brühl. The direction is just top-notch and Ron Howard really shows what he is capable off as a director, unlike his Dan Brown movies. Chris and Daniel give really great performances and the race-action is very exciting to look at. Some of the CGI, especially during crashes, is very noticable, but other than that, it was and felt very real. The story really progresses in a satisfying way, really showing us how these two drivers started off and where they have come now. The score by Hans Zimmer is amazing, as always, and the cinematography is also pretty good. Overall, Rush is a very competent and entertaining movie about what it means to win at all costs.\n",
            "review_date": "2019-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throw in some thrilling cinematography into an already exiting historical rivalary and you have youself a great movie about modern men and their favorite toys. Suffers from being a drama that pushes a narrative more then it's own characters",
            "review_date": "2019-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just an awesome film... bringing the madness of racing into focus and making sense of it! I’m not ever-so interested in F1 but it was so captivating. Watch it! ",
            "review_date": "2019-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie! Well written, two fabulous main characters and even though it is by first sight mainstream it goes deep. + hell a lot of fun to watch.",
            "review_date": "2019-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a highly entertaining story of two intense rivals who would do anything to win both on and off the track including risking their lives to race against each other an absolute must see film for anyone into cars or racing",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The merciless 1970s rivalry between Formula One rivals Niki Lauda and James Hunt.\nDaniel Brühl is perfectly cast as Niki Lauda in this well-made and entertaining buddy-rival story.",
            "review_date": "2019-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting movie about Formula 1 racing, and it turned out to be really good. It focuses around two main characters who are rivals and each one tries their best to outrace each other. It leads to personal conflicts that actually make sense and selfishness due to the fact that they want to become number one. The acting is stupendous from both main characters and the side. The story is really good, it's hard to believe that it is actually a true story. It's emotional too, especially the ending. The cinematography is really good to and the set pieces are very pretty and captures the 1970s really well. I was pleasantly surprised by watching this, I never knew that it could end up an emotional tale of rivalry and personal gain.",
            "review_date": "2019-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely one of the greatest movies of all times. I'm watching it for the fifth time right now... Reason I'm typing a note here, is that close up in 1080p, it's suddenly clear how a lot of objects/details are not from the 7'ties. A bit of a shame, and a bit annoying. \nStill: 4.5 stars is well deserved.  \nAnd as professional critics have uttered: It's a movie about driving, that you can share with your girlfriend. \nThat of course is due to the fact, that it reflects true motivations/feelings/ambitions/learning-prosesses. It's just brilliant. And what a Rush!!",
            "review_date": "2019-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie! althouh I coulnd have any sympathy for the protagonist",
            "review_date": "2019-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensational! Surrounding, with great photography and characterization, it is a dip in the passion for motorsport.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful love story between two rivals. (I'm a gay man). I say love story because they came to love each other. Edge-of-the-seat shots that make it 'you-are-there'. I especially liked the inclusion of the real men at the end of the film. It makes...made me, tear up and see their relationship as more than just respect. \n\nHoward is back at 'his' game.",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a Bio but not over the top either, great take on the story line and good performances by most of the cast",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this perfect movie, I did work in the racing field, so I maybe biased on the subject. Spectacular story!",
            "review_date": "2018-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perspective clearly flatters the protagonist while villainizing a deceased (supposed?) antagonist. All the same, the story is impressive for the way said protagonist is shown to harness and control a most exceptional competitive drive.",
            "review_date": "2018-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was bored with it, but that doesn't stop it from being the beautiful, emotional fast thrill ride it is.",
            "review_date": "2018-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thrill ride at every turn, Rush, powered by its two incredible leads, documents well its enemies and what drove them to such heights.",
            "review_date": "2018-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the most perfect - based on a true story - movie ever. Maybe my favorite movie ever.",
            "review_date": "2018-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A spectacular movie showcasing the rivalry between Lauda and Hunt.  The story is very interesting and entertaining.  The action shots on the circuit are brilliant and they really make you feel as if you're there.  There are numerous times in the movie where you'll catch yourself saying \"Wow!\".",
            "review_date": "2018-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so underrated",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On of my all time favourite Movies.\nA Masterpiece of Entertainment and historical Movies!!",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely perfect 👌",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good movie that I went into without knowing anything about the story. I would recommend this to anyone looking for a movie about something other than the standard fare..",
            "review_date": "2017-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film, strong characters, but there just doesn't seem to be enough. You get the sense the writers are trying to make more out of this than the material suggests. Or did they just miss the mark? A bit shallow.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies I have seen, that is about racing cars",
            "review_date": "2017-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't believe this movie was as good as it was.",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an F1 fan, I love it. As a movie fan, I love it.",
            "review_date": "2017-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SCOTT: (Dr. Scott Allison, Professor of Psychology, University of Richmond) Greg, I m fascinated that they would make a movie about Rush Limbaugh.\n\nGREG: (Greg Smith, Founder of Agile Writers of Richmond, VA) It s not a movie about the Right, it s about going in circles to the Left!\n\nSCOTT: Bahaha, good one, Greg. Rush is the story of the rivalry during the 1970s between two Formula 1 drivers, James Hunt (Chris Hemsworth) and Niki Lauda (Daniel Br hl). The movie opens with the two of them bumping cars during a 1970 Formula 3 race in England. Hunt wins the race but Lauda is outraged by Hunt s disregard for safety. Lauda then borrows a large sum of money that enables him to make it to the big time of Formula 1.  Hunt also joins a Formula 1 team and the two men resume their rivalry on the big stage.\n\nGREG: Hunt is a playboy. He is out for a good time. He wants to have fun. And the only thing he wants more than to have fun is to win. Lauda is meticulous, methodical, and rigorous. The only thing he wants is to win. These two men have the same goals in mind, but they have two different ways to get it. And it is these differences that make up the conflict in this movie.\n\nSCOTT: Greg, Rush is an impressive movie with an impeccable cast and outstanding direction from Ron Howard.  I can t imagine two better actors for the roles of Hunt and Lauda. These two men remind me of fire and ice, two contrasting styles reminiscent of Kirk and Spock in Star Trek. The resulting tension between Hunt and Lauda, both on and off the track, is pure sizzle and spark.  It s rare to see such a powerful rivalry between two sports celebrities portrayed so well on film.\n\nGREG: Scott, we saw this last week in Prisoners. Two men with the same goal but with opposite ways of approaching it. Lauda is hands-on all the way. Off the track, he works day and night preparing his car. He uses the latest materials, trims every ounce to make his car lighter and faster. On the track, he observes every rule and plays up to but not over the margins of safety. Hunt, on the other hand, is very hands off. He expects his team to work the details of his car and the business of running the race. When the race is over, he s off drinking and carousing leaving Lauda to go home to his dutiful wife. During the race, Hunt crosses the line from safe to reckless - doing whatever it takes to pass the next racer and win the race.\n\nSCOTT: You note the resemblance to last week s movie Prisoners, but I see some important differences.  In Prisoners, the two heroes share the same goal of catching an abductor, but in Rush there is a clear and intense competition between two heroes whose goals are in conflict. Plus, in Rush we see our two hero-celebrities over time develop a grudging respect for each other. In fact, I d say that this growing mutual admiration is an important element of their character transformations during their hero journeys. The pivotal moment in Hunt s development occurs when he punches a reporter who disrespects Lauda during a press conference. Prior to this moment we see only hatred from Hunt toward Lauda, but Lauda s recovery has forever changed Hunt s opinion of Lauda. And of course the key transformational moment for Lauda takes place in the hospital when he shows remarkable resilience in the face of debilitating injury. Watching these two men change and grow in many ways -- as drivers, as husbands, as businessmen, and as rivals -- is a sheer joy to watch.\n\nGREG: What Scott is referring to is a story element that is in all the trailers, but occurs late in the film. Lauda, against his better judgement, enters into a race and has a terrible accident where he is burned all over his body and face. Lauda undergoes painful surgeries to recover soon enough to get back into the race season and contend with Hunt for the cup. What I walk away with from this movie is how much these men come to admire each other and still maintain their own styles. Lauda is ever analyzing and refining his craft. Hunt is constantly looking to have fun while he can. But each learns that the other s way of approaching the race has its merits. Another buddy-hero story I m reminded of is Bill Gates and Steve Jobs who had different ways of approaching the computer industry (Gates in favor of open systems and Jobs favoring closed systems). In the end there is a grudging admiration of the other.\n\nSCOTT: I like that Gates-Jobs analogy a lot, Greg, and perhaps the recent film Jobs would have been a more effective movie if it had focused more on that rivalry with the same effectiveness as Rush. Ron Howard deserves great credit for telling a great dual-hero story that anyone can appreciate, even people like me who have no interest in auto racing. The key is to create compelling, multi-dimensional characters whom we care about and who undergo significant transformation. This was done to near perfection in Rush.\n\nGREG: Rush is why I go to the movies. I fell right into the lives of these two men. I felt the power of racing and the will to win. I came to admire what each man offered and could see myself in their places. When I look back on Rush and wonder what could have been done better, I can t think of a single thing. The film lasted 123 minutes and I wanted more when the story was done. And this is nothing less than what you d expect from a Ron Howard film. Every detail of the story was attended to: from the 70 s look and feel, to the speeding cars, to the realistic crashes. I was hooked from the beginning. For easily one of the best films we ve seen this year, I give Rush 5 out of 5 Reels. And for telling a two-handed story with precision and style, I give Rush 5 out of 5 Heroes. Movie:  Heroes:\n\nSCOTT: I thoroughly enjoyed Rush and am happy to award it 4 Reels out of 5 and 4 Heroes out of 5. The reason I am hesitant to give the full 5 Reels and 5 Heroes is based on my belief that seeking to become the best car racer in the world is much more a quest for personal glory than it is a heroic quest. Last week I gave Prisoners two 5 ratings because the heroic goal was to save lives. We see no such virtuous goal in Rush. Still, I agree, Greg, that Rush is one of the best films of the year. The two main characters are celebrities, not heroes, but it s still a riveting and impeccably-told story. The performances were exemplary all-around and I anticipate an Oscar nomination for Best Director for Ron Howard. Movie: Heroes:",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well crafted character story that may be Ron Howard's best film to date.\n\nTwo-time Academy Award (R) winner Ron Howard (A Beautiful Mind, Frost/Nixon) teams once again with two-time Academy Award (R)-nominated writer Peter Morgan (Frost/Nixon, The Queen) on Rush, a spectacular big-screen re-creation of the merciless and legendary 1970s Formula 1 rivalry between gifted English playboy James Hunt (Chris Hemsworth of The Avengers, Thor) and his disciplined Austrian opponent, Niki Lauda (Daniel Brühl of Inglourious Basterds, The Bourne Ultimatum). \n\nI'll be honest, this was the first Ron Howard film I had ever seen in my young life. It left an amazing impression on me, to the point where I praised Ron Howard and his ability to drive character development. Then, I watched some of his other films and I wondered, was this really his only huge highlight? Whether it is or not, it has nothing to do with the fact that \"Rush\" is an amazing film that does nothing but good. \n\nThe thing that I love about this film is its character study. This is based on the true story between drivers James Hunt and Niki Lauda, who had the biggest rivalry in Formula 1 racing at the time. It's amazing how Ron Howard told this story, as there were no real protagonists or antagonists. You have two polar opposite people, who act differently and view things differently, but they have the same goal in mind. You see their upbringings and downfalls and in the end, you can see that they're both just people with dreams. They each have their flaws for sure, but it's easy to cheer for both of them and want them to succeed. \n\nNone of this could've been accomplished without our two main actors. Both Hemsworth and Bruhl put up some of their best performances to date. They each, respectively, bring out the personality and drive of their real life portrayals. I felt like I really got to know who these people were and what they did in their life. That's due to their ability to play their roles and bring that emotional drive with them. \n\nI feel like when directors and / or producers look to tell the story of someone's biography or a true event, this would be a great example of that. Like I've said multiple times, both Ron Howard and the cast know how to tell a story about characters. The story is filled with interesting character conflict and it's done so well that you don't necessarily see either side as the villain (because neither side is the villain). It's really hard to accomplish that in a film and if you automatically side with Hemsworth because he's more recognizable, you're just being stubborn. This is such a well made film and I have to give it credit for that.\n\nIn the end, I truly thought this movie was amazing. This is how you should tell a story and how you should execute it. I really don't have any gripes with this film and in fact, I though it was near perfect.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this but then I'm a F1 fan...",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rush\" is a simply terrific film about a fantastic sports rivalry and how two individuals so different in nature eventually begin to complement each other's existence.  Ron Howard is in top form.",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining movie with two solid performances",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that changed my life, inspired me and made me fall in love with movies",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One awesome adrenaline packed racing movie!! Chris Hemsworth delivered. Highly Recommended!!",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very interesting biography of racing! I enjoyed it!",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a really good movie! It had a great message. It was a little crude and had a lot of sex and drugs but it was a good movie.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best racing movie I've seen. Rush is a well-made sports movie with adrenaline filled racing scenes and solid performances from its two leads Chris Hemsworth and Daniel Bruhl.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best racing movie I've seen. Rush is a well-made sports movie with adrenaline filled racing scenes and solid performances from its two leads Chris Hemsworth and Daniel Bruhl.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was a surprisingly good film. I expected a border-line documentary sloppy low-budget mess. Needless to say I was VERY (pleasantly) surprised by the movie. The acting is top-notch, the directing is great. The pacing is good and so is script. An incredible movie.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}