{
    "rating": 0.0,
    "release_date": "1962-01-23",
    "num_reviews": 152,
    "genres": [
        "Drama",
        "Romance"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Truffaut's Masteriece",
            "content": "Jules (Oskar Werner), an introspective Austrian and Jim (Henri Serre) a confident Frenchman begin a friendship that defies understanding. What begins as an exchange and discourse over art develops into a bond that seems able to withstand anything, including fighting against each other in WWI. After the war has ended, the duo goes on sharing art and women with each other, until Jules falls in love with Catherine (Jeanne Moreau), a free-spirited woman with an unpredictable temperament, prone to emotional outbursts. Despite the easy-going inexperienced Jules being an odd fit for Catherine, he asks Jim not to chase Catherine, so he can have her love all to himself. Despite Jules' request, he invites Jim on many of the couple's outings and the trio spends most of their time together. Even after Catherine and Jules marry and have a child, Jim is invited to live in their home with them. Over time, an intimacy begins to develop between Jim and Catherine, which Jules is aware of. Instead of risking losing his friend or his marriage Jules allows the intimacy to blossom which creates a domino effect of emotions between the three of them. Life no longer is about what each wants individually, but rather what each other wants and expects and what kind of life they want the other to fulfill. The decision to allow the three-way relationship has enduring effects on all involved due to the complicated nature of the two men's love for Catherine, as well as their devotion to each other. Bonds will be tested, as Jules and Jim face another war, this time, off the battlefield.\"You said, \"I love you,\" I said, \"Wait.\" I was going to say, \"Take me,\" you said, \"Go away.\" Arguably the most memorable quote from Jules and Jim also acted as a heart-wrenching opening, conveying to the audience just how much of an emotional experience they were in for. As we are introduced to each character, Truffaut takes his deliberate time revealing what Jules and Jim mean to each other. It is Truffaut's prowess as a director that allows the audience to truly understand the depth of devotion that Jules and Jim share for each other. Without his labored efforts, the rest of the story would pass by unnoticed because this truly is a story about three people in love rather than a love triangle with each point seeking out the object of their affection. The story relies on the understanding that neither Jules, Jim, nor Catherine will seek to fulfill their own needs at the expense of each other. Technically, Truffaut showed mastery on only his third feature film. His use of freeze frames was fantastic and essential in allowing the audience to realize the profound effect on the emotional state of the men involved with Catherine, each \"moved by a symbol they could not understand.\" Truffaut also uses the overlay technique a few times to great success, placing Catherine's face over a few scenes really driving home the idea that every thought or activity Jules and Jim ever took part in was driven by Catherine. In just three short years since his first feature, The 400 Blows--a masterpiece in its own right, Truffaut further revealed his mastery for capturing the complexity of human emotion like few others before him.Few films tackle the emotionally intense themes Jules and Jim take on. Truffaut delves into pain, the kind of pain that is caused by yearning in love. Love and lust is a theme constantly at the forefront of the film, as well, along with a precise distinction between the two. Jules, lacking the romantic experience of Jim, attempts to shield Catherine from Jim for fear that he will only lust after her. When it becomes clear that Jim actually loves Catherine, as Jules does, he relents and decides to share his love of Catherine with Jim. Jules loves Catherine and shares a devotion to Jim, so he supports a union between Jim and Catherine because he needs to be a part of each's life and wants happiness for all parties involved, and vice-versa for Catherine and Jim. Devotion, like I have never since seen replicated on screen, is the driving force behind each character's actions and thoughts. The way Truffaut managed to capture that devoted motivation shows impeccable insight to the human spirit and cements him as the purest most personal filmmaker I have ever seen. Running the gamut of emotional commentary, Truffaut also successfully illustrates loneliness, especially experienced by Catherine, and its power over life. Catherine is clearly a damaged soul, she has met and overcome many obstacles in her life, most of which, are only alluded to. There are aspects of both Jules and Jim that she depends on for her very survival, necessitating that they both remain in her life. Catherine has been unable to commit to another due to her expectation of being abandoned, as only hinted to in a couple of scenes between her and Jules. It is this damage that makes her reckless and prompts Jules and Jim to be more cautious in their interactions with her. To be able to show every unlikeable aspect of a human being, yet, still endear that person in the hearts of the audience was a skill no one in the history of cinema has been more proficient at than Francois Truffaut. By the film's conclusion, we may not have that ending that leaves each better off and happy, but what we do get is the realization that we're all in search of our statue; that one person that is perfect to us and for us despite their obvious flaws, just as Jules and Jim traversed gardens in search of their statues before they happened upon the same one, and once we find that statue, we will do whatever it takes to keep it in our view.",
            "review_date": "2017-02-12",
            "lang": "en"
        },
        {
            "review_title": "Flashy New Wave romance...somewhat overrated",
            "content": "Free-spirited Parisian girl in pre-WWI France cannot decide which of her male lovers, two eager students from France and Germany, she wants more; once the war is over, the two men decide to share her. Director François Truffaut's cinematically revolutionary paean to indecisive love was adapted from Henri-Pierre Roché's novel (by Truffaut and Jean Gruault) with great care and intimacy, with exciting cinematography from Raoul Coutard which juices the proceedings with kinetic life. Still, the second-half of the film wears out its welcome, as the plot feels mostly played out, and the players are not quite as charismatic as Truffaut thinks they are. Reworked in the U.S. in 1980 as \"Willie & Phil\". ** from ****",
            "review_date": "2010-07-26",
            "lang": "en"
        },
        {
            "review_title": "Rambling Drivel",
            "content": "Catherine marries Jules, but leaves him for Jim except that she has this thing for Albert, but she really loves Jules, although she misses Jim... This is basically a soap opera without rhyme or reason and it runs out of steam long before the ridiculous finale. It has no plot or point except to wallow in its Frenchness...easy women, effeminate men, free love, pretentious conversation. Moreau's Catherine is an annoying diva, although she is supposed to be so irresistible that her husband and lovers are willing to share her rather than risk losing her. The narration is pompous and superfluous. This unbearable drivel presents Truffaut at his indulgent worst. It's all style and no substance.",
            "review_date": "2011-08-07",
            "lang": "en"
        },
        {
            "review_title": "An Obsolete Love",
            "content": "Spoilers herein.I have had a lot of trouble with this film, and in fact seeing it recently has instigated a mini-crisis in my belief system, at least so far as film.You see, I saw this when if first appeared in the US, as a young man filling his bag with mindexpanding experiences. I was impressed with this `new wave' stuff, the placement of romanticism in life, and the realism in the filmmaking process: just the reverse of what Hollywood was doing. And in those days, Hollywood = establishment = repression and lies = racism and war. So by `seeing French,' I was entering an international community of intellectuals, fighting the good fight by filling the ether with enlightenment.It is a real shock today to see this and be reminded how daft was that notion. In particular, I'm stopped in my tracks at how weak are the ideas. It is not just French film -- I recently resaw `Marienbad' and was similarly struck at how its value has compounded. No, it is THIS film. THESE notions.Here's my shocker: I have long maintained that film is an evolving medium that is uniquely poised to reinvent how we think. A successful film to me is one that advances that evolution. I particularly like it when they do this is a self-aware, self-referential manner. But what about films that do just this, do become important in this way, but then become irrelevant? What about that?On reflection, I must conclude that this film was just popular for cultural reasons (like `Schindler'), not important (like `Streetcar Named Desire'). An entire generation, in a sophomoric stupor, talked themselves into this fey romantic irony. Do we know better now, or have we just moved to another thin profundity? Which nervous infatuation, which lover?",
            "review_date": "2002-01-10",
            "lang": "en"
        },
        {
            "review_title": "A breathless film about time.",
            "content": "Time and revisionist critics have tried to tarnish the gleam of Truffaut's final masterpiece - citing its apparent misogyny and apoliticism; but for some of us, 'Jules et Jim' is the unforgettable film that opened the gates to both European film, and the great masters of American cinema like Hitchcock, Hawks and Ray.  'Jules et Jim' is, along with 'Citizen Kane', THE vindication of the pleasures of cinematic form: the first half especially, in its rush of narrative registers and technical exuberance, is unparalleled in modern film.  This isn't mere trickery - the use of paintings, books, plays, dreams, conversations, documentary footage, etc., as well as the different ways of telling a story through film, all point to the movie's theme - how do you represent people and the world in art without destroying them?  Or is art the only to save people and life from extinction? \nThe foregrounding of theatricality, acting, disguises, pseudonyms, games, works-within-the-work, all point to the high modernism in which the film is set, when the old certainties about identity and place were being destroyed by the Great War.  In fact the film could be considered Cubist in the way it uses film form to splice up and rearrange images, space, characters, viewpoints.  Truffaut's film is a beautiful elegy about time: the historical time heading towards destruction in the shape of the Nazis, and the circular time of love, obsession and art.  These times struggle in the film's structure, history zipping past years in the framing, Parisian sections, and days stretching out interminably in the central rural rondelay. \nFar from being misogynistic, the film places Catherine's speech about 'grains of sand' at its philosophical heart.  AND she's played by Jeanne Moreau, the most honest and human of all great actresses.",
            "review_date": "2001-07-12",
            "lang": "en"
        },
        {
            "review_title": "No -- still not getting it.",
            "content": "Whenever a commentator declares outright that a film is a complete waste of time and that nobody, BUT NOBODY, should ever watch it, I tend to peg that commentator as an opinionated ass. So I would never say that about a well-respected film like \"Jules and Jim.\" But quite honestly, I can't warm up to it. I've watched it on more than one occasion over the years, and it never fails to put me to sleep at both ends of my anatomy. I've just viewed a DVD edition in which a film scholar clearly explains his views on the fascination of \"Jules and Jim.\" But I still couldn't see why the relationship of these three tedious characters, discussed and analyzed in all its very tedious minutiae by those same characters and an off-screen narrator (also tedious), should interest me. It's certainly beloved by academic types (maybe for those very same characteristics?), and film critics eat it up like it has gravy on it. Like another commentator, I'm a bit puzzled by all the comments about its lyrical, lighthearted and idyllic qualities. I'm left with the impression of a rather dry, academic dissertation on the complexities of male-female relationships ca. 1961 (the 1910 setting seems to me immaterial to the script).I can't help feeling that I'm missing something, and I'm not averse to French films, but they're usually older, pre-new-wave films, for example \"Forbidden Games,\" \"French Can-Can,\" or Pagnol's \"Fanny\" trilogy. I take it that the sentimentality of such films is one of the things new wave directors reacted against. If so, I can't jump on their bandwagon, try as I might. I've enjoyed some of Truffaut's work, but not this, I'm afraid.To those who love and appreciate \"Jules and Jim\" -- have pleasure of it. I envy you for that, and maybe I'll try it again in a few years.",
            "review_date": "2002-08-05",
            "lang": "en"
        },
        {
            "review_title": "Not sure why this is regarded as a classic...",
            "content": "The story of two friends, Jules and Jim. They meet in Paris before World War 1 and strike up a friendship. Jules falls in love with the enigmatic, volatile Catherine. However, Jim also has feelings for her... I really don't know why this is regarded so highly. The story is mostly quite dull, the characters are not that engaging, the ending is abrupt and there isn't much point to the whole thing. Performances are unconvincing and a tad irritating.It is quite morally progressive for 1962, and the relationships involved are quite liberal for the time, so maybe that's what all the fuss is about.",
            "review_date": "2015-10-14",
            "lang": "en"
        },
        {
            "review_title": "Tedious movie about unlikable people",
            "content": "I had never intended to watch this movie, having found Truffaut at best okay and at worst, as in Shoot the Piano Player, everything I hate about French cinema. But after my girlfriend said she had really liked this movie years ago I decided to take a look.First off, I don't like Jules and Jim. They are too utterly passionless guys who intellectualize and prattle on. I don't care about their lives.As for Catherine, she's not so much a person as a collection of enigmas strung loosely together. The goal seemed to be to portray the WOMAN AS MYSTERY, but doing a bunch of random, weird things is more likely a sign of mental illness, and Catherine is never made real enough to seem mad or sane. She's just MYSTERIOUS.After a half hour I was wondering why this movie was such a big deal, so I took a break to read some articles on it. Apparently, the way it was filmed was fairly original, with freeze frames and hand-held cameras and newsreel footage. The best moments are weird jumpy moments set during the film's unnecessary voiceovers, which unfortunately I couldn't completely enjoy because I had to read the subtitles.Which is fine, but I never felt the purpose behind it. Films like Hiroshima Mon Amour and Citizen Kane did unusual, original things, but they did them for specific purposes that propelled the story and informed the feel. Sometimes Jules et Jim uses its gimmicks to good effect, as in the race across the bridge, but often it just feels like it's just tossing in stuff with no real purpose.I started watching again, but the insufferable characters kept being insufferable and the story kept being nonexistent. Then I read a plot summary which made me decide to fast forward to the only part of the movie when anything happens. It seemed dumb, but I admit that since I skipped forward its possible I missed context.This is a very French movie, by which I mean it's incredibly talky and no one says anything interesting.",
            "review_date": "2017-11-18",
            "lang": "en"
        },
        {
            "review_title": "menage à Trois",
            "content": "François Truffaut's third film is generally celebrated as a benchmark in his filmography but also in the Nouvelle Vague and even of the whole French cinema. Once again, such paeans of praise for this good but by no means extraordinary work go beyond me. A lot of viewers seemed to have been conquered by this story which is basically a novel penned by Henri-Pierre Roché. The former reviewer at the Cahiers Du Cinéma who once lambasted major French filmmakers of the forties and the fifties was struck by the mix of improper and purity which suffused in the novel. This is what galvanized him to film this unique story, at least for him and for the supporters of the film.The first thing to bear in mind is that the starting point (two men and a women living together for a long period of their lives) isn't new. In 1933, Ernst Lubitsch had signed a work called \"Design for Living\". This sparkling comedy already sheltered a \"menage à Trois\" and was much more enjoyable and accessible than Truffaut's arty work. \"Jules et Jim\" was also celebrated for its innovative directing and its stunning camera work. Okay, it's a bonus for the film but once again I could argue that there is nothing astounding about it. On the same year the movie opened in 1962, John Frankenheimer cranked out the mind-boggling \"the Mandchurian Candidate\". It's not the same kind of film at all but I was much more very taken with the filmmaker's camera work which worked wonders to serve a far-fetched but thoroughly riveting story. Frankenheimer's magnum opus did better since it heralded the political thriller which had its hour or rather decade glory in the seventies with works like Alan J. Pakula's \"the Parallax View\" (1974). In \"Jules et Jim\", the creative liberties dear to the New Wave clique are well present and enhanced to try to reflect the mood a sequence could convey, especially in the first half (before the war) which brims with happiness and lightness. The whole dovetailed to establish a good dose of escape and dream to the audience. Actually, Truffaut's movie is half successful in the way the first part (before the war) makes sense in my eyes. There is none disadvantage in watching a threesome of two men and a woman leading a freewheeling life without any major problems (financial or other). But after the war, the second part veers to a somber direction and things go wrong because their demeanors are elusive to my mind. I don't understand their actions, their motivations, especially Jules'. If he is so unfortunate with Catherine, then why doesn't he go away? Catherine's character seems to be dangerous because she jeopardizes Jules and Jim's friendship. Catherine's behavior and persona leave me baffled. What doesn't facilitate things is that she pronounces one cue which can infuriate the ones who aren't touched by this story: \"I don't want to be understood\". Besides, I do think that Truffaut's film is peppered with lines which seem ludicrous to me such as \"it's twenty to one\", \"an angel is passing\" \"it's normal, angels pass at twenty of every hour\".\"Jules et Jim\" is the Nouvelle Vague in all its splendor and its pretensions with an emphasis on the form rather than the content which remains unfathomable to me. Storytelling is not Truffaut's forte or otherwise it obeys to a form of logic which is out of reach to me. That's what I want to gently laugh at his contention that \"a film is a story and a story has to be told. Even in the cinema\". But in spite of his tricks and devices to tell the steps of this story and make the characters likable (use of neutral voice-over), I'm not touched at all. What to say about the cast? Each actor has the head in the clouds, seems to act apart their respective roles. Hence, an impression of false. Jeanne Moreau is a remarkable actress but elsewhere and still today. Check François Ozon's latest opus \"Le Temps Qui Reste\" (2005). She only appears ten minutes but her part is momentous and understandable for the progression of Romain's sickness.I'll surely provoke an angry response from the defenders of the film but \"Jules et Jim\", this mix of slightness and gravity in the same bag has no effect on me. But there are some of Truffaut's \"Nouvelle Vaguesque\" peers for whom the notion of storytelling is absent from their cinematographic concerns like Jean-Luc Godard's stream of consciousness-like Pierrot Le Fou\" (1965).",
            "review_date": "2006-06-04",
            "lang": "en"
        },
        {
            "review_title": "Since everyone else is too scared to write what they really think - for fear of appearing \"uncultured\" - I will.",
            "content": "A better title would have been \"The Two Suckers\".The movie starts off with a one-minute summary/prologue of some events that transpired between and around J&J. It went by so quickly that I could barely catch anything, except that Jules failed humping a number of women whereas Jim had them all, the French narrator pretty much being hell-bent on setting a new world-record in speed-jabbering. \"Well, that must have been the movie then!\" I thought, for there was enough plot in that speedy recount of events for an entire prequel to J&J. I guess that prequel would have been called \"Jim & Jules: Their Happy Life Before Katherine\".We find out that J&J are poets, writers, artists... Oh, no! Not another pretentious Euro-trash saga about the sensitive souls that inhabit Paris while discussing the meaning of life! But no fear. While the movie IS pretentious, though, it's not about the meaning of life, but about the meaning and intentions of a particularly empty-headed French bimbo by the name of Katherine. After all, this is a French movie.Before meeting this \"apparition\", as Jim so pretentiously calls her, J&J see a woman's \"mysteriously smiling\" face carved out of a rock. J&J \"both dressed the same way\" to see this work of art, we are told by the narrator, by not WHY they dressed the same way. And what happens if I dare ask why? I will be called an uncouth philistine who doesn't appreciate the \"depth\" that this movie has to offer. Nevertheless, I still ask why. If anyone out there can tell me, feel free to e-mail me. I look forward to reading your silly hallucinatory psycho-babble.Anyway, predictably they meet a woman who fits the rock's smile, and it's of course Jeanna Moreau, whose beauty is vastly overrated. Katherine wants to set a bunch of papers (letters?) on fire which she refers to as \"lies\" (how poetic!), and in the process she nearly burns herself and her house down. Conclusion? Katherine is a moron. J&J have just fallen in love with a dumb floozy. That's what happens when penises do the thinking, nothing new there.After watching a play, J&J disagree with Katherine on whether it was good or not. Realizing that J&J are far superior to her intellectually - i.e. she ran out of arguments - she spontaneously decides to jump into the river. The narrator calls it her \"victory\". So, all you women out there, if you ever find yourself out-argued: jump into the nearest batch of water. That'll show 'em! WW I breaks out. Symbolically, J&J get split up to fight on opposing sides. The thing that made me smile was that both of them expressed fear of killing the other in battle. Are artists that dumb? What are the odds that they kill each other, in a war in which millions upon millions of soldiers participate? Still, this part of the movie was not bad at all, but this was probably due to the stock-footage of trenches and battlefields. I.e. these scenes were NOT directed by Truffaut so there was nothing much to criticize.The war was over, Jim's side won. It turns out Jules has a child with Katherine (which is probably not even his), a woman who is not only dumb but also turns out to be a slut, having cheated on her husband numerous times. Jim sees his chance! Btw, there is a silly scene in which Katherine lists various wines, and this moment reminded me of Monty Python's \"cheese sketch\". Nevertheless, the movie was improving at this point somewhat.Eventually, Jim hooks up with Katherine: they're together, they split, they hook up, they split, they hook up, they split up - and then Katherine drives them both off a bridge, leaving Jules as the sole survivor of this French game of \"who's the ass?\". (The moment I saw her driving the car I knew she was going to do that.)I love the way Truffaut (through his alter Ego, Jules) makes up excuses for Katherine's behaviour. When she's unfaithful, she is \"exploring the boundaries of experience\" or some such \"poetic\" malarkey. Jules is always covering up for her selfishness like some demented moron with his semantic bulls**t, which has nothing to do with the real world. Truffaut's skewered views are on display in other parts, too: Jules says that Katherine is \"neither too beautiful, intelligent, or sincere\" but that's what \"every man wants\"! What???? Maybe French men! Similarly, the quasi mini-hippie commune that the two morons, the harlot, and the child briefly form is supposed to be exalted, oh-so progressive, advanced. But what's one to expect from a decadent left-wing European director? I was also fascinated by Katherine's penis-hopping. At one point she had dinner with three of the men she was involved with. There are pro prostitutes that can't achieve a feat like that... Truffaut tries to inject a philosophical slant to the whoring around, but no words, no matter how cleverly articulated, can mask the truth: namely that Katherine just gets bored with one penis far too easily then jumps on to the next. Just another floozy, what's there to discuss? I found the narration to be too robotic, matter-of-fact. The narrator talked about all these complex emotional happenings, but he recited them with the passion/interest of a school-kid forced to recite a poem. In fact, they might as well have used Stephen Hawking's voice-box... Plus, some of the things said in the narration were superfluous, e.g. when Katherine walks Jim to the station in an obvious fog; it is then that the disinterested narrator informs us that \"a fog has fallen\". No kidding??Oh, yes, and the movie is about destiny, for example Jim missing Katherine by only ten minutes in the bar, an event that could have changed everything... and... oh, whatever...",
            "review_date": "2007-08-11",
            "lang": "en"
        },
        {
            "review_title": "Truffaut's \"Hymn to Life\"",
            "content": "Although \"Jules and Jim\" was made over 40 years ago and takes place 40 to 50 years before that, the amazing thing is that it barely seems to have dated. Because it focuses on the universal human relationships between its characters, rather than the specific time in which they live, it's the rare film set in the past that doesn't feel like a \"period film.\" And, especially in the first half of the movie, Truffaut's New Wave techniques lend a remarkable energy and freshness.The movie explores friendship and love among three semi-bohemian types: Parisian Jim (Henri Serre), Austrian Jules (Oskar Werner), and Catherine (Jeanne Moreau), the beautiful, free-spirited woman whom they both love. She's the most vibrant character in the movie, and impossible to pin down. It's never clear who she loves\u0097she contradicts herself repeatedly, and perhaps loves no one but herself\u0097or whether she's diabolical or simply misunderstood. Moreau nearly steals the movie, if not for the fact that the title reminds us to focus on the relationship between the two men, and that Serre and Werner give good performances too. Even if Jim and Jules aren't as mysterious as Catherine, they're complex and interesting characters in their own right.The story plays out rather episodically, which means \"Jules and Jim\" is full of wonderful little moments, often involving the crazy things Catherine does. Some of my favorites include her dressing up as a man and racing Jules and Jim across a bridge; her jumping into the Seine in frustration; and her singing the movie's charming theme song, \"The Whirlpool of Life.\" The episodes are linked together by surprisingly unobtrusive off-screen narration, which keeps the film moving along rather than slowing it down.\"Jules and Jim\" does get a little tiresome toward the end, with Catherine continually vacillating between the men in her life, Jim vacillating between Catherine and his old girlfriend Gilberte, and Jules remaining loyally devoted to Catherine despite how foolish this may seem. However, the movie is redeemed by its tragic final scenes, which poignantly contrast with the carefree gaiety of the beginning. Jules, Jim, and Catherine are caught in a destructive spiral, tossed and defeated by the whirlpool of life. Still, the tone of the movie is gentle and human, not pessimistic. Truffaut considered \"Jules and Jim\" a \"hymn to life,\" and it is most memorable as a vivid celebration of friendship and youthful possibility, even as it acknowledges how those things can sour.",
            "review_date": "2006-05-25",
            "lang": "en"
        },
        {
            "review_title": "Another Drama Queen Bites the Dust...",
            "content": "Despite the radiant beauty of its hopelessly misguided leading lady and solid performances by the entire cast I'm truly stumped as to why this film gained such popularity and a cult following. The story was, in my opinion, boring and overly long. The characters, other than the tortured husband, were a bunch of worthless nitwits, who lacked any dimension or depth of feeling. Why is it that instead of finding the ending tragic I simply felt that a couple of people, who caused a great deal of pain to others, wasted their lives and my time were put out of everyone's misery? What a dismal disappointment this film, which I had looked forward to seeing, turned out to be...",
            "review_date": "2010-09-04",
            "lang": "en"
        },
        {
            "review_title": "art isn't about \"identification\"",
            "content": "Why do so many people need to \"get into the characters\" \"care about the characters\" \"identify with the characters\", to enjoy or appreciate a great film? I think it's a type of selfishness, as shallow as the urge to reject an outcome one doesn't like. Examples: \"I know it's good; but the ending was too down\" (Lolita), or a woman I once heard criticize Unbearable Lightness of Being because one of the main characters is a womanizer who doesn't repent or have justice rendered to him. Ironically, in Jules and Jim, we see a woman who is a \"manizer\" whom some viewers are appalled or put off by). Jules and Jim features three characters whose unrealism is beyond question - Truffaut himself might comment on how Catherine fascinated the other two, but I doubt very much he would claim any of the three to be \"realistic\". I think the whole thing is a fable, and therefore the three are more like archetypes. The beauty isn't really the story, but HOW the story unfolds, and, most importantly how it is told VISUALLY: the breeziness interrupted by dramatic outbursts (flames, jumping into the river, death by drowning), the exploration of love as a fleeing of tediousness and predictability, the hinting (yes there is a type of love between Jules and Jim, though not a homo erotic one) that friendship is always deeper than romantic love, the beautiful flowing and editing of sequences, for example: where all three go bicycling in the country. The duty of film is to tell a story in moving images, to take advantage of the things that specifically make cinema different from drama or literature - moving the spectator about in space and time, which cannot be done in any other art form in quite the same way. But nothing about this movie is conventional, and people looking for \"resolution\", or a someone getting their comeuppances, or even a character learning more about himself must look elsewhere for gratification.",
            "review_date": "2005-03-04",
            "lang": "en"
        },
        {
            "review_title": "Whirlpool Of Days",
            "content": "Those with heavy sensibilities along the lines of conventional \"morality\" seem to have a hard time allowing themselves to enjoy this film for what it is:  A beautiful visual poem about the passing of time and the progression and growth of an unusual friendship. This friendship may be unusual but feels completely natural and true. Jules and Jim if anything, exhibit great maturity in their relationship with each other and Catherine. It's refreshing to see a film dealing with a deep love,  friendship and emotional bond between two males and a mutual love for a woman, without the usual competitiveness and controlling possessiveness that is the norm. Jules and Jim come off more as an enlightened pair. It seems understood among them there is no real belonging of one human being to another. Catherine's whims of the heart are discussed between them at every stage throughout the film and they are willing to accept them and love her for who she is as well as each other.I do feel that this film lost it's pacing toward the end and seemed to speed up to conclusion. That being it's only flaw.  Visually it is stunning. Francois Truffaut was a poet with the camera and his subtle nuances are captivating. The scenes of Jules, Jim and Catherine enjoying days together seem so natural and evoke the feel of wonderful days spent together among best friends that transported me back to days gone by.\"we met with a kiss/ a hit, then a miss/ and we parted/ we went our own ways/ in life's whirlpool of days/ around and around we go/ together bound/ together bound.\"",
            "review_date": "2002-01-11",
            "lang": "en"
        },
        {
            "review_title": "Truffaut's Classic Relationship Triangle as Idiosyncratic, Disconcerting and Mesmerizing as Ever",
            "content": "The enduring legacy around François Truffaut's emotionally turbulent 1962 film depends primarily on how compatible the three actors are in inhabiting the triangle at the core of the story adapted from Henri-Pierre Roché semi-autobiographical novel. And in fact, Oskar Werner, Henri Serre and especially Jeanne Moreau provide superbly etched characterizations in one of the defining works of the French New Wave. Fortunately, the two-disc Criterion Collection DVD set provides an appropriately rich package for this classic, although the print transfer is frustratingly variable at times.The story focuses on the friendship between two writers, an Austrian named Jules and a Frenchman named Jim, kindred spirits who enjoy a decadent lifestyle in pre-WWI Paris. Inspired by a statue of a woman's face with a most enigmatic smile, they agree that they are destined to fall in love with a woman with the same smile. Enter Catherine, as seductively capricious a free-spirit as ever there was in cinema, and the two men are instantly enamored. Jules is intent on marrying her, even though it's clear from the outset that she is not one who could commit for the long term. The war intercedes, and the two friends are fighting on opposite sides. After the war, Catherine, married to Jules and raising their young daughter, is emotionally dissatisfied and embarks on an affair with Jim. With Jules' blessing, things are idyllic for a while, but Jim proves too much the alpha male to defer to Catherine's whims, and the resulting imbalance leads to increasingly dramatic consequences.In just his third film, Truffaut's trademark style emerges with fast cuts between scenes and naturalistic camera movements (courtesy of Raoul Coutard's fluid cinematography). Moreover, George Delerue's animated music score and Michel Subor's voice-over add to the evocative photo-album memory atmosphere. At times, the storyline feels a bit disjointed, but the fulsome performances more than compensate. Werner fully captures the internal struggle within Jules in attempting to reconcile his love for Catherine with her impossible demands on him. Serre has the comparatively more objective role but convincingly shows his character surrendering to the tangled situation. After her impressive turn as an obsessed adulterer in Louie Malle's \"Elevator to the Gallows\", Moreau solidifies her vaunted reputation here, conveying Catherine's petulance and unyielding passion in a vividly mercurial fashion.The DVD extras are abundant starting with two commentary tracks. The first one, a more factual account of the production, was recorded in 1992 with Truffaut collaborator Suzanne Schiffman, editor Claudine Bouche, co-screenwriter Jean Gruault, and scholar Annette Insdorf. The second, produced in 2000, is far better as it has Moreau sharing her personal recollections of the filming with Truffaut biographer Serge Toubiana. Disc One also includes a brief 1966 interview with Truffaut discussing Roché and a 1985 featurette, \"The Key to Jules and Jim\", which contains interviews with the author's friends as they discuss the inspirations for the characters. Disc Two takes a broader look at Truffaut with five separate interviews with the director over the span of fifteen years, as well as insightful interviews with Coutard and co-screenwriter Jean Gruault.",
            "review_date": "2006-05-27",
            "lang": "en"
        },
        {
            "review_title": "Inscrutability becomes randomness",
            "content": "3 out of 10First, let's self-credential.  I think Day For Night is brilliant, I appreciate some Godard, and wasn't scared away by Last Year in Marienbad, so my dissatisfaction cannot be explained away by mere francophobia, or ugly Americacentrism.This movie is simply too inscrutable.  When character motivations and sensibilities are so alien, their actions are essentially random to the viewer.  Random action makes for a plotless movie.  Then again, I suspect this movie makes no sense in any language. As when reading philosophy, when confronted so, the intellectual has two choices.  One is to look at the confusing text peppered with bon mots and say \"This is brilliant/deep/ineffable.\"  In other words: \"I \"know\" this is supposed to be important, so there must be something there I'm missing. There's something wrong with me.\"  The other path: \"This is balderdash cloaked in mystery.  There's something wrong with it.\"I choose the latter.",
            "review_date": "2002-10-07",
            "lang": "en"
        },
        {
            "review_title": "Good in parts but generally over long, dreary and unengaging.",
            "content": "In the early 1900's two men meet, Jules an Austrian (Oscar Werner), and Jim a Frenchman (Henri Serre). As their friendship grows they indulge in more and more womanising, nearly always sharing their lovers. However, when Catherine comes into their life things change and Jules marries her, nevertheless, a few years later she starts to fall for Jim. Thus develops a bizarre love triangle which seems set to lead to a dramatic ending.I'm a fan of many Truffaut films, 'The 400 Blows' being one of my favourite ever films, but I found this tedious, uninteresting and I was unable to emotionally engage with any of the characters. Technically it was very good and I realize that his style has influenced the finest directors of the contemporary cinema which we enjoy today.However, in terms of story and the ability to allow me to empathize with characters it faltered. As the film went on I become more and more uninterested and even less enthusiastic for the film form and techniques Truffaut had crafted.Perhaps this film is like Marmite, (or so the advertisers would have us believe), you either love it or hate it. For me it hardly sustained my interest and although I don't hate it the story failed to engage me whatsoever.",
            "review_date": "2005-01-05",
            "lang": "en"
        },
        {
            "review_title": "Unconventional Love Story",
            "content": "In 1912, in Paris, the French bon-vivant Jim (Henri Serre) meets the insecure German Jules (Oscar Werner) and they begin a great friendship. When they meet the fickle and independent French Catherine (Jeanne Moreau), they immediately fall in love for her. However the naiveness and fragility of Jules attract the amoral Catherine and she marries him. With the First World War, the best friends Jules and Jim are separated but after the war, they reunite in Jules cottage in Germany. Jim stays with Jules, Catherine and their daughter Sabine (Sabine Haudepin), and Jules tells his friend that he is living together with Catherine, but she has affairs with her lovers. When Catherine falls in love for Jim, Jules asks him to stay with her at his house. Along the years, Jules and Jim live a triangle of love of Catherine, but never affecting their friendship and respect.\"Jules et Jim\" is one of the most (or probably the most) unconventional love stories of the cinema history. For a 1962 movie, the daring tale is absolutely ahead of time, with Jeanne Moreau performing a character that never lets her love becoming boring or monotonous, reviving and renewing her feelings and desires with lovers and then returning for her husband. The friendship of Jules and Jim is weird and also unusual, with memorable performances of Henri Serre and Oscar Werner. My vote is eight.Title (Brazil): \"Jules e Jim \u0096 Uma Mulher Para Dois\" (\"Jules e Jim \u0096 A Woman for Two\")",
            "review_date": "2009-01-18",
            "lang": "en"
        },
        {
            "review_title": "French machismo",
            "content": "I don't understand why this film gains in popularity, and not infamy, as the years go by.  Jules et Jim is all that is bad in French cinema.  It's a deeply sentimental film, relying on the clichés of emotional and philosophical depth instead creating new pathways to them.  Fuzzy lenses, grassy fields, dancing in the streets of Paris, love torn asunder by war. It's the stuff of The English Patient--all the tools of greatness and depth, but essentially lacking in insight.  As Herzog would say, cinematic tourism.   Jules et Jim doesn't seem to comment in any real or important way upon monogamy, friendship, sexual difference, anything.  Jules and Jim are indecisive, selfish protagonists in the great French existentialist tradition--when you don't know what to do with yourself, or find yourself somehow lacking, you have sex with the type of woman you want to be.  Poor Jean Moreau is not a woman; she's a hurricane of potential existential and libidinal delights.    Jules and Jim are not passionate; they're sad and childish.  Witness how they're so pacified by Moreau's rendition of the saccharine-sweet lullaby \"Le Tourbillon.\"",
            "review_date": "2001-05-06",
            "lang": "en"
        },
        {
            "review_title": "Jules et Jim embodies the beauty of French cinema",
            "content": "The French have a remarkable tendency of creating free-flowing, poetic movies that transport this particular art form into subtle, poignant flights of fancy and nowhere is this more evident than in Jules et Jim, which embodies the beauty of French cinema.I believe that Truffaut is the most poetic filmmaker in cinematic history. Jules et Jim is his finest moment and, in the ever fluctuating relationships between the Oskar Werner, Henri Serre and Jeanne Moreau characters, we are allowed to be taken along on a refreshing, beatific ride through the passionate simplicity of love and friendship.The leisurely philosophical musings of the two men in Jules et Jim are counterbalanced by Moreau's bright, airy amorality. She brings about a radicalism and sense of unpredictability in the movie that is nonetheless charming and utterly innocent and benign. Moreau's instinctive will makes her out to be a selfish attention-seeker but without that this movie would not be so surprising and liberating. Truffaut's does not stick to a rigid narrative form, like many '50s and '60s French New Wave directors, and he allows the stream of consciousness dialogue and the ever-changing fortunes of Moreau's erratic relationships with the men to dictate the structure. Jules et Jim has a certain clarity of vision.French love stories are often based upon dialogue that is rife with throwaway witticisms, perceptive trivial observations, and explosive utterances of love or despair, and Jules et Jim is no different. It can drift along tranquilly until a sudden unexpected change of mood occurs and everything is turned on its head. Moreau's leaping into the river after a civilised night out at the theatre is a delightfully liberating moment, utterly pointless yet still gleefully uninhibited. My finest memory is the heavenly ditty by Moreau which sums up both her and the movie's personality and atmosphere. So simple, so sublime, and always tugging away in the most sumptuous manner at the heartstrings. I don't think I have ever got that tune out of my head.If you want to experience the sheer majesty of cinema, Jules et Jim just has to be seen. Not only is it bright and breezy but it has tragic moments of pathos as well. There is a surprise at every turn, almost always caused by the Moreau character, and such is the freedom of her spirit and the freedom of the movie's spirit, you can forgive her every action and fickle about-turns. There is no sense of permanence with her. Jules et Jim only confirms my belief that the French make cinema's greatest romances. Utterly natural, hardly ever contrived, and so cool and graceful.",
            "review_date": "2000-10-14",
            "lang": "en"
        },
        {
            "review_title": "Forces of Nature",
            "content": "There is a book by Goethe mentioned in this movie, it's \"Wahlverwandschaften\", and its appearance is quite meaningful. Because the movie takes a look on human loves and lives that is quite similar to older Goethe's fatalistic world-view in his novel, very far from hope and idealisms. Strength (Moreau's character) and Weakness (Jim) are equal forces of nature, and both conduct us to death. The stoic attitude (Jules) is resignation and, seen this way, it is \"weakness\" too, but, on the other hand, it seems to be the STRONGEST way, because it means survival. JULES ET JIM,  both in its content and in its aesthetics, has an air of antique tragedies, but - and this is more like the German novel - without complain, without crying. That's why it leaves you so \"unsatisfied\", and that's why it's still disturbing, even today.",
            "review_date": "2003-07-23",
            "lang": "en"
        },
        {
            "review_title": "Great filmmaking by Truffaut",
            "content": "The basis for this movie is a love triangle between two friends (Oskar Werner as Jim and Henri Serre as Jules) and a free-spirited young woman (Jeanne Moreau as Catherine). It's a joy to watch, all three actors are fantastic, and the 'New Wave' filmmaking by Francois Truffaut is very creative,with brilliant sequences which make it clear that he had an influence on Wes Anderson. It was only his third movie, and there is a freshness about it, with several iconic scenes including the ending, but I won't spoil it. The movie captures universal truths about relationships, while at the same time highlighting the very French attitude towards affairs. Never slow, and definitely worth watching.",
            "review_date": "2016-04-28",
            "lang": "en"
        },
        {
            "review_title": "I must be missing something",
            "content": "I must be missing something. After all, this is one of Francois Truffaut's most respected and critically acclaimed movies--and I only thought it was average--certainly not something special. I felt pretty much the same way about The 400 Blows--they're decent enough movies but didn't particularly move me. However, I did like other Truffaut films, such as The Wild Child, The Last Metro and Fahrenheit 451, so I don't think I have any deep seeded hatred of the director or French cinema.First, I do admit that the acting and direction were good. However, I just didn't feel that engaged by the characters--I just didn't seem to care too much what happened to them and I was a bit bored by the love triangle. I think that is the key for me, as his other films I didn't care too much for all featured characters I couldn't really respect or care what happened to them, while this was not the case with those I liked.I guess this means that if you don't mind having a movie where you don't feel much emotional connection to the characters, you'll probably love the film. My own personal prejudice is that to enjoy a movie I need this connection on some level.",
            "review_date": "2005-07-01",
            "lang": "en"
        },
        {
            "review_title": "For Whatever Reason",
            "content": "Having seen this film a few times as I have moved through life, I'm always left with the same thought: Why waste one's life on someone as shallow as Jeanne Moreau's character. She is fickle, mean spirited, impulsive. She is beautiful, but as the film moves forward, even that seems like it's fading. I realize it is what it is. You can't criticize a film for presenting two guys (actually three) who do truly love this woman. Sometimes I wonder if they love the time as much as the person. Their lives are really empty. They are just the opposite of their love. They are slow to move and act. One of them could die of terminal shyness. They are willing to pay a horrible price just to be around her. She seems classically bipolar in many ways, but sick people sometimes attract sick people. And, of course, love is something hard to quantify. There is something funereal about the whole thing. Truffaut masterfully frames this film. Images are carefully constructed as we view the frolicking in the French countryside. LIke with all those guys in literature who would rather die than give up hope, I wanted them to save themselves.",
            "review_date": "2010-01-19",
            "lang": "en"
        },
        {
            "review_title": "One of the most inspired films ever",
            "content": "Truffaut is one of my favourite directors and Jules et Jim one of my favourite films. As Jeanne Moreau recalls in an interview re her relationship with Truffaut at the time (they were briefly in love), this was a movie no one wanted to finance, that she had to help finance herself with money she had just scored from her latest film success (even her car was used to carry sets and other filming equipment) and which depended to a large extent on conditions on the ground and inspiration on the part of all, especially Truffaut, at any given time.Thus, creation happened as inspiration came to Truffaut, Moreau and the crew and as Moreau remarks, the whole movie feels and flows like a song (she does sing the theme song, rather well at that too!). Jules and Jim are star crossed friends. They have similar tastes and are ready to do anything for each other but being German and French they end up on different trenches in the war. They have imagined and then seen the bust of the ideal feminine beauty and and proceed to look for her in every nook and cranny, ultimately finding her in the shape of Moreau at a function.Moreau is luminous in her role as Catherine that would have earned her permanent recognition if she had done nothing else. She is not just beautiful or alluring - she is Woman itself in all its complexities, falling in and out of love, holding on or letting go as is her wanton. There is a moment in the film when she does not get the attention of the two men because they are playing a game and immediately she demands attention and does not stop until she gets it.Truffaut said on more than one occasion that his relationship with his mother (a rather distant one, reportedly) had had an impact on his relationship with other women but in Jules et Jim he is able to portray the female of the species with a depth and an understanding such as I had never witnessed before or have since.Truffaut's direction is peerless in its acuity and sensitivity, and it is greatly aided by some of the loveliest photography ever. In addition, he extracts superlative performances from all three leads. Oskar Werner's performance is deft beyond words. Henri Serre reminds me of Daniel Day-Lewis with a steely performance to match.As art lovers, they fall in love with a bust of a woman and look for her until they find Catherine. Is this Catherine an echo of Cathy in Wuthering Heights? Serre might be the Heathcliff while Werner sounds more like an undecided Hamlet knowing he cannot hang on to his Ophelia. The passions at work in the film more than match that of the Bronte novel's characters and, of course, that of the lukewarm Dane.As lovers of the flesh, Jim has a child by Catherine and Jules her love - but it carries a price. The ending is a subtle mix of irony, sadness, insightful observation and even a touch of the clownish with an unsuitably dressed Jim walking away with the ashes of his beloved lover and friend... much as Hamlet might have walked away with a skull or two.There is a lyrical quality to this film that I believe has never been surpassed. Judging from Woody Allen's \"Vicky Cristina Barcelona\" -- which borrows shamelessly from the ideas of \"Jules et Jim\" -- it will take real genius and a many months of sustained inspiration to surpass it. Given the current never ending supply of mass produced flicks, I doubt it will ever be matched let alone surpassed...\"Jules et Jim\" is a most intelligent film and a privilege to watch. If it were down to me, it would score 11 out of 10.",
            "review_date": "2009-04-09",
            "lang": "en"
        },
        {
            "review_title": "Unconventional love story of two friends in love with a free spirit...",
            "content": "JULES AND JIM is another film that could have benefited from some judicious cutting. It tells the trifling tale of two men who are inseparable friends (OSKAR WERNER and HENRI SERRE), both in love with the same free spirited woman (JEANNE MOREAU) who seems anxious to not only defy convention but all the laws of truth, fidelity and morality in her search for happiness. She can't make up her mind from moment to moment whether she's in or out of love with either man and goes to extremes to show her displeasure with both of them. There's obviously something pathological about her nature, but neither man seems to care about that.The ending comes somewhat as a shock--but is telegraphed early on when she first plunges into the water without a word of explanation for her rash act. We are then expected to sympathize with her plight for the rest of the film, since the two men obviously are head over heels in love with this puzzling creature whom they fell in love with because she resembled the statue of a woman with a quiet smile. As played by JEANNE MOREAU, she is the personification of a flighty woman who cannot and will not make up her mind about anything as important as loyalty and marriage or any kind of stability in her life. Sullen at times, cheerful and playful at others, Moreau plays her role to the hilt.If this menage-a-trois from French filmmaker Francois Truffaut is your cup of tea and you are an admirer of the French New Wave style of cinema, this is likely to be one of your favorite films. Others may find it too leisurely in the telling told in a style that is disjointed, to say the least.The last line of the film spoken by OSKAR WERNER says something about her ashes not being scattered over the countryside because this was against the French authorities. A fitting description of the woman herself who defied every authority in her own quest to find life worth living. Some call the film a masterpiece--I'm inclined to think it is much less than that.",
            "review_date": "2009-06-18",
            "lang": "en"
        },
        {
            "review_title": "You end up loving it!",
            "content": "This is the first movie by Truffault I've ever seen, and I have to say I'm now very intrigued in his other work...\"Jules et Jim\" is the story of two friends who meet a very beautiful and strange woman who turns up to be a bit unstable...It starts with how they all meet each other and end up together... I thought the beginning was pretty fast as many things happened and you just wonder if the whole movie will be like that. Also I thought I didn't care much for any character, but of course it was too quick to judge. There is also a narrator (throughout the movie) and at first you ask yourself if its really necessary...Still, when I decided to go grab a snack, I realized I was so hooked by the story that I couldn't. The characters behaved like no other I've seen and you find yourself wanting two different things: for it to end and for it never to end.The movie has it's many twists for those who like, even a laugh here and there, but if you see it as a whole is a very deep description of the relationship between the three main characters.The end is somehow beautiful, maybe because is \"fair\", maybe because is \"real\", maybe because is \"surreal\", you'll just have to watch and find out...Is one of those movies when after watching it you understand both sides: those who say it's overrated and those who claim it's a masterpiece... to me it was a one in a lifetime film experience",
            "review_date": "2005-02-15",
            "lang": "en"
        },
        {
            "review_title": "Scorsese is a big fan of it, I'm not",
            "content": "It is never a good sign when 24 hours after viewing a film, the viewer forgets almost everything about the picture even with a pad of notes on the piece. As is the case of Jules et Jim, a favorite among film historians and critics. I tend not to agree with what critics say. If the majority of film critics hate a movie, chances are that I will love it. If the majority of film critics love a movie, chances are that I will absolutely hate it. Jules et Jim just wasn't for me. Having an extreme distaste for romance as a genre played a big role in inability to find much to like during the nearly two hours of running time. The opening scenes are among the best. The voice-over narration, a technique I normally find annoying, works wonderfully in setting up the relationship between Jules and Jim, the two leads that the audience has to find appealing to spend the rest of the film with. For the first ten minutes, their interactions come across as true to life-real and honest. The two leads, Oskar Werner and Henri Serre as Jim and Jules respectively, have chemistry that makes it easy to believe that they are best friends. The introduction of Therese, a mysterious woman seems to take the storyline in an interesting direction. Yet Therese disappears soon after her introduction and another mysterious woman, Catherine, is brought in. The problem is I found Therese more alluring than Catherine. I knew almost instantly once Catherine was introduced, that she was going to end up unstable. I had figured out her character shortly before she plunges herself into the water. Director Francois Truffaut didn't do anything to provide enough suspense or mystery with Catherine. Unlike with 400 Blows, Truffaut opts not to use his impressive use of pseudo-documentary style. Had Truffaut used a similar technique here, following the characters, especially the character of Catherine, would have made for a fascinating watch. With a documentary style, watching the lives of Jim, Jules, and Catherine slowly fall apart would have seemed almost heartbreaking, or if not, at least more interesting. Done the way it is, the whole experience just comes across as predictable and a bit boring. Being a romantic drama, it was obvious from the start that at least one of the characters was going to die in the end. One of the defining staples of romantic dramas is the death of one or more of the lead characters in the final act. Jules et Jim was able to keep me semi-engaged with the constant guessing of which one of the three leads would end up dying. At one point, I thought maybe all three wouldn't live. Truffaut deserves credit for making the ending work as well as he does. The death scene is not a long one. In fact, it is a very short scene. Sometimes the shorter the moment, the more effective it works. The ending could have been drawn out yet Truffaut makes it short but sweet. I can't say I was particularly fond of Jules et Jim. However, the early scenes and the ending work well. If only I could say the same for the rest of the movie.",
            "review_date": "2008-03-30",
            "lang": "en"
        },
        {
            "review_title": "Major disappointment",
            "content": "Beautiful but rather pointless French \"nouvelle vague\" (new wave) exercise. I was in high school when this film came out, and much was made of it by the critics. I never found Jeanne Moreau as beautiful as others did, but having seen this film today for the first time, I can say she looked terrific. Nevertheless I believe that her character was that of a spoiled, selfish, never-to-be-redeemed woman who can't have what she wants and ends up in the drink. As for the two protagonists, they were just plain immature and were never going to grow up. I hope that little Sabine grew up to be healthy. Sadly we saw nothing about her during the last part of the movie. What a waste of two hours. I'll take \"Last Year in Marienbad\" but not this tedious mess.",
            "review_date": "2017-12-05",
            "lang": "en"
        },
        {
            "review_title": "Another French \"masterpiece\" leaves me cold.",
            "content": "Why is it that so many French films that everyone acclaims as masterpieces bore me so much?  \"La Grande Illusion\", the \"Three Colour\" movies and many others do not touch me or move me in any way.  The persistent distancing from the characters by many French directors is probably the reason - I don't feel I ever got to know the characters in this film - so why should I care what happens to them?The Jeanne Moreau character is so supremely selfish that I could not like her in any way - and the two men seemed stupid for constantly returning to her.  I can't care for such selfish and stupid people.  And how could the two men be so little affected by something as horrific as trench warfare in World War One?  It was almost as if they'd just been off to summer camp.There are moments of stylish cinematography and, despite the period setting, the whole thing is nicely sixties, but overall I thought \"so what\".",
            "review_date": "1999-08-27",
            "lang": "en"
        },
        {
            "review_title": "Jules and Jim and Catherine",
            "content": "It's around 1912 Paris. Austrian Jules asks Jim to get him into the Quatres Arts Ball. That's the beginning of their friendship. They meet many women including Thérèse and Catherine. Catherine reminds them of a statue that they love and the three become inseparable. Jules goes home to Austria to marry Catherine but war breaks out a few days later and both men are called up. After the war, Jim go to visit Jules and Catherine who now has a daughter named Sabine. Their relationship is troubled. Catherine and Jim start their own relationship and the three friends stay together. But the stability doesn't last. Director François Truffaut brings a complicated personal relationship. These are compelling characters especially Catherine. Actually I think the one big mistake is to leave her out of the title. These interconnected doomed relationships are beautiful.",
            "review_date": "2015-06-29",
            "lang": "en"
        },
        {
            "review_title": "Jules And Jim - A Social Protest Against Marriage !!!",
            "content": "I interpret Jules And Jim (1962) as a social protest film against the traditional notions of marriage & heterosexual love. Many of the reviews on this site focus on the triangle of Jules, Jim, & Catherine. But there are other notable characters in the film such as Gilberte, Therese, & Albert. Together, all the characters portray a vision where the traditional conception of marriage & the nuclear family is missing but also portray a vision where traditional marriage & the nuclear family seem even unnecessary.From this perspective, this 1962 film must have been radical and quite discomforting for the French audiences of that era. True enough, European cinema in general & French cinema in particular has always acknowledged extramarital affairs in a matter of fact sort of way. But in other films, extramarital affairs are portrayed as being very discrete & rather secret, secret even from the marital partner being \"betrayed\". But extramarital sex & non-marital sex in J&J is just wide open & out there for everyone to see.Gilberte, Jim's live in lover is a case in point. She consistently expresses her love to Jim, tells him that she wants to get married to him & have kids with him. Yet, she seems perfectly OK with Jim running off to Catherine time & again. She just \"understands\".Albert, the artist who introduced Catherine to J&J also seems to have no problem sharing Catherine sexually with J&J.Therese spends the night with Jules at the beginning of the film & then just dumps both J&J at a café the next day seemingly in search of another tryst. When Therese encounters Jim again late in the film, she relates a sordid but adventurous tale involving several sex partners.The closest thing to a normal nuclear family in this film is Catherine, Jules, & Sabine, but Jules expresses doubts to Jim that Sabine is even really his daughter & after having Sabine, Jules & Catherine sleep in different rooms, & Jules freely admits to Jim that Catherine has had several affairs.Overall, this film seems to make the case that marriage & the nuclear family are superfluous ideas that are mere social conventions. True enough, the characters in this film are artist//writer types, intellectuals who are expected to be offbeat & eccentric to some degree, but, on the other hand, the conventional nuclear family & the conventional idea of a committed heterosexual love are not only missing in this film but we are given the impression that these social conventions are not even necessary.From this perspective, J&J is definitely a radical, ant-Establishment protest film. Although it is set in the past, this film portends a future into which society will evolve.Most prominent in this futuristic vision is the absence of male possessiveness of his female sex partner, that is, the absence of jealousy. This can be most clearly seen between J&J themselves as they both \"share\" Catherine to varying degrees. But female jealousy is also absent in this film too. The total lack of a stable family structure & the lack of jealousy by both sexes portrays an almost anarchist reality where love & sex & having children is a joyful free-for-all.The wild card in this anarchist sexual utopia is Catherine. In my opinion, the character Catherine is a mentally unstable, if not a downright mentally ill person. She definitely displays symptoms of erotomania & psychopathy. The degree that she craves new sexual partners is just not normal, even by anarchist, \"free love\" standards. Moreover, she is a psychopath that craves to manipulate others, especially men. The \"magnetism\" that J&J & Albert &, probably all of her other lovers feel toward her is really the slick, covert, manipulative psychopath at work. It is difficult to discern whether she craves sex more than the manipulative power that her sexual allure has over men.This is where the tragic death of Jim enters the picture. At the end, he breaks free of Catherine's psychopathic manipulation & when Catherine realizes that her manipulative power over Jim has disappeared, she attempts to reassert her manipulative power by locking the door of the bedroom & pulling a gun on Jim. You'd think that, at that point, Jim would've finally seen Catherine for the crazy person she is, but by the tragic end of the film he allows Catherine to manipulate him one last time when he gets into a car alone with her, the woman who almost killed him with a gun, & drives away with her to their death. In the end, Catherine did not allow the one man who broke away from her psychopathic manipulation to get away scot free, even if it meant ending her life too.Truly, Catherine deserves a prominent position in the \"Cinema Hall Of Fame For Sick Characters\".",
            "review_date": "2015-05-18",
            "lang": "en"
        },
        {
            "review_title": "\"...but it was not allowed...\"",
            "content": "JULES AND JIM is a romantic drama about a transience, love, friendship, patience and perversions.A bit shy writer from Austria forges a friendship with an extroverted Frenchman. They share an interest in the world of the arts and the Bohemian lifestyle. Once they meet a free-spirited and capricious girl, who has reminded them on a serene smile of an ancient statue of a goddess. The three hang out together. The two friends fall in love with her and her attitudes toward life. She gets, a few days before the Great War, married to a young writer from Austria. Both men serve during the war, on opposing sides. After the war, the Frenchman visit his friends, who now have a daughter, in their home. Their marriage is in crisis...Mr. Truffaut has presented a complex and enigmatic love triangle in a rather confusing way. A tendency toward unusual ideals and the perfect woman, through a free love making, ends tragically. Here, we need to distinguish between a rebellious nature of one of the protagonists and ideals of free love. This film becomes a charming and exciting through a subjective view of love and friendship.An authentic scenery is pretty amazing. Characterization is great, because, among other things, it is difficult to draw the line between positive and negative character.Jeanne Moreau as Catherine is a beautiful, attractive, intelligent and seductive woman. Her stubbornness, extreme expressions and femininity, despite some shortcomings, satisfy both male character in this film. She, like \"whirlwind\", changes life around her.Oskar Werner (Jules) and Henri Serre (Jim) are typical for the protagonists of the French New Wave. The two young intellectual who does not know what they want. Jules is intelligent and thoughtful, Jim is melancholic and vivid. Their shared passion for writing, books, travels and women becomes part of a compromise, which their beloved woman begins to conduct.This is a very appealing film with themes that have always been exciting and topical.",
            "review_date": "2017-05-26",
            "lang": "en"
        },
        {
            "review_title": "not for everyone",
            "content": "This is not a review but just to say this film is not to everyone's taste, as seems to be attested by a quick glance at the user reviews. Cinematically it is a powerful, adept, breathless picture but the narrative and the characters depicted may exasperate and depress. Of course there is much that is true and wise about the cycles of despair these characters enter into, in the same way that there is much truth and wisdom in Lars Von Trier's \"Breaking The Waves\", say. But even so, for this viewer at least, it's an especially depressing film because the passion and control of the 'film making', its vigour, seems counter to the characters' dispiriting stasis and inertia. Visually and aurally the film is lively, optimistic and generous, yet the characters are actually revealed to be dead, pessimistic and selfish.",
            "review_date": "2011-05-01",
            "lang": "en"
        },
        {
            "review_title": "\"Happiness isn't easy to record and wears out without anyone noticing.\"",
            "content": "I'd heard of this film over the years with an element of genius assigned to it, but as I viewed it the other day I was genuinely underwhelmed. The principal characters simply don't strike me as real people. They exist with virtually no reaction to situations that would make ordinary people respond with emotions ranging from jealousy and insecurity to outright rage and hatred. In fact, at the picture's finale I began wondering whether there was an element of mental illness in the character of Catherine (Jeanne Moreau). It's one thing to be driven to suicide by severe depression, but that didn't seem to be a factor in Catherine's make up. And if she wanted to kill herself on a whim, why commit murder at the same time by taking her lover Jim (Henri Serre) with her? It's not like he had a voice in the decision.Leading up to that, the whole relationship among the principals seemed rather surreal. Drawn into an affair with Catherine long after he had been best friends with Jules (Oskar Werner), Jim himself seems to have a directionless life following the Great War. He's about ready to propose to his girlfriend Gilberte (Vanna Urbino) and instead is drawn into an unsatisfying relationship with Catherine, who makes no secret of having regular dalliances with other men as well. For her part Catherine leaves Jules for a period of six months, and he's left to care for himself and their young daughter in the interim.Am I missing something here? 'Normal' people don't live this way, but then again, normal may have been redefined over the past four decades since this film came out. But there was just no warming up to these characters as the film progressed and it left me with just a perverse reaction when it was all over. I would try again, but my instincts are usually correct the first time.",
            "review_date": "2015-02-28",
            "lang": "en"
        },
        {
            "review_title": "The great love triangle or egotistical abuse?",
            "content": "Tonight I finally watched Jules and Jim again for the first time in many years, and it made me angry. I'm not sure why, but there's something about the romanticization of inconstancy that I find disturbing. Jeanne Moreau is, of course, riveting, mostly, and the film is beautifully made. It's just that I can't shake the feeling that what is being portrayed as a great force of nature \u0096 the essence of Moreau's character as \"une vrai femme\" -- is really a powerful but unsteady egotism, enormous grace and charm coupled with an inability to conceive of the reality of other people, or at least to share in mutual reality. In its place there is the lightning of desire in an oversimplified context of defiance against hypocrisy. There is something false about the whole business, as if the movie wants to celebrate the (ostensible) freedom of la belle Catherine and to do so it must attribute the human damage she causes to some grand sort of fate, not ordinary consequence, and the failure and the damage is made to seem mysteriously inevitable. Worse yet, by identifying her as an elemental power and attributing this to her absolute femininity, the film is misogynistic. That is, it implies that the ultimate nature of woman is beyond reason, beyond morality.And yet Truffaut does it all so beautifully that it seems to undercut the negative part, the pain and waste of what happens to people. Still, smiling cruelty is cruelty. Sorry for ranting. I wanted to like the movie, and I did to a large extent, but it bothered me, too.",
            "review_date": "2006-03-05",
            "lang": "en"
        },
        {
            "review_title": "Technical goof",
            "content": "When a man saws wood and passes the pieces to Sabine, he saws from the free end of the sawhorse. As Sabine walks away with her arms full of wood, the man takes the saw and continues sawing, but between the arms of the sawhorse. Out of shot, the sound of sawing continues. In practice, attempting to saw wood in that fashion would swiftly lead to the saw jamming. Undoubtedly, there would have been an expletive! I saw this film when first released, so was interested to see this new print. I had been a fan of Raoul Couthard, the cinematographer who trained by running backwards, and some of his work is truly amazing. Here, there is one shot done running backwards, but much of his camera work is less than competent.",
            "review_date": "2008-04-12",
            "lang": "en"
        },
        {
            "review_title": "A wondrous evocation of \"La Belle Epoque\".",
            "content": "A wondrous evocation of \"La Belle Epoque\".M.Truffaut was a creator of pure cinema, a man who made films because he loved them and because he could make great ones.\"Jules et Jim\" was made 42 years ago,and is a fragile thing - like a gossamer veil.If,to understand it,one feels the need to pick it apart it is rather like destroying a butterfly to see how it works. It is not flawless,all the characters are themselves flawed in some way,but it is a film full of love for humanity with all its willfulness and caprice. A famous poet of the era said \"A cynic is a man who knows the price of everything and the value of nothing\".\"Jules et Jim \" is not a film for cynics.Like a first love it is never forgotten and,like love, I truly envy anyone coming upon it for the first time.",
            "review_date": "2006-10-29",
            "lang": "en"
        },
        {
            "review_title": "Left me Cold",
            "content": "The characters seemed incredibly stupid and two dimensional.  The cinematography seemed amateurish at times.  The movie was depressing, without any sort of redeeming virtue, as far as I could tell.",
            "review_date": "1999-10-04",
            "lang": "en"
        },
        {
            "review_title": "Goes on a bit",
            "content": "For some reason I was impressed when I saw this in 1962. But no longer. Difficult to remember what impressed me. I just recall thinking for the last 50 years: Ah, Yes: Jules and Jim. Good film. I don't think so any more, having just seen it again, but it must have something. Perhaps it's the atmosphere, or the way the relationships unroll, or the way it's shot. The little girl is cute, but she disappears well before the end. What happened to her ? I do think Jeanne Moreau is physically quite attractive, but I understand it if a number of people don't agree. Her character is exceptionally selfish, spreading unhappiness, and spoiling other people's lives. Not to say actually taking them. This is a gloomy, dispiriting film. I certainly wouldn't call it an exhilarating experience, like Philip French seems to thinkIt's a mystery, but it no longer seems to be worth solving. Just depressing. Frankly, a struggle to get through.",
            "review_date": "2016-10-18",
            "lang": "en"
        },
        {
            "review_title": "probably not for most people unless you really like french/art films",
            "content": "hi everyone,I watched this film as it was in the top 100 romantic films in a list produced by the Guardian. i had previously watched 'Umbrellas of Cherbourg' from the same list and could see why the film was there (though if you see that film, be warned every word is sung). This film however was a different kettle of fish, i watched it with my better half, and as the film went on, your heart sank, as you realised you began to desperately hope for the end of the film to come. If you like good characterisation, a story line that is psychologically meaningful then this film is not for you. Yes i can see its poetic, artistic, there is a stream of consciousness about it, but i feel for most people and definitely for me its a 'no'. Its not a classic, its not romantic, it doesn't have great meaning, the characters act on a whim, the main 'lead woman' should be sectioned, and why the two men put up with her, is beyond me (god help her poor child).",
            "review_date": "2011-05-15",
            "lang": "en"
        },
        {
            "review_title": "Jules, Jim, and Catherine",
            "content": "A menage a trois is the subject of Francois Truffaut \"Jules and Jim\" (1962) and it tells the story of two close friends, the German Jules and the Frenchman Jim that both fall in love with Catherine. Jules marries her and takes her to Germany. When the friends meet again after the WWI is over, Catherine decides to change partners...I am in love with Truffaut's directing, with his camera movements, with the feel, fragrance, and the atmosphere of France and Paris in the beginning of 20th century, with the music and the song \"le Tourbillon\" that Catherine sings and with Jeanne Moreau who brought so much life, charm, and yes craziness to her unforgettable and free-spirited character. What a wonderful and elegiac poem of love, freedom, and alas disappointments. \"Jules and Jim\" is a dream come true for Truffaut who had wanted to adapt the novel of Henri-Pierre Roche since he read it first in 1953 and it is joy to watch.",
            "review_date": "2006-04-08",
            "lang": "en"
        },
        {
            "review_title": "oooooh wow, it's truffaut. how exciting!!!",
            "content": "of course i knew before going into this movie that it was going to suck. i mean, since when have french new wave films been anything more than useless camera tricks trying to cover up a terrible and incoherent story? i am so sick of people treating these french new wave guys as if they were gods. there's more to film-making than long takes and spastic editing. the most important thing obviously being the ability to tell a story. which is apparently a feat too complicated for these people to understand.enough with my diatribe about french new wave in general, let me talk about this particular garbage. for starters, i have to discuss the crazy gay undertones that dominate our introduction of jules and jim. i mean, i know they're good friends and all, but what is up with their excitement to take a shower together? and their slap fighting later on at the beach? not that there's anything wrong with that. but i just thought it was weird and completely pointless to have in the movie, especially considering the fact that we're supposed to believe that they're in love with this woman later. While the whole movie is a mess, i'll just go right to the end. how many times does it take for someone to realize that a person doesn't love you? the characters were so unrealistic and completely ridiculous in their attempts to leave each other and them come back, and then leave and come back, and leave once again....only to come back. END THE MOVIE ALREADY!!! i feel like i can't mention the whole coming back thing without speaking of when jim comes back and catherine pulls out a gun and tries to shoot him. wow, this scene has all the grace and tension of a Uwe Boll movie. i guess now we know where he got his inspiration from. and then he grabs the gun and jumps out the window?!?!?!?!? wtf? OK, i'll admit that was dumb but the fact that he goes back and meets with her again as if nothing happened? word? is that what guys in France did back then? not to mention that he later gets in the car with her to go for a drive. when there's obviously only one place for the car to go.......especially once you realize they're on a half-mile long road with a broken bridge, while they're driving at a whopping 10mph. which leads to the car going off the bridge and into the water. at least that part was funny. if i ever have to decide between watching this movie (or any other french new waves for that matter) or having my eyes removed with a dull razor......well, i just hope that i'll get a good seeing eye dog. that's it, i'm done.",
            "review_date": "2005-09-08",
            "lang": "en"
        },
        {
            "review_title": "Problematic, But Worth Your Time",
            "content": "Jules et Jim is a difficult film, there's no question about that.  I'd say the only thing that kept me watching was my love of Truffaut \u0096 his ingenuity in cinematography, dialogue and just the whole tone of the film.  That he could keep such melodramatic (if not drab) stuff somewhat entertaining is a testament to his mastery of the medium.  I loved the blending of historical film into the narrative; I don't know if he was the first person to do this \u0096 I highly doubt it \u0096 but he certainly did it well in this picture. \nJules et Jim is a study of capriciousness.  Catherine \u0096 a woman to whom monogamy seems like a foreign concept \u0096 is, to paraphrase the film, `not particularly intelligent, beautiful or kind, but she's treated like a queen.'  Why Jules and Jim love her so, I don't know.  They seem like strong enough characters to be without such a difficult woman, but I guess that question is at the center of the film.  For some reason, Jules et Jim reminded me of L'Avventura by Antonioni \u0096 maybe because it was also a hard movie to enter and because the characters were so inaccessible.  There are certainly elements of the neo-realism in this film, (one need look no further than the extensive use of mist and the forest scenes that closely resemble the dream sequences of Fellini, De Sica, et. al.) Overall, I would say this picture is worthwhile, although there are certainly better, more accessible and mature Truffaut films out there.",
            "review_date": "2004-08-17",
            "lang": "en"
        },
        {
            "review_title": "A well-made film for sure, although the subject matter is surprisingly light",
            "content": "As a Francois Truffaut film, I enjoyed JULES ET JIM somewhat less than some of the director's other work, such as THE 400 BLOWS. That's because the light and breezy love triangle plot material is less appealing to me, and the storyline subsequently feels dragged out to the nth degree as a result. It's a pity that I couldn't get to grips with the subject matter as much as I wanted to, as this is certainly a well-directed piece of cinema, with a script bringing plenty of character depth to the central roles and Oskar Werner in particular giving a solid, laconic performance.",
            "review_date": "2017-05-16",
            "lang": "en"
        },
        {
            "review_title": "\"She was my young mother and loving daughter at the same time.\"",
            "content": "After spending April watching 30 Czech films from the Cold War era,I decided that for the next 100 days I would watch 100 French films.With April coming to the end,I started searching round for the Criterion edition of Jules & Jim,but I soon realised that I had forgotten where I've put the disc! Franticly looking round,I was happy to discover that Artificial Eye have also put a DVD version of the title out,which luckily gave me the chance to meet Jules and Jim.The plot-1912:France:Being on his own after moving from Austria to France, Jules is delighted to meet Jim,who shares Jules bohemian outlook on life.Spending time with each other,Jules and Jim begin to bond over the arts and poetry. Taking things only to a \"no-strings\" level with women,Jim and Jules both cross paths with a mysterious girl called Catherine,who they both fall in love with. Aware of their shared love for Catherine,Julies and Jim try to keep their friendship alive,as WWI breaks out. View on the film:Warmly welcoming Jules & Jim, Artificial Eye give the title a sharp transfer,which smoothly catches the lightning shots,and also keeps the dialogue crisp. Breezing in from Marie Dubois's wonderful mile a minute performance as Thérèse,the gorgeous Jeanne Moreau gives a marvellous performance as Catherine. Entwining Jules and Jim with a magnetic smile, Moreau strikes a precise balance of keeping Catherine's alluring charms alight whilst making her frivolous outlook more brittle.Working in Comedy clubs when he was cast, Henri Serre gives a superb performance as Jim.Swaggering around the opening brimming with confidence, Serre vividly peels away Jim's charisma to reveal a sincere friendship with Jules,and an inability to look away from the flames of his love for Catherine.Enter as an outsider, Oskar Werner gives a great performance as Jules,whose nervous stance tightens the bond of friendship he has with Jim,and also pulls Jules to the care- free grin of Catherine.Spanning the WWI period,co-writer/(along with Jean Gruault) director François Truffaut adaptation of Henri-Pierre Roché's novel places the passage of time firmly on the shoulders of the trio,with their care-free and bohemian outlooks struggling to survive the abrasive twists and turns that Catherine grinds Jim and Jules friendship with.Whilst there are some large areas of plot that get brushed away, (does no one care about the kid?!) Gruault and Truffaut treat the friendship between Jules and Jim with a brilliant level of care and affection,as Jules and Jim try to find ways to keep their connection,despite being well aware that they share a love for the same girl.Rolling out on a very low budget, (Moreau had to help fund the completion of production)director Truffaut and cinematographer Raoul Coutard roll out the friendship between Jules,Jim and Catherine in a dazzling,ultra-stylised shine. Soaking the screen in pure French New Wave with freeze frames and \"masking\", Truffaut elegantly explores the various stages of Jules and Jim's friendship,as the initial excitement around each other sets off whip-smart panning shots and slick screen wipes,which transforms into smoothly-hit tracking shots and ghostly overlapping images,as Jules,Jims and Catherine's friendship reaches breaking point.",
            "review_date": "2016-05-01",
            "lang": "en"
        },
        {
            "review_title": "\"Happiness can't be told, but it wears off without anyone noticing it.\"",
            "content": "I'm not sure whether this is a most unconventional character study of a most unique psycho character, a cautionary tale about unrestrained, uncontrolled and boundless love, or just a story about a love triangle concerning two friends and an impulsive woman, as IMDb's plot summary says. But what I'm sure of is that this is one of the most extraordinarily original, and powerful films I've ever seen!The ending is just as, if not more, shocking and devastating as The 400 Blows'!The way Truffaut used War to switch the movie from a most charming, joyous and cheerful thing I've seen only before in Chaplin's silent comedies to a painful look at relentlessly whirling, troubled relationships is simply unprecedented and unsurpassable!Also, I can't believe that I hated Catherine more than I hated Amy Dunne! But as for Jeanne Moreau, she probably became one of my favorite actress ever after I've seen her prodigious acting abilities in The 400 Blows, La Notte and now in this movie.If only the movie was a bit shorter, and the pacing was a little faster....(9/10)",
            "review_date": "2019-04-17",
            "lang": "en"
        },
        {
            "review_title": "Wow!",
            "content": "This is the first film I've seen by Truffaut, and it's like nothing I've seen before. The deftness with which he captures both the absurdity and the gravity of the evanescent moment takes your breath away. Here the camera swerves to give you a glimpse of a black car, and you understand that it is an omen of death; there we see the lovers bicycling on a country lane, and as you catch sight of the back of the woman's head, you understand that in this moment of delighted freedom, the man's longing for her is eternal. The use of music, light and lilting, is magically apt, always with the feeling of a half-remembered tune from another time in your life. The film sets out as a comedy, and later the heartache is more piercing for being shot through with sweetness and light. In hindsight, maybe all those buddy movies from the sixties and seventies, movies like Butch Cassidy and the Sundance Kid, owed something to this film, but they never began to match its effortless delicacy and style and depth. In an interview on the Criterion DVD Truffaut's cinematographer, Raoul Coutard, quotes a saying the French apparently have that \"the silence after Mozart is still Mozart\". The comparison is apt.",
            "review_date": "2006-12-12",
            "lang": "en"
        },
        {
            "review_title": "One of the most beautiful foreign films ever",
            "content": "Francois Truffaut proves his great film-making abilities and great story telling with this film.  Film shows three people in a relationship that changes through the years like wine.  Beautiful romance and drama make this a must see for movie buffs or for a date (forget the new ones if your looking for classics).  Based on a novel by Henri Pierre Roche. A+",
            "review_date": "2000-07-03",
            "lang": "en"
        },
        {
            "review_title": "Free Love without Restrictions or Restrictive Love without Freedom",
            "content": "François Truffaut was a true romantic of the French New Wave and just as Rohmer's, so are Truffaut's films easily accessible, compared to the experimental works of Resnais, Godard and Rivette. He was never into making opaque, ambiguous films but multidimensional and romantic stories about love and freedom, loneliness and intimacy, life and death. Jules et Jim was his third feature-length picture and it was based on a semi-autobiographical novel by Henri-Pierre Roché which truly fascinated Truffaut. He thought that if he once made a film, it would be an adaption of Jules et Jim. From an unknown novel a mighty piece of cinema was born. A film which broke a lot of taboos in the 1960's, and is still one of the most beloved films of the Nouvelle Vague.The characters, Jules and Jim complete each other, as the film suggests by comparing them to Don Quijote and Sancho Panza. One day they become acquainted with Catherine, a goddess to whom both of them fall in love. Time goes by and Catherine gets married with Jules. They get a daughter, Sabine but the war separates them. After the war, Jules returns to his home and Jim pays a visit after a long while. Catherine and Jim fall in love with each other, and decide to lead a life together. However, there is a third man as well, Albert who is also adored by Catherine. Catherine is unable to choose between these three men and wants them all, at the same time, neglecting the codes of bourgeois behavior.The story happens in the years from 1912 to 1933, and as a historical film it is also a description of the time it was made in, the early 1960's: The Cuban Missile Crisis, French generals wanted to overthrow the president Charles De Gaulle, John F. Kennedy was elected as the president of the United States and The Berlin Wall was built. During the time there were a lot of protests against The Algerian War which several new wave directors attended as well. It was also the time of sexual liberalization: the position of woman was rising as they went to work, birth-control pill was allowed and several illegal abortions were committed; until it was finally passed. To this period of transition Truffaut's film Jules et Jim fits perfectly.Catherine represents a woman, an adored manifestation, created for all men. She's a mythical character who is hard to get. She's a timeless concept which even flashes on Albert's photograph of the statue's face. Catherine is completely aware of her divinity and therefore she acts like it: she takes full responsibility for it, and feels that she needs to have control over every single situation. She doesn't settle for partial faithfulness, except on her own behalf. Catherine refuses to choose between the three men: she wants them all, at the same time, and for Truffaut this kind of dogmatism is the straight road to death and desperation.Eventually, Jim starts to understand Catherine which she doesn't like at all. She doesn't want to be completely understood. So she takes Jim into an unending relationship which is final and absolute; she drives a car with Jim to the sea, from a broken bridge. The character of Catherine represents the liberated woman of the 1960's and, all over Europe, cinema loved these kind of women: in Sweden, Italy and France, for example, and Jules et Jim is a picture of this time and a portrayal of the new youth. However, Truffaut's treatment of taboos is anything but conventional or regular. He hated revealing sexuality in films and loved the Hitchcockian way: showing an approaching hand, a bare leg and using elliptical narrative. He never wanted to shock people, but his own ideology on the screen just happened to stir up conversation.The two nations, Germany and France, have fought three times in recent history: once in the late 19th century and twice in the early 20th century. There was an unending hatred between these two nations -- and this is what is so shocking about Jules et Jim: it portrays a Frenchman and a German who are best friends. They are men who don't care about borders, countries, restrictions or wars, all of which are just part of the great illusion. From one perspective this can be tied to the time the film was made in: in the 1960's the two nations found each other, the new generation was eager to live in harmony and not to remember the inconveniences of the past. But, on the other hand, Truffaut's ideological touch can be seen in the story as well. He was an anarchist, though not an activist; he hated activism. He most likely took a lot of thoughts from his cinematographic idol, Jean Renoir whose films are strongly pacifistic and anarchist. But François Truffaut said that he only wanted to tell the story of the love between three people.The freedom of the men, portrayed in the novel, was astonishing even in the 1950's. It's a story about a woman who wants to be in a relationship without restrictions. Catherine is afraid of restricted love and when she gets married with Jules, she hopes to free herself by giving birth to Jules' child. But each time she finds herself in a dead end; and only death can set her free, which is why she kills herself and Jim. One thesis of the film is that there is no use trying to fight these restrictions of love, because love itself is restricting and captivating. This paradox of love and freedom characterizes the entire film. How love and freedom can never fit into the same relation because love is a ruthless, proprietorial thing. It doesn't let us be free or equal but without it, life isn't simply anything.",
            "review_date": "2011-05-16",
            "lang": "en"
        },
        {
            "review_title": "The fundamental ambiguity of life",
            "content": "Do you like some musical moments in the movies? Because if you do, you posses the royal keys to the cinematographic joy and gusto. I could think of at least four: --the Chechens' song in DOM DURAKOV; --Mme. Moreau's song in JULES \u0085; --the glasses concerto in E LA NAVE VA \u0085; --the Fascist anthem in DIVINA CREATURA, in counterpoint with Stamp's debacle.At Fellini, several musicians set a concerto in the ship's kitchen; and it's an expression of undiluted Daseinsfreude. Where history likely touches eternity by way of cognition.In Truffaut's masterpiece, the song is an undiluted expression of ineffable joy; a popular song, that opens up the content of the whole movie. It divides the movie in two, and it concomitantly strengthens the unity of the whole; JULES \u0085 is a masterpiece of ineffable lightness and sadness.JULES ET JIM is a wonderfully inspired movie; and, like IL BIDONE, it really begins at the middle of the footage, at half, because the 1st half is more or less a fluffy pastiche of period comedy, playful and funny, needed to prepare the amazing second half, to whom it is so obviously inferior. The result is worthy of the supreme lightness—Renoir certainly, perhaps also THE AMBERSONS and a Bergman comedy \u0085.",
            "review_date": "2009-07-29",
            "lang": "en"
        },
        {
            "review_title": "One of Truffaut's Masterpieces",
            "content": "No, they don't make them like they used to - by that I mean visually stunning, romantic, emotional dramas like this one. It is one of Truffaut's masterpieces - a fascinating and moving period piece. The story focuses on two close friends, a Frenchman and a German, who meet in Paris not long before World War I. Jim is a suave bon vivant and Jules is more sensitive and quiet. Both appear to be writers. Over a period of time, they both fall in love with the same woman - the mercurial, moody, essentially female Catherine (embodied perfectly by Moreau.) After the war, they see each other again, and the psychodrama begins to escalate. Truffaut must have had some money to make this, since it has a charming, prewar look to it, with great costumes and locations. There is a bit of distance, and comic touches in this, which was intentional. Truffaut said he wanted the film to look like an old photo album - and it does. The story behind the story is fascinating as well - Criterion includes some info on this in the DVD. Apparently Truffaut discovered the little-known novel the book is based on at a used book shop along the Seine, and decided to film it, much to author's delight. It was the first novel by a 73 year-old art collector, and it was based on incidents in his life.",
            "review_date": "2018-09-28",
            "lang": "en"
        },
        {
            "review_title": "Nostalgia for silent films abounds, but still worth a watch",
            "content": "Jules and Jim Although lumped in with the New Wave group of films (\"The 400 Blows,\" \"Breathless,\" et al) of the early 1960s, \"Jules and Jim\" shares few of their characteristics. François Truffaut—considered the \"grandfather\" of the French cinema movement la nouvelle vague—once again looks to his childhood. But the result is less nostalgic and much more lyrical and moody than \"400 Blows,\" about a naughty Parisian school boy and the system that represses his childish impulses.The film is set in bohemian France just before the breakout of the Great War. Two men meet by accident, and become best friends. As the title of the movie suggests, Jules (a sandy-haired German) and Jim (a dark-haired Frenchman) are inseparable: they box each other à la française and go to cramped corner cafés the likes of which are sought-after in Paris. For students of French literature, the plot resembles the story of Pierre et Jean, the two brothers of a petite bourgeoise family who get into trouble when a woman enters their lives. Enter Catherine (once again, by accident). She runs into the two as they walk down a street late one night. Jules becomes infatuated with her almost at once. He loves in particular her calm visage (which reminds him of an ancient stone sculpture he found on an island excursion with Jim after seeing a slideshow).Catherine, it turns out, is more of an adventurous bohemian than Jules or Jim. In one lovely scene, the trio arrive at the end of an overpass. Catherine challenges them to a race dressed as a boy, and takes off before Jim has given the commands. The course à pied evokes not so much frivolity, but a certain carefree, bohemian demeanor that soon thereafter went into hibernation in capitals across Europe. The expansive camera work does not seem cramped despite the claustrophobic space, and demonstrates the skill, even ingenuity, of New Wave directors such as Truffaut. But Catherine tires of Paris, and desires to take an overnight trip to Provence.To achieve historic authenticity (whatever that may be), Truffaut employed stock footage of Paris from that period. Although grainy (though much cleaned up and improved by the Criterion remastering), the clips do almost serve as sketches of inspiration for Truffaut. Moreover, one can almost perceive Truffaut shaking his head over the Dark Ages of film-making. But they do provide context (at the expense of seeming somewhat out of place and jarring).Other elements work more cohesively. The sound—per the New Wave standard of excellence—is first-rate. The fanfare is sweeping and doesn't upstage either the acting or camera work.But Catherine is the more complicated and troubled of the characters. One night out, reminiscent of their first meeting, Jules goes off and quotes an uncouth Baudelaire verse, which upsets Catherine. Distraught and hopeless, she tosses herself into the Seine. Her fedora floats away, but Jules and Jim manage to pull her from the water. Death is a constant specter in this film, and her attempt (if not attention-getting act) marks an evolution in the mood of the film.Jules and Jim spend much of the time in the film together, but when the First World War breaks out, they become soldiers in opposing armies. Jules writes a letter to Catherine (who has since become his wife) that he worries constantly that he will \"kill his friend Jim.\" This sentiment only underscores the psychological trauma of the \"lost generation.\" He writes more letters home. Eventually, Jules is positioned on the Eastern Front, where the fighting is worse and the weather colder, but he finds new hope in knowing that he won't inadvertently shoot Jim. Truffaut dabbles in the stock footage again here. This time, it is excellent—and serves a useful purpose: i.e., keeping the film budget low by eliminating battle scenes. The shots are gritty, and more importantly non-fictive.The war ends, and both Jules and Jim count themselves among the survivors. Jules survived the war, but he isn't the same. He has relocated the family to the bucolic foothills of Austria. No longer youthful and energetic, he has discovered a new passion: tending his garden. When Jim visits, the two seem older, more rooted. Catherine is in the inscrutable words of Jim \"less grasshopper, more ant.\" She makes less music, and she works more to keep the household intact and functioning. Jules and Catherine have had a baby, a stark change from their pre-war days. Their daughter is a larger theme: she is joy and hope for the future, but also a tie-down, who is conspicuously absent in the last act.Though it is called Jules and Jim, the film is really about the whims and emotional states of its heroine Catherine. Catherine feels isolated living in Germany. She longs for a different life—her former one in France. She is not entirely domesticated, but she has clearly lost some of her youthful air. She is married to Jules, but toward the end she professes her love for Jim. This ménange à trois is a central element of the film. Only when the three are united does some sort harmony and balance dominate. But Catherine is the pivot of this trio, and its soul.My only gripe with the film is its length. It could be ten, maybe fifteen minutes slimmer. But when a gifted director like Truffaut is telling the story, perhaps too long is never enough.",
            "review_date": "2009-04-15",
            "lang": "en"
        },
        {
            "review_title": "Le tourbillon de la vie",
            "content": "This is the greatest film about life. Jeanne Moreau plays the role of a woman that wants to live but can't fit herself in this world, in the normal forms of relationships. Between Jules and Jim she founds something that calms her down a little. The masterpiece of Truffaut, Jules and Jim was made over the book from Henri-Pierre Roche, who also wrote \"deux anglaises et le continent\", the book that Truffaut also filmed later. The incredible capacity of Henri-Pierre Roche of talking about life in such a accessible way was perfectly recreated by Truffaut, who arrived to make even a greater thing then the writer. This is one of those movies to see over and over. Specially the great scene where Catherine sings Tourbillon de la vie, which fits perfectly. A film about meetings, losings, and finally about the difficulties of finding yourself. It's the most beautiful and simple way of describing le tourbillon de la vie.",
            "review_date": "2008-11-24",
            "lang": "en"
        },
        {
            "review_title": "Jules et Jim",
            "content": "I knew the title well, because I knew it was a French film, and I saw it featured in the book 1001 Movies You Must See Before You Die, so I was certainly not going to miss it, from director François Truffaut. Basically, set in Paris, 1912, French superb food and drink loving Jim (Henri Serre) meets Austrian insecure writer Jules (Oskar Werner) and the form a good close friendship, and they also meet and become friends with beautiful, casually changing and independent Catherine (BAFTA nominated Jeanne Moreau). Both men fall instantly in love with her, but it is the nervousness and fragile nature of Jules that attracts her, and they get married and have a child. Then the First World War begins, and the friends are separated and forced to fight against each other, as they are opposite sides, and when they return they live in Jules's cottage in Germany. The three companions and Catherine's daughter Sabine (Sabine Haudepin) stay together, and Jules tells Jim that his wife has had various affairs with many lovers. After this Catherine falls in love with Jim and they begin a real relationship, Jules seems perfectly fine with this and allows them to stay living in the cottage. The love triangle never affects the friendship or respect between the three companions over the passing years, but the end of the film we do see Catherine and Jim get in a car together and drive off a bridge to drown in the river, Jules is left to scatter their ashes. Also starring Marie Dubois as Thérèse, Vanna Urbino as Gilberte and Boris Bassiak as Albert, with narration by Michel Subor. The three leading actors, particularly the endearing Moreau, do well, and when I could keep up the story is charming, and also the film is filled with great editing techniques, e.g. freeze frames, photographs and distorted imagery, so I can agree it is a great drama. It was nominated the BAFTA for Best Film from any Source. Very good!",
            "review_date": "2011-09-17",
            "lang": "en"
        },
        {
            "review_title": "It's very French",
            "content": "At the risk of over-generalizing about an entire nation, I've come to the inescapable conclusion that the French are a very strange people, to say the least. Seriously...they don't seem to find anything offensive (I think they'd find some rationalization for having sex with chimpanzees), and they seem to find everything interesting -- even one of the most boring films in cinematic history -- Jules & Jim.The one thing this film has going for it is this: I've never seen a film in which every single character suffers from an incurable mental disease. But if I want to see such extreme mental illness, I'll go visit a local state mental hospital. This film is NOT about LOVE -- it's about raging mental illness. That's what people who claim to \"get it\" really DON'T get. They're as delusional as the characters in this train wreck of a film if they honestly believe this movie is a great love story.",
            "review_date": "2012-05-16",
            "lang": "en"
        },
        {
            "review_title": "Influential New Wave movie, although I didn't relate to it very much",
            "content": "Jules et Jim was François Truffaut's most popular film. As such, it is a key film from the French New wave. Set between the years 1912-33, it tells the story of two male kindred spirits, one French and one German, who both fall in love with a free-spirited Parisian woman. They form an unorthodox three-some, with the girl unwilling to choose between the men. All the while, political upheaval causes despair in Europe, including the outbreak of World War I, which results in the two friends going off and fighting on either side of the conflict. Afterwards they return to an uneasier ménage à trois which is ultimately doomed.In all honesty, I don't really understand why this one is considered such a masterpiece. I suspect that much of its esteem comes from the new things it brought to the table in 1962, some of the subtleties of which are hard to detect nowadays. So context is probably a big part of understanding the significance of this one. I felt it did have a pretty ropey story, with poor characterisation. It did, however, have some dynamic direction from Truffaut, with hand-held cameras giving events an immediacy and care-free feel, while at other times there were distinctive freeze-frames and even elaborate aerial shots. So the film is certainly alive in ways associated with the New Wave, a movement which was all about innovation and imperfections. So maybe the faults in the story have to be forgiven to some extent, as I guess this odd romance was considering things beyond the narrative. A look at the impossibility of idealism, freedom and love existing together in harmony perhaps? The film's standout turn comes from Jeanne Moreau, as the woman who the two rather pathetic men orbit around. Overall, an interesting film but not one I fully connected with.",
            "review_date": "2017-04-13",
            "lang": "en"
        },
        {
            "review_title": "Interesting",
            "content": "I find the narrative of this film slightly off-putting (Catherine is an extraordinarily unlikeable crazy bitch, and her reversals are absurd) but the way it's constructed and great moments within, more than make up for it. It's clearly filmed in the 60s, every time someone opens a light, non-panelled door (which came into being much later) and due to the depiction of the casualness of social interactions. That's a 60s construct. But it doesn't matter; the frisson you can feel between the eras makes this more interesting. As if to say we're not going to try too hard to recreate the early 20th c. because you've got the point after the costumes; and our interest lies elsewhere.The 60s are also evident in the agitated, ropey, fluid camera technique. And a breezy script that carries no concern about breaking into English at one point.I will always consider a movie about friendship deeper and longer, than a movie about romance.Truffaut: I can't imagine what I found disagreeable about this man when I was younger. Every interview with him highlights his polite attentiveness to long questions, followed by his characteristic flow of words. He is personable, honest and grounded in reality. He acknowledges in an objective way that some of his movies are over-rated, some are half-admirable and that some are bad. He also seems unusually kind. I'm sorry he died before his time, but grateful he was rescued from the unexceptional life he might have had. He's a very pleasant genius.",
            "review_date": "2007-03-31",
            "lang": "en"
        },
        {
            "review_title": "Classic of the French New Wave",
            "content": "\"Jules et Jim\" was Truffaut's third feature film, one of his most loved, and possibly his greatest.  Raoul Coutard's mobile camerawork gives it a restless, lyrical quality, and the black-and-white images suggest postcards and family snapshots of a bygone era.  Truffaut presents an idealized form of male and female friendship, in which passionate intellectuals attempt to control their confused feelings and frustrated desires by elegant articulation and literary allusion.  The film contrasts the character's discussions and the narrator's wise certitudes.  Everything centers on Moreau's commanding, destructive heroine, one of the screen's most seductive femme fatales, and through her Truffaut first proposes the major theme of his work - how we confront the attractions, repulsions, and inevitability of death.",
            "review_date": "2000-09-08",
            "lang": "en"
        },
        {
            "review_title": "A confession of failure",
            "content": "-That's me confessing failure, not the director or the characters.  I just couldn't get into this.  I even discovered that I can't get into French films generally - and I discovered why.  It's not all Truffaut's fault. Bear with me: I think I'm onto something that English speakers should be aware of.To begin with a few nice words, `Jules et Jim' LOOKS good.  I think it was the influence of this kind of photography that gave me the idea, as a child, that France was in black and white, so neatly does the medium fit the content.  Truffaut is assured with a camera and can lapse suddenly into unusual technique without it seeming forced.  His technique is particularly impressive on the two or three occasions when he has a real shock to deliver.But there was ONE technique that undermined all the rest: verbal narration. Much of the story is given by the third-person narrator who cuts in every other minute (or so it seems), and more still in the form of since-you-last-saw-us-five-years-ago dialogue.  This would annoy me even if I spoke fluent French.  Since I don't speak French at all, it's ten times worse.  I'm surprised I managed to see the film at all through the subtitles.  And here's the discovery I made: for an English speaker, French is possibly the hardest language in all of Europe to parse.  When an Italian film is set on a pineapple plantation (for instance), I will very quickly pick up the Italian words for pineapple, worker, sun, land, crops, boss, and so on - and after a while I start to hear the characters sort of as if they're speaking in English.  I can't do this with French.  I suspect that most English speakers can't either.  Perhaps this is why I find French such an ugly language to listen to - although I'm aware I'm in a minority here.Whatever we say about language barriers, the narration is a mistake.  The nicest thing about this film is its sweet, touching story about the friendship between Jules and Jim; but thanks in part to the narration we never see it except from a great distance.  We have to squint to make out what's so touching about it.Then there's Catherine.  She gets batted back and forth between the two protagonists so many times that it ceased to matter where she ended up.  And I found it hard not to see deep misogyny - and I really MEAN misogyny, not just sexism - in the way women are treated by the script.  It's not that the central protagonist was a destructive woman no man could be expected to have a good relationship with - it's the suggestion that there's really no other kind of woman going.  I got the feeling that Truffaut believed that Catherine really was the pick of the bunch.I found this film pleasant, breezy, and well made, but no more - and my difficulty with French is part, but only part, of the explanation.",
            "review_date": "1999-09-18",
            "lang": "en"
        },
        {
            "review_title": "Love and friendship could not be better combined in one piece",
            "content": "This was my third movie by Truffaut I saw and enjoyed a great deal. He truly was a genius story-teller. And this time it is about friendship and love, the things that make us feel happy and satisfied with living. One should learn to appreciate them, cherish them, care for them and protect them from fading away. But what is friendship anyway, how do you define it, describe it, measure it and show it? I found one of the best examples in this masterpiece. Two friends always enjoyed the company of each other and never got bored of each other. What is love then? Again another best example of so called true love without being possessive and egoistic, in this case accepting no matter what the choice and attitude of beloved one. Nothing is constant in our lives, it starts, evolves and eventually ends. Anyway, there is something magical about Truffaut's movies.",
            "review_date": "2011-06-25",
            "lang": "en"
        },
        {
            "review_title": "Quintessentially French Polyamory",
            "content": "Truffaut's magical manège et trois. Brilliant cinema, storyline and performances. Happy memories spent watching this film, and seeing friends mesmerised by it. It is happy and liberating; sad and misfortunate. A devastatingly abrupt end makes you want to watch it all over again...",
            "review_date": "2021-11-19",
            "lang": "en"
        },
        {
            "review_title": "Powerful.",
            "content": "Spoilers. Observations. Opinions.Updated Thursday, May 6, 2021.Powerful. Smashing. Elegant. Daring.Saw this before, remembering about two men involved with one woman -- post-World War One. The two men would end up being on opposite sides in the upcoming fighting war. This film was made from a novel written by an older man who reminisced about his youthful escapades in the French Belle Epoque of the Early 20th Century.Daring early 1960s movie-storyline, and yet a pre-World War One based-on-true-life saga. People were \"sinners\" even then, lol, would you believe? Author of this book was one of the characters in the film. This saga is a twist on stereotypes. Manizing woman, not womanizing man, even though the men had \"seen\" other women. This time, her affairs are described. She wants to stay free and easy, untied permanently to anyone. Jeanne Moreau is the star of this film, not the two men. IMO, the two men were just props in her grand plan. She does not give a flying fig what anyone thinks. Maybe the film could have been named \"Diva Gets Even\".She keeps paying the two men back for their selfish transgressions against her, and at the end makes a final payback to both of them. She does not like being ignored, ridiculed or unfairly critiqued. Score one, two and three, but this time it is fatal. You talk about \"femme fatale\". She wrote the outrageous book.Jules -- as dense as ever -- scratches his head at what to make of the whole thing. I don't see any tears, however. He makes sure that the other two in the triangle are sleeping side by side for all eternity. But what about the little girl? We don't see her near or at the end.Teutonic men may not make the greatest lovers. They are known to have an iceberg instead of a heart, and can be very selfish. They can be quite cold and heartless, but French men are well known for making women very \"happy\" in many ways. Paired with a French woman, Jim did better than did Jules. Jules couldn't keep women early on, and before he met Catherine he decided to take up with the pros. Even they didn't want him. He was a dud. Ol' Baby Jules was a big disappointment, IMO.He couldn't even keep Catherine after he married her. She was way too much woman for him. Jim, however, was a self-confident horndog who had no problem attracting tons of eager women -- including his newfound enchantment with Catherine. These women were all after Jim, but he had a nonchalant attitude of love-'em-and-leave-'em / who-needs-'em?.Jeanne Moreau was Grande Dame in 1997's Ever After, in which at the beginning of the film she tells the Grimm Brothers that Cinderella was a real person, and her own great- or-great-great-grandmother. The film shows Drew Barrymore as a new version of Cinderella, kicking butt of a hottie Prince Charming. Leonardo da Vinci appears here, rescuing the future princess.Oskar Werner, IRL, was in the Nazi army of World War Two, although as a pacifist feigning incompetence and wanting KP duty even though his blonde hair made him an ideal Aryan specimen. His real heart lay in theatrical acting, not in fighting on the battlefront. The war had darn-it interrupted his early theatrical career.I am a degreed historian from the university, and take ongoing coursework in historical film critiquing and war studies. I study the lives of actors and actresses. I am an actress, dancer, singer, makeup artist, fashion designer, film critic and movie reviewer. I have critiqued over 400 films and TV shows for IMDb since 2002. This month marks my 19th-year IMDb Anniversary.",
            "review_date": "2017-11-13",
            "lang": "en"
        },
        {
            "review_title": "Exuberant, evocative, but flawed",
            "content": "Jules (Oskar Werner) and Jim (Henri Serre) form a close friendship in Paris in the carefree years immediately prior to WWI. Enjoying a bohemian lifestyle, they become involved with the free-spirited Catherine (Jeanne Moreau) and form an unlikely bond that lasts for more than two decades before ending in tragedy.Francois Truffaut purchased the semi-autobiographical Henri-Pierre Roche novel on which this film is based in a second-hand bookshop while still working as a critic for Cahier du Cinema and, falling in love with its themes of free love and passion, hoped to one day turn it into a film, even though he originally believed it to be unfilmable. The film's narration is apparently taken word-for-word from Roche's novel and, unusually for this technique, it works very well – especially in the opening couple of minutes when it delivers an exhilarating summary of the beginnings of Jules and Jim's friendship and the men's respective success with women (Jules has none, while Jim has them all).Truffaut does well in capturing the exuberance of youth, particularly in that famous race across the bridge in which we see, for the first time, the two men trying to catch up in Catherine's wake. The film's first third, before the start of the war, is extremely effective in evoking a nostalgic and idyllic depiction of life before the burdens of responsibility converge. But a film full of happiness would have nowhere to go and would quickly grow dull, and equilibrium is impossible in a ménage-a-trois. The two men become almost slavishly devoted to Catherine, but her sense of devotion is fleeting and ethereal, and the brief commune they create (with Sabine, Jules and Catherine's young daughter) is filmed almost as a dream to emphasise its' illusory nature.Reading some of the comments on this board, there appears to be quite a backlash against this film, although it still seems to be highly rated by the critics. It does come across as a little pretentious at times (and, were it to be made today, would probably be dismissed as such), but the feelings of the protagonists are well-captured. The unreality of their situation is brought home by WWI which is treated as an intrusion on their cocoon-like existence that is to be set aside as swiftly as possible. The idealism doesn't last, the relationships fracture, and its doom is sealed in the scene in which Jim and Jules agree he shouldn't have returned from Paris after delaying his departure, only to see Catherine tapping on the window of their cabin. The three leads all perform well. It's Moreau's film to be sure, with Werner and Serre merely moths flitting around her flame, and she rises to the occasion with one of the better performances of her career.Despite the flaws that are now apparent in the story, the techniques Truffaut uses are still impressive – and must have been dazzling back in 1962. Time has blunted their impact to a large degree but those with an appreciation of quality film-making (as opposed to quality story-telling) will still find a lot to admire in this film.",
            "review_date": "2010-04-12",
            "lang": "en"
        },
        {
            "review_title": "Francois Truffaut's second masterpiece",
            "content": "Jules et Jim is one French New Wave's most significant films, it's such a charming, beautiful yet so sad and heartbreaking tale of friendship, in all its joy and sadness. Director Francois Truffaut uses all his techniques in making this into his second masterpiece, the absurdity and humor, and innovative use of freeze frames and tracking shots, and absolutely fabulous cinematography of outdoor-landscapes of the country side and city-life, and emotionally tied-up in the country-house where the gang of three tears out longings, jealousy and a change-of-times.The friendship of Jules and Jim is a stronghold, and they're both cultural and sophisticated, and with Catherine's presence Truffaut tells a timeless story of how a woman can change just about everything what's going on - and Jules and Jim go on for the ride, but Catherine is flirting, charming woman who needs complete freedom in her life, and crucially, her harmony becomes her disharmony. And in the finale, it's told that Catherine wanted her ashes spread with the wind, but that wasn't allowed... It's a sort of comforting ending, after you've seen a friendship lost.",
            "review_date": "2008-11-03",
            "lang": "en"
        },
        {
            "review_title": "An Amazing Film, Classic Truffant.",
            "content": "Francois Truffant's Jules Et Jim is a true work of cinematic genius.The film belongs to Jeanne Moreau, she pours everything into hercharacter Catherine. She's a walking catastrophe that longs for anddesire's something that she simply cannot have. A sad, moving filmabout true friendship. Truffant shows off his innovative film work thatover the years has been admired by millions and copied by thousands. Nomatter how influential a film-maker such as Truffant is, there's onlyone original.Highly recommendedAFor true lovers of Cinema. Worth any film viewer's salt. A  film abouttrue friendship and a tragic love affair.",
            "review_date": "2003-10-05",
            "lang": "en"
        },
        {
            "review_title": "Extraordinarily powerful examination of gender roles",
            "content": "I can't quite comprehend how powerful this film must have been on its release in 1961, but I saw it for the first time in the year 2000 and consider it to be incredibly powerful even now - a truely unique, thought provoking, emotional experience.  I urge anyone with a passion for something special, something different, something powerful, to see this movie.  I saw this film in a movie studies class last night on the tail of seeing 'The four hundred blows' & 'shoot the pianist' Truffauds 1st two films (Jules et Jim being his 3rd), and all three are truly outstanding pieces of cinema.",
            "review_date": "2000-02-16",
            "lang": "en"
        },
        {
            "review_title": "Irony, Thy Name is Truffaut",
            "content": "One way to describe Francois Truffaut's 'Jules and Jim' would be a 'Wuthering Heights' adaptation sans Heathcliff. Another way to describe it would be as a work resplendent in irony and the artifice of love (something with which the French are particularly familiar). Yet, regardless of synopses, 'Jules and Jim' is among a rare class of film that utilizes beautifully poetic editing and photography for the paradoxical purpose of cold, pragmatic storytelling, and utilizes it well.'Jules and Jim' tells the story of two friends (take a wild guess what their names are) who simultaneously fall head over heels for Catherine, a rather sadistic tease whose capricious romantic affections create a minor rivalry between the pair. The fact that much of the film takes place after the First World War, in which the two fought on OPPOSITE SIDES, doesn't help the situation.The plot comes off as a predictable melodrama, and it is, but what makes 'Jules and Jim' so wonderful is the ironic way in which it recounts this melodrama. Being a French New Wave production, there are of course lots of jarringly undramatic edits, shots, and voice-overs (the film has quite possibly the world's most deadpan narrator), all of which contrast beautifully with the fatuous love triangle at the centre of the film that ultimately spirals into tragedy. If it weren't for the levity of Truffaut's storytelling and his own claim that the film was a \"hymn to life\", one could swear the film was deeply misanthropic.As it is, though, 'Jules and Jim' is more a celebration of the momentary bliss of youthful love and vitality, acknowledging at the same time how clinging to those things can often lead to disillusionment and destruction. In other words, somebody needs to show this film to Madonna.'New Wave' films may have an inconvenient propensity to polarise, but if by hearing a man with an exaggerated monotone (please forgive my tendency toward oxy-morons) indifferently regaling you with a tale of absurd melodrama you do not want to thank the Lord God (or whichever deity you may reverently pester) for the miracle of cinema, then you should be ashamed to consider yourself a cinephile.",
            "review_date": "2011-05-22",
            "lang": "en"
        },
        {
            "review_title": "Beautifully made but deeply depressing",
            "content": "A splendid looking period film, luminously photographed in wide screen black and white by Raoul Coutard so, on the one hand, it looks perfectly of its time yet utterly modern as well. Although based on an early 20th century novel, (the period in which it is set), by Henri-Pierre Roche, (and largely autobiographical), you can't imagine the film being made any earlier than it was. (Its unconventional story-line, too, was distinctly 'modern').The title characters are friends, one Austrian, one French, both in love with the same woman, the deeply amoral gadfly Catherine who comes to dominate their lives and the movie. They don't work as such; they seem to be the idle rich, though both Jules and Jim write, one novels, the other text-books, as if to justify their lifestyles if not quite their existence and the only way either of them can keep Catherine is ultimately to share her.As Catherine, the film immortalized Jeanne Moreau who, in this movie, became the icon of the nouvelle vague, though the low-key performances of Oscar Werner and Henri Serre as Jules and Jim are equally as good. Still, this tale of amour fou is deeply depressing, (it's a roundelay of falling in and out of love), so while I admire the skill with which it is made I've never actually liked it. Nevertheless, it's a good deal better than Paul Mazursky's contemporary New York based homage \"Willie and Phil\" which, while perfectly entertaining on one level, seemed somewhat facile and superfluous overall.",
            "review_date": "2007-12-02",
            "lang": "en"
        },
        {
            "review_title": "As imperfect as life but worth enjoying",
            "content": "It is a truly vintage movie, the plot revolves around Paris of 1912 ; the love triangle drama was released in 1962 ; I find it most fascinating that it is as fresh after 6 decades of it's release ; though the protagonist carries on with adultery, there is nothing like vulgarity or nudity.",
            "review_date": "2021-05-30",
            "lang": "en"
        },
        {
            "review_title": "one of cinema's best, most deeply felt romances...",
            "content": "I found it very difficult to maintain an objective opinion while watching Francois Truffaut's \"Jules et Jim,\" probably because it possesses a sensitive humanity in its characters that makes them easily associable to one's self. Those who know what it feels like to truly be \"in love\" or share a longstanding friendship with someone will be immediately hooked. It makes you wonder what secret formula the French have for film-making, especially when tales of genuine, heartfelt passion and sorrow are so elusive here in the States.The story is essentially its characters: Jules and Jim are inseparable best friends who happen upon Catherine, an impulsive, indecisive woman who falls in love with both men (and they in return with her); the unique dynamic to this tale is the utter lack of jealousy between the two men as they share one woman. Years pass, Jules and Jim are sent off to war, Jules marries Catherine (both have their share of infidelities), Jim returns, Jim marries Catherine, Catherine becomes indecisive and goes back to Jules while Jim retreats to Paris, where he plans his marriage to Gilberte, his stand-by girlfriend.My description of the plot is extremely bland, because the success of \"Jules et Jim\" lies in its characters--somewhere in our lives, we feel that we have truly \"known\" these people; the impulsive, irrational Catherine, the level-headed, charming Jules, and the reserved, introverted Jim. Oftentimes, the rapport between the male leads is so synchronous in tone and character that their personalities seem identical, whereas at other points, they couldn't be more different. Their relationship with Catherine--a creature so drastically divergent from themselves--possesses a unique magic that shows just how inexplicable and random love really is; it is an emotion that has no concrete definition and varies from person to person, but it is clearly evidenced--and felt--in \"Jules et Jim.\" Truffaut has made one of the most compelling--and unusual--screen love stories of all time (it certainly beats the stuffing out of \"Shakespeare in Love\"), a film of escapist visionary grandeur and down-to-earth brilliance.",
            "review_date": "2006-02-02",
            "lang": "en"
        },
        {
            "review_title": "Just wonderful!",
            "content": "Jules et Jim was my introduction to Truffaut and I was completely blown away by it, I can't wait to watch more by him. Stephen Hawking said this was his favorite movie and I can see why. The film revolves around two best friends Jules and Jim and the enigmatic woman who captures both their hearts, Catherine. The film follows their lives for nearly a decade and a half. In the first arc of the film, it's established that while both are attracted to Catherine, she chooses Jules and Jim is a good sport is genuinely happy for his friend. Years pass and after the great war both the friends are reunited, Jules and Catherine now have a daughter but Catherine is too headstrong and adventurous of Jules, Jules actively persuades Jim to be Catherine's lover and husband so that she does not run away from his life and they can be a big happy family together, meanwhile Jim who never really got over Catherine rekindles his flame for her and she starts falling for Jim as well. As you might have guessed this is a very sexually progressive film especially for 1961. However through all this complexities, the film maintains it's infectious energy and who better to guide the viewer through this maze of emotions than these fleshed out well written characters. I found the film quite modern and \"talky\" it has aged very well, relevant not even today but will be so long after we are gone.",
            "review_date": "2017-05-16",
            "lang": "en"
        },
        {
            "review_title": "A classic film - must see for any cinophile",
            "content": "I think this is the origin of \"manage a trois\" but actually, while they live together, She is never with them both together.a strange film in many ways. Interesting, with a wicked ending.there is nothing I would change in the film.",
            "review_date": "2020-02-04",
            "lang": "en"
        },
        {
            "review_title": "A Good Movie For People To Watch About The Weirder Things People Are Capable Of",
            "content": "What I like about Jules and Jim is its subject matter. It's not like other love stories. It's a very very offbeat way of showcasing what some people will do when they are delusional enough to try to find a love that conquers all loves. They try to reinvent love to be the most profound and the deepest of people, but what they can never figure out is that love is something beyond your control, and when one person's trying to control it, others are put in a position full of emotional pain and stress and jealousy, and when others are in love with this person, they are reminded even more of the lack of control they have over love. That's the message Jules and Jim portrays. It's a very very important and seldom realized message. Leave it to a director from the French New Wave to tackle it.Truffaut's delightfully eccentric film-making is also good by showing us a dated view of what people at that time in that place did with their time and how people associated with each other. The film is not incredible, though. It is not as memorable as you feel it will be when you start watching it. It begins with a brisk pace and crisply stylizes its journey through the exposition, but as it coasts through the meaningful substance of the last 45 minutes, it doesn't feel quite as meaningful or important. Nonetheless, Jules and Jim is nothing short of interesting and worth it for everyone, even though I'm sure most people aren't into French Nouveau anymore.",
            "review_date": "2006-11-05",
            "lang": "en"
        },
        {
            "review_title": "Innovative but disappointing",
            "content": "This is one of the most famous and influential films by Truffaut, but in my opinion it is deffinitely far from being among the best of them. It is innotavie in its narrative and edition, and has a nice cinematography. However, pace is mostly sluggish and even boring, the story is not moving most of the time (it could have been different with another script script), and all three characters are very uncharismatic.",
            "review_date": "2021-09-19",
            "lang": "en"
        },
        {
            "review_title": "A little jewel from Truffaut",
            "content": "This is another beautiful film by the famous French director François Truffaut. In this one, he explores the notion of friendship and love. The friendship that share Jules and Jim, and the love that they both have for Catherine is well explored. We don't want this movie to end.I'm still fascinated to see how Truffaut plays with the images and the camera. The movie is well construct and the acting is excellent by Oskar Werner (Jules) and Henri Serre (Jim). As for Jeanne Moreau, she's simply astonishing in the role of Catherine. By the way, for another great movie with Moreau, see «Le Dialogue des carmélites».This movie, coming out in 1961, must have created some controversy because of the issue that it raised. I can hardly see a film like this coming out of Hollywood at that time. Maybe in a comedy, they would have flirted with the same subject, but surely not in a true movie like this one.«Jules et Jim» also touched the delicate subject of war. It's interesting to see the feeling of both Jules (an Austrian) and Jim (a French). During WW1, they're soldiers one against the other and the thought of killing the other is always present.I also liked this quote from Jim, himself quoting a teacher that he once had: «L'avenir est aux curieux de profession».Out of 100, I gave it 85.",
            "review_date": "2001-04-16",
            "lang": "en"
        },
        {
            "review_title": "Think for yourselves",
            "content": "Truly have a mind of your own and do not be influenced by other peoples reviews!!! This is the WORST film I have ever seen. The characters are completely devoid of human interest and the female lead is the most psychotic uninteresting ugly and flaccid character I have the dishonor of recalling in Cinema. There are so many bad lines... breasts like grenades blah blah blah. I swear when the guy was cutting logs he should have taken the biggest and taken one to his French friends shoulders. If we all acted like these lovies then we would never get on with normal life. Get real this is not top cinema, nor was it ground breaking, thank God we have decent French cinema in abundance. Cinematography appalling, soundtrack appalling, script appalling. Appeal nil points. Zut alors!!!",
            "review_date": "2005-08-13",
            "lang": "en"
        },
        {
            "review_title": "It takes all kinds -- unfortunately",
            "content": "All I can say about kramermile etc's comments is: now we know how someone like Bush can elected in an age full of electronic \"information\". You'd have to indeed be high on some really bad stuff to miss the artistry of a masterpiece like 'Jules and Jim', not that this would explain the inability to grasp why film lovers and critics over the years have ranked this as one of the all-time greats, both as pure cinema and as a capsule evoking the time beginning at the optimistic start of the last century and ending with the Nazis burning of the books so loved by Jules and Jim. (And isn't it at least sort of interesting that Truffaut's Jules, Oskar Werner, showed up later in his adaptation of 'Fahrenheit 451, which in turn was one inspiration to Michael Moore?) Oh, but never mind: Darwin was a lunatic; Picasso's art was putrid, the Marx Brothers weren't funny, and who signed those wretched Beatles to a record contract anyway? Well, time to go outside now in my Philistine-Mobile; the sun is going down, so it must be morning in America! Hey, that Kool-Aid sure looks tasty.",
            "review_date": "2004-11-21",
            "lang": "en"
        },
        {
            "review_title": "Pronounce it with D in front",
            "content": "One of Francois Truffaut's highly acclaimed films focuses on a love triangle between the title characters and Catherine (Jeanne Moreau) over a period of several years starting before WWI and ending in the 1930s. How to interpret the movie? Hard to say. If nothing else, I can say that I am one of the people who has seen this well regarded movie. All the characters understand that the triangle may affect their friendship, but know that they have to go on no matter what.I actually think that the scene where Jules and Jim chase Catherine through the tunnel while she's wearing the moustache suggests an interesting idea. Both men chase her - with questionable possibilities of catching her - shortly before WWI begins. Maybe this says that they're going after an unattainable goal, oblivious to the impending state of affairs on the world stage.Even if that's not what it's saying, this is still a good movie. I recommend \"Jules et Jim\" to everyone.",
            "review_date": "2007-01-31",
            "lang": "en"
        },
        {
            "review_title": "The best Film I have ever seen",
            "content": "I have seen this film 10's of times and I can never get tired of it. Many people criticized the film because the characters and actions of the film are so incomprehensible. That is exactly the film's point.\nDo we know ourselves? Do we always rationalize our emotions? Or even understand them?This film is a study of humans. It is asking questions that every one of us should ask in order to understand ourselves and eventually get closer to understanding life.A must see!!!!10/10",
            "review_date": "2003-04-05",
            "lang": "en"
        },
        {
            "review_title": "Truffaut dares you to resent these idealists.",
            "content": "Jules and Jim is one of the strangest romances I have ever seen and I am still rather unable to understand everything Truffaut was trying to say. However, what does seem clear is how this menage a trois reflects and represents the feelings and sentiments of Europe, particularly France, after the First World War and into the 1960s, a radical time in French cinema. At the height of the French New Wave celebration, Truffaut was perhaps the most beloved of directors. This film makes it easy to see why.Very few films can match the sheer speed and efficiency of storytelling that Truffaut employs here. The use of narration, an incredibly fluid camera and quick editing styles all contribute to a whirlwind of a story in which decades are covered within a two hour time frame. It's almost as if Truffaut is making it clear that this entire story is simply a memory, fleeting in the past and soon to be forgotten. He also makes this clear through how he showcases the Great War, using various cuts of footage edited together that give the feeling of a choppy, unsure afterthought of instances. This was unheard of style for 1962 but it makes so much sense today that many may not understand its originality.The ending is what most will question and I must confess it puzzles me slightly as well. What I do believe is that Truffaut was less concerned with how the film ended than how it affected the audience collectively. The overall effect is one of fleeting nostalgia; these three characters are almost entirely wrapped up within themselves and their own immediate gratifications. It is this conflict between desire and realism that forms the arc of the story and why, if nothing else, Jules and Jim is a memorable New Wave film that is still effective today as a tragic romance.",
            "review_date": "2011-07-04",
            "lang": "en"
        },
        {
            "review_title": "Be prepared for disappointment",
            "content": "This movie tops my list as the most over-rated film. Maybe it means something in French but reading the sub-titles it disappoints. Now if you want to see a truly great foreign film Persona is the one to view.",
            "review_date": "2000-11-30",
            "lang": "en"
        },
        {
            "review_title": "Tedious If Groundbreaking",
            "content": "Of the New Wave directors, Francois Truffaut is probably my favorite, but \"Jules and Jim,\" while an important, groundbreaking example of the movement, is a tedious slog by today's standards. The very qualities that made it a fresh breeze at the time blowing through movie theaters populated with stodgy Hollywood products are the same things that make it a difficult watch now. It's actually a bit of a compliment, because the tics and idiosyncracies that made it unlike any romance put on screen before it have since become absorbed by modern filmmakers, so now they just seem annoying instead of bold. I lost patience early on with this story about two men and their love for the same woman, and the random caprices of the woman that make her not just unlovable, but downright unlikable. This is yet one more example of a story about men obsessed with a woman whose appeal so escapes me that I can't understand why they're obsessed with her in the first place.But on the other hand, as I was poking around on the Internet to see how some modern-day viewers have responded to this film, I started to wonder if maybe that was Truffaut's point all along. Maybe he saw something in actress Jeanne Moreau that fascinated him and assumed we would be just as fascinated, but maybe not. Maybe his movie is about the sometimes inexplicable nature of love and is interested in the question of why some people are infatuated with other people who give them no reason to be. That reading makes the movie somewhat more appealing to me, because it turns it into more of an anthropological study than a romantic melodrama, but it still doesn't alleviate the fact that the movie is two hours of arbitrary things happening to three people who are deeply unpleasant to be around.Grade: B",
            "review_date": "2020-07-06",
            "lang": "en"
        },
        {
            "review_title": "Fascinating exploration of \"a real woman\"",
            "content": "I can understand why some viewers are turned off by this film. It can be be frustrating, because it does not follow established patterns of Hollywood films. The characters are moody and their passions change with the wind. It is very \"French,\" with the characters talking about how much they are suffering, or want to suffer, or are going to suffer. The characters at times explain exactly what is going on, if you want to listen, so there are few surprises. So, the film is not for everyone.But I like it. The central character, Catherine, is manipulative to the extreme. The men, who have the only stable relationship (of friendship) in the film, adore her for her strength and waywardness, willingly giving her the power to use them, and she uses this to play games with them. Constant games, as in, if one looks at her the wrong way, she leaps into the arms of the other. And if not jumping from Jules to Jim or vice versa, she finds someone else. She as much as explains her motivation for her impulsive affairs in a little anecdote about what happened at her wedding to Jules, that it is all a matter of \"getting even.\" Almost everything she does is directed at either Jules, or Jim, or both at once, to make a point or inflict punishment. How important her relationship is with them is truly revealed only at the end.Things work fine as long as the men put up with this. And the triangle lasts for a long time - if one wants to be romantic, the ending suggests it lasts for all eternity. The manipulation inevitably gets out of control as one of the men tires of the games, with talk of a pregnancy that may or may not exist. Inevitably, things break down. Whether the ending is realistic or not, is not the point. The point is that Catherine ultimately is the one incapable of letting go of the life her men have created for her. In a sense, while she is the one manipulating the men throughout for her own self-absorbed reasons, they are the ones creating the whole scenario, to the point of writing letters to each other on her behalf. You may like this film better if you are able to think of Catherine as the victim, which is how I view her, a tragic victim of ultimately weak men.There are several requirements, I think, for appreciating this film. You need to enjoy deep, moody French films. They sure aren't for everyone. You must enjoy brilliant non-English acting, especially by Oskar Werner, who pulls off a terribly difficult role with élan. And you should be able to look beyond a character's actions to their motivations and what is really driving them to do things. Not a Hollywood film at all, but truly breathtaking if you give it the attention it deserves. And it truly is a beautiful film.",
            "review_date": "2007-02-14",
            "lang": "en"
        },
        {
            "review_title": "His Greatest work!! A MASTERPIECE",
            "content": "Francois Truffaut for me was the best director that ever lived. That may seem like a bold statement but after having studied him in depth i can appreciate his massive contribution to cinema.Jules et Jim is one of the very first 'Love Triangles' ever put to be put to the screen and is ultimately the best. When we see the tripe that under par American directors produce you realize just how good this film is. Without a great budget Truffaut is able to create an authentic and realistic setting and is able to get across a very humanistic feel to it all.A Charming and sometimes surreal story this really is a must for all world cinema fans, in fact any of Truffaut's films are worthy of a watch.",
            "review_date": "2004-08-24",
            "lang": "en"
        },
        {
            "review_title": "Men mesmerized by \"la vraie femme\"",
            "content": "Another quirky creation directed by François Truffaut. There is obviously a ménage à trois theme here but more importantly the power of a woman (played by Jeanne Moreau) to utterly captivate men, to the point where they basically become her slaves. To be honest, I did not understand the attraction, which must be \"magnetic\" or \"chemical\" or something else, because it clearly wasn't intellectual or philosophical or aesthetic. I was actually finding Catherine pretty annoying by about half way through the film, but Truffaut manages to pull it all together with a somehow satisfying conclusion. It had to end. It just had to.I imagine that this film has been subjected to endless Freudian analysis.",
            "review_date": "2021-01-19",
            "lang": "en"
        },
        {
            "review_title": "Has its moments",
            "content": "This is oft quoted as a great movie. It certainly is epic in its ambitions. However it failed to move me greatly. The love triangle thing has been done a lot and had already done so in 1962.The epic elements didn't please me much - the cursory WW1 scenes. A passing mention of Nazism \"they're even burning books now\", but then let's get back to the stuff that really matters - a grade 'A' fruit of a woman and a pair of buddies who love her in different ways.There are some beautiful moments, some fine cinematography, more than able performances, but in the end it was disappointing. Disappointing in the way that a meal in a fine restaurant might be very good on paper but just doesn't send you personally.I'd recommend that people see this movie, but going into it with lower expectations than I had.",
            "review_date": "2005-01-14",
            "lang": "en"
        },
        {
            "review_title": "Nice Style",
            "content": "Decades of a love triangle concerning two friends and an impulsive woman (Jeanne Moreau).The film is based on Henri-Pierre Roché's 1953 semi-autobiographical novel describing his relationship with young writer Franz Hessel and Helen Grund, whom Hessel married. Truffaut came across the book in the mid-1950s whilst browsing through some secondhand books at a bookseller along the Seine in Paris. Later he befriended the elderly Roché, who had published his first novel at the age of 74. The author approved of the young director's interest to adapt his work to another medium.The movie has been called \"an inventive encyclopedia of the language of cinema\", as Truffaut incorporated newsreel footage, photographic stills, freeze frames, panning shots, wipes, masking, dolly shots, and voice-over narration (by Michel Subor). Today, the influence continues in everything from \"Goodfellas\" to \"Pulp Fiction\" to \"Life Aquatic\" (three films you would not expect).",
            "review_date": "2015-08-05",
            "lang": "en"
        },
        {
            "review_title": "Whatever",
            "content": "I enjoyed the first bit of this film establishing the friendship of Jules and Jim. Even when Catherine is introduced, it's enjoyable. However, once it gets to the war, everything after that was just boring to me. It was hard for me to stay interested in what was happening. I don't know if this movie was based off a book but that's how I felt this story would have better been told. Not my favorite.",
            "review_date": "2020-04-24",
            "lang": "en"
        },
        {
            "review_title": "who watches this?",
            "content": "I was forced to watch this movie in a film class.  It was the longest 3 weeks of my life.  The highlight of the movie was when they finally killed themselves.  It was definitely the worst movie I have ever seen, and I have seen some very bad movies in my time.  I believe having my wisdom teeth removed was a bit more pleasant.  Unless you are looking to waste several hours, do not even think about watching this movie.  You have been warned.",
            "review_date": "2003-10-26",
            "lang": "en"
        },
        {
            "review_title": "Like Watching a Novel",
            "content": "Part of the sheer brilliance of Jules et Jim is the manner in which the film is constructed.  The narration coupled with the ambiguities inherent in films of the French New Wave create the feeling of a true literary work. The narration describes what the viewer sees in poetic terms.  It is hard to describe the feeling the viewer gets while viewing this film.At its heart the film is about the bliss of the unconventional romantic couple (it is essentially a threesome), and the lament of the characters that it cannot be sustained.  The characters are extremely complex such that the audience cannot feel either sympathy nor antipathy for them; they can only empathize.  The film is brillaintly framed with archival footage is select parts of the film to both place the film chronologically and set up the mood of the following scenes of action.  The bliss of their threesome (illustrated by turn-of-the-century Paris) is interrupted by war which in turn is followed by a period of misery and discord.The editing also describes the moods of the characters.  The first part is fast paced to mirror their bliss while the post-war scenes are long and drawn out.  Overall, the film, while not being the most exciting or happy of films, is definitely a brilliant piece of filmmaking from the great Truffaut.  It is a hypnotic tale of three outsiders who attempt life as an \"eternal triangle\" only to find it impossible.        -- A+",
            "review_date": "1999-10-05",
            "lang": "en"
        },
        {
            "review_title": "Truffaut's Best!",
            "content": "The acting is brilliant, the mise-en-scene superb, and the Delerue soundtrack is his best work. There has never been a sadder image in film history than Werner walking down that hill.",
            "review_date": "1999-04-01",
            "lang": "en"
        },
        {
            "review_title": "Very Real to real feelings",
            "content": "The movie starts of as every goofy. A true representation of two best friends. And as the story moves the emotions and human feelings moves toward it. You can relate to all three characters.",
            "review_date": "2021-12-04",
            "lang": "en"
        },
        {
            "review_title": "A tale of two men who fall in love with the same fickle woman but don't let it shake their friendship, told through French New Wave innovations",
            "content": "Francois Truffaut's 1962 French New Wave classic JULES ET JIM tells the story of two pals and the woman they both fall in love with. In 1912, Jules (Oskar Werner), an Austrian living in France, strikes up a deep friendship with Parisian writer Jim (Henri Serre). The two are the best of buddies, downright inseparable. After they have each experienced a series of attempts and fiascoes with the local ladies, Jules meets Catherine (Jeanne Moreau), a vivacious and free-spirited woman, and they move back to Austria together and marry. The outbreak of World War I separates the two friends and years pass, but after the Armistice, Jim visits Jules and Catherine and finds their marriage rocky. Catherine decides to leave Jules, and she turns her affection to Jim, but this doesn't shake the two men's firm friendship.The bond between the two men, and the vivacity and ethereal nature of Catherine, make for a film initially so positive and heartwarming that it is easy to see why JULES ET JIM has won a very wide audience beyond many other French films of the mid-20th-century. The script lets Moreau, already one of the most legendary actresses of her age, show off all kinds of tricks she had long honed in the theatre.But the story increasingly takes on tragic tones, for Catherine is a deeply conflicted person, desirous of the two men by turns but ultimately unable to find happiness. In a modern Hollywood film a character like Catherine would probably be written as the \"Manic Pixie Dream Girl\" archetype, existing purely to show the male interests how to love life and live it to the fullest, but lacking any life of her own. In Truffaut's film, however, the depths of Catherine's psyche is what ultimately draws the plot. Yet because the film is still roughly told from the point of view of the two male characters, the film does convincingly depict the sort of relationship where you love someone and must support them through their struggles, but that person still remains ultimately unknowable.In spite of being a film of wide appeal due to its likable characters and charm, JULES ET JIM is still an exemplar of the French New Wave. It shows some relatively innovative features such as jump takes, freeze frames, and carousel-like camera work, all shot by legendary cinematographer Raoul Coutard who was also responsible for Jean-Luc Godard's films of this era. Truffaut and his peers in the French New Wave were mad about the history of film, and here we get a sort of encyclopedia of film: allusions to the silent era, use of newsreels and other archival footage, and a voice-over narrator that comes in and out.I enjoyed watching JULES ET JIM and there were some moments that I am sure I will long remember – Marie Dubois's brief supporting role as one of Jules' early love interests is laugh-out-loud funny. Yet I must admit that I was disappointed by the pacing in the last third of the film, which feels clumsy. The film also gradually abandons its New Wave freshness as the tragic part of the story takes over, and one already sees Truffaut drifting back towards conventional filmmaking. So, I personally would not include it among my top films. Still, its classic status is easy to understand and it's worth a look for any curious viewer.",
            "review_date": "2017-08-26",
            "lang": "en"
        },
        {
            "review_title": "life takes truffaut on a journey",
            "content": "Kind of new agey film. Catherine hangs with jules and jim, who have been best friends for years. They celebrate each other's successes, and have fun together. They work so hard, that its forced, and gets annoying after a while. With the lack of much of a plot, we just plod along, letting the action take us where it will. Catherine and jules marry, and world war one breaks out, putting a hold on the international friendship. The film ends up being about catherine, her loves, her free spirit, her infidelity, her daughter. Her ups, her downs. It ends on a very dark note. Sadly, truffault himself died early at 52, from cancer.",
            "review_date": "2022-03-07",
            "lang": "en"
        },
        {
            "review_title": "Jules et Jim: a wonderful movie",
            "content": "I think that it will be not exaggerated if one says that nouvelle vague achieves here one of his most powerful expression, wit a movie that will remains for ever as one of the greatest masterpieces of all Cinema History. I,m only forty four and I don't belong to the generational chorus that, sometimes with lots of misticism, proclaims his almoust sacrated vote of Fidelity to the French and Italian Cinema: from Truffaut to Godard and fom Antonioni to Pasolini. In the sixties and the seventies the European cinema was full of vitality but no all the movies grew older with the same distinction. Not all the movies were masterpieces. Jules et Jim, Á Bout de Soufflé et Pierrot le fou will stand.",
            "review_date": "2005-09-17",
            "lang": "en"
        },
        {
            "review_title": "The Whirlwind of Life",
            "content": "Before I first saw \"Jules and Jim\" I knew that it was about two friends of different nationalities who were in love with the same woman, and assumed that Jules would be French and Jim either British or American. In fact, it is Jim who is the Frenchman (although he insists that his name should be pronounced in the English way and not as \"Zheem\", which is how the French would normally say it) and Jules Austrian.The film is set around the time of the First World War. Shortly before the war, the Parisian Bohemian Jim meets Jules, a young writer from Austria. Although the two men are very different in personality, Jules being quiet and shy, Jim more of an extrovert, they are drawn together by their common interest in the arts and become firm friends. Their friendship, however, is threatened by two things- their shared love for the beautiful Catherine, who becomes Jules's girlfriend and then his wife, and by the outbreak of war, in which their countries are fighting on opposite sides. Both men are called up and go off to serve in their countries' armies.Both survive the war, and are reunited after the return of peace. Jules and Catherine are now living in Germany with their young daughter Sabine, and Jim comes to join them. There are tensions in the marriage, and Catherine and Jim begin an affair, which Jules tolerates. The situation is complicated by the fact that Catherine has a third admirer, Albert, a mutual friend of Jules and Jim, and that Jim has another girlfriend, Gilberte. (The plot has certain similarities to Goethe's novel, \"Die Wahlverwandtschaften\", or \"Elective Affinities\", which is mentioned in the film).This was one of the films which brought Jeanne Moreau, already a well-known name in France, to international attention. In Britain she was widely seen as the epitome of French chic, even though she was actually English on her mother's side. Here she is the ideal choice to play Catherine- attractive, kooky, free-spirited, seemingly in love with life, yet at the same time hiding a darker side to her personality which gradually becomes apparent. This becomes Moreau's film to such an extent that she rather overshadows Oskar Werner and Henri Serre as the two men, although both are good, especially Werner. (He is better here than he was to be in \"Fahrenheit 451\"; his French seems to have been better than his English).François Truffaut was a leading light in what has become known as the French New Wave of the late fifties and early sixties and a leading proponent of the \"auteur theory\", and accordingly acted as producer, director and screenwriter of \"Jules and Jim\". I must admit that I am not particularly familiar with Truffaut's oeuvre, or indeed with that of the New Wave in general, having seen only four of his twenty-odd films. (The others are \"Fahrenheit 451, his only English-language film, and \"L'Enfant Sauvage\" and \"Les Deux Anglaises\", neither of which I have seen for many years). Nevertheless, \"Jules et Jim\" has long been a favourite of mine, ever since I first saw it in my student days.My reasons for admiring it don't have much to do with the technical and stylistic theories of the New Wave film-makers. My main reason is that, despite the tragic ending, \"Jules at Jim\" is very much a film about life, and the joys of life- love, friendship, art, nature- evoked through a series of poetic images. The highlight for me is always when Catherine sings that moving evocation of the twists and turns of love, \"Le Tourbillon de la Vie\". (\"The Whirlwind of Life\"). The song seems to end happily with the two lovers \"tous les deux enlaces\" (\"both bound together\"), although in the light of what is to happen this line perhaps takes on a darker meaning. What always remains with me after seeing the film is not the tragedy with which it ends but its celebration of life's pleasures- going to the opera with a friend, cycling through the countryside, sharing a meal, watching the woman you love sing a song. 9/10 (8/10 for the film with a bonus point for the song).",
            "review_date": "2022-11-18",
            "lang": "en"
        },
        {
            "review_title": "The French Are Glad To Die For Love: Jules Et Jim",
            "content": "Jules Et Jim (1962): Jeanne Moreau,Oskar Werner, Henri Serre, Michel Subor, Boris Bassiak, Anny Nelson, Vanna Urbino, Sabine Haudepin, Marie Dubois, Elen Bober, Pierre Fabre, Dominique Lacarriere, Jean Louis Richard, Bernard Largemain, Michel Varesano, Kate Noelle, Michel Varesano, Christine Wagner...Director Francois Truffaut...Screenplay Jean Gruault.Director Francois Truffaut was a big wig among French film-makers in the early 1960's and his films enjoyed equal popularity in the States. This film is possibly his greatest and certainly his most memorable movie. Art-house/foreign film lovers will be in Heaven viewing this slice of French cinema from a bygone time and from a master. For 1962, this film was ahead of its time regarding its subject matter, which is polyamorous relationships, with just the slightest hint of \"swinging/wife swapping\" which would become common in the States in the later 60's. Jules Et Jim (Jules And Jim) is based upon the novel by Henri Pierre Roche. It's the story of a beautiful, charismatic French woman, Catherine (Jeanne Moreau) and her relationship with two men. The first is her husband Jules (Oskar Werner) whom she married as a younger girl during the onset of World War I. They have a child together and their marriage appears to be running well but in time Catherine's lust for life, exceeding Jules, leads to her falling in love in where else but Paris, the city long known for romance. Her lover Jim (Henry Serre) is initially unhappy to discover that she is married and the mother of a child. But Catherine's irresistible charms touches his heart so when she decides she wants to remain married to Jules, he respects her decision and both men agree to share her. This was very modern stuff for 1962, and despite the menage-a-trois involved, this is a romantic film. A romantic aspect of this film is the wonderful music by veteran film composer Georges Delerue, who suffuses the musical score of the film with beautiful, French melodies and orchestral jewels. The cinematography by Raoul Coutard and production design and costumes by Fred Capel are also outstanding and make this film very romantic. The historical setting - France between World War I and II- provide this film with much realism, despite its romantic leanings and dreaminess. There are beautiful vistas of the French countryside, quiet country rodes, the sea, Paris and we are treated to scenes of life in France during the World Wars and the prosperity it enjoyed afterward. This is a well-made film, and a touching one. It is a story of a woman who finds happiness with two men and the fleeting quality of that happiness. This is a movie sure to move you. It may also serve as a date movie, despite it's cultural gloss. Shot in classic black and white, with a great score, well-directed, terrific script and superb acting, this is a film that, had it been made in America, it would have garnered Oscar buzz at the time. Even though Jeanne Moreau did not enjoy the success of other French film actresses like Catherine Deneuve, she is a well-trained and convincingly real actress. She doesn't need to look \"drop dead gorgeous\" to look beautiful. Her beauty is quietly feminine. Watching her in this film, one can understand why Jules and Jim fall for her and don't have a problem sharing her. The ending is always moving and tragic. A fine film.",
            "review_date": "2007-04-18",
            "lang": "en"
        },
        {
            "review_title": "Hollywood convention vs. nouvelle vague",
            "content": "I feel that the main difficulty that a Hollywood oriented viewer, like myself, might have with this film is that it operates under different rules and guidelines. In the New Wave cinema character actions are not always explicitly rationalized. This causes certain people turn away from a movie like this as from their point of view 'Random action makes for a plotless movie'. But this view is born from Hollywood convention. The film requires a more active participation in order to be understood. Personally I thought it was a wonderful film. Its style showed me a new sense of reality in film.",
            "review_date": "2003-03-17",
            "lang": "en"
        },
        {
            "review_title": "Sometimes beautiful, but dull",
            "content": "Jules & Jim is a cinematic circus, an ancestor of later french movie Amelie. After first five minutes of the movie I was thinking that this an amazing movie, but after 30 minutes I was starting to get bored. This movie is boring because it lacks a decent plot and character development or a real character description. Storytelling is mostly absurd. Maybe people are rating this movie so high as an art-house film, but Im rating this just like all other movies - by how entertaining it is.Jules & Jim had good actors and many extremely good lines in it, but thats about it. The filming is good if you are being impressed by just watching different type of camera work, however as 21th century moviegoer this no longer so much impresses me.5/10",
            "review_date": "2010-12-27",
            "lang": "en"
        },
        {
            "review_title": "forever young",
            "content": "'Jules and Jim' may not be a perfect movie. Sometimes I got upset with the usage of out screen commentary, some of the actors are a little bit emphatic, to much 50ish for a 60s avantgarde, and the setting is in some other cases looking more 30sh than anything else. There are however so many other splendid moments of cinema in this film that thinking back I am wondering whether these goofs are not intentional, some kind of irony that François Truffaut was playing with us viewers.The triangular love story between the best friends Jules and Jim for the unpredictable Catherine extends over more than two decades and a great war and is one of the hardest to forget I have ever seen on screen. The story itself may have been daring in the first year of the 60s, but what is more daring is the series of innovations we can see on screen, starting with handhold camera ('Blair Witches Project' filmed in the woods? here it started) until the insertion of newsreel documents setting the international love story in context. But most than all we get in this movie the first great role of Jeanne Moreau and one of the best of her career and maybe in the history of French cinema. A role that will keep her in the collective cinema fans memory forever young. 'Jules and Jim' belongs to the French nouvelle vague, a short period in time when French cinema was at its best, most innovative and interesting. Many of the films belonging to this period were not about perfection but about renewal, simplicity and expressiveness. The best of these and 'Jules and Jim' is among them speak a lot to the contemporary viewer and will continue to do it for long.",
            "review_date": "2008-11-27",
            "lang": "en"
        },
        {
            "review_title": "The Power of Love...",
            "content": "Two lads from different backgrounds form a bond, a French boy with dark hair, an Austrian blond, quite Bohemian in their ways, taking pleasure all their days, and then Catherine makes it three, and waves her wand. Jim is smitten with this beauty and he falls, but then war breaks out, and homeland duty calls, so they marry, relocate, intense fighting means a break, she has a child, world reconciles, and bonds remake. Jules travels to the home of his two friends, where the triangle rotates, gyrates and bends, now he's coupled with Catherine, but Jim feels no chagrin, though it's clear this isn't where the story ends.Jeanne Moreau is always outstanding!",
            "review_date": "2023-01-19",
            "lang": "en"
        },
        {
            "review_title": "jules and jim",
            "content": "Jules and jim is yet another french romantic film that has all of its elements in it but it wasnt able to make them better or at least to change it a little,our leads are type of characters that we saw million of times and entire story felt old fashioned and unoriginal,only staff that worked in it were a fine performances and some dialogue was smartly written,but honestly im little tired of watching this type of films they all feel the same,guy or girl falls in love and then someone new enters their new life and puts them in tamptetion,jules and jim is a film that is made a saw a thousends of times and it didnt offer nothing new",
            "review_date": "2020-02-10",
            "lang": "en"
        },
        {
            "review_title": "Three Friends and a Bottle of Acid",
            "content": "Jules and Jim are friends. The meet a woman named Catherine, whom they both love. She carries a bottle of sulfuric acid around with her to throw in the eyes of men who lie to her.Stop right there. There is no need to go any further. You now know everything there is to know about Catherine. She is psycho! Long after I have forgotten the rest of what happens in this movie, long after I have forgotten who starred in it, and long after I have forgotten the very title of this movie, I will remember that. And yet, strangely enough, it appears to be the one thing that everyone else has forgotten. I have searched through the reviews of professional critics, and I have searched through the reviews published here, but this all-important fact about Catherine hardly ever gets mentioned. The question is, Why do so many people who watch this movie seem to think that this business with the acid is too unimportant to mention?Had I been Jim, as soon as I found out about that bottle of acid, I would have walked right out the door and never had anything to do with her again. In fact, for the next six months, I would have been peeking out of my apartment window to see if she was lurking about with that bottle of hers, just in case she was holding a grudge for my refusing to have anything to do with her again. Instead, Jim simply talks her into getting rid of it, figuring that will make everything all right. But that is like thinking that if you take the butcher knife away from Norman Bates in \"Psycho,\" there is nothing to worry about anymore. Speaking of \"Psycho,\" the premise of a man-hating woman who carries around a bottle of sulfuric acid to splash into the eyes of any man who lies to her could be the basis of a pretty good horror movie, and maybe even become a cult film like \"Ms. 45,\" but that is not what we have here. In any event, with regret, saying, \"I was really counting on using this bottle,\" Catherine pours the acid into the sink. She does not bother to turn on the water so that the acid will be flushed out of the system, so we see the vapors rising as the acid eats into the sink as she and Jim walk out the door.As I was saying, Jim is not worried, and Jules even marries her. In all fairness to Jules, he may not have known anything about that bottle of acid, because Jim seemed so unconcerned that he may not have bothered to tell him about it. Catherine cuckolds Jules again and again, but fortunately for her, he is a doormat, and not the kind of guy who would throw sulfuric acid in a woman's eyes for cheating on him. Since she is having sex with other men, she naturally stops having sex with Jules, but the only thing he worries about is that she might leave him. In fact, he is so afraid of losing Catherine that he encourages Jim to have sex with her on condition that Jim will let Jules see her once in a while. Better than that, Jim moves right into their home and starts sleeping with her, so now Jules can see her all the time.Catherine wants to leave Jules and marry Jim, but Jim gets fed up with her nonsense and refuses to marry her, so she pulls out a pistol and tries to shoot him. He manages to get away, but he still has not learned his lesson, which is to stay away from that nutcase, because when Catherine and Jules run into Jim some time later, all has been forgotten, and they are all best friends again. Catherine talks Jim into getting in a car with her, and then she purposely drives off a bridge and kills them both. Poor Jules, he probably feels all left out.To return to my question as to why so many people seem to discount the bottle of acid, I think that it has something to do with the mindset of people who know they are watching a foreign film. In a Hollywood movie, something like that could never be ignored, and the audience would be horrified. But when it comes to watching a foreign film, people tend to think of everything as being symbolic, or as having some kind of deep, philosophical meaning, and so things like that are not really taken as having literal significance.",
            "review_date": "2014-11-24",
            "lang": "en"
        },
        {
            "review_title": "yep, a big so what?",
            "content": "Caught this on TV here the other night having heard it was a seminal fillum of Truffaut's. The whole thing, especially after WWI started up, seemed contrived. The conversations...well, maybe it was the '60s (although the movie is not set in that decade) but no one talked like that. It was beyond pretentious.The whole homo undertones were never played out. It seemed obvious to me Jules and Jim were basically in love with each other. Jeanne Moreau's character came across as a selfish unfeeling hippy (well, pre-hippy hippy).I liked the stuff that occurred around their home in Paris but the rest went off into some pseudo sociopolitico \"woe is me\" babblefest.I much prefer Truffaut's Small Change to this pretentious drivel.",
            "review_date": "2004-07-17",
            "lang": "en"
        },
        {
            "review_title": "jules and jim",
            "content": "When I was in high school, back around the time of the Treaty of Guadeloupe-Hidalgo, there was an English teacher named Mr. Holloway who everyone but me loved. He was considered to be wise, funny, brilliant and charming. And because I was the only one in the school who thought he was a sententious old bore and I lacked the courage to go against prevailing opinion, I held my tongue.\"Jules And Jim\" is my cinematic Mr. Holloway. I gnash my teeth and hide my ennui whenever I am forced to watch it, usually by a Truffaut aficionado, and when it is over, just like with Mr. H, I smile, nod and do not say what I really think.Why do I dislike it so? Certainly I have no aversion to Truffaut in general. Indeed I regard \"400 Blows\" as one of the top one hundred movies ever made. No, I have searched my film going soul and can come up with no better reasons than that I feel the director thinks it to be much cuter and cuddlier than it really is and that, try as hard as I might, I just cannot get interested in this particular threesome or their problems, much less sympathize with them. I find their talk tedious (and boy is there a lot of talk) and their actions pretty much aligned with their speech. Aside from the WW1 montage that serves to remind you that Truffaut can be a genius it is mostly enervating stuff.The only other person besides myself who I know disregards this so called masterwork is Tarantino. Only time I've liked Tarantino.",
            "review_date": "2022-12-15",
            "lang": "en"
        },
        {
            "review_title": "doesn't quite live up to its hype",
            "content": "oh i tried to like jules and jim and it didn't work for me.  i'm not sure why people claim this is one of truffaut's best work, because it was just a beautifully shot melodrama to me.  maybe it's because i never identified with any of the characters.  i think they were foolish and wasted their lives in this horrid love triangle for reasons other than true love.i really didn't feel that jules and jim were really in love with catherine in that wonderful way that would make them put up with her. the characters seem thinly drawn out to me, i never understand catherine at all. she's a fickle control freak who likes to play with men's minds...what makes her so lovable? according to jules, it's because she's ordinary and flawed and therefore real.(or something to that effect) WTF? she's just selfish and hardly likeable. jules is more of a love-sick sort of guy who is easily manipulated and jim is downright indecisive. looks like catherine played with their weaknesses, not their hearts. seems like the only reason why they love her is because she's simply unattainable. but what i do like about the film is its energy. especially the first 30 minutes before the war, where there is such an enthusiasm and joy for life. the middle is more somber, reflective and beautiful when we see the three reunited, interacting like old friends but with more maturity than in their youth. the end is a soap opera that i didn't care for.",
            "review_date": "2003-12-30",
            "lang": "en"
        },
        {
            "review_title": "Pure, unaltered romance",
            "content": "It's a saddening recurrence in the modern popular film industry that the genre and theme of romance (and more importantly love) is stripped of its realism and gravity, instead, we are fed a diet of superfluous, courtly, modern fairy tale romance that drains the life and grit out of a subject that is ultimately reliant on human elements. Truffaut captures this realism perfectly in 'Jules et Jim', demonstrating the true sporadic, erratic and almost insane nature of love, in no way is love and romance glorified and presented as something easily obtainable and also maintainable, neither does it follow the typical Ideals and mores of society, presenting relationships and love as a practice involving more than just the idealistic couple itself.",
            "review_date": "2013-01-06",
            "lang": "en"
        },
        {
            "review_title": "great film",
            "content": "I don't know if i would call it a masterpiece, but it was a great film. This is the best Francois Truffaut film I've seen but i haven't seen that many of his anyway. I've read a lot of different reviews, some say it's his best film and some say it's a disappointment. The last Truffaut film i saw was Shoot the Piano Player and i had been really looking forward to that movie but i found it disappointing. I wasn't expecting much of this one but i loved it. I just rented The 400 Blows and can't wait to watch it. Out of the three actors in this movie, i only knew of one, which was Oskar Werner, i remember him playing \"Fiedler\" in The Spy Who Came In From The Cold.",
            "review_date": "2004-03-14",
            "lang": "en"
        },
        {
            "review_title": "Good",
            "content": "Francois Truffaut's films have never been particularly deep, and his black and white 1962 'masterpiece,' Jules And Jim, is no exception to that claim. Obviously, the quotation marks around the term declare that, no, it's not really a masterpiece, but in researching old criticism of the film it's amazing how often this term was bandied about without any support for its claim. Having said that, and given the rather fallow and overrated ground that is the Truffaut soil, I can attest that, of the handful of films of his I have seen, Jules And Jim is the best of the lot. But, had he not first gnawed his teeth at the Cahiers Du Cinema rag, thus gaining fame there, I doubt that he could have made it as anything more than a competent director of B films. I state this while having great admiration for B film directors like Jacques Tourneur, Roger Corman, Inoshiro Honda, Ed Wood, and Edgar Ulmer, among others, and realizing that, truth be told, Truffaut simply was not a better filmmaker than some of the names I quoted- Tourneur and Ulmer, especially. And Jules And Jim is simply a film that occasionally breaches into high quality, only to be sucked under by an undertow of self-indulgence and preciousness.Despite being titled after the two man male characters, Jules (Oskar Werner), an introverted Austrian writer and his French friend, the extroverted Jim (Henri Serre), the film is really about a woman, Catherine (Jeanne Moreau), who is an archetype for what is known as the artsy psycho-babe. Her filmic descendants are many, but the most famed one is her filmic namesake, that of author Catherine Trammel, played by Sharon Stone, in Basic Instinct. No, she's not as obviously blackhearted, but she's clearly off her rocker, and it's interesting that, in scanning through dozens of film reviews for Jules and Jim, I never saw a single mention that Catherine is a murderer/murderess. And that's telling, since the whole film is basically a paean to psychobitchery, deceit, and insincerity in women, yet the most heinous and self-defining thing the woman does, which is to annihilate herself and her bête noir, is almost wholly ignored, as insignificant a thing in her character vis-à-vis her supposed 'free-spiritedness,' or such.",
            "review_date": "2012-06-21",
            "lang": "en"
        },
        {
            "review_title": "A sweet and bitter love story",
            "content": "'Jules et Jim' is an unusual and complicated love story. It's not the typical love story we are used to see in other films, this one is about a love triangle. Okay, love triangles are not that uncommon in romantic films, but here things are taken to another degree.Although the film is called 'Jules et Jim', it centers around Catherine as much as it does on Jules and Jim. Jules and Jim are friends and share the love for the same woman, Catherine (a carefree and very complicated woman who can't decide what she wants or who she wants). Both men know what she is like and both suffer with this turbulent relationship that leads nowhere, but somehow they see something good on her and they just can't seem to make it without her.However, Catherine is more complex than this. Near the ending, we get to know how crazy she really is. And that ending is absolutely unexpected and shocking. Her insanity goes way too far.This is a different movie and different from other Truffaut's works but somehow it could only have been made by Truffaut. The cinematography is pure Truffaut. It has some camera angles and sights which not even 'The 400 Blows' has, but both are marvelous on this. However, with a difference: in 'Jules et Jim' some of these scenes happen too quick, while in 'The 400 Blows' we have more time to appreciate the cinematography.The musical score by Georges Delerue in 'Jules et Jim' is evocative and wonderful, being as beautiful and as memorable as the soundtrack from 'The 400 Blows'.Oskar Werner and Henri Serre are superb as Jules and Jim, respectively. Jeanne Moreau too is splendid as Catherine, the strange love of Jules and Jim's lives.",
            "review_date": "2011-04-20",
            "lang": "en"
        },
        {
            "review_title": "The stylish, sexy sixties. You don't have to be a chunky knitwear fan, but it helps.",
            "content": "Adapted by Truffaut from a (presumably very long) book he found in the flea market, a reminiscence of a pre, during and post-WWI love pentangle. The archetypal sex roles are reversed here; Jeanne Moreau is an inconstant, flighty, capricious, sexually incontinent, self-obsessed nutjob - but she's a woman, whereas the men all seem to be romantic, noble, and terribly calm about this jezebel in their midst. Perhaps they can't believe their luck. The bipolar Paris strumpet Therese (the cigarette blower), who asks men for a ciggy, then if they can put her up for the night, is a bit of light relief (geddit?)Truffaut did things in this film that directors have copied throughout the last what, 58 years? - and are still doing today, possibly without realizing where they came from. Good things, that is. There are some exquisite locations, rotating-dialog shots, interesting stop-frames, etc. Some good (secondhand) battle scenes, and even some serious character development, Jules in particular.There are also some bad things, mainly the way that Catherine (Moreau) seems to base her daily decision of which man to live with on whether he can get her pregnant or not, as you do, ladies. If this is female empowerment, give me old-skool sexism. What happened to Petite Sabine, btw? Not so much a plot hole, more a missing person nobody missed at all. (SPOILERS) Till the funeral.And If I were Jim, I wouldn't have got in a car driven by an unstable woman who I haven't seen since she pulled a gun on me a few months before anywhere near a ruined bridge. Perhaps he thought he was doing Jules a favour. Yes, that's it.Nice song in the middle.",
            "review_date": "2019-05-15",
            "lang": "en"
        },
        {
            "review_title": "Idyllic menage a trois",
            "content": "There are certain people whose death strikes a chord for you. Of course, those who were alive at the time,particularly those in the western world, will always remember when they first heard of John F. Kennedy's assassination, . Among those deaths which struck me were those of John Lennon, Marvin Gaye (particularly given the tragic nature of his death), and Francois Truffaut.I had just moved abroad on a work contract and, while at lunch the day after I arrived, I caught the headline in the \"New York Times\" announcing his death. I saw it as a particular tragedy, both because of his relative youth, and also that never again could we have the prospect of another \"Jules et Jim\".I first saw \"Jules et Jim\" in the late 1970's on television.It was a time when I was really only beginning to appreciate film, particularly foreign film. Previously there had been a disdain among friends and colleagues for foreign film, particularly given the difficulty in reading the subtitles. Westerns, thrillers, \"Carry On\" films(!) had been a staple diet for me in my schooldays and to admit to liking a foreign film, never mind a romantic foreign film, was akin to admitting a liking for quiche.How should I begin to describe its appeal to the uninitiated.Well, of course there's the wonderful story; the almost idyllic menage a trois set in the years around World War I where first one then the other male appears to hold the upper hand; the wonderfully appealing performances of the three leads; the magical period look so wonderfully delineated by cinematographer  Raoul Coutard; the marvelously evocative complementary music.And there's Jeanne Moreau!!. At a time when the permissive age had well and truly arrived in Ireland it might have seemed perverse to be so infatuated with a woman who showed so little. And her character might even have seemed to veer dangerously close to Women's Lib assertiveness. (But she just stayed on the right side of the fence!).But even the male characters were appealing. And they were almost childlike in the way they facilitated each other's romantic desires. And Truffaut was the master conductor in the way he ensured that every constituent part excelled and the way he tugged at the heart-strings. I think you get the message. It's a flawless film. They used to say that \"Casablanca\" was a great film where if you separated out all its components you would be mystified as to how they all gelled so well. With \"Jules et Jim\" there's no cause for mystery.Of course he made many fine films both before and since: \"400 Blows\", \"Shoot the Pianist\", \"Day for Night\", and the Antoine Doinel series of films.Even \"The Last Metro\" allowed one to maintain hope. And he even helped to draw out Hitchcock so we could better understand that master of suspense.I remember buying the novel from which the film was based in a second-hand book store some years ago but I still haven't got around to reading it. Somehow, I don't think the interpretation I would derive from reading the book could improve upon Truffaut's.",
            "review_date": "2000-06-20",
            "lang": "en"
        },
        {
            "review_title": "Memories, of the way we were",
            "content": "One of the hallmarks of a great filmmaker is the ability to unite style with substance. Truffaut does this in this film with amazing dexterity. One of the main themes of the film is they way in which we idealize our youth. The earlier scenes in the film are extremely light, energetic, and carefree. That is the way the narrator, Jules, remembers them. Even though there are sad moments, and moments of foreboding, he, and we, still see them through a pleasant lens. The later scenes in the film, though less flamboyant, still have a sense of optimism and joy. This is a film that was exciting to watch. Jules and Jim are the center of the film. It is their enduring friendship and the conflict that Catherine brings to it that makes the film. They both know that Catherine is not good for them. They do everything they can to convince themselves that maybe she will change, or that possibly everything will work out well for them. Like so many people in their youth, they are overly optimistic. Yet their bond never falters. We feel sorry for them, and yet we get frustrated with them, as we see Catherine is never going to change. Rather, she is not going to stop changing from each moment. She reinvents herself every moment, while Jules and Jim are trying to establish themselves. Much like The 400 Blows, the ending is very poignant without being sentimental. It was inevitable that the film would end the way it did.",
            "review_date": "2006-09-19",
            "lang": "en"
        },
        {
            "review_title": "What's up with the sound?",
            "content": "Watched this in dizzy anticipation, and was thus not anticipating the wooden acting and dull script, but the showy direction was perhaps more predictable. I was totally baffled by the sound, however - what was going on here? Clearly the whole film was post-sync'd, with no location coverage at all. But it was terribly dubbed, with lipsync way out, very loud artificial foley work, many effects missing altogether and many more totally inappropriate. The legendary fall and swim in the Seine sounded like splashing in a bath; applause at a theatre sounded like 3 people clapping. The net effect was like listening to a bad radio play with vaguely illustrative pictures slapped on top.Was this horrible sound design intentional for some new-waveish reason? Or was it a victim of primitive technology... and if so, why did Truffaut not want to use location sound like everyone else?",
            "review_date": "2007-07-31",
            "lang": "en"
        },
        {
            "review_title": "Degenerates the movie",
            "content": "I picked this movie from the list of greatest movies of all time and I'm highly disappointed. This is not my first French movie and I'm glad it is not the case because if it was I would be reluctant to watch another French movie from the 60s.None of the characters are likable. Score is just whatever. There are a lot of movies made on complex relationships and this is not one.",
            "review_date": "2021-01-21",
            "lang": "en"
        },
        {
            "review_title": "inverse Julien Sorel",
            "content": "I think that even if Jules et Jim was not the best work of Truffaut (my absolute favourite is Fahrenheit 451) it's maybe the most beautiful and touching film ever made about love and friendship. As Truffaut is such a personality in filmmaking as he does not need my support. Let me write down here that I've seen this film five times and I couldn't ever help crying. The story was a tragedy of three people. I think that this film is the most beautiful film ever made of friendship....",
            "review_date": "1999-05-23",
            "lang": "en"
        },
        {
            "review_title": "Artistic but relatively shallow",
            "content": "It's got some interesting direction at times and it's certainly an artistic work, but the story is fairly mediocre and the characters aren't all that appealing. They're certainly developed well, but the audience is really not given anyone to root for. I guess that's the point of the film, but it definitely makes it harder to watch. There's really no story to speak of, just a love triangle over the years, and, though that usual doesn't bother me, a bit more something to sink my teeth into would've been nice. The abrupt shift from light to dark tone is startling, but it works, and the tragic ending is certainly befitting of that. Truffaut proves he can be just as artsy as Godard, too; after the relative realism of The 400 Blows, this one is just as stylish as Breathless. Overall, it's not great, but it's definitely worth a watch.",
            "review_date": "2007-10-12",
            "lang": "en"
        },
        {
            "review_title": "So-so melodrama",
            "content": "It's a bit difficult, watching this in 2020, to understand why it's considered to be a landmark in the history of cinema. This is a fairly straightforward love triangle melodrama, with a plot that hinges entirely on the extremely familiar plot device of the irrational, thoughtless, destructive yet mysteriously entrancing woman in the middle. Self-conscious camera and editing gimmicks (freeze-frames etc) may have looked revolutionary in 1962 (although, somehow, I doubt even that). Now they look like the kind of jejune tricks that film school teachers mercilessly kick out of their first year students. There are engaging performances from the male leads, especially Oskar Werner, but poor Jeanne Moreau is given nothing to do except sulk, show her profile and behave erratically.",
            "review_date": "2020-04-07",
            "lang": "en"
        },
        {
            "review_title": "Many Fine Moments, But Its Length Caused me To Lose Interest Eventually",
            "content": "A film about a remarkably unusual friendship. Jim and his friend Jules both develope a fascination and ardent love for Catherine, who posseses an unconventional attitude towards relationships. As the film progresses we also discover that she is somehow mentally imbalanced as well. To be sure the movie has many fine monents, but for me personally, it seemed to go on for too long and eventually I lost interest in their menage au trois. Even it's tragic ending seemed sonehow inconsequential.",
            "review_date": "2020-05-16",
            "lang": "en"
        },
        {
            "review_title": "Recommended, but you must like French cinema",
            "content": "Overall, I liked the movie.  The movie is about love, but my take is not involving the woman, but between the two male friends. That's why it's called Jules et Jim, and not Catherine and Two Guys.  Some of the editing I found to be choppy, maybe Truffaut was still learning.  I found some of the \"freeze-frames\" to be gimmicky as well.  The acting is absolutely outstanding, and you feel you're watching real people.  Some good imagery involving a character walking downhill in the last shot, a burning dress, and a destroyed bridge.  Recommended.  8/10.",
            "review_date": "2001-09-21",
            "lang": "en"
        },
        {
            "review_title": "A flawed classic of French cinema",
            "content": "Why this is considered a masterpiece is beyond me, most of Truffaut's other works are much more engaging and beautiful. However, a good film nonetheless, which tells of the relationships between artistic and thoughtful bachelors, German writer Jules and Parisian friend Jim, and Catherine, whom they both become obsessed with and at times romantically involved with. Actually, is it really romance? Catherine seems uncaring, free spirited and neither man succeeds in truly capturing her heart. To be honest, I don't see why they try. She's pretty annoying, very selfish and awfully 'kooky'. That's not to say Jeanne Moreau doesn't play the character well. She does, very well. However, I seem to have missed something about the character herself. Equally irritating are the two male leads. Pretty pathetic characterisation overall, to be honest, lacking in any psychological development and overall feeling incredibly vague. Yet, this film is saved by the presence one individual, Francois Truffaut. There is of course great music and photography, but Truffaut's exciting camera-work and exploration of cinematic techniques are truly riveting. Truffaut is the one who pulls the emotional punches of the film, not the actors. A flawed classic.",
            "review_date": "2012-05-12",
            "lang": "en"
        },
        {
            "review_title": "Some great and memorable images but a story that lost its way",
            "content": "I enjoyed a lot of the cinematography. Many scenes were very well choreographed and filmed. I have seen some stills from the film on posters and the like, and they are very appealing.But after about an hour I became increasingly bored with the story, which started as whimsical and fresh and then became dreary and repetitive. I could not complete the film at one sitting and did not really enjoy the second sitting.Although I liked the scene in which a woman Jim knew from the past updated him on what she had been up to since they last met. I thought her narrative of that was very funny and was well told.Owen Wilson has aged well. He still looks pretty good today, but he wore better hats back in the day - particularly the one Jim made him change on the basis that it was not sufficiently French.",
            "review_date": "2022-09-09",
            "lang": "en"
        },
        {
            "review_title": "I'd rather watch Rosie and Jim",
            "content": "Come on, no one witters on like this. The dialogue comes across like a 14 year old attempting to write something in the style of Shakespeare, the trio come across like Mavis,Derek and Victor from Coronation Street in the 1980s and the whole thing is just so pretentious in a way that only French cinema can be. I can't believe that this is from the director of the 400 Blows, which is brilliant. At least 2 of the 3 have the decency to die.. Your eyes and ears deserve better.",
            "review_date": "2022-04-24",
            "lang": "en"
        },
        {
            "review_title": "All the charm--and smugness and deceit--of the Sixties",
            "content": "Yes, Jules and Jim is a mesmerising, invigorating movie, full of life, love, happiness, sensuality, charm, and, not only that, it's French! But Truffaut's most famous film is not just ooh la la--it's an enormously sophisticated work, with a witty script and playful, daring camera work. In a way, it's THE film of the Sixties--a bit ahead of its time, for what we mean by \"the Sixties\" got going a few years later.But do I love it? No. Because the film also encapsulates, for me, what I so greatly disliked about the Sixties, the time in which I became an adult.The film was received with rapture, except by a few critics, including Dwight Macdonald and Stanley Kauffmann, who called it \"less than meets the eye.\" They were denounced by Pauline Kael, queen of the hipsters, for being squares. And yet, today, who looks like the square--if by that one means someone insensitive and naive? Kael was normally clear-eyed, but, in her enthusiasm for the movie's spirit and technique, she bought a cynical fantasy, the one aimed at a young, educated, restless public.You see, in the Sixties the great thing to be was not intelligent or rich but \"creative.\" I put it in quotes because the appearance of creativity often received the same adulation as the real thing. It was a time when the art scene started to go wild, when the business of covering yourself in paint, or whatever, and rolling on the floor was acclaimed. If you weren't genuinely creative, you had to get some way of faking it if you wanted to get respect, or laid. Women, of course, had an easy substitute for creativity. They could be selfish, capricious, inexplicably cruel or untrustworthy, and be acclaimed as their own great creation--marvelous, mysterious, incomprehensible WOMAN. (That is, of course, if they were good- looking; otherwise, someone who pulled these same stunts was just a nasty bitch.) This all happened before feminism, when it became fashionable for women to be serious, responsible grown-ups.So Catherine, in the movie, is WOMAN to the nines. But, even though she is very beautiful, she is still a nasty bitch. Surely a major aspect of WOMANliness is motherhood? Well, Catherine has a little girl who adores her, but she abandons the child for a lover (farewell scene not shown, and little girl never seen again in the movie--might it prejudice us against Catherine?). Then she abandons the lover when she is bored-- or thwarted. If she can't get her own way (even though the man is doing the right thing, or it's not his fault), someone has to pay for it.It is commonly said that suicide is an act of anger. This couldn't be more obvious in the case of Catherine, who, in the act of killing herself, drags an unwilling lover to his grave. Talk about wanting to have the last word! This is no starry Liebestod but petulance writ large.Jules and Jim may be based on a novel, but Truffaut's attraction to the material, as well as his recapitulating it twenty years later in The Woman Next Door, shows that the fantasy is very much his own. His immature, masochistic passion for this kind of woman was sad, but his presenting it to young, impressionable filmgoers as an enviable romance, with added culture (at one point they all read Goethe's Elective Affinities, also about a threesome) is wicked. The first thing about love is that it is UNselfish.",
            "review_date": "2017-08-19",
            "lang": "en"
        },
        {
            "review_title": "The love for three.",
            "content": "Two friends fall in love with the same woman, who returns their devotion. One of the most beautiful of Truffaut's films, this is a subtle chronology of a love triangle, brightened by a dazzling Jeanne Moreau who sings the unforgettable \"Whirlwind\". One can never grow tired of this film.",
            "review_date": "2001-08-19",
            "lang": "en"
        },
        {
            "review_title": "Flawed, or just too cerebral for me?",
            "content": "Version I saw: UK DVD release (subtitled)\nActors: 7/10\nPlot/script: 6/10\nPhotography/visual style: 7/10\nMusic/score: 7/10\nOverall: 6/10I watched this one back in 2017, not long after the death of star Jeanne Moureau. In the past, I have found legendary nouvelle vague director François Truffaut to be always interesting, but not that enjoyable.\n'Jules et Jim' takes place in the cosmopolitan western Europe of the early 20th century, either side of the First World War. The German Jules (Oskar Werner) and Frenchman Jim (Henri Serre) are friends pursuing art and romance in Bohemian Paris, where they meet and both fall in love with the quixotic Catherine (Moreau), an early prototype of the 21st century's 'Manic Pixie Dream Girl' trope. After some hijinks together, they are separated by the War, and when they reunite are burdened by the cares and complications of adulthood, to the anguish of all concerned.\nAlthough it characterises the Bohemian times in which it is set, I found it was also very 1960s: 'Free Love', hedonism (including implications to my eyes of a sexual relationship between Jim and Jules too), but also reserved. I can play around, but you can't. We can have fun when we are young, but later we want to settle into a nice, traditional, monogamous family with kids and a house. The film is all about what happens when these clash.\nI don't think I caught all the subtleties in the script - it felt like they were there, but I could not tease them out. What I saw was a very simple, quite well-worn story about two guys getting dragged around by a woman who knows she is beautiful enough to get whatever she wants... right up until the things she wants contradict each other. While the others analyse their feelings, and agonize over the right thing to do, she keeps living on her whims, and that left her seeming like a much more two-dimensional character to me.\nIt doesn't help that the film makes extensive use of voice-over. Maybe it was meant to clear up the surface themes and leave the mind free to focus on deeper ideas, but it seemed to me more like it was telling me what to think.\nIn a lot of areas, Jules et Jim is excellent - the music lilts along at the start, drawing you into the story with a pacy narrative. All three leads are excellent. The photography is stylish and moody. And yet it never quite knit together, for me. I felt like there was something missing. Maybe it was there, but I am not clever enough to recognize it, but in the absence of that, I can't say I can feel much love for this film.\nJules et Jim has garnered praise from many sources over the years. I'm glad. I think it probably deserves that high regard. Unfortunately though, that high regard is not going to come from me.For my full review, see my independent film review weblog on Blogspot, Cinema Inferno.",
            "review_date": "2020-12-18",
            "lang": "en"
        },
        {
            "review_title": "Chaotic \"classic\"",
            "content": "I had just seen Francois Truffaut's terrific film The 400 Blows and therefore had great expectations when I saw this film.  What a disappointment!  I came away feeling completely baffled and unmoved.  Why this film is considered a classic of the French cinema I'll never know.The story is about two friends, Jules a German, and Jim a Frenchman, and their relationship with Catherine, a woman to whom they are both attracted to.  The story covers their relationship from before the First World War to the rise of Nazi Germany.I didn't much like Jules and Jim.  They were both irresponsible womanizers and were disloyal even to each other.  I liked Catherine even less.  She was contemptuous towards everyone and used everyone around her.  I was annoyed when Jules kept telling her that he would love her no matter what she did to him.  How does Truffaut expect to build a sense of tragedy when we don't care about these people?  I found myself wanting to bang their heads together.Incidents occur which seem to have no baring on the plot.  When the war arrives and Jules and Jim find themselves on the opposite side of the trenches, Truffaut devotes only a few minutes to the war and absolutely nothing to the psychological effects on Jules and Jim.  After the war their friendship resumes as if nothing had ever happened!  Truffaut might just as well have cut this entire subplot.  Another annoying thing, Truffaut rushes the film along at top speed as if he is afraid to slow down.  To fill in the gaps, he uses intrusive narration to tell us everything that is happening and what the characters are thinking.  Why not simply slow down and show us what the characters are thinking.It's a bad sign when you find yourself cheering at the film's supposedly tragic ending.  I realize I am opening up myself to controversy by lambasting an established classic, but I have to review what I saw.",
            "review_date": "2002-05-27",
            "lang": "en"
        },
        {
            "review_title": "Beautiful, poetic and enigmatic work mirrors its female protagonist",
            "content": "François Truffaut's enigmatic romance was made at the beginning of the swinging sixties and tells the story of a triangular love affair between a Frenchwoman, Catherine (Jeanne Moreau),  a Frenchman, Jim (Henri Serre) and an Austrian, Jules (Oskar Werner). The film seemed to capture the radical spirit of the times in which it was made although the story takes place in pre- and post-World War I France and Austria.It tells the tale of how three friends try to live lives unshackled by convention in France before the outbreak of World War I. The Bohemians, Jim and Jules are inseparable companions and when they both fall for the same girl (they compare her to a Greek statue), the vivacious but enigmatic Catherine, their friendship, remarkably seems to be unaffected. An idyllic period comes to an end when Catherine agrees to marry Jules on the eve of World War I (Jules is helped by Jim's act of gallantly standing aside when Jules asks that the two men \"not share everything\"). After the war, when the two men fight on opposing sides (each dreading the prospect of meeting the other in combat) Jim is invited to visit the couple in their home in Austria and is surprised by Catherine's invitation for him to resume their amorous liaison. Jules apparently consents but we begin to realize that Catherine is frustrated in her marriage with Jules and has already wreaked sexual \"revenge\" on Jules on previous occasions. Jim feels confused when she appears to return to Jules's bed and thinks that Catherine may be using him. He returns to France. After some time Jules suggests that Catherine divorce him and marry Jim - reasoning that this will be the only way in which he will be able to remain near her - but Catherine becomes jealous when she learns of Jim's mistress. One day Jim is persuaded by Jules to come to the couple's house, in France, where Catherine insists on driving both of them to a surprise destination.....The film was technically very innovative employing many of the techniques associated with the French New Wave, including mobile cameras, quick cutting, overlapping scenes, slow motion and freeze frames, yet they are so skillfully used that we almost never become consciously aware of them. It is also remarkable in portraying the happiness of friendship and the excitement of young love while also perceiving the self-deception of the protagonists. François Truffaut directed the film using an adapted script that he had co-written with Jean Gruault from a novel by Henri-Pierre Roche. The film also benefitted greatly from the beautiful melodic score by Georges Delerue and the interpretation of Jeanne Moreau, who probably gave the finest performance of her career in this film.It has been said Truffaut, a notorious womanizer in real-life who made many films attacking conventional morality, made the film as a defense of monogamous relationships. The film's vision seems too pessimistic to admit this. I believe that the tempestuous and apparently fickle Catherine, in reality, wanted a surprisingly conventional marriage and for this reason she married Jules, apparently the more conservative of the two friends. When Jules could not be the masculine protector that she wanted, she attempted to change him through her constant sexual \"revenges\". Far from enjoying this, I think she was humiliating herself as the only way she knew to provoke the implacable and calm Jules to become jealous and protective. When all of her attempts failed she entered into despair.Thus, Catherine is driven to her act of self-destruction, taking Jim with her. In a sense, Jim represented all of the lovers with whom she had humiliated herself to try to change her man. The film  thus contrasts the fundamental incompatibilities and lack of communication that seem to plague conventional relationships with the enduring qualities of friendship. Although Truffaut directs with verve and feeling he seems to have created a beautiful and poetic work, as enigmatic as its amoral female protagonist, Catherine.",
            "review_date": "1999-04-25",
            "lang": "en"
        },
        {
            "review_title": "Lighthearted? Idyllic?",
            "content": "I watched this movie last night, and just scanned the comments on this database about it and am left feeling perplexed. The word lighthearted pops up quite a bit (including on the back of the actual video) and this strikes me as bizarre. This movie was about three pathetic, spineless, irresponsible adults. Is that lighthearted or idyllic? Two men so infatuated with this heartless fickle woman that they bow to her every whim? So lost without her \"love\" that they live in this state of emasculation sharing her with eachother and every other man who crosses her path? And betraying promises left and right? No human being could be truly satisfied with this kind of relationship. It is at its core biologically incorrect and thus psychologically incorrect. To tolerate this kind of relationship each character would have to be drenched in a lack of self worth. It is fine to film a movie about such characters as long as the correct value judgements are placed on them and judging by the actual film and the response to the film I would say that Truffault failed to do that. Or he feels that this is fun and healthy as well, which makes it even worse. Terrible.",
            "review_date": "2000-08-10",
            "lang": "en"
        },
        {
            "review_title": "Heartbreaking Finale",
            "content": "Its a film such as Jules Et Jim that convinces me of Francois Truffalt's status as the best of the directors from the French New Wave.  What I love about the movie is the complex and tragic threesome relationship of Jeanne Moreau, Henri Serre, and Oskar Werner.  Jeanne Moreau stands out in an emotionally forceful performance that gives the film its romantic gothic feel.  Part of the film is a lot like the stories of Edgar Allen Poe.  Based on a novel by the same author who wrote Two English Girls which would later be adaptated on screen by Truffalt.  The final scene was shocking when I first saw Jules Et Jim because I expected for the film to be a light romantic comedy with some dark overtones.",
            "review_date": "2001-08-30",
            "lang": "en"
        },
        {
            "review_title": "A Woman of Destruction",
            "content": "This early film has provided a strong basis for the future development of filmmaking. The scenes are beautiful and the use of camera is sophisticated. The plot is quite simple. However, the intimate friendship between the two men is touching. Catherine is a woman of destruction. I will put my sympathy on Jules.",
            "review_date": "1999-02-13",
            "lang": "en"
        },
        {
            "review_title": "The Second Best François Truffaut film",
            "content": "I loves this movies, because this is quite to be my favourite French New Waves film and I love French New Waves movies and I love Jeanne Moreau performance in this Movies She was very beautiful.",
            "review_date": "2022-01-05",
            "lang": "en"
        },
        {
            "review_title": "; Mandatory for film class",
            "content": "Jles and Jim is alternately fey, elegiac, childlike, autumnal, poetic, depressing, creepy (cremation and its allusions to Nazi Germany), melancholic, sophomoric, and very French (i.e. in the midst of all the emotional turmoil, Moreau doesn't forget to cleanse her makeup off before going to bed with Jim, and Truffaut lingers on the image) One perhaps may be more predisposed to its Gallic charm if viewed when younger in college, at an art house theater, then when introduced to it later in life. Much like \"It's a Small World Afterall\", its hard to get Catherine's song out of your head (not sure if this is a plus or not), and the score in general really gives the film its alternate currents of sadness and joy, and is very haunting and even ominous. The three leads are good.",
            "review_date": "2006-09-22",
            "lang": "en"
        },
        {
            "review_title": "Rate it 10+ for evoking an era",
            "content": "I first saw \"Jules and Jim\" when it was brand new, in Paris--without subtitles, of course--when my French was very rudimentary.  I must have understood 5% of the dialogue and I loved it anyway, for its stunning photography, music, and general ambiance.  I've seen it maybe 10 times since and it never fails to move me for the way in which it defines and exalts a friendship, and makes me wish I might have been able to spend time in Paris before World War 1.  The three leads are all wonderful the settings are luminous, the use of stock footage highly effective, Georges Delerue's music lovely...am I losing my objectivity here?  So what?  Truffaut made a number of superb films but this remains my favorite.  The tone is elegiac, and never descends into mawkishness, even at the end.  Just writing this whets my appetite for another viewing.  I also think that Jeanne Moreau's look in this film started a fashion trend, but my memory is a  bit tentative on that point.  If you've never caught this film, check it out by all means.",
            "review_date": "2000-05-09",
            "lang": "en"
        },
        {
            "review_title": "Don't look too hard for meaning",
            "content": "What pseudointellectual garbage. If you watch this film and want to pull your eye out, because of the disastrously monotonous rhythm or the flat one-dimensional emotionless acting, whether by design or accident, it is perfectly normal for you to do so. Sometimes there's no hidden meaning or allegory, sometimes there's no underlying Godard-esque meaning.",
            "review_date": "2020-11-03",
            "lang": "en"
        },
        {
            "review_title": "\"Jules and Jim\"...(And \"The Whore\")",
            "content": "\"Beautiful\"? \"Charming\"? These are some of the words I've heard in people describing this movie. Umm, are they all stoned? This movie is beyond horrible. The acting isn't that bad, I'll give this movie that. The story...good idea, badly, stupidly done. The woman, I forgot her name, lets just call her \"the whore\", is a total nutcase. And the guys don't seem to really mind it so much. 2 best friends basically both fall in love with this girl, but don't worry, they each get their turns quite the number of times. A perverse love triangle forms and Jules and Jim take their turns on who should love her which day of the week.(Not really but it seems that way) And others have their shot at her as well. She cheats on both of them with other guys and then cheats on them with each other and then Jim cheats on her too but again, don't worry, according to \"The Whore\", in order to have a relationship work only one of the couple has to be faithful...huh? Yeah, words of wisdom coming from the sex addict. Then is she pregnant? Not pregnant? Then with who?...Or what? (Sighs) The most annoying part was how they could so easily forgive each other for being whores ALL THE TIME. It was so frustrating seeing this. The camera work sucked...the editing was highly questionable. And the last...maybe 20m of the film was a complete joke, see it for the laughs, trust me. \"The whore\" just snaps and pulls a gun on Jim and then Jim turns into Superman and in one motion takes the gun from her and LEAPS out the window landing on both feet. THEN about a minute later all 3 of them are HAVING TEA TOGETHER! Like nothing happened! Like there wasn't an attempted murder that occurred. THEN to top it ALL off she invites Jim (the person who she tried to MURDER) in her Car. Then, Jim, being the completely naive, if not down-right retarded gets in the car with her! So, of COURSE she Kills him! But the best part is she kills herself as well, thankfully. She drives the car off of a bridge. Again, Jim didn't seem to mind because he loves her? Wait, which day of the week is it? So she drives the car, looking like it's in neutral, slowly makes it's way to the end of the bridge and falls over, thankfully putting this \"love(?) story\" to an appropriate end...Death. Jules is alive though. He watches this happen and...he too, doesn't seem to mind. Then they showed both of them being cremated, which was a little out of place but hell, sure, throw that in the movie too, it really couldn't get any worse. I'm sure if they had a sequel to this movie, \"Jules and Jim\" (and the Whore), it would involve Jim and \"the whore\" coming back from the dead as ghosts who still cheat on each other with other ghosts! Aaaand of course old reliable Lenard Maltin gave this movie 4 Stars. All I have to say is this is Mystery Science Theater at it's finest.",
            "review_date": "2004-11-16",
            "lang": "en"
        },
        {
            "review_title": "One of my favorites, one of the greats.",
            "content": "Jules et Jim is truly among the greatest films ever made.  Truffaut's masterpiece bursts with energy and love of his craft, and the characters are truly wonderful.  This film is great in every possible way.  The type of work everyone should experience.",
            "review_date": "2000-04-28",
            "lang": "en"
        },
        {
            "review_title": "Shrug begets shrug",
            "content": "Is real life this whimsical, this airy, this bewildering and amoral, this grim yet carefree, this stilted yet lyrical?  Etcetera?  No.  Not my life, anyway.  Does that mean I can't enjoy a movie that's all of those things? No, I can enjoy it, but I have to raise one eyebrow at the people who gush about how close to their hearts this is.  Likewise I reserve the other eyebrow for the people who proclaim this to be genius.  It felt to me like a little pencil doodle - it might have had charm when it was tossed off, but hanging on the wall in the museum it gives me pause.  Yes, it works out a little world that is neither escapist nor realistic, neither sugary nor bitter.  It just floats there.  Is that what we're meant to applaud?If I detected it saying anything, it was saying things no less trite than the things it was apparently trying to be fresher and freer than...and if it genuinely wasn't saying anything, then all it achieved was a kind of sustained existential shrug, which doesn't impress me.  If I had just flipped to this on TV without knowing anything about it, perhaps I'd have been amused by its flavor for the duration...is that all they expected?",
            "review_date": "2002-02-20",
            "lang": "en"
        },
        {
            "review_title": "Unbelievable",
            "content": "This is the stupidest movie I've ever seen in my life. I have no clue why it would be praised or regarded as a great French film. I watched it because I saw good reviews and I saw this film listed as one of the best French films of all time. I study French and like to watch French films. There are many French films I like. But I can't for the life of me understand how anything in this film makes sense or has any artistic or intellectual value. Especially as a female this film bothers me because the female I suppose \"protagonist\" is an egocentric nutcase who *spoiler* also I guess turns out to be a psychotic murderess. Why on earth would any man fall in love with this Catherine character? Any real man or woman or intelligent human being would readily identify her as a complete and total floozy. I was hoping that at least there would be some interesting historical perspective on WW1 but really there is nothing noteworthy regarding that major historical event in this film. In fact the two male characters apparently not bothered at all by their wartime service??? Really unbelievably stupid movie. Should not be taken seriously in my opinion.",
            "review_date": "2022-05-09",
            "lang": "en"
        },
        {
            "review_title": "Stretching the definition of greatness",
            "content": "Excellent, possibly, but not great in context of film of the period. Few might, but I would rank Shoot the Piano Player over Jules et Jim (while virtually no one would argue The 400 Blows).That's just Truffaut. Then consider Godard's Breathless, or even Contempt. That's before mentioning Fellini: 8 1/2, La Strada, La Dolce Vita.For film buffs today, the Italian Neo-Realists (and post) and the French New Wave represent the most prolific period of innovation in film, driven by creatives who rejected most of what they saw in contemporary \"manufactured\", dumbed-down films. American film was at its nadir as the studio system was plummeting on miscalculated automatic pilot.Jules et Jim feels like a pulling back, a reaction on Truffaut's part to the failure of Shoot the Piano Player to match The 400 Blows with critics or audiences. This, his third film, contains some of the spirit of his earlier work, of Godard and Fellini, but fails to lift beyond, to be an evolution, much less another salvo in the revolution.Yes, it was controversial for its content. Jeanne Moreau matches the best of American actresses (as in an apt comparison to Bette Davis on the overall dreadful DVD commentary). Raoul Coutard's cinematography is the fourth lead actor of the film. There's very little to criticize, in fact.This film is enjoyable for many reasons, and required for devotees or students of film as art.But greatness? Even in its time and context, many more foreign and some American films surpassed it. Hitchcock and Welles, even Kubrick were already on stage.While worthwhile, it doesn't rank with those films that changed film, or culture itself.",
            "review_date": "2007-05-26",
            "lang": "en"
        },
        {
            "review_title": "charming",
            "content": "The reason why Katrine is charming is not beauty and intelligence, but that it is not easy to control. Such a woman will only belong to herself, and will not allow her \"ownership\" to leave on her own",
            "review_date": "2020-06-24",
            "lang": "en"
        },
        {
            "review_title": "I didn't like it at all.",
            "content": "I don't think that this movie can be recognised as a good film, it's only decent. It's empty, there's no emotion neverthless love is the primary subject. Only impulsivity has been represented. A simple example are the 'Come here, I love you more than anything' by Catherine and the instantaneous 'Ok' by Jim despite all the plot developments.Good directing, good acting. Poor Script. It is ripetitive, predictable and I just cannot see a direction, I don't know where it wants to go.A movie about a flat love triangle.",
            "review_date": "2022-04-06",
            "lang": "en"
        },
        {
            "review_title": "Interesting influence.",
            "content": "I was pointed in the direction of this film by many fellow film enthusiasts. Most suggested that it is a \"brilliant piece of cinema\", with \"unlimited influence\" on the films that followed. I wasn't \"a real film fanatic\" until I had seen it. Of most of their comments, I would agree. I would change the 'brilliant' part to 'interesting' however.On watching the film, it threatens to become a true cinematic gem within the first 30 minutes, but somehow it never quite delivers.The pace of the opening falls away and is replaced by a plodding life journey - the dialogue at times becoming both pretentious and absurd. Some might feel that this film is beautifully realized in all of it's aspects and although the camera-work and editing are indeed ground-breaking and exceptional, I was let down by a plot and acting that were not just dated, but also ill formed.Too many film fanatics have romantic views of the influence of the European classics. They should try to remember that influence doesn't always mean greatness. The film is interesting, but it is rarely anything more. That said, those who are serious about film, should see 'Jules et Jim' for its unquestionable influence on cinema.6 out of 10",
            "review_date": "2004-10-27",
            "lang": "en"
        },
        {
            "review_title": "Cool Movie: Not Sure if I'd see it a Third Time, though. :))",
            "content": "Suphie Wesner 10/08/2012 Jules and Jim Movie Reviews, all by François TruffautThese three movies are all hall-marks of Truffaut's classically appealing style; somehow, whether in color or in black and white, Truffaut always manages to \"get it right.\" What we mean by this is, he either chooses really charming characters who win our hearts (and minds), or he has interesting and intriguing (unusual) story-lines, or, indeed, Truffaut just simply has good ideas to write about (let's face it, though, he simply does, sometimes, use a lot of the same themes, about love, married women, and threesomes, though, not in a sexual way)... In Jules et Jim, this interesting, intriguing, film with charming characters, albeit a really downer ending and theme (kind of a Romeo and Juliet type thing; a woman scorned who goes to the last extreme to avenge herself of the death of her lover's love for her, a murder-suicide), really pulls us in with its starting premise; a lonely blond woman, named Therese, must face the facts when her abusive, drinking, though, at least politically motivated (anarchist) husband, screams at her and she considers that the last straw. In general, too, we find that the movie has a lot of good moral qualities: we see that, though this woman basically \"shares\" these two men, she toys with their hearts minimally, and genuine love is valued a lot. Indeed, we see that she \"goes for\" Jules, the German-looking Frenchman, while Jim is sort of her lover on the side. It is a complicated piece by Truffaut, set in the 1800's when trains were still all the rage, the can-can was coming to the fore of the entertainment scene, and costumes included hooped skirts, tail coats, top hats, fancy shirt cuffs, stiff bibs, wool rags, and spats... Interestingly enough, though, we see that a woman in 1800's France was not looked down upon simply for seeing two men, this was not enough to label her a \"whore\" in most people's eyes, or they didn't know about it, and people would not look at this situation in naive shock and disbelief, like they might in more Victorian societies. Indeed, we find that Therese, and, later , Jim's wife, Catherine, enjoys equal respect from both men, something which is indeed unusual and to be cherished by any sweet, rather innocent, and popular object of another two competing people's affection. Yes, we see through this movie, Jules and Jim, the saying \"Hell hath no fury like a Woman Scorned\" brought to life in no better way possible; indeed, we realize that women like men, but in a different way, really are sensitive to having their feelings or emotions for another, scorned; when she senses this, the main character, decides to try to kill her beloved, though she loves him, right then and there. For heaven's sake, the woman, in fact, did write letters like no other to her lover, Jim, professing her love to him, passionately. He would write back but there seemed always to be the unremitting circumstances which would not permit them to marry and stay together. Jules was always the simpler of the two friends, which can mean great things, that he was less of a back-stabber, for one. So, what is the reason, here? Because he will not have her love-child, as he is in difficult circumstances at the moment, married with a child, or with another child on the way. So, we soon see, that, indeed, she is crazed enough by love and remorse to want to commit murder (she is also, generally, mentally unwell, and suicidal, to boot) with her shot-gun at her side, but, instead, she takes him for a last, eerie ride, and then drives the old Model T-, or early version of a Model T-ford off the edge of a bridge and thus, kills them, both. So we then see that, indeed, their bodies are made into ash (by having their bones ground; this interesting process is shown by the film, no less), and the two lovers love made immemorial, and forced to be made immortal, forever. The film finally ends by showing German-looking Jules (I thought he had to be German when I first saw him; shows how caught-unawares I was when first sitting through this film, I had no idea at the time, even, that Jules was a French name. This took a while to sink in, for me, as the \"s\" is suspiciously pronounced, in fact). . . . . He is left alone with his love-child from the beautiful Bohemian-woman-turned-crazy-woman, but he looks as though he shall miss his two friends indefinitely, as these were his sole, close, bosom buddies, for a long while, and they taught him a lot about life, love, and joy. The film shows that, alas, life sometimes does go haltingly, but perseveringly, on. This tale of turn-of-the-century Paris, and, indeed, sometimes, rural France, was a real winner, and a period film, at that, not to be missed. It is high drama, and high art, all in one. Acting is done by at least one famous actress, that is to say, Jeanne Moreau, and the part played by Jim, too, at least by French audiences, is relatively well-known, Oskar Werner. Jules was just played by, HENRI SERRE.",
            "review_date": "2012-10-09",
            "lang": "en"
        },
        {
            "review_title": "Truffaut",
            "content": "Truffaut was naturaly the best fit for this beatiful story, but i did expect a little bit more of \"nouvelle vague\" perfume in the last 15 minutes of this movie. The final scenes felt too long to be honest. But lovely cinematography overall.",
            "review_date": "2019-01-25",
            "lang": "en"
        },
        {
            "review_title": "Amazing direction makes a bland screenplay look like art.",
            "content": "I'll warn you ahead of time, this is a bit of a spoiler.Jules et Jim is one of the best examples of a New Wave love story. New Wave embodies the concept of a director working as an author would towards a great novel, the film is his work. Director Francois Truffaut's variety of great camera effects and subtle symbolism help to improve an otherwise bland screenplay.The film about love and what it can do to friendships and personalities. It's a tale of three lovers set in France around World War I. Jules and Jim are best friends, Jim a Frenchman and Jules an Austrian. The pair does everything together, until they are separated by a woman named Catherine. Jules marries Catherine and buy a cottage in the country. While Jim lives his life in Paris, Jules and Catherine have a daughter and begin to raise her. The movie grows repetitive near the end, as Catherine betrays nearly every many she is with as her `love' jumps from person to person.Following the concept of New Wave filmmaking, Truffaut truly is the auteur of the film. The screenplay, based on a novel by Henri Pierre Roché, is a basic French love story. Primarily based upon dialogue rather than actions, the story moves very slowly at times and very quickly at others. These sudden changes of pace done come without warning. There is an early scene with a Jim, Therese and Therese's steam engine trick, hinting that Jim may be spending quite a chunk of time riding on a train. Then there is the squeaky rocking chair in the cottage, representing the constant movement of Catherine and her desires. Perhaps the most memorable scene in the movie is Catherine's daring leap into a river. The scene is beautiful in terms of character development, explaining her seemingly crazy personality.However, Truffaut's techniques are not without flaws. For example, the fate of Catherine and Jules's daughter Sabine is never explained. Sabine is a great refuge for Jim for a portion of the film, but scenes later she disappears. Near the end of the film when Catherine threatens to kill Jim, she gets a gun out of thin air. There are no gun shops around, no foreshadowing whatsoever. Perhaps this is simply Truffaut's idea of a surprise ending, but it really seems out of place from the rest of the film.The film is quite a bit longer than it needed to be. Aside from the very end of the movie, the last hour or so grew extremely repetitive. Catherine's toying with her variety of lovers is way too extensive, almost pointless.; the men get hurt, then just keep coming back for more. This seems odd, considering earlier in the movie Catherine was described as a true woman rather than a perfect woman.New Wave filmmaking is defined in Jules et Jim. It's described by most as poetic, but that doesn't necessarily mean it's good. The creative direction makes the movie interesting at times, however the average screenplay makes it quite a boring two hours.",
            "review_date": "2002-02-19",
            "lang": "en"
        },
        {
            "review_title": "Truffaut takes love stories to its summit",
            "content": "There are many elements in this film that made me enjoy it in a special way. Objectively, I admire Truffaut techniques and the greatness of the script, but there are also personal circumstances that made me particularly enjoy certain aspects of the film. I will talk later about this. The first thing about this film is the noticeable evolution of Truffaut, either in his technique and in the stories he tells. I do not know if it is an evolution in his style, a step ahead or an experiment, but I see many changes from Les quatre-cents coups, which compared to Jules et Jim seems to me innocent, sweet, very different in style and intention.In general, we could think that Truffaut has plunged into the New Wave cinema taking many elements either from Godard and Resnais (at least elements we have seen in À bout de souffle and Hiroshima, mon amour). From Godard he takes a revolutionary approach of camera. We do not see as many floating, 'ghostly', traveling between characters as in Les quatre-cents coups, but quick, broken sequences, much more in Godard's style. The scene when Catherine's dress burns is remarkable: images run into each other, overlap, throng, just as the memories of an intense personal experience. The camera also goes on crazy close-ups -like the look of a baby looking for something- or traveling: I particularly enjoyed the one following Catherine in the race over the bridge, we could feel her breathing! Truffaut even plays with us: the camera -us- searches the ground looking for objects in the countryside: a cup, a peak, cigars. There is even a hidden wink which I think is most difficult to notice: there is a scene which is shown backwards; when the narrator is saying in the countryside house that Jim had noticed something was wrong between Jules and Catherine, we might notice that something is wrong with the image too. Last things happen first. If we look into it, we see Jim and Jules playing dominoes. But they do not put the pieces on the center of the table, they take them away from it. After that, there is a traveling rightwards; we can see the girl and Catherine: but they move oddly, they nod too sharply, specially Catherine. Just as if the scene was shown from the end to the beginning. Finally, there are some other new resources that Truffaut makes use of, like stills -of a great beauty and emotiveness-, subtitles (at the end) or black fades. If technically Truffaut owes in this film to À bout de souffle, I think he takes some things from Resnais' Hiroshima mon amour as far as contents are concerned. Although not as a poetical script as Marguerite Duras', the film by Truffaut is crammed full with literary references: Shakespeare, Cervantes, Baudelaire, Goethe -Les affinités électives, a book on the topic of sharing lovers-, even Picasso or the Chinese drama. The story is not a magnificent poem like Resnais but a magnificent love saga. Indeed, it is a great love story, in which we find all elements to be found in any love story: passion, sadness, jealous, etc. But Truffaut mixes it altogether and puts it in a single love story, a love triangle with a femme fatale and two best friends. An explosive combination that will turn up in a story with hundreds of twists and turns, thanks to Catherine's instability. Truffaut makes many different love stories happen in only one, or maybe makes a life long love story happen in a single year. This dense storytelling is made agile by the great idea of the narrator, which I enjoyed most. However, it is a counterpoint to the rest of the film, it is not a poetic voice at all, but an analytical, cold, shocking one. This film is also much about translation: both characters -and Catherine too- seem to know perfectly the language of the other, and they keep challenging each other with puns and translations, indeed both of them work as translators at some time, and Truffaut remarks in their comments the difficulty and beauty of this job; this is the part I personally enjoyed as I am a translator myself.",
            "review_date": "2000-12-15",
            "lang": "en"
        }
    ]
}