{
    "rating": 7.8,
    "release_date": "1962-09-20",
    "num_reviews": 76,
    "genres": [
        "Drama"
    ],
    "summary": "Twelve episodic tales in the life of a Parisian woman and her slow descent into prostitution.",
    "reviews": [
        {
            "review_title": "Intriguing and expressive.",
            "content": "So far in my exploration of Jean-Luc Godard I have remained in his masterful decade of the '60s, and as a result I've been treated mostly to films that are fun and exciting, toying with structure and cinematic conventions. Vivre Sa Vie fits firmly in his career, but it's also a surprising contrast to his other work which I have seen so far. Even in his more narratively focused Breathless, there's still a very cinematic quality to it, portraying a sense of freedom of expression and romanticism. Vivre Sa Vie strips away all of that and elects instead to present an almost documentarian look into the descent of the young Nana (Anna Karina, naturally) into prostitution.The structure of the film is split into twelve episodes that bring us through Nana's progression. She's a young Parisian girl working at a record shop who wants to be in the movies, but needs money to pay her rent. It's a simple story, but the way Godard tells it is what makes it so intriguing. He presents Nana as an object of desire to many but an object of interest to very few. The men around her aren't interested in what she has to say, they put up with her words in order to get to what they are really looking for, her body and ways to profit off of it.Karina's dance scene is classic Godard, but his unique approach to this film makes it much less freeing than in his other works. The dance in Band of Outsiders is a jaunty display of youthful rhythm and A Woman Is A Woman is loaded with fun numbers, but here the art of dance takes on an entirely different, and much more tragic, meaning. For Nana, it's a desperate plea to get attention using the only thing that she knows how, her body. In regards to the film, Godard stated, \"The few episodes in her life that I am going to film are very likely of little interest to others, but most important to Nana,\" and I feel that he accomplished his goal very well here.These episodes to most would seem relatively mundane, just normal days in the life of a prostitute, conversations and interactions of the daily routine, but for Nana they mean so much more. Her trip to the cinema to see The Passion of Joan of Arc has become almost iconic in Godard's legacy, and for good reason. In this moment Godard removes us from our state as voyeurs and instead plays us into Nana's position. He displays Nana as the film viewer, presenting the kind of emotional impact and life revelation that cinema can have on someone and getting the audience to completely empathize with her. Nana becomes the audience and, as a result, the audience becomes her.The descent into prostitution is intriguing here, thanks in large part to the captivating and expressive work by Godard's muse, but Godard's metaphor for the life of an actress is also a fascinating theme that one can't help but notice. Displays Nana as the prostitute in her world of pimps and photographers, people passing her back and forth like a piece of meat, it certainly seems that he's making a statement on the film industry and the nature of exploitation in how actors are treated. They are passed back and forth by directors, producers, even the audience, and used for their image, much like a prostitute, and it's up to the actress to keep themselves in tact. As the opening quote of the film states, \"Lend yourself to others. But give yourself to yourself\".I've seen people refer to the film as the \"morning after\" state of the Godard/Karina dynamic and I think that's an interesting way of looking at it. They had collaborated several times before, and would collaborate for many years after still, but Vivre Sa Vie seems to be the most intimate and exposing look into the relationship between the two of them as lovers and the relationship between actor and director at large. It's a very introspective journey that Godard takes us on, and certainly one of the most impressive I've seen from him yet.",
            "review_date": "2012-02-20"
        },
        {
            "review_title": "Godard classic",
            "content": "As the film opens Paul and Nana are going through a break-up. Each is filmed with their back to the camera. As Nana says she wants to die, it makes me think that, when we turn our back on the most significant person in our life, it can be like turning our backs on life itself. Such a big part of our identity is bound up with them that there seems nothing left. It is as if we have failed to heed the advice of Montaigne, quoted at the end of the opening credits: \"Lend yourself to others and give yourself to yourself.\" Of course, Godard may not be intending for me to have such thoughts. For much of the film I get the distinct impression that he does not want me to interpret anything as anything, but just to accept it as it is. But the film, within a few minutes, has sparked off some interesting and worthwhile thought in me and I like this. It seems to be what art should do. And that it should do it simply by existing, not by trying to convey some message of its own.For much of the film that follows, part of my mind is taken up with enjoying the crisp black and white photography. The streets of Paris, and other simple but finely observed detail. The lustre of Anna Karina's hair – she plays Nana – is as enchanting as if I were talking to her. And maybe talking about nothing very much in particular so that my mind could wander to such things. The quality of the print is sufficient to make out individual hairs – or hairline cracks in walls and furniture.The overall effect – taken with some other devices that I only slowly become aware of – is to give a documentary-like feel to what the camera is seeing. Nana splits from Paul and drifts into prostitution. It happens without any big dramatics. She has been working in a record store, is having trouble paying her back rent, and, after a few other minor incidents, we see her with her first client. The look of repressed emotion on her face is one of the most stark and memorable images in the film. A bit like Edvard Munch's painting, The Scream. But sublimated into what is portrayed as a very everyday setting.Later, in a rapid monotone, Nana's pimp even gives us a run-down of prices, laws, regulations and practices. It is almost the Brechtian splitting of the film into twelve chapters (each with long titles telling us what is about to happen), and Godard's increasingly frequent experiments that separate the sound from the image, that remind us this is fiction, not docu-drama.For instance, towards the end and when Nana is with a young man she rather likes (and the attraction seems mutual, maybe love), their conversation is not heard by us but only seen on the screen as subtitles. They are communicating soundlessly perhaps, as lovers do.There is a long scene where she discusses the meaning of language with an old man, a philosopher (played by Godard's former philosophy teacher). Although this is outwardly quite deep, I did not find the arguments nearly as profound or rigorous as in Godard's later film, 2 or 3 Things I Know About Her. Prostitution is not used here, as it is in 2 or 3 things, as a political metaphor. Susan Sontag, in her aptly titled essays, Against Interpretation, suggests that it is, \"the most radical metaphor for the separating out of the elements of a life – as a testing ground, a crucible for the study of what is essential and what is superfluous in a life.\" She sees Nana as having divested herself of her old identity and taken on her new identity – that of a prostitute.In the version I watched, quite a few lines were omitted from the English subtitling, so my smattering of French came in useful. But I needed some of the subtler French puns on the 'life' and 'chickens' pointed out to me.As the film came to its not untypically Godard-like abrupt ending, I wondered for a minute if it was as great as some people often claim. The celebrated critic Roger Ebert, for instance, singles it out as one of the great movies of all time. My mind wandered to such movies as Last Year at Marienbad, and Jules and Jim, both made about the same time and which have left quite a deep impression on me. But only for a minute.Vivre Sa Vie is different, yet again, to any other work by Godard. But it is deceptively unassuming, and a remarkably solid piece of work for all its sense of transience (Godard compared cinema to a train rather than the station). It can also be seen as a love letter from Godard to his wife, the beautifully photographed Anna Karina.",
            "review_date": "2009-04-16"
        },
        {
            "review_title": "Totally Engrossed",
            "content": "Anna Karina is absolutely stunning. We are taken in by her beauty from the opening moments in the diner. She knows how powerful she is to men and she manipulates that power to try to survive. She is, for all practical purposes, homeless. She tries to borrow money for subsistence but no one will loan it to her. She has asked too many times. She dreams of being in movies but doesn't seem to have the ambition or the plan. It isn't long before she experiments with prostitution, which will become the ultimate complicator in her life. She is so closed up that no one can really befriend her. We see foreshadowing when she goes to see the silent Joan of Arc, and her response to Joan's martyrdom and her faith. It's a sad film that takes one along from one moment to the next.",
            "review_date": "2021-04-29"
        },
        {
            "review_title": "My Life to Live",
            "content": "Nana is a self-absorbed struggling actress(working in a store selling records) wanting to make it, and Paul is a sad-sack writer, with no money, who adores her, but is a flunky to her. Both have been \"acquaintenances\" for quite some time it seems, although, as we see in the opening conversation, they can barely stand being near each other anymore, the vitriol present as they engage in not-so-pleasant banter(in an interesting decision, Godard shoots them from behind as they \"chat\"). Using Paul for monetary purposes, Nana straggles him along, disposing of him when no longer needed..when asked by someone she meets late at a diner after a movie, Nana tells the date Paul is a brother.If I seem a little unsympathetic, the movie, although it's clear Godard's camera worships Karina, doesn't exactly cast Nana in the most positive light, but, during a police interrogation, we see she's so desperate for money, she tries to steal 1000 francs which fell out of a woman's purse onto the street..it's here we can see that she's just struggling like many of us, and has a yearning to taste the good life(she agrees to a shoot, requiring nudity, a sleazy photographer promising potential movie success for her).When there seems to be no alternative, Nana decides, albeit reluctantly, to prostitute herself. Eventually embracing the profession, she begins hooking for a nefarious pimp named Raoul who seems to be conducting business with crooked gangster types. Godard's film, however, is less interested in Raoul's activities, more concerned with Nana and how she makes out in her new career. Not long after meeting Raoul, violence is established, Godard's camera speed rat-a-tat-tatting as a tommy gun goes off, a man entering the café for which Nana is dining with a bloody face, crying aloud, \"My eyes!\" This could very well be a sign of things to come as Nana associates herself with a man whose connections to this world emerge later.A steady stream of customers flood through her new life as a prostitute, while becoming educated regarding the tricks of the trade(we hear the rules of the road from an insider to Nana preparing her for the times ahead, and see that she conducts herself in a matter-of-fact fashion, simply business as usual, drowning out the moral implications of such behavior, accepting this decision as a means to survive). Nana will eventually find someone, desire to leave this lifestyle, and discover that it is not so easy to break from Raoul who plans to \"trade\" her away as if a piece of property to discard when money troubles arrive.A stylistic choice, Godard augments Nana's progressive story with chapter titles, and his camera can't take it's eye off of Karina..sure the camera, at times, will focus on something else, but notice how it doesn't(or can not)stay away very long. A scene that struck a chord with me was the moment early on in the theater as Nana watches Dreyer's Jeanne d'arc..curious to if this is a comment of martyrdom as it pertains to Nana's future.Admittedly, I'm no Rhodes Scholar and there are passages where some dumb hick like me did go, \"Huh?\"(a dinner conversation between Nana and some older intellectual in the middle of reading The Three Musketeers about the difficulty of communication, an example). That's par for the course as Godard's film on prostitution has plenty of these types of moments where some passage from a book or poem is read aloud as the camera moves about, focusing on Paris' city streets or on Karina herself(often listening to another talk, taking in their words intently). Of course, Godard must allow Karina her shimmy-and-shake jukebox trot. What an interesting face(just beautiful)Karina has and Godard doesn't hesitate to return to it time and again.",
            "review_date": "2010-05-07"
        },
        {
            "review_title": "The director and the pimp",
            "content": "There is more to this film, in terms of its story, than a woman's descent into prostitution.  To a large extent, it is the story of Godard's failing relationship with Karina.  Or perhaps it presents Godard's overall view of the director's relationship to the actress, the artist's relationship to his subject.Possible spoilers.Aside from Nana, there are three characters crucial to the story: the photographer, the pimp, and the guy who reads excerpts from Poe.  There are two particularly telling scenes: Nana's viewing of Joan of Arc and the subtle appearance of the Elizabeth Taylor photograph behind Nana as the Poe story is read to her.First, the photographer.  He offers Nana her last chance at an entrance into films.  Soon after their meeting she falls into prostitution.  He resembles the pimp in manner.  Are films and prostitution the same?  Rather, are the director and the pimp the same?The real representation of the director is the guy who reads the Poe story. In fact, he represents Godard himself.  This is the guy who buys Nana cigarettes, and when we see Nana consorting with him after all of her degrading experiences, it is like a breath of fresh air.  He is going to glorify her and raise her to the status that she deserves.  He is an artist and he portrays her (\"This is our story,\" he says of the Poe story.  \"An artist portraying his love.\").  The Poe excerpt ends with the death of the artist's love, his subject.  He drained the life from her and into the canvas.  If this is their story, is the guy draining the life from Nana? Isn't that what the pimp has been doing?  The pimp and the director are the same.Nana sees Joan of Arc judged by men, and she ostensibly relates.  As the Poe story is read, we see the photo of Elizabeth Taylor behind Nana. Godard is encouraging us to judge Nana (or Karina) in comparison to Elizabeth Taylor. She is being killed, just as Joan of Arc was, by this judgement. The director and the pimp are the same.  Godard prostituted Karina, at least he thought so when he wrote this story.  He drained the life from her and into his canvas, the screen, and presented her for our judgement.  Our Nana doesn't realize that whether she had made into films or had fallen into prostitution, the end result would have been the same.  La morte.",
            "review_date": "2004-04-11"
        },
        {
            "review_title": "For Ever Godard",
            "content": "This has become my favourite Godard. It doesn't have the jazzy razzamatazz and classic Paris shots of A bout de souffle, or the invigorating Marxist politics of Tout va bien, or the beautiful scenary, beautiful body and beautiful music of Le Mepris, but it has a softness and a depth that are just haunting. It has a documentary quality in its most reflective moments, when we see Nana lighting a cigarette or undoing her cardigan. It is a film that is made up of disparate strands - poetic, documentary, melodramatic. It both creates Nana as star of the piece, with her sweet smile, beautiful coats, and cropped hair, and even, at one point, identification with Joan of Arc, yet undermines this to underline how ordinary, how vulnerable, even how banal she is. If you're new to Godard, start with this.",
            "review_date": "2003-02-21"
        },
        {
            "review_title": "Godard has a great piece of Parisian character-fiction",
            "content": "(minor spoilers ahead)I've started to get a little more used to Godard, and now by My Life to Live I know I can expect anything from him, though it's sometimes a style that he presents frankly, stylishly, or in an experimentally real approach. Along with his masterful cinematographer Raoul Coutard, the mis en scene he creates in each episode is equally satisfying. And there is a terrific balance in how the camera may just stay for minutes at a time on a character before moving and how the camera may show off (impressively) for the viewer.For example, there's a moment when Nana (played by Godard's wife Anna Karina) is a café, and gun shots are heard outside, the camera seems to cut - or move - to the sounds and beats of shots being fired, tracking like this all the way across the bar to the window. It was stunning to see that being done, not just for the sake of the scene's twist to intensity, but it perfectly skims the line of stage-ness and reality- if you were positioned in that café, how would you see things as your head turns to look to the street? Godard raises and answers some film-making questions that pay off in the best new-wave type fashion. His dialog, too, is fascinating, and a philosophical discussion between two characters gives me an indication as to what might have inspired Richard Linklater, perhaps.Then there's Anna Karina as Nana, a woman who leaves her husband and child (you have to listen sharp to note when the child's mentioned) and gets kicked out of her home by the concierge. She has a job in a record store, but doesn't keep it, wanders the streets, sees a movie (very emotionally touching scene), and tries to get an acting job, or some money together. Then she gets drawn into, without an ounce of remorse, the prostitution ring-around, learning that there isn't nearly as much emphasis on lawbreaking in the business in Paris as there is with medical concerns. Karina, with a face, eyes, hair, and body that has a sweet level of (distant) attraction, plays Nana in a wonderful way- we get inklings that she can be happy (dancing to music in a pool-hall is the highlight), though she's at best when she hides it under her demeanor. She smokes, she has a lot of sex, she has talks that sometimes don't go anywhere, but is the viewer ever let in to who she really is or what her motives are day to day? This is a credit to her, as well as Godard, in creating this memorable figure in the early 60's New-wave of French cinema. Credit should also be given to Michael Legrand's theme (though repetitive, has a sort of purpose for many scenes).",
            "review_date": "2004-01-08"
        },
        {
            "review_title": "The cold lens of Godard",
            "content": "During the 1960's, Jean-Luc Godard made fifteen feature-length pictures that owed themselves to the French New Wave movement, where young, \"reckless\" filmmakers made audacious attempts to defy the conventions of mainstream French cinema. Godard among many others decided to figuratively illustrate the book of common cinematic conventions and proceed to rip them up before concocting their own rebellious form of filmmaking, which, overall, seemed to want to hit the bases of reality's imperfections, coldness in story and characters, violence, and the physical and metaphorical chaos of modern society.Some of the above themes are what Godard uses to write and direct Vivre Sa Vie, a thought-provoking and consistently fascinating mood-piece, focusing on a woman by the name of Nana, played by the beautiful Anna Karina. Nana is a young Parisian twentysomething, aimlessly drifting through life after she leaves the safe but relatively unremarkable confines of her homelife, which involved a husband and a child. She's heavily strapped for cash, with her job as a shopgirl providing for what little income she already has, and soon realizes that leading a viable life on so little is just not a reality.She decides to take up life as a prostitute, which she'll earn better money doing instead of the day-in-and-day-out drudgery of being a shopgirl. She becomes the employee of Raoul (Sady Rebbot), your average pimp who takes advantage of Nana's youngness and gorgeous looks in order to turn a profit.Throughout the entire film, Godard conducts Vivre Sa Vie with pure, uneasy coldness, staging the picture into twelve separate chapters (\"tableaus\"). Each chapter, marked by a descriptive title-card, gives insight into Nan's particular stage in life at that moment in time and provides for a neatly-punctual little narrative that Godard smoothly orchestrates.Vivre Sa Vie (\"My Life to Live\" in English) seems like a film that would be made in present times because of its documentary-style filmmaking (more formerly known as \"cinéma vérité\"). More informally, the film bears a slice-of-life realism to it that is just beginning to gain considerable momentum in American cinema and only proves that Godard was ahead of his time, making a film like this in 1962.With the film's polished and clear videography, Godard strayed away from the hand-held-camera techniques of his earlier films such as Breathless and his final New Wave picture of the 1960's, Weekend. Godard uses what is known as a Mitchell camera to capture his carefully-framed and elegant shots that point where few cameras have pointed before. Godard continues to defy normalcy by pointing the camera at places uncommon, such as the back of Nana's head while she's speaking in conversation, or allowing the camera to hold in place during one long shot. Godard's camera techniques are aplenty and his ambition is most often met with an unexpected and very pleasant success.Furthermore, Godard knows how to write meaningful, sometimes philosophical dialog that finds ways to be hugely relevant and even deeply-contemplative. Consider the scene where Raoul tells Nana the value of a prostitute, detailing her job description and her role as a woman without many rights and robbed of her individuality and her humanity. She's a piece of meat for lonely men searching for a quick sexual fix that often finds ways to be completely unsexual and unromantic. Raoul illustrates this idea of what it means to be a prostitute in the coldest, yet most fitting way possible.Another conversation comes near the end, where Nana meets a random soul in a diner and strikes up a conversation. The man turns out to be a deeply thoughtful and wise man who seems to be looking for simple human companionship. Him and Nana have a delightfully philosophical conversation, showing that even two people who've never met one in another in their life possess the ability to connect with each other on an unexpected personal level, fulfilling one another in ways they never found foreseeable.Make no mistake, however, that Vivre Sa Vie is a cold and often detaching film that leaves little room for connecting with the characters in any way. After viewing four Godard films, three of which from the French New Wave, detachment seems to be an overarching theme for reasons I'm not sure I can adequately explain. Godard seems unable to allow his characters to be more than just unmoving littler pawns in his cinematic game. Despite giving Nana several traits and some debatable motives, even she has her own coldness to her being. At this point, I'm waiting for the film where instead of pushing us about a foot away from the film, Godard grabs us in and gives us a setting, an event, or a more fleshed out character to connect with.Starring: Anna Karina and Sady Rebbot. Directed by: Jean-Luc Godard.",
            "review_date": "2014-03-04"
        },
        {
            "review_title": "Vivre Sa Vie (My Life to Live)",
            "content": "I found this French film in the book 1001 Movies You Must See Before You Die, I wouldn't have known about it without being entered in the book, and I didn't know what to expect, but I hoped it would be worth it, directed by Jean-Luc Godard (Breathless, Alphaville, Pierrot Le Fou). Basically the story is told as twelve brief unconnected episodes, exploring the life of young beautiful Parisian woman Nana Kleinfrankenheim (Anna Karina). Nana is in her early twenties, she leaves her husband and infant son to try and achieve her ambition to become an actress, however without money she is forced to become a shop girl. Unable to enter acting, Nana slowly descends into the world of prostitution, in order to earn better money, she soon gets herself a pimp, Raoul (Sady Rebbot). He later, at an unspecified time, sells her to another pimp, during the exchange an argument breaks out between the pimps, Nana is caught between the crossfire and killed by gunshot. Also starring André S. Labarthe as Paul, Guylaine Schlumberger as Yvette, Gérard Hoffman as Cook, Monique Messine as Elisabeth, Paul Pavel as Journalist and Brice Parain as Philosopher, with voice narration from Jean-Luc Godard. Karina, also the director's wife at the time, gives a marvellous performance as the tragic unconventional heroine, the film is all unconventional, it is part of the New Wave, this was one of the first major films to have sex earning money, so it gained notoriety, there is the gangster element, it has good techniques of camera angles, and it is stylish in black and white, all together it is a most worthwhile drama. Very good!",
            "review_date": "2016-02-26"
        },
        {
            "review_title": "The Summary of Sixties Godard",
            "content": "The crux of 60's Godard. His quirks are broken down into twelve segments manageable for the inexperienced viewer. If only one Godard film is to be watched, it might be this one. Though none of us would want to live in that world.The film opens with an entrancing first ten minutes. The credit sequence and ensuing scene introduce the crucial theme of acting versus reality. Nana, played by Anna Karina, seems to never truly escape the personality of the actress who portrays her. Instead of avoiding this, Godard embraces the ambiguity and creates an entire film that obsesses over Karina's image. From the credits to \"Fin\"? the audience, like Nana, is fixated on her outward appearance. She constantly references her desire to be in movies and have her picture taken. Ultimately, she becomes a prostitute, seemingly the only place to turn for a girl who allows herself to be mercilessly controlled by men. This tragedy is underscored by her clear desire to be \"special\"? and, most potently, in her tearful viewing of Jeanne d'arc, a woman who faces death at the hands of men. Nana's personality and development can be seen as a vehicle for Godard's philosophy on film. The \"men photographing women\" had become perverted to the point of solicitation and death. The obvious parallels between the ending of VIVRE and BREATHLESS suggest a pessimistic condemnation of contemporary law and society.Godard's deliberate camera motion, defiant attitude towards cinematic grammar, and clear pacing created a film that, though fictional, is one of the most honest human portraits available. Always experimenting with sound, the director never succumbs to standard over-the- shoulder dialogue sequences. Instead, he accesses another level of meaning by making deliberate choices over who is seen when saying specific words. Sometimes there are cuts and sometimes there are pans, but never is there a decision that seems arbitrary or purely for the sake of ease. While Godard's films do own a simple and unashamed quality that might lend itself to less expensive filmmaking, it is clear that his choices serve specific purposes and are always a slave to the greater objectives in the film. One of the most striking scenes in VIVRE SA VIE is where Nana is writing a letter. It is a simple act on which most directors would only spend a few seconds. Instead, Godard places a close-up on the letter and allows the audience to watch the entire process and become engulfed in Nana's (or Karina's) beautiful handwriting and the earnest quality of the letter.VIVRE SA VIE successfully provides a tidy summary of Godard's quirky brilliance. For those willing to explore his genius, this film is the ideal starting place (if not working chronologically). But be careful. Once his capabilities are discovered, they will never leave you.89.8",
            "review_date": "2012-03-07"
        },
        {
            "review_title": "Curse of Beauty.",
            "content": "\"Vivre sa vie\" was an entrancing movie.  I think it was the presence of Anna Karina that made the movie hypnotic.  Her face captures your attention and draws you into the movie.  In fact I think it was her beauty that caused her tragic end.  (Onset of a SPOILER warning.)  I think Nana's beauty attracted so much attention that she never had to develop a talent or skill to make it in the world.  She lived off of her looks.  She thought she could make it in \"the movies\" based on her looks alone.  Unfortunately she drifted into prostitution, using her looks to make money, and got involved with a pimp. The scenes of her with her clients were of interest because it seems the men she was with really didn't comment on her beauty.  The sex scenes were rather passionless.   The men in the pool room ignored her when talking business and when the one did pay attention to her he acted like a fool to amuse her.   She existed to be entertained or to entertain, never to be treated seriously.  When the young man in the pool room did treat her with some respect and read to her she fell for him and decided to leave her pimp and start a life with him.  But the pimp had other ideas and sold her, like a piece of property, that she was, to another pimp, a business transaction. Tragically the deal goes bad and Nana is shot, by both pimps, and left on the street, like a piece of litter. (SPOILER warning defunct.)  I think this is a fate of many beautiful women in our western society.  They are fawned over because of their beauty but really ignored when things turn serious. They are walking art.  Look at Hollywood's treatment of starlets.  When young they are hot stars and are all over the celebrity news shows but they quickly grow older, lose their ripeness, and are replaced by younger actresses.  They think the interest in them is about some talent they have but it is just because of their beauty.   Maybe \"Vivre sa vie\" is about those starlets.  They are pimped then discarded.  The movie is worth seeing since it invokes introspection.",
            "review_date": "2002-11-18"
        },
        {
            "review_title": "Another overrated art-house film",
            "content": "VIVRE SA VIE is a film by French auteur Jean-Luc Godard, one of those art-house directors that people always bang on about. I'm afraid that I don't share the same sensibilities, although I try to see the films if they're showing on TV just so I know what's being talked about. VIVRE SA VIE is a low budget black and white production about a woman whose promiscuity sees her descend into prostitution, and I'm afraid it's a film which left me cold.This kind of story was previously done in Emile Zola's famous novel NANA, which brought to life the seediness of 19th century Paris, and by comparison VIVRE SA VIE simply isn't up to scratch. The characters are subdued and bored and thus come across as dull in themselves. I didn't care or feel sympathy for any of them. The film is presented in twelve vignettes but they're all very similar and the viewer doesn't really learn or understand much from watching. It all seems so trivial, a shame when important subject matters are crying out for treatment.",
            "review_date": "2017-01-12"
        },
        {
            "review_title": "It's a sad world, and Godard knew it!",
            "content": "My father had a lot of trouble to explain me what those men were doing, laying against the wall on a busy Sunday street, where there were a number of women in flashy clothes going up and down the street, looking at the men who passed by instead of doing window-shopping like me, and my father. It was 1954, in Lisbon. I came to know the men were pimps, and although I always respected the 'girls who were in the life', the pimp became my pet hate, to this day.Does Goddard make an outstanding political speech here? I'm not sure. But now I understand why everybody was speaking of his 'Nana' in the Sixties. It's a poignant story, clear and sharp, with no tears but more like a gut punch. Particularly for the (unexpected?) ending. I disagree with those who said that the 12 scenes of the movie are 'unconnected'. They are connected! But the film should be fully appreciated on a second viewing for it, may be. These days, people are not able to cope with this much philosophy in a single film.It's also a sad world when you discover, in 2001, that this film runs 85 minutes in the USA, 83m in Portugal, and 80m in France (it's so described in \"Cinéguide\" des Presses de la Cité (ed.1992). France shows the most short of the current versions of this wonderful movie about streetwalkers and pimps, about workers and profiteers; therefore, the most 'cut' or censored version - be it political or commercial censorship. France! the country that represented for me Liberty, Fraternity and Equality, when I was a 6 year-old kid opening his eyes to the beauty of chandeliers in a shop window, the beauty of girls in high-heels and knee-length skirts, and the wrongness of the half part of the world who lived without working, squeezing money of those who worked. Even if the work was - like Nana's - lending her body to other people...",
            "review_date": "2001-03-26"
        },
        {
            "review_title": "pinball machines",
            "content": "\"Birds are creatures with an outside, and an inside. When you remove the outside, you see the inside. When you remove the inside, you see the soul.\" \"Vivre Sa Vie\" is an incredibly desultory film about a confused girl (Nana) with an existential crisis; namely, the task of reconciling her decision to become a prostitute with her belief in a free will. As the repercussions of the \"painting\" she has rendered gradually spiral out of control, Nana becomes progressively more alienated from and confused about her life. This culminates in a chilling scene in a diner, where she lays her soul bare before a well-meaning philosopher, who responds to her desperate queries about the gulf between words and emotions with more words. Erudite words that she cannot possibly understand.Godard probes his favorite existential motifs with wonderful sensitivity here. When Miss Karina espouses her belief that a \"plate is a plate\" and a \"life is a life\", the overwhelming sadness in her eyes betrays the torment of a woman who feels torn from her self by circumstance. Nana turns to prostitution after breaking with her lover, failing to secure a spot in the movies, and being evicted from her flat. Watching her struggle to exact some control over a world that is clearly much bigger than her designs is emotionally draining.As usual with Godard, the cinematography is lush and his cinema eye is constantly roving. Before Nana's first trick, the camera cuts from Karina's panicked eyes, to a bar of soap. It is a relatively simple, yet effective, symbol that defines a relatively simple, yet affecting film.",
            "review_date": "2007-03-22"
        },
        {
            "review_title": "Good Ideas, Not the Greatest Execution",
            "content": "\"Vivre Sa Vie,\" translated roughly as \"My Life to Live\" follows a woman who slowly descends from being in a relationship to becoming a prostitute in order to get by. Such subject matter was, for the most part, not touched by Hollywood at the time of its release since it was very edgy and uncomfortable, and God forbid that Hollywood's audiences get uncomfortable when watching a film. But this wasn't Hollywood; this is part of the French New Wave.The film is told in 12 episodic tales which have titles and their own sections of the tale, such as certain Tarantino films including Pulp Fiction, Kill Bill, and Inglourious Basterds. For me, 12 seemed a little much, and it felt like it could have been done with a few of the episodes left out. I am not complaining about the length, it is still relatively a short movie, but I think I remember one or two episodes that were too short to be considered their own episodes in my opinion.I think it is great for Godard to work with such subject matter; the only \"explicit\" film I remember seeing from around this era was \"Persona\" by Bergman, and I was shocked at the language they used - I thought people were only that vulgar in movies towards the end of the 60s and onwards. However, there are shots that seem uninteresting, including the final shot of the film, and the final scene in general makes the film end on a very abrupt note.This is a good character study which has darker material than the mise-en-scene/lighting/tone of the film. I would have liked to see this darkness portrayed in the visuals, but this is still a good film.",
            "review_date": "2015-03-21"
        },
        {
            "review_title": "It's My Life",
            "content": "Twelve episodic tales in the life of a Parisian woman (Anna Karina) and her slow descent into prostitution.Godard borrowed the aesthetics of the cinéma vérité approach to documentary film-making that was then becoming fashionable. However, this film differed from other films of the French New Wave by being photographed with a heavy Mitchell camera, as opposed to the light weight cameras used for earlier films.While not being one of Godard's best-known films, Vivre sa Vie enjoys an extremely positive critical reputation. Susan Sontag, author and cultural critic, has described Godard's achievement in Vivre sa vie as \"a perfect film\" and \"one of the most extraordinary, beautiful, and original works of art that I know of.\" According to critic Roger Ebert in his essay on the film in the book The Great Movies, \"The effect of the film is astonishing. It is clear, astringent, unsentimental, abrupt.\" This is, indeed, beautifully shot, and the literary references are quite interesting. A story of women's independence and prostitution mixed with Edgar Allan Poe? That is most unusual. The central idea of the Poe story resides in the confusing relationship between art and life. What does this mean in the context of the film?",
            "review_date": "2015-07-28"
        },
        {
            "review_title": "One of the best movies ever",
            "content": "The French New Wave remains one of the finest movements in film history. Jean-Luc Godard was one of the most innovative filmmakers to emerge from this movement, and Vivre sa vie is one of the best films ever.  Long before the Hong Kong cinema proved substance could be downplayed with style, Godard was doing it.  The film's plot follows a woman's descent into prostitution, but the story isn't what people will talk about after viewing the film. Godard breaks every Hollywood rule and pulls it off nicely.If you want to see the conventions of Hollywood broken and a true auteur at work, rent Vivre sa vie.",
            "review_date": "2000-09-20"
        },
        {
            "review_title": "Interesting new wave film, but a bit bleak",
            "content": "There is a bleakness to this movie, which has a pretty and thoughtful young woman (Anna Karina), living in beautiful Paris, and yet descending into prostitution following a break-up. Director Jean-Luc Godard gives us twelve vignettes that are intentionally simple and unassuming to paint the picture. It's worth seeing, but at least for me, there are better French New Wave pictures, and certainly less depressing ones.Anna Karina is lovely but I don't think she delivered a lot of range in this performance. One major exception early on in her new job is when she desperately tries to avoid a customer's kiss on the mouth. The look in her eyes as she squirms around is heart-rending, and disabuses us of any ooh-la-la fantasies we may have about her in this role. Another nice scene is when she dances to a jukebox song with awkward cuteness, trying to entice the few men watching her.To his credit, Godard is unflinching in his honesty, and there is no sentimentality here. I loved the thoughtful scenes, the one where she's in the theater watching the 1928 Carl Theodor Dreyer film 'The Passion of Joan of Arc', and then later picking an older man's brain about philosophy in a café. The street scenes in Paris were nice to see, though sometimes the film comes close to descending into a home movie project. Godard was making a point about the realities of life, and employing new filmmaking techniques while telling the story. It doesn't always make for great entertainment though, such as the section that's almost a mini-documentary on prostitution in Paris at the time. The ending is also ridiculously abrupt; it is a grand statement but to me borders on pretentiousness. Is it over-compensating for not showing some of the more painful aspects of prostitution along the way? (STD's, being beaten up, being degraded, etc?). Until then, with the exception of the attempted kiss scene, the 'insight' we get is mostly just a beautiful model being bored by her tricks. From Godard, I much preferred 'Masculin Feminin' (1966), so if you're new to him, I would start there instead. You may also try the Truffaut film we see on the marquee of a theater towards the end, 'Jules and Jim' (1962), which was a nice little tip of the cap to his fellow director.",
            "review_date": "2018-08-04"
        },
        {
            "review_title": "My Life to Live",
            "content": "Vivre Sa Vie (1962)*** (out of 4) Jean-Luc Godard's tale of a young woman named Nana (Anna Karina) who slowly finds her desperate situation in life turning her towards prostitution to make some money. Once you see Godard's name then you know we're not going to get a straight story of a woman entertaining prostitution. Instead, the film is told in twelve chapters that really play out more like vignettes than anything else but I think this actually helps the film in a few ways. I've been quite critical with the director and several of his films but I think that style of his really doesn't go over-the-top here and for the most part it works. This is especially true in the first couple chapters where we see the woman's desperate situation and how she keeps waiting for a break to happen but of course it never comes. Godard's style of storytelling also works beautifully during a sequence where the woman is given all the information and rules about being a prostitute. This sequence here is perhaps one of my favorites from any Godard film I've seen up to this point. With that said, I found the final two chapters to be rather boring and to me they simply didn't fit in with the rest of the movie. I don't mind how the picture ended but chapter eleven takes place in a restaurant and has the woman talking to an older man. I'm sure some will get something out of this conversation but it just left me flat. I think the best thing working here is the performance of Karina who is simply divine in the lead role. It's hard to work your way through the director's style but Karina makes for a very believable role and actually makes you care about this woman and the trouble she's in. VIVRE SA VIE isn't something that I found to be a masterpiece but it is one of the better films I've seen from Godard.",
            "review_date": "2012-09-03"
        },
        {
            "review_title": "I won't deny Godard is talented, but...",
            "content": "Yes, this is something I had to watch for uni, could you tell?Amazingly, even though I'm in my second year, this is the first Godard film I've seen, and while I can definitely say I love his direction, I can't say much else about this really grabbed me.It's only 80 minutes long, but even then I was getting a little bored by the end, and I think it can only be put down to the fact that for all the many gorgeous shots that ensure Anna Karina has as much room as possible to show off her performance (which is really good to be fair), I simply don't care about her.There's really nothing special about the story to me, not after nearly 60 years of these kinds of dramas becoming quite common in the French New Wave's wake, and good god is the ending the very definition of an anticlimax.I'm also not a big fan of how the plot seems to grind to a halt every so often so the characters can have a long philosophical quote-off, and the more I think about it, the more I could have narrowed all this down to the simple fact that I don't really care about the main character, and leave it there.But I think I'll eventually see a Godard film that does really grab me the way this one unfortunately didn't, because he is responsible for nearly all the best parts of this film. Every shot is beautifully thought out, the editing is precise as hell, and he brought a great performance out of all the actors.And since I'm a film student, I give it an average of three weeks before I'm forced to see another one, so fingers crossed.",
            "review_date": "2021-02-01"
        },
        {
            "review_title": "huh?",
            "content": "Not nearly as good as I had hoped for. The only scene that I would ever want to see again is her getting shot at the very FIN of the film. Everything about the rest of it is so arbitrary it looks like Godard was making it up as he went along, right from the ridiculous first scene where they talk to us from their backs, right down to the absurd attempts at symbolism with a pin ball machine played by both her future pimp and ex boyfriend. Actually overall in his first four, five films Godard has always struck me as a man torn between Hollywood commercialism and Andy Warhol nihilism, sublime critic and artist manqué. Edmund Wilson was sort of that on this side of the Atlantic, unerringly eerie ear for the new great and strange, and pretty boring fiction writer.",
            "review_date": "2006-08-05"
        },
        {
            "review_title": "Bold and beautiful piece of film-making.",
            "content": "Wow, what a wonderfully structured and interesting film, basically 12 tableaux's following Nana as she turns to prostitution after abandoning her original wish to be an actress. From a scene of Nana watching The Passion Of Joan Of Arc I knew I was in for an enjoyable piece of work. Tho the theme of the film is bleak, Godard manages to enthuse the picture with slices of humour and moments of genuine uplift. That Nana is played by Godard's then wife Anna Karina {who is simply gorgeous} gives me the impression this was a personal film to Godard? It certainly feels intimate and personal to me. Some incredible scenes, like the afore mentioned viewing of Passion where we have simultaneous tears on and off the screen, and a beautiful sequence involving a reading of the genius Edgar Allen Poe's-The Oval Portrait.All Godard's trademarks are here, the swift editing that bring about long shots that make the film seem so real, then the sound which actually is real, in fact I'm under praising the sound because it is amazing, and to wrap up we get one of those endings that stay with you for quite some time after.I may just become a big fan of Godard after all 9/10.",
            "review_date": "2008-03-04"
        },
        {
            "review_title": "Godard's character study is one of his strongest films... and one of the most moving films period",
            "content": "VIVRE SA VIE was Jean-Luc Godard's fourth feature film. The protagonist Nana (Anna Karina) is a young Parisian woman who is not especially bright, but full of life and endowed with great beauty. Unable to make ends meet by working at a record shop, and unable to break into films as she dreams, she starts to work as a prostitute. Postwar French law permitted prostitution, with certain rules and regulations that the film explains in a documentary-like segment. Nana, who yearns to live her life according to her own desires, initially thinks that this new profession has set her free from cares. In fact, Nana's liberation from penury through prostitution only subjects her to new constraints imposed by her pimp and clientèle. The film, divided into twelve tableaux with fade-to-black transitions that quicken as it goes on (which one commentator compares to breathing faster and faster) brings us to one of the most shocking endings I have ever seen.This is a superlative film. Clocking in at 85 minutes, it lasts exactly as long as its story demands, with not a single moment that feels superfluous. Everything fits together, perfectly even things that ought to seem extraneous, the overindulgence of the auteur. Early in the film Nana goes to see Carl Dreyer's 1928 silent film \"La Passion de Jeanne d'Arc\", and this is not a mere gratuitous tribute to earlier cinema as is common in French New Wave films. Nana speaks with an elderly philosopher in a café, who is in fact the real-life philosopher Brice Parain whose dialogue here consists of his own writings, and yet this is not shallow intellectualism. Rather, these scenes increase the three-dimensionality of Nana as a character: not very intelligent and with negligible education, an easy woman since long before the film begins, but feeling strongly that there must be more out there.The believability of Nana as a character is increased all the more by Anna Karina's masterful performance. When coming to Godard's films, after the filmmaker has taken a beating from some circles, one might think that Karina was simply a beauty with no especial talent that enchanted the director due to her looks and foreign origin. Nope, the Danish actress here presents a completely believable Parisian airhead who is so easily moved by sentimental art.",
            "review_date": "2014-03-08"
        },
        {
            "review_title": "Brooding, seedy, chic French New Wave",
            "content": "Now who doesn't enjoy a healthy dose of French, 'Nouvelle Vague' existentialism on a rainy Sunday afternoon? Well, I must confess I was initially a little apprehensive about 'Vivre sa Vie', a twelve tableaux, New Wave film directed by Jean-Luc Godard. Not that I haven't immensely enjoyed many of his other works but the write up on the DVD made it sound far more inaccessible and 'out there' than it actually was. The use of tableaux helped tremendously with the flow and understanding and gave the movie the effect of being more like a play whilst providing a direct view into the mind's eye of the filmmaker.Vivre sa Vie is certainly less plot driven than character driven - but what do you expect? This is French New Wave people! Essentially one becomes immersed in the life and lifestyle, thoughts, feelings and attitudes of Nana Kleinfrankenheim (played excellently by Anna Karina); a young woman who has left an unhappy marriage, and her child, and is seeking more in life. Apparently Godard specifically chose Karina for his main character believing her lack of acting experience would contribute to her natural 'awkwardness; it did, and very effectively too. Nana is dissatisfied with her lot and aspires to become an actress as she works, with extreme indifference, in a low paid sales position. She finds herself without enough money to make ends meet and that is where her descent into a seedier, harder life begins. Throughout the movie, Nana's personality vacillates wildly between apathy, coquettishness, genuine sadness, sultriness, sheer awkwardness and hard-nosed conviction. I particularly enjoyed the tableaux where she meets an older man in a café and they start a conversation which leads to philosophical enquiry. Although Nana has no knowledge of the subject, her enquiries and questions lead to her philosophizing, albeit for a brief period of time. This is one of the rare scenes where Nana becomes genuinely animated and exuberant and one sees that she is truly an innocent, whose various 'masks' are just that; a way of appearing that she has her life together, knows what she's doing and doesn't care about the consequences.The cinematography and atmosphere of sa Vie is beautiful, brooding and captivating; some scenes consisting solely of the back of peoples' heads, their reflections in mirrors and their thoughts only spoken in their heads. If you fancy stepping back in time to 1960s Paris, where everyone is impeccably chic all the time, where people seemingly inhale more smoke than oxygen and where one can revel in a fiesta of ennui, seediness, desperation, innocence and stark realism - then you are going to love this movie!",
            "review_date": "2013-12-11"
        },
        {
            "review_title": "More drivel from the New Wave Frenchies",
            "content": "It took me until halfway through this pointless, dull film to figure out why Godard shot so many scenes with the camera pointed at the back of his actors' heads -- his lead actress couldn't act worth a d**n, and many of the males weren't much more convincing. \nWas there a single establishing shot in the entire film? The whole film seems to be shot 6 inches to 3 feet from the actors. So boring. \nWhat's the lead character's motivation? Boredom? Lack of imagination? Stupidity? Greed? \nI can watch Breathless over and over again. Maybe Godard just ran out of steam the more movies he made.",
            "review_date": "2018-07-16"
        },
        {
            "review_title": "MY LIFE TO LIVE a precursor to PULP FICTION",
            "content": "I found this movie by accident at my Goodwill store and bought it because it looked like an interesting example of 1960s experimental French cinema of which I am not too familiar. When I started watching I liked the stark black and white simplicity of the film and long before it ended I realized how similar this movie was to PULP FICTION. The girl, Nana, was simply exquisite and similar to Uma Thurman in many ways. I won't go into all the ways this movie is similar to PULP but the thing I noticed right away was how the movie opened with the male and female at the restaurant counter with their backs to the camera. They are talking about breaking up - Vincent and Mia were meeting for the first time. In sum, Tarentino must have seen this movie and used it for many of his ideas.",
            "review_date": "2007-01-18"
        },
        {
            "review_title": "True CINEMA!",
            "content": "I remember being stunned when i saw this in the cinema in the 60s and i am delighted to find that it holds up so well. The chapter heads look a little forced now but that hasn't stopped others copying it and it does avoid the compulsion to adhere to a strict narrative flow. Wonderful performance from Anna Karina and such good cinematography from the masterful, Raoul Coutard. We see nothing in the round, nothing in the whole. A corner of a wall, part of a poster or street sign and only bits and pieces of the performers most of the time. A marvellous sequence in a record shop begins fairly ordinarily then runs along the record racks before slipping sideways and giving us a view out of the window. It is not forced or theatrical but just how things really are. The opening section is set with the boy and girl sat at a mirrored bar. We see only the backs of their heads but for the occasional reflection, yet it seems so real, a truth touched upon in all its fragility. The dialogue throughout most of the film is stark and spare but more poetic and rounded towards the end, culminating in the inspired 'chat' between Karina and 'the philosopher' when all is made clear. The denouement is a farcical but dreadful surprise and the direction throughout, assured and audacious. This may or may not be truth 24 frames a second but certainly it is true cinema!",
            "review_date": "2015-11-26"
        },
        {
            "review_title": "Man this film was so empathetic",
            "content": "Really loved this one, Anna Karina lights up the screen and is lovely to watch, I can't wait to see more of what she can do. The score is really haunting and pleasant to listen too and overall it was a nice film to watch at 3am when I wanted to die!",
            "review_date": "2019-12-22"
        },
        {
            "review_title": "Twelve things we know about It",
            "content": "Jean-Luc Godard directs \"My Life to Live\" (1962). The film opens with a dedication to B movies, and so underdogs. Godard then hits us with a quote by philosopher Michel de Montaigne (\"Lend yourself to others, but give yourself to yourself\"), the importance of which becomes apparent later on.\"Life's\" first moving images consist of close-ups of actress Anna Karina. These shots, which survey Anna's skull from the front and sides, are all truncated and prematurely silenced. Only when Anna is viewed from behind, her face hidden, does Godard's film finally proceed. The message is subtle: only when her private wants are denied, does this character's life unfold.Anna plays Nana, a young woman living in Paris. Poor, lonely and seeking escape, Nana allows herself to be seduced by a post-war France awash with money, billboards and glitzy cinema screens. The world will allow her to become an actress, Nana believes. And all will be fine.But Godard counters Nana's naivety. When Nana insists that humans have free will (\"I raise my hand, I'm responsible!\"), Godard slyly admonishes her with a parable about a chicken whose soul is revealed to be on the outside of its body. Behaviour, personality and human actions, then, are contingent upon the External. And the External, for a staunch Marxist like Godard, is shaped by economic systems.And so Nana is pushed into prostitution. She insists that this is a personal choice not influenced by economic and sexual shackles, a stance which immediately makes the ironically titled \"My Life to Live\" different from most films \"about prostitution\". For whilst most films simply pity prostitutes, Godard focuses on their complicity; they embrace their exploitation, deny that exploitation is even taking place, and believe themselves to be making rational career choices. Such are common beliefs under capitalism (the poor choose to be poor, the worker is free to choose his employer etc etc), which for Godard merely legitimise systems of abuse. Montaigne's command - \"Lend yourself to others, but give yourself to yourself\" - is thus seen to be an impossibility. The brain and body one gets back at the end of the day have already been irrevocably changed and colonised by the customer and employer. And with these changes, one's potentials are potentially stymied.\"My Life to Live\" is filled with symbolism, clever juxtapositions and Brechtian techniques. Pin-ball machines, for example, point to both a cruelly deterministic universe and Nana's role as a money-for-pleasure dispensation unit. Elsewhere Nana watches Dreyer's \"The Passion of Joan of Arc\", a film in which a True Believer is crushed by patriarchal forces beyond her control. Godard uses the nature of Dreyer's film - silent cinema - as a comment on Nana's forced passivity, her exploitation, her misguided faith and ultimately her sacrifice. Another scene watches as Nana sits in a cafe observing happy couples as Jean Ferrat sings \"Ma Mome\". The song's about a lovely loser who is adored despite her failings. Godard's camera makes love to Nana's face and eyes as the song unfolds, a bit of tragic romanticism which climaxes when Nana uses the moment to \"wilfully decide\" to become a prostitute.Juxtapositions abound. One segment portrays Nana happy and in love with her new life as a prostitute. The following segment abruptly shows the opposite. Nana herself embodies duelling qualities. Simply for being human, Godard treats Nana as a work of art, something lovely and precious and special and worthy of exaltation and love. Nana is herself aware of her exhibitionist situation, constantly posing, teasing and eyeballing Godard's camera. But when a character reads a poem (Poe's \"The Oval Portrait\"), such adoration turns sour. The poem is about a lovely head which dies when an artist fixates on a replicated image of it rather than the real thing. Privileging fantasy, then, leads to various forms of neglect and abuse.Late in the film Nana meets a philosophical man in a cafe. He tells her that thinking leads to analysis paralysis and so an inability to quickly act. To mitigate suffering caused by inaction, humans are thus \"predisposed to not think\". This survival mechanism, the man argues, makes humans susceptible and blind to elaborate forms of exploitation. Language, a kind of lie, propagates these problems. Only by adopting a dispassionate and honest view of reality, the man implies, can human language and so behaviour become honest (and by extension capable of love in a humanitarian sense).Like Godard's \"Breathless\", \"Life\" ends with a parody of Old Hollywood gangster movies; Nana is comically gunned down and gets the Hollywood career she always dreamed of. The film's obsession with prostitution echoes Godard's other films, most of which see capitalism as being built upon meretriciousness. For Godard, we're all prostitutes, selling our bodies and our minds which, as Cartesian mind/body splits are a fallacy, ultimately amounts to the same thing anyway. Where \"My Life\" differs from these films is in its dry, almost bureaucratic portrayal of prostitution; sex as banal, state sanctioned, \"humanely regulated\" economic transactions.Aesthetically, \"Life\" is special. The film's mixture of avant-gardism and classical formalism (Godard uses heavy cameras and lots of dollies) is emblematic of the entire Modernist movement (Antonioni, Bergman, Pasolini, Kubrick, Herzog, Bresson, Fassbinder etc), cinema's greatest movement before its defeat by algorithms and banks. Fittingly, Godard, relative to wealthy bankers, once hoped to study anthropology. His film would prove an influence on directors like Scorsese and Tarantino, who'd steal its style but whitewash its politics, a kind of selective vampirism which would eventually kill the Modernist movement outright. The film finds Karina doing some of her best work; warm, tragic and never melodramatic (Godard's style undercuts melodrama). Little touches, such as Nana measuring herself with one hand or playfully dancing around a jukebox, show us the Nana that might have been.8.9/10 – Masterpiece.",
            "review_date": "2016-12-04"
        },
        {
            "review_title": "Tedious",
            "content": "I don't know why people go crazy for French films, but for some reason, they think a film is good just because it's French. If an American made this film, I doubt it would have been received in the same way. Like many of Godard's movies, this one was tiresome. I didn't care about the character and her story was uninteresting. The film was emotionless. How can anyone care about the character when this is the case?Stringing a bunch of scenes together doesn't make a movie. Yet that's just what Godard did here. I believe a movie should have a point; few do, and this one certainly doesn't. I really don't get the ravings about this film, but I do have a bias against films that feature uninteresting losers.",
            "review_date": "2007-02-15"
        },
        {
            "review_title": "Godard the innovator",
            "content": "We, as a modern day audience become overtly excited for blockbuster films. With the use of modern day sources such as the internet, it seems embedded in our culture to give films such hype, whether it be action, comedy or romance, blockbuster films have become the only form of cinema for the mass audience to look forward to. The cinema culture is surrounded by remakes, sequels and prequels mostly motivated from one reason, money and most blockbuster that we see, par some, are underwhelming, due to the fact that these films consist of following generic conventions to just please the modern audience. Imagine if Godard films were the true excitement, imagine if the mass audience lined up to be overtly excited for a Godard film, they would most likely be treated to a highly stimulating and innovative experience. 'Vivre Sa Vie' is a film that highlights audacious filmmaking in every sense. A film that is willing to break the barriers of the cinematic universe. 'Vivre sa vie' can only be described as Purely authentic.The story is divided into 12 episodes of a woman life, Nana, and follows her descent into prostitution.The opening minutes introduces the film's protagonist Nana through three separate shots, portraying her face from the left, right and front. From this opening sequence, we gain a sense of awareness to Godard's innovation, presenting a simple presence that embodies a complexity of emotion, and we hope the music will in some way convey a sense of emotion, however the music abruptly seizes before we form a connection, maybe Godard is simple telling the audience to let go.The first episode consist of Nana wanting to breakup with her lover. They engage in a simple conversation, however the way Godard presents the conversation is simply audacious and astonishing. Firstly the characters are facing backwards to the camera, they talk to each other while not in the same frame and they only exist in their individual frame. This scene, as i said, is extremely audacious, as Godard breaks the rules of cinematic discourse, while brilliantly conveying the stages of their relationship, as the separate frames highlights the loss of connection and their love only exist through the reflection of a mirror. It is most definitely one of my favourite scenes of all time.Through the next episode, we see Nana at her work, i presume. The episode is short and simple, however the camera movements are once again brilliant, as the camera sweeps through the store continuously following Nana, it's as if the film is conscious of itself being a film. Furthermore, at the end of the episode the camera moves from Nana position to a view of the street that consist of no characters, it is simply a view, while a character speaks \"You attach to much importance to logic\". Superb.As the story unfolds we see Nana become more subordinate to men, as the homage to 'the passion of Joan of arc' and the disturbing 'first man', it seems inevitably of Nana descent into prostitution. As Nana is talking to her pimp, the camera moves once again to present two faceless faces, both in line with each other. The camera slowly pans left and right to reveal Nana reaction to the pimp. Once again the camera takes on a life of it's own, only concerned with the emotions of Nana rather than other characters. Furthermore, the simply vision of Godard to establish a shot like this, and the blocking of people is amazing to watch.Through this review i have simply interpret 'Vivre sa vie' as purely subjective, my interpretations could be completely wrong or right, but it doesn't matter, because that's the beauty of this film, it's beautifully ambiguous, it offers multiple subjective views, and the innovation is amazingly authentic. For the audience that appreciate the cinematic boundaries Godard has created, you cannot miss this.",
            "review_date": "2012-08-10"
        },
        {
            "review_title": "Godard - father of inventions",
            "content": "I usually try to form my opinion about films based on how entertaining or interesting or enriching or none of these I felt that they were during the time spent watching them. Only afterwards I try to understand why I liked or disliked the film, what caused me to find it funny, what I had learned from it, whether I exited as a better being (or not) at the end of the film. In the case of 'My Life to Live' (the original French title is 'Vivre sa vie' - 'Living her own life') going back to the roots of the pleasure of watching this movie also means placing it in the context of the cinema at the beginning of the 60s, and the extraordinary revolution brought by a handful of French directors Jean-Luc Godard was part of, in the way movies are made and the way spectators watch movies and relate to them.The story in 'Vivre sa vie' is pretty straight-forward and there are no explicit social or political messages as in other films by Godard or his colleagues. Nana (Anna Karina) is a young woman trying to build a path for herself in the Big City, failing, and sliding slowly on the slope of prostitution. The film follows her unsuccessful attempts to meet ends, followed by a decision that mixes innocence and reluctance to engage in the oldest profession, while keeping alive her ingenuity and desire to live her life. There is no moral hesitation and no risks assessment in what she does. Godard approaches what can be otherwise described as a descent in hell with an apparent phlegmatic approach, almost as in a documentary or as in what we call nowadays a docu-drama. This is reflected in the places he is filming (more or less chic areas of Paris) and in the selection of his actors - the pimps and the customers of the sex trade look no different than any of the other guys next table in the brasserie. There is only one violent incident in the story that could have been a warning about the dangers ahead, but it is dully ignored. The desire to live a good life prevails.The choice of the actress may have been quite obvious, as Godard had married Anna Karina the year before the film was made. The role may even have been written for her, but the way he directs the young actress is part of his manner of telling the story. Karina's Nana is beautiful and ingenue, she just makes her choice about the way she wants to live her life without awareness about the price to be paid. Is there a final realization of her mistake? Maybe she gets it in the last second of the film, but it's mostly to the viewer to draw the conclusions.There are so many cinematographic innovations in this film made at the beginning of the 60s that any list risks to be partial. Filming some of the dialogs without seeing the faces of the actors, using live and sometimes hand-held camera on the streets of Paris, inserting legal and documentary book texts to illustrate the decision of Nana at the key moment when her destiny takes a turn, using close plans of the actors faces to emphasize their feelings (some times with help from the wonderful music of Michel Legrand) are only part of these. I especially loved two scenes: the film in film screening of 'Jeanne d'Arc' which is a fascinating declaration of love for cinema, and the dance scene which predates by more than three decades what John Travolta will do in Pulp Fiction. No wonder, as Quentin Tarantino lists Godard as one of his idols. One element which may seem today experimental was not such actually - it's the black-and-white film - that was the period of transition to color, which still was expensive and - luckily - the young French new wave directors and their producers could not afford it.The final of the 12 chapters of the film includes a glimpse on the streets of Paris where people stand in line at the cinema house to see François Truffaut's Jules and Jim. A reverence to his colleague of generation who broke through a few years before, and whose fame Jean-Luc Godard was soon to equal.",
            "review_date": "2018-01-26"
        },
        {
            "review_title": "Only the French could make a dull film about a prostitute",
            "content": "Years ago a book caused a scandal in France, being an explicit account of the author's erotic adventures. I browsed the hyper-intellectual text and thought, \"Only a French author could make all this boring\". I had a similar reaction to this film, not only because of the episodic approach to story-telling, but right off the bat because Anna Karina's face just SCREAMS Parisian intellectual, an effect only enhanced by the lengthy word games which start the film. The dialog tells us of her character's financial desperation without her face for a moment expressing it. Only when she tries to steal the key to her apartment do we get some hint she's in dire straits (ironically, the concierge's husband rushing to comfort her may be the most \"felt\" moment in the whole film). As she takes on her new trade, presumably we're meant to take her character's complete lack of affect as showing her disassociation from what she's doing, but Audrey Tatou, as Amelie, showed a character's distaste during unwelcome sex far more vividly than does Karina, and in an instant. The sequences are largely set pieces, meant apparently to create a kind of docudrama on prostitution, but the complete lack of both affect and eroticism makes them like tableaux vivants. Above all, never does anything in the acting show us any depth of despair or desperation. It's all very matter of fact. Even one moment of fear seems very perfunctory and unconvincing. The effect in the end is that of a Parisian intellectual play-acting the life of a working class woman in dire straits. If you want to see someone from a far more privileged world embody such a life vividly and convincingly, watch Theron in \"Monster\". You won't find it here.",
            "review_date": "2020-05-16"
        },
        {
            "review_title": "a masterpiece",
            "content": "It talks about feelings and people, how short life is, and how people kill people as if they were shooting dishes. this film is a long way from classical movies in the visual aspect ( that's nouvelle vague), the director frames totally outside of the classical way,filming people backwards in conversations in bars, with the character below of the frame, or simply in the middle. All of this with sudden camera movements. This could desparate any viewer, who has only seen todays pictures (american films the most), they would say what a s**t!, but they don't have the fault, they haven't the chance of being teached about filmmaking. Advertising in this world influencies most of people, and the films that are advertised today are mostly a s**t (99%), but the massmedia puts the advertisement anytime, any channel, and you are almost forced to view the \"film\", because they put it easy for you, the best cinemas puts it in the best room, with the bigger screen, and people swallow it completely and then says: \"is amusing\", but they don't think about they have losen an hour and half or more. I love this kind of cinema (vivre sa vie), because it tells you the raw reality without masks, and doesn't lie you with the same old shit that rots cinema, with scriptbuilders that think little the stories and  let producers change their plans, so there are millions and millions of dollars inverted in visual effects that don't tell anything, characters completely senseless, and definitely a script with thousands of holes. Vivre Sa Vie, doesn't lie you, tells you that you are watching a movie, and that the person who is filming is a person like you. Tells you the filmmaking is something universal, and that with only a few money and much of imagination you can reach very far. Sorry for the sermon. But that's the cruel trueth",
            "review_date": "2002-05-02"
        },
        {
            "review_title": "The film assumes, in many scenes, a documentary, observational tone.",
            "content": "Shot in black and white, the film is narrated in twelve frames. As in other films directed by Godard, the camera is an observer who follows Nana (Anna Karina) into the world of prostitution. The film assumes, in many scenes, a documentary, observational tone.The script is not intended to explain much about Nana. Right off the bat, in a sensational shot, when she and the man she's talking to at a bar are shown from the back, but you can see Nana's face in the mirror in the background, we know the man is her husband who's separated, who left her son with him and who needs money. But it doesn't show us why. These are facts that interest the viewer to understand Nana's decision to prostitute herself.Nana is cold, doesn't show feelings, with rare exceptions, namely, in the movies when she cries watching The Passion of Jeanne D'Arc, 1928 silent film directed by Carl Theodor Dreyer, and when she happily dances Swing! Swing! Swing!, music by Michel Legrand, in a bar, around pool tables, with the camera rotating 360º. Interesting to note that Anna Karina would return to dancing in a bar in an iconic scene from the film Band À Part, also directed by Godard, released two years after Vivre Sa Vie.Even as a prostitute, Nana does not appear naked at any time and we also do not see sex scenes between her and her clients (there is only a hint in a brief passage in the hotel room where she worked as a prostitute).Godard makes several quotes throughout the film, as usual. Starting with the intertitles that precede each of the 12 frames, which take us back to silent films, which used this device to change scenes. He also silences dialogues twice, putting subtitles so that we know what they are talking about, another reference to silent films, which were also in black and white. It puts an impacting scene from The Passion of Jeanne D'Arc of two more minutes, trying to make a parallel between the suffering of Joan of Arc, masterfully played by Renée Jeanne Falconetti, and the suffering of Nana, who cries at the same moment that the heroine also cries knowing that she will die at the fire. Godard also quotes The Three Musketeers, by Alexandre Dumas, shows a character reading Complete Works, by Edgar Allan Poe, and has a great dialogue between Nana and a gentleman at the bar table (Brice Parain), in which Plato and German philosophers are quoted, and they still philosophize about true love.The soundtrack, composed by Michel Legrand, is a special case. In some scenes, the instrumental music punctuates what is going on with the main character, but is abruptly interrupted, as if it couldn't explain Nana's feeling.The original title - Vivre Sa Vie - can have two connotations, as it can be read as living your life or as living as a prostitute, since, as in Portuguese, at the time the film was shot, prostitute was also called a woman of life.Finally, Vivre Sa Vie has a tragic ending, a hallmark of several of Godard's films. This moral lesson at the end is what bothers me, but even so, it's a great movie and should be seen and reviewed by those who really love cinema.",
            "review_date": "2022-06-09"
        },
        {
            "review_title": "Perfect",
            "content": "Exquisite photography combined with a steady rhythm makes the film look rigorous and affectionate.\nThe deliberate jumping rhythm and rebellious spirit of the previous works were completely suppressed.\nPerhaps Godard lost his initial rationality in serious inquiry, or this film is a film paper written in poetry.\nWhen the functional lines changed from preaching to expression, Godard eventually emerged from the popular wave.",
            "review_date": "2018-11-30"
        },
        {
            "review_title": "Jean-Luc Godard, RIP",
            "content": "Jean-Luc Godard died recently, so I decided to watch one of his early movies. \"Vivre sa vie: Film en douze tableaux\" (simply called \"Vivre sa vie\" or \"Her Life to Live\" in English) is unlike any movie that you've seen. Anna Karina gives it her all as the errant Nana, whose ambitions eventually give way to reality, forcing her into prostitution.Undeniably, this movie was a key entry in the French New Wave (of which Godard was probably the number one doyen). Although the episodic story is about Nana's spiraling into the world's oldest profession, there are countless other things to focus on in the movie. It merits more analysis than I can provide here. Definitely check it out.And then that mention of Queen Elizabeth. Who would've ever predicted that she and Godard would die a few days apart?",
            "review_date": "2022-12-16"
        },
        {
            "review_title": "Vivre Sa Vie: Film En Douze Tableaux (Jean-Luc Godard, 1962) ***",
            "content": "If I had any real doubts that most American filmgoers are not entirely in tune with European sensibilities, this would have been the ideal film to prove it! As I rewatched VIVRE SA VIE, I was reminded that Godard had actually employed some \"extreme\" directorial touches which I had tried to use in shooting my own short films in Hollywood a few months ago, but to which most of my classmates and directing teacher objected to as being too \"avant-garde\"!! In any case, I have to admit a personal bias in favor of Godard's 1960-68 output which I find to be extremely innovative, intoxicating and, yes, perplexing; I also have a big crush on Godard's muse of the time, the enchanting Anna Karina - and the mere fact that she's in practically every frame of this film certainly aids in my overlooking some of Godard's cinematic excesses! It's always amusing for me to read Godard's dedications at the start of his films (in this case, B-movies!) which, invariably, hardly resemble anything found in the following product. Godard would go on to deal with the theme of prostitution in several other films throughout his career (including some of the many multi-national portmanteau films he had a hand in), most notably in TWO OR THREE THINGS I KNOW ABOUT HER (1967) and EVERY MAN FOR HIMSELF aka SLOW MOTION (1980). And whoever says that streetwalkers have no culture, better think again, as Anna Karina's character is seen reacting very emotionally to a theatrical screening of Carl Theodor Dreyer's sublime THE PASSION OF JOAN OF ARC (1928)! For some odd reason, the first time I had watched this movie a couple of years ago on Italian TV, it was severely truncated (lasting barely over an hour rather than the official 85 minutes!) but, for the life of me, I can't figure out now what had been cut - as the nude scenes in the film's latter stages were all intact!! What's worse is that this wasn't even the first time that an Italian TV screening I saw of a particular film was considerably shorter than anticipated: Carol Reed's ODD MAN OUT (1946), Jean-Pierre Melville's L' ARMEE' DES OMBRES (1969), LA SIRENE DE MISSISSIPPI (1969), THE LONG GOODBYE (1973), etc.!!",
            "review_date": "2006-02-20"
        },
        {
            "review_title": "\"Shouldn't love be the only truth?\"",
            "content": "MY LIFE TO LIVE is a drama about the degradation of a young life.A beautiful Parisian in her early twenties, leaves her husband and their son hoping to become an actress. She's a rebellious young woman who is prone to delusions. She elects to earn money as a prostitute. Soon she has a pimp, however, she meets an intelligent young man ...Mr. Godard has showed us the life of a young woman in the 12 short episodes. She has got a scar on her body or her soul in each of the episodes. A young person who is on the verge of despair, wants a better life. However, like most of the characters from the French New Wave, she is looking for something that is not precisely determined.The dialogues are direct and filled with dark tones. A depressive attitude is an expression of sincerity in this film. A technique and frames are quite strange. I had an impression that the protagonists flee from a camera in certain scenes. The story is intimate but not a quite tragic. Close-ups of the face of the major actress leave a strong impression of confusion and ignorance.Anna Karina as Nana Kleinfrankenheim is a lonely woman, who is lost in her own pathos and her inability to adapt to the real world. She is an outsider and every new experience strikes a blow to her self-confidence. In the end, she is cute and helpless thing who found meaning (love), for which she will not have time.This is very interesting, but not convincing.",
            "review_date": "2017-06-04"
        },
        {
            "review_title": "We are all prostitutes",
            "content": "A beautiful film with Anna Karina as it's star. Jean Luc Godard's films plaqued on consumerism, questioning it's effects on humanity. It always seems to go back to the old saying: \"When in Rome\".Karina plays Nana, a young woman and a victim to her world. She is a working class Parisian girl trying to survive as a carefree nymph, only to end up in a prostitution ring where she finally meets Mr right.Nana is a victim to her world and Godard wants you to feel it with his jerky camera movements and awkward moments of confusion. Godard pleases us with a dance number. Refreshing.The film is in black and white and shot in a documentary style at times. Godard has a philosophy about life in his 1960 films. He is quite aware of Western Culture's advance on the spirit of humanity. He has the liberty to make a film, using techniques rarely seen in American cinema that may seem eccentric and hard to follow.My Life To Live is a lovely film about what we all have become; Prostitutes to our Nationality. What and why are you working for is what Godard is asking.",
            "review_date": "2006-03-26"
        },
        {
            "review_title": "Worst Movie I have seen",
            "content": "Other than the beauty of the woman - this flick was drab, dull, and extremely boring. Rober Ebert (who raved about it) loved it and many others too - I have no idea why. The Jukebox dancing scene was pathetic. The diatribe about how Prostitution works was ridiculous, and yes the final scene was the most amateur, fake scene I have witnessed in a film. Oh well - it is \"Art\" I guess, and with \"Art\" you can get away with anything. Sort of like those paintings of a large triangle or circle that fetch $25 million. Same thing. I should repeat that the main character was beautiful and had completely stunning eyes. That was probably the one reason I watched the entire film.",
            "review_date": "2010-06-06"
        },
        {
            "review_title": "A joyous celebration of cinema",
            "content": "Godard's third feature film tells the story of Nana (Anna Karina) in 12 chapters. Nana leaves her husband, and is desperate for money. She gradually descends into a life of prostitution. This sounds like a dark bit of social realism, and while it has some aspects of that, this is really a film infused with Godard's early love of cinema. He strains against the limits of acceptability, trying things because he can. He shoots dialogue scenes from behind the speakers's heads, he pans his camera to look at seemingly irrelevant things, his cops up the score and drops snippets in at unpredictable moments. I know this makes the film sound insufferably pretentious, but this is not that Godard ... not yet. This film has joyous energy and I love it.",
            "review_date": "2017-07-03"
        },
        {
            "review_title": "that song!",
            "content": "This movie is very beautiful and one of the best films of the French New Wave. It's hard to say just what opinion Godard had with regards to prostitution, but there seem to be some definite feminist elements. Nana (played by Anna Karina) is a character whom we want to know so desperately, but Godard keeps our distance. The editing and framing is very interesting as well and there's one particular sequence that involves a gunshot which is very unique. I was just wondering if ANYONE out there knows what song that Nana plays on the Jukebox in this movie. It's so catchy and I heard that it was not French but American. Anyone who has any idea, could you email me at fangsofdeath@hotmail.com Merci!",
            "review_date": "2005-01-21"
        },
        {
            "review_title": "Live Your Life (Easier Said than Done)...",
            "content": "What would you do, when you're money's all run through, and there's nowhere left to stay, but if there was you couldn't pay; how would you feel, as the world becomes surreal, with opportunities restricted, coming close to be convicted; would you give yourself to others, be consumed, encased and smothered, letting people you don't know, go cheek to cheek, above, below; would you overstep that line, always accept, without decline, dancing to the grinders tune, with inhibitions now immune; when the world does you no favours, and there's nothing left to savour, can you really be that sure, you won't knock at, the devils door; as the pressure and the pain, bellow the all-consuming flame, just remember each new day, you have a voice, something to say.Anna Karina is outstanding.",
            "review_date": "2023-01-18"
        },
        {
            "review_title": "Film School Students Will Salivate",
            "content": "This is a very Godard type film as it meanders with a character through a partially vague and open ended story. Typically, this is a Love/Hate for many but one certainly great for further examination in film classes. The young female protagonist is wrestling with her search for love, while also being penniless, ambles through the days. Sounds like a stereotypical 60s Italian film with outstanding cinematography and local city settings as it paints a romantic picture of Italian life. Yet we watch the lady make some difficult choices as she is led into the life of a call girl as she gets involved with the wrong crowd. As the story is told, there are many poetic lines of dialog about love and life and the meaning of it all. There are many nice cinematic moments of camera movement and some slick editing as it was broken up into 12 vignettes and the end really whacks you in the face....just like Will Smith. Too soon? LOL.",
            "review_date": "2022-04-26"
        },
        {
            "review_title": "vivre sa vie",
            "content": "Kinda has a \"Jeanne Dielman\" vibe going on, no? In its sympathetic depiction of a gal at financial loose ends trying to make a living as a hooker and, in the process, having to put up with lots of creepy men. Unfortunately, the comparison with Akerman's film extends into the realms of ennui, especially in that excruciatingly dull, ten minute scene that seems like twenty with Nana and an elderly intellectual in a cafe (of course) wherein are discussed such eternal soporifics as truth and language while Plato, Hegel and Leibniz are referenced and you feel as if you're trapped at the Sorbonne with a couple of bores. I wouldn't have minded this enervating stuff so much had it occurred sooner, but coming just as Godard's pace was quickening and just before the dramatic denouement it manages to drain said ending of most of its impact and makes you want to shake the film maker and tell him to stop indulging his penchant for Gallic philosophizing.But that's Godard for you. A veritable roller coaster of a director. One moment you love him, the next you want to immolate him. And sometimes in the same scene! So, let's give this one a B for tableaux 1 through 10 which contain some of the best depictions of the workaday life of a tart that I've seen put on celluloid.",
            "review_date": "2023-02-26"
        },
        {
            "review_title": "Jean Luc in Love",
            "content": "Featuring his new bride and purported \"muse\" Anna Karina, Jean Luc Godard's Vivre Sa Vie is an episodic (12 segments) tale of a coquettish young woman with dreams of becoming a movie actress, quickly dashed by men as exploitive as she is with her comely looks. She has suitors but for someone broke and unable to get back into her apartment rejects their paltry offers before spiraling into streetwalking.The chapters are hit and miss, some sharp, some dull. Godard is both cold and clinical (and informative) on the relatively well run industry of prostitution in the City of Lights while his camera continuously makes love to Anna's Louise Brooks look in close-up, capitalizing on it with his offbeat style of going against the traditional grain.Godard and lensman Raul Coutard offer up some economically interesting canvases and tracking while others are whimsically tedious. There are provocative moments but an uneven mix of breeziness and banality that gives you the feeling Jean Luc is developing the script as he's going along. A clumsy rushed finale (homage to Breathless?) reinforces this but not before some moments of Godardian panache and pretense fascinate and bore. A draw.",
            "review_date": "2023-02-27"
        },
        {
            "review_title": "Tragedy In its Sad and Depressing Depiction",
            "content": "Followup to Breathless(1959) that is another brilliant film from Jean Luc Godard. The Story is about a woman who doesn't know what to make of her life and is someone who is not ambitious.  Like the main character from Breathless, Nana is a doomed character who is naive about the world around her.  Filmed in documentary style story, My Life to Live is split up into different episodes with each showing what Nana Does with her life.  My Life to Live(1962) in my opinion manages to be better than Breathless(1959) because the character here is more sympathetic and tragic.  Similar to many of the films of Abel Ferrara who dealt with people who are lost souls.  The ending is funny and sad at the same time.",
            "review_date": "2001-04-29"
        },
        {
            "review_title": "My favorite Godard so far",
            "content": "It's painful to watch someone's descent into prostitution, especially if that person is Anna Karina... Godard's best movie so far (watching his filmography in chronological order), it felt personal and non-pretentious unlike his other films. Machine gun scene was amazing!",
            "review_date": "2020-06-13"
        },
        {
            "review_title": "Quintessential Godard, which means ruminations about life and truth are sometimes lengthy",
            "content": "It's set in 1962 in Paris, France. It follows several months in the life of a young woman who chooses to become a prostitute after failing to find a career in films. The movie is composed of 12 short episodes that chronologically follow her life.Nana Kleinfrankenheim (Anna Karina) is 22 and has just separated from her husband, Paul (André S. Labarthe) and young child. She is self-reflective but aimless and has dreams but seems overwhelmed by life. She is constantly short of money and often tries to borrow 2000 francs ($100 US in 1962) from her ex, friends, or fellow employees. Finally, she turns to prostitution to support herself. This step puts her in touch with an old friend, Yvette (Guylaine Schlumberger), who links her with a pimp, Raoul (Sady Rebbot).We hear details about the business of prostitution but see moments of self-reflection (when Nana watches the silent film from the 1920s, \"The Passion of Joan of Arc). She has an increasing sense of the inevitability of it all. Just before a dramatic ending she seems ready to start a new life phase with \"a young man\" (Peter Kassovitz).Anna Karina and Jean-Luc Godard were married when this film was made, and the camera is in love with Karina's face. Godard hits us over the head with her self-reflection when we see Nana and Paul's initial conversation in a mirror. And life never measures up to the vision.This film is quintessential Godard, which means much is obscure, and ruminations about life and truth are sometimes lengthy. Michel Legrand's music fits perfectly. No one but Nana has a real personality.",
            "review_date": "2022-09-14"
        },
        {
            "review_title": "Don't see",
            "content": "Worst movie I saw, it just took one and a half hours of my life",
            "review_date": "2019-10-19"
        },
        {
            "review_title": "Her life, and our new-wave aesthetics",
            "content": "Some of us filmgoers went very much Godardian in the 1960s. Not all of us. Only avant-garde buffs who attended midnight shows , for example at the Paysandu Theater in Rio de Janeiro. We loved Godard's films. As much as we talked about Tarantino after Pulp Fiction, we talked about him in those days. But now the name Godard inspires a blank, sometimes hostile face from filmgoers. Art films are out. Marvel & DC are in. Self-consciousness is out. Sex, violence and escapism are in. Films that test the edges of the cinema language are out. Mass audience is what it is all about nowadays. Narrow tastes are in.\nI still choose A Bout de Souffle (1960), which fired the opening salvo of the Nouvelle Vague, as Godard's best . It had us all talking about \"jump cuts.\"\nLuckily for moviegoers, Godard redefined the definition of the so-called seventh art.\nUnfortunately, however, during a two-year period from 1969 to 1971, he turned his back fully on the understanding of classical cinema and, with a Maoist group named Dziga Vertov, tried to combine what he called experimental film with the revolutionary struggling movement, making lousy political films.\nBut \"Vivre Sa Vie\" is still very good, actually extraordinary. Susan Sontag described it as \"one of the most extraordinary, beautiful, and original works of art that I know of.\"\nEach shot begins with Michel Legrand's subdued music, which stops abruptly, to begin again with the next shot.",
            "review_date": "2019-10-24"
        },
        {
            "review_title": "maybe u like godard maybe u dont",
            "content": "Well, it took me five films, but I've finally had my Godard epiphany. At long last, I accept the man as a truly GREAT filmmaker, and not just a talented stylist. Needless to say, this is my favorite of his films, and I'm definitely developing a crush on Anna Karina. A beautiful tribute to love and the best film I've ever seen about female belittlement in a male-dominated society.",
            "review_date": "2020-08-27"
        },
        {
            "review_title": "YOU'VE SEEN THIS STORY A MILLION TIMES!AND MUCH BETTER!!!",
            "content": "A lonely, impoverished woman sadly slides into prostitution and comes to a bad end.  An often filmed story is given a  slow,lousy, docu-style treatment.  Maybe original for it's time, but any tv movie on the same subject would be much more worth your time than this time-waster.",
            "review_date": "2001-08-11"
        },
        {
            "review_title": "Saturated with style; dehydrated of substance",
            "content": "A woman engages in contemplative thoughts and conversations. There you go. That's what it's about.I was enthralled with the camerawork...shots from the backs of heads, the minimal panning of the camera from right the left and back and forth, the cut-aways, the segmentation of presentation in, for lack of better description, chapters. In short, this film's style is exhilarating.As far as substance, I was left with an existential feeling of Peggy Lee's hit Is That All There Is? In other words, so what? We all have dreams and aspirations. Most of us never see those come to fruition. And if you're destined for tragedy, you can guess the rest.So what?",
            "review_date": "2023-02-03"
        },
        {
            "review_title": "I film therefore I am",
            "content": "See Adrin Neatrour crits at www.crinklecut.co.uk After the opening title sequence Godard's Vivre sa vie cuts to a long durational close shot in which the camera, tracks between a couple who are seated beside each other on bar stools at the counter of a café. They are talking about the nature of their relationship and its break up. As the camera tracks back and forth across the space between them, only one of them is ever in frame, and the shot set up is from behind, so that as they talk, we see only the back of a head.The what is said by this shot is in itself both witty and analytic. It allows the camera to express the opening concepts of alienation, separation within a context of movement. The wit lies in emotionally de-saturating the dialogue from faciality as Nana and her ex talk about the failure of their relationship her beef about his attempts to control her and his economic angle as Nana's ex signs off with the observation that as a musician, Nana is leaving him because he is poor. The ultimate deficiency in a culture based on consumption rather than production.With Anna K playing the role of Nana Godard's film is in content, a modernist rephrasing of Zola's eponymous novel charting the transformation of a young operetta star into a high class prostitute, whose allure and cold blooded exploitation of her sexuality destroy all the men who become infatuated with her.The power of Nana's presence is described by Zola as a psychic emanation that irresistibly attracts male desire. Godard's transposes elements of the Zola story. But because this is now an image driven culture, his Nana in the form of Karina, exists as an object of desire for the camera. It is Godard's camera that loves her image embraces and devours her. When Nana leaves her job in the record shop and takes up prostitution, her male clients barely seem to notice her. Throughout the film the men are self absorbed, as if playing pinball or engaging in masturbation, they barely notice Nana. She is simply someone they pay. Unlike their wives or girlfriends they have to shell out coin.The ethos of cool detachment pervades Vivre sa vie. The guys all wear coats turned up at the collar as they move through a world of artefacts, cafes, and automobiles. The women, immaculately coiffed and kitted out with couture outfits and shoes. It is a world without emotion, the world of advertising, where there are settings backdrops and product display.But Godard fixes his movies with pure concept. To oppose Nana's image defined world he uses a number of cinematic devices, simply interpolated that he cuts into the body of the film. Like the chapter headings they comprise a breaking up of flow, an opening up different idea spectra about what we are seeing.The inter cutting of a section of Dreyer's The Passion of Jean d'Arc. Godard uses a scene with Artaud, theoretician of the theatre of cruelty who plays the monk, Massieu questioning Falconetti's Jeanne. The Material grilling the Spiritual. A section of Edgar Allen Poe, the master of unnameable dread (uncool) is read on camera and later during one of Nana's assignations with a client, the results of the statistical survey of Parisian prostitution are intoned as voice over.There are two more extraordinary interpolations inserted of the body of the film. The scene where a guy mimes the process of a little boy blowing up a balloon. As performance it is intense funny and suddenly in its intensity and power feels like a transposition of male ejaculation. A hyper parody of in-existent sexuality. In a nondescript section of a cafe, Nana and a Philosopher talk about life specifically focusing on 'love' (uncool) at the end of their discussion. Unlike the tracking two shot at the front of the movie, this is shot full face with and pans from Nana to the Philosopher, with the Philosopher finally concluding, in response to Nana's question that love is real \"\u0085on condition it is true.\" In a culture of image how to find what is true and be able to distinguish it from what is not true? In a world of mirrors\u0085.Eddie Constantine appears as a spectre throughout Vivre sa vie. His presence as an image inside Nana's head a constant source of reference. And it is almost as if he were in the film, and if you squint your eyes you may see him.With Godard, film doesn't just think, it lives and breaths a world of unseen possibilities .",
            "review_date": "2016-08-03"
        },
        {
            "review_title": "A KINEMATIC EXPERIENCE",
            "content": "Filmes Fodásticos  motto, taken from a phrase by Roger Ebert, states that films are windows in the space / time boxes in which we live. Therefore, when looking through these windows, we will be out of the box for a few moments.Jean-Luc Godard's My life to live is a classic example of out of the box movie. Released in 1962, at the height of the nouvelle vague of French cinema, the work can be considered a kinematic experience rather than a cinematic one. The big thrill comes from Raoul Cultard's nervous camera that throws the viewer into the scene.Based on a trite screenplay that would be considered extremely prejudiced these days, the film tells the story of Nana, played by Godard's then-wife, model Anna Karina. It is her face that opens the film as if posing for portraits, in profile and front, to the sound of Michel Legrand's music that, according to the director's wish, simply stops, and reappears in the next scene.There are twelve chapters, with long titles that reveal in advance what will happen. It's said that they were filmed in single takes, which means that takes were transformed directly into shots without any editing.Nana is a young Parisian girl who has just split from Paul with whom she left the couple's son, from whom she asks for photos, in a scene filmed at a coffee shop counter behind the characters. That is, we only see their napes and a blurry reflection in the mirror.Although nothing is known about his motivations, the narrative focuses on Nana. She plays pinball and works in a record store, but has financial problems that force her to try to steal the key from her apartment, held by the concierge possibly for lack of payment.Passing a street where prostitutes work, Nana accepts a man's invitation and begins to prostitute herself. At first she refuses to kiss the client, but then we follow her progress, narrated as if it were a documentary about prostitution in Paris.When enchanted by a young student, the woman decides to leave \"life\" (the name given to prostitution in France), but her pimp certainly does not agree with that, and takes drastic measures to regain his marchandise.",
            "review_date": "2019-12-28"
        },
        {
            "review_title": "wonderful",
            "content": "Apart from the fact that a woman as beautiful as Anna Karina would never have to turn to prostitution, and also that it doesn't just take desperation for a woman to turn to prostitution, but a woman who has been sexually abused in her childhood, this movie was great. I suppose the apparent situation isn't the point of the film, it is just a mask.Here is my VERY brief summary and interpretation: Nana is a very idealistic young woman and she has her sights set on being in the moving pictures and kills herself in a roundabout way because she couldn't realize that she is in a movie. It was right before her eyes the whole time and she couldn't see it.",
            "review_date": "2003-08-09"
        },
        {
            "review_title": "movieinthepark.blogspot.com",
            "content": "By Jean-Luc Godard, Nana (Anna Karina) left her life to become an actress in Paris. As expected, she does not succeed and finds it very tough to make a living. She eventually ends up in despair and when a friends tells her that she prostituted to get easy money, Nana reconsiders her job at a record store and gets a pimp. It's easy too understand why Vivre Sa Vie does not show up between Godard's most famous movies. Firstly, the point of dividing the movie in twelve scenes is quite odd. Tough the story has some continuity the scenes aren't expressly combined. Not saying the movie is boring, it's just easy to lose interest. The best feature lies on some dialogues. Mostly two, at first between Nana and Yvette(Guylaine Schlumberger) and the latter with le philosophe (The philosopher - Brice Parain), especially the last one, where its reconsidered the difference between thinking and talking, as well as its necessity, between other very interesting topics. Very inspiring scene indeed. Anna Karina, who also performed Odile in Bande À Part, showed a great versatility though it wasn't very captivating despite her lovely fairness. 7/10",
            "review_date": "2011-08-28"
        },
        {
            "review_title": "Excellent movie by a gifted author",
            "content": "Excellent movie by a gifted author; One of his best 60's movies.   Skilled camera direction, editing and artistic experiments on the visual side and. on the other hand Godard  film is not completely heady - Nana is a very appealing character, and the structure of the film won't prevent you from sympathizing with the heroine.",
            "review_date": "2002-09-26"
        },
        {
            "review_title": "Is youth to be wasted?",
            "content": "\"Vivre sa vie: Film en douze tableaux\" is another one by Godard (\"A bout de suffle\" was the previous) about wasted youth, going down and losing any sort of control (plans, dreams, perspective, whatever) over life.In this case it is a brief and intense story of a young beautiful woman (Nana) confused whether to pursue the acting career and at the same time desperately trying to make the ends meet and therefore opted to prostitution instead.Youth is a time when we are particularly fragile and vulnerable, when lifetime opportunities are mixed with risks of failing big time, and many factors, events, acquaintances may influence our choice and chances. Yet we are fully responsible for what we do and the current state is the consequence of our actions. In one scene Nana says the more or less same thing.She is not dumb, spoiled and empty-headed chick, on the contrary, however her choice and actions led her to the downfall and no one cared or tried to help her like it usually happens in life, sad and sometimes cruel and ordinary thing. And the genius of Godard revealed in making it rather disturbing and thought-provocative in the minimalistic and very expressive way. One might also find it especially poignant as we all have our moments wasted perhaps not so dramatically. Anna Karina is absolutely stunning in this film, her yearning eyes filled with melancholy, confusion and sadness and fragile beauty are captivating.",
            "review_date": "2011-06-28"
        },
        {
            "review_title": "very innocent",
            "content": "watching this movie of 1962 in 2016, one should interpret and asses the movie accordingly. this may contain Spoiler . At first the story seems to be an usual story of a girl pursuing a carrier in cinema while falling to the prostitution. To me it is an in-depth analysis of a woman's life. the prostitution as an occupation is the medium to make this analysis. the scene where they missed the movie and she has to wait her boss talking to one of his friend and because she gets bored and the friend of her boss childishly tries to cheer her up, she dance is so innocent and breathe-taking.",
            "review_date": "2016-12-29"
        },
        {
            "review_title": "Nana and Paul are broken. They placed their child in a place because they haven't any money. Nana still loves Paul but she would like to change her life. So she sees other men. Without money times are diffi",
            "content": "Fabulous movie from which Quentin Tarentino was inspired for all his gangster movies ! Especially when Nana and the philosopher talk about speaking and silences. Doesn't Nana hair looks like Mia's in Pulp Fiction !!!!",
            "review_date": "2003-11-28"
        },
        {
            "review_title": "No let-downs sofar.",
            "content": "After becoming interesting in a particular director I feel the need to see as many of his films one after the other. But with this I always fear I'll stumble across one that is a major let-down. This was not so with Vivre sa vie, the fourth Godard film I've gotten my hands on, the third starring Anna.I was expecting a lot less from this film than I got. After comparing a couple of Anna's roles I was very impressed with how malleable she really is. It's amazing how convincing she can be. She's not only the most beautiful French actress I've found, but quite talented as well. Even the attitude of her character, Nana, at the beginning of the movie as compared with her attitude at the end, you could see the change. Whether that was the work of Anna, Godard or both, very impressive.Also, the shots were particularly beautiful, i.e. the glowing eyes in the dark. The incorporation of music, the cut chapters... Quite a film, indeed. Godard seems to seems to have it 'all down.'",
            "review_date": "2003-11-27"
        },
        {
            "review_title": "Just poetry",
            "content": "What happens when the cinema stops being narrative? is the question that Godard asks us with Vivir su vida. In addition to being a profound meditation on sex and human will, it is one of his most complex films, in which his cinematic intelligence is appreciated: he continually reminds us that we are spectators. This reflection is part of Godard's intention to seek the true nature of cinema; what it is, what it does and what it can become. All this makes Vivir su vida is one of the greatest exponents of the Nouvelle Vague and one of the masterpieces of its director.Living Your Life tells the story of how Nina (Anna Karina) leaves his husband to slowly immerse himself in the worlds of prostitution. There she meets Raoul (Saddy Rebbot), whom she falls in love with. However, they conflict when she tries to flee the streets. All this, in a country worthy of the 60s, in which pimps and gangsters fill the streets, while philosophers and writers populate the coffee shops. However, the clichés typical of film noir do not go beyond complicit winks to the viewer, since any possible cataloging is subordinated to Godard's original way of making cinema.But one of the most innovative aspects of the film are the twelve altarpieces that divide it. These act as a short, non-conclusive synopsis and are framed within the film's accumulation of narratives. This, apart from his apparent criticism of previous cinema, is part of Godard's play on words and images: a union of a disparate nature with which he plays and opposes sensations. In Vivir su vida, the word conceptualizes, and the concrete image; while the narrative gives global cohesion. Therefore, it depends on which scene, the Parisian director emphasizes one aspect or another. This is especially seen in the first scene. In it, by not directly showing us the faces of the characters, it gives priority to the word over the image that is denied to us.On the other hand, the scene in which Nina writes the letter, the opposite effect occurs: the text does not have as much importance as the aesthetic value of each of the letters that the protagonist makes. Hence it is also said that Godard's cinema is, in addition to being intellectual, poetic on many occasions.At heart, Vivir su vida is a film, in addition to criticism, of cult towards the actress of Nana, then Godard's partner. It is the perfect observation of her muse. In the film, there comes a moment when the image of the word is dissociated and a poem by Edgar Allan Poe is introduced (curious fact: read by Godard himself): \"this is the story, that of a painter who portrays his loved\".The poem acts in an essayistic way in contrast to Nana's face, who remains expectant. With this small gesture, Godard intellectualizes his work towards the fascination towards his muse. It is the fusion of poetry and essay, combined in the same way that the image and the word do.Another question posed by the film is How should we look at Nana? it is shown to us from a thousand different perspectives: from the front, from the left, from the right ... It is a struggle of concepts, of points of view about prostitution. And Godard criticizes him by calling his work \"Vivir su vida\", which signifies both the primacy of Nana's decision to be a prostitute and our rejection of someone who voluntarily chooses him. And in the face of this genius, the only thing we can do is look. Look predisposed that this perfect essay captivates you, absorbs you and questions reality.Nana: Why must one always talk? Often we should't talk, but live in silence.",
            "review_date": "2020-11-18"
        },
        {
            "review_title": "This film has everything!",
            "content": "'Vivre sa vie' has been my favorite film for a long time and I do not feel the need to write a long review explaining why I like this film so much. Instead, I would just like to say that for me, there are two ways of watching it: with subtitles and without subtitles. As I do not speak French, I need to use subtitles to follow the story, but I also like to watch it without the subtitles. Mainly because of its brilliant cinematography. The camera angles, the sets, the use of music/sounds and Anna Karina's undeniable beauty make this film interesting to watch even without paying any attention to the story at all. That said, the story is not worth any less than the visual beauty of the film.",
            "review_date": "2010-08-11"
        },
        {
            "review_title": "Godard's Experimental Cinema Verity proves a point beyond ever being functional!",
            "content": "Great Cinematography concerning Lightning and Composition, Impeccable Acting and Compelling Storline! But in addition to the above Godard's choice of just being Experimental for Experimentals Sake to which many Directors find themself in a very Indulgence state where the discussion arises to fact out it's functionality. Movie making is a process in which all the elements which serve the Image telling are combined, woven into eachother like that which maketh Silk. It is much like preparing ones favorite dish, whatever dish this maybe, each ingredient should serve it's final purpose! If one of these ingredients stands out to sharp the taste may have a somewhat \"uncomfertable feeling\", it certainly register's in the subconscious as being unbalanced.Godard makes the viewer too aware of his presence, I believe it's intentional since one is stained for being Experimental. Some of the scenes are downright distracting, tearing apart the scene nuance from the players. I hope Movie makers like me are there to tell and let you dwell, since it is shamefull to make you aware that the movie maker is at work disregarding the magic that was about to happen to the audience. Experiments should function as a whole and not be marked as stand alone.Movie makers like Ford, Wyler, Dmytryk, Fritz Lang, Capra, Scorsesse, Martin Brest and many others know the secret of Image telling which is simply using all means to drive you, involve you and let you participate in the Art of Storytelling. Never alienating you. Never seek after their own indulgence. The Art is to decode your life experience and your message to the level of comprehension and compassion of the viewer. Yes, while one should never underestimate the audience, one should take great care in not tearing the greatest form of onscreen magic in front of their eyes. Share the experience and you will be respected!",
            "review_date": "2001-02-07"
        },
        {
            "review_title": "i thought i 've watch Tarantino in 1960",
            "content": "I never like black and White movie before i watch citizen Kane, but after i watch it, i was amazed. It was a wonderful movie with surprising technique. And then I'm searching for another b/w movie. I read a movie review about french new wave, then i found talented director from french, Jean Luc Godard. his talent broke many rules in movie making, like jump cutting, a circular 180 degree panning, long take shooting. The movie itself divide with 12 chapter. it begin with long dialog of Anna Karina with her husband, similar with Tarantino dialog in Pulp Fiction opening. Another scene that i like is the record store scene where the camera follows Anna Karina movement and slowly rotate 180 degree to outside, to side what has happened on the street. And the story itself its about freedom. Anna Karina choose to leave her husband,and become prostitute in Paris street. but every options take responsibility like her dialog with local philosopher in some café. And her pimp shoot her at the end of the scene. What a tragic life to live........",
            "review_date": "2005-12-12"
        },
        {
            "review_title": "God-ard",
            "content": "Brilliantly shot story of an aspiring actresses' descent into prostitution and beyond.  The frame compositions are always starling and provocative, Karina is marvelous and there's one heck of a great discussion on silence vs. speech.  Broken into 12 chapters, you are often left a little confused as to how much time has passed and what exactly has transpired, but that makes each segment so interesting.  One of the most ironically named films I've seen, My Live to Live is a seminal work >",
            "review_date": "2000-03-23"
        },
        {
            "review_title": "my LIFE to LIVE",
            "content": "\"VIVRE SA VIE\" - the best movie ever. you must see it if you love cinema. ana karanina marvellous.",
            "review_date": "1998-12-29"
        },
        {
            "review_title": "A raw and beautiful Godard masterpiece - he refused to succumb to the mainstream",
            "content": "This is a very special Godard film. Firstly, Godard is directing his lover and so we are privy to a very intimate, almost voyeuristic relationship between the couple, ie. Karenina and Godard. The rawness of this film, and the nakedness of his female protagonist (not literally) is common of Godard films. Think Jean Seberg in A Bout De Soufflé. His beautiful female leads are improvising to a large extent so we get to see their real personalities, fears, hopes, dreams. Much like a home video of sorts.I am dying to know what song is playing when Nana dances around like a silly little girl in the bar, trying to get the men's attention. And the beautiful song, that tells the story about a man's love who he adores even though she is far from a movie star. This plays in the scene in the cafe when Nana is making eye contact with an attractive young man.",
            "review_date": "2006-05-03"
        },
        {
            "review_title": "Anna Karina ....",
            "content": "Anna Karina looks so beautiful in this, her husband Jean Luc Godard's fourth feature film.Inspired by Bertolt Brecht's plays, the film is divided into twelve chapters introduced by title cards.We follow Karina's character Nana into a world of casual and then full-time prostitution.My favourite chapter was the one where, after an associate of her pimp has demonstrated impeccable mime skills before settling for a chat about business at a far table, she dances around a pool table playfully to try and seduce a shy young man.",
            "review_date": "2019-09-08"
        },
        {
            "review_title": "THE DEATH OF CINEMA BIRTH OF LITERATURE",
            "content": "Society wanted to create a romanticized world as if from Literature with a quintessential hero. Cinema came in and destroyed it by realistically portraying violence and the anti-hero as the protagonist - through images and sound. Society fell and cinema become the four front for storytelling. Literature DIED,  but was resurrected by the death of cinema. Who killed cinema? I believe that television and the Hollywood cinema killed the art form which in turn killed cinema overall - I mean there are still movies being made but they're movies, not cinema. Cinema is still here but not as appreciated as once was. Literature has made a comeback, literature is not a bad thing contrary to what I have been saying. I am plainly juxtaposing the rise and fall of both cinema and its counterpart - literature. I could elaborate, but I'm just trying to make a statement - not trying to create a book out of my optimism. Society will never be the same due to cinema.",
            "review_date": "2004-02-08"
        },
        {
            "review_title": "Marvelous Film",
            "content": "I remember the first time I watched a Godard film I struggled with the first 5 minutes. Ever since then, the more I watch his work, the more I enjoy it. This film being no exception. I really like the way it is done, I think it is rather clever. For starters it is cut into 12 episodic type parts, which is a very interesting technique and is executed to near perfection. Then it's the camera movement. Also marvelously done, I especially like the sections where they hide the faces of the two people talking, only showing you the rear of their head(s). Story is pretty decent too. I thoroughly enjoyed the movie, and didn't get bored once.",
            "review_date": "2022-01-11"
        }
    ]
}