{
  "title": "Roman Holiday",
  "rating": 8.3,
  "release_date": "1953-08-27",
  "summary": "Princess Ann (Hepburn) runs from her duties while in Italy and meets a reporter (Peck) looking for an exclusive story. He acts as if he doesn't know who she is but he soon finds himself falling in love with her.",
  "critic_reviews": [
    "With Gregory Peck and Audrey Hepburn turning in superb performances, Roman Holiday is 118 minutes of sheer entertainment.",
    "The film has enough adventure and excitement to satisfy, and the faintly bittersweet note of the ending is made deliciously palatable by its artistic rightness.",
    "[William Wyler] times the chuckles with a never-flagging pace, puts heart into the laughs, endows the footage with some boff bits of business and points up some tender, poignant scenes in using the smart script and the cast to the utmost advantage.",
    "It delivers on everything it promises, from the modern day reverse-Cinderella fable to a fabric of low-key humor. [Review of re-release]",
    "It is a contrived fable but a bittersweet legend with laughs that leaves the spirits soaring.",
    "Witty, warm and beautifully filmed by Franz Planer and Henri Alekan, it remains an unabashed romantic delight, with Hepburn particularly luminescent. [Review of re-release]",
    "The film itself is a classic of romantic wish fulfillment, exactly the sort of beautiful lie that Hollywood specialized in. [Review of re-release]",
    "Wyler lays out all the elements with care and precision, but the romantic comedy never comes together - it's charm by computer. [Review of re-release]"
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAudrey Hepburn embodies the sweetness of a girl searching for a better life and a sense of freedom in a beautiful romantic comedy shot in Italy only 8 years after liberation in WW2, also featuring charismatic actor Gregory Peck has the man who she is destined to love forever, as they both make a great screwball journey of self-discovery and enjoyment until the ending",
      "review_date": "2015-04-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A sweet film, with unassuming and natural performances from all involved. It's not a clever film, it's here to entertain and there is enough humanity to captivate and make light of a serious situation. There is nothing more fascinating thanA sweet film, with unassuming and natural performances from all involved. It's not a clever film, it's here to entertain and there is enough humanity to captivate and make light of a serious situation. There is nothing more fascinating than seeing the newly liberated Italy, post WW2, through Hepburn's innocent eyes. It is simultaneously educational, filmed on location in Rome, and hilariously funny and Hepburn has never looked so magnificent on film. They certainly do not make films with such integrity anymore.  9/10  91/100",
      "review_date": "2011-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Back when I reviewed La La Land, I discussed postmodernism. In particular, I discussed the concept of hyperreality. For many cities, such as Los Angeles and Paris in La La Land, the way in which they are perceived by many does not actuallyBack when I reviewed La La Land, I discussed postmodernism. In particular, I discussed the concept of hyperreality. For many cities, such as Los Angeles and Paris in La La Land, the way in which they are perceived by many does not actually exist. These cities tend to be dream-like cities that people, over time, have romanticized heavily. Others can include Tokyo, Manhattan, Las Vegas, Miami, or maybe even London. These cities are ones where people have a concept of the city in their mind, but when they arrive, they realize the city of their dreams is not located there. What they imagined was this hyperreality that, in fact, was never really there. Rome, where Roman Holiday is obviously set, also meets this measure with various films and individuals romanticizing Rome to the point that the city ceases to exist. It is no longer there and what stands in its place is nothing anybody recognizes as Rome. Given that this romantic comedy is set in Rome, there is a connection between the hyperreality of Rome and their day spent together.In exploring the bounds of this dream world, Princess Ann (Audrey Hepburn) escapes from the embassy for a night out on the town. However, some sleeping medication ensures a night turns into a day when she is found by newsman Joe Bradley (Gregory Peck). Once he recognizes her, Joe hopes to score a good story out of his day with Ann, only to wind up falling for her instead. Together, the duo encounter the cops, drive mini-bikes, dance by the river, fight private security guards, and visit various tourist traps and memorials. Yet, their time together is fleeting. Ann must return to her country and duty as a princess. Joe wants to return to America. No matter how much both enjoy their time together in Rome, none of it really exists. Their relationship is one built on mutual deception and one that acts as a ticking time bomb. It must end and they must snap out of this dream world that is unlike any other experience in their life. Rome, for them, goes hand-in-hand with their dreamy day together and will, likewise, be imagined to be a far grander place than it really is under the surface of their dreams.Director William Wyler and screenwriter Dalton Trumbo quickly separate their dreams from their realities with their demeanor and actions in both. For the latter, Ann sets out to do things she never gets to do. As her family and upbringing is quite conservative, she wants to let loose and have a day to herself. She cuts her hair, dances with strange men, and dresses down. She paints the town red and turns Rome into the canvas upon which her dreams have been painted and drawn out. Alongside her, Joe indulges in a dream for a better life, only to come to realize that this better life would include Ann. Through this day together, both indulge in their dream world that both know cannot and will not last long, but they make the most of their time together. In many ways, this is somewhat akin to a film along the lines of Brief Encounter or The Bridges of Madison County. Though both concern affairs, they also depict forbidden love that has a time limit. Roman Holiday has a far shorter time limit and is scandalous for different reasons, but is scandalous nonetheless.In regards to their demeanor after the encounter, both are incredibly professional. They share nothing but looks with one another that imbue the passion they feel for one another akin to films such as Carol. Via nothing more than a look, the two show their passion and nostalgia for another, though both recognize that the relationship is not meant to last. Thus, there is no need to pretend otherwise. Furthermore, this finale that lacks a climactic romantic overture shows a direct influence on La La Land. Not only does that film often define itself by simple looks by its lovers, but it also tears them away from one another and leaves us waiting for Ann or Joe to go running after their love. Yet, that moment never comes and they go their separate ways. Naturally, Roman Holiday's finale is likely also influenced by Casablanca, as was La La Land's. Their relationship is not built to last and is best to remain in the dream world of Rome. Testing it out in a non-dream world would provide enough strain to tear them apart as they would feel their heart calling them away from that whom they love. This separation between dreams and reality is further established by the photos being returned to her and by Ann remaining tight-lipped to her servants. There is no record of what happened and nobody is speaking about anything. It will instead live on in their hearts and minds before it reaches the point where all parties begin to even wonder if it happened at all or if it were merely just a dream from a better world.",
      "review_date": "2017-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A wholesome and fun romantic comedy with a big heart and a good amount of laughs, it's no surprise why so many films would go on to try and replicate what \"Roman Holiday\" did first.",
      "review_date": "2015-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On the one hand a beautiful movie with a heart breaking ending: sad but also nice. Hepburn is charming as always, Peck somehow didnt convince me much, as if she doesnt fit to her.",
      "review_date": "2021-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is just so interesting to see how an American journalist seduced an innocent European princess - for sure I am quoting reviews of Lolita.",
      "review_date": "2018-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic- from scripting to direction to acting. Funny, sweet and effortlessly charming.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWatched Feb 26, 2018This review may contain spoilers.This is the second film I have seen in the last week where Audrey Hepburn gains confidence after getting her hair cut short in Europe, upon which she is manipulated by an older man who lies to her for their own financial benefit, only for the two of them to realise they have fallen in love and these fiscal plans to be abandoned. However, where Sabrina (1954) gets caught up in massive plot contrivances, irrational decisions and suffers from not writing its characters relateable enough, Roman Holiday (1953) [god were these two extremely similar films really released a year within each other?!] is able to mostly avoid lots of these problems. Instead of actively going into the situation with distructive intent, like the formers Linus Larabee (Humphrey Bogart), Joe Bradley (Gregory Peck) falls into this situation, and acts impulsively on what he sees as an opportunistic offering, making him already more understandable, *spoiler* his decision to give up his plans in the end more admirable.I am of the opinion that it may be impossible to shoot a film badly in Rome (The Great Beauty is a personal favorite). Roman Holiday stands the test of time for a few reasons. One is its nostalgic tinge of Rome in the 1950s, a city that is ever changing yet hypocritically has also remained the same for a millennia. Another is its compelling casting, Peck and Hepburn both in their prime (sorry to fire more shots at Sabrina, but not something that could be said for Bogart at the time (sorry not sorry)). Finally, and most importantly, it manages to be pretty damn funny at times, although a lot of this is more likely to draw a sentimental smile rather than booming laughter. A compelling piece of Golden-age romantic comedy.",
      "review_date": "2018-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A funny film that despite the fact that the story may sound trite nowadays, has a tone and rhythm that make it very enjoyable; There is no doubt that the direction in the 50s was VERY different. It makes me interesting how it may seem thatA funny film that despite the fact that the story may sound trite nowadays, has a tone and rhythm that make it very enjoyable; There is no doubt that the direction in the 50s was VERY different. It makes me interesting how it may seem that the film tells a simple plot, but the ending has an unexpected twist and leaves a bittersweet taste. The charm of Audrey Hepburn is the heart of the movie.",
      "review_date": "2019-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film itself is a classic of romantic wish fulfilment, exactly the sort of beautiful lie that Hollywood specialised in.",
      "review_date": "2021-02-11",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 18,
  "genres": [
    "Drama",
    "Comedy",
    "Romance"
  ]
}