{
  "title": "The Naked Gun: From the Files of Police Squad!",
  "rating": 8.3,
  "release_date": "1988-12-02",
  "summary": "Leslie Nielsen stars as Police Squad's own granite-jawed, rock-brained cop Frank Drebin, who bumbles across a mind-control scheme to assassinate Queen Elizabeth. Priscilla Presley, O.J. Simpson, a stuffed beaver, two baseball teams and an odd assortment of others join the wacko goings-on and blow the laugh-o-meter to smithereens. (Paramount)",
  "critic_reviews": [
    "Crass, broad, irreverent, wacky fun - and absolutely hilarious from beginning to end.",
    "Reviewing The Naked Gun... is like reporting on a monologue by Rodney Dangerfield - you can get the words but not the music.",
    "Not quite up to \"Airplane!\" or \"Top Secret!,\" but there are still laughs aplenty.",
    "A continuous stream of verbal and visual gags that come so fast, you don't have time to realize how bad/old/corny they are."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Unequivocally the greatest of its kind, \"The Naked Gun\" is a gut-busting satire with just enough crass gags to make you want to roll on the ground in tears.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely HilariousClever, smart, funny, exciting, and terrifically acted classic.",
      "review_date": "2020-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I liked the series but this film sucked imo. Recycled a bit from the series and it really was just so stale and so stupid that I couldnt even come close to putting it in the same catagory as I did the series. Really disapointed with this.",
      "review_date": "2012-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best comedy film of all time! Leslie Nielson at his greatest.",
      "review_date": "2007-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's one of the funniest movies i have ever seen.",
      "review_date": "2006-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you watch this, and you have the same sense of humor, you'll laugh your pants off!",
      "review_date": "2006-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Queen Elizabeth coming to the US, bloke from Fantasy Island wants her dead, Frank Drebbin tries to stop him.I have seen this before & although not as funny as I remember it, there still are some very funny lines & scenes in it. PriscillaQueen Elizabeth coming to the US, bloke from Fantasy Island wants her dead, Frank Drebbin tries to stop him.I have seen this before & although not as funny as I remember it, there still are some very funny lines & scenes in it. Priscilla Presley is gorgeous & Leslie Nielsen & George Kennedy are excellent.",
      "review_date": "2010-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best, if not THE best, slapstick movie ever created. The fast-paced gags and visual humor will give even the angriest person a big fat smirk on their face. While not perfect in every way, it's so darn good I can't help but overlookOne of the best, if not THE best, slapstick movie ever created. The fast-paced gags and visual humor will give even the angriest person a big fat smirk on their face. While not perfect in every way, it's so darn good I can't help but overlook those minor annoyances and give it a full ten out of ten.",
      "review_date": "2010-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With non-stop laughs and a terribly brilliant plot, 'The Naked Gun' is a classic gem, and possibly Leslie Nielson's funniest film (maybe just beaten by 'Flying High').",
      "review_date": "2011-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "2005: Serenity is released, a continuation of a brilliant TV show which had little viewers and was cancelled after one season. But that wasn't the first instance of that happening. 1988: The Naked Gun is released, 6 years after the2005: Serenity is released, a continuation of a brilliant TV show which had little viewers and was cancelled after one season. But that wasn't the first instance of that happening. 1988: The Naked Gun is released, 6 years after the cancellation of the TV series Police Squad! There were a number of character changes, like Officer Norberg, a caucasian character, becoming OJ Simpsons character, Officer Nordberg, but are we really complaining? After returning from taking down a terrorist act made up of famous leaders, in one of the films best scenes, Lieutenant Frank Drebin begins working on a case where his best friend and partner, Officer Nordberg, is hospitalised and framed for dealing in heroin. Along his investigation, Frank comes across his love interest, Jane Spencer (Priscilla Presley) and her employer, Ludwig (played by Khan himself, Ricardo Montalban), with the latter involved in a plot to assassinate the queen through post hypnotic suggestions. When you read the plot, it sounds utterly ridiculous, and in any other movie, the plot would fail along with the film, but this movie makes it work. The Naked Gun knows exactly what it is, a slapstick humourous take on cop films, and it takes that ludicrous plot and makes it work, and it doesn't hurt that they add some hilarious moments. One of the films best ever scenes includes an encounter at the hospital which follows up into a car chase. Another brilliant moment includes Frank investigating into Ludwigs office at night, which manages to include fire, a concrete **** (i'm not joking here) and a possible sexual harrasment case against the poor lieutenant. The Naked Gun is also something which is rare nowadays: A good spoof movie. The reason it doesnt fail like the spoof movies which have been released in the past decade or so is because it doesn't try to spoof films directly, therefore not having any original or funny jokes. It spoofs a genre, police films, and makes its own way rather than recycling plot points form movies in the same genre, and it manages to make original AND funny jokes. The Naked Gun stars the late, yet great Leslie Nielsen as Lieutenant Frank Drebin of the Police Squad. He says some hilarious things and does a lot of slapstick throughout, but plays it all off completely straight faced, and it utterly works. Frank Drebin does some stupid things, but thanks to Nielsens brilliant performance, you can see that he doesn't acknowledge these things as stupid, just merely believes its all right in the line of duty. Oh, and you have to give props for this snippet of dialogue: \"When I see five men stabbing a poor man to death in plain view, surrounded by eyewitnesses', I shoot the bastards, thats my policiy\" \"That was a Shakespeare in the park performance of Julius Caeser. You shot five actors, good ones!\" I have never done this before, but this film deserves it. Below are a list of Youtube links to some of The Naked Guns scenes, if you want to see what the fuss is all about, if you want to revisit one of the best comedies of the 80s or if you just want a damn good laugh. Enjoy Opening Scene: http://www.youtube.com/watch?v=3oEA6zK_8u8 Hospital and Car Chase: http://www.youtube.com/watch?v=C29-gLZLt9s Fire and Concrete **** http://www.youtube.com/watch?v=by5i2NI6lvI Funniest Moments: http://www.youtube.com/watch?v=uMn9gvTgMFg Nordberg in Hospital: http://www.youtube.com/watch?v=n08mNz9f0FQ If by the end of this film you haven't laughed once at all, you must be a robot. One of the funniest movies in the history of ever!",
      "review_date": "2011-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Naked Gun is a timeless classic. The laugh to gag ratio is off the scale and the movie never ceases to be hilarious no matter how many times you watch it. In short, The Naked Gun is one of the funniest films of all time.",
      "review_date": "2012-06-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first film in the Naked Gun series, which spawned from prematurely axed TV series Police Squad! is a rapid-fire comedy festooned with slapstick, puns and surreal humour. It's one of the best products of the Zuker, Abrahams and ZuckerThe first film in the Naked Gun series, which spawned from prematurely axed TV series Police Squad! is a rapid-fire comedy festooned with slapstick, puns and surreal humour. It's one of the best products of the Zuker, Abrahams and Zucker partnership (falling only slightly short of the brilliant Airplane!) and certainly the best film David Zucker has directed solo. Leslie Nielsen gives the performance of his career as Lt. Frank Drebin - his deadpan delivery and mastery of slapstick making him the perfect comedy anchor that holds the film together. Priscilla Presley and George Kennedy also impress as Frank's muse, Jane Spencer and exasperated police chief Capt. Ed Hocken. The film has a huge variety of gags - whether you love slapstick, wordplay, visual jokes or parody you'll find plenty to make you chuckle. There are a couple of jokes that don't quite hit the mark, but they hardly matter as there's always something else to laugh at before you've even had time to stop smiling. The film owes a lot to The Pink Panther in terms of comic style, and Frank Drebin is basically an updated Inspector Clouseau, but Leslie Nielsen is a fine comedian, just as Peter Sellers was, and he, along with Zucker, Abrahams and Zucker manage to make the Naked Gun films rival (if not exceed) those 60s and 70s comedy classics. It's quite simply hilarious, extremely enjoyable, and just as silly (in a good way) as it ever was.",
      "review_date": "2012-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This had been my undisputed #1 comedy film for a long time. It's one of these movies you can watch over and over again. The comedic genius is over flowing and Leslie Nielsen is perfect. Be sure to keep your eyes on the background or you'llThis had been my undisputed #1 comedy film for a long time. It's one of these movies you can watch over and over again. The comedic genius is over flowing and Leslie Nielsen is perfect. Be sure to keep your eyes on the background or you'll miss it all.",
      "review_date": "2011-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Naked Gun is a Comedy Classic  that feature some of the Best In Slapstick also with Leslie Nielson at his best this is a Movie that Will Bring The Laughs No Matter when you see it",
      "review_date": "2011-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With quite the lengthy title It's satifsying that the movie itself is exactly the opposite, in no way being tiresome or tedious. 'The Naked Gun: From the Files of Police Squad!' in the first film in It's respective trilogy and proves thatWith quite the lengthy title It's satifsying that the movie itself is exactly the opposite, in no way being tiresome or tedious. 'The Naked Gun: From the Files of Police Squad!' in the first film in It's respective trilogy and proves that movie adaptations based on television programs can indeed work if excelled at. If you're a fan of laugh-a-minute, side-splitting comedies then this flick WILL bring about the funnies in more ways than one. Simply put, It's slapstick comedy at Its near-finest and is one of the best flicks I have over my entire life.",
      "review_date": "2012-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Leslie Nielson proves his dominance as a comedy icon, he takes his alter-ego Frank Drebin of Police Squad to the big screen, and gag after gag proves this to be one of the best comedies created, its simple and ridiculous story, larger thanLeslie Nielson proves his dominance as a comedy icon, he takes his alter-ego Frank Drebin of Police Squad to the big screen, and gag after gag proves this to be one of the best comedies created, its simple and ridiculous story, larger than life characters and real life references and subtle pokes make this enjoyable from beginning to end.\rLt. Drebin of Police Squad is suspicious of businessman Vincent Ludwig (Ricardo Montalbán) after Drebin's longtime partner is put in hospital after attempting a drug bust, to disastrous but also hilarious results involving bear traps, wedding cakes and wet paint. The hilarity continues as he attempts to investigate basically on his own, and he stumbles upon a plot to assassinate Queen Elizabeth II on her visit to Los Angeles.\rHe is helped but also hampered by the woman he immediately falls for, Jane Spencer, (Priscilla Presley) who works with Ludwig. As Frank digs deeper into Ludwig and his business, his discoveries soon lead him into very hot water with the Mayor.\rThe Naked Gun relies on visual gags along with the superior acting skills of Nielson, and in both ways it delivers on all accounts, whether its a simple name on a door that is back to front or suitcases being thrown out of the plane ands entirely missing the carrier, these background gags work best when have Nielson's serious face but bumbling personality of Drebin directly in front of you.\rA movie as absurd and often immature is indeed quite difficult to review and put into words what is trying to be said, you will laugh at the entire film and when it ends you will question what you were even laughing at, or you will simply not feel good about the fact you laughed. But this is perhaps the genius of the writers, observing the elephant in the room, they address exactly what is considered ridiculous, stupid and downright immature and throw it back in your face, here's a pie, lets throw it at someone.\rBut the film also turns many tricks and other films of similar genres to parody, a particular scene where Frank is coaxing information out of a man and they in turn swap the money that Frank originally had, it is silly, hysterical but also witty in its own way.\rThe Naked Gun deserves a status of one of the best comedies, it knows exactly what it is, never tries to be better and calls all its own shots, with Leslie Neilson at the helm, it was always aiming high, and for good reason too.",
      "review_date": "2013-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Naked Gun is an untouchable comedy. It's as simple as that. So many tried to replicate it but to laughable results. Nobody is gonna touch this masterpiece.",
      "review_date": "2019-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely hilarious, just like Airplane. The Naked Gun is a joke a minute satire that may be based around dirty jokes and gags, but it is entirely fantastic. It is a tad over the top, but that is the point. Much like Airplane, the pace isAbsolutely hilarious, just like Airplane. The Naked Gun is a joke a minute satire that may be based around dirty jokes and gags, but it is entirely fantastic. It is a tad over the top, but that is the point. Much like Airplane, the pace is very very fast, especially when it comes to jokes, which leaves you laughing continously and having to pause the movie to stop laughing and catch your breath briefly. The great part about a comedy like this is that the plot is irrelevant. They try to establish one, of course, but really, it does not matter. The jokes cover up any type of plot and any cliches are entirely intentional. This and Airplane are clear pinnacles of comedy.",
      "review_date": "2014-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic comedy movie with so many funny hints to laugh about. I liked how (pseude-) serious the atmosphere were to make the whole situations even more ridiculous.",
      "review_date": "2020-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Naked Gun, in essence, provides us with hilarious entertainment for 85 minutes. That's about all of the purpose of this movie. If you expected solid character studies, emotional depth, or Oscar-caliber performances, than you're watchingThe Naked Gun, in essence, provides us with hilarious entertainment for 85 minutes. That's about all of the purpose of this movie. If you expected solid character studies, emotional depth, or Oscar-caliber performances, than you're watching the wrong movie.",
      "review_date": "2014-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best comedy movies of all times. It is a movie based on the TV series Police Squad. It is staring Leslie Nielsen who's greatest gift is staying dead serious in the most funny and humorous situations. He was so good that he was typeOne of the best comedy movies of all times. It is a movie based on the TV series Police Squad. It is staring Leslie Nielsen who's greatest gift is staying dead serious in the most funny and humorous situations. He was so good that he was type cast in this role for the rest of his career. Believe it or not he had a long career before with only serious or no nonsense characters (Except maybe Airplane). This change has even created the trope Leslie Nielsen Syndrome. Then there are the 3 Producers Zucker / Abrahams / Zucker. They were really good together but would later go separate ways and never were this good again. For the story it is a parody of a police movie with hilarious humor and funny situations. It has so much creativity and smart jokes. I think all jokes work well and there is no misfire I can remember. While the more modern spoof movie just try hard to string jokes together and fail this movie archived consistency with a great comedic value. Nothing feels out of place and it is structured well. The actors are well chosen and deliver an excellent performance. Leslie Nielsen has created an arch type. Priscilla Presley, O. J. Simpson (yes that one), Ricardo Montalban and George Kennedy are an excellent addition.  There is a brief cameo by Weird Al Yankovic who is also pure entertainment himself. Overall this is an arch type of a good comedy movie and still worth watching especially when you have only experienced the trashy ones as the genre is pretty much dead by now.",
      "review_date": "2020-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely fantastic film, at some moments I was gasping for air that I was laughing so hard, I loved this one so much that I decided to watch the whole trilogy of the Naked Gun.\rA great and hilarious film that I would most definitely recommend.",
      "review_date": "2014-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Frank Drebin is the only police officer I trust, even though this is the same officer who was nearly ran over by his own parked car.",
      "review_date": "2021-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": ".............................................................................................One of best Comedies movies...............................Beautiful and hilaring script",
      "review_date": "2016-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "..........................................................................................................................................................................................comedie at their best",
      "review_date": "2016-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love a break from the seriousness of most modern versions of what this has become. It seems like every movie that tried to emulate this formula crash and burned...(Ex. Disaster Movie, which was a complete disaster.) But this movie willI love a break from the seriousness of most modern versions of what this has become. It seems like every movie that tried to emulate this formula crash and burned...(Ex. Disaster Movie, which was a complete disaster.) But this movie will forever be hilarious, each scene guaranteed to make you bust your gut, (unless you are some serious stick in the mud, who can't deviate from boring class and cultured films about things that make me want to fall asleep or die), then I recommend this film for you. It's up there with Airplane, and of course anything Leslie Nielsen stars in is guaranteed to bring the laughs.",
      "review_date": "2020-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Naked Gun: from the Files of Police Squad! - a good comedy-parody with Leslie Nielsen in the title role. It is impossible to soberly evaluate the films of the Zucker brothers, but they can ridicule. And this film does a great job.",
      "review_date": "2022-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing funny comedy that is alle out hilarious all the way through, the worst thing about this movie is that o.j. Simpson is part of it, amazing lige good movie",
      "review_date": "2021-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "an attention seeker..Naked Gun\n\nNaked Gun is a plot driven comic crime about a cop whose clumsy actions turns everything whimsical after he touches it. It weaves out an intense sequence with such sincerity that you fall for it and then itan attention seeker..Naked GunNaked Gun is a plot driven comic crime about a cop whose clumsy actions turns everything whimsical after he touches it. It weaves out an intense sequence with such sincerity that you fall for it and then it mocks it away on all levels where you find yourself practically all giddy up for more. But amidst all these tomfoolery it fiddles subconsciously with the viewers and somehow manages to reach a definite point that is put up front with crystal clear voice. With a zazzy yet incongruent background score, annoyingly loud sound effects, daft cinematography and amateur editing, it falls flatly on face on technical aspects. All the husbandry gags are just cherry on top that makes you root for it more and more as it ages on screen. Ticking for around 90 minutes, the tightly packed screenplay never lets you wander off its sketchy world, it may be illogical but it's hilarious, it may be redundant but it somehow is feasible and it may overdo sometime but it works like a charm. Neilson's comic timing is off the hook, he hits a home run on every throw and its his expressive or inexpressive face is what fuels this comic into a bit more than one anticipates for. Because at certain points even writers may fall short but he delivers every time and every line. His ludicrous attempts to not only convince others but himself too, is what makes him stand alone than any other actors in here, his strong belief in each and every gag is clearly visible through his mannerism and tone. Zuker's execution barely matters in here, it is good but armed with such an attention seeking script one rarely wonders about it. Naked Gun might be an attention seeker, but why not just give it to it, there won't be any regrets.",
      "review_date": "2018-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best comedies of 1980's.Juvenile and crass but extremely funny. A movie that has some big laughs but has you constantly chuckling throughout.Nielsen in his usual way plays the lead in such an understated way that worksOne of the best comedies of 1980's.Juvenile and crass but extremely funny. A movie that has some big laughs but has you constantly chuckling throughout.Nielsen in his usual way plays the lead in such an understated way that works brilliantly with the style of comedy here.",
      "review_date": "2021-01-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 36,
  "genres": [
    "Action",
    "Comedy",
    "Romance",
    "Crime"
  ]
}