{
  "title": "Barry Lyndon",
  "rating": 8.6,
  "release_date": "1975-12-18",
  "summary": "An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England.",
  "critic_reviews": [
    "This is a story of identity, and the lack of it. And it’s fascinating.",
    "Between the vast exteriors and candlelit interiors, the expressive authority of Kubrick’s direction is breathtaking.",
    "Barry Lyndon is a rich cinematic experience which fully deserves to once more be seen on the big screen and enjoy its status as one of Stanley Kubrick’s greatest achievements.",
    "Barry Lyndon is an intimate epic of utter lucidity and command.",
    "This is one of Kubrick's best, not gimmicky or arch, not somnambulant or mannered, just finely detailed, measured, richly photographed and, at every step of the way, entertaining and interesting.",
    "Barry Lyndon is best known for its photography – Kubrick borrowed a low-light camera from Nasa so he could shoot in candlelight – and it is uniquely, heart-stoppingly gorgeous. But there’s much more to it: this is a story of identity, and the lack of it. And it’s fascinating.",
    "Barry Lyndon could be considered Kubrick’s masterpiece. At the very least, this cerebral action film represents the height of his craft.",
    "Kubrick's beautiful adaptation of the William Thackeray novel follows a young Irish gambler, rogue and romantic adventurer (Ryan O'Neal) though a painterly 18th Century English landscape of frozen elegance and upper-class hypocrisy.",
    "One of the most beautiful of all Stanley Kubrick’s films, originally released in 1975, this slyly savage tale of social climbing in the 18th century is also arguably his funniest.",
    "To watch Ryan O’Neal’s performance as the upwardly mobile Barry, part victim and part cad, is to see Kubrick’s perverse genius with actors. He cast a dullard only to jolt us, by the end, with the revelation of the bastard within.",
    "It’s a movie that actually makes the past look otherworldly, unlike many period pieces, which strive to make history seem easy to slip into.",
    "Barry Lyndon is another fascinating challenge from one of our most remarkable, independent-minded directors.",
    "Ryan O'Neal's excellent performance captures the shallow opportunism endemic to the title character who is brought down as much by his own flaws as by the mores of the ordered social structure of 18th-century England. Casting, concept and execution are all superb.",
    "Ryan O’Neal has never been better cast than as the shallow and opportunistic hero of Thackeray’s early 19th-century novel.",
    "Barry Lyndon is a costume epic that pokes fun of other costume epics even as it outdoes them.",
    "Barry Lyndon isn’t a great success, and it’s not a great entertainment, but it’s a great example of directorial vision.",
    "Kubrick's superb version of William Thackery's first novel is meticulous and philosophically stimulating but it can leave some audiences unmoved on an emotional level.",
    "Despite its ponderous, funereal moods and pacing, the film is a highly accomplished piece of storytelling, building to one of the most suspenseful duels ever staged. It also repays close attention as a complex and fascinating historical meditation, as enigmatic in its way as 2001: A Space Odyssey.",
    "With an actor only slightly more expressive than Ryan O'Neal in the lead, this sombre costume epic might have reached the level of tragedy; as it is, the film is langorous to a fault, but so visually delightful and keenly observed that its excesses demand forgiveness."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Kubrick shows to all the people how much his powerful directing is masterpiece in every single scene and imagine. One of the best cinematography of ever.",
      "review_date": "2019-06-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Every single scene is a painting, a wonderful picture, a kind of travel into a big museum. GIANT MOVIE.",
      "review_date": "2019-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Duellists\" and \"Barry Lyndon\" represent the best period movies of all time! A visual pleasure, every frame is poetic and perfectly built on the screen!",
      "review_date": "2019-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a surprise. After the first few minutes I was thinking the movie will be boring, because you see a naive boy, the time is the boring 18th century (the behaviour, the fashion, the language) and the duration of the movie is over 3 hours.What a surprise. After the first few minutes I was thinking the movie will be boring, because you see a naive boy, the time is the boring 18th century (the behaviour, the fashion, the language) and the duration of the movie is over 3 hours. But the movie is great: It was very interesting to see the development of Barry Lyndon from a naive boy into an experienced man. The movie felt like a biography, but also like a historical documentary, very accurate. Also the pictures were stunning beautiful with a lot of details.",
      "review_date": "2020-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Kubrick and the actors put up a long and beautiful show in one night and we are told it spans over years and years.Barry Lyndon\n\nStanley Kubrick is something I don't get. He is a phenomenon more than he is a person or an artist or aKubrick and the actors put up a long and beautiful show in one night and we are told it spans over years and years.Barry LyndonStanley Kubrick is something I don't get. He is a phenomenon more than he is a person or an artist or a storyteller. His calmness never holds the screen. It should. But it doesn't. Instead, it melts like warm butter. That, right there, remains to be a mystery. The unfathomable perspective that he spins on the known stories is both dangerous and sensual. The long slow seductive process that is exhaustingly beautiful casts a flattering impact on us, leaving us buzzed and provoked on the themes he explores.It is a date night movie in that sense. Despite being ironic in its bones and inhumanly dark in its analysation of the behavior that you would expect. And no, it doesn't shock anywhere to what it has to display. If anything it is a slow burn. You can predict the banality that these characters would go through and it is exactly how it goes. Not only now you are hooked to see the self created doom but also are waiting for Kubrick to put it on screen with his unique visual storytelling skills.The result is pure joy. Perpetually even, balanced in \"how\" it has to say. \"What\" has to say gets deliberately lost into the dust. The film is a character driven journey of a guy trying to fit into the change in the social norms of a bygone era where too, it found difficulty to enhance his views. The film starts from zooming in, framing the world that our protagonist lives in and fails to be unselfish in its vocab. As the film develops the camera zooms out to mock his character that thinks he understood the sacrifices and importance of the others in this world. While the truth of the matter is, Barry Lyndon isn't mature enough to take care of himself, let alone others.",
      "review_date": "2019-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Barry Lyndon is the deconstruction of the human being. A movie about a man and his adventures told by the wonderful hand of Kubrick. It's not a movie, It's a series of paintings. MASTERPIECE.",
      "review_date": "2019-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterpiece, nothing more to say. Great directing and acting. One of the best movie ever.",
      "review_date": "2019-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Barry Lyndon is perhaps the best historical movie ever made, with a wonderful directing from Stanley Kubrick!!! Great cinematography too.",
      "review_date": "2019-07-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funny what a lense time is. I sought out this film because of the reputation of the director. Without Kubric's touch I think this film would have been terrible, completely forgettable and left to the dustbin of history. It is only through theFunny what a lense time is. I sought out this film because of the reputation of the director. Without Kubric's touch I think this film would have been terrible, completely forgettable and left to the dustbin of history. It is only through the heightened cinematography of Kubric and his complete, almost compulsive, obsession to historical detail that this film is any good at all. The main character is bad. Not likable or charming. He has zero romantic chemistry with all but one female in the film. And its not the one that would make the most plot sense. Speaking of plot, in keeping with the stylized period painting esthetic of the film, the actors in many scenes are muted so much that the acting comes off wooden and you don't believe characters, especially professing love or fear. Stuff just happens and the narrator (and this film is narration HEAVY) justifies what we will see or just saw. Given that a lot of people will find the moving boring. I'm almost surprised I made it to the credits, the people I was with didn't.",
      "review_date": "2021-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film has a spellbinding effect, almost as if the screen is a window through time itself.",
      "review_date": "2020-05-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie.Kubrick is one of the best director of all time.This is a masterpiece withRosseau's philosophy.",
      "review_date": "2020-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably the most gorgeous movie ever shot, and one of kubricks underrated masterpieces. Utterly brilliant.",
      "review_date": "2020-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is on one hand quite a lavish period drama and on the other hand also quite understated, as its a slow, somewhat plodding watch but it features some lovely scenes of many characters partaking in card games, dances and other leisurely pursuits. On the other hand, there are some battle scenes and soldiers are shown being shot to the ground like flies in a perhaps unnerving way. I liked the use of classical music in the background of many scenes - it felt quite an atmospheric watch overall, although I did get a little bit confused about the precise details of Barry's journeys. While watching it, I felt it was surprisingly engrossing. Its a bit slow but its certainly an enjoyable watch, or so I felt anyway. I liked that there's some soft lighting used and indeed some scenes had the look/feel of a dream almost.I liked the scenes set outside the stately homes, with pretty backdrops as well as the many people in costume making it a quite appealing watch. The plot itself may seem a little bare but there is plenty to interest the viewer regardless. I liked seeing how the young son grew up, for one thing.If your a fan of character based period dramas then I would definitely recommend this film, although it does seem somewhat pompous, it is certainly quite good and I liked that it, if but lightly, mocks nobility.",
      "review_date": "2021-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Kubrick and the actors put up a long and beautiful show in one night and we are told it spans over years and years.Barry Lyndon Stanley Kubrick is something I don't get. He is a phenomenon more than he is a person or an artist or a",
      "review_date": "2021-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gorgeous film, every frame looks as if it was an XVIII century painting. On the other side, I hardly ever connected emotionally with the characters, and 3 hours may be a bit too much.",
      "review_date": "2021-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favorite movies. While 3 hours long, it keeps me focused and always rooting for the underdog even when his actions become questionable. Always worth a rewatch.",
      "review_date": "2022-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe most aesthetically beautiful film I've ever seen, it totally fulfills its role of telling a story from start to finish, this story that tells about a commoner who manages to change his present several times, but that his fate prevailed; or maybe that the your destiny may have been changed due to your luck, but due to your attitudes and sins your future was slowly returning to its initial reality. \"You may be a very lucky man, but luck will not accompany you all the time\". This is perhaps the lesson that the film will teach you.",
      "review_date": "2022-09-05",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 36,
  "genres": [
    "Adventure",
    "Drama",
    "History",
    "War"
  ]
}