{
  "title": "The Man Who Would Be King",
  "rating": 7.0,
  "release_date": "1975-12-16",
  "summary": "Two British former soldiers decide to set themselves up as Kings in Kafiristan, a land where no white man has set foot since Alexander the Great.",
  "critic_reviews": [
    "John Huston's The Man Who Would Be King is swashbuckling adventure, pure and simple, from the hand of a master. It's unabashed and thrilling and fun.",
    "A delightful and memorable film.",
    "The triumph of the movie isn't just Huston's realization of a longtime dream to bring the Kipling story to the screen but the way he both honors classical movie tradition and brings it forward into a new era.",
    "The movie, which was shot in Morocco, looks lovely and remote (how did we ever once settle for those black-and-white Hollywood hills?) and has just enough romantic nonsense in it to enchant the child in each of us.",
    "A mellow, brassy, vigorous movie, rich in adventure and melancholy, The Man Who Would Be King represents the best work Huston has done in a decade.",
    "The film has genuine wit, an appealing sense of grandeur, and very little of the overt \"philosophizing\" that marred much of Huston's previous work. His eye for the strong, clear lines of landscape had never been sharper, and Oswald Morris's photography has a fine sun-saturated brilliance.",
    "Huston revels in he opportunity for old-fashioned splendour, granting the film the sunset glow of Lawrence Of Arabia and the swashbuckling cadence worthy of the Errol Flynn days. It’s the artful mix of Kipling’s own writing, flights of fantasy with a political core.",
    "Connery and Caine (both excellent) become classic Huston overreachers, and echoes of The Treasure of the Sierra Madre and Moby Dick permeate the mythic yarn.",
    "Whether it was the intention of John Huston or not, the tale of action and adventure is a too-broad comedy, mostly due to the poor performance of Michael Caine."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Overrated movie. The story is not realistic, its entertaining for the masses. The movie has some humour parts, sometimes it was good, sometimes childish. Good acting of course, you have 3 stars here. And great pictures with beautiful landscapes.",
      "review_date": "2022-09-18",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 10,
  "genres": [
    "Adventure"
  ]
}