{
  "title": "5050",
  "rating": 8.4,
  "release_date": "2011-09-30",
  "summary": "Inspired by personal experiences, 50/50 is an original story about friendship, love, survival and finding humor in unlikely places.  Two best friends lives change when one of them is diagnosed with cancer. (Summit Entertainment)",
  "critic_reviews": [
    "Every performance in the film is flawless.",
    "It's irreverent about cancer and that could be inspirational. And it's surely one of the most enjoyable movies I've seen all year.",
    "50/50 is a tremendous movie. It's also a really funny one, which doesn't mean it won't make you cry.",
    "Mostly it's just terribly funny and sad and beautifully acted and terrifically feel-good for being, you know, a cancer comedy.",
    "Considering that any one of those elements could have scuttled its fragile mix of drama, comedy and life-and-death stakes, 50/50 beats the odds with modest, utterly winning ease.",
    "A movie handled with this kind of care is a rare gift. Refusing to hide from pain or bow to it, 50/50 makes its own rules. It'll get to you.",
    "50/50 is crude and funny, and it demands that you laugh. And you will.",
    "Like another recent feel-good film about the disease, Gus Van Sant's \"Restless,\" it creates a comforting myth. That's one of the things movies are good for.",
    "Even hardened cynics will embrace the cliché – yep, you will laugh, you will cry.",
    "Thanks to a slew of engaging performances and a script that finds the sweet spot between crass and curdled, it's a winner.",
    "The result is a duet of outstanding loveliness between Kendrick and Gordon-Levitt, also an actor of nuanced control.",
    "Whether you're after a comedy-drama about cancer or a Rogen laugh-fest with added heart, this does a remarkable job of balancing the odds. And the laughter/tears split? Call it 70/30.",
    "As the comedy in 50/50 turns darker, Gordon-Levitt, who's maybe the most natural, least affected actor of his generation, makes prickly plenty engaging.",
    "50/50 pulls no punches in its depiction of living day-to-day with illness. There's pain and fear, no question. But this dramatic comedy is also warm, honest and, most especially, funny.",
    "Like many other comedies about serious matters, 50/50 grows more dramatic in its second half. What really impressed me, though, was how easily Reiser could pivot back to comedy at a moment's notice without seeming cheap.",
    "It succeeds mostly thanks to stellar work by the wonderful Joseph Gordon-Levitt, who capably handles the dramatic heavy lifting, and Seth Rogen, who delivers big laughs as his raunchy bud.",
    "This affable comedy is a healthy alternative to tearjerkers.",
    "Just as essential is Seth Rogen, as Adam's best friend. Rogen isn't even 30 yet, but he is already an important actor - not just because he's popular but because he best embodies this particular comic moment.",
    "The picture could be so much better than it is, and yet it's also the kind of movie that makes you want to grade on the curve, adding extra points for good intentions.",
    "It's half hilarious, half serious; all poignant.",
    "Some of it's schematic and on the nose. But the grace notes are what make 50/50 better than simply \"good enough.\"",
    "The filmmakers do everything they can to balance levity and leavening. The subject says \"drama,\" and the three supporting women deliver well-shaded, understated performances. (Howard shows us how weakness can be just as destructive as malice.)",
    "Ideally cast as Reiser's stand-in, Joseph Gordon-Levitt digs into a character role that also gives him a chance to show off the comedic chops he developed during his years on \"3rd Rock From The Sun.\"",
    "There is a wealth of authenticity in the feel of the movie, as if Levine and/or his writer have endured some of this stuff.",
    "Odds are you'll find something of substance, a few life lessons in between the laughs in 50/50.",
    "What ensues is \"Beaches\" meets \"Pineapple Express.\" Which, I've got to tell you, is pretty much what living with cancer is like.",
    "As a comedy about a young man with cancer, it needs to be serious enough to be real as well as light enough to be funny. Though it falls off the wagon at times, it maintains its balance remarkably well.",
    "Buoyant and observant, 50/50 is a small winner; the director, Jonathan Levine (\"The Wackness\"), has a great touch, mordant but light-handed.",
    "The movie belongs to Gordon-­Levitt and Anna Kendrick as his painfully green therapist.",
    "Reiser has written his characters with an indelible sweetness and vulnerability, which allows the cast to deliver performances with some depth.",
    "The film's predictability dampens its best parts. Having decided to make a movie about a dreaded subject, the filmmakers too often retreat into the comfort zone of easy assurances and flip quips.",
    "Kendrick gives a truly bad performance here - she's a self-conscious actress playing a self-conscious person and getting her signals all mixed up - and it's unclear whether she has been hung out to dry by her director or if it's just that the character makes no sense whatsoever.",
    "The movie is far more successful in its execution of the young-man-meets-mortality element, warranting its existence by bringing some well-considered verisimilitude to what feels like rare movie territory.",
    "Scene by scene, 50/50 can be both amusing and moving, with the tightly wound Gordon-Levitt and the boundaryless Rogen forming an oddly complementary pair. But as a whole the movie never quite coheres, seeming to skitter away at the last minute from both full-body laughter and full-body sobs.",
    "The best parts are the in-between ones, neither laugh-out-loud funny nor overtly heart-wrenching.",
    "Although it veers maudlin in its final act - 50/50 mostly succeeds as a movie about a young man fighting cancer that doesn't give in to sap or sentiment.",
    "The story is an autobiographical one from screenwriter Will Reiser's own ordeal; you smile with the thought that he had such women in his life, tough yet supportive, giving him the license to be funny again.",
    "Will Reiser's semiautobiographical script initially prescribes too artificial a story treatment for its characters but is rescued by a genial, low-key vibe that builds in sensitivity and emotion up through the final reels.",
    "A soft and sweet cancer drama that hits with the force of an ill-timed hug.",
    "A feel-good and slightly bad comedy-drama about a young man's fight against cancer, aims to put a tear in your eye and a sob in your throat, if not for long.",
    "All these roles could have been found at a garage sale of comedy stereotypes. To the extent that 50/50 works, it is because of Gordon-Levitt, one of my favorite actors.",
    "Artificial, irresponsible, filthy and forgettable, it knocks itself cross-eyed trying to make you roar with laughter at chemotherapy, with the nauseating Seth Rogen milking most of the yuks. But a stoner comedy about cancer? I don't think so."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Joseph Gordon-Levitt plays a nice guy who finds out he has a serious form of cancer. While he deals with the unpleasant side effects of his treatment and the reactions of the women in his life, his best friend (Seth Rogen) supports him withJoseph Gordon-Levitt plays a nice guy who finds out he has a serious form of cancer. While he deals with the unpleasant side effects of his treatment and the reactions of the women in his life, his best friend (Seth Rogen) supports him with plenty of humor. There are moments of pain and earnest drama, but a good laugh is never far away. Rogen shines with his constant comic comments and Gordon-Levitt delivers another touching, but strong performance. Don't be dismayed by the subject and enjoy the jokes!",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 balances Drama and comedy perfect. I felt the drama of Joseph Gordon-Levitt's character dealing with the cancer. The scenes that are supposed to give me a tearjerker gave it to me. The comedy that Seth Rogen gives are very funny and are50/50 balances Drama and comedy perfect. I felt the drama of Joseph Gordon-Levitt's character dealing with the cancer. The scenes that are supposed to give me a tearjerker gave it to me. The comedy that Seth Rogen gives are very funny and are delivered well. To me the fact that Joseph Gordon-Levitt is in this movie and as the lead role makes it even better. It's a great story, cast, and movie.",
      "review_date": "2012-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Makes a laughing matter of something that shouldn't be.  At one moment, awkwardly laughing and at the next, choked up, this was well-written from top-to-bottom and expertly acted.  Probably Rogen and Goldberg's best film yet.",
      "review_date": "2012-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everyone in the cast are at their very best here.  To pull off such a great comedy/drama involving something as hard as cancer shows the talent of the acting and directing.",
      "review_date": "2013-05-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a fairly good movie - it struggles at times to create much empathy for the characters,  but it scrapes by with the bare essentials. It was okay.",
      "review_date": "2015-05-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this film.  It's been awhile since I gave a movie a 10 but I was cast into this movie's spell.  I cared about all the characters, even though the Rogen character was a little close to being over the top.  Levitt is absolutely perfectI loved this film.  It's been awhile since I gave a movie a 10 but I was cast into this movie's spell.  I cared about all the characters, even though the Rogen character was a little close to being over the top.  Levitt is absolutely perfect as the cancer stricken person holding all his emotions in, until he finally explodes the night before his surgery.  I haven't cried at a movie in years but definitely teared up at this one.  I'm glad the time of the year has arrived when the good movies are shown.  Highly recommended.  Deserves the great reviews it's getting.",
      "review_date": "2011-10-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is a strange movie, how can it be categorized of comedy a movie about a man fighting against cancer? It is absolutely insubstantial, although it does not lose its depressing part, but the emotion of the film is broken by stupid jokes of50/50 is a strange movie, how can it be categorized of comedy a movie about a man fighting against cancer? It is absolutely insubstantial, although it does not lose its depressing part, but the emotion of the film is broken by stupid jokes of teenagers. The things that saved the picture are the performance of Joseph Gordon Levitt and the form the film shows the way of living a life with cancer. This is remarkable because is extremely realistic; in other words, the things that Adam start doing when the doctor diagnosed him cancer are the same that everyone would probably do. You wont get out of the hospital planning to take what remains of life; you will denied that you are fine, get angry with the world and God, you will discovered who your true friends are and refuge in what you find first. If all this were not interrupted by the silly relationship that is going nowhere with the girlfriend, the pointless sessions with the psychologist and the friend that does not know if to help or not Adam; this movie could be in the top ten of the year.",
      "review_date": "2012-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "AMAZING FILM! the cast, story, music, everything was perfect. adam is a guy who gets cancer and the movie is just about how he deals with it! adam is played by joseph gorden levitt and he plays him really well! its so believable. he playedAMAZING FILM! the cast, story, music, everything was perfect. adam is a guy who gets cancer and the movie is just about how he deals with it! adam is played by joseph gorden levitt and he plays him really well! its so believable. he played him perfecty. Kyle is adams friend played by Seth Rogen and he plays him well, i mean hes basically the same guy in every movie although in this movie he has some heart, he may look like the funny, **** type guy who just wants to get laid, but towards the end of the movie, it is shown that hes been reading a cancer book that shows how to help someone out who has it! Anna kendrick plays katty a psychiatrist whos trying to get their doctorate and adam is one of her patients. she is WOW AMAZING!!! shes so Beautiful in this movie shes really the cute girl who tries to help out adam but somehow she cares alot about him and falls for him in a way. and i seriously fell in LOVE WITH HER! Bryce howard plays rachel, adam's girl friend. i don't wanna spoil anything so i'll leave it at that. overall the movie was brilliant. i loved how they took something so serious as \"Cancer\" and not made it funny but somehow make the story around it funny! The movie was hilarious! and also had some sad moments, it was a NICE movie! people should go watch it! BEAUTIFUL MOVIE!... it definitely makes you think differently about cancer. 10/10 i'll definitely be getting the bluray :)",
      "review_date": "2011-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How can you make a comedy about cancer? Forever we have seen cancer play huge roles in films, but itâ",
      "review_date": "2011-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably the best movie I've seen this year. The story of the movie was amazing and the movie had the perfect balance between drama and comedy and knows perfectly when they have to switch between them. The humor is insanely funny and theProbably the best movie I've seen this year. The story of the movie was amazing and the movie had the perfect balance between drama and comedy and knows perfectly when they have to switch between them. The humor is insanely funny and the emotional moments were REALLY emotional. The acting performances are also really amazing by Joseph Gordon-Levitt and of course Seth Rogen! Conclusion,  I loved this film and i will definitely buy it on blu-ray. I'm looking forward to see the movie again.",
      "review_date": "2011-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not a bad film, but certainly not a great film.  Joseph Gordon-Levitt does the same thing he always does, walking around with his eyes half open and playing everything with zero emotion, which I guess for some people equals 'great acting.'  INot a bad film, but certainly not a great film.  Joseph Gordon-Levitt does the same thing he always does, walking around with his eyes half open and playing everything with zero emotion, which I guess for some people equals 'great acting.'  I wish they'd cast someone with some real emotion.  Seth Rogan is great, though, and the rest of the cast is solid.",
      "review_date": "2011-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Knocked Up, With Cancer. As a film fanatic and physician who happened to do his residency at Memorial Sloan Kettering Cancer Center I can attest to the fact that this film is rubbish.It seems as though there were two films on the table; aKnocked Up, With Cancer. As a film fanatic and physician who happened to do his residency at Memorial Sloan Kettering Cancer Center I can attest to the fact that this film is rubbish.It seems as though there were two films on the table; a serious one dealing with a young man coming to terms with his diagnosis and its affect on his sexuality and relationships and an imbecilic unfunny Seth Rogan bromance filled with jokes about vomit,  yeast infections and dogs licking themselves. I assume that a committee meeting took place at some point and it was decided that the only way to generate some cash flow for this p.o.s was to go down the low road in order to pick up the coveted 18-35 imbecile demographic. The results were offensive.",
      "review_date": "2011-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe prognosis for Vivian Bearing's survival is far from 50/50. Right from the start, the scholar puts the audience on notice: \"I have stage IV metastatic ovarian cancer. There is no stage five.\" In facing death, Professor Bearing is blunt; she dashes our hopes for a Hollywood ending. Statistically speaking, the odds of her living through this hovers around 99/1, or worse. But still, she gets laughs. She's funny. Who knew? Just us. With no loved ones to speak of, Vivian, by default, speaks to the viewer, in hospital rooms without fourth walls, which allows the lifelong educator to deliver a seminar on her \"uncompromising\" life, filled with jokes. That's the remarkable thing about Emma Thompson's performance in Mike Nichols' adaptation of the 1999 Pulitzer Prize-winning play \"Wit\"(by Margaret Edson): the gallows humor gets provided by the patient, whereas in \"50/50\", it's Kyle who offsets the maudlin situation by concentrating on the perks of having a friend who just might be dying. To say the least, \"50/50\" is irreverent about life and death. Adam's illness provides a boost for his sex life. For the longest time, you're never sure if there's a method to Kyle's madness. Played by Joseph Gordon Leavitt, Adam would be more apt to sing \"Here Comes Your Man\"(like in \"500 Days of Summer\") than \"Wind Beneath My Wings\" on karaoke night. \"Beaches\", it is not. In James Brooks' \"Terms of Endearment\", against a Manhattan backdrop, Debra Winger implores a friend that \"it's alright to talk about the cancer,\" but is it alright to joke about something so \"insidious\" and \"pernicious\". \"Lance Armstrong, he's always getting it,\" Kyle, with offhanded aplomb, tells his buddy, as if schwannoma(a nerve sheath tumor that's normally benign, but in Adam's case, is malignant, and located on the spine) was nothing to worry about. And then, as another example, he uses Patrick Swayze, which many will find in bad taste, yet for Kyle, who is trying desperately to soothe himself and Adam out on the sidewalks of Seattle, it's not a joke; he just flat-out didn't know that the beloved actor had lost his battle with pancreatic cancer. While some moviegoers may find his \"faux pas\" darkly amusing, and others, an uproarious joke that is symptomatic of an Internet culture which breeds barbarity, you don't see either pedestrian laughing. Kyle looks devastated. He just allowed death back into the room, causing added anxiety for both. You can see the wheels spinning in Kyle's head, as he tries to fix this rift in his shaky rhetoric. But from our side of the screen, most people will be staring back in horror. The joke about Swayze is an open-and-shut case of being \"too soon\". As for cancer itself, however, a disease that dates back to ancient Greece, it's fair game, arguably, for a comedic filmmaker, since more than enough time has passed. Conversely, a lighthearted movie about AIDS would be tricky. The relatively young disease lacks the historicity of cancer, therefore, making light of somebody's lesions would indeed be \"too soon\". \"50/50', on the other hand, is right on time. The cancer genre needed this. Unlike AIDS, there really is no canonical films to speak of; no \"Philadelphia\" to hang a hat on its bald head. \"Wit\", albeit a searing masterpiece, may be better known as a stage play. And \"Terms of Endearment\", in spite of its Oscar-laden pedigree, seems awfully facile in its depiction of a young woman's cancer; it's movie cancer, the kind without the chemotherapy sessions that gives rise to the nausea and the baldness, which \"Wit\" depicts, and \"50/50\" subverts. When Vivian throws up, it's not the vomit, but the wit stemming from her serial regurgitations that has us cautiously guffawing. Words, not actions, make the professor funny. She's too dignified for either comic subgenre: the gross-out comedy and the stoner flick. And that's a shame. Life has passed her by. She doesn't have to \"barf [her] brains out\", but drugs, even the remedying kind, is verboten for her. Nancy Reagan would love this woman. By contrast, Seth Rogen, who lights up in \"Pineapple Express\"(and many other films), keeps on smoking, but this time it's for a worthwhile cause, since the pot is for medicinal purposes, not recreational. In retrospect, the soft drug belongs in \"Terms of Endearment\", not \"Poltergeist\". And it belongs in \"Wit\", too. Cannabis critics, however, will point out that Adam is having too much fun. Medicinal marijuana, they'll say, excuses people to have pot parties. Vivian's idea of fun is more their speed. The professor makes a game out of guessing her emesis output. To wit, she needs to watch a Cheech & Chong movie, not deconstruct one more 17th century sonnet. In \"50/50\" the bromance movie grows up. More than ever, it's easy to see how a close male friend can be like a surrogate girlfriend, as Adam finds himself between women, and only has Kyle to lean on.",
      "review_date": "2011-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring as hell .All the jokes were about the same sexual topic over and over .Alot of film time was just spent viewing the guy with cancer with the same look on his face.Dont waste your time",
      "review_date": "2011-10-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Walking a tightrope of polar extremes between gravity and levity, perhaps \"50/50's\" most exemplary trait is its dexterity and finesse with which it juggles such diversity; an amalgamation that's subject matter is treated with both carefulWalking a tightrope of polar extremes between gravity and levity, perhaps \"50/50's\" most exemplary trait is its dexterity and finesse with which it juggles such diversity; an amalgamation that's subject matter is treated with both careful caution and insouciant jocose. The film is home to a vividly rich script, thanks to Will Reiser's real-world insight and vision, prim pacing and balance, as well as arguably the most realistic, heart-rending emotional sequences to ever grace a theater screen yet. Gordon-Levitt shines as the undemonstrative, reserved man of fledglingly unfortunate news, who, through his battle and journey, takes us the viewer with him; both painful symptoms and quiet triumphs are experienced through him unto \"us.\" Further, Rogen's burbly demeanor is an effective bolster and change of pace to the uncompromisingly elegiac tone. Overall, the film is timely; funny when levity is called, and moving when sadness exists. \"50/50\" proves humour can be wrung from critical subjects, providing it's done with sufficient thoughtfulness, tact, and wit.",
      "review_date": "2012-02-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfectly acted, emotionally flawless, and laugh out loud funny, 50/50 is one of the best movies of the year, with at least a couple of Oscar worth performances, the funniest lines of the year, and a powerful blend of crying and laughing.Perfectly acted, emotionally flawless, and laugh out loud funny, 50/50 is one of the best movies of the year, with at least a couple of Oscar worth performances, the funniest lines of the year, and a powerful blend of crying and laughing. This movie is basically flawless, and should not be missed by anyone.",
      "review_date": "2011-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A tremendous disappointment!!  The acting was so unbelievable!  Talk abou the dumbing down of movies.  I was expecting so much!  The acting was horrible!  So contrived.  I really thought it was so very stupid.",
      "review_date": "2011-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is offensive, funny, sad, happy, but mainly offensive.  It was mildly entertaining but I would not recommend it.  The subject matter could not overcome the comedic effect.",
      "review_date": "2011-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very solid film, at times funny and at times touching.  I'd say never really hilarious and never really emotional (although it wants to be both), but it's definitely solid and quality film.  My only problem was I'm not a huge Joseph GordonVery solid film, at times funny and at times touching.  I'd say never really hilarious and never really emotional (although it wants to be both), but it's definitely solid and quality film.  My only problem was I'm not a huge Joseph Gordon Levitt fan, and he seems to lack the charisma this role needed to really be great.  Otherwise, everyone else from Seth Rogan to Anna Kendrick are great.",
      "review_date": "2011-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a very good film.  Joseph Gordon Levitt is such a solid young actor and this was a wonderful performance.  I thought the film was real, deep, funny and touching.  My only complaint was the ridiculous and stereotypical portrayals ofThis was a very good film.  Joseph Gordon Levitt is such a solid young actor and this was a wonderful performance.  I thought the film was real, deep, funny and touching.  My only complaint was the ridiculous and stereotypical portrayals of the physicians and the therapist.  It was surprising given that the film was written by someone who went through this, but it came off as making that whole part of the film seem written for a screenplay and an audience reaction instead of being real.  However, I would still recommend this film.",
      "review_date": "2011-10-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't remember the last time I saw a movie pull off the comedy/drama balance as well as this movie.  A movie about a nice young man who finds out he has cancer hardly sounds like an \"entertaining\" movie but I loved it.  The movie never getsI can't remember the last time I saw a movie pull off the comedy/drama balance as well as this movie.  A movie about a nice young man who finds out he has cancer hardly sounds like an \"entertaining\" movie but I loved it.  The movie never gets overly dramatic, despite the emotionally heavy issues this movie deals with.  It also deals with the theme of this movie with a lot of care.  There are plenty of genuinely funny moments, paricularly in the first half of the movie.  Joseph Gordon Levitt and Seth Rogen have good chemistry, and JGL is perfect in this role.  He has plenty of charisma, mainly because his character feels so real and easily relatable.  Rogen on the other hand is your typical funny man in this movie, although it's surprising that it's so easy to dislike his character.  I never thought I'd see a Seth Rogen movie where is character is a genuine dick, albeit a dick who cares about his best friend getting diagnosed with cancer.  The movie does a very good job with the cancer's effect on JGL's relationships.  Whether it's his best friend, mother, and girlfriend.  All in all, I thouroughly enjoyed this movie.  It's rare to find a movie that makes you want to laugh and cry at the same time.",
      "review_date": "2012-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've always wondered how you can make a comedy with anything involving cancer and doing it while managing not to make someone angry, as someone whose best friend is currently dealing with cancer I found this movie very funny, emotionallyI've always wondered how you can make a comedy with anything involving cancer and doing it while managing not to make someone angry, as someone whose best friend is currently dealing with cancer I found this movie very funny, emotionally flawless and a truly heartfelt film about hope in the face of something as serious as cancer.",
      "review_date": "2017-05-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much better than I had expected. I passed on seeing this in the theater because it just seemed a little too depressing, but this was a great story that was also surprisingly funny.",
      "review_date": "2012-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In one word: wow.\rBut that's not enough, so I'll put it this way: this is exactly what it is like dealing with a serious medical issue and it was both hilarious and heartfelt and rings extremely true with anyone else that has had to dealIn one word: wow.\rBut that's not enough, so I'll put it this way: this is exactly what it is like dealing with a serious medical issue and it was both hilarious and heartfelt and rings extremely true with anyone else that has had to deal with anything remotely similar to this. Even if you haven't, or you don't no anyone that has it still is a an excellent movie that has a genuine plot and point to make. Go see it, basically anyone could find something to like about this movie. People that are easily offended by heavy coarse language jokes may need to stay clear though as it might be too off-putting but that was always a given with Seth Rogen cast in the movie so if you walk away thinking it's bad because the dialogue didn't fit your dinner table conversation nicely then you're clearly missing out on a great film and it's your loss.",
      "review_date": "2011-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film about a young guy learning he has cancer with 50% chances of dying manages to show what it is like living as if he has 50% of living.  Levitt once again proves to be one of the best of his generation.",
      "review_date": "2012-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A brilliant film if JGL and this movie aren't nominated for a golden globe and Oscar they are stupid. The film was able to balance out the funny and serious scenes really well. This probably the best film of the year.",
      "review_date": "2011-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a funny (often LOL), sometimes moving (never heavy handed) movie of a young man stricken with cancer.  Performances across the board are excellent, but Anjelica Huston is captivating as the son's mother who only takes BS from her son.This is a funny (often LOL), sometimes moving (never heavy handed) movie of a young man stricken with cancer.  Performances across the board are excellent, but Anjelica Huston is captivating as the son's mother who only takes BS from her son.  Levitt and Rogen's friendship expressed through their banter feels authentic with Rogen the arrested adolescent and Levitt the responsible, emotionally reserved cancer patient.  Easily one of the best movies I've seen this year.",
      "review_date": "2011-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Uneven script and seemed to jerk me from one emotion to another.  Loved Leavitt, he's the best and does a great job with this character, dang person.  What kept me involved was knowing this was someone's real life story.  Could have done withUneven script and seemed to jerk me from one emotion to another.  Loved Leavitt, he's the best and does a great job with this character, dang person.  What kept me involved was knowing this was someone's real life story.  Could have done with less of the self-absorbed girlfriend and more with the mother.  I still cried, as did the whole audience, but mostly had too many flashbacks with my own friends facing death.",
      "review_date": "2011-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An excellent drama/comedy that doesn't skimp out on any drama or comedy. Everybody gives a fantastic performance and it will completely suck you in. Outstanding.",
      "review_date": "2012-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cancer and comedy don't really go hand in hand, but 50/50 does a great job of pairing them up. There are, of course, some tear inducing moments to be had but more often than not, 50/50 has you laughing out loud. Seth Rogan is tremendouslyCancer and comedy don't really go hand in hand, but 50/50 does a great job of pairing them up. There are, of course, some tear inducing moments to be had but more often than not, 50/50 has you laughing out loud. Seth Rogan is tremendously funny! 50/50 is a great movie, full of heart, humor and good performances.",
      "review_date": "2013-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A well-acted film about normal people dealing with mortality. Joseph Gordon-Levitt is terrific as always, and the story goes to some interesting places, but also some obvious ones. A small film with a good message.",
      "review_date": "2013-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I like when it's approached a dramatic theme with a dose of comedy, showing a relaxed and optimistic side without overdoing it and falling in very improbable. It makes rethink how to handle difficult and unexpected problems when you add aI like when it's approached a dramatic theme with a dose of comedy, showing a relaxed and optimistic side without overdoing it and falling in very improbable. It makes rethink how to handle difficult and unexpected problems when you add a little levity.I don't really like Seth Rogen, but he fulfilled the role of comic relief and to represent the friend who use disappoints at times, but you can count on him. Even with the impression that he was playing himself, was surprised to learn that in reality is Seth's best friend Will Reiser, in whose life the film was based.It was daring the bar scene in which Adam tries to lure girls saying he has cancer. It's so strange and compelling as to be original, when instead of masking the problem, takes advantage of it as a differentiation and as a point of interest.Anna Kendrick is highlighted once again playing the role of a more mature for her age, in a more contained than in Up In The Air. She can be annoying and adorable at the same time.Gladly in the end there wasn't the kiss between the two. The film finished with a taste of expectation, making unnecessary to show the novel is finished, since it was already clear there was involvement between them.You can not stop commenting on the soundtrack that worked well as a whole. In particular, it was great to hear High and Dry and Yellow Ledbetter.",
      "review_date": "2011-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Many films about cancer are actually only about â",
      "review_date": "2011-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A funny movie that still seems honest about Cancer treatment at all times. Joseph Gordon-Levitt, as someone dealing with the issue, never for a moment seems artificial. Seth Rogen develops some good laughs while coming across as a concernedA funny movie that still seems honest about Cancer treatment at all times. Joseph Gordon-Levitt, as someone dealing with the issue, never for a moment seems artificial. Seth Rogen develops some good laughs while coming across as a concerned friend. Anna Kendrick knocks it out of the park as a new and nervous therapist.  As a leukemia survivor I felt this movie honestly captures what we go through more than than most films about the subject... while being genuinely entertaining.",
      "review_date": "2011-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nice cast.  Hewitt is perfect in the role.  Kendrick is quite good and pulls off being quite different from her Up in the Air performance in a role that is really thankless.  Angelica Huston made you want to see more of her and Seth Rogen wasNice cast.  Hewitt is perfect in the role.  Kendrick is quite good and pulls off being quite different from her Up in the Air performance in a role that is really thankless.  Angelica Huston made you want to see more of her and Seth Rogen was usually over the top and pretty annoying.  Good script.  The film looked like it was shoot on a K Mart Budget.",
      "review_date": "2012-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic film! Every performance hits the bullseye! This film deals with such a sensitive topic in a truly amazing way: truth and humor. JGL is so truthful in his performance and we watch his character take the news, inform his family, andFantastic film! Every performance hits the bullseye! This film deals with such a sensitive topic in a truly amazing way: truth and humor. JGL is so truthful in his performance and we watch his character take the news, inform his family, and deal with the fear, anger, and denial associated with those events. Rogen, as one can imagine, provides non-stop humor and yet, there is an enormous truth with his character as well.......he deals with the stress and grief just like a confused friend probably would. Such a great film!",
      "review_date": "2012-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is a comedy drama with a main emphasis on the drama. Yes there are funny moments, but the subject matter (a young man getting cancer) is do damn depressing that they do little to lighten the mood. Joseph Gordon-Levitt puts in the50/50 is a comedy drama with a main emphasis on the drama. Yes there are funny moments, but the subject matter (a young man getting cancer) is do damn depressing that they do little to lighten the mood. Joseph Gordon-Levitt puts in the performance of his career as the cancer-stricken Adam Lerner - he is for the most part understated, yet always compelling and really brings home the unimaginable struggle of someone in his position. Anna Kendrick also impresses as Adam's young psychotherapist, believably showing someone who's read all the textbooks but lacks an appropriate bedside manner due to her inexperience, and Angelica Huston also impresses, playing Adam's caring and protective, yet shunned mother. The film, in the end, is more about how cancer affects those closest to you rather than the afflicted individual, though the scenes taking place in hospital are still harrowing. 50/50 really brings across how close friends and family are unable to deal with such disastrous news as finding out that someone close to you may soon die - they try their best to be strong and supportive, but can never imagine what the afflicted person is going through. It's highly emotional, and at times hard to watch (particularly for a film spanning 100 minutes). the film is by no means perfect - Brycle Dallas Howard's character is pretty redundant - it almost seems like the filmmakers added her simply to have someone abandoning Adam due to his illness, and therefore have the full range of reactions to his condition, and some of the extended tear-jerking scenes, though they serve their purpose by provoking an emotional response, can remind you a little too much of an episode of Scrubs. Despite this comparison, it is as a drama that 50/50 is most effective - as a comedy, I'm not sure. There are laughs to be had in the awkward responses Adam gets from various people when they find out about his dire situation, but Seth Rogen's character of best friend Kyle does also persuade the terminally ill Adam to use his condition to get laid, which I found a little tasteless. It's an undeniably brave film about cancer how it can change the lives of not only the person afflicted, and it has some extremely memorable performances, but 50/50 has the odd stumble in terms of tone - as a drama it's moving, as a comedy, the subject matter offers little scope.",
      "review_date": "2011-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cool film, not over the top as Hangover or Bridesmaid, but I'm a sucker for dead pan humor.  Levitt did well, with Rogan serving as a good supporting actor.  Anna Kendrick is good as always, as she seems comfortable in roles of dark humor.",
      "review_date": "2011-12-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The funniest depressing movie ive ever seen. Seth Rogen, funny as always, Joseph Gordon Levitt, havent seen much of him but he was fantastic. This movie really plays with your emotions, it goes from laugh out loud hilarious right toThe funniest depressing movie ive ever seen. Seth Rogen, funny as always, Joseph Gordon Levitt, havent seen much of him but he was fantastic. This movie really plays with your emotions, it goes from laugh out loud hilarious right to depressing in an instant, but it was good. I kinew it would be a good ending because its a true story based upon the director of this films story. Very good film, give it a try if you like an emotional film thats funny and has a good ending, 8/10",
      "review_date": "2011-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film that has some funny comedy in it but at some point I couldn't help but to notice how out of place the sexual humour was. The humour of the cancer treatments I felt they worked though. However the film is skillfully made with someA film that has some funny comedy in it but at some point I couldn't help but to notice how out of place the sexual humour was. The humour of the cancer treatments I felt they worked though. However the film is skillfully made with some symbolism and a real empathy for the main character",
      "review_date": "2012-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was spectacular. It was a beautiful story about the difficulties and conversions in the life of someone who has been affected by cancer and the people around them. It was funny, touching, sad, happy, and will make you cry and jumpThis movie was spectacular. It was a beautiful story about the difficulties and conversions in the life of someone who has been affected by cancer and the people around them. It was funny, touching, sad, happy, and will make you cry and jump for joy at the same time. Joseph-Gordon Levitt was amazing in this film. And so was Seth Rogan(as usual). He is seriously just funny in everything he is in, love him. I think that Joseph's amazing performance is for sure oscar worthy and I'm hoping to see him in them. Another thing about this movie is it really got you thinking. You should grasp and enjoy every second of your life as much as you can, because just like that... It could be gone. This movie was seriously an outstanding film and I highly reccommend you see it ASAP. There is a 90% chance of enjoyment for the movie 50/50.",
      "review_date": "2011-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie. One of my favorites I've seen all year. With the combination of Joseph Gordon Levitt's boyish charm to Seth Rogan's Seth Rogan, it's comedic heaven. It's the type of movie that makes you grateful for what youI absolutely loved this movie. One of my favorites I've seen all year. With the combination of Joseph Gordon Levitt's boyish charm to Seth Rogan's Seth Rogan, it's comedic heaven. It's the type of movie that makes you grateful for what you have and who you share that with.",
      "review_date": "2011-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In a market where the majority of films rely upon superfluous amounts of violence and gore, massage use of sex appeal, shallow and exaggerated melodrama, and an exploitation of CGI, it is always refreshing to come across a diamond in theIn a market where the majority of films rely upon superfluous amounts of violence and gore, massage use of sex appeal, shallow and exaggerated melodrama, and an exploitation of CGI, it is always refreshing to come across a diamond in the rough, so the speak, that shines with a novelty that is memorable and entertaining. Joseph Gordon-Levitt plays a character that discovers he is diagnosed with a formation of a tumor on his spine that is a rare type of cancer. Despite the medical lingo involved in such a situation, the terminology used from the very beginning of the film and then throughout the progression of therapy, there never is a moment where the entertainment value is hindered by such.  This is much in part because of the clear nature in which it is presented ",
      "review_date": "2012-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why would anyone hate this movie ? 50/50 is an amazing movie with a remarkable concept. Everything in this movie is an amazing example of life which makes it a great movie.Jonathan Levine's directing was amazing . Will Reiser's writhing wasWhy would anyone hate this movie ? 50/50 is an amazing movie with a remarkable concept. Everything in this movie is an amazing example of life which makes it a great movie.Jonathan Levine's directing was amazing . Will Reiser's writhing was seriously on the top. Joseph undoubtedly did his best work. Seth was exactly the same as he was in his other movies but this time his character was was little bad then other times. Anna was so amazing . She was really good and she played her role in a really cute was which made her perfect . & Although Bryce's character was bad but her acting wasn't at all. She was amazing and Yeah I still like her so much...she was too cute. 50/50 was really enjoyable and Funny and yeah it was the best Com-Drama of 2011.",
      "review_date": "2012-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "See-it - It's inspired by a true cancer diagnosis story, but it's not a Lifetime movie or Hallmark film -- it's a clever dram-com starring Joseph Gordon-Levitt and Seth Rogen that will make you laugh AND cry.",
      "review_date": "2011-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film like \"50/50\" rarely surfaces. It's a cancer comedy, and although raunchy and crude, still approaches its subject matter with the utmost respect, honesty, and sincerity. Tonal issues bog down the third act significantly, but thatA film like \"50/50\" rarely surfaces. It's a cancer comedy, and although raunchy and crude, still approaches its subject matter with the utmost respect, honesty, and sincerity. Tonal issues bog down the third act significantly, but that doesn't diminish the fact that every actor in this movie is excellent, every line of dialogue is terrifically executed, and almost every moment of emotion feels totally genuine.",
      "review_date": "2011-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is one of those films that you either love or hate. If you hate it, you really hate it, you loathe it with a passion because for some reason you find the film offensive. If you are in the love category the film floors you with its50/50 is one of those films that you either love or hate. If you hate it, you really hate it, you loathe it with a passion because for some reason you find the film offensive. If you are in the love category the film floors you with its depiction of a man way too young contracting a deadly disease. As you may have figured out by the score and what I just said, I found 50/50 to be one of the most heart wrenching honest films of the year as it tackled so many themes and issues while infusing the film with a lot of crude yet hilarious comedy.\rThe fact that the writer went through the same experience definitely helped make the film the way it is but the director clearly understood the delicacy it took to walk the line between drama and comedy. The comedy was well structured into the script and the scenes so that the emotional beats had time to resonate. In fact 50/50 manages to avoid the problem of most comedies in that its last 30 minutes are the best of the film. It doesn't lose focus at any time in the film, it stays on message thanks to a great script, some skillful direction and a touching lead performance by Joseph Gordon-Levitt.\r Not only does Levitt prove himself as a skilled performer but the rest of the cast is perfectly cast. There is only one dud performance in the shape of Bryce Dallas Howard's shrill Rachael. Despite that Anna Kendrick acts as a perfect foil for Levitt as his inexperienced therapist as they both try to give such reserved performances but with so much going on under the surface. As always Anjelica Houston brings life to a character that could have easily been a cliche if undertaken by a lesser actress. Rogen to an extent plays his usual character but that is what is required to relieve some of the tension and lighten the mood.\rIt's a well put together drama that just so happens to be hilarious at times, with one of the best ending all year. While not as good as Beginners it is pretty close to being the best film of 2011.",
      "review_date": "2011-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a better movie than I had anticipated.  Touching, poignant, sad, and funny.  Seth Rogan is, well, Seth Rogan.  He isn't an actor, because basically he just plays himself in every film.  With that said, he delivered some very funnyThis was a better movie than I had anticipated.  Touching, poignant, sad, and funny.  Seth Rogan is, well, Seth Rogan.  He isn't an actor, because basically he just plays himself in every film.  With that said, he delivered some very funny lines in this movie.  Gordon-Levitt gives a strong performance, but he still lacks the maturity as an actor to make us forget he's that he's \"acting\".  I wouldn't recommend paying full price, but it's definitely worth seeing at a matinee.",
      "review_date": "2011-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it!!! Great Great movie!!! The acting was amazing. A great mix of funny and sad moments. Shows how some one can get through cancer treatment a positive way with help and support from friends and family. A must see!",
      "review_date": "2012-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film. Not as many laughs as they portray in the trailer; but really great dramatic sequences.  This movie is absolutely worth the watch. Go see it.",
      "review_date": "2011-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is based on a true \"loosely based\" story of screenwriter Will Reiser's diagnosis and treatment of a spinal sarcoma. There are over 50 different types of sarcoma. We lost our 37-year old daughter to one of them, Ewing's sarcoma. Although50/50 is based on a true \"loosely based\" story of screenwriter Will Reiser's diagnosis and treatment of a spinal sarcoma. There are over 50 different types of sarcoma. We lost our 37-year old daughter to one of them, Ewing's sarcoma. Although difficult for us at times, both my wife and myself enjoyed the movie very much. Several scenes struck home. As a cancer survivor, I related to the fear of being wheeled away into surgery. On a scale of 1 to 10, I rate this move a 9 and a \"must see\" for all caregivers.  You can learn about the rare and dangerous cancers called \"sarcoma\" in The Sarcoma Learning Center at http://bit.ly/4yEz7m",
      "review_date": "2011-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With fantastic actors for the roles, the dark humour plays well with the situation, but the point was - neither the poignancy or comedy made it awkward, but when it did, it was done well, and it felt sweet and amusing to make light of such aWith fantastic actors for the roles, the dark humour plays well with the situation, but the point was - neither the poignancy or comedy made it awkward, but when it did, it was done well, and it felt sweet and amusing to make light of such a horrific event. And more specifically, it managed to have not just dark humour, but also a hilarious comic effect. Joseph Gordon-Levitt has just been amazing in every film I've seen, and I still found Seth Rogen's awkward jokes funny. Great chemistry, and provided an honest account of cancer - it wasn't cheesy, it didn't feel Americanised and the way things were resolved just felt fascinating.",
      "review_date": "2012-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you think of life as a tree, then you will eventually come to understand that some relationships are the roots while others are the leaves.  I am reminded of this analogy as I review the independent feature film 50/50, a worthy effortIf you think of life as a tree, then you will eventually come to understand that some relationships are the roots while others are the leaves.  I am reminded of this analogy as I review the independent feature film 50/50, a worthy effort directed by Jonathan Levine and written by Will Reiser about a 25-year old man in Seattle diagnosed with cancer of the spine.  Coincidentally, on the day I saw 50/50, I listened to the NPR interview with Will Reiser who explained the screenplay is loosely based on his own experience with cancer.  I was most struck with Reiser's comments about the evolution of his relationship with his mother post-diagnosis, and that Seth Rogen is both his friend in real life as well as the film.    When Adam's persistent back pain leads to a cancer diagnosis, his relationships begin to take their respective places on his tree.  Joseph Gordon-Leavitt (Inception, 500 Days of Summer) is Adam, a Seattle Public Radio reporter.  At the opening of the film he is living with girlfriend Rachael (Bryce Dallas Howard, The Help), an aspiring artist.  Seth Rogen (Pineapple Express, Knocked Up) plays his co-worker and best friend Kyle.  Anjelica Huston (Choke, The Darjeeling Limited) plays Diane, Adam's mother whose controlling presence is a source of irritation.  Anna Kendrick (Up in the Air) plays the recently initiated young cancer support therapist Katherine who helps Adam negotiate his emotional land mines. In addition to this able cast, Phillip Baker Hall  and Matt Frewer portray the fellow chemotherapy patients whose wisdom provide additional insight, humor and pathos to the story.Gordon-Leavitt puts in an appealing performance as Adam, effectively portraying the fear, disbelief and frustration of a cancer patient.  He is an apt straight man for the antics of Seth Rogen who brings his entertaining signature schtick to the performance as Adam's sometimes bumbling but always well-meaning friend.  Kendrick delivers the best and most refreshing performance as the therapist, alternating between idealism and frustration, but never giving up.  Likewise, Huston brings neuroses, strength and vulnerability to her role in equal parts, and Howard's Rachael is sufficiently shallow to make us applaud when Adam finally gives her the boot. For me, the pleasure of 50/50 is in Adam's realizations about the role of his life relationships as revealed during a time of crisis, and I came to further admire Seth Rogen not only as an actor, but also as a person of character who in real life came through for a friend. This film contains plenty of the young fresh faces and irreverent humor that characterize much of indie film today, and if you like that genre as I do, then you will enjoy 50/50 for that reason alone.  However, because this film also insightfully portrays prevalent medical issues, it has an appeal beyond indie audiences.  Additionally, the humor keeps the story from descending into Lifetime channel drivel.  For these reasons, I rate 50/50 6 out of 10.This review also appeared at www.filmdilettante.com",
      "review_date": "2011-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie made me laugh and cry.  Any movie that can do that to a 20 something year old boy must be a great film.  So touching and sad and as the tears start to stream down your face you can't help but laugh out loud at the outrageouslyThis movie made me laugh and cry.  Any movie that can do that to a 20 something year old boy must be a great film.  So touching and sad and as the tears start to stream down your face you can't help but laugh out loud at the outrageously funny parts in this movie.",
      "review_date": "2011-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Joseph Gordon Levitt and Seth Rogen continue to impress me with everything they have acting in recent years. 50/50 is no exception to that. First time screenwriter, Will Weiser, wrote 50/50 loosely based on his experiences with cancer and howJoseph Gordon Levitt and Seth Rogen continue to impress me with everything they have acting in recent years. 50/50 is no exception to that. First time screenwriter, Will Weiser, wrote 50/50 loosely based on his experiences with cancer and how his real life best friend, Seth Rogen, helped him through it.  The film follows Adam (Joseph Gordon Levitt), who works at radio station with his best friend Kyle (Seth Rogen).  Adam also has girlfriend, Rachael (Byrce Dallas Howard), who Kyle doesnâ",
      "review_date": "2011-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Never I have I cried and laughed so hard in the same movie! This is an underated masterpiece. Everyone is casted fanatastically. Props to Anjelica Houston for playing the neurodic mother, probably one her best roles ever. Joseph Gordon-Never I have I cried and laughed so hard in the same movie! This is an underated masterpiece. Everyone is casted fanatastically. Props to Anjelica Houston for playing the neurodic mother, probably one her best roles ever. Joseph Gordon- Levitt is extremely likeable and sympathetic as a lead. The plot is typical but still moving. Go and See this movie!",
      "review_date": "2013-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Films like this don't come along very often.... Not only is it a comedy, but its a movie with tons of humor at the best of moments, and a multitude of moments to tug at your heart strings. This movie truly has what it takes to be the best ofFilms like this don't come along very often.... Not only is it a comedy, but its a movie with tons of humor at the best of moments, and a multitude of moments to tug at your heart strings. This movie truly has what it takes to be the best of both worlds. Gordon-Levitt has really revived his acting career recently and with this role he shows what he can do. Seth Rogen being himself (not to mention the role he played) was phenomenal. It truly reveals that women are not the only people that can have a bond and be there for one another. Definitely a movie worth my time and everyone else's. Scrubs was always a favorite show of mine and it always had humor, but with meaning. This movie knocks it out of the park!",
      "review_date": "2012-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie surpassed all expectations that I had for it.  I thought it would be enjoyable but I didn't think that it would leave a lasting impression on me.  Seth Rogen is finally showing that he can be relevant and Gordon Levitt continuedThis movie surpassed all expectations that I had for it.  I thought it would be enjoyable but I didn't think that it would leave a lasting impression on me.  Seth Rogen is finally showing that he can be relevant and Gordon Levitt continued his string of memorable performances.  The comedy was present enough to balance out the otherwise heavy feelings that dominated the film.  Definitely worth seeing.",
      "review_date": "2011-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is undeniably one of the best films this year. Humor and tragedy in one. Recognition-worthy acting from Joseph Gordon-Levitt. Seth Rogen and Anna Kendrick does it good too. Satisfactory screenplay.movienotesbook.blogspot.com",
      "review_date": "2011-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "At first I thought this movie was going to be ok and kind of sad but when I actually saw it I was amazed at how sad and touching this movie is. I cried through out the whole movie. I gave this movie a 10 and I would recommend it to every one.At first I thought this movie was going to be ok and kind of sad but when I actually saw it I was amazed at how sad and touching this movie is. I cried through out the whole movie. I gave this movie a 10 and I would recommend it to every one. It was just awesome!",
      "review_date": "2011-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI like 50/50! It's about cancer and how it can change your life. We see Joseph Gordon-Levitt and Seth Rogen as friends in this movie and they fits perfectly. Joseph Gordon-Levitt as Adam is a healthy person and when he diagnosed cancer he was highly chocked. We follow Adam and his friend Kyle and he is only thinking about sex and having fun and seems to be a bad friend. Adam seems to be the original cancer patient and holding his emotional for him self. I really cared about him and felt his anger, his sadness and how hard it is to know that you maybe will die and not see our friends nor family anymore. At the end of the movie I actually cried, I felt broken just like Adam. This movie also brings a few funny dialogues and scenes with Kyle (Seth Rogen) due to he is the \"party dude\" and want Adam to have fun and he takes him to disco and tells him to take advantage of his cancer to get laid, which is quite pathetic.",
      "review_date": "2011-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Difficult film to grade. On the positive this happened to the writer, so there is truthfulness (Mr Rogen is actually a best friend of the writer). Characters are composites of multiple characters that came and went in the lief of Mr Reiser.Difficult film to grade. On the positive this happened to the writer, so there is truthfulness (Mr Rogen is actually a best friend of the writer). Characters are composites of multiple characters that came and went in the lief of Mr Reiser. So while it didn't \"feel\" right, if I go with the \"this stuff really happened\" insight, it's worth seeing. On the other side, well, it really doesn't work. All the other characters seem forced in what they're doing. Ms Kendrick is to young and inexperienced to be believable as the doc. Plus the flow of the film was obvious to me (I did know some of what happened as I heard Mr Reiser on NPR talking about the film). Then there is Mr Rogen; he is playing the same \"dude\" as in his other what is called \"stoner' comedies. I chuckled now and then at him but he was not convincing as the best friend. In summary I find myself uncertain with two movies here: a serious film wit some comic relief about a young person with cancer and a irreverent poke at the same subject. I'm torn between my lowest recommended rating (B-) and my almost wroth seeing rating (C+). I'm going with \"worth a look\", but just so.",
      "review_date": "2012-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hollywood has used cancer as a dramatic crutch for so long. It's still a topic that flourishes in Lifetime movies and Nicolas Sparks stories. But finally, we get a fresh take on it with \"50/50;\" a movie that miraculously turns the subject ofHollywood has used cancer as a dramatic crutch for so long. It's still a topic that flourishes in Lifetime movies and Nicolas Sparks stories. But finally, we get a fresh take on it with \"50/50;\" a movie that miraculously turns the subject of cancer into a hysterical comedy. Now that's not to say that cancer is the punchline. There are actually quite a few touching moments where the cancer diagnosis is treated quite seriously. What the movie instead focuses on is the odd friendship between Rogen and Gordon-Levitt. The two characters complement each other wonderfully. Gordon-Levitt treats his cancer as a death sentence to no longer have fun in life, and Rogen wants him to use his cancer to hook up with beautiful women. It's this dynamic that leads to \"50/50\" being one of the best comedies of the year. It made me laugh as hard as \"Bridesmaids.\" Besides its comedic moments, \"50/50\" also succeeds as a drama and romance. While some of the dramatic scenes don't hold enough weight, the movie still outshines 90% of cancer dramas. What does carry the movie through to the end is the believable chemistry between Gordon-Levitt and Kendrick. I think I might be slightly biased due to my huge crush on Anna Kendrick. But the actors seem so natural together that you can't help but root for Gordon-Levitt to make it through alive so he can make beautiful babies with that lovable woman.",
      "review_date": "2011-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mixing comedy and drama isn't an easy thing to do. Sometimes it works, but a lot of times it doesn't. It gets even more difficult when you're joking about things you're not supposed to joke about. In 50/50, Seth Rogan is the best friend/comicMixing comedy and drama isn't an easy thing to do. Sometimes it works, but a lot of times it doesn't. It gets even more difficult when you're joking about things you're not supposed to joke about. In 50/50, Seth Rogan is the best friend/comic relief and while he's hilarious as always, it doesn't really fit with the tone of the film. For the most part, 50/50 is an inspiring story about a young man fighting for his life. While the writer tries to use comedy to lighten the mood, I felt that all it did was distract me from the story and bring the quality of the picture down. As always, Joseph Gordon-Levitt was absolutely incredible and continues to be the most talented and underrated actor in all of Hollywood, but I guess that's what happens when you get your start on an overrated sitcom. Those looking for another hysterical Rogan/Pot inspired comedy will be disappointed by this film, and those looking for a touching drama, may also be disappointed by the inappropriateness of it all. I liked the film a lot, even though it tries to blend two things into one, rather unsuccessfully. Simply put JGL makes this film, Rogan doesn't fit, and there's only about a 50/50 chance you're going to enjoy it.",
      "review_date": "2013-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not sure how they managed to make a stoner cancer comedy but it totally worked in my opinion. Heartfelt and hilarious. I would definitely give this a second viewing, in fact I'm looking forward to it.",
      "review_date": "2012-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Both moving and funny, the movie serves as a study of loneliness in a time where man is most vulnerable. The characters are believable, and even though it is a little predictable for a moment it is still definitely worth watching.",
      "review_date": "2012-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A dramedy about cancer is a proper hard-sell in the market, this wee budget film (although JGL and Seth Rogan are quite bankable names among their peers) has done a quite solid battle in the box-office last year (domestic total gross is $35A dramedy about cancer is a proper hard-sell in the market, this wee budget film (although JGL and Seth Rogan are quite bankable names among their peers) has done a quite solid battle in the box-office last year (domestic total gross is $35 million against its $8 million budget), due to its very heartfelt closeness and touchingness of its concoction of the three-faceted narrative (love, friendship and family) revolving around our young protagonist who has been through an ordeal of a very rare spine cancer. Adopted from a true event of the screenwriter Will Reiser (who is a close friend of Rogen and takes on an ephemeral cameo too), the film has a rare pluck and daintiness in reciting the story from a very earthly perspective, no flamboyant hyperbole, the plot goes through a carefully measured but innately captivating melodrama (although the big question of the survival of the operation had never been doubted, the bare truth is the screenwriter himself is still alive!), it could be reckoned as a sequel of (500) DAYS OF SUMMER (2009, 8/10), JGL continues to generate his congenial drawing power through the rough road of a young man",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Truly an inspirational movie balancing between dark comedy and serious drama. Interesting characters, believable storyline and the numerous metaphoric subtleties make this a treat. Highly recommended for all adults.",
      "review_date": "2012-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I will say this, as someone who has gone through having cancer and all the experiences that go with it: this movie does an excellent job of portraying what happens to an individual mentally and with experiences with others.  Now, on to theI will say this, as someone who has gone through having cancer and all the experiences that go with it: this movie does an excellent job of portraying what happens to an individual mentally and with experiences with others.  Now, on to the movie...I thought it was refreshing, and did an interesting job of toeing the line of seriousness and humor on a subject that hits home for so many of us.  I thought it was great to see a movie that showed what it is like to go through the rigors of cancer, and the sometimes awkward moments that come with it.  The cast is great, and the movie is top notch.  A must see.",
      "review_date": "2012-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Slice of life movie. makes you think about connections with people close to you and death. I wrote a review now because before this movie and after i have connected to it. that's all im willing to say. Just check it out and be open mindedA Slice of life movie. makes you think about connections with people close to you and death. I wrote a review now because before this movie and after i have connected to it. that's all im willing to say. Just check it out and be open minded to the comical stuff.",
      "review_date": "2012-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was, in my humble opinion, truly fantastic and it's highway robbery that it hasn't received any Oscar nominations. Joseph Gordon Levitt does a beautiful job and Seth Rogan helps to balance the film excellently. The unique approachThis movie was, in my humble opinion, truly fantastic and it's highway robbery that it hasn't received any Oscar nominations. Joseph Gordon Levitt does a beautiful job and Seth Rogan helps to balance the film excellently. The unique approach of comedy-cancer drama may seem shaky at first but brilliant execution save it from any all all possible pitfalls. This film is truly moving and one of the only to have made me cry since Rrokeback mountain. If you haven't already, go and see it. You won't regret it.",
      "review_date": "2012-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "one of the best movies of 2011 this movie was funny and sad at the same time it was a masterpiece. the people in the movie do use alot of profanity though.",
      "review_date": "2012-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As an oncology NURSE, I would like to counter novictim's review and say that I thought this movie did an excellent job showing what some patients experience when dealing with cancer. Also, I don't think Seth Rogan's character is there to makeAs an oncology NURSE, I would like to counter novictim's review and say that I thought this movie did an excellent job showing what some patients experience when dealing with cancer. Also, I don't think Seth Rogan's character is there to make the audience laugh...  He is a guy trying to make his FRIEND laugh. He doesn't always succeed because... that's what happens in real life.  I could relate to every character in this movie. This movie is so good on so many levels, I'd recommend it to anyone emotionally mature enough to get it.",
      "review_date": "2012-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 tells the heartfelt tale of a young man battling cancer with great comedic flare.  The characters are very relatable, and the film does a great job of pulling you in.  A roller coaster of emotions will have you laughing one moment and50/50 tells the heartfelt tale of a young man battling cancer with great comedic flare.  The characters are very relatable, and the film does a great job of pulling you in.  A roller coaster of emotions will have you laughing one moment and crying the next.  LOVED it and will definitely watch it again. Hats off to Seth Rogen and Joseph Gordon-Levitt.",
      "review_date": "2012-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nice movie,Joseph Gorden Levitt is good,Seth Rogan just plays the role he always plays.Some dramatic parts and some really funny parts.The girl from up in the air is in it ,she's pretty cute. Bryce Dallas Howard is a **** in this,just likeNice movie,Joseph Gorden Levitt is good,Seth Rogan just plays the role he always plays.Some dramatic parts and some really funny parts.The girl from up in the air is in it ,she's pretty cute. Bryce Dallas Howard is a **** in this,just like she is in the help,still pretty sweet that her dad is Richie Cuttingham.",
      "review_date": "2012-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i dont watch too many movies twice, but i did for this one. more of a drama than a comedy. 9 out of 10. Tied with warhorse for my 2 favorite films of 2011.",
      "review_date": "2012-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If there is anything to be said about this film, it is that the acting is fantastic. The story is good yet almost typical from what I would expect, but the acting and script is where the film really stands out from many other movies. TheIf there is anything to be said about this film, it is that the acting is fantastic. The story is good yet almost typical from what I would expect, but the acting and script is where the film really stands out from many other movies. The dialogue between characters is absolutely hilarious at times, and about exactly what I was hoping for. One character that may get overlooked is Adam's mother. She is not in many scenes, but when she is, the actress plays her character spot on. I would describe her as an absolute nervous wreck, at times, and others as a typical worried mother. She did a fantastic job of making even me feel awkward for Adam at times. I don't know that overall this film will be very memorable as a whole, but I think there are certain scenes that will be. In particular the scene where Kyle, Seth Rogen's character, is helping Adam shave his head. This scene is spot on with how men are and act with one another and the scene is just simply a classic example of great acting. Also many scenes with Adam's therapist are quite memorable. Again, I wouldn't say 50/50 as a whole will be remembered as a classic or a top film years down the road, but I think certain scenes, lines, or dialogue will be. For my full review, visit http://visuallyimpairedreviews.blogspot.com/2012/03/5050.html",
      "review_date": "2012-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Film is okay. Joseph Gordon-Levitt did a pretty good job  but the movie is a little weird. It tries to mix being funny and serious but they didn't flow together. Seth Rogen was annoying and totally worthless to the entire movie. The movieThe Film is okay. Joseph Gordon-Levitt did a pretty good job  but the movie is a little weird. It tries to mix being funny and serious but they didn't flow together. Seth Rogen was annoying and totally worthless to the entire movie. The movie was 50/50.",
      "review_date": "2012-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First things first, â",
      "review_date": "2012-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I wasn't capable of evening summoning up an ounce of compassion for the main character. If I am blunt, Joseph Gordon-Levitt is just obnoxious and Anna Kendrick is inexplicably annoying. A generic story for what the concept is.",
      "review_date": "2013-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is screenwriter Will Reiser's first script, and it's a damn good one at that. Great dialogue, much of it coming from Seth Rogen (even if times it's nothing but cursing), and he does well mixing it in with his own experiences with cancer.This is screenwriter Will Reiser's first script, and it's a damn good one at that. Great dialogue, much of it coming from Seth Rogen (even if times it's nothing but cursing), and he does well mixing it in with his own experiences with cancer. The film moves along fluidly thanks to the excellent direction by Jonathan Levine. The film is gorgeously shot by cinematographer Terry Stacey, and its editing by Zene Baker is top notch. Overall, a film that you will both laugh your butt off and cry your heart out and still will enjoy.",
      "review_date": "2012-05-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 was a real gamble, a comedy drama about cancer. But it thankfully it works, very well actually, exceeding expectations. The whole cast performs perfectly, with Seth Rogen, Anjelica Huston and Anna Kendrick particularly, but the stand50/50 was a real gamble, a comedy drama about cancer. But it thankfully it works, very well actually, exceeding expectations. The whole cast performs perfectly, with Seth Rogen, Anjelica Huston and Anna Kendrick particularly, but the stand out here is star, Joseph Gordon Levitt. He manages to be funny, and when it comes to dramatic scenes soars, showing he truly is one of the greatest actors around. The writers create a good script also, which manages to keep the balance of comedy and drama superbly, but be warned this is only for a certain audience for some may find it insensitive towards the subject matter, but, even these people shouldn't worry, only the beginning is particularly funny, for as the cancer gets worse, the films mood falls down to a real drama. This is a bit of a let down, for you hope for the whole film to have a light mood to it, but you have to face that cancer is not a happy subject, and the drama near the end is real tear jerker drama. Overall, a good film that many not be laugh out loud funny, but keeps the balance perfectly, to create one of the best films of 2011.",
      "review_date": "2012-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is a pleasant surprise of a film. As many critics have alluded to, the film brilliantly handles its cancer subject and balances the serious, the emotional, and the funny, phenomenally. Every transition is seamless and it honestly never50/50 is a pleasant surprise of a film. As many critics have alluded to, the film brilliantly handles its cancer subject and balances the serious, the emotional, and the funny, phenomenally. Every transition is seamless and it honestly never felt as though the film was disjointed or did not know what it was. Rather, the film decided to take a lighter approach to cancer, which is appreciated. While it still hit you with the true emotion and the pain and suffering as necessary, it tried to lighten the mood throughout, which is why Seth Rogen is perfect here. As a comic, he really brought his A game here and served as a perfect foil to the subject as a whole. Joseph Gordon-Levitt is fantastic here, as are Anna Kendrick, Philip Baker Hall, and Anjelica Huston. Huston played the mother perfectly and really felt authentic as the mother of a cancer victim. The direction and the writing are the winners here as the film manages to tackle the dirty and gritty elements of cancer, while also being a really fun and entertaining comedy. 50/50 is a true joy to watch and will make you laugh and cry, as it did to me.",
      "review_date": "2016-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great dramedy with flawless actors. You see how intense cancer is, but on the other side it makes you feel good. It was too stereotypical and predictable to give it a 10 or a 9, but nevertheless it's a wonderful movie. Go and watch it, it'sA great dramedy with flawless actors. You see how intense cancer is, but on the other side it makes you feel good. It was too stereotypical and predictable to give it a 10 or a 9, but nevertheless it's a wonderful movie. Go and watch it, it's really loveable!",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everyone is pitch perfect. Levitt delivers compelling and heart wrenching performance, Kendrick is great, and even the parents have specific and well executed roles.",
      "review_date": "2012-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the more seamless blends of drama and comedy that I have ever seen. Throughout the entire film I found myself prepared to cry as well as prepared to laugh. In that way it was very much like...well...life. 50/50  is engaging, humorous,One of the more seamless blends of drama and comedy that I have ever seen. Throughout the entire film I found myself prepared to cry as well as prepared to laugh. In that way it was very much like...well...life. 50/50  is engaging, humorous, touching, heartfelt and uplifting. Very, very nice movie.",
      "review_date": "2012-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A remarkably emotional, astonishingly hilarious, life-affirming drama with winsome characters and some truly uplifting thematic messages to share.",
      "review_date": "2012-11-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Never really takes off but meanders on. The acting was just OK. There were some good jokes. In the end I found it very generic. I couldn't care about Adam at all. Very plain and unimpressive. Cannot recommend it. They tried fusing comedy andNever really takes off but meanders on. The acting was just OK. There were some good jokes. In the end I found it very generic. I couldn't care about Adam at all. Very plain and unimpressive. Cannot recommend it. They tried fusing comedy and drama but failed at both.",
      "review_date": "2013-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think this is one of the best drama/comedy films I have seen in a very long time. The cast is perfect and Joseph Gordon-Levitt shines. One of the more underrated films of 2011.",
      "review_date": "2012-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A heart warming movie that deals with a tough subject. The film mixes emotions together to create a really fun movie with great performances from the lead actors who add to the feel of the movie as a whole.",
      "review_date": "2013-07-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best comedy-drama films I have ever viewed. This is some of Joseph Gordon-Levitt's best acting, and one of the most dramatic films of 2011, I almost cried.",
      "review_date": "2013-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An insanely effective film in emotion and drama, but it falls a little in comedy. I wish this film did have more laughs, that being said, the overshadow of how effectively this movie created sadness is good enough for me. Really impressive stuff",
      "review_date": "2015-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"50/50\" is one of those very few movies that manage to find the ideal mix between humor, drama, and emotion. The movie nails the emotions at the time it wants to, from the fear and depression that comes with the cancer, to the lighter and\"50/50\" is one of those very few movies that manage to find the ideal mix between humor, drama, and emotion. The movie nails the emotions at the time it wants to, from the fear and depression that comes with the cancer, to the lighter and funnier side of the movie (without ever insulting any cancer patients, contrary to some beliefs). And I am proud to say that this is the first movie that ever made me cry, due to its way of telling you \"Do what you want to, while you still can\".",
      "review_date": "2013-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cancer is a matter that shouldn’t be laughed at. So when you hear of the new “cancer comedy” coming out, you are immediately offended. Well, 50/50 is a cancer comedy and I think it gets a bad rap for being that. 50/50 may have jokesCancer is a matter that shouldn’t be laughed at. So when you hear of the new “cancer comedy” coming out, you are immediately offended. Well, 50/50 is a cancer comedy and I think it gets a bad rap for being that. 50/50 may have jokes throughout and some that even involve our protagonist’s spinal cancer, but the last thing 50/50 is doing is laughing at cancer.\rThere are a lot of movies that take on the tough subject of cancer and it’s usually about a person struggling with the illness and going into a depression or trying to provide for his family before it’s his time to go. What I’m saying is that they don’t take this subject lightly. 50/50 doesn’t take the subject lightly either; actually it is probably more accurate in its interpretation than any of the other films that go around the same concept. 50/50 takes cancer and instead of making it dreary and somber, it becomes a film that can mask the sadness and put something incredible, and even beautiful, in its place. It brings out the best of the situation with hilarity, and it shows the true struggles with drama, but it shows them in a way that you can tell that the characters are overcoming them one step at a time with the help from their family and friends.\r50/50 is a success is a lot of its aspects, but the most impressive part is the writing. Will Reiser is a poet. The writing in this movie is so complex and so impactful, it’s beautiful. The best part about it, and I noticed this immediately after, is that even the smaller and less important events that occur during the movie are shown and felt as to be equal to the large events that occur. The small occurrences send just as much of an impact as the larger ones. There is a scene where Joseph Gordon-Levitt gets angry at Seth Rogen out of stress and yells at him for using his cancer to get women and that he doesn’t care about him. In the net scene, JGL goes back to Rogen’s house and before leaving, decides to go to the bathroom and sitting on the toilet seat is a book called “Facing Cancer Together.” JGL opens up the book and sees that there are sections of text underlined and arrows pointing to important parts. Now this was only a short scene that doesn’t have much to do with the bulk of the plot, but it is nonetheless one of the most impactful and emotionally rewarding scenes in this movie. It shows that Rogen’s character was having difficulties with the cancer and that he really did care, and it shows it with utter finesse.\rAnother impressive aspect was the acting. The acting was phenomenal in this movie, from everyone in it. Even Seth Rogen showed us a dramatic side that we had no idea he had. He really surprised at how good he was at being the funny best friend to JGL (Kyle). But the best performance was from JGL himself. His character was a tough one to play. His character was the kind of person who you would think was nice when you met him, but you wouldn’t have any interest in meeting with him again. He was awkward, sad, and extremely sympathetic. JGL played the character in a way that he made the character almost intolerably sympathetic without making him unlikable. Nothing ever goes his way. Throughout the entire movie, even in the funny parts, you never lose that feeling that he has cancer and that he’s still trying to overcome that obstacle. This is an important thing to keep because you don’t want to lose sight of what’s truly going on.\r50/50 moved me in ways I didn’t think a movie could. It wasn’t just a respectable film that effectively captures the raw emotion of cancer, but it was an incredibly entertaining one. It was hilarious, heartfelt, sad, and almost beautiful…no, it was beautiful. It takes the sorrow and sadness of cancer and masks the darkness with something bright and joyful that just makes you happy. That’s what this movie did, it made me happy. I don’t know how many movies about an illness you can say that about, but it made me happy and excited about life. I would even say that cancer patients should check this one out because it doesn’t make cancer out to be this dangerous and terrifying thing you should fear, it makes it out to be just another obstacle in the way of the great game of life. 50/50 digs to the heart of a tough situation with humor and drama without ever losing sight of what it really cares about, and what it cares about is magnificent.",
      "review_date": "2013-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film was funny and moving at the same. It was intense and I liked all the performances in that film especially Seth Rogen. I can say that this one was great for the cinema as many people laughed and some were crying?? That's all i haveThis film was funny and moving at the same. It was intense and I liked all the performances in that film especially Seth Rogen. I can say that this one was great for the cinema as many people laughed and some were crying?? That's all i have to say. A must watch...",
      "review_date": "2013-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Works as a drama, and JGL plays the part just right. Seth Rogen tries, but doesn't succeed as the comical best friend in a movie with such a serious nature. Whenever there is a movie about a topic like cancer, jokes are not that acceptable.",
      "review_date": "2013-09-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Joseph Gordon-Levitt plays a cute, insecure cancer patient.  Seth Rogan plays his buddy... Seth Rogan.  This slow paced tale of a young man's battle with cancer is light, funny and touching, but really doesn't move at a pace to make it moreJoseph Gordon-Levitt plays a cute, insecure cancer patient.  Seth Rogan plays his buddy... Seth Rogan.  This slow paced tale of a young man's battle with cancer is light, funny and touching, but really doesn't move at a pace to make it more than a simple film.",
      "review_date": "2016-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In this funny and touching movie every actors are amazing.Joseph Gordon-Levitt and Seth Rogen were absolutely fantastic and the movie in general is fantastic.",
      "review_date": "2015-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 manages to bring humour about of a very serious subject. It took some balls for this movie to hit theatres and it holds up its end of the bargain. Its not always funny but it is always entertaining.",
      "review_date": "2014-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "50/50 is a special kind of a film. It is rare for a film to devote itself to both drama and comedy in such a masterful way as this one. A very enjoyable little film.",
      "review_date": "2014-12-23",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 142,
  "genres": [
    "Drama",
    "Comedy"
  ]
}