{
  "title": "Inside Out",
  "rating": 4.7,
  "release_date": "2011-09-09",
  "summary": "AJ always wanted a nice, quiet life.  For the past 10 years, his best friend Jack has been living it for him.  Now, after paying his debt, AJ is finally coming home – but he’s about to learn getting out of prison doesn’t mean you’re free. When Jack finds himself in the crosshairs of the local crime boss, AJ must revisit the sin s of hisAJ always wanted a nice, quiet life.  For the past 10 years, his best friend Jack has been living it for him.  Now, after paying his debt, AJ is finally coming home – but he’s about to learn getting out of prison doesn’t mean you’re free. When Jack finds himself in the crosshairs of the local crime boss, AJ must revisit the sin s of his past to protect the people he loves. (World Wrestling Entertainment)… Expand",
  "critic_reviews": [
    "This WWE-produced thriller is the best kind of bait-and-switch, auguring cranium-crushing action but instead delivering a meandering, eccentric, downright adorable existential crime yarn.",
    "Veering crazily in tone, Inside Out might fail to catapult its star into wider acceptability, but should delight fans of lightly absurd actioners.",
    "If Paul Levesque, the professional wrestler better known as Triple H, hopes to follow the career path of, say, Dwayne Johnson, who is now a credible action-adventure leading man, he's going to need movies a lot better than Inside Out to do it.",
    "The latter is played by Parker Posey, who looks baffled throughout. As well she should.",
    "Lawyer-turned-screenwriter Dylan Schaffer's script is an unhappy combination of genres, tones, too many dead stretches of people in cars and inept dialogue. Rapaport's tiresome patter doesn't allow for the weak laughs to land.",
    "These World Wrestling Entertainment-produced movies are a world unto themselves: Cliché-ridden B-flicks anchored by monstrously huge grapplers giving acting their all.",
    "Paul Levesque's over-the-top acting may be ideal for the larger-than-life world of WWE, where he grapples and grunts under the nom de ring Triple H. Forced to mime grappling with demons more internal than external, however, the ex–wrestling champ proves disastrously out of his league.",
    "Inside Out should be wild and violent, playing on the soap-operatic mood swings that drive televised wrestling; instead it's one or two murders away from being a Lifetime movie of the week."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Inside Out is a masterpiece. All the actors were perfectly cast, almost every joke hit, the animation was stunning, and the dialogue was smart. The world-building was also extremely impressive. Not since Monsters Inc. has a Pixar filmInside Out is a masterpiece. All the actors were perfectly cast, almost every joke hit, the animation was stunning, and the dialogue was smart. The world-building was also extremely impressive. Not since Monsters Inc. has a Pixar film constructed a new, foreign, complex world that was so easy to fall into. I've never cried in a Pixar film before, but this one got me twice the first time, and twice the second in different parts. My only complaint was that it was way too short! Must have more!",
      "review_date": "2015-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Acting wasn't the best, and the storyline went from alright to worse in a split moment. Horrible script. Triple H was alright, though he should stay in wrestling shows and not in movies.",
      "review_date": "2012-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An example of how terrible one movie is and then a future movie named the same thing manages to overtop it like swallowing up a bad gumball with a great gumball. Apparently, Disney/Pixar can make a better Inside Out than WWE and that's totalAn example of how terrible one movie is and then a future movie named the same thing manages to overtop it like swallowing up a bad gumball with a great gumball. Apparently, Disney/Pixar can make a better Inside Out than WWE and that's total disappointment right there because both the company (WWE) and their crappy movies sucks that someone (I was thinking of a girl that's insanely huge) can eat up the entire arena in one swallow.",
      "review_date": "2016-04-27",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 11,
  "genres": [
    "Drama",
    "Crime"
  ]
}