{
    "title": "Moneyball",
    "rating": 7.9,
    "release_date": "2011-09-23",
    "genre": [
        "Drama"
    ],
    "summary": "Based on Michael Lewis' nonfiction bestseller \"Moneyball: The Art of Winning an Unfair Game,\" the book's subject is Oakland A's general manager Billy Beane, who assembled a contending baseball club on a shoestring budget by employing a sophisticated computer-based analysis to draft players. (Sony Pictures)",
    "critic_reviews": [
        "Like a cold beer under a bluebird sky; like a flawless line drive on a warm summer's day; like a long, languorous seventh-inning stretch - Moneyball satisfies.",
        "Never before, though, have statistics added up to such electrifying entertainment. After the mostly minor-league productions of recent months, this movie, which was directed by Bennett Miller, renews your belief in the power of movies.",
        "It's hard to imagine anyone but Mr. Pitt in the role. He's relaxed yet edgy and sometimes unsettling.",
        "Funny, furious, and full of front-office drama.",
        "The real protagonist of Moneyball, however, is Beane himself, played with great charisma by Brad Pitt. (With this movie and \"The Tree of Life\" competing against each other, Pitt could wind up cheating himself out of an Oscar this year.)",
        "Moneyball is the perfect sports movie for these cash-strapped times of efficiency maximization.",
        "The movie is an absolute triumph of culturally relevant filmmaking – a film that will thrill and fascinate sport junkies and non-fans alike. If you like baseball, you will love this movie. If you hate baseball, you will still love this movie.",
        "A smart, intense and moving film that isn't so much about sports as about the war between intuition and statistics. I walked in knowing what the movie was about, but unprepared for its intelligence and depth.",
        "While a hopelessly awkward-looking Hill provides fish-out-of-water laughs, Pitt gives a genuinely soul-searching performance.",
        "The supersmart and rousing Moneyball, which may be the best baseball movie since \"Bull Durham,\" is also about talk, but in a coolly heady and original inside-the-front-office way.",
        "Starring Brad Pitt in top movie star form, it's a film that's impressive and surprising.",
        "His performance is a canny portrait of leadership - part genius, part crazy guts, part dumb luck - and worthy of moving Pitt up to the playoff round of Oscar finalists for Best Actor. We'd put money on it.",
        "Now that Pitt no longer has brash youth on his side, he's digging deeper and doing more with less. It's the kind of acting - understated but woven with golden threads of movie-star style - that gives us more to look at rather than less.",
        "It really happened, it's really corny, and it's really great.",
        "The surprisingly effective Moneyball has a smart script, solid direction and great performances.",
        "A crowd-pleasing baseball movie for people - like me - who don't like baseball movies...Probably the finest baseball movie since \"Bull Durham\".",
        "The supporting cast is strong, as is the deft, sharply witty script. Miller directs elegantly, letting the narrative unfold at a deliberate, artful pace.",
        "Moneyball is a hilarious and provocative change-up, entertaining without feeling the need to swing for the fences.",
        "Although you don't have to be a sports fan to enjoy it, Moneyball is one of the best baseball movies imaginable.",
        "It's tense, strangely funny in a lot of spots and – if you grew up loving old-fashioned, seat-of-the-pants baseball, as I did – the most depressing movie of the year.",
        "Moneyball is one of the best and most viscerally exciting films of the year.",
        "This is a subtle, elegant and altogether triumphant film about a subject I thought I was tired of, told with an artistry and freshness that is positively thrilling.",
        "Moneyball is a thinking person's baseball movie, and a baseball fan's thinking movie.",
        "It's a sports story, yes, because without baseball there's no Beane.  But it's far more a tale of a man's triumph over himself and his doubters.  And you don't need math to make sense of that.",
        "Miller directs with intelligence, though not flair, but the script makes up for any flagging energy with crackling Sorkin dialogue and performances that sing with revolutionary fervor.",
        "Director Bennett Miller has produced a warm and generally agreeable character study about the pratfalls of athletic institutions and the willingness to think outside the box.",
        "You don't need to understand anything of baseball to get behind this, a chest-swelling story about second chances and flipping a finger up (even a giant foam one) to The Man.",
        "Statistics and their alleged true meaning are at the heart of Moneyball, but it's also one of the most soulful of baseball movies - it confronts the anguish of a tough game.",
        "It's to the director's credit, and Pitt's, that Moneyball is anything but bloodless - in its own quiet, unspectacular way, this movie courses with life.",
        "A richly detailed and enjoyable American yarn.",
        "This extraordinary hybrid of a movie lives and breathes the game, yet its achievement is bigger than that. There's a touch of old-fashioned romanticism here, but more crucially there's strategy going on inside Bennett Miller's movie that turns it into something cool and special.",
        "On some level Moneyball is about loyalty: loyalty to an idea, loyalty to a partnership forged by desperation, loyalty to the values you believe in. Whether that was Lewis' intention in the book, or Beane's intention in taking the risk, doesn't matter. It's the formula Miller came up with for the film, and with the team of Pitt and Hill, it's a winning one.",
        "Best of all, filmmaker Bennett Miller (Capote) uses this brainiac sports movie to remind viewers that money is neither the measure of a man nor the ultimate assessment of quality; it's a myopic metric based on past accomplishments rather than future potential. After all, success isn't always about the home runs so much as just getting on base - again, and again, and again.",
        "Moneyball is a smart, funny, and thoughtful baseball movie.",
        "Moneyball presents a misleading story line in order to prop up Billy Beane as some kind of would-be miracle worker antihero. In truth, he's just another tobacco-chewing go-getter trying to make sense of a game that, thankfully, has never quite made sense.",
        "Turning the stately game into something few can resist – a smart and lively comedy of manners.",
        "Pitt and Hill are fantastic individually, and hilarious when together -- and on a surprisingly engaging script by Aaron Sorkin (\"Social Network\") and Steve Zaillian (\"Schindler's List\").",
        "Moneyball comes to life when elaborating on Beane's unique system of player selection, and the on-field baseball action is at times electrifying, but it trends toward the generic when tailing him away from the stadium.",
        "The movie doesn't quite come together, but it's full of smart, cynical talk, and it's very entertaining.",
        "The movie does achieve something nearly impossible: Someone who doesn't even like the sport may care about Billy Beane and the 2002 Oakland Athletics.",
        "Naysayers have been claiming for years that the \"Moneyball\" book wouldn't work as a movie. But ultimately, it's the cinematic touches that keep this film version from becoming something exceptional.",
        "True to Hollywood's tireless efforts to fit square-peg material into roundish genre niches, this wavering, intermittently smart story of daring to think differently flattens its narrative into formula."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I'm not sure that this is a GREAT film, but it is certainly emotionally involving to this AL West (and Halos)  fan who followed that 2002 season extremely closely for obvious reasons.  The writers and director made and extremely affectingI'm not sure that this is a GREAT film, but it is certainly emotionally involving to this AL West (and Halos)  fan who followed that 2002 season extremely closely for obvious reasons.  The writers and director made and extremely affecting film out of what could have been a dry subject.  I'm left wondering why the heck Paul DiPodesta didn't want his name associated with the film.  Jonah Hill came off as extremely likable.  And Beane has to be happy with the Pitt treatment.  Great choice in casting Activision CEO Bobby Kotick as the A's owner. I think he nailed the guy.",
            "review_date": "2011-09-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A sport's movie that does not follow the cliche of other sport's movies. Easily the best movie of the year. You don't need to love sports to like this movie. Great performance great script great movie!",
            "review_date": "2011-10-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although we have seen the subject materiel before about a failing team trying to be good again, and you sit there and wait for the happy ending. Yet, this film is told so intelligently and it makes the film entertaining. The film is helpedAlthough we have seen the subject materiel before about a failing team trying to be good again, and you sit there and wait for the happy ending. Yet, this film is told so intelligently and it makes the film entertaining. The film is helped even more by the pair of winning and charming performances from Brad Pitt and Jonah Hill. I give this film 88%.",
            "review_date": "2012-03-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not so much a baseball movie as it is the age-old story of someone trying to fight the system/establishment. The acting was great-- but they could have easily left out the main character's family subplot.",
            "review_date": "2012-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While the book was made more dramatic for film and concentrated more on the relationship building of Billy Beane and a fictional account of his assistant, Paul DePodesta and others into a new composite character, Peter Brand, Moneyball hitsWhile the book was made more dramatic for film and concentrated more on the relationship building of Billy Beane and a fictional account of his assistant, Paul DePodesta and others into a new composite character, Peter Brand, Moneyball hits every element of a good baseball movie where it should. Right in the heart. A key line in the film is, \"It's hard not to be romantic about baseball.\" Being a die-hard baseball fan, it's hard not only to not get romantic about baseball, but it's also hard not to be romantic about stories like this. While based on a true story, written by Michael Lewis to explain the sabermatic approach that Billy began taking with his previous GM (when he was an assistant), and continued on with Paul, the movie never mentioned the previous GM and began the story of using the sabermatic method after meeting the fictional Peter Brand, played by Jonah Hill. The acting is the best I've seen Brad Pitt do. He was a great fit for this role and I can see why he produced it. He must have thought the same thing. I've heard Oscar buzz about it, but I don't see it carrying that far. He certainly deserves it more than for the Curious Case of Benjamin Button. Jonah Hill plays seemingly the same character he does in every movie, and does it well. And Philip Seymour Hoffman is perfect as a generic portrayal of uncooperative manager, Art Howe, a portrayal in the film and book that the real Art Howe has heavily criticized and blames Beane's disregard for him. Aaron Sorkin brings his skills as a co-writer of the screenplay to dramatize the story very well and make it palatable for non-sports fans, but for those die-hards like me, Moneyball hits all the right places.",
            "review_date": "2011-10-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A good film......not a great film. Yes, it proves to be entertaining and interesting for those who are not huge fans of baseball and all it's tenured history. Pitt does another great job and Hill is really good as well. This is not a boringA good film......not a great film. Yes, it proves to be entertaining and interesting for those who are not huge fans of baseball and all it's tenured history. Pitt does another great job and Hill is really good as well. This is not a boring film by any stretch, and quite frankly I thought it would be. Its not and the dialogue is crisp and full of life and truth. It really does make you care for the on-screen struggles of these characters and it is enjoyable to watch, save for the downer ending....but hey! They can't argue with what actually happened, right?",
            "review_date": "2012-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Moneyball is a film that you could easily misjudge, it is a sports movie and starring by Brad Pitt, how deep can it get? A lot more than what people think. Moneyball teach you that experience does not mean too much when taking a decision.Moneyball is a film that you could easily misjudge, it is a sports movie and starring by Brad Pitt, how deep can it get? A lot more than what people think. Moneyball teach you that experience does not mean too much when taking a decision. Sometimes you need to take another point of view or a different way, in order to makes things right. This film shows how two men face their ideals and their fear of change, so as to pull out the baseball team of the loser chart. They resort to math and statistics.This team represents the whole life of manager, the players are his family and when he notice that, he decides to forget about the politic of not get involved, because is easier to let them go; and start doing the opposite. Is predictable what comes of that, the team improved.The performance of Brad Pitt is one the best I have seen in years and Johan Hill surprised me, the only problem of the movie is that it is a little bit slow, but when the plot is as original as this one, the speed of the film is not important.",
            "review_date": "2012-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film takes a relatively mundane subject matter and makes a great film out of it.  Pitt delivers as does Hill.  Great soundtrack and stylistic filming.",
            "review_date": "2012-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Aaron Sorkin once again takes a subject (baseball upper management) that should not be exciting, and makes it thrilling.  Both a hilarious and interesting look at what goes on behind the scenes in the world of baseball.",
            "review_date": "2012-08-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Really good film! Perhaps a bit overrated, but it does feature a brilliant script from Aaron Sorkin, and solid performances all around, especially from Brad Pitt.",
            "review_date": "2012-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "OH MY GOODNESS! What a performance, Jonah Hill and Brad Pitt, you literally couldn’t take your eyes off of them, and not because they take up most of the screen time. Brad Pitt delivers his usual sensational performance, and completelyOH MY GOODNESS! What a performance, Jonah Hill and Brad Pitt, you literally couldn’t take your eyes off of them, and not because they take up most of the screen time. Brad Pitt delivers his usual sensational performance, and completely deserves his Oscar nomination for this role. Jonah Hill lived up to my expectation, which pleasantly surprised me as I honestly thought he would just suddenly become the kid from Superbad, (don’t get me wrong I loved Superbad but just it obviously wouldn’t suit this film) Hill really pulled out all the stops for this role and I would of given him the Oscar.\r The simple story of Billy Beane and the trust he puts into Peter Brand (Jonah Hill) and their story of seeking out this baseball ‘outcasts’, and putting together an extraordinary team, is surprising rich and easy to grasp. Supported with a strong screenplay really adds to the intensity of the film.\r I really enjoyed the use of archive footage in the film which when put together with the shots of the actors worked really well, and gave the story that extra ump-ff to remind you that this is a true story and this actually happened. Also the attention to detail in this film was superb, the costumes were made to preciously resemble all of the uniforms of the baseball teams which the Oakland A’s took on during the  2002 baseball season.\r I thoroughly enjoyed the experience I felt by watching this film.\r In hindsight I will admit this is not a film which will grab you unless your in the mood for it, it’s not a film that will grab you by the throat and scream at you to enjoy it, it’s not Die Hard. It’s a beautifully crafted masterpiece which creates an emotional connection with you (if you’re in the right mood) and really sticks with you your feelings towards the characters after the film has finished.  This is definitely a film I would watch again and would recommend to anybody.",
            "review_date": "2013-08-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I found this slow movie to be very interesting. It's not a sports movie in the traditional sense, but the economics of it. Well done.",
            "review_date": "2018-07-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As a relative newcomer to the love of baseball  I was really looking forward to this film. It delivered plenty of runs and hits for two hours of error free baseball movie. I've heard it wasn't letter perfect to history but since I didn't knowAs a relative newcomer to the love of baseball  I was really looking forward to this film. It delivered plenty of runs and hits for two hours of error free baseball movie. I've heard it wasn't letter perfect to history but since I didn't know the story going in any discrepancies or liberties taken were lost on me. The tension was palpable just like a good pitchers dual.",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Moneyball\" is a good film. As MarcDoyle said it's not a great film, but it's emotionally involving. Aaron Sorkin does a great job of this. He uses his witty clever words he did in \"The Social Network\" and applies to Brad Pitt, in which\"Moneyball\" is a good film. As MarcDoyle said it's not a great film, but it's emotionally involving. Aaron Sorkin does a great job of this. He uses his witty clever words he did in \"The Social Network\" and applies to Brad Pitt, in which allowing him to stand up at his best as Billy Beane, the man who let the crappy Oaklands Athletics team into historical victory. As much as this is a sports movie, it's also a movie to think carefully about.",
            "review_date": "2012-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Simply put: The best baseball film ever made.  There are a few scenes in this film that only someone who has played the game for years could depict.  This film is realistic, yet very \"meta.\"  A fantastic film, and the best baseball film everSimply put: The best baseball film ever made.  There are a few scenes in this film that only someone who has played the game for years could depict.  This film is realistic, yet very \"meta.\"  A fantastic film, and the best baseball film ever made IMO.",
            "review_date": "2012-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretty blown away by this movie. It connects with it's audience on an intellectual and emotional level. It's a movie you need to keep digging into it's depths and in turn, the film will dug into you. Brad Pitt stars in his best role sincePretty blown away by this movie. It connects with it's audience on an intellectual and emotional level. It's a movie you need to keep digging into it's depths and in turn, the film will dug into you. Brad Pitt stars in his best role since Babel and should be considered for an Oscar.",
            "review_date": "2011-11-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Based on a true story, Moneyball is a movie for anybody who has ever dreamed of taking on the system. Brad Pitt stars as Billy Beane, the general manager of the Oakland A's and the guy who assembles the team, who has an epiphany: all ofBased on a true story, Moneyball is a movie for anybody who has ever dreamed of taking on the system. Brad Pitt stars as Billy Beane, the general manager of the Oakland A's and the guy who assembles the team, who has an epiphany: all of baseball's conventional wisdom is wrong. Forced to reinvent his team on a tight budget, Beane will have to outsmart the richer clubs. The onetime jock teams with Ivy League grad Peter Brand (Jonah Hill) in an unlikely partnership, recruiting bargain players that the scouts call flawed, but all of whom have an ability to get on base, score runs, and win games. It's more than baseball, it's a revolution - one that challenges old school traditions and puts Beane in the crosshairs of those who say he's tearing out the heart and soul of the game.",
            "review_date": "2012-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "THIS IS THE **** Movie EEEEEEEVVVVVVVVVVVVEEEEEEEEERRRRRRRRRR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2011-11-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Jonah Hill and Brad Pitt hit a home run with their performances in Moneyball, a great baseball story with heart. Moneyball is about the troubled life of Billy Beane, the coach of the Oakland A's. heartwarming and thoughtful, Moneyball is theJonah Hill and Brad Pitt hit a home run with their performances in Moneyball, a great baseball story with heart. Moneyball is about the troubled life of Billy Beane, the coach of the Oakland A's. heartwarming and thoughtful, Moneyball is the baseball film of the decade. Oscar or Not? Oscar: Best Picture, Best Actor, Best Supporting Actor, Best Adapted Screenplay",
            "review_date": "2011-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I enjoyed most of this movie.It was so realistic about the business of baseball. The flashbacks did lend another dimension and enhanced the root of the story. But,  and a big but, the movie was 12 minutes too long. It was a drag at the endI enjoyed most of this movie.It was so realistic about the business of baseball. The flashbacks did lend another dimension and enhanced the root of the story. But,  and a big but, the movie was 12 minutes too long. It was a drag at the end and did nothing but bore the audience. I have been to terrific movies where at the end the  audience claps and cheers even though there is no one to receive the applause. The audience was ready to do the same with this one but by the time it ended they had, had it and just left. Too bad, great beginning and a good ending but the add on at the end including the whole song,again, by his daughter.. not good and the scene at Ebbets field was totally unnecessary",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Disclaimers first: could care less about baseball and haven't read the book; but I went with a huge baseball fan, huge A's fan and read the book.  So, it was ok movie, enjoyed the phone trading scenes, which I'm told was introduced by thisDisclaimers first: could care less about baseball and haven't read the book; but I went with a huge baseball fan, huge A's fan and read the book.  So, it was ok movie, enjoyed the phone trading scenes, which I'm told was introduced by this guy. Told it was a good reproduction of the book, so give the screenplay thumbs up.  But overall, it was slow, slow, slow and way too long, far too many shots, long and short, devoted to Pitt's SERIOUS CONTEMPLATION. Ya, got it the first two times.  So, if you like baseball or read the book, go see it. But otherwise, spend your money some other way.",
            "review_date": "2011-10-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nLast night I went to Moneyball. I have heard and seen nothing but positive reviews from those who have seen it thus far. It was okay but curiously, for effect no doubt, devoid of any passion or emotion except when Brad threw things around the clubhouse or at home. Everyone spoke very mannerly and low key, very consciously, except for the coach Billy Beane fired who showed a little genuine passion. Perhaps the fact that all was connected to objective, detached statistics on baseball players they decided to play the movie that way, devoid of passion. Personally, I had more passion in teaching one class than was evident in that whole movie. However, having said that, it was an okay rendering of the information on using stats like on-base percentage to determine a players inherent worth to a team. Still, it is very over-rated!",
            "review_date": "2011-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "To this day I have never gone to a movie and become so bored that I fall asleep. Moneyball changed that. For the first quarter of the movie I really enjoyed it but then it just dragged on and got really boring. Some laughs, a good cast, aTo this day I have never gone to a movie and become so bored that I fall asleep. Moneyball changed that. For the first quarter of the movie I really enjoyed it but then it just dragged on and got really boring. Some laughs, a good cast, a good story but no entertainment value sadly makes this one of the worst movies I've ever seen.",
            "review_date": "2011-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this' a boring movie ever! the movie was too long for nothing.this movie almost caused me to fall asleep, they used 50 million dollar for nothing, this' the most worst and terrible movie that i've ever seen in my life.",
            "review_date": "2011-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIt's the pitching, stupid. If your team has an ace on the staff, then half the battle is already won. Some pop in the bat doesn't hurt either. The Bears, a motley group of little-league castoffs whom no other team in their division would ever pick, only start to win after their beer-guzzling manager Morris Buttermaker recruits Amanda Wurlitzer, a gender-breaking pitcher with a dominant curve(she's pre-Chelsea Baker, the knuckleball phenom) that the ex-professional ballplayer had decided two years ago was all washed-up as a daughter. On-base percentage doesn't win you games, it's the sound of the ball hitting the catcher's mitt, and the umpire calling the batter out on strikes, swinging or otherwise. In contrast to their former starter Rudi Stein, Amanda is Peppermint Patty to his Charlie Brown; she's unhittable; she keeps her clothes on, but the Bears still lose 1-0, because Lupus, f*****' Lupus, that \"booger-eating moron,\" can't hit the cut-off man from left-field, and lets the game-winning run score. It's not all his fault, though. The Bears can't hit. Never mind the homerun, three games into the season, and the team is still searching for their first baserunner. Coach Buttermaker sees his team's offensive deficiencies, and practically invents Moneyball. So embarrassed was Ahmad by his opening game errors to the Yankees that he hid out in a tree(after a half-inning forfeit), still can't get on base, but the coach knows that the black kid is fast, so the drunkard promises to teach him how to bunt. Ahmad's hero should be Malcolm X, not Hank Aaron, because sabermetrics preaches the theory of \"by any means necessary\". In \"Moneyball\", you half-expect to hear a reprise of Bizet's \"Carmen\", when Oakland A's free-agent pickup Scott Hatteberg, previously the catcher for the Boston Red Sox(damaged goods due to a bum shoulder), makes error upon error, as if the converted first baseman was in communion with Toby Whitewood. To manager Art Howe, he's bad news. But GM Billy Beane, acting on advice from his assistant Peter Brand, a sabermetrics guru, thinks Hatteberg can still play the game. Despite not having Ahmad's wheels, Beane's pet project has the ability to get on base. Hatteberg walks. It's a talent which makes him proportionately more valuable than Mariners' leadoff hitter Ichiro Suzuki, because despite his annual 200 hits, the ten-time all-star swings at a lot of first pitches, resulting in a relatively low on-base percentage, the stat that trumps batting average as the real barometer of worth to the new school, founded by Brand's hero Bill James. Hatteberg, therefore, is worth the trouble, so like Buttermaker teaching Tanner the fundamentals of shortstop, it's Ron Washington's job to make people forget about Giambi by turning the ruined catcher into a functional first baseman. (Washington had his own demon: cocaine.) History shows that Beane's gambit paid off(Hatteberg batted .280, and had a fielding percentage of .994), but it's somewhat misleading and downright downright dishonest, narrative-wise, that \"Moneyball\" should cast this role player as the lynchpin to this financially-strapped team's miracle on the field(the A's sported a payroll three times less than the Yankees: $41M to $126M). Contrary to the sabermetrics propaganda of the film, the 2002 Oakland A's did not win a MLB-high 103 games because Beane traded Carlos Pena to Detroit, which, in effect, forced Howe's hand into playing Hatteberg. It was the pitching, stupid. Oakland had three Amandas: Tim Hudson, Barry Zito, and Mark Mulder. Heck, even the last man in the rotation, Cory Lidle, was more relevant than the pitchers \"Moneyball\" makes mention of: Chad Bradford, a submarine middle reliever, and late-season addition Ricardo Rincon, whose acquisition from the Indians inspires such elation in Brand, you would think that Hudson just threw another shutout. Unlike \"The Bad News Bears\", where the Bears face the Yankees, the A's never did get the chance to square off with the fat cats, losing somewhat ignominiously in the ALDS to the Twins(payroll $40M), who are, perhaps, every bit the underdog that Beane's team was, in five games. The real climax to \"Moneyball\", judging by the postscript, occurs in \"Fever Pitch\", when Jimmy Fallon and Drew Barrymore run onto the field in Yankee Stadium after the Sox clinch the pennant(en route to their World Series win over the Cards), since the film gives Beane's methods all the credit. Does Moneyball work? Well, in the 1976 Michael Ritchie film, while the walks and hit batters keep the Bears alive in that final game with the Yanks, it's Kelly Leak's moonshot that nearly wins it all for the overachievers. Some pop in the bat doesn't hurt. Exhibit A: Miguel Tejada, with his 34 HRs and 131 RBIs. Lucky for the A's, he just swung away, walking only 38 times in 162 games. Then again, Leak doesn't accept the free pass and ends up getting thrown out at home plate.",
            "review_date": "2011-12-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nice drama about a troubled GM Billy Beane who did not make it as a number one draft choice of the NY Mets.  But he went onto have a very nice career as a GM for the Oakland A's having to play with the big boys {big market clubs} working withNice drama about a troubled GM Billy Beane who did not make it as a number one draft choice of the NY Mets.  But he went onto have a very nice career as a GM for the Oakland A's having to play with the big boys {big market clubs} working with about 20% of their capital.  He had a chance to become GM of the Red Sox and turned it down to stay with the A's.  All it proves is that he likes to beat his head against the wall because longterm he can never win.  I would have liked to see more character development because he is in a no win situation.  No questioning his passion for the job but the truth is baseball without a hardcap is a flawed product in which 99% of the times only the big markets can win!  Nice acting but otherwise the movie is going nowhere.  It is never explained why he is such a troubled soul?  I would have loved to see his life unfold.  What is the definition of insanity?  To do the same thing over and over and to expect a different result.  Billy can find talent but has no chance of ever keeping it the way the current state of affairs is managed under Bud Selig.  I live in NYC but feel the small markets have been shut out of competing.  How can you continually root for IBM but that is what Yankee fans do every year as they must buy every new toy on the free agent market.  Very sad commentary on true sportsman who love the game on a level playing field.  If Billy had the same tools to work with he is one of the best in the business.  No one doubts that!  Just another movie going nowhere.",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brad Pitt stars as Billy Beane, General Manager for the Oakland A's, who was the first to adopt statistical analysis in assembling a baseball team. Against everybody's suggestion he persists on this path and you can guess the results (or youBrad Pitt stars as Billy Beane, General Manager for the Oakland A's, who was the first to adopt statistical analysis in assembling a baseball team. Against everybody's suggestion he persists on this path and you can guess the results (or you may know, since this is based on fact). This is pretty much Pitt's movie: He produced it and is in almost every scene. He's engaging enough, but it's Jonah Hill's subdued comic partnership that adds some warmth. Otherwise, it's a non-stop, one-note drive for a man to achieve his vision. While there are a few sports scenes, most of this features people sitting around talking. While it's interesting to watch the narrative unfold, it's never moving or exciting, just flatly informational.",
            "review_date": "2011-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yet another sports film, but at least it isn't about boxing like the last few.  The story is simple, manager Billy Beane of the Oakland Athletics decides to put together a team of supposed misfits using statistical analysis instead of theYet another sports film, but at least it isn't about boxing like the last few.  The story is simple, manager Billy Beane of the Oakland Athletics decides to put together a team of supposed misfits using statistical analysis instead of the usual methods because their small market team can't afford the expensive players.  There is a side story showing him with his daughter that adds absolutely nothing to the movie at all - I guess it was put in there to try and get women to see the movie.  It is well written and acted throughout, although there are slow moments.  I have to say, however, I was really happy at the ending.  For most sports movies there is a team or person who is considered the underdog and they come back and win it at the end.  That did not happen here (not a spoiler since the story is based on a real happening and the Oakland Athletics did not win that year).  Overall a decent day at the movies but won't be a blu-ray purchase for me later.",
            "review_date": "2011-09-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not a bad movie but not unique either.  I was hoping Moneyball would tackle the obvious problem that baseball is absurd with no spending cap.  Instead it was a pretty basic story about a ball club who builds an unlikely team using statistics.Not a bad movie but not unique either.  I was hoping Moneyball would tackle the obvious problem that baseball is absurd with no spending cap.  Instead it was a pretty basic story about a ball club who builds an unlikely team using statistics.  Low intensity type of story with been-there-seen-that characters. Pretty white bread, toast-no-jam kind of story. The irony is that the ending praises the Red Sox for winning with Beane's system when actually the year the Sox won the series they had the SECOND HIGHEST PAYROLL IN THE LEAGUE so you can forget all that b.s. Nice try.",
            "review_date": "2011-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Equipped with a deftly slick script, deluges of heart and tenderness in the most latent instances of banalities, ballasted by a winsomely charismatic Pitt, is 2011's \"Moneyball;\" the biopic sports drama that keeps the jargon and economic talkEquipped with a deftly slick script, deluges of heart and tenderness in the most latent instances of banalities, ballasted by a winsomely charismatic Pitt, is 2011's \"Moneyball;\" the biopic sports drama that keeps the jargon and economic talk terse, and brings human nature to the forefront. What emerges, is a film about life, laden with its struggles, challenges, losses, and triumphants, with baseball, inconsequentially as its backdrop. For the ardent sports enthusiast, much of the \"art\" of the game is captured, however, it is presented in a manner that is near the fringes of condescension and whose suspension of disbelief and disregard can become offensive to witness. Moreover, the story (albeit \"true\") is deliberately told in fallacy in order to dramatize the truth (can't forget it's Hollywood). This is specifically true in the ball club's roster, of which wasn't as aggregated with misfits as the film suggests. Nevertheless, \"Moneyball\" is a tale that is told with passion, diligence, and finesse, (Zaillian and Sorkin) thanks largely in part to Pitt's amiable character and delivery. While the errors in the film will be hardly noticeable to most, it is certain that the film will leave many thoroughly entertained and ready to dust off the old mitt and get the shoulders warm for throwing. It's bound to earn one's admiration far past the seventh-inning stretch; no stops to concessions for this one.",
            "review_date": "2012-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really tried liking Moneyball, but in the end I couldn't succumb to this. I'm obviously in the minority who didn't enjoy this film that much, but I can admit it was a well meaning film and Pitt gives a decent performance. Despite whatI really tried liking Moneyball, but in the end I couldn't succumb to this. I'm obviously in the minority who didn't enjoy this film that much, but I can admit it was a well meaning film and Pitt gives a decent performance. Despite what people may say, the movie does go into detail with baseball and its statistics. Its easy to assume that a sheer lack of interest in baseball contributed to one's dislike for Moneyball, but that's not the case, it goes a little deeper than that. The story seemed a bit formulaic and the movie was quite longer than it needed to be. It had some sharp dialogue work, but the movie on a whole didn't 'wow' me in any way.",
            "review_date": "2012-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film is hard to describe. I think the best word is \"great\". It's not as good as Aaron Sorkin's last writing achievement, \"The Social Network\", but it still is a hilarious and shocking screenplay. Brad Pitt basically carries the film, withThe film is hard to describe. I think the best word is \"great\". It's not as good as Aaron Sorkin's last writing achievement, \"The Social Network\", but it still is a hilarious and shocking screenplay. Brad Pitt basically carries the film, with his wingman being Jonah Hill. The other cast members provide chuckles, and it's basically a great film from the writer of \"Social Network\" and the original writer of \"The Blind Side\". Oh, and for Brad-Pitt-Action-Star fans, he does throw chairs around.",
            "review_date": "2011-11-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI really enjoyed the movie and Brad Pitt is excellent.  The problem I have with the movie is I have the disadvantage of actually knowing something about the 2002 Oakland A's.  The film is dishonest because it willfully overstates the impact of a few baseball scrubs and completely ignores the great players the A's already had.  Not only that it willfully misrepresents the fact that Jeremy Giambi (Jason Giambi's brother) played in 124 games for the A's the year before in 2001!  He wasn't a new discovery.  How could the filmmaker not even mention that the A's had one of the best pitching staffs in baseball in 2001 and they were back for 2002:  Barry Zito won 23 games in 2001 and won the Cy Young Award as the league's best pitcher, Mark Mulder won 19 games, Tim Hudson won 15 games.  They are literally never mentioned in the film!  Miguel Tejada is barely mentioned and he was the League MVP batting over .300 with 34 home runs and 131 runs batted in.  Eric Chavez is never mentioned and he hit 34 homers and drove in 109 runs.  David Justice, meanwhile, was kind of a wash out and Scott Hatteberg was important to the team--but, certainly there was already a key group of players in place.  Also, the concept of on base percentage was not new...and the previous A's general manager Sandy Alderson was instrumental in using statistical analysis before Billy Beane arrived.  And, Johnny Damon had had a terrible 2001 season, so letting him go was not without reason anyway.   Also, the Minnesota Twins, who beat the A's in the playoffs, had virtually an identical small payroll and continued to be a more competitive team than the A's over the next decade.  So, my main problem with the film is not to say that the \"moneyball\" approach didn't do anything for the A's--it did.  But, it didn't do everything and they were not alone in using statistical analysis to discover value.  But, that's Hollywood--overstating and making things black and white is their specialty.   Brad Pitt is really getting to be a much better actor as he ages though--he's excellent in the movie.",
            "review_date": "2011-10-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know little to nothing about baseball and was deeply moved by this film. This movie is, for me, about failure.How to embrace the success that can come from lessons learned through failure?\n\nBrad Pitt is on a roll of fine, strongI know little to nothing about baseball and was deeply moved by this film. This movie is, for me, about failure.How to embrace the success that can come from lessons learned through failure?Brad Pitt is on a roll of fine, strong performances and fills the space of Paul Newman and Robert Redford.",
            "review_date": "2011-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I absolutely loved this movie, as a fan of baseball, I can appreciate this movie. I get the point of this movie when mos people don't. You have to like baseball though. The feel of the movie had it down pact. The actors did their part so wellI absolutely loved this movie, as a fan of baseball, I can appreciate this movie. I get the point of this movie when mos people don't. You have to like baseball though. The feel of the movie had it down pact. The actors did their part so well that you could tell the distress and the sense of urgency that they needed when the going got rough. Brad Pitt continues to impress with perfect emotion, as well as Jonah Hill making good work of his supporting actor role.",
            "review_date": "2011-11-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I would have never imagined a movie whose focus is the dialogue would be so great.  Writers and screenplay directors here are geniuses. Pacing is great,  ending is great!",
            "review_date": "2011-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "WOW> I dont understand the critics and their mentality. I went for this movie after reading all the positive review. This was was fuc***ing boring. It was so slow and that I actually slept during the movie for about 5 - 10 minutes. ThisWOW> I dont understand the critics and their mentality. I went for this movie after reading all the positive review. This was was fuc***ing boring. It was so slow and that I actually slept during the movie for about 5 - 10 minutes. This happened to me for the first time ever. I am sure that this movie will win the oscar. After all oscars are meant for such boring movies. eg - Kings speech over the social network or Inception, Hurt locker over Avatar, Slumdog millionaire, etc...",
            "review_date": "2011-11-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brad Pitt and Jonah Hill fuel this incredibly acted, fun, feel-good baseball movie. Brad Pitt definitly deserves at least an Oscar nomination for his strong performance.",
            "review_date": "2011-11-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie could have ended on a more subtle note, but this is one of the very best films of the year. brad pitt (with The Tree of Life) proved to be THE actor of the year. The editing is PERFECT and ofcourse a screenplay with Steve ZaillanThe movie could have ended on a more subtle note, but this is one of the very best films of the year. brad pitt (with The Tree of Life) proved to be THE actor of the year. The editing is PERFECT and ofcourse a screenplay with Steve Zaillan and Aaron Sorkin as the writers will be great. I hope Bennett Miller does not wait 6 years for his next film! This is how mainstream Hollywood produced films should ALWAYS be, it is said we live in a time where this is considered a masterpiece.(But it really is great though)",
            "review_date": "2012-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent and capital movie. The movie is about baseball but also about the right and fair evaluation of performance and individuals. This means looking at FACTS as best as you can. This is valid for sports, your job, you car insurance, yourExcellent and capital movie. The movie is about baseball but also about the right and fair evaluation of performance and individuals. This means looking at FACTS as best as you can. This is valid for sports, your job, you car insurance, your mortgage, etc...A movie those rating agency, presidential candidates, stock traders who only act on rumours should obviously watch. A must see movie for the credit crunch generation.",
            "review_date": "2012-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "do not know what to write about it. It's pretty much a baseball movie .So when you are watching this movie , you should know a bit about baseball, which I don't know ,so i did not enjoyed it a lot. Only positive thing in here is--brad pitt.",
            "review_date": "2016-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "major league version of 'Social Network', and also, ending scene might be remembered as one of the best.",
            "review_date": "2018-02-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Really enjoyed this movie. It was a sports movie, but not your typical formula. I thought it had a ton of references that only a hardcore baseball fan would understand, but saw the movie with someone who knows nothing about baseball and theyReally enjoyed this movie. It was a sports movie, but not your typical formula. I thought it had a ton of references that only a hardcore baseball fan would understand, but saw the movie with someone who knows nothing about baseball and they still enjoyed it and got it. Really think Brad Pitt was perfect for this role. He's usually solid in everything, but this might be one of his best performances. Truly believed him as Billy Beane.",
            "review_date": "2011-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "David doesn't slay Goliath in Moneyball, a smart and entertaining film about the business of baseball, but he finds a way to compete in a game that has an incredibly uneven playing field.  Brad Pitt and Jonah Hill turn in excellentDavid doesn't slay Goliath in Moneyball, a smart and entertaining film about the business of baseball, but he finds a way to compete in a game that has an incredibly uneven playing field.  Brad Pitt and Jonah Hill turn in excellent performances in a film that serves as a stern reminder that there will always be small teams scraping to compete but that the big teams will always have the upper hand.  The fact that this seemingly dull concept results in a deeply engaging and surprising moving film is one of the minor miracles of 2011.",
            "review_date": "2012-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Simply put, the movie was not that good.  There was nothing new about this movie I have not seen before and the movie was slow for my taste.  Over-rated and not worth a purchase but maybe a rent.",
            "review_date": "2012-02-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I liked it, but honestly can't imagine it holding the interest of anyone who's not a big baseball fan. I have to attribute many of this film's accolades to a not-completely-rational adoration of Brad Pitt and Aaron Sorkin. (An Oscar nod forI liked it, but honestly can't imagine it holding the interest of anyone who's not a big baseball fan. I have to attribute many of this film's accolades to a not-completely-rational adoration of Brad Pitt and Aaron Sorkin. (An Oscar nod for Jonah Hill? Really?)",
            "review_date": "2012-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a well-done, well-cast picture.  Not about baseball per se but about the underside that we don't get to see.  Brad Pitt was perfect in and for the role of Billy.  Philip Seymour Hoffman again shows us why he the consummate actor.  OneWhat a well-done, well-cast picture.  Not about baseball per se but about the underside that we don't get to see.  Brad Pitt was perfect in and for the role of Billy.  Philip Seymour Hoffman again shows us why he the consummate actor.  One distraction.  I could not stop looking at a maturing Brad Pitt and seeing a younger Robert Redford.  WOW.  Facial expressions, cragginess at the eyes, mannerisms,  They need to do a picture as father-son.",
            "review_date": "2011-10-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good movie about something that is very real about baseball.  Professional baseball is different than any other sport, in the sense that some big market teams truly outspend the small market teams.  The movie does a nice job in makingVery good movie about something that is very real about baseball.  Professional baseball is different than any other sport, in the sense that some big market teams truly outspend the small market teams.  The movie does a nice job in making this point.  However, it grossly oversimplifies what Moneyball really is, it is not only looking at OBP (on base percentage), as the movie implies.  It is also a movie; it is not historically accurate in a number of ways.  But neither of those flaws detract from the movie being enjoyable.  Brad Pitt is fine playing a good looking ex-jock and Jonah Hill does a nice job playing a made up character (as the person who really was Beane's assistant refused to let his name be used, which led to Paul DePodesta's \"role\" being played as an overweight nerd).  Phillip Seymour-Hoffman is perfect as manager Art Howe, who the movie vilifies (as it also does to scouts).  Perhaps that dichotomy is the biggest weakness of an entertaining film:  creating tension by making the good guys really good and their enemies seemingly (and at the same time) stupid, vicious and mean.  But that's movies for you.  Still an enjoyable film that is worth seeing.",
            "review_date": "2011-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like the Social Network this movie is getting blown out of proportion. The Social Network was not a movie that defined the internet generation. It was simply a movie about the formation of facebook. But it was well made, funny, and exiting.Like the Social Network this movie is getting blown out of proportion. The Social Network was not a movie that defined the internet generation. It was simply a movie about the formation of facebook. But it was well made, funny, and exiting. Moneyball is not a film about corporate greed or human nature. Its a movie about baseball. Nothing more. It too is well made, funny, but unfortunately more dull than exciting. Like a midseason game this movie has moments of grace but ultimately the limits of its own game and the low stakes make the attention span drift at times.",
            "review_date": "2011-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Moneyball is a wonderful movie: Brad Pitt gets up from only the total level of acting. A movie to watch, even for someone like me, knows nothing (or almost) about baseball.",
            "review_date": "2012-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a solid movie and reminded me more of All the President's Men rather than The Natural, so the target sports audience are bound to be let down. Like Miller's \"Capote\" there's a detached coolness that works pretty well here, yet someIt's a solid movie and reminded me more of All the President's Men rather than The Natural, so the target sports audience are bound to be let down. Like Miller's \"Capote\" there's a detached coolness that works pretty well here, yet some scenes feel bizarely sedated.",
            "review_date": "2011-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Im not a fan of baseball but this film was great to watch.  the characters were compelling and the acting was solid.  Recommended esp for sporty quant jocks.",
            "review_date": "2011-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have never watched baseball, nor do I get what skillsets are required in a player or a team for that matter, so a film about putting a baseball team together leaves me at least indifferent.  The performances are good but not Oscar worthyI have never watched baseball, nor do I get what skillsets are required in a player or a team for that matter, so a film about putting a baseball team together leaves me at least indifferent.  The performances are good but not Oscar worthy and the direction is tight and for someone who appreciates the subject matter better than I do, this could really be something quite special.  But not for me.",
            "review_date": "2012-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unlike \"The Social Network\" where the subject matter of computer became secondary to the subject matter of human behavior, this film does not achieve that transformation. One just keeps thinking baseball and more baseball with the occasionalUnlike \"The Social Network\" where the subject matter of computer became secondary to the subject matter of human behavior, this film does not achieve that transformation. One just keeps thinking baseball and more baseball with the occasional glimpse of the human purpose behind it all. Pitt is an excellent actor but I could not help but think that the script was written to provide him a shot at an Oscar. There is nothing wrong with that but he dominates the film to the point of exhaustion. The film left me emotionless which I do not think was the intent. A noble effort but I don't think it worked in getting its message about life out.",
            "review_date": "2011-09-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quite a slow pace to this one gives the audience time to get to know the major players and figure out just what Beane and Brand are doing. To me, the fact they didn",
            "review_date": "2012-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie was entertaining and thought provoking.  Acting was great.  Screenplay was great.  Soundtrack was great.  I liked it.   What more can you ask for?",
            "review_date": "2012-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Moneyball is an instant classic in the sports movie genre and deserves its academy nomination for best picture. Brad Pitt seems like he was born to play Billy Beane and Jonah Hill surprisingly plays his more reserved part well.  The biggestMoneyball is an instant classic in the sports movie genre and deserves its academy nomination for best picture. Brad Pitt seems like he was born to play Billy Beane and Jonah Hill surprisingly plays his more reserved part well.  The biggest fault of the movie is the real story, which forced the climax to be less climatic than it could have been. You do not have to be a baseball fan to enjoy this movie.",
            "review_date": "2012-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All I can say is : wow. This is a genuinely good movie. I'm not much of a baseball fan, but I still liked it. If you're a sports fan (any sport), I'm pretty sure you will appreciate it as much as I did. I loved the fact that they brought upAll I can say is : wow. This is a genuinely good movie. I'm not much of a baseball fan, but I still liked it. If you're a sports fan (any sport), I'm pretty sure you will appreciate it as much as I did. I loved the fact that they brought up mathematics into baseball. That was cool to watch. '' Moneyball '' is one of the best movie that I've seen in a long time. We usually don't see a lot of '' drama '' sports movies. This is the one that we have been waiting for. It's got great acting (Jonah Hill proved that he could play in serious movies), amazing cinematography, good script and great music and ambiance. I'm glad that they showed situations between the general manager and the players about drafting and trading. There were also emotional parts, which was perfect. I just want to specified that the movie did one mistake. In one scene, Casey Beane (played by Kerris Dorsey) sang a song to her dad (Billy Beane, played by Brad Pitt). The song was called '' The show '', by Lenka. It was released in 2008, but in the movie, the story takes place in 2002. So it's impossible for the girl to sing it. Anyway, it's definitely gonna get nominated for an Oscar. It's a must see !",
            "review_date": "2011-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the kind of movie that makes you search Google immediately, a rather interesting script with a direction that you do two hours fascinating. Pitt right in his role.",
            "review_date": "2011-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Interesting baseball drama that's simply different than most sports movies that come out these days. Moneyball is more about the sport, and doesn't try to be as much of a heartfelt drama that some others try to be. It goes away from theInteresting baseball drama that's simply different than most sports movies that come out these days. Moneyball is more about the sport, and doesn't try to be as much of a heartfelt drama that some others try to be. It goes away from the formulas that been used on countless other sports movies over the past decade (such as The Blind Side, Remember the Titans, Invincible, etc.). However, it's not a perfect movie. It tends to drag on in come scenes that have you losing interest. Nobody really has a standout performance like some critics are saying, but nobody feels truly outcast. Overall, it's an enjoyable movie that won't let baseball fans down, but is accessible enough for people unfamiliar with the game.",
            "review_date": "2011-10-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I know absolutely nothing about baseball but Moneyball was an entertaining movie. Pitt and Hoffman are excellent and it's always a pleasure to see someone sticking it to the man. Moneyball is fun but unessential viewing.",
            "review_date": "2012-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really liked this movie.  Maybe should have given it a nine.  Not sure.  But it's got great acting, a smart script, and it's telling a fascinating story.  Not sure how this did in the box office, but it did well.  It deserved to.",
            "review_date": "2012-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Enjoyable, behind-the-scenes look (even if slightly over dramatized) of the inner workings of a GM. As a baseball purist, I wasn't offended and that's tough to do when Hollywood takes the reigns. Pitt carries it. Amazing what happens whenEnjoyable, behind-the-scenes look (even if slightly over dramatized) of the inner workings of a GM. As a baseball purist, I wasn't offended and that's tough to do when Hollywood takes the reigns. Pitt carries it. Amazing what happens when films focus on the character driving the plot and not vice versa.",
            "review_date": "2011-10-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Searching for a soul in the baseball community to some is like searching for steak at McDonalds.  This movie succeeds in intertwining a history lesson with the common man who just happens to be uncommon.  With its subtleties and non-flashySearching for a soul in the baseball community to some is like searching for steak at McDonalds.  This movie succeeds in intertwining a history lesson with the common man who just happens to be uncommon.  With its subtleties and non-flashy performances, \"Moneyball\" is able to let shine what truly is important to itself -- telling the honest story of one man who shattered the stereotypes of Major League Baseball.",
            "review_date": "2012-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Written by Steven Zaillian and Aaron Sorkin, it's not The Girl With The Dragon Tattoo or The Social Network. But director Bennett Miller along with Brad Pitt take a serious subject with beautiful shot turn it into touching potrait of baseballWritten by Steven Zaillian and Aaron Sorkin, it's not The Girl With The Dragon Tattoo or The Social Network. But director Bennett Miller along with Brad Pitt take a serious subject with beautiful shot turn it into touching potrait of baseball lore. Damn! I couldn't stop singing Lenka's song now.",
            "review_date": "2012-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Moneyball\" is excellent in that it has the excitement of sports but also explores fascinating dilemmas in life regarding failure and success, confronting the powers-that-be in an industry, and the excitement of a creative approach to\"Moneyball\" is excellent in that it has the excitement of sports but also explores fascinating dilemmas in life regarding failure and success, confronting the powers-that-be in an industry, and the excitement of a creative approach to achieving something seemingly impossible.  It is witty, feels truthful, and well done in all departments.  The cast is great.  And for those of us who find math useful and exciting, well, itâ",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Baseball is the sport to follow if you love numbers.  Almost every aspect of the game can be and is quantified by a percentage which both ball clubs and fans use to rank players.  The science of ranking players using particular categories,Baseball is the sport to follow if you love numbers.  Almost every aspect of the game can be and is quantified by a percentage which both ball clubs and fans use to rank players.  The science of ranking players using particular categories, specifically on base percentage, is the foundation for an analysis program known as sabermetrics.  Moneyball never uses this term, but that is what they are talking about.  Moneyball tells the story of the Oakland Athleticsâ",
            "review_date": "2011-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's obvious Aaron Sorkin had influence on this film, and his writing, Pitt and Hill's performances make Moneyball entertaining. I loved it coming out of the theatre, but days later I now don't like it as much, the story was uneven,It's obvious Aaron Sorkin had influence on this film, and his writing, Pitt and Hill's performances make Moneyball entertaining. I loved it coming out of the theatre, but days later I now don't like it as much, the story was uneven, especially in the end. The buzz about Jonah Hill is true; he may deserve an Oscar nomination, but Seymour Hoffman gives another exuberant performance. Worth seeing, but probably not on the big screen.",
            "review_date": "2011-10-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Having lost to the New York Yankees in the 2001 American League Division Series, and with the impending departure of several star players Johnny, Oakland Athletic’s general manager Billy Beane needs to assemble a competitive team for 2002Having lost to the New York Yankees in the 2001 American League Division Series, and with the impending departure of several star players Johnny, Oakland Athletic’s general manager Billy Beane needs to assemble a competitive team for 2002 with Oakland's limited budget. Following a chance meeting with Peter Brand, a young Yale economics graduate, Beane adopts a sabermetrics approach selecting players based on their on-base percentage rather than the usual scouting methods.Although it is based on a true story Moneyball certainly takes a few ‘Hollywood’ liberties with the source material, much to the annoyance of some of those involved in the real life events apparently! Largely thanks to Brad Pitt’s on screen charm however, this still makes for an entertaining enough movie even for those of us with limited knowledge of baseball.",
            "review_date": "2020-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A+ for the message.A+ for a great underdog story.A+ for the cast.\nA for cinematography.\nA for the A's (da duh bump)\nB for airport scene.\n\nI am not a sports person, but I must say that I love sports movies.  Moneyball is no exception.  WhileA+ for the message.A+ for a great underdog story.A+ for the cast.A for cinematography.A for the A's (da duh bump)B for airport scene.I am not a sports person, but I must say that I love sports movies.  Moneyball is no exception.  While it didn't have that extreme wow factor, it was still very inspiring, especially being a true story.  I am a fan of history and learning about things; it was nice to learn more about the Oakland A's.What a spectacular message this movie delivers.  There are a lot of nay sayers in life.  It is important to be flexible, but generally we as people are creatures of habit.  We say we embrace change but we don't really mean it.  You really have to put your mind to it to genuinely be open to change.  We see that true and true in the characters that Brad Pitt and Jonah Hill play.  And, as we learn in movies like Blindside and Pursuit of Happyness, don't ever give up, don't ever let anyone tell you that you can't.I love the plot.  The dichotomy between flashbacks and present time.  And family struggles, like Brad's character being divorced but still wearing his wedding ring.  And having to talk to his wife's husband.  And trying to raise his 12 year old daughter.The only thing that I can think of that this movie needed to improve on is the airport scene, which, mind you, is very very very minor.  Just that this occurred in late 2001 and 2002 and beyond, which is post 9/11.  Meaning that you wouldn't be able to greet or say goodbye to your loved ones right at the plane gate.  What with the advent of the TSA.I am delighted that this movie introduced me to Mrs. Lenka Kripac.  And her lovely song The Show, which I can definitely relate to at this time in my life.  I think it is very cool that she is half Australian and Czech.  And she shares the same birthday as a friend of mine.I do not like Brad, but I respect his success and I enjoyed him in this movie.  I love Jonah - he is a big reason why I saw this movie in the first place.  Cool to see the following people: Robin Wright (Beowulf, Unbreakable, Princess Bride), Reed Diamond (Journeyman, 24, Dollhouse), Philip Seymour Hoffman (Mission Impossible 3), Glenn Morshower (24, Transformers, Xman).http://iplaythecomputerkeyboard.blogspot.com/",
            "review_date": "2012-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A film about the link between sport and mathematics really shouldn't be this entertaining. Through a combination of great acting, a clever script and sheer energy, Moneyball is certainly up there with the top sports movies. It questions theA film about the link between sport and mathematics really shouldn't be this entertaining. Through a combination of great acting, a clever script and sheer energy, Moneyball is certainly up there with the top sports movies. It questions the very foundations of, and morality behind big-money US sports, and how shallow and mercenary they have become over the years. Brad Pitt is simply spellbinding as the ambitious but troubled and volatile baseball team manager Billy Beane, and Jonah Hill leaves his Superbad days long behind him with a mature and effortlessly natural performance as Peter Brand, an economics graduate who impresses Beane with his knowledge of baseball statistics and is hired to be the brains behind the Oakland Athletics. As the most memorable sport films tend to be, Moneyball is a good old-fashioned underdog story based on a series of truly remarkable real events. The only thing I question about the film is the need to fall back on tried and tested sports movie cliches for the finale - slow-motion, muffled sound, you name it it's in there, and it somewhat undermines the whole show. Some aspects of the film's plot can also be difficult to follow if you're unfamiliar with baseball, but it would be unfair to mark a film down harshly for a lack of viewer knowledge. These are very minor gripes in the grand scheme of things, and Moneyball is still a compelling viewing experience, and for the most part, a refreshingly different take on a sports movie.",
            "review_date": "2012-08-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Finally a heartwarming and inspiring sports film NOT entirely focused on the team, and not about a championship run or world series i should say.  Im not too familiar on the story though, im more of a basketball fan but i enjoy baseball allFinally a heartwarming and inspiring sports film NOT entirely focused on the team, and not about a championship run or world series i should say.  Im not too familiar on the story though, im more of a basketball fan but i enjoy baseball all the same. But this movie was damn good, knowing the story or not. It was filled with witty dialogue, emotion, and an amazing writing job which was expected considering it was written by aaron sorkin (the social network) and the writer of the schindlers list. This movie overall was just plain great. Its amazing how good of a movie they made out of such a flat subject. Moneyball is a movie for the ages, definitely my pick for best movie of 2011. Brad Pitt was hilarious, and he did a award deserving performance in showing us who Billy Beane truly is, a great guy whose struggled through some big hardships, just trying to win some baseball games the right way. Whether you have a major love for the game of baseball or if you absolutely hate it, you will love this movie. Its not focusing on the game of baseball specifically, its focusing mostly on Billy Beanes story which is inspiring, and also about the tough world of business. Brad Pitt will definitely be nominated for an academy award, either for this or the tree of life, and Moneyball is more than deserving of a best picture nomination and potentially a win. Go see this movie now, youll love it, and youll learn to love and earn much respect for Billy Beane. A film for the ages, 10/10 definitely.",
            "review_date": "2011-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Baseball economics has long a source of serious debate amongst fans, players, and teams. The contentious issues of how to divide the revenue in an equitable manner led to the cancellation of the playoffs and World Series in 1994 and is stillBaseball economics has long a source of serious debate amongst fans, players, and teams. The contentious issues of how to divide the revenue in an equitable manner led to the cancellation of the playoffs and World Series in 1994 and is still largely unresolved today. While smaller market teams are given funds from a luxury tax imposed on larger payroll teams, it still fails to provide an even competitive playing field when large market teams, such as the New York Yankees, can field teams with a $225 million-plus payroll while the smaller market teams have to make do with budgets often under $40 million. Naturally, this has put many teams at a competitive disadvantage and most feel that they have no chance to win long-term, even as they develop cheap homegrown talent in their minor-league systems. They lose said talent to the larger market clubs once players become eligible for free agency. It is against this backdrop that the new film â",
            "review_date": "2011-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For once, the movie is better than the book. Much, much better! Brad Pitt (I'm not one of his fans) gives a performance worthy of an Oscar nomination. His portrayal of Billy Beane, the now famous General Manager of the Oakland A's gives lifeFor once, the movie is better than the book. Much, much better! Brad Pitt (I'm not one of his fans) gives a performance worthy of an Oscar nomination. His portrayal of Billy Beane, the now famous General Manager of the Oakland A's gives life to a character than I found to be rather flat in the book of the same title. The supporting actors (except for Jonah Hill) are excellent and surprisingly the best of the bunch is Phillip Seymour Hoffman playing manager Art Howe.The divorced father-daughter relationship is played just right and I thought the \"flashbacks\" to Beane's youth and professional playing days were well done. More importantly, live action scenes were blended seamlessly with archive footage of actual events during the 2001 and 2002 baseball seasons. I'd rank this film in my top ten sports movies and in a flat footed tie with \"The Natural\" as my all time favorite baseball movie.",
            "review_date": "2011-10-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nMovies are generally unexciting when the watcher knows the ending, not to mention most of the movie's major events.  Moneyball manages to surpass that and turns itself into the rarest kind of drama: a true story that manages to drum up more tension, suspense, emotion, and power than one can get from pure fiction.  The pacing is perfect, the plot incredible dramatic for a true story, and though it's a story of statistics and sabermetrics, Moneyball is incredibly passionate about the game at its core.  Brat Pitt is excellent as Billy Beane, giving at times a beautifully reserved and nuanced performance while at others blasting out raw emotion by throwing chairs, desks, and Gatorade coolers across a room.  And Jonah Hill, a name mostly unheard outside of comedies, showed his dramatic abilities while still managing to expertly pull out laughs whenever he could.  And the final ten minutes of the film, after the climax had passed, the action had ended, and the Athletics had lost, are probably some of the most underscored yet emotionally forceful moments of the film.  I don't go to the theater much anymore; the prices are just too high.  I only really go when I'm sure what I'm about to see is worth the money.  And Moneyball did not disappoint.",
            "review_date": "2011-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Incredibly well-written script. Another good performance by Brad Pitt and good supporting efforts by Jonah Hill and Philip Seymour Hoffman. I think that the length was perfect and the resolution was satisfying. Deserves the nomination. (A)",
            "review_date": "2012-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Undoubtedly an amazing film . I am not a fan of Sports-Drama film but Moneyball was just so freaking awesome . With a amazing script Bennett Miller showed exactly what I wanted to see . Brads acting was absolutely amazing . He did so good .Undoubtedly an amazing film . I am not a fan of Sports-Drama film but Moneyball was just so freaking awesome . With a amazing script Bennett Miller showed exactly what I wanted to see . Brads acting was absolutely amazing . He did so good . Jonah Hill was good too and It really was his best .  Everything in this movie tells that Therese so many ways to do things right .  Even if u had to piss everyone else at the first time U should do thing right . Bennett Miller show once again that no matter how silent the movie is if u make it right then its gold !",
            "review_date": "2012-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Read my full review at: http://themuddoctor.blogspot.com/2011/11/moneyball.htmlBennett Millerâ",
            "review_date": "2011-11-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie is well made and has just the right amount of baseball, for those who don't want a 'baseball' flick.  The story is well-adapted and benefits from the constraints of a real-life situation, hence the lack of hollywood ending (which IThe movie is well made and has just the right amount of baseball, for those who don't want a 'baseball' flick.  The story is well-adapted and benefits from the constraints of a real-life situation, hence the lack of hollywood ending (which I appreciated.)  However, I think that Brad Pitt wasn't the best choice for the lead role.  He isn't bad per se, but is a bit too much like the Brad we see in other movies.  I left the theatre thinking that the pace and content of this show made it more like a TV movie, if that makes sense to anyone.  It just lacked that 'wow' factor on some level.  In spite of all this, the movie makes you feel good and for that reason I'd recommend it to most.",
            "review_date": "2011-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Despite my initial expectations for Moneyball, it, in the end, emerges as a triumphant and engaging film. This film has been getting Oscar buzz for the last couple of months because it is Aaron Sorkinâ",
            "review_date": "2011-10-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "See-it - Brad Pitt stars as Billy Beane, the general manager of the Oakland A's, in not only one of the best sports movies ever made, but also one of the best films of the year. Don't miss this smart, funny, well-written and well-acted filmSee-it - Brad Pitt stars as Billy Beane, the general manager of the Oakland A's, in not only one of the best sports movies ever made, but also one of the best films of the year. Don't miss this smart, funny, well-written and well-acted film just because it's about baseball -- because the Academy sure won't.",
            "review_date": "2011-10-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Enjoyable and well made, but too long.  I'm not sure why slow, boring, and expansive pauses have become the norm with today's filmmakers, but they are prevalent throughout the movie.  I just kept wanting to snap my fingers repeatedly to tellEnjoyable and well made, but too long.  I'm not sure why slow, boring, and expansive pauses have become the norm with today's filmmakers, but they are prevalent throughout the movie.  I just kept wanting to snap my fingers repeatedly to tell them to \"pick up the pace!\"  I didn't want action or thrills, but I was hoping to avoid boredom.  In many ways, this film was similar to watching a pitchers duel.  It was interesting and at times exciting, but you ultimately start to drift and lose interest by the end of the 5th inning.  Decent performance by a strong cast, especially Pitt and Hoffman.",
            "review_date": "2011-10-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An intellectual baseball movie!  Neat look into interaction between GM, manager, players, and to a limited extent ownership.  Baseball action kept to a reasonable minimum, and the actor-players were excellent, as well as the top of the cast.An intellectual baseball movie!  Neat look into interaction between GM, manager, players, and to a limited extent ownership.  Baseball action kept to a reasonable minimum, and the actor-players were excellent, as well as the top of the cast.  Ending was a bit unsatisfying, but stayed true to fact.  Look for two acting nominations at the top of the cast, Jonah Hill was the highlight of the film.",
            "review_date": "2011-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Maybe it's my lack of knowledge about baseball history but I don't think so. I was bored. Brad Pitt was fairly engaging but the best part of the film was Jonah Hill. Its getting a 6 from me only in comparison to what else is out there at the moment.",
            "review_date": "2011-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a good movie.  Its interesting  - Brad is very convincing.   Of course, you know the method will work - otherwise there would be no movie but you still care about what happens and how.  The critics finally got it right. Great actingThis is a good movie.  Its interesting  - Brad is very convincing.   Of course, you know the method will work - otherwise there would be no movie but you still care about what happens and how.  The critics finally got it right. Great acting all round.",
            "review_date": "2011-09-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was a great depiction of the overall change in management that occurred during the turn of the millenium. I enjoy the interactions and friendship that emerged between the main GM (Pitt) and his assistant.",
            "review_date": "2011-09-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not a baseball fan in any way shape or form, but I read so many good reviews for this I thought I'd check it out.  Ladies, if you're thinking you'll see it for Brad Pitt but totally be bored by the baseball stuff, you're wrong.  They reallyNot a baseball fan in any way shape or form, but I read so many good reviews for this I thought I'd check it out.  Ladies, if you're thinking you'll see it for Brad Pitt but totally be bored by the baseball stuff, you're wrong.  They really made it interesting and I cared about all of the characters, not just Brad.  LOVED the guy from Parks and Rec, he's totally hot.",
            "review_date": "2011-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't like baseball. Repeat, I really don't like baseball, however I enjoyed this film. It manages to navigate, quite possibly, the most cliched genre and subject matter of all time in a unique and involving way. At times it stalls, but notI don't like baseball. Repeat, I really don't like baseball, however I enjoyed this film. It manages to navigate, quite possibly, the most cliched genre and subject matter of all time in a unique and involving way. At times it stalls, but not an amount even close to the actual favorite American pastime.",
            "review_date": "2011-10-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm not a sports fan, but baseball is probably the only sport where I know the rules. This film draws you in even if you think there is really no point in being so obsessed with where the ball lands. â",
            "review_date": "2012-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I didn't see any problems with this movie until the end. I simply dragged for far too long. I wanted it to end, so I could say I loved it, but it didn't. The ending was fantastic, so I suppose that was the payoff for the extra 30 minuetsI didn't see any problems with this movie until the end. I simply dragged for far too long. I wanted it to end, so I could say I loved it, but it didn't. The ending was fantastic, so I suppose that was the payoff for the extra 30 minuets Moneyball forced me to watch. I recommend it, but prepare to be bored.",
            "review_date": "2011-10-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Moneyball is a tale of a revolutionary system implemented in baseball in the early 2000's.  Without it the BoSox wouldn't of overcome the curse that has been bestowed upon them since the early 1900s.  Superstitious or not the fact is thatMoneyball is a tale of a revolutionary system implemented in baseball in the early 2000's.  Without it the BoSox wouldn't of overcome the curse that has been bestowed upon them since the early 1900s.  Superstitious or not the fact is that Sabermetrics the focus of this story and takes the limelight of the screen and Pitt and Hill take to the mound and toss a gem of their own.",
            "review_date": "2011-10-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great film, loads of expectation. Too much technical for non-US baseball fans, but still comprehensive. I would have known about baseball a little bit more to understand what they were talking about and if it was interesting enough. Pitt never fails.",
            "review_date": "2012-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you follow Major League Baseball at all then you know who the New York Yankees are. They are the best that money can buy and that is probably why you either love or hate them. The Yankees can afford anyone at any time because their pocketsIf you follow Major League Baseball at all then you know who the New York Yankees are. They are the best that money can buy and that is probably why you either love or hate them. The Yankees can afford anyone at any time because their pockets are deep and their budget is endless. But then there are teams like the Oakland Athletics, a much smaller and way cheaper team in the MLB. And they shouldnâ",
            "review_date": "2011-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A different type of movie, but great for anyone who has any interest in sports or statistics, didn't over dramatize the story, very well done. Great acting, a must watch for any Bay Area native or sports enthusiast",
            "review_date": "2011-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Going into Moneyball, I had heard nothing about the movie. I hadn't seen any trailers and had no idea it was even about baseball. In other words, I went in with a pretty open mind. When the movie started up I noticed that it had a very slowGoing into Moneyball, I had heard nothing about the movie. I hadn't seen any trailers and had no idea it was even about baseball. In other words, I went in with a pretty open mind. When the movie started up I noticed that it had a very slow and mellow pace, and getting used to this was a bit of a problem, since most of the movies coming out these days are either horror movies or action packed thrillers. Once I got used to the pace however, this movie just got better and better. I enjoyed it from beginning to end, and I'm not even a baseball fan. There's just something about how it all unfolds, and how the characters bounce of each other that left me speechless.  This is a must see movie for anybody, it might just be the best one to come out for a long time.",
            "review_date": "2011-10-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "we cant tell this is a great film.....but there is some reality in this film and in case of brad he acted well....\rDirector should expect Oscarï»¿ nominations: Best Cinematography, maybe even Best Picture. Who Knows?Wellwe cant tell this is a great film.....but there is some reality in this film and in case of brad he acted well....\rDirector should expect Oscarï»¿ nominations: Best Cinematography, maybe even Best Picture. Who Knows?Well what can i say?",
            "review_date": "2011-11-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very nice movie, with a great and captivating plot, you just cannot take the eyes out of the screen.Different of many of the baseball movies, you cant predict the end before the film ends. awesome.And Brad Pitt, now amazing as Producer",
            "review_date": "2011-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You'll miss one of this year's best if you won't watch this movie. Some say this is only for baseball fans? Or only for guys? I don't think so. I think the appeal is universal. It touches the soul. Brad Pitt is surely a lock for a Best ActorYou'll miss one of this year's best if you won't watch this movie. Some say this is only for baseball fans? Or only for guys? I don't think so. I think the appeal is universal. It touches the soul. Brad Pitt is surely a lock for a Best Actor nomination at the 2012 Oscars for his double-edged character. Jonah Hill is nomination-worthy. By the way, if my recollection is correct, you won't see Phillip Seymour Hoffman having a cigarette here. movienotesbook.blogspot.com",
            "review_date": "2011-12-29",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 142
}