{
  "title": "The Whale",
  "rating": 5.8,
  "release_date": "2011-09-23",
  "genre": [
    "Documentary"
  ],
  "summary": "The Whale tells the true story of a young, wild killer whale - an orca - nicknamed Luna, who lost contact with his family on the coast of British Columbia and turned up alone in a narrow stretch of sea between mountains, a place called Nootka Sound. (Paladin Pictures)",
  "critic_reviews": [
    "The Whale is a thoughtful, philosophical, political and ultimately sad documentary that ponders the impulses behind, and advisability of, intense interaction between human beings and another smart species.",
    "Thoughtful and moving, if often heavy-handed, The Whale follows the remarkable story of Luna and will appeal to animal lovers of all ages.",
    "When a baby orca strayed from its family pod near Puget Sound and showed up 200 miles away in Canada in 2001, it became the center of a long-running human drama by turns cute, inspirational, ludicrous and tragic, as documented in The Whale.",
    "What most saw as entirely charming behavior others saw as a nuisance. After all, a playful whale has a way of unwittingly damaging rudders and outriggers and outboard motors and such. Worse, wildlife officials saw Luna's behavior as potentially dangerous, for the people he encountered -- and for the whale himself.",
    "When considering the best voiceover artists in cinema history, Ryan\r\nReynolds doesn't immediately come to mind as an especially dynamic\r\none.",
    "Parents should know that the ending makes the last moments of this family-friendly documentary as tough as \"Bambi.\" But the lessons about friendship are gigantic, indeed.",
    "If your children love animals, by all means, take them to see The Whale. If you appreciate gorgeous scenery, the movie doubles as a picture postcard for the region. If you simply want to indulge in warm-and-fuzzy scenes of whale petting, this movie is also for you. What it is not, however, is remotely new.",
    "While The Whale indulges in hippyish sentiments about the connection between man and beast a little too often, the footage of Luna at play is singular and breathtaking."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This isThis is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review. This is a review.",
      "review_date": "2012-06-08",
      "source": "metacritic"
    }
  ],
  "num_reviews": 9
}