{
    "rating": 0.0,
    "release_date": "2018-02-09",
    "num_reviews": 192,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Long Review: Padman",
            "content": "There's a montage sometime in the first hour where the central character approaches women from different walks of life but finds it difficult to convince even one of them to try out his indigenous product. Reason? The touchy subject. Padman aspires to break this stigma associated with the subject of menstrual hygiene. From a delivery point of view, it is roaring succes.Akshay Kumar plays Lakshmi, a simple, uneducated man living with his mother, two sisters, and newly-wedded wife, Gayatri. A bit of an oddball in his thought processes, he makes it his life goal to produce low-cost sanitary napkins when he learns about the hard-up conditions that Gayatri and the women around him including his sisters, who have recently hit puberty live in, when it comes to menstruation. The religious aspect of the issue - where menstruating women are supposed to isolate themselves and live outside the house during the cycle (mostly in rural India) because they are considered impure - also bothers him, which is why Padman looks like it has been written with a complete contemplation of the issue. And, for a person, who has been exposed to high-octane, mindless Bollywood potboilers, this can come as a surprise.Padman, therefore, is a critique of our times when a technically developed country like India that aspires to be digital-ready struggles with something as crucial and necessary as menstrual sanitation. Lakshmi's attempts to educate the people around him and fight the stigma that is stuck like the plague is much more important than to invent a low-cost napkin that is both efficient and cheap. Despite being a little bit successful in the latter department, Lakshmi continuously struggles to remove the preconceptions about menstruation that people have and which they are not ready to talk about. This hesitance to converse about an issue that is tied to a woman's innate health is alarming, and Padman tries to preach about that. Of course, it's a preach, but a social film cannot do without it if it intends to send the point across. Considering that director R Balki is targeting rural India with this film, I am personally content and confident that it will tick.It is because of not just the construction of the sanitary pad but also the construction of the screenplay that this works. Padman excels in all departments, also giving intermediate knowledge about napkins if people don't know about it already. A well-written plot that reminds us of Shree Narayan Singh's 2017 hit drama on a similar social issue, 'Toilet - Ek Prem Katha', also starring Kumar, it moves ahead without hitting a bump. Of course, there are sequences that are sometimes cringe-worthy and sometimes impossible, but director Balki has evidently taken a lot of cinematic liberty, which is mandatory for a film that captures the entire essence of a social predicament such as this. The fact that Padman is based on the real-life story of the Indian inventor, Arunachalam Muruganantham, would make the viewer more confident and supportive of the structure. It's well-written, has good amounts of humour and drama, if not melodrama, and hits the right notes with its messages. With a score that supports the inspirational message, Padman must be viewed on the big screen and be marketed through word of mouth as it demands greater viewership.Akshay Kumar is phenomenal and looks like he came directly out of the aforementioned film's sets. He carries the whole film on his shoulders and never once shows an inkling of restfulness. If there is a character that I feel an actor has done complete justice to in any film in the past few months, it'd be that of Lakshmi. Equally enchanting is the supremely talented Radhika Apte's performance who seems to be made just for the role of the village wife, something that we previously saw her do in Kabali (2016), and Parched (2015) and Manjhi: The Mountain Man (2015) before that. There's not a single dull moment in Padman, thanks to the performances of the lad and the supporting cast. Sonam Kapoor and Amitabh Bachchan grace the screen for some time and do a decent job, but it is the supporting actors that make the whole broth tastier. Similar to how we last saw in R S Prasanna's Shubh Mangal Savdhan (2017), another highlight of Padman is in its dialogues and general writing. Talking about a touchy subject like menstruation is already an exercise, but to make an entire feature film about it, without hitting the awkward and/or obscene point even once, is something of a marvel. Director-writer Balki and co-writer Swanand Kirkire need to be appreciated for the sensitivity that is visible throughout the film, which could have been turned into a vulgar mess had it been executed by some of the more energetic yesteryear Bollywood filmmakers. Padman excels for a lot of reasons, but tailoring it for a conservative audience is one of the major ones.Padman is refreshing because it serves several things on a single plate and yet manages to not overload it. Lakshmi's relentless attitude towards innovation makes this film much more than something about a social cause. Although India is known as the innovators' world, we hardly see such immaculate representation of the same on the silver screen. I don't care much more for the promotional angle of this film, courtesy the current ruling government in India, but as something that is important to mankind, Padman does deserve applause for its pure concoction and filmmaking brilliance. There couldn't be a better time to release this film that even has shades of chivalry (which, spare me the rolling eye, is no longer dead), feminism, and women empowerment. Lakshmi's dream must have taken him to a lot of places, but his underlying thought to not commercialize his invention and instead work for the greater good is something that makes Padman much more effective and deserving of attention.There's a good chance that if one can relate to the subject, tears are going to make a guest appearance at least once in the 140-minute running time. But, even if that does not happen, it will touch your heart through its warm characterization, entrepreneurship, and the sheer ability to pump your beat up. Padman is perhaps R Balki's best film so far, something that I would even go as far as to list in Kumar's filmography as well. TN.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Two Extra stars just for the bravery to make such a film!",
            "content": "Even before I start analysing 'PadMan' as a movie, I assume films like these have to be lauded simply because they're being made. That actors and filmmakers are using cinema as a tool to strike conversations, tickle thoughts and lift debates, itself is a alleviation; especially in a country of over one hundred crores with numerous problems, most of them neither spoken nor understood.PadMan' is purely a sworn statement of a man's adventure from not anything to contentment; totally banking upon on his very own desires of bringing about fantastic modifications and supporting them sustain. if you ignore a few exaggerations (and i worry I don't have takers for pronouncing this), it is an inspiring film and will create advantageous affects. Decently shot by p.c. Sreeram and rightly complemented with soundtracks composed by Amit Trivedi, it features great performances from each Radhika Apte and Akshay Kumar; and not to forget about, a fluent Sonam Kapoor in a brief yet pivotal role.Watch 'PadMan' to encourage greater movies that communicate about actual troubles; more real than fairytale love stories. Even the real love stories are examined with terrible times, remember? Like that of Lakshmikant and Gayatri.",
            "review_date": "2018-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie will make everyone smile",
            "content": "A beautiful movie with a strong message. Akshay Kumar hits a bullseye again and shines as a winner with his wonderful and effortless acting. He is lovable and takes the movie to the next level. The story as we all know is very inspiring but the execution is what makes it believable and entertaining. R Balki has done a good job and the movie does not bore you even a bit. Radhika Aapte as always delivers a strong performance. Sonam Kapoor is fine and has performed better than all her previous movies. \nHighly recommend everyone to watch this movie.",
            "review_date": "2018-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This one deserves to be in IMDB 8+ list.",
            "content": "PADMAN, the movie full of motivation, is about India's one of the real Superhero. Necessity is the mother of innovation is said somewhere, here it is implemented. Padman is a movie which has romance, comedy, serious as well as heart touching moments distributed equally. This is a brave topic to come up with so hats off to Twinkle Khanna, R Balki and the entire team. Special hats off to Mr. Arunachalam Murugnatham for his extraordinary contribution to the society.The film has many moments which make us laugh naturally and its not forced humor. Chemistry between Akshay Kumar and Radhika Apte is also good. The problem of unhygienic sanitation habit is shown in a bold way and its seriousness can be felt while watching the film. The film has some emotional moments when Padman fails as well as when Padman comes to know that his first Pad which was tested was successful. Best part of the movie includes the scene before interval which reminds of Toilet Ek Prem Katha scene. Mr. Arunachalam is given perfect tribute also in the starting credits as well as in the end which is a good part. The machine making is shown which is a very good part. BGM is very nice. Music of the film is fairly well and justified. Flaws in the film, I found 2 flaws. This film is spanned over some 8-10 years they could have shown some age difference in the looks of the characters it felt as if everything is happening in the span of 1-2 years only. 2nd flaw is the romantic angle in the later part of the film could have been avoided nevertheless it was also justified but it was looking like extra part in the film.Talking about the performances, Akshay Kumar as Lakshmikant Chauhan is fantabulous, one of the best performance of his career. Its another feather to his collection and it should not be a surprise if this act is considered for a national award. He has nailed it in every scene may it be demonstration of his machine or monologue in the end or testing pad on himself or making of the machine. Radhika Apte, has given amazing performance, she is having some amazing emotional scenes and she has performed beautifully. She perfectly suits in a village woman role with a narrow minded thinking. Sonam Kapoor as Pari has her moments in the film. She is the hero along with Lakshmikant. She has some amazing dialogues in her account. Other performances of Lakshmi's mother and sisters as well as 2 friends and Pari's father are also remarkable.\nAnd then there is the one and only Amitabh Bachchan, R Balki's favourite in the special appearance. Its just 2-3 minutes role but he stole the show in his own style. Amazing dialogues by him in just those 2-3 minutes. There are some clap worthy and whistle-able scenes too. R Balki's direction is classic. This is his personal best along with Paa. The camerawork is awesome. Locations in the film are not much important according to film but still Maheshwar is beautiful and it captures true village environment. Editing could have been a bit better but its good there is no unnecessary nuisance in the film.Overall the film is enjoyable, entertaining yet giving a very strong message and motivation. There is no logical error in the film as a normal audience and there is no scene which makes family audience feel awkward. There is no boring moment in the film which makes us feel that when is it ending. Its a motivating film after Dangal. Please don't miss it as we don't have many good movies coming every year.",
            "review_date": "2018-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PADMAN informs, educates and also entertains!",
            "content": "Duration : 140 Minutes \nGenre : Biography/DramaAkshay Kumar as Lakshmikant/ Padman, he mesmerizes once again. One of the best actors we have in the industry right now. He enacts his character effortlessly and steals the show, his 9 minute speech was mind blowing..best one till date.\nSonam Kapoor as Pari, definitely not the fashionable Sonam we all know, she performs beautifully. Playing the supportive character, her chemistry with Akshay sizzles. \nRadhika Apte as Radhika, Her role was limited, yet she was able to leave an impact.Story : It revolves on the story of a man who invents low cost sanitary pads. Based on the short story of the real Padman, Arunachalam Muruganantham... the script has been well written and directed by R Balki. The whole plot has a social message and creates awareness amongst men and women. The whole effort is applause worthy!Music : The tracks of Padman are lovable, and suit well with the story. The Padman song is addictive and Aaj Se Teri is beautiful.",
            "review_date": "2018-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Educating and Entertaining at the same time.",
            "content": "R. Balki cooked this dish with his own recipe alongside Swanand Kirkire, adding multiple flavors handpicked from Balki's arsenal of trademark templates. PC Sreeram's cinematography is god level for it does not have any kind of cutting edge CGI in it but has simple and subtle colours and excellent frames. The costumes, the art-work, and editing are definitely added assets to the film. Amit Trivedi's score is lively and suits Balki's taste perfectly. Of course, Akshay Kumar and Radhika Apte performed really well but the best surprise for me was Sonam's character in this film. Really had a touching moment at the very end. On a whole, its educating and entertaining.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect example to describe the \"Woman's problem\" in India.",
            "content": "Menstrual hygiene wasn't introduced in India until later in the 21st century, a social activist from South India introduces a tool to prevent from menstrual bleeding. So basically this film focuses on the aspect of menstrual hygiene in India.So a welder named Lakshmikant Chauhan based in a village in the rural of East India gets married and lives a blissful life until he notices the women in his village are suffering periods even in his family. Due to the lack of affordability for those sanitary pads, Lakshmi decides to change that by producing napkin pads but his idea leaves the villagers in doubt and gives them the feeling of embarrassment and shame. How Lakshmi changes that is basically what this film is about?Superman, Batman, Spiderman, and now Padman. R. Balki introudces a very straight on point script with deals with subjective matters of menstrual hygiene. This kind of hygiene is very essential for women across India which does have a very high poverty rate. Balki successfully shows the empowering factors of sanitary pads in such a way that managed to keep the audience engaged throughout those 140 minutes of the film.As far as performances go, Akshay Kumar literally nails it as Lakshmi. Luckily since Airlift, he has been upping his game especially in this film. His motives on menstrual hygiene was simply outstanding and that village mentality of a dropout as surprisngly something only Kumar can pull. Radhika Apte plays Gayatri, Lakshmi's wife who is against her husband's decision. She was great and simple but some dialgoues implemented by her were a bit off and it didn't comply too much to her character even as a villager.Sonam Kapoor was outstanding in Neerja but this film, it gave the audience the feeling especially me that she went on set just to earn a big quick big. Big B's appearance was quite a surprise.Direction was quite weak and this is something very common in R.Balki's films. He is very known for adding too mnay close up shots in 80% of the scenes and zooming too much will just cover up the background.Also there was a minor issue, it is okay to put comedy and drama which were both there but the script itself was a bit too factual. it is understandable that menstrual hygiene is a concept but putting too many of those elements will probably escalate the boredom in some scenes.Amit Trivedi's album is surely a winner and Mika Singh's take on the title song is simply a treat to devour for the next 4 minutes and Aaj Se Teri sung by Arijit Singh will put you in a romantic mood.Overall, 2018 is improving quite well at the start and this film will be counted in my top 10 best films of 2018. Nicely written backed up by a narrative concept also backed by powerful performances. But the direction of the film does dissappoint quite alot with the close ups but this is a perfect film.3.75/5 - R. Balki's most perfect film after Paa",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I enjoyed this movie",
            "content": "\"Padman,\" tells an important story in an engaging and entertaining way. I enjoyed this movie overall and really enjoyed Akshay Kumar's lead performance. His character is very likable has he only has the purest intentions to something good for society. The story was inspirational and pretty well put together. I do feel that the first half of the movie dragged mostly because it became pretty repetitive and it probably could have been cut a bit shorter. The movie does bounce back with a fast-paced and resonant second half that makes the movie worthwhile. It's a good movie with a strong message and a good heart that I enjoyed.",
            "review_date": "2020-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What We Take for Granted",
            "content": "For the most part a true tale w/a bit of Indian movie dramatization (i.e. a couple of song/dances; a romantic moment), about the use of female sanitary pads in India. Your first inclination on viewing this story is another boring Indian family going through issues. Wrong! When you begin to discover it's about males dealing w/the female menstrual period which is culturally an extreme no-no; it starts to get interesting, eventually really interesting. Background: At the time this story begins, the 1990s, only about 12% of Indian women used a \"sanitary\" pad, the rest you ask? Newspapers, leaves, and a continually reused rag washed most likely in unsanitary H2O. So, a husband buys pads for 55 Rupees which the wife refuses to use in part because their high cost is beyond their low income level. The husband as a low education, hands-on laborer, decides to make some for his wife. That's when the fireworks begins. The subject is a culturally stigmatized superstitious taboo - mildly put. He's shamed, ostracized beyond belief as he asks questions, and researches. His goal is to build a machine to make them for 2 Rupees all \"for the safety of women\". Read only after seeing: It took him six years. Introduced his low cost pad maker to thousands of villages. Hired abused, cast out, unemployed women (many beggars, prostitutes) to make & distribute the pads. Has exported his machine to 29 poor countries. Named Time magazine's \"100 Most Influential People\" in the world. Guest speaker at the UN & TED.",
            "review_date": "2018-08-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its not another story",
            "content": "Its a rare movie that highlights the important issue every girl goes through for around 3 decades , the part where she needs to work hard the most to make an identity for herself, overcomes more obstacles than a guy , covering everything in 25 days as 5 days she is not at her 100%. Its a story of a husband's compassion for his wife, for her safety and to break all stereotypes for it. It talks about the taboo that menstrual hygiene or even talk of it carries in India or even around. The shame it carries as if its a crime to talk about though its periodical and quite natural and not intended or felt happy about by any girl. Go for it. And being a true story adds a thrill to it. In bollywood these kinda movies do not come everyday. And guys please watch it . It might give you perception.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Badman to Padman",
            "content": "First and foremost a big round of applause to every single entity (Actors ,producers,director,writer,cameraman) who are associated with this real life inspired piece of lifetime reality .\nAkshay kumar has acted flawlessly and setting another milestone for himself by acting as a rigid man who does not give up his dream even after multiple failures and malign and turns from a \"Badman to padman\".Being a woman it was more easier to connect to each and every action of the protagonist such as testing the pad on his own(by pumping animal blood) was the most touching scene which made me cry while watching.It gives me goosebumps while I think about the real hero Mr Lakshmikant.A jumbo hats off to him from the core of my heart and mind. Rest all have also played their part very responsibly and successfully. \nThis piece inspires to dream about every small and untouched but inevitable needs of life associated with human being(Irrespective of caste creed and gender).\nI will not go very far to proof this as I always wanted to write a review on movies and this is the movie which forced me to write the review right after coming back from theatre. Though this story makes more sense to developing and underdeveloped countries like India where chums is still a taboo to talk about still the movie deserves a nomination for Oscar in regional film category in the year of 2018.",
            "review_date": "2018-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The real USP of the film is that it is a biography",
            "content": "An actor like Akshay Kumar is picking such subjects to make movies is itself a revelation in Indian Cinema. This is a taboo subject and no one wants to even talk about it in Indian households. Women considered impure during periods is common in every Indian household. Hope this film will change something and open their eyes towards these superstitions and blind beliefs.",
            "review_date": "2018-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "INSPIRATIONAL MOVIE.",
            "content": "Akshay is improving himself day by day...\nA very good motivational movie.You should watch.",
            "review_date": "2018-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movie that tells about desire of a common man to bring some change in society",
            "content": "This movie is surely one of the best movie of Akshay Kumar,His journey of creating an affordable sanitary pad is truly inspiring,\nSuperb story & dialogues,\nMust watch!!",
            "review_date": "2018-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Definetely should go for Oscar",
            "content": "Thanks to Akshay kumar for saying yes for a movie on this subject.\nIt got all the attention because of Akshay kumar.",
            "review_date": "2018-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Padman is a refreshing journey which should be lauded for its boldness and message for a cause",
            "content": "There is a dialogue in the movie - \"If you are not facing problem, you are not living your life properly\". India is a huge country with diverse culture, religion and faith with its own issue and circumstances. But does all the belief and faith hold the right message ? Padman explores that ..Padman, based on one of the short story \"The Sanitary Man of Sacred Land\" written by Twinkle Khanna, tells the extraordinary story of an ordinary man , Lakshmi Prasad (Akshay Kumar), who changed the life of rural women in India by devising low-cost machine to build sanitary pads. Directed by R.Balki, who gave us some critically acclaimed films like Cheeni Kum and Paa, Padman is a bold step to explore the subject of menstruation and sanitary pads which is considered taboo in India. The film starts of very well with few scenes bringing smile on your face - Lakshmi Prasad buying the pads for his wife first time from a local medical shop, Lakshmi saving the life of his fellow-worker at the factory and even when he is trying to build the pads by using the cotton and leaves. The passion and determination of Lakshmi to know how the pad works and trying to make his wife and sisters use it will keep you glued to the screen. While the first half boast of some great scenes, the second half is a roller-coaster ride which stumbles down but picks up later in the climax. There are various reasons - the romance between Sonam Kapoor and Akshay Kumar is half-baked and out of place, the weird of Sonam Kapoor is itself does not make much impact, the lengthy pace and few unwanted scenes. Even the songs by Amit Trivedi is disappointing as none of it has chartburster touch (coming as a surprise from such a talented musician). Despite these hiccups, the impact of movie overall is a good as it helps to understand the pain what women goes through during those five days of period, especially a learning lesson for men. Though, it is okay to talk about it in Urban India, the subject is extremely sensitive in the rural India even though we are living in 21st Century. The screenplay is decent while editing is good, though trimming of few scenes and songs could have helped. Art direction is splendid while Cinematography is outstanding capturing the beautiful locations in Madhya Pradesh. Padman belongs to one and the only Akshay Kumar. The actor is just challenging himself to do good films on social cause and entertaining us with his superb performance. Though, he went overboard during one of the scene when he introduces his invention at the National Innovation Foundation conference, he will win your heart with a staggering speech at the United Nation ceremony, New York. Radhika Apte gives adequate support to her role. Sonam Kapoor, as usual, over-acted and does not justice to her character at all. I wish, the makers could have taken someone better.Padman is a refreshing journey of Arunachalam Muruganantham which should be lauded for its boldness and message for a cause. Good 3/5",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best films I've seen",
            "content": "Akshay Kumar's acting is great oh boy the casting was soo good and the story was original and shoutout to the team who decided to make this a film and show that a country is strong when the country's women are safe and strong such a great message and an inspiration.",
            "review_date": "2018-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not terrible, but a ridiculous ending.",
            "content": "I just want to say, he went back to his wife who basically left him and did not support him one bit and left poor pari alone and heartbroken whilst she supported and helped him through all that? Why? Annoyed the crap out of me.",
            "review_date": "2019-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I never thought a movie like this would be made in India.",
            "content": "Many years ago, when i had read about Arunachalam Muruganantham, if someone told me that a movie would be made on him, i would have said that's impossible, it's never going to happen. People in India are even scared of watching the advertisements of Sanitary Napkins on television, they feel shy buying it in the shops, how would they convince their family to watch a movie about it ? On top of that, the things Arunachalam did to achieve were quite bizarre, he used to pick out used sanitary pads from the dustbin and do his research on them ! How on earth would Bollywood show that in the movies ? Hollywood might have made such a biopic, but Indian Film Industry...no chance.So, in 2016 when it was announced that a film based on Arunachalam Muruganantham's life is being made, i was quite surprised, what was even more surprising was that Akshay Kumar was going to play the lead. Akshay Kumar is known to play over the top characters, or do patriotic films, he had never done a movie like this. Finally when the time came for the movie to reveal itself to the audience, i was quite certain the creators would just talk about the issue on surface level and not go too deep into it, and there was no way they were going to show the things that Arunachalam actually did. But when the movie came out, i could not believe my eyes, they had done the impossible. R. Balki (Director) showed almost everything that Arunachalam did in order to achieve his bizarre goal.'Pad Man' is a fantastic film, very well made, completely different from what you would expect from an Akshay Kumar film. This is easily the most important film of Akshay Kumar's career. Movies like these are normally made with unknown actors and on a very small budget, most people don't even get to know about it's existence. With a superstar like Akshay Kumar, this story managed to reach millions of people, making it somewhat easier for people to talk about sanitary napkins. This movie is not a documentary, it has all the entertainment that a movie needs, there is an abundance of humour throughout the film and of course it has some outstanding music by Amit Trivedi.Pad Man entertains as well as educates. People living in urban areas use sanitary napkins but don't talk about it, women in villages don't use it and most people, specially men don't even know what 'Periods' are. The easiest way of removing the tag of taboo from a topic, is to talk about it and this film does exactly that. This movie deserves to be seen by everyone.",
            "review_date": "2021-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional, Inspirational and Engaging Biopic",
            "content": "Success stories are always a treat to watch. And, \"Padman\" is not an exception to it. A thoroughly enjoyable movie which brings a pleasant smile to your face when it ends. The first half is lagging a little bit whereas the 2nd half compensates for it and entertains you thoroughly. Overall, a brilliant biopic to watch.",
            "review_date": "2018-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "We can announce confidently - India ke paas apna Superhero Pad Man hai.",
            "content": "It is certainly appreciable that Indian films are choosing topics of social taboo and Pad Man is the latest one which talks about women's menstrual hygiene and their need to use sanitary pads. In our country, menstruating women are treated as outcast on these days and barred from entering temples and kitchens, it is a matter of debate, since it deals with belief system of many. So, it is a welcome change, when efforts are being made to talk about such topics of societal taboo and what best media other than a film to deal with such paradigm shift needed. Pad Man is a film which is inspired from the life of Arunachalam Muruganantham, a social entrepreneur from Coimbatore (Tamil Nadu). He is the inventor of low-cost sanitary pad-making machine. His innovative grassroot mechanisms for generating awareness about traditional unhygienic practices around menstruation has done wonders for women in rural India. He has not commercialized his mini machines which can manufacture sanitary pads for less than a third of the cost of commercial pads, rather he has chosen to sell it to self-help groups run by women. As per Wikipedia, these mini machines have been installed in 23 of 29 states of India, and he is planning to expand the production of these machines to 106 nations. (https://en.wikipedia.org/wiki/Arunachalam_Muruganantham) \nAlong with many awards conferred on him, he was included in Time Magazine's list of 100 Most Influential People in the World in 2014 and also Padma Shri in 2016 by Government of India. One thing which is to be noted is that Pad Man, as it is claimed by the makers, is not the first film on Arunachalam. Amit Virmani has made a documentary 'Menstrual Man', Abhishek Saxena made Phullu (2017) and there is another unreleased film \"I-Pad\" made in 2015 by Amit Rai. Twinkle Khanna had come out with 'The Legend of Lakshmi Prasad\" - a collection of four stories in 2016, out of which one story is \"The Sanitary Man of Sacred Land\" on which Pad Man is supposed to be based on. Of course, more the films on these subjects, it is good so as to create more and more awareness amongst people and get rid of taboo. So, Pad Man by R. Balki with Akshay Kumar and Radhika Apte in the lead is successful in creating the right buzz. R Balki has chosen to give fictional names to his protagonists Akshay Kumar and Radhika Apte and also he has picked up the backdrop of Bhopal rather than Coimbatore. R Balki and Swanand Kirkire as writers does mention the statistics as well in the film that only 12% of women in India use sanitary pads. They have kept the tone of the film very light without making it preachy. Sensibilities of the audience is taken into consideration. The emotions of the females, the belief system of considering oneself unsacred during menstruating days, not entering Kitchen / temples, the celebration (almost like mini-wedding) when a girl matures and the confusion of male fraternity are very well captured in the screenplay. Even the medical shop person selling the sanitary pad as if he is selling something illegal is very much relatable. What could have been avoided in the film is the love dynamics explored between Sonam Kapoor and Akshay Kumar, it appeared very cliché and displaced. Lakshmikant Chauhan (Akshay) works in a welding factory. His sharp eye for details and fixing up things is evident from the very beginning of the film. He finds it very disturbing when he sees his wife Gayathri (Radhika Apte) using dirty clothes during her periods. In spite of Gayathri asking Lakshmi to stay out of ladies' problems, he does try his hand in making sanitary pads. His initial attempts fail miserably. What he finds it even more challenging is to get the pad tested. He makes desperate attempts to get the client, family, acquaintances etc. for his product but in vain. He is branded as eccentric, pervert and he ends up risking everything he has - his wife, family, home, village, social status etc. But nothing deters him from going ahead with his experimentation. It was a loner's journey for Lakshmi, but his go-getter attitude gives him slow yet steady success and that is how he invents low-cost sanitary pad-making machine. Another major challenge in front of Lakshmi was to get the buy-in for the pads from the women and that is when Pari (Sonam Kapoor), a young talented Tabla Player and MBA student, enters the scene. She not only becomes his first client but later on also becomes instrumental in creating user-base and roping in self-help groups run by women. The film has many high points be it Lakshmi's undying spirit to not accept defeat and continue with his experimentation, his genuine concern for wife and female hygiene, Lakshmi and Gayathri's chemistry, Lakshmi's efforts in managing to get the things one -by-one to invent the low-cost sanitary pad manufacturing machine, his 'Linglish speech' in United Nations, Amitabh Bachchan's cameo etc. The cast of the film perfectly fit into their respective characters very well. Akshay Kumar is effortless while playing Lakshmikant, he downplays himself wherever required. Radhika Apte is gorgeous as Gayathri and she has projected the shame associated with even discussing menstruation very well. Sonam Kapoor as Pari is good and gregarious. The best thing is writers R Bali and Swanand Kirkire has justified the presence of every character, even if it is a small role. Rakesh Chaturvedi as Professor is one such character, though has a small role, he becomes a reason for Lakshmi's shift in focus from making low-cost sanitary pads to inventing low-cost sanitary pad making machine. R. Balki's Pad Man inspired from Arunachalam Muruganantham's life showcases realistic performances from Akshay and Radhika and the film succeeds in dealing with a topic of societal taboo like menstrual hygiene with very much ease and finesse. It hits the bulls eye as far as enhancing social consciousness is concerned and it is bound to leave the ripples of cultural transformation for a very long time. Yes, we can announce confidently - India ke paas apna Superhero Pad Man hai.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Story Backed By Great Performances",
            "content": "I wish more such movies are made in Bollywood. Akshay Kumar astounds me with his knack of finding good stories and bringing them in the limelight. India needs to hear more stories like Arunachalam Muruganantham's. The man sacrificed his pride, his reputation, and his family even, to protect his wife and sisters from diseases. In turn, he created a revolution, protecting many other women's health and financial security.The story begins as an introduction to the family life of Lakshmikant Chauhan (based on Muruganantham) and the audience gets to know how he finds ways to help his family with their daily chores. Soon he realizes the problems his wife and sisters have to go through during their periods. To ensure their safety, he tries to make affordable pads that would help them live their lives better, but he runs into many hurdles over time.His first proper backing comes from Pari Walia, who steers him through these hurdles and pushes him to greater heights, ultimately helping him realize his dreams.I liked all three main actors. Akshay Kumar was fantastic and his performance as Lakshmikant Chauhan was very heart-warming. His Linglish (Lakshmi-English) was adorable and his speech at the UN was beautiful. Radhika Apte, as usual, breathes life into her character though I would have wanted to see more of her in the movie. Sonam Kapoor surprised me with her turn here. I used to have a bias against her but now I can see she has gotten much better in her craft and she was convincing as Pari Walia, the angel in Chauhan's life.I didn't quite like the feelings bit between Pari and Chauhan and would have liked that relationship to have remained pure and unlaced with any other feeling, but I guess this is a necessary evil with films. I enjoyed the rest of the story and honestly, the real life story of Muruganantham fascinated me. Many thanks to R. Balki and Akshay Kumar for bringing a story like this to the forefront.",
            "review_date": "2018-08-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Padman Review: India has got the most innovative superhero!",
            "content": "Movie: Padman (UA): Biography/Drama - HindiPositives:Akshay Kumar's solid act makes you stand and salute him for such a solid, realistic and honest portrayal of a real-life \"superhero\".The lead actresses Radhika Apte and Sonam Kapoor deliver excellent performances and their characters are fully realized as well.Amit Trivedi's music enhances the impact and adds to the entertainment quotient. The screenplay is very well written and neatly edited. For not a second this film will let you move.R Balki's direction proves why he's one of the most talented directors we have.Technically too the film is very impressive. Both humour and drama have been mixed in a proper proportion and is bound to make you laugh and cry respectively .The film's concept definitely stands out. This film is one of its kind.Negatives:Nil.Repeat value: InfinitePADMAN emerges victorious right from the moment it starts. It's one of the many films which are totally perfect in each and every aspect. Akshay Kumar deserves truck loads of awards for his groundbreaking act, and with this film he has proven he's one of the best actors we've got in our nation. So go, watch, enjoy and celebrate the arrival of a new superhero because he's the most innovative one we have got. And at last, a grand salute to the real PADMAN, Mr. Arunachalam Muruganantham.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An EYE OPENER CLASSIC for Sensible People.",
            "content": "PADMAN REVIEW :When i saw the Trailer my First Reaction was like, 'Oh wow, someone has picked this Sensitive subject to make film. I must admire them'. I was afraid this film might lack the commercial value as the subject was Very Very Sensitive for our Male oriented society, but somewhere i was sure about Content. And Yes Padman is an EYE OPENER CLASSIC, A Sensitive but natural topic handle in a Sensible way by R Balki makes this one a MUST WATCH and also i expect some change in our Society regarding that Awkwardness about Pads.Acting- Akshay Kumar has given his Best Performance of this Decade. He's Sober, Kind Hearted yet down to earth. Radhika has done a Good Job being a typical Small town Housewife. Sonam appears after Interval but still makes her Presence feel strong with Sophisticated, educated, Bindass girl Accent.Writing- It's Strong as expected because you know it's a True Story and it's Inspiring so there shouldn't be any problem in writing a Great Script. But still few fictional material is irritating.Screenplay- When you get a Strong basic Script then you have to be very careful about screenplay and here it has hit the Right Chords. No Boring Moments, nothing to Dislike, expected Turn Arounds plus Emotional sequences. Everything is PERFECT.Music- Underwhelming. But this script actually don't need those typical Hit songs and useless chartbusters. All songs are Situational and fits properly in the film still that 'Ladki Sayani Ho Gayi' could have been removed.Direction- Balki does it again. He's always unique stories teller. But after Paa he was lost somewhere and has came back again to his Standard and delivers a Classic here. He has put enough commercial elements in the film, not making it too much overdose, doesn't lose basic Content, keeps reminding you that this is what happening in our Society and it's natural, there's nothing to be ashamed of.Final Words- Overall Padman is a Classic and will bring some change in our society regarding women's natural problem. I won't be surprised if Akshay and Balki will be called Superheroes by some Indian Women. Just go for this one, enjoy and come back home with a Grin smile on face, few tears in eyes and A Message in Mind. Padman deserves every single penny of your ticket purchase. Last but not the Least thank you so much Twinkle, Akshay and Balki for this film and Salute the real Padman. 8/10*",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply Outstanding!!!",
            "content": "Such a rare Film ever.... Great Job by @AkshayKumar @SonamKapoor @Rbalki !",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Padman is yet another Akshay's entertainer with social message",
            "content": "Padman was a good movie with a brilliance from Khiladi along with Sonam and Radhika Apte on a social message of sanitary napkin usage. Despite some flaws, it's a feel good cinema which entertains and at the se time delivers its social message",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Topic that need to be talked...",
            "content": "This film is made on very serious topic but yet having entertaining elements in place. I would say Toilet/Padman: these are films which can bring bigger changes than any great Prime-Minister. \nI was surprised that it never bores you, and makes you feel proud of for passion of the guy who transformed a love into cause for society. \nHope we get more and more such films.\nAnd whole india watch it not today than in time of decade time-frame....",
            "review_date": "2018-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good film for it's message and execution.",
            "content": "Padman is a movie everyone should see. The movie is giving a strong socially relevant message. As a film, it has also good performances and good screenplay. R Balki didn't bore us and did a good job. Akshay Kumar delivered one of his strongest performances of his career. The two female leads did a good job but it was Sonam Kapoor who surprised us. Padman rounds upto be one of the best films of the year.",
            "review_date": "2018-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An EYE OPENER CLASSIC for Sensible people.",
            "content": "PADMAN REVIEW :When i saw the Trailer my First Reaction was like, 'Oh wow, someone has picked this Sensitive subject to make film. I must admire them'. I was afraid this film might lack the commercial value as the subject was Very Very Sensitive for our Male oriented society, but somewhere i was sure about Content. And Yes Padman is an EYE OPENER CLASSIC, A Sensitive but natural topic handle in a Sensible way by R Balki makes this one a MUST WATCH and also i expect some change in our Society regarding that Awkwardness about Pads.Acting- Akshay Kumar has given his Best Performance of this Decade. He's Sober, Kind Hearted yet down to earth. Radhika has done a Good Job being a typical Small town Housewife. Sonam appears after Interval but still makes her Presence feel strong with Sophisticated, educated, Bindass girl Accent.Writing- It's Strong as expected because you know it's a True Story and it's Inspiring so there shouldn't be any problem in writing a Great Script. But still few fictional material is irritating.Screenplay- When you get a Strong basic Script then you have to be very careful about screenplay and here it has hit the Right Chords. No Boring Moments, nothing to Dislike, expected Turn Arounds plus Emotional sequences. Everything is PERFECT.Music- Underwhelming. But this script actually don't need those typical Hit songs and useless chartbusters. All songs are Situational and fits properly in the film still that 'Ladki Sayani Ho Gayi' could have been removed.Direction- Balki does it again. He's always unique stories teller. But after Paa he was lost somewhere and has came back again to his Standard and delivers a Classic here. He has put enough commercial elements in the film, not making it too much overdose, doesn't lose basic Content, keeps reminding you that this is what happening in our Society and it's natural, there's nothing to be ashamed of.Final Words- Overall Padman is a Classic and will bring some change in our society regarding women's natural problem. I won't be surprised if Akshay and Balki will be called Superheroes by some Indian Women. Just go for this one, enjoy and come back home with a Grin smile on face, few tears in eyes and A Message in Mind. Padman deserves every single penny of your ticket purchase. Last but not the Least thank you so much Twinkle, Akshay and Balki for this film and Salute the real Padman. 8/10*",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must watch movie.with eye opening script and awareness spreading journey of Arunachalam Murgnatham(Real Padman)",
            "content": "Movie starts with padman's wedding and after that he realizes the bitter truth of women's problem (which society things it as bitter) .after that movie shows his dedication towards his solution for this problem and love for his wife and respect rather safety point for all women.\nSuch a great and Epic movie and everyone need to see and get inspired to do such things and spread awareness around.\nAs usual Akshay gave his best and Radhika also has given nice contribution.",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Powerful....",
            "content": "Akshay kumar once again gives career best performance in this movie. Powerful storyline with amazing social message. And it takes the guts to do work in this type of scripts because many big actors denies working in the script like this. Sensitive content with proper storyline makes the movie an edge of the seat experience. Performance of every actor is phenomenal in this movie. Specially Akshay, Radhika & Sonam superb performances. I also even like to mention the Director R BALKI for directing this beautiful movie. Movie doesn't feel bored any minute infact youll get connected easily with the story of Laxmi character and emotional scenes are too hard hitting. It's a must watch.....",
            "review_date": "2022-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie and we need more movies like this",
            "content": "The movie is good as the movie is basically made with social message in mind. As far as the movie changes stereotypes and changes in even a small way the thinking of society the effort needs to be appreciated. Hats off for acting and direction. i had fun watching the movie.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brave attempt",
            "content": "This is the movie one should pay to watch.\nExtremely inspiring as its a true story of a man.\nBrought tears of joy to me while watching.\nCut 1 star only for Sonam Kapoor's awful performance.",
            "review_date": "2020-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Social awareness with the touch of love story",
            "content": "This movie vividly depicts the south Asian society and their way of thinking, being a patriarch country, female members of the society are dominated and discriminated still in many parts of the Countries in South Asia. This movie can act as a way of comprehending information in many regions and spread awareness about the woman's hygiene, because people love to do what the celebrities do in the movie, and this as far as i perceive give us hope and optimism. This movie also shows the love triangle, that is a spicy twist that made me give 10 star rating to this movie. Akshya being a great actor as he is has splendidly played the character of \"Laxmi kant\", however during his scene in Speech from America, his English sometimes catch the fluency that a 8th grader village passout can hardly do, all the same this is a must watch movie and i recommend you all to watch it.",
            "review_date": "2018-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "strongly recommended",
            "content": "I watched it on Friday, definitely it is wonderful movie.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pad Man: R Balki's first \"period\" film with full of social message",
            "content": "Direction:\nR Balki is famous for making some out of the box concept like he directed Cheeni Kum, Paa, Shamitabh and Ki & Ka. This time he tried biopic with some comedy and drama. I think that he executed this new experiment with ease. He used comedy and drama in such manner that audience will enjoy this \"Period\" cinema since beginning to climax. Performance:\nSure-shot this flick belongs to one and only Akshay Kumar. He is soul of this movie as he showcase so much perfection with his role. Radhika Apte will be next queen of Bollywood as she delivered one of the great performance. Sonam Kapoor looks good in extended Cameo role. Amitabh Bachchan has special bonding with R Balki that's why he was part of his all movies with lead to cameo roles.Story:It is based on the short story The Sanitary Man of Sacred Land in Twinkle Khanna's book The Legend of Lakshmi Prasad, which is inspired by the life of Arunachalam Muruganantham, a social activist from Tamil Nadu who introduced low-cost sanitary pads. Very little little things or instances were taken care. e.g. \"Sayaani\" song by Yashita Sharma picture-zed on unique ritual for a young girl who has attained puberty.Music:After Secret Superstar, Amit Trivedi come up with another great music. Arijit Singh's \"Aaj se Teri\" song is chart-buster. Amit Trivedi sang \"Hu Ba Hu\"song with his signature style.Target Audience: You can enjoy this movie with whole family as this movie deliver some good social message which is really necessary for male and female both.Box-office predict:This biopic definitely hit on box-office as this one solo release and this one is Valentine week also. This movie can be another 100 crores' club movie for Akshay Kumar.Last words: Go and watch the journey of Pad Man",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brave, Inspiring, and Bloody Good",
            "content": "There's a scene in Akshay Kumar's latest release, 'Padman', where he runs towards water with bloody pants. He's trying to make sanitary pads for his wife and decides to try one himself with animal blood. It's an incredibly brave scene in an equally brave film. In a country where talking about 'women's issues' is considered taboo one of its so-called 'masculine' superstars taking on the role of a man obsessed with making pads for his wife is nothing short of applaud worthy. He's the same star who was known for his khiladi attitude and rowdy films...and now we see him telling stories about toilets and pads. What a change! There's a lesson in there for all of us.Padman is inspired by the real life story of Arunachalam Muruganantham who spent 2 years developing a low-cost machine to make pads. Lakshmi's (Arunachalam's) tale in the movie is inspiring to say the least. His subject is shunned, his family disheartened, his wallet empty, yet this dropout from a rural town in India finds a way to succeed against all odds. And it's all done in a fearless manner. I can safely say you haven't seen anything like this at the movies.R. Balki, credited for directing and co-writing the movie, champions several social causes and entertains the audience with his most unlikely hero. There's gentle humor throughout the story that keeps the tone light albeit slightly preachy. Of course, you can't expect to reform society without some speeches and dialogues about morals and ethics. The first half of the film deals with Lakshmi's home life and you get to see just how unusual this man is even within his own family. For me, the second half is where the narrative scores. We see Lakshmi's innovative mind and his undying spirit which wins him awards, accolades, and even more detractors. The journey is thoughtfully conceived, written, and portrayed.Akshay takes to the character remarkably well. He infuses Lakshmi with a deep sincerity making you root for him even when the whole world thinks he's mad. Watch him deliver that 7 minute long speech at the UN in his broken english. You'll have a smile on your face the whole time. Radhika Apte plays his wife, Gayatri, who would rather die of a disease than shame. It's a painfully dull and typical character, if you ask me, but Radhika is a fine actress who brings honesty to the role. I wanted more from Gayatri which I didn't get but such is society. Sonam Kapoor's Pari springs a pleasant surprise in the 2nd half. She brings much needed color and hope to Lakshmi's life and infuses liveliness in the film. Their relationship is sweet; Lakshmi makes the invention and Pari makes the inventor.Padman is courageous, noble, and breaks boundaries one pad a time, one woman at a time. Book yourself a ticket stat. It's bloody good. Period. Yes, yes, I know you're rolling your eyes at the puns. But as the tagline says, superhero hai yeh pagla. Aur heroic hai yeh film.stuffiwatchblog.wordpress.com",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "The movie was awesome and no words for acting of akshay sir sonam man,radhikka mem all time good \nEveryone was watch this movie plz. \n10/10 \nAwesome \nTy Akshay sir \nYou are a real hero \nCongratulations!",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An important movie about a topic that should not be taboo",
            "content": "I really enjoyed this movie. Coming from an Indian woman raised in America, the subject of periods is perhaps less taboo than in other countries, but still not something people like to talk about. In the film we see how this natural function of the body is viewed in rural India, with the women being forced to sleep outside as if there is something to be ashamed of, and access to sanitary napkins not only unafforable but frowned upon.When Lakshmi (Askhay Kumar) marries Gayatri (Radhika Apte) and learns how the period is dealt with, out of his deep love for her as well as his sisters, he makes it his mission to create an affordable pad for all Indian women to access. This leads to pushback from not only Gayatri, but also his community, who do not think a man should be so obsessed with this subject matter.The story is a very moving one that I feel is important for not only men, but also women to watch. The acting is superb, perhaps the best I have seen in my limited experience with Indian films. There is a nice surge of energy when Sonam Kapoor's character joins the cast. The movie has everything you could want in a feel-good movie: comedy, drama, education, and even appropriate musical numbers.",
            "review_date": "2018-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch",
            "content": "Brilliantly executed film with a great social message. The movie tells a compelling story of a truly inspirational genius. You get a very good idea of the struggles the real Pad man went through when his entire family, community ostracized him.\nIt depresses and then truly inspires you. Great treatment. Since its a mix of biopic and entertainment, it may be a different experience for an Indian audience.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent Movie",
            "content": "Superb Work By Akshay Sir...A Great Actor..with a great personality...",
            "review_date": "2018-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch movie, best after dangal or same",
            "content": "I had no great expectation from this movie as I was thinking to be as good as Toilet which I found Ok and exaggerating in some sequences or forced. But this movie is different and entertaining throughout. There are parts in the end where Akshay speech in UN and Sonam emotional extension looked bit dragging but otherwise I felt the movie was nicely put together. Even those aforementioned scenes are good when you look at the movie holistically. Akshay acting, Radhika and even sonam looked perfect but everyone else also played there part quite good and it is said when the movie is good, the whole things look good. I highly recommend to watch this movie and feel the pain a man goes through in showering his love and protection to his woman. It is also a romantic movie and the need of the time where people think beyond the box of bringing just two strangers to show love between them. Establishing love between a couple is what we need now so that love last long and not just until the day of marriage.",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a story of achiever!",
            "content": "Tone, Script & Story: The story is biography of a man named Arunachalam Muruganantham from south of India. He is the one who is responsible for selling sanitary pads at affordable price in rural India. He is also thus responsible to provide women employment, till certain extent. He has since been honored by national and international firms. The story addresses a man where he understands a problem gets onto something to eliminate it and keep trying deterministically till it's eliminated. Drama overdoes itself in first half. It should have been cut by ten minutes, to let efforts by main character fall into place at single trial after conclusion from his wife. Another instance is how miraculously he gets a member to use his newly built pads. Further she even becomes his best companion in work.Direction, Screenplay, Cinematography: Direction was good; screenplay was good and cinematography (that included still water, temple, village scenery, statue of liberty and UN stage) was good too.Music: Music is average.\n \nActing: I have been recently impressed by Akshay's work. Sonam and Radhika's work was also good.Final Verdict: Every other woman is aware of how costly these sanitary napkins are. If I am not wrong, they too would want access to these affordable pads. Let these have accessibility to every women. Arunachalam Muruganantham despite being poor achieves something. This is a story of achiever.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent Movie..",
            "content": "After watching this movie I feel don't know what to say. Too many things in my mind not finding the word to express.",
            "review_date": "2018-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Standard pipeline products",
            "content": "Standard pipeline products. originated from frustrated attempts and ended with an exciting speech. Angel Investors Behind, but India's Rare, Slim Beauty",
            "review_date": "2019-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect social drama",
            "content": "A film which is high on content. A bold story that should be told",
            "review_date": "2018-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Super movie",
            "content": "Today i watch movie with my wife . We happy. I wana se every person shuld be watch this movie. .\nVery nice acting of khiladi & sonam ..\nThanks",
            "review_date": "2018-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREAT Movie and We just Need to Telecast this Movie in Every Corner of Developing and Under Developed Counties..",
            "content": "I just want to say.... this movies speaks about our real world issues... Like my country there are many developing counties ...where women need to watch it so that they can be get rid of many serious infections (e.g.like Toxic shock syndrome) which is lethal due to poor sanitary pad use. This is not a movie but The Movie which brings all Entertainment, Awareness & Knowledge at same time. We spend whole life for KAP ( Knowledge, attitude and practise) which they just did in A MAGICAL WAY...... Just love this movie. Highly entertaining Movie with super acting ...from Aki, sonam and radhika. The way he speaks english, its really so cute to watch that....",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartfelt & Well-Acted!",
            "content": "R. Balki's 'Pad Man' is a heartfelt film, that is based on the true-story on Arunachalam Muruganantham, a social activist from Coimbatore, Tamil Nadu, who introduced low-cost sanitary pads for the betterment of woman. A noble true-story of a real-life hero, 'Pad Man' never soars as its Hero, but at least it has its heart at the right place & the performances are undeniably impressive.'Pad Man' Synopsis: Upon realizing the extent to which women are affected by their menses, Lakshmikant (Akshay Kumar, in good form) sets out to create a sanitary pad machine and to provide inexpensive sanitary pads to the women of rural India.'Pad Man' has a slow first-hour, where Lakshmikant faces objection, rebellion & humiliation, despite his noble idea of helping woman during their 5-day monthly periods. Considering this true-story is set in a rural town, the backlashes to the sensible & concerned Hero aren't very surprising. Even he makes perfect sense, nobody, including his wife (Radhika Apte, terrific), take his side. Its this hour of 'Pad Man' that wobbles, offering some moments that stand-out, but overall come across as repettive & slow-moving. The second-hour is engaging & offers wonderful moments in good portions. The arrival of the film's second leading-lady (Sonam Kapoor, warm & nice) & her understanding of Lakshmikant's obsession of making the pads & making sure they reach to as many as possible, brings the film the much needed pace. And when Lakshmikant does triumph, its hard not to be moved. And there's no denying that 'Pad man' is a sincere story, made with honesty.R. Balki & Swanand Kirkire's Screenplay, which is based on Twinkle Khanna's book The Legend of Lakshmi Prasad, offers heart. Its never solid enough to hold your attention all through, but its honesty is on-point. R. Balki's Direction is uncomplicated. He's made a simple film. Cinematography & Editing are decent. Amit Trivedi's Score has a few winning tracks.Performance-Wise: Akshay Kumar scores as Lakshmikant. As the Pad Man, Akshay portrays the simpleton with pure emotion. The actor particularly excels in the emotional scenes, where he genuinely touches your heart. Also, his speech at the United Nations, is sweet. Radhika Apte, as his long-suffering & innocent wife, is superb. The actress is in top-form, delivering an entirely realized performance from start to end. Sonam Kapoor is very likable. Amitabh Bachchan's cameo is alright.On the whole, 'Pad Man' isn't perfect, but it isn't without its share of merits either.",
            "review_date": "2018-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Film That Deserves National Award - PADMAN - FS",
            "content": "I never expected that a film on Pads would be so Interesting, so Inspiring and so Emotional. It is a touchy subject and makes one uncomfortable to talk about even among the educated and urban class society. The social stigma attached to it is very deep and rooted and in a country like India, there are 100's of other superstitious omens besides being treated as filth.Visions to make a film on social subject and especially on such a touchy subject need not only guts but also solid content. This visionary director had a solid content in his silver platter in form of a Real life Padman and his inspirational journey, all he needed was the team to make it happen and I will applaud every crew member participated in this movie especially the lead Akshay Kumar.First of all it's a brave attempt and to succeed in it is exemplary. The 10 Min speech by Akshay Kumar addressing UN is the Best Inspirational/Motivational speeches I have ever heard so far in any film. I had tears in my eyes in the end & they were not only Because of the speech, they rolled down because I was totally engaged in what was happening as I was made aware of our situations and conditions in Indian Villages, I was made aware that the people can reach such great heights if their will and passion is put together towards their goals and because I was listening to a PADMAN (An uneducated guy explaining the business model) not the actor Akshay Kumar.Apart from the inspiring journey of Padman, I loved the subtle chemistry between Sonam and Akshay, The irritation and awkwardness Akshay created within his family and among the neighbors, the simplicity of the character he maintained throughout the movie and the detailed version of the success of his business model. I loved the movie and would recommend each and every person to watch.It is Akshay who has ruled over every other star in terms of Quality films this decade. This decade Akshay has given variety of movies on different topics but according to me Airlift and PADMAN stands out as the two Masterpieces of this decade. Highly Recommended!!!",
            "review_date": "2019-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Recommended 👍",
            "content": "This movie is very educational for today's critical, tiny minded human beings, who lives mostly lives in villages and treat womens as second class human beings.",
            "review_date": "2020-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I am a fan of r balki now",
            "content": "Great movie and great true story must watch. Watch it for the person who did it in real life and obviously akshay performance is great.. Even sonam has done great work imagine that... Lol",
            "review_date": "2018-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"PADMAN\"- My Review",
            "content": "In recent times, we have seen Bollywood film-makers attempting movies basedvd on taboo subjects like Toilet Ek Prem Katha (dealt with the issue of open defeication), Shubh Mangal Saavdhan ( dealt with erectile disynfunction) etc.. \nNow Padman, written and directed by R. Balki, deals with the issue of menstrual hygiene. Before telling more, first the plot.\nThe film tells the story of Lakshmikanth Chauhan ( Akshay Kumar ), who after his marriage, realises to what extent his wife and all the other women are affected by their menses, and sets out to invent a low cost sanitary pad machine.\nAs you all know, the movie is based on the real life of Arunachalam Muruganantham, a social activist from Tamil Nadu. But the film is made suiting to the Northern sensibilities. Even though it's a biopic, never does it get serious or preachy. The director has balanced the movie with content and entertainment. There are many scenes in the movie which will leave a lasting effect on the viewer. One being the scene before interval, when Akshay decides to test the Pad he made by himself. And the other, Akshay's speech at the United NationsThe music of the movies was good. The songs 'Aaj se teri' and the Title track was really memorable. Cinematography too was done well.Now to the performances. It requires guts for an actor to act in a film dealing with a subject on menstrual hygiene. Akshay Kumar acts his part with perfection. It's his second film recently, after TEPK, which deals with a taboo subject. Raadhika Apte too impresses. Her moments with Akshay was really good. Sonam Kapoor plays her role good even though the love angle just before the climax was not required. Amitabh Bachchan appears in a cameo. Rest of the supporting actors have done their parts well. All I all PADMAN is a film to be watched. Highly recommended.My rating- 4/5",
            "review_date": "2018-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Padman - Remake of \"Phullu\" with A list actors\"",
            "content": "I admit that the concept is innovative...but the execution is mediocre; and on the top of that comes over - \"Indianization\" which makes you really wonder whether this is actually a movie based on a 21st century incident...This movie should have been released in Doordarshan first, because rural people must see this movie first...Positives: -(1) Akshay Kumar's natural acting\n(2) Beautiful songs like Aaj Se Teri\n(3) Occasional humour and satiresNegatives: -(1) First half of the movie\n(2) Unnecessary love plotPadman is definitely not a superhero, but he'll make you laugh at times and compel you to be more conscious about a woman's health and hygiene...MY RATING: -Direction: 3.5 out of 5\nDialogues: 3 out of 5\nScreenplay: 3.5 out of 5\nMusic:: 3 out of 5\nVisual appeal: 3 out of 5",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Uxoriousness",
            "content": "Because of my essentially random scheduling in the matter, I see about half a dozen new Indian films a year, mostly comedies of some sort. Given such a small sample, it's a stretch to draw conclusions, but a bunch concern themselves with the problems of village life, and with the problems faced by women in a conservative society.Today's was PAD MAN, a fictionalized story based on Arunachalam Muruganatham, a man who, worried about his wife using dirty rags for her menstrual flow, and shocked at the high cost of sanitary menstrual pads, worked out a method of producing them for less than 5% of their store price, and creating a sales industry for women in the process -- and convincing everyone in his village, including his family, that he is an insane pervert.Although I thought that at almost two and a half hours, it was getting a bit draggy towards the end, the movie offered its characters in an intelligent and light-hearted manner. Akshay Kumar, as the lead, is an bright, admirable lunk, able to switch from serious to romantic to clown and remain the same character.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inspiring journey",
            "content": "I just want to say that I can't stop replaying the scene that Lakshmi delivered the speech in front of the UN, so inspiring and powerful, which are what the whole movie makes me feel.",
            "review_date": "2020-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Problem is good",
            "content": "After months of waiting for an enchanting movie, this is the one I wait for so long. Inspiring, encouraging, funny....Seeing Indian movies and having been to India, I feel that I am quite lucky to be born to a city fair to women. Indian women cannot be her family or go to school during mensuration. Our male lead invents cheap napkins and free women of mensuration.His speech in New York celebrating his invention, without the help of translator, is inspiring and encouraging. Problem, to him, is good chance to find ways to improve.Nothing is impossible. Just preserve your passion and creativity of childhood. Someday your wish will come true.",
            "review_date": "2019-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inspiration",
            "content": "This movie tells an inspirational story. Improvements to life are right under our nose, if we look hard enough. The ending is good. But it would have been better if he did not go back to his wife or to the town which abandoned him. He should have gone to woman who truly understood him and supported him. She helped him make his dream a reality. His wife should have tried harder to understand him. His journey led to his true love.",
            "review_date": "2018-10-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie of social awareness for India",
            "content": "Movie like this is what needed in today's India. India where 60% people from rural area has many misconceptions in the name of tradition. Padman has countered one of such.",
            "review_date": "2018-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top notch acting ! Akshay's best film till date !",
            "content": "Simply fantastic and up to the mark with top performances, special mention to Radhika Apte. I congratulate to the entire film crew to make this wonderfully crafted inspiring film. Screenplay and the presence of the actors on the screen is excellent throughout the movie. I recommend this movie to every Indian to watch once at least.",
            "review_date": "2018-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This issue must have been addressed so I appreciate it even being over dramatic, slow and preachy at places",
            "content": "I applaud director Mr. R. Balki for exploring and making aware the people about this huss huss talked subject, which is still a taboo in most peoples mind, ironically it should have been treated as a blessing. Shockingly, this snaitary pad issue has been much less talked than diapers. I am unable to understand that, this film is based on a real person Arunachal Muruganatham, based in Coimbtore then what was need to shift it in Madhay Pradesh, perhaps for subsidy! But it indirectly subsides the contribution of the genius and caring man behind this innovation. Film clearly lack it entertainment quotient which makes it slow. Most of time just information has been passed but in few scenes it has its hidden cute moments like when protagonist is looking for prospect to trail and attempts to convince different religion girls for it. First turning point comes with over drama when male lead tries it on himself but fails then he jumps into river which leads a social boycott. Similarly, when he designed its proper version then suddenly girls come to him asking for medical shop sounds too surreal. Pre climax speech is too preachy. After all this film should have been watched, talked to help in accepting the pad issue as essential part of life. Performance wise Akshay Kumar is first rate. Radhika Apte is pitch perfect as his wife. Sonam Kapoor is very cute and balanced.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No words just Amazing...",
            "content": "Another great movie for Akshay #seedhi saadhi Akshay... Real king of Bollywood",
            "review_date": "2018-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The last speech",
            "content": "The last speech that Akshay delivers was really mind blowing & highly inspiring. The overall movie is something like average to me. But some speech, ideas, struggle & plot of the movie makes it really very special.",
            "review_date": "2019-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Must Watch Movie for All",
            "content": "Thank you R. Balki for making this film and the social message. A must watch movie for all.",
            "review_date": "2019-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simplistic yet Impactful",
            "content": "Fantastic movie. Since Airlift, Akshay Kumar has carved out a space for himself by doing such entertainers with a strong social message. Padman will only strengthen this space of his. A bit understated and less commercial than his last movie, Toilet, this movie deals with the making of low cost sanitary pads, and addresses the condition of the women in India during their days of menstruation. R Balki has crafted this movie expertly. Akshay is as usual, Fantastic. Watch out for his speech towards the end. Inspiring,motivational and humorous, all at the same time. At a time his peers are still doing the same old fare to appease thier loyal fan base, Akshay is winning over new audience, who probably a few years ago thought he can't do anything other than action and comedy. All in all, a must watch.",
            "review_date": "2018-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"MIND BLOWING\"",
            "content": "What an inspirational incredible movie. I really enjoyed watching it. It delivers a precious valuable message.",
            "review_date": "2019-10-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Got placed in my all time Favs!",
            "content": "In dry state Gujarat, film theaters were also facing dryness at the box office. Since, Padmaavat is not being released in this state, every cinelover or even normal people were waiting for a film to watch in theater. So, in the second month of the year, a film is out starring the most popular actor- Akshay Kumar in the titular role of Padman.Film is based on true story. Padman is a madman- This is what the villagers think. Because, He cares and thinks for the safety of his wife while she is having a period. He then understands the basic needs for women. How does he invent pads and after that what problems he faces to aware people for using those pads are the questions which will be covered during the film. And this film is the most entertaining film, I repeat, Most entertaining film!I found Toilet very slow and boring. But, this is super intriguing and paced based film. R. Balki is known for his unusual subjects. He is master in that. So, no doubt in that. Though I feel this film does not show his directorial efforts. But, kudos to him for his brave choices and also for, as of now, his biggest hit till date. Radhika Apte suits in her character of a village bride. She plays comfortably. Sonam Kapoor has one more hit in her career. Again she shines out, like she was in Bhag Milkha Bhag. She delivers her one of the best performances. Others are good. Balki's film is incomplete without Amitabh Bachchan, so brace yourself before watching his cameo! Akshay Kumar is the only actor who works for his audience. Now, he is bringing stories which have to be told worldwide. Also, I feel that he is becoming mature towards his acting and choosing subjects. No other actor can pull off this role as beautifully as him. This time I am feeling the vibes of him enjoying this role so much, as he always tries to help someone, especially women, and this character does the same! Amit Trivedi is known for his western music with cultural touch. You will feel this in Sayaani Song. Title song is good, too. Sweet, simple and suitable music. If you want shayari with simple words or even English words, Kausar Munir is the best lyricist. She can give you Tu Hi Hai from Dear Zindagi, as well as, Aaj Se Tera Ho Gaya in this one. With claps worthy dialogues, entertaining screenplay, Narmada, New York, IIT Delhi and Akshay Kumar all in one packet, this Padman will satisfy you for sure. The speech at UN by Padman was terrific. His monologue will be remembered for life long! With mixture of emotions, innocence and determination, anyone can come up with an innovation. Try to think besides yourself. The world is waiting for your invaluable ideas. JanSankhya (Number of people) is more in our country, so does ZahanSankhya (Number of Minds)! Think in the direction of betterment of people. Like Padmashree winner- The Original Padman did.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "t",
            "content": "The story of Anasani is concerned with the issue of women",
            "review_date": "2018-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PADMAN-CHADDI KA CHAMATKAR",
            "content": "I had watched the trailer of PadMan, found it hilarious and was eagerly waiting to watch this movie. The wait was lengthened by a delayed release in a show of solidarity by Akshay Kumar to make way for Padmaavat. The movie is based on the book written by Twinkle Khanna titled \"The Legend of Lakshmi Prasad\" which in turn was inspired by the life of Arunachalam Muruganantham who invented sanitary napkin machines that manufactured cost-efficient pads making it affordable to rural Indian women. \n I generally look forward to Akshay Kumar starrers and I went to the theatre with high expectations. Moreover, I went with my crazy bunch of friends who, like me, do not believe in muffled laughter! \nThe movie begins with a song that shows Lakshmikant Chauhan (Akshay Kumar) making minor inventions to save his wife Gayatri (Radhika Apte) from the inconvenience of stinging eyes while chopping onions and bumpy rides, sitting on the cycle's cross bar (A reminder that the film showcases life in the 1990s when people didn't have the convenience of viewing easy life-hacks on YouTube) The film was shot in a village near Indore and records the journey of Lakshmi who initially starts off with wanting his wife to have better menstrual hygiene by using sanitary napkins rather than continue using the cloth. When she refuses to use the pad on account of the steep price, he takes it upon himself to make affordable pads not only for her but also for other women in his village. However, all attempts at getting his wife and other women to use the pads he made, fail. Lakhsmi is now labelled a pervert in his village who despite many a warning continues to meddle in \"ladies' affairs\" and speak openly about \"that, which should not be named\". Gayatri returns to her brother's house claiming that she'd rather die of unhygienic conditions than of shame that has befallen her. Lakshmi leaves his village and sets out on a quest that leads him to invent the sanitary napkin manufacturing machine and this is where Pari (Sonam Kapoor) makes her entry. Pari encourages Lakshmi on his journey of manufacturing affordable pads and distribute it amongst the rural women and also ends up with the pad being named after her. Though the length of time is not divulged, Lakshmi makes the headlines by winning an award at IIT and later on, the Padma Shri and is now looked up to by the people in his village.\nI had a sense of déjà vu whilst sitting through the whole film. It reminded me of 'Toilet', another Akshay Kumar starrer that had a similar storyline. The Husband in an attempt to improve the wife's state of living, brings to light a much larger albeit a taboo issue, the whole process which has him shunned by not only the society but also proved tumultuous to his marriage. \nThe movie, although has its funny bits, is a bit slow. The second half had us yawning and constantly checking our phones with the word \"pad, pad, pad\" ringing in the background. The actors have portrayed their characters well, the dialogues (especially the speech given by Lakshmi at the end of the movie) are entertaining, the movie succeeds in delivering the social message and yet the movie lacked the wow-factor. I suppose I was expecting too much from the Balki-Akshay duo. \nAlso, in an attempt to conform to the Bollywood-scene, the introduction of the love triangle and the superfluous \"kissing scene\" had us all shake our heads in disappointment. \nHad the movie not borne a stark similarity to Toilet-Ek Prem Katha, we would have probably enjoyed it a bit more.\nPeriod.\nP.S: the tagline in the title of this post is from one of the posters shown in the film welcoming Lakshmi back into his village.",
            "review_date": "2018-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Padman - the Superhero Flies Really High :)",
            "content": "The movie is a biopic on Arunachalam Muruganantham and covers the trials and tribulations that he faced during his journey to become one of the most important and respected Social entrepreneur world-over. A movie being made on such a taboo subject in a conservative society like India is big achievement and bigger is the achievement of Arunachalam Muruganantham, who in reality faced all this and maybe much more than this, but stood his ground and come up with such an innovation to make accessible, cheap sanitary pads for menstrual hygiene even to to the lowermost strata of society. Lakshmikanth Chauhan in movie is real life -Arunachalam Muruganantham.The movie comes to the point pretty early by opening with a song showing the marriage and love and care that Lakshmikanth Chauhan(Akshay kumar) has for his wife Gayatri(Radhika Apte) and out of that care arises Lakshmi's obsession to make cheap Sanitary pads for his wife as branded ones were too expensive to afford for him for his wife and sisters. But this obsession of his makes him try too much and the subsequent failures bring embarrassment to him and his family. All this reach such a point that he was seen as pervert who is possessed or has some contagious sexual disease in village and his sisters , wife , mother all move away from him , so he decides to leave the village. Though all this humiliation separates him from his family but fails to separate him from his obsession to get a 100 % working sanitary pad for his wife at lowest cost and from here on starts his journey to gain knowledge and make a sanitary pad as good as branded one at dirt cheap cost. Testing the pads for their efficacy was one hurdle he had failed to cross from start but there arrives a fairy for this padman- Pari(Sonam Kapoor) who helps him pass not that testing hurdle but also stands by him during tough times and takes his mission from village to village so much so that he names the pads - pari. Whether he settles with pari or his wife returns is revealed subsequently in the movie.Radhika Apte plays an innocent village girl who has traditional mindset,got her look and mannerism perfect .Radhika is known to be a bold women in real life so playing a contrasting character with so much conviction deserves applause. Sonam looks cute and plays suave urbane girl who gets bowled over by simplicity of Lakshikanth and decides to give his dreams a wings to fly. Sonam also plays her role with elan. Rest of the character actors looked in place with their act. Akshay kumar shed his street smart hero image once again and is very good as a simpleton with an innocence and unwavering dedication and conviction to achieve what he has set out for. The extent to which Akshay has got hold of the character can be easily understood by seeing real Arunachalam Muruganantham. videos.Background music is excellent so are the songs Aaj se teri and Padman. Cinematography is top notch for such a low budget movie. The Movie slows down a bit after interval as what Lakshmi sets out to be has been achieved by that time and focus has shifted to how far has his innovation benefited people but then picks up with his UN speech,20-25 minutes before the end. So the pacing of the movie is nice. Director has done commendable job by bringing some amount of entertainment and yet not losing the essence of the film - i.e. to tell the complete story within 140 minutes as close to reality as possible.Some of the High points or scenes i liked \nLakshmiKanth(will use Lakshmi for him) UN speech\nAllegory where Lakshmikanth uses sanitary pad on a bleeding arm cut\nScenes exposing how 50 rs is too much for menstrual hygenie but nothing when shelled out in name of religion showing various tricks to befool people\nLakshmikanth - Pari 1st meeting\nAffectionate scenes between Lakshmi and pari\nLakshmikanth trying sanitary pads himself .This move is an example of how one can keep the movie realistic and bold and yet add some entertainment value . I would have rated this movie a 9/10 because a big section is devoid of much entertainment value, But then added an extra 1 for making this BOLD movie in a realistic manner and that too at commercial level with one of the biggest Indian superstar. So its 10/10. Anyone who complains of Bollywood not moving out of comfort zone would really love and relish this one .",
            "review_date": "2018-09-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Akshay great choice this issue",
            "content": "What a OUTSTANDING Movie. akshaykumar can Do Anything when it comes to Brilliant Act and this movie proves it. radhika_apte sonamakapoor looks Superb in their Role. A must must must must must Watch for Every Indian",
            "review_date": "2020-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brave and an inspirational attempt......",
            "content": "The film revolves around life of Lakshmikant Chauhan (Akshay Kumar) based out of a village in Madhya Pradesh and his inspiring journey of spreading awareness about menstruation and smashing taboos associated with it in the conservative society. Now, first of all let us all agree that it was indeed brave of Akshay to touch upon this subject, given his massy appeal. There is a probability that aam junta might shy away from watching the film because of its unconventional content. But the makers have made sure that there is enough publicity going around which will make people shun their ignorance and embrace this cause wholeheartedly. So, a newly married Lakshmi is a welder but extremely curious about female menstruation and is disturbed by the lack of sanitation or awareness around it. It all starts when he finds out that his wife Gayatri (Radhika Apte) uses dirty cotton cloth for the lack of sanitary pads during her periods. He then fashions a cotton pad and persuades his wife to use the same. Despite repeated attempts, he fails to make a sustainable napkin. His relentless pursuit to make the perfect sanitary napkin leads his entire family to disown him until he manages to convince the society that menstrual hygiene is a burning topic which needs to be addressed.Akshay Kumar is at his natural best in the garb of a village bumpkin Lakshmi. The supporting cast of Radhika Apte, Mrunmayee Gokhale and Jyoti Subhash are brilliant, complementing his performance. The first half is filled with a lot of bittersweet moments between Akshay and Radhika but one scene that stood out for us was just before the interval. Lakshmi, in an attempt to make a full proof napkin, attaches an animal blood pouch to his waist making the blood drip steadily into his handmade pad. Thinking that his job is done, he happily strides away only to realise to his dismay that the pad is leaking. The mere sight of Akshay taking a plunge into the nearby river with soiled pants is moving, impactful and breaks stereotypes in every way possible. It is indeed brave for a mainstream Hindi film hero to attempt something like this. The dialogues written by Swanand Kirkire and R. Balki are funny, emotional, bringing out a very earthy side of the lead hero. Though we felt that Lakshmi's UN speech could have been shorter.In the second half, director R. Balki slips a little bit as the film gets too technical showing Lakshmi building a pad manufacturing machine from scratch. The editing treatment given to these bits by Chandan Arora could have been tighter. Also, Sonam Kapoor's entry is a little too convenient and the way she begins her association with the PAD MAN Akshay is a tad bit filmy. Sonam tries to deliver an honest performance as a confidante and marketing guru to Akshay's character but there is little focus on her in the movie. She however tries to make the best of what she has, engaging us for most part. Despite saying this, a love angle created by the makers between her and Akshay seemed forced and unnecessary.The screenplay (R. Balki) is quite engaging and entertaining. It sure drops at a few places but eventually manages to pick and keep you glued to the story.Since this film, which is inspired by the life of Tamil Nadu's social entrepreneur Arunachalam Muruganantham, is adapted to suit North Indian sensibilities for greater viewership, PAD MAN is shot across scenic locales of Maheshwar, Indore and Mahu in Madhya Pradesh. PC Sreeram has done an excellent job with the cinematography. The camera work is beautiful and expansive capturing the simplicity of the lifestyle of the people living there. One finds a massy connect in the way characters are treated as far as their costumes, dialogues and overall appeal is considered.Amit Trivedi's music is good but not spectacular, to be honest. Only two tracks 'Aaj Se Teri' and Pad Man title track stand out but then there is little scope for the music when the film is so heavy on content.It is worth mentioning here that Akshay Kumar manages to maintain perfect gravitas as a feminist icon who is emotional and passionate about his cause. It is indeed applause worthy for him to take a taboo topic (after TOILET: EK PREM KATHA) and make a commercial film out of it, without letting it get too preachy for its own good. Also, it is interesting to note that Balki's gallery has always been the urbane multiplex going audience and yet he pleasantly surprises us by making a rooted film which has the potential to cut across class/caste barriers.On the whole, PAD MAN is a brave and an inspirational attempt at creating a commercial cinema out of a taboo topic. The movie scores high on content as well as emotions. At the box office, Akshay Kumar's mass appeal will surely help to pull in the audiences. It has the potential to grow steadily at the box-office with the positive word-of-mouth. Period.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Story of a Madman who changed the world and mindset of society by his insanity and innovation.",
            "content": "Movies come and go but there are some movies which will leave a mark on your heart, an eye opener for the society and force people to contemplate... Pad Man is one of them... Truly an inspirational and path breaker movie !!\nA Story of a Madman who changed the world and mindset of society by his insanity and innovation.",
            "review_date": "2018-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple , Beautiful , Educational .",
            "content": "One of the Few recent films which makes you cry even if u r a boy.\n1 extra star for the courage to make such a film .",
            "review_date": "2018-10-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A marvel in scriptwriting",
            "content": "PadmanKhiladi Kumar, Akshay is all set to entertain the audience with 'Pad Man'. The film is first production venture of Twinkle Khanna and is directed by R Balki. The film also stars Radhika Apte as Akshay's wife and Sonam Kapoor as tabla player. The film 'Pad Man' is a real life story of Arunachalam Muruganantham, the man who wore a sanitary pad to break a taboo. It is a reality that Muruganantham tried his best to find a way to make cheap, affordable sanitary napkins for women in his village. It is his devotion to dedication towards a noble cause. Pad Man is a film based upon his life. While making the film scriptwriter has made many changes but kept the real life synthesis as it is. When I watched this film, I liked the way it is been scripted. I liked the dialogues. There are many characters who come speak very ordinary and camera is kept at a distance as a third person point of view but the impact what we get is beyond words. When I say beyond words, I mean it. There are times, when situations gives us hint, clue or twist in the story all this takes place through not so important characters. Film compel us to think, sympathize with character and support them. All things takes place through action and not through words. I find this style of script and dialogue is a new in Bollywood. R. Balki and swanand kirkire who has worked together to craft the screenplay of this film.",
            "review_date": "2018-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome movie",
            "content": "One of the best movies of 2018 very interesting subject...only Akshay is capable of doing movie like..this",
            "review_date": "2018-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie, Informative, although awkward",
            "content": "I feel like this is a great movie. Informative, I was not taught in childhood so I was still awkward when watching this movie.Recently most movies are just enjoyment and no message to the audience, whereas this teaches and also makes people enjoy and don't make people reject it.",
            "review_date": "2021-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "lost it (spoiler)",
            "content": "Two hours of being inspirational, funny, uplifting, sad, endearing, and engaging - then lost in the last ten minutes. The love triangle falls flat making the wrong choice, the vapid choice.",
            "review_date": "2019-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a must watch, without any doubt, but with a bitter ending.",
            "content": "Excellent movie, disappointing ending!\nwhy? cuz we have a good man here (with excellent acting of Mr. Akshay Kumar) which backward people of his village, including his family and even his wife, treat him at the worst way possible.\nafter that, a good woman shows up and help him while he was in his down and helps him (along with her dad) fly to the ups. she teaches him everything about business and commercial rights and marketing and the necessity of advertisement in global scale. she even does the role of saleswoman for him, one village after another, all on her feet.\nnow, after all those efforts, when the man reaches to his goal and everything is finally good, that stupid selfish woman takes all the fruits of the tree of success and that supportive good-hearted woman takes nothing. this is simplest case of disappointment for every viewer.\nI know this movie is based on a real life story, so they couldnt change the ending, but this was -at least for me- a turn off at the ending, after all those joyful and beautiful ups n downs.\nI'm not saying the movie is not good. not at all. I gave it 9 stars at imdb, and still suggest it to anyone who hasnt watched it yet, but cant deny the ending was upsetting.",
            "review_date": "2020-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "padman",
            "content": "This movie is so great! I think the two most important elements that make it wonderful are its commitment to detail (the details of this story are incredibly interesting, and the film takes the time to focus on each small element with attention and love), and the absolutely perfect casting of Akshay Kumar! I have no idea how closely this film sticks to Mr. Muruganantham's actual journey, or how accurate Kumar's performance actually is, but as a gorgeous, emotionally satisfying drama it absolutely woks! I also admire the way the film portrays a person who is incredibly intelligent and dedicated but lacking in education and has to learn to navigate various systems that were not designed to be easy for those who are not already on the inside of the intellectual structures that created them.",
            "review_date": "2021-12-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie",
            "content": "No words to write, just see this movie and enjoy the ride.",
            "review_date": "2019-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing! Inspiring! A must watch movie.",
            "content": "The way i Expected this film and i knew the plot of the film, It was definitely not the way and i was wrong. Full of Thrill, Suspense and dedication. A fast paced movie occupies you through the end of it. First part was Suspense and Controversial, I almost got to think what would happen NEXT! second part was Satisfactory of your curiosity but Moreover It was inspirational, that speech of lakshmi tells thousands words. And an amazing ending part. The small love story of lakshmi and pari wasn't messed up at all. Overall brilliant! Would expect such movies on the cinema.",
            "review_date": "2018-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "OSCAR DESERVING",
            "content": "First of all a big applause for the makers & specially Akshay Kumar who dared to bring this movie.\nNo words for Akshay Kumar, I just salute him for doing such a difficult role. He has broken all the stereotypes. This movie is funny and inspiring.\nAll credit goes to Akshay Kumar for doing such a commendable job.",
            "review_date": "2020-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart at the right place. Applaud the intent!!!",
            "content": "Not the greatest screenplay and could have been 20 mins shorter but nothing can take away from the impact that this film will have. A must watch for everyone and a very very important film for the society. Movies have the power to influence how people think and to use that to this effect, amazing!!! Akshay Kumar - what can be more said about this man. Just stand and applaud!!! The speech in the last... oh boy, as an audience you forget this is not the real Laskhmi.. fabulous. Must must must watch for all.",
            "review_date": "2018-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Real Superhero",
            "content": "No doubt Padman saves mote life than Spiderman.\nA perfect tribute to Arunachalam Murghanathan. Akshay Kumar, Radhika Apte were great. Must watch.",
            "review_date": "2020-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Padman",
            "content": "Its beyond Akshay kumar's limit, like he totally nailed the character portraying the role of the man & all his co-star's performances made the movie an epic",
            "review_date": "2018-08-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such a Nice Movie!!!",
            "content": "It was such a nice movie, all characters played their role very well. it was not just about the product but more about the struggle of a poor man to prove himself. The speech part in New York by Akash kumar was so inspiring..i would recommend you to watch this movie once.",
            "review_date": "2018-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch movie",
            "content": "In india no one is talking about women periods difficulties and then Akshay Kumar came with this beautiful movie with beautiful message. This movie is based on true story.",
            "review_date": "2021-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Simple and light hearted movie",
            "content": "A very bold subject that should be told on-screen. Akshay is in top of the league and very brave to choose this bold movie and should be applauded.every character is perfect in their role",
            "review_date": "2018-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mindblowing",
            "content": "Akshay Kumar deserve Best actor Award🙏...\nJust Awesom... A Social oriented movie with perfect entertainmen.",
            "review_date": "2018-11-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Based on a true pad",
            "content": "Actually l dont like indian movies but it's amazing making a such a movie based on a pad. What a imagination and creativity . Are you kiddin ! My wife and l had fun a lot while watching it",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great story.. Ok movie",
            "content": "The movie itself is ok. You'll not mind. For an average movie goer it's not going to be for the movie making, rather the story of this real life superhero.The movie starts with a few funny lines that'll get audience to chuckle, has one good title song, a few heart touching moments.The movie could do better in terms of blending in to the early 2000 indian village setting, even akshay himself. It doesn't take you in, you'll always be very aware of your cinema seats.Radhika has done a fantastic job.Sonam delivers great acting but the character itself feels forced in to create a love triangle and modern pretty women charm. Audience will have varied opinions on that.The second half gets too technical and preachy. This is where the movie goes of track a little.Plenty of life lessons to be learnt, if you're on for that kind of thing. Salute to the team for taking a taboo subject and making it into a good movie that can be enjoyed by everyone. Everyone in your family will enjoy this movie. It's not all just menstruation talks but a good blend of comedy, family, live lessons, culture, dogmas, and more.Enjoy the movie.",
            "review_date": "2018-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "US has Batman, Superman but India has Padman",
            "content": "A sweet glowing movie in our dark times of Covid. An unassuming loving man's quest to keep his wife safe from using dirty rags during those days of the man. Rediculed, laughed at, pilloried he persevered and found success and adulation. A heartwarming movie. A great story and a greater lesson for all of us. Watch it if you have the chance. You'll come away with a smile.",
            "review_date": "2021-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Informative and Very Entertaining...",
            "content": "The movie has many moments when I was wondering how simple the concept was and yet how touching the movie was. BUT the Sonam Kapoor love angle was unnecessary and the only thing that made me realize I watching Indian movie.\nOne of the best movies of Akshay Kumar and R.Balki.",
            "review_date": "2019-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Story of a man we needed to hear.",
            "content": "\"Only twelve percent women in India are able to afford sanitary pads\", the reason why these women retort towards using dirty clothes, newspapers, leaves and in some cases even ashes during their menstrual cycle. 'Padman' is the story of Padma Shri Mr. Arunachalam Muruganantham who was able to provide the solution to this adverse problem.Lakshmikant Chauhan(Akshay Kumar), a newly-wed machine tool operator resides in a small village of Madhya Pradesh with his wife, mother and his sisters. Lakshmi has a knack of understanding the mechanism of machines. This helps him in creating daily-use tools using any object. One day when he learns about the menstrual problem of his wife Gayatri(Radhika Apte), he suggests her to use sanitary pads instead of a dirty cloth. Women in early days were not allowed to live inside the house during their five-day cycle. But like most women she is not able to afford them and hence asks him to return those.After learning about the dangerous health problems of such negligence, he takes it upon himself to make sanitary pads. In his attempt to understanding the quality of these pads he takes the help of his wife, sisters and medical college students. But when they refuse to cooperate he himself tries this process after which his mother disowns him and his wife leaves him.But this doesn't deter Lakshmikant who leaves his village thus starting his journey to find the correct formula. When he finally discovers how the pad-creating machine operates, Lakshmi decides to make his own low-cost machine using his sharp skills. Aiding him in this effort is Pari(Sonam Kapoor), daughter of an IIT Professor who not only tries the pad herself but also helps in distributing the affordable pads village-to-village.Kudos to R Balki and Twinkle Khanna(who has previously written a book, 'The Legend on Lakshmikant Prasad' on the same man) on bringing this hard-hitting story to the silver-screen. 'Padman' is an inspiration, a story of a man who broke the social taboos in our country just by staying true to his vision. Some moments in the movie could have been exploited better and there is also a forced love story in between but nothing takes the spotlight from this praiseworthy effort. The first half of the movie takes a bit more time in building the story which makes the second half feel rushed.The movie has been carried on his shoulders by Akshay Kumar who portrays the struggles and failures of the character in such demeanour that you relish every small success he achieves. He has been well supported by a graceful Sonam Kapoor and and abject Radhika Apte. Radhika gives another performance to cherish after 'Parched' about a woman brought-up in an environment where women are ashamed of talking about a natural activity even with her own husband.There are movies which are able to do justice with the true visionaries of our world and 'Padman' is one such tale. We wish Mr. Muruganantham achieves his dream going forward and wish luck for his future adventures.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a Story!",
            "content": "Akshay kumar & Radhika Apte killed it. Lower middle class family and rituals. Fantastically portrayed.",
            "review_date": "2020-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Daring move and well executed 👍👏",
            "content": "The movie is damn bold to its content .The movie never hesitate to show what it wants to say. Akshay Kumar proves that he is content king now a days . I think the love story of Akshay Kumar and Sonam kapoor was useless. I could have deduct one star for that but the movie is damn good which made me give it 10 stars . Superb🔥🔥",
            "review_date": "2021-01-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MASTERPIECE",
            "content": "Such a masterpiece movie.OneWordReview...\nPadMan: WINNER.Rating:- 10/10 as a Diehard fan of Akshay Kumar\n8/10 as a neutral.Realistic. Inspiring. Engaging. Deeply moving... A big THUMBS UP.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PAD - NOT A TABOO ANYMORE",
            "content": "This film has inspired so many girls across India. And also boys to change their perspective and views about girls.This one is a true Gem",
            "review_date": "2021-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch",
            "content": "If you have never seen and Indian film before, Pad man should get you started",
            "review_date": "2019-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PADMAN",
            "content": "Akshay Kumar is also known for his continuous blockbuster movies. He is very popular actor all over the world. He is one of those heroes with zero haters. His real name is Rajiv Hari Om Bhatia. He has a great respect towards Indian Armed Forces. He always comes up with many new ideas along with government to help the families of the soldiers. He also started the Bharat Ke Veer app to help the families of soldiers. He is one of those actor who always help the government. Akshay Kumar has also received many awards in his acting career. He is also my favourite actor.",
            "review_date": "2021-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great movie",
            "content": "Akshay Kumar plays Lakshmi, a simple, uneducated man living with his mother, two sisters, and newly-wedded wife, Gayatri. A bit of an oddball in his thought processes, he makes it his life goal to produce low-cost sanitary napkins when he learns about the hard-up conditions that Gayatri and the women around him including his sisters, who have recently hit puberty live in, when it comes to menstruation. The religious aspect of the issue - where menstruating women are supposed to isolate themselves and live outside the house during the cycle (mostly in rural India) because they are considered impure - also bothers him, which is why Padman looks like it has been written with a complete contemplation of the issue. And, for a person, who has been exposed to high-octane, mindless Bollywood potboilers, this can come as a surprise.",
            "review_date": "2022-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not just another commercial movie",
            "content": "These kinds of movies should be directed to educate the people of thousands of communities in India which otherwise is hard to reach.Toilet ek prem kasha, pad man and like more taboo related topics should be explored and present it Infront of the audience in a movie format.Other than raising awareness, this movie also focussed on engaging audience through narration and comedy.",
            "review_date": "2018-11-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie",
            "content": "Very inspiring, it gives a strong message for everyone. From chasing your dreams to empowering women.",
            "review_date": "2019-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movie with Great Massage (Must Watch)",
            "content": "Padman is talking about true story of indian Inventor Arunachalam Muruganantham and his story of making a low-cost sanitary pad-making machine and his struggler in this journey to bring change in the society, Akshay Kumar has done brilliant job as Arunachalam Muruganantham to bring one of his best performance ever in Padman, Radhika Aapte as akshay wife has done excellent work, Sonam Kapoor how helps akshay in his journey is also good, film Director R. Balki have done excellent work, music by Amit Trivedi is nicely done with some good track like Aaj Se Teri & Saale Sapn, I liked every other thing about this movies be story, dialogue,supporting cast, there is also some funny moment in the film it is film full of entertainment. so I strongly recommended to watch such brave and Inspirational film like PADMAN",
            "review_date": "2018-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply Awesome",
            "content": "This is a too good movie and they have given a very good message and made the movie very funny as well.\nIts a must watch movie",
            "review_date": "2018-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Important but lacks focus",
            "content": "With such important subjects each time Akshay Kumar is trying to be a socially committed actor but most of them always stay short of being really effective. Here also the subject is important in the bigoted Indian society but the execution is just ok. The film lacks proper focus and the issue is still not addressed properly keeping it taboo and only reachable to an extent. The narrative is not at all consistent and the first half drags so much without making any point. But the subject and its reality are so powerful that when the film works it hits them hard. How the society reacts at each point just makes me ashamed of my country and even though I haven't directly seen such situations or people I can't deny the probability of such occurrences. Even though the subject is kind of approached superficially the importance and social effect of the film that can be felt through some of the moments in the film make it worth it.",
            "review_date": "2018-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece by Balki",
            "content": "Akshay Kumar has emerged as a role model of Bollywood in last few years.May be Holiday OR Baby OR Jolly LLB-2 OR Gabbar is Back OR Toilet Ek Prem Katha, he is smartly choosing the movies which will work as eye opener for the current citizens of India.The menstruation period of women in India is treated as a taboo and people refrain from talking on this issue as they think it as shameful.Even majority of Indian ladies either don't know about the sanitary pads OR they can't afford to purchase it from the market due to shyness.Akshay Kumar plays a character based onArunachalam Muruganantham, the person who is famous for preparing low cost sanitary pads for the women.Nice story-line and fab star-cast with a interesting plot and great message.Must watch for everyone.Even I want this movie to be tax free in the interiors of country to create awareness among peoples.",
            "review_date": "2018-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sooperaho!",
            "content": "Padman is impressive, simply since the subject is not an easy one to deal with. In fact, I'd say it's an impossible subject for an Indian movie. Kudos to Balki! He pulled it off in an absolutely brilliant manner. The Linglish speech in the UN scene could have fallen flat, but Akshay hits it out of the ballpark.",
            "review_date": "2018-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly inspiring movie",
            "content": "Based on the life of Arunachalam muruganatham, this is a real life story depicted on the celluloid and it is truly an inspiring movie. Many thanks for making this movie and telling this inspiring story so beautifully.",
            "review_date": "2018-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tedtalk",
            "content": "The movie would be complete if they show the tedtalk of Mr. Murganathan at the end.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sincere film",
            "content": "#Padman is a sincere film which discusses menstrual hygiene. It motivates ladies to use clean n cheap sanitary pads n ditch the traditional cloth. U actually see a mainstream hero wearing pink panties n bleeding, which is a refreshing sight. Performances by akshay, radhika n sonam r sincere. But the romance between akshay n sonam seems unnecessary. Since Muruganantham was from south, i see no point in changing the setting to madhya pradesh. Also the film clearly shows how pads can be sold at 2 rupees per piece. But where do we see such cheap pads in reality? The running time should be reduced by 20 minutes. Rating 3/5.",
            "review_date": "2018-09-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good Massage",
            "content": "Akshay did it again. No superstar will do movie about pad Akshay did it.\nStrongly recommended.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best film I've ever watched!",
            "content": "For me,the best film after Dangal.Akshay Kumar deserves awards for this sincere performance,",
            "review_date": "2018-08-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PAD MAN - Awesomeness",
            "content": "Real story of an Indian making Sanitary Pads at affordable price for Poor and underprivileged ladies.\nIts a power packed movie with a spice of emotions.\nAkshay Kumar is a real super star and delivers at par as always.\nA Must watch.",
            "review_date": "2018-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "More than Expectation.",
            "content": "Inspires lot of people.Great movie great message, people must watch this movie.Chase your goals money will chase you.",
            "review_date": "2020-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Oh, that was a lovely movie, indeed!!",
            "content": "Oh, that was a lovely movie! To take a subject such as this and make such a beautiful movie, indeed great! Beautiful direction, great editing, beautiful dialogues, great acting by the 3 leads, excellent film.",
            "review_date": "2018-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Go Padman",
            "content": "This is good movie for every Indian's ...must watch.",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A new way of love",
            "content": "This is just amazing of how a man can appreciate his woman, try to keep her safe .. love is great .. love is the major force to great inventions.. He neglected all taboos and silly traditions and women shame of natural biological phase in her life.. This is how a man should respect all women around him.. know their true needs and understand their feelings and finally always be proud of them.",
            "review_date": "2020-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie of 2018",
            "content": "Superhero!Yes he is true superhero.Hates off Akshay Kumar for this movie",
            "review_date": "2019-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only Akshay can do this",
            "content": "After Toilet ek prem katha Akshay is proved what kind of actor he is. Brilliant acting by all. R Balki did a good job as a director. Finally a inspirational movie.",
            "review_date": "2019-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inspirational to the Core",
            "content": "When Bollywood legend plays the role of a real life legend with Balki as the director, magic is bound to happen. Every minute of it is either feel good or inspiring. Race 3 and Dabanng fans can preferably avoid this masterpiece. I was crying throughout the movie - maybe because I was trying to visualise the struggles of the real PAD MAN!",
            "review_date": "2018-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie connected to real problems connected to womens",
            "content": "Must watch this movie very inspiring.Akshay kumar is real hero at the highest point of his career ,he is devoting his acting towards the country well being not like most of the actors for maintaing superstar image.",
            "review_date": "2018-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not brilliant!",
            "content": "Was it a biography or just a drama. The story was good although a taboo topic. The women menstruation issue is the strongest point in the film. Its alright if it were a biographical film. But it didnt felt like one.In reality women altogether feel very awkward to talk about pads or about their menstruation to opposite gender, whether be it her husband or father or son or brother. This is the reality. This issue is turned to a film. So the storytelling should have been more suggestive. But it is more raw in is representation and goes a little inclined towards portraying dark vulgarity. On the other hand if it were a biography then reality should been genuinely portrayed, instead it felt like fantasia among reality. Some of them are -----\n1. Lakshmi doing phone with no other enterprise information, orders his things to his village. Is it a joke?2. Lakshmi struggle in making the pad device felt like the easiest job ever.3. His talks in UN felt like a joke.Sonam is pure feminist keep on insulting Lakshmi whenever she gets chance. There are many dialogues regarding this. I rate 4 out of 10 only to the song Aaj teri. It is really good and soulful. Its tune also play through out the film giving a heightened feel.",
            "review_date": "2020-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "movei withe areal subject",
            "content": "Very good movei , somthing real frome akshay ilove it .",
            "review_date": "2018-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "What a great movie! It's a Bollywood movie, complete with song & synchronized dancing, that celebrates the true story of the inventor of a cheap sanitary napkin in India. I really enjoyed it and appreciated it even more when I realized that it's an (essentially) true story. The real \"Pad Man,\" when interviewed, relayed some how the core events of the story actually happened to him. What a movie!",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay America, why did India beat us to the movie about menstruation? Why do they get the male lead who is sensitive to womens periods while everyone tries to shush him like, \"We don't talk about this blood, Lakshmikant!\". \n\n\"Pad Man\" is worth watching on concept alone.",
            "review_date": "2021-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really interesting story",
            "review_date": "2020-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, great, great fell good story. It has a couple of scenes I dont think are filmed well but it is very enjoyable.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, factual, life changing story.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although R. Balki's \"Padman\" is brave enough to be Bollywood's actually the first mainstream film to even talk about sanitary pads, and boasts of a compelling performance delivered with heft and restraint by Akshay Kumar, ably supported by Radhika Apte and Sonam Kapoor, it's a bloated mess in it's technical front with mediocre writing, faked accents and far-from-rustic, tolerable-at-best film making. It's not unwatchable, but for most of the part especially in the second half, it's just too boring. Watch it only if you must.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1.5 stars for Radhika Apte's performance.  ",
            "review_date": "2019-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an amazing story, I am sure that it will get made into an English version. I loved seeing India from an inside perspective. I won't give any of the plot away as I didn't know anything going in. It is a beautiful story of a beautiful person. Highly recommend. ",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A socially important movie that has a good story and many warm moments around one manâ(TM)s struggle to make difference. Akshay Kumar is simply awesome.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is definitely up there in my list of top movies.It's a must watch movie for everyone.",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its really insipiraton for the women. Women must know about how hard man strugling to give his best for you.",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Padman,\" tells an important story in an engaging and entertaining way. I enjoyed this movie overall and really enjoyed Akshay Kumar's lead performance. His character is very likable has he only has the purest intentions to something good for society. The story was inspirational and pretty well put together. I do feel that the first half of the movie dragged mostly because it became pretty repetitive and it probably could have been cut a bit shorter. The movie does bounce back with a fast-paced and resonant second half that makes the movie worthwhile. It's a good movie with a strong message and a good heart that I enjoyed.",
            "review_date": "2018-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A to-the-point movie written & directed by R Balki, with classic acting by Akshay Kumar, Radhika Apte & Amitabh Bachchan in a special appearance. Sonam Kapoor has also done well. Music & background score of Amit Trivedi & cinematography to showcase ghats of Narmada to the New York city are worth-mentioning. It is a wholesome family-package.",
            "review_date": "2018-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Interesting Akashay Kumar Movie",
            "review_date": "2018-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was my favorite movie of this decade. Although I’m no fan of Bollywood, subtitles are not enough to deter me from a movie. I noticed that it was already given a very high rating and the plot line seemed interesting so I decided to see it. A beautiful story and well acted, I loved it and left the theater with a good feeling and enjoyed the uplifting message. Sadly there were few people in the movie house, but one day it should get the wonderful credit it has deservedly earned. GO SEE IT!!",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie about a sensitive subject matter",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pad man was beautifully filmed and well cast. I thoroughly enjoyed the movie and even more so knowing it is based on a true story ",
            "review_date": "2018-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an outstanding movie which deals with a very sensitive topic. To make a commercially viable movie on such a sensitive topic, it took a bold risk from King Kumar ( I think he's the best mainstream actor we have in India after Amitabh Bachhan) and the director R. Balki. \n\nThe movie has a brisk pace and doesn't deviate from the crux and in fact goes on to add more dimensions in its second half. All in all it's a brilliant movie and the landscape shown in the movie deserves special applause. While I knew Madhya Pradesh is that picturesque I am glad it was showcased even more beautifully.",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Padman is a story which can be narrated in a single line but the team behind this tries to add every ingredient to make this connect with everyone. Lakshmikant Chauhan (Akshay Kumar) is the man who wants to create pads for his wife and family. Being in the middle-class zone, the branded pads comes under the luxury section for Lakshmi's family.",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous. Moving. Inspiring. Simple. Courageous.",
            "review_date": "2018-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a Russian bot. Pad Man is a wonder light comedy and well worth searching out where to see it. My wife and I loved the story, characters, acting and photography. This movie earns a wide spread appeal and we are very glad to have seen it.",
            "review_date": "2018-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have seen in a long time. if it wasn't based on a true story I would be hard pressed believe that an ordinary person could do something so monumental to help humanity!",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am really impressed by Akshay Kumar's choice of Subjects . He is delivering not just great performances but great movies. A rare combination these days.  Padman deserves all the respect, love and appreciation. It tackles a subject that is mostly overlooked and not discussed. The journey of Arunachalam Muruganantham is simply amazing. And the movie does complete justice to portray his hardships and challenges.\nI haven't seen many movies like this one and I hope Akshay Kumar continues to deliver such gems.",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Movie!!!!  Akshay Kumar and the cast does an outstanding job in a very very realistic movie about getting Women in India to use Sanitary Pads and the resistance they face from the conservative society.\nVery Touching....Very relevant socially  and definitely empowers women to practice hygiene using Sanitary pads instead of soiled clothing.  Humorous and it sucks you in as if you are there with the actors.  A Must watch.  Keep such good movies coming.  A Great Family Movie.",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is an awesome movie.Loved every second of it ??",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just can't with Akshay Kumar...",
            "review_date": "2018-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gem of a film. Don't miss it :)",
            "review_date": "2018-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must Watch Movie For Village People",
            "review_date": "2018-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best indian film of recent times!! And Akshay kumar just lived the character and nailed it. Award winning film! Awesome!!!",
            "review_date": "2018-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Bollywood film with over exaggerated hero who does all good and has no flaws. Which is clearly not how the real Pad Man was. But liked it for the message it is trying to spread.",
            "review_date": "2018-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie that has been made in the recent times. Worth watching. If you have time the most lucrative thing too do is watch this movie. Inspirational and enjoyably both at the same time. Loved it.",
            "review_date": "2018-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing story. very inspirational!! it shows what the love a man has for a woman can accomplish.",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really wonderful movie.",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pulled effortlessly by one of the most versatile and sadly the most underrated actor of bollywood, this one counts as one of his best work! As original as it can get, R Balki's sheer brilliance is all over it!  Just Go, watch it and love it!",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4/5\nI liked the movie inspired by similar events. It's able to cover a sensitive subject with grace, Kudos to the film crew on picking up a topic, which while natural is still considered a taboo in our society. The movie is about a mans obsession in making a cheap sanitary pad.\n\nThe first half of the movie is on the trial and error of the first try at making a pad, the embarrassment and social ostracism our protagonist goes through.\n\nThe second half is about him reaching his goal and going a leap forward in taking it to the world. The joy of making a perfect product, popularizing it across villages and getting reorganized for it makes it's a cheerful watch. The addition of some great dialogues and humor only add to the watching experience. \n \nThe performances across the board were perfect, Akshay Kumar shines in his portrayal of goal obsessed manic, Radhika Apte is the perfect image of a rural housewife still stuck with its traditional beliefs & Sonam Kapoor is a breath of fresh air with her urban sensibility. \n\nPS: The movie is based on the short story The Sanitary Man of Sacred Land in Twinkle Khanna's book The Legend of Lakshmi Prasad, which is inspired by the life of Arunachalam Muruganantham, a social activist from Tamil Nadu.",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous mindblowing movie..",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that was needed to bring about a change in the thoughts of the society on a woman's periods. Love how the movie was weaved into something that gives out a strong message and is entertaining at the same time.",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked the movie, the message on a high level was visible and another great effort by Akshay through social films",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth Watching ...\nA Masterpiece from Akshay Kumar \nHe deserves National award for this one",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a movie this is revolution fantastic movie akshay Kumar acting is natural Oscar winning movie and performances love it every Indian must be watched padman thank you",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#Padman\nIt's #AkshayKumar and #RadhikaApte's show all the way. \nIt takes a subject that most Indians are reluctant to talk about and puts it on the marquee, and that alone is worth the applause....\nThat itself makes it a worthy cause to watch it, purely for the social message.\nBalki's Padman is an empowering film that gives you the wings, despite the odds.",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quiet ready for a Tampon movie",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great social message movie with no boredom. Everyone specially boys should watch this movie to understand what is mensuration. And it is based on a real life story so it becomes more exciting to watch the movie. So go and watch the move, your money will not be wasted. ??????",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I have ever seen. If we all had the heart of Pad Man  this would be a much finer planet. I'm a better person, having seen this movie.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "👏👏👏bravo Akshay Kumar, once you again you have chosen a subject matter that is truly inspirational! Great message, great and powerful film. My only criticism would be the editing of the first half, felt it could’ve been cut by about 15 minutes. I understand what you were trying to relay in the first half, but after sometime it felt too much and I felt okay let’s get on with the story. But, having said that once the story did move on, boy did it impress! The 2nd half was amazing! Great acting all around! ",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'PadMan' is a brave and an inspirational attempt to deliver awareness with entertainment.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it !! Such a emotional jerking movie ,definitely going to be watching it again !!",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must Watch. ⭐️⭐️⭐️⭐️ It is based on a true story. Akshay Kumar is a real super star. Its not easy to accept this subject. 👌",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, great concept, and loved askshay’s acting ...",
            "review_date": "2018-01-19",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 8.9,
    "rt_summary": "Lakshmi is a newly married welder who causes a stir in his East Indian village when he tries to revolutionize the manufacturing of sanitary napkins for women."
}