{
    "title": "Siberia",
    "rating": 4.3,
    "release_date": "2018-07-13",
    "num_reviews": 409,
    "genres": [
        "Crime",
        "Romance",
        "Thriller"
    ],
    "summary": "When an American diamond trader's Russian partner goes missing, he journeys to Siberia in search of him, but instead begins a love affair.",
    "reviews": [
        {
            "review_title": "Mostly wasted talent and potential.",
            "content": "My wife and I watched this at home, it was free from our public library. We like Reeves, he has been in many good movies. In this one he was also a Producer, in the DVD \"extra\" he even praised the script.Well we disagree, the script is mediocre and the execution is mediocre. It is never very clear what all is going on and who all the players are and what their motives are. Plus a couple of seemingly incongruent sex scenes are thrown in.My best guess is Reeves plays a man who deals in criminal diamond trades, has some legitimate blue diamonds and some fakes that can only be identified using a spectrometer. In Russia he has to deal with various guys who in the end seem to want him dead.So while I can't say it was a complete waste of time we certainly expected something better. The movie is flat, obscure, and dull most of the time.",
            "review_date": "2021-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I wanted so bad to like this film..",
            "content": "Ignoring the bad reviews this film was getting, I head to the cinema to give it a shot. The first scenes were okay, he's gotten into trouble, he's trying to find a friend otherwise he'll be in bigger trouble..Then all of a sudden he meets a girl and he sleeps with her in no time yet by the end of the movie he is willing to sacrifice himself and risk his life in order to save her.. So he basically found a woman in a village full of men and he managed to love her to death in 3-4 days? Also, Keanu and Ana Ularu share no chemistry whatsoever. Doesn't help that the writing didn't delve deeply into their characters in order to make us feel for them. By the end of the movie, I didn't care if either one was hurt because there was no depth. If you asked me to describe who Lucas Hill was I wouldn't know..Of course there were plot holes and the whole plot was kind of weak but what annoyed me the most were the sex scenes. I wouldn't mind them if the film was branded as erotic. But this one tried so hard to provide the viewer with everything: action, romance, drama and it failed miserably.",
            "review_date": "2018-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Does the bear ever get away?",
            "content": "Lucas Hill (Keanu Reeves) is the middle man of a diamond deal. We don't know much of the diamond's origin or if the Russians are simply laundering money. We do know something is a miss. Hill is in Russia and is given the run around. He meets Katya (Ana Ularu ) who throws herself at him like a Red Sparrow. The film consists of Reeves meeting people, traveling and having sex. Lucas Hill is silent like John Wick, but gets no respect. He lacks the \"cool\" of the typical Reeves characters. Symbolic bear hunt. It grows boring. Guide: F-word, sex, nudity (Ana Ularu)",
            "review_date": "2018-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What's it about?",
            "content": "After watching this film I'm trying to understand what it's about? Their was no substance to it at all. The acting was good for what it was. But not much more. The story was weak. I don't enjoy being a critic, but this one ..... not something I'll give another watch. I hate to say it, but it is a forgetful piece of work. I just don't see it ...",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Total nonsense screenplay full of plot issues. I've seen better writing from a 5th grader",
            "content": "The screenplay destroyed any potential this film may have had. The story is absolutely useless and unnecessary from start to midpoint. The remainder of the scenes where convoluted (especially the ending) and so dragged out - especially the lame sex scenes. I had to fast forward most of the long scenes as I was losing my interest and patience. What were the writers thinking? A 5th grader could have written this better. This film suffered an identity crisis; what is soft porn? what is a romance? was it a thriller? was it spy film? There was certainly no action or suspense. There where so many plot issues and more holes than in Swiss cheese. The cinematography was the main highlight, then the acting, and finally the directing was fairly decent, although the director should have demanded this film be edited down - especially the dragged out useless scenes to perhaps a short film. 104 mins was waaay too long for the pacing that was so ridiculously slow. The score was also annoying. As a huge fan of KR, this was a big disappointment and he should have passed on this one. A 3/10 from me only for the very few positive traits.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Quite a disappointing film",
            "content": "This film tells the story of an American man who goes to Russia for a deal of blue diamonds.The film starts off moderately good, but five minutes later it becomes horrendous. It becomes a romantic film, but there is no chemistry at all. They two characters do not seem attracted to each other, and their romance is contrived and unconvincing. After fifty minutes of romance, finally we get to see diamond related scenes again. Yet, these diamond scenes are just more excuses to have sex scenes. It just becomes quite ridiculous. The pace is slow, the story is implausible and the film just has no thrill or engagement. It is a plain bore, and does not captivate me at all. Frankly, it is quite a disappointing film.",
            "review_date": "2018-10-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "For People Who Can't Decide Between a Bad Love Story or Worse Action Movie",
            "content": "If you're looking for a film that makes a bit of sense, steer clear of Siberia. The only good news is that Keanu Reeves's acting wasn't the worst thing about Siberia. The story was so incredibly thin that if it were ice, one of those diamonds from the movie would have broken through. I could just see the movie bleeding out right before my very eyes when at 40 minutes there really wasn´t anything approaching a story, just some lame thing about green diamonds that may or may not be fake. \"I hope he doesn't have a micrometer,\" our hero states. Because what person buy tens of millions of dollars in diamonds would bother with equipment to very their purchase? This plot hole equivalent of not having cell phone coverage at a crucial moment, or finding an air duct in the back you can crawl through to escape (if this makes any sense, and it does to me).The final shootout was completely absurd on every level, most of all that it wasn't even necessary.And if the Russian woman doesn't want to perform oral sex on a gangster, she shouldn't show up uninvited to a party she has no business attending. This was such an incredibly stupid story line.I absolutely hated this movie.",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Siberia feels like you're sitting in a Siber (Cyber) Cafe neither sipping caffeine nor surfing the Internet. You...just...doze...off........",
            "content": "Siberia is a benign romantic action thriller with routine action and not much romance, which is pretty much what you can usually expect from anything with Keanu Reeves, a cast of Russians, and a walk-on by Molly Ringwald. Even in a summer of forgettable losers, this one disappears without a trace.No alleged action thriller about international intrigue that stars Keanu Reeves is likely to land on anybody's A list, but Siberia doesn't even try. This time the poker-faced stoic plays an adventurer named Lucas Hill who travels to St. Petersburg (Russia, you know) to sell a cache of blue diamonds from South Africa worth 50 million dollars to the Russian mob. When he gets there, the man who is delivering the gems has disappeared, so he moves on to the snowy wastes of a mining town in Siberia to find him.Instead of action, he hooks up with a waitress in an all-night diner, gets beaten up by local toughs, and rescued by the girl. They have sex with their clothes on, he wakes up the next morning and makes French toast, and just sort of hangs around. The audience hangs around too, waiting for something to happen. Threatened with mutilation and death by both the mob and the girl's violent brothers, his brows furrow. So much for acting. Instead, the girl's brothers take him on a bear hunt. Everything is tenuous, including a performance by Keanu Reeves that borders on catatonia. Just because he stopped shaving doesn't mean he can suddenly act.After he finally removes his Calvins, Siberia has more sex scenes than any previous Keanu Reeves movie, but the girl (Romanian actress Ana Ularu) is the only one who shows any flesh. Molly Ringwald plays his wife back home in the U.S., shown in only two brief scenes via Skype and long distance cell phone. Despite his limitations, Keanu's love scenes with Ms. Ularu are the rare stretches when the film threatens to come alive. Siberia looks properly deadly (no vacation destination or travel brochures here) but the film was shot in Canada. The romance grows cold while the plot grows incoherent, but nothing works out satisfactorily, including the finale, which looks like it was pasted on in post-editing with a Post-It.Formless and meandering, Siberia is a film without much purpose or promise. The direction, by Matthew Ross, looks phoned in from a toll booth in the Ukraine. The screenplay, by Scott B. Smith, who wrote the vastly superior A Simple Plan, is incomprehensible and abbreviated. One saving grace: a lively performance by a Russian gangster named Boris (aren't they all?), played with grinning relish by Pasha D. Lychnikoff, who has put in some memorable time as assorted rapists, smugglers and white slave traders on TV shows like Law and Order SVU. Needless to say, things end badly for all concerned in Siberia.",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "IMDB reviews ruined by Russian hack-fest",
            "content": "I can't recall seeing another film on IMDB reviewed as '1' with such frequency as Siberia. Nearly all the reviewers have only reviewed this film in their IMDB history. Many of the reviews are nearly identical. Looks like a spam farm was hired to trash the film. Why? Russians upset that they are portrayed as the bad guys?\nThe film is no masterpiece, but to give it '1' is ludicrous. Competently shot, acted and directed, the story keeps you wondering how much deeper the protagonist will go and if he will extricate himself. \nNo Keanu masterpiece, but not terrible either.",
            "review_date": "2018-08-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ugly and Boring",
            "content": "What a waste of time. A complete disaster with a good cast. \nReeves and mind tells you to be in a for treat and the movie goes on and you are waiting for it but it never comes. \nThere are no simple words to describe this movie but its a complete wastage of your time and it also carries some real disgust moments.",
            "review_date": "2018-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why does Keanu keep making these movies?",
            "content": "A nondescript run-of-the-mill (action?) thriller with stereotyped characters and a non-existent storyline. As always, Russia is presented as the cold and bleak land of slutty women and cruel gangsters. Everyone is morally corrupt and physically repulsive, even women. Does anyone really believe that the nation that gave us Dostoevsky, Leo Tolstoy, Turgenev, Pushkin and Lermontov consists of such degenerates? Hollywood keeps spinning out these propaganda pieces that are so badly made that fail on each and every level: visual, artistic, narrative, etc. It is now a well-known fact that CIA pitches scripts to Hollywood, but why would Keanu Reeves agree to breathe life into a still-born project like this one is beyond me.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terribly written",
            "content": "Keanu Reeves has made plenty of bad movies over the course of his career but this has to be one of the most disappointing. Reeves plays an enigmatic, rather shallow character who heads off to the titular locale to search for a missing person, only to instead start a torrid affair and get involved with some dubious characters involved in the diamond trade. It's slow and fragmentary in nature, with bursts of sex and action that add nothing to the story, a real patience-tester in every respect. Reeves looks like he's stepped off the set of a JOHN WICK movie but this has none of that film series' suspense or excitement.",
            "review_date": "2019-04-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BS stereotypes...",
            "content": "...from Soviet era, \"Cold war\" stamped, empty story about clean and smart American, forced to deal with those pesky, always drunk and irrationally brutal \"barbarians\" from Siberia. Fits the modern narrative from USA media and Hollywood propaganda machine. Seriously, Keanu? Soil your name with this cr*p? I bet you are not desperate in terms of finances. Also I heard that you are a great guy. What drags actors with nice personality into this kind of idiotic movies. Go figure. It could have had some tiny notes of exculpation if only it was made with some degree of professionalism and/or creativity. But it will be lost (\"like tears in the rain\";) among other tasteless \"movies\" about \"Russian mafia\". Too bad - I did expect something much more viewable than this. \"Yuge\" disappointment, Keanu. \"Yuge\".",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One word...crap",
            "content": "I watched this the other day...OMG...what a waste of time and electricity. I can't believe they even made this movie.",
            "review_date": "2018-07-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The price of greed",
            "content": "Siberia is a slow-paced romantic thriller that has received a surprising number of unfair reviews. While the movie is certainly no genre highlight, it convinces with solid acting performances, a gloomy atmosphere and a realistic story.The story revolves around an American diamond merchant who travels to Saint Petersburg in Russia for a big deal. Upon arrival, his contact person has vanished and the rare blue diamonds are also gone. A local gangster boss however insists on getting these diamonds delivered as quickly as possible and gives the merchant forty-eight hours to find them. The diamond merchant wants to save his reputation and travels to the Siberian hometown of his partner. He learns that his partner attempted to double-cross another gangster boss by trying to sell fake diamonds. The diamond merchant now understands that what seemed to be a perfect deal is a dangerous situation. Even the Russian secret service starts investigating. The diamond merchant however gets unexpected help from a cosmopolite café owner he falls in love with and a former South African trade partner. The diamond merchant must try to find his contact, get the deal done and cooperate with the secret service in order to leave the country alive.Siberia's main flaw is that the film is quite slow-paced before the final thirty minutes finally increase intensity.However, the movie convinces on several levels as well. Every scene has a purpose for the story. The bear hunting scene for example shows us how the café owner's brother starts to trust the diamond merchant and tolerate the relationship between his sister and the mysterious foreigner. The acting performances are convincing and honest. Keanu Reeves plays a calm and experienced man which explains how he could be involved in diamond trafficking but his insecure and tender side also shows that he is despising some of his partners and longing for a fulfilling relationship. The story involves numerous interesting side characters such as an intimidating gangster boss and a cunning secret agent. The settings of the movie are splendid and vary from one of the world's most beautiful cities with Saint Petersburg to rural towns in Northeastern Siberia. The story is complex but always easy to follow thanks to its smooth pace. The ending of the movie is unconventional but realistic and certainly offers some food for thought.The more I think about this movie, the more positive elements I find. I would recommend it to patient viewers with an interest in Russian culture. If you like slow-paced Scandinavian, German and British thrillers, you might also possibly like this movie. If you expect Keanu Reeves to play a similar role to his John Wick character, you won't find it in here. If you need thrillers to be fast-paced and focused on explosive special effects, you've got it all wrong. Siberia is a gloomy thriller that stands out with its unique style nowadays and focuses on character and story development rather than impressive action scenes and baffling plot twists.",
            "review_date": "2019-08-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "2 hours of my life that I'll never get back again.",
            "content": "This film can only be described as a badly executed porn film. The acting is awful. The plot has more holes in it than a strippers fishnet tights and for the first time ever I was rooting for Keanu to get his ass kicked. Please, for the love of god, do not waste your time watching this film.",
            "review_date": "2018-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A Siberian Romeo & Juliet? Really???",
            "content": "In the bonus segment of the DVD of \"Siberia,\" the artists described their film as a crime story alternating with a love story. Keanu Reeves, who starred in the film and served as producer, observed that this was \"a Romeo and Juliet\"-style film. But his character, Lucas Hill, who is swinging a major diamond deal with goons from the underworld of St. Petersburg, suddenly finds himself transplanted to Eastern Siberia, where he engages in an unorthodox, adulterous love affair with Katya, the proprietor of a café.It is difficult to figure out what the film artists thought they were achieving, even as they attempted to explain it in their interviews. And it was impossible to see the Romeo and Juliet saga of young love with a character in his early fifties engaged in a stormy love affair with a woman who asks him to call her by the name of his wife during their intimacies!The crime story involving the diamonds never seemed to mesh with the curious love connection of Lucas and Katya. The character of Lucas became more and more repellent, as he progressively placed Katya at risk with the diamond thugs. It was never even made clear if Lucas himself was a criminal working the black market, or if he inadvertently became enmeshed in a dangerous, untoward transaction of the diamonds and was betrayed by his partner.Somehow, the filmmakers were able to say with conviction in the bonus track that by the end of the film, Lucas finds \"redemption.\" But that was not at all what was conveyed with his constant lies to Katya and his self-destructive march into oblivion. Despite an actress with some charisma, who played the role of Katya, it was never believable that she would be languishing in an Eastern Siberian café waiting for a married American diamond salesman to sweep her off her feet. And it certainly was not a tale of woe about Juliet and her Romeo!",
            "review_date": "2018-09-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Thin story, Forgettable movie",
            "content": "Siberia leaves one with the impression that the movie was ended because the story line just ran out and there was no more scenes that could be filmed. \nAnd that everybody concerned at that stage wanted to go home anyway. \nThe bit of story that is had up to then, was anyway full of holes and quite frankly lost credibility round the halfway mark.\nReeves walked into the movie sort of OK and walked out sort of OK.\nAna Ularu walked into the movie very sexy and walked out very sexy. \nBut without a story, that was just about all that it was.\nPity about the three or so totally unnecessary sex scenes. It every time broke the anemic tension that was built up, mainly through Reeves' worried look. He is actually good at doing that. \nBut for crying out aloud, the man needs a story to function properly....\nIn the end a waste of time. Don't bother.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Yawn festival",
            "content": "Boring. Flat. Awful. The cure for insomnia? Maybe the worst Reeves movie ever. I gave a 2 out of 10 to this piece of junk because the beautiful images of Russian landscapes.",
            "review_date": "2018-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Too much movie, not enough plot",
            "content": "Siberia (2018), starring Keanu Reeves, has several strong elements, but also several significant problems. The film is about 40% romance, 30% crime thriller and 30% moody, brooding scenes that move at a glacial pace. The romantic interest is played by Ana Ularu, who played the ruthless and remorseless assassin in Inferno (2016). Ularu is more of a chickflick heroine than a Bond girl. She's attractive in a girl-next-door sort of way, not like a fashion model or femme fatale. Feminine, but not voluptuous or statuesque. Young (32) but not so young that a romance with Keanu Reeves (53) seems scandalous. She has a look that women can admire without feeling threatened. If the role had been cast with an actress resembling a young Jane March, still 19 from her role in L'amant (The Lover) (1992), the dynamic would have been entirely different. Sammy Sanchez described Jane's look thusly, \"Jane radiantly rocks this effortless belted neutral shift with a pair of braids and a classic straw boater hat for a classic combination that is both timeless and Lolitaesque without being for lack of a better word, hobaggish.\" By contrast, Ularu's Katya is initially seen in frumpy, oversized men's work clothes and boots, although she later appears in full flash and glitter for an ugly duckling / swan transformation. The audience can instantly understand the fascination and obsession that Jane March's unnamed young girl inspired in L'amant, and Rose incited among various characters in The Color of Night (1994). By contrast, the filmmakers did everything possible to make Katya seem ordinary, unappealing and standoffish, even giving her a fiancé and an overly protective brother with several very large friends. For Keanu's Lucas to put his marriage on the shelf, ignore his perilous circumstances and his partner's recent defalcation, defy Katya's imposing and threatening extended family and the exigency of his business in Siberia, he needs a compelling reason to find Katya more than attractive and truly fascinating. Instead, we get mildly provocative unexpected one-liners. Do you think I've never seen a penis before? If I asked you to sleep with me, would you?Perhaps this is the fate of celluloid romances in an era dominated by #MeToo, the PC Gestapo and feminazis. Characters once played by Mae West, Marilyn Monroe, Jayne Mansfield, Brigitte Bardot and Raquel Welch are considered politically incorrect. Barbarella's Jane Fonda has become an outspoken feminist. Self-anointed experts, who apparently don't consider Zulu Chief Shaka a real warrior, complain that real warriors don't dress like the Amazons in Wonder Woman (2017). Lucas is expected to fall hopelessly in love with Katya because she is a strong, independent woman, who doesn't need to dress sexy to attract men, and decides if and when she will have sex. There are several sex scenes, although most are more-or-less fully clothed, including a slightly kinky bros-before-hos scene with four participants and several casual observers. For various reasons, the romantic story never seems credible. Unfortunately, the crime thriller doesn't make any more sense than the romance. There's two MacGuffins - one real, the other fake. It's not clear who has the real one or what financial impact it has on Lucas or why the gangsters are ready to kill him and others for merchandise they haven't paid for. Understanding the plot would probably require viewing the movie about three times, but it isn't sufficiently interesting to warrant a second viewing. Performances are good, particularly by some of the supporting cast. Production design is more than adequate to make Canada look like Siberia. Some of the cinematography is quite good, while many shots are marred by reliance on jiggly-cam, which shatters the willful suspension of disbelief and constantly reminds the audience they are viewing the action through the lens of a camera. The film often drags. Motivations are unclear. Consequently, the characters are not very interesting or sympathetic.",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stupid",
            "content": "You think something is going to happen it's got a great actor in it. And nope it's just terrible",
            "review_date": "2018-07-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Only one word describes this film : Flat",
            "content": "Flat script, flat directing, flat acting. Ingredients that made this film slow, boring and for only viewing it in fast forward mode. I don't know why Mr. Reeves accepted to participate in it. I guess for paying some bills. A complete flop.",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Quite a mess and nothing like the trailer portrays",
            "content": "I hate anticipating a film based on the trailer, and then getting a totally different experience when watching the film. The movie is nothing like the trailer portrays it. The plot is never flushed out, characters aren't developed, tons of loose ends throughout the film, and an awful ending. There were some things that kept me intrigued enough to stick with it to the end, but then I was thoroughly disappointed, as the story really never went anywhere.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "He should have paid to keep the movie in the can instead of ruining a good career",
            "content": "I really can't remember a recent movie so embarrassing to watch. Excruciating to say the least.",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Sluggish...",
            "content": "I went into this expecting a little bit more action, so maybe my review is biased in that way. Spoilers ahead.Keanu, sporting a John Wick hair/beard/suit&tie combo, is very obviously not John Wick in this movie, although you could be forgiven for thinking he had walked straight off the JW set and straight onto this movie without a wardrobe change.The romance (or attempted Last Tango in Paris) angle wasn't strong enough to endure, and Keanu's new girlfriends mental health must be brought into question for some of her actions through the movie. Quite an odd situation for sure.If the premise had simply been. Keanu meets girl, girl gets kidnapped by nasty Russians (the new movie nasties), Keanu does a martial/gun training montage, then goes in for the rescue, I would have been fine if he didn't make it after a valiant effort, but at the end of this movie I really expected Keanu to wink at the camera.Despite enjoying most of his previous outings, here we have poor pacing, poor actor engagement, poor script, unconvincing dialogue delivery, and no pay off at the end. Like I said, I could take him not coming out of the situation alive, if the rest of the movie had stacked up.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "so sad this wasn't good, because I love Keanu's movies",
            "content": "I was really looking forward to watching this movie, but I kept waiting for it to get going. There wasn't much of a story, it was very basic, and virtually no action which is something i expected. I know actors sometimes appear in movies for friends, and I just wonder if this was the case for this one. This is my first review. I had to get off my backside and make a review because I usually read and get really annoyed when all the 10/10 appear on a movie that clearly isn't. I will be reviewing more.",
            "review_date": "2018-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I was going to ask for a refund at the but my GF stopped me!",
            "content": "Worst movie I have ever seen in a cinema. Looks like Keanu was owing something to someone. Don't get curious and waste your time.",
            "review_date": "2018-07-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ummm...",
            "content": "I honestly cannot think of a movie that is worse than this one. It is boring as hell and the storyline doesn't make any sense. A high school student could produce a better film.",
            "review_date": "2018-08-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "save your time",
            "content": "Do not watch this movie. One of the worst endings I have seen. The movie was a constant build up to a failed ending. Wish i could get the last 2 hours of my life back.... this is not a movie i could have seen Keanu in. I wish he wouldn't have been in it. It is a smudge on his record. Any way if you proceed to watch you have been warned.constant build up for a 5 minute shoot out that ends with him being shot in the throat from behind with a shot gun..... Where was that pistol Keanu.... WHERE WAS THE PISTOL?????",
            "review_date": "2018-07-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What?",
            "content": "This is one of the dumbest movies I have ever seen. So curious how did Keanu accepted to play in this movie. No consistent story, some insane ideas and definitely waste of time.",
            "review_date": "2018-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't mix with Russian Bears",
            "content": "It could have been something worth watching, but alas the story is kaput before the film starts. The plot goes all over the place and in the end you get what's due to you. Perhaps women and bears don't go well together.The movie is only worth a rating of 4 solely because the story is so poor.",
            "review_date": "2018-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WTF was that, Keanu?",
            "content": "Once Upon a time there was Matrix. And then, there was nothing...",
            "review_date": "2018-07-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu followes cage?",
            "content": "It's not a thriller or a suspence movie, it is not a love story, it's a very little bit all of it, the rest is a story about how russians live and behave. well, according to the script writer anyway. Keanu is terrible, the man is uncapable to show emotions - and here he need to, as it is basically a love story, the porn parts are ridicilous. One reason to watch this is the OK performances of the russian actors, all of them are quite good, i live with russian 20 years now and the movie portrays the people of the specific areas not bad. This film has no meaning, you will learn nothing from it - but it is watchable.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "104 minutes could be better spent reading the phone book.",
            "content": "How a film this poor gets made is beyond me.Dreadful attempt at a plot.\nAbsent character development.Canada as Siberia? Almost funny.The two stars are for beautiful St Petersburg - about the only thing worth noting in this sorry excuse for a film.",
            "review_date": "2018-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Half a movie no real story",
            "content": "I adore Keanu Reaves, but this movie simply doesn't work, the main actors are good, but the rest of the storyline and cast is virtually no-existent. There is little tangible evidence, there was a decent script or any idea behind the movie. Waste of time 3/10",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stupid",
            "content": "One of the stupidest movies I've ever seen, the plot doesn't make sense and the characters have no depth. Acting is cringe. Storyline is disjointed. Bad all around.",
            "review_date": "2022-03-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I literally went and watched John Wick just to trying to erase what i watched in here",
            "content": "I mean it's Keanu and all,, i love the guy ,, but man this was a bad choice for him to do this movie.\nThe plot of the movie is all over the place ,, diamond ,, fake diamond ,, blue diamond .. i mean things got messy ... overall it went 80% dull and maybe around 20% the action/drama/crime genre to cover ..final thought, go re-watch \"John Wick\" instead of wasting your time on this one.",
            "review_date": "2018-09-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Most Negative Reviewers Didn't Get The Ending They Wanted",
            "content": "I'm trying not to give anything away here but I'm quite annoyed at the number of reviewers who are giving this movie a 1 rating. The acting was decent, the story was decent, the directing and photography were decent (even if nothing was really outstanding). Some people said it was too slow but I think the pacing was very consistent and helped set a certain mood. There are hints in the movie as to how it might end - but some people clearly weren't happy that they didn't quite get the unrealistic western action hero ending they would have preferred.The movie is a decent 6 and, even though I also was hoping for a different ending and felt cheated at first, I then realised the actual ending was the right ending.So ends my review.",
            "review_date": "2018-09-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible film. I guess Keanu owed someone a favor.",
            "content": "This ranks up there with one of the worst movies ever. The storyline is so vague you never have a clue what is going on. The movie is supposedly about a diamond dealer, but there is no back story. He then gets involved with a Russian woman, but even that relationship is burdened by the lack of a story line. In the end he makes a horrible diamond deal and tries to fight off the Russian mob with a bolt action hunting rifle? Just makes no sense. \nHow any group of people watched this and thought it was good enough to bring to market I will never know.",
            "review_date": "2018-07-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time",
            "content": "This film was agonisingly painful to watch. Even the sex scenes were non eventful.",
            "review_date": "2018-07-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So sad to see such a good actor stoop so low.",
            "content": "This film reminds me of the flop that George Clooney made called \"The American (2010)\" eight years ago. It seems that when good actors get old they turn bad. If it wasn't for Ana Ularu the film is literally a waste of time. If I wanted to see Ana Ularu there are other movies she has played in which are must better.Other then the bad acting there is the terrible script. You expect something to happen and it just doesn't happen. The movie has such a poor plot without any twists to keep you interested. Especially the ending... oh my God... anything else other then what they did would have been better.Sorry.. Keanu Reeves, but you are a disappointment. Especially after Johnny Mnemonic (1995), the Matrix (1999), and Constantine (2005).",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "unexpectedly bad",
            "content": "As seen in reviews no one expected this bad movie. scenario is not clear. you dont even understand what is happening and why is happening",
            "review_date": "2018-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A little on the weak side for Keanu Reeves",
            "content": "Keanu Reeves makes a very good dramatic thriller.It's a slow burn that takes a while to get to the punchline but it's a good punch line.Reeves plays a dude who works as a diamond trader. His partner disappears and is on a journey to find this cat, which leads to an affair with a Russian woman.It actually helps how much I like Reeves, other wise the film would not be that good. It does have some great cinematography, basically a great picture to watch.",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad",
            "content": "I love Keanu, but I hated this movie. I just kept saying..why? I should have stopped watching.",
            "review_date": "2018-07-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Only for the Sex",
            "content": "A terrible movie. Slow; pointless. The only redeeming value were the sex scenes. For essentially clothed sex they were well acted and convincing.",
            "review_date": "2018-07-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very poorly directed movie",
            "content": "I had very high expectations from this movie. But movie is very slow. There is no thriller or good action neither drama. Movie ends in weird way. It doesn't make any sense to watch this movie.",
            "review_date": "2018-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "As cold as its title",
            "content": "SIBERIA features Keanu Reeves as an international diamond dealer in a stale marriage (to Molly Ringwald - underutilized) whose trip to the former Soviet Union finds him in love (with a sensual cafe owner) and in peril (with ruthless Russian gangsters). Reeves can really hold the screen - - the guy's a true movie star - - and he is the movie's primary asset. But the screenplay lets him down. The film is long, tedious, not suspenseful enough, and ultimately nihilistic. The ending is so relentlessly downbeat it amounts to a big middle finger to the audience. 5/10",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "You're idiots",
            "content": "This isn't an erotic action thriller. It's not about guns and diamonds or Russian mobsters. It's a story about two people in loveless dead-end lives who don't care anymore. Then as improbable impossible as it can be they meet and get the tingle the flutter the feeling inside that rarely happens and they never expected to have again if they ever did. You know from the beginning that Lucas will die or maybe half way through its Katya who'll die and Lucas will have to live with it. Siberia is destined for tragedy from the beginning but for a few fleeting moments two people forgot the dreck their lives had become and loved and imagined something wonderful until reality took over and killed one and destined the other to a living death. Maybe watch a movie between the lines and look deeper for meaning instead of expecting to be spoon fed everything.",
            "review_date": "2019-10-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Action packed thriller... NOT!",
            "content": "This masterpiece will have you:A. Wishing you had read the reviews before watching it!B. A gun in your hand to put yourself out of your misery. C. All of the above.",
            "review_date": "2018-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just dont",
            "content": "Dear Lord, what a piece of junk...\nI get it, can't be that bad with Reeves right? Guess again.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring thriller",
            "content": "Despite a dedicated performance from Keanu Reeves and premise with some potential, Siberia is a surprisingly boring thriller with a dumb plot, really bad supporting performances, some laughably poor dialogue and an abrupt and terrible ending. Even at under two hours, it still manages to feel overly long.",
            "review_date": "2019-07-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Slow",
            "content": "Could this storyline have moved any slower? No spoilers because I never reached anythig worth spoiling!",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ignore the ridiculously low ratings!",
            "content": "Okay, whilst I wouldn't call this a masterpiece, I found this pretty enjoyable and it had a suspenseful moody atmosphere to it. Why it received so many 1s I'm not sure, but starting to think it is a conspiracy and not a genuine reflection of everyone that has seen it's opinion. I have seen some truly dreadful films in my time, but this is not one of them by a long stretch!",
            "review_date": "2019-05-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Completly waste of time!",
            "content": "Keanu Reeves is one of my fav actors, he's very talented and a very simple person, not likeall the glam-stars at Hollywood. But regarding this picture, a total waste of time, money, cast - everything. 1star and this for the actors and the crew that endured the cold weather out there. Otherwise, crappy movie! Avoid it!",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "thought there would be a twist, but it never came",
            "content": "I am a keanu fan, but this movie was terrible. Very dull pace with dry acting and moments of possible excitement that end in disappointment. I kept thinking there would be a twist or some big change that would wrap the boring plot together, but it never comes and then you realize that you just wasted an additional 45 minutes for nothing. It also feels low budget in that the supposed Siberia looks more like winter in Kansas.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie i have seen in ages",
            "content": "Keanu has written the end of his career by this boring low level, low budget and low in every kind of way movie.\nDont watch it is a waste of time.",
            "review_date": "2018-07-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "HORRIBLE!",
            "content": "The whole movie was terrible. Was waiting throughout the entire movie for some action or twist but nada. The ending? confirms how horrible the film was. Seriously Keanu, did you guys even have a focus group to see what they thought??",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good movie",
            "content": "This movie is very good. The haters are mad because he died plain and simple.If they could not see that was how this would end at least 30 minutes before the end then they need help. It was the only way this was going to end. Everyone in this film did a great job of acting. I saw reviews that stated this was hard to follow or poorly written which is not true.This is a good movie and well written and great acting. So sad that so many people are so bad at understand and appreciating a good movie.",
            "review_date": "2021-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful waste of talent",
            "content": "Slow boring piece of mess. No action. No chemistry he looks awkward during the sex scenes. No chemistry. The ending was like wtf.",
            "review_date": "2018-07-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I don't understand what happened... but yet I liked it.",
            "content": "\"Siberia\" (2018) is a strange one, I left it knowing about as much as I did going in to it. Keanu Reeves is diamond seller, I don't know if what he does is illegal or not because the movie doesn't explain it. Anyways, he goes to S. Petersburg to sell some diamonds but his friend screws him over (I think) and he's forced to go to Siberia to get his diamonds back.That's a very condensed explanation of what happens in this movie but that's about as much as one needs to know going in to it... and that's about as much as I know now.This movie has so much potential it's crazy, first of all, it has Keanu Reeves in it so that's already a plus, and the storyline is genuinely interesting until the \"romance\" subplot comes in. I'm putting \"romance\" in quotes because it is so bad I almost threw up. Seriously, the lines are so bad and the sex scenes... oh dear God the sex scenes. I was perplexed at them, why are they there. WHY? ARE? THEY? THERE?!It would have been so much better if the female love interest would have just been cut from the movie because, without her there is a genuinely good movie here.Basically, this movie is an enjoyable waste of time, with some great scenes splashed in there and a great ending sequence, but, in the long run, the romance and the fact that the movie doesn't give answers to the questions it poses makes this movie a tremendous waste of potential.D+",
            "review_date": "2019-12-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "AWEFUL Worst movie I ever saw. I want a refund for the rental",
            "content": "Absolutely the worst movie I have ever seen. The ending will leave you saying WTF, and you wouldn't believe it was over. The whole movie is about chasing his friend to get these diamonds. Which you never even see his friend or the diamonds or what happens to either of them. You keep wating for something to happen yet it never comes.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A terrible betrayal of people trust as a viewers. Bad on every level.",
            "content": "Movie \"Siberia\" It is a terrible betrayal of people trust as a viewers. Miserable bad people of course, bad pervert sex scenes you want to cry, people without dignity and courage, stupid and drunk. It told everything about people who write it and nothing about Siberia. \n Hollywood lately thinks it can feed audience with anything and people gonna eat it with a spoon. I am from Siberia, born and raised. There are TVs in Siberia and we can watch it and expose it for what it is. It's about portraying people disgracefully.\n The writer himself, his is from New Jersey, so he should called that movie \" New Jersey, Summit\" he obviously wrote a story about his life, nobody would have any questions then.\n I didn't feel for any of the characters. Main character played by Keanu Reaves is a coward and doesn't have a spirit, a girl in a movie came off as silly and rude, with no self respect. Other characters, i din't know what are they talking about, they thought they speak Russian. \n Scene where so called \"mafia guy\" wants to be a \"blood brothers\" in reality, simply means that both man should cut their hand palms with a knife, mixture blood during the handshake, this is how you become a blood brothers. Here was portrayed as pervert sexual act instead. From what dark imagination it come from???? \n Why it always need to be something pervert to bring people attention. What does it say about scenarist and script people. Scott B Smith, the writer should be tested by a mental health doctor before he express his demons into public. \n Language used in the movie is not Russian, it's painful to watch, faces , mannerism, clothes? I felt awkwardness for all the characters in the movie. Brainless dialogues, I don't know what nationalities people are in the movie. \n Funny thing, location itself: Mirniy town, where the most of the movie takes place is not in Siberia. It's Republic of Yakutia. DIFFERENT GEOGRAPHY PLACE. What it has to do with Siberia what so ever? Maybe the stereotypes of drunk, dirty people, that promoted in this movie. Of course, what else well paid movie producers know about other country, just that.\n It was good decoration and photo montage though. But it was spoiled when camera captured big faces saying stupid things in a close short. I didn't continue to watch it. \n Writers who made this movie, don't know nothing about this place. What it shows, their personal miserable stereotypes, maybe their own psychological problems, nothing else. Siberia is big a place with great nature, kind people with a good sense of humour and mostly well educated. There are of course exception like in the rest of the world. \n They should have chosen a different name for the movie. I understand people want to make money with fast production and want to bring attention with mysterious names. Guys, just don't follow for that. It is a low vibration movie that will give you bad emotions, if you are healthy person. \n It could have been a story with inspiring figures, such a waste.",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disappointing to say the least",
            "content": "Siberia seems like a missed opportunity to introduce the viewers to an emotionally involving, slow-paced, old school movie. The result is instead a dull, painfully slow, cheap mix of a thriller and romantic story without the strength for delivering in any of the two. It's an over 90 mins wait for something which is unclear, and which eventually does not happen anyhow. The diamond story starts well, but half way through becomes flat, losing emotional depth and failing to develop a sincere connection between the audience and the characters. It gets almost predictable. As for the romance, without even trying to avoid an old tired cliché, Katya is just a girl living in a remote Siberian village who falls for the foreign and starts following him around no matter what he does and how much he uses her, and whose dignity and worth as a woman reach a dreary low during a scene. The intimate scenes poorly reflect the bounding, the 'building the moment' and reciprocal trust, both Keanu Reeves and Ana Ularu highly talked about in their interviews. There is no passion between Lucas and Katya, especially from his side, and his love/obsession for her does not come through. \"...and this is a problem, I assume\" says Katya. Given that the movie is sold as romantic thriller then yes, it is! This is not John Wick and does not want to be that type of movie either, but Keanu Reeves seems to be struggling to become someone different, up to the point that he is overwhelmed by Pasha Lychnikoff when on screen together. Molly Ringwald's talent is completely wasted. Ana Ularu is an experienced actress but her performance, when she's not busy kissing and/or groaning, is arguably enhanced by that emotional rigidness Reeves is (sadly) well-known for.All in all, the film fails to deliver whatever the director, the writers and Reeves had in mind - Love story? Thriller? Romantic drama? A crafted opportunity for Reeves to test himself against intimacy, passion and emotions?1 star for the supporting cast",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Refreshing & grown up",
            "content": "This is not a shoot em up Hollywood movie with the same old, same old predictable rubbish with which we're all getting bored.This is a movie with good characters and a more sophisticated plot. It is not fast moving but involving.Not worth spending big money on buying/renting but good enough for an evening's watch.",
            "review_date": "2018-11-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "And I thought the John Wick movies were bad",
            "content": "\"Siberia\" is a brutal movie to watch. I often find myself for some reason sticking up for Keanu Reeves. He's an easy target. But Reeves is pretty bad in this movie. He's too young to be mailing it in like he does in \"Siberia\". The movie itself is so boring it seems that nothing happens for hours on end. The \"love scenes\" are not worth the trouble. The worst scene is the \"blood brother\" scene. My hand kept inching toward the fast-forward button while watching \"Siberia\".",
            "review_date": "2019-01-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It keeps you watching",
            "content": "It's not often I recommend a film about nasty people in nasty situations but here we are. Firstly it's a good story, simple greed the back story to which slowly gets revealed although only in sketch form. Secondly it is very well shot and produced, nothing over done just dare I say very classy. Maybe this film should have been called no way out as it soon becomes clear that every event reduces the chances of a good outcome. No spoilers, no mystery sub plots just a warning, if you want to play with bears............",
            "review_date": "2019-05-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The most dummiest US movie",
            "content": "Come because of K Reeves and totally dissapointed. The worst movie that i havd ever seen in my life, even worse than the bad bad one ( that i belief the worst before) BFG. Whole the film takes you around and round with all non sense details and stories, with the dummy philosophies and quote (perhaps from the stupid writer) between guy and girl, between us and Russia, between a bit of FNB and gangs. Need the refund and time compensation rite now. Very mich doubt about the John Wick 2 from KR.",
            "review_date": "2018-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "dont plz",
            "content": "Empty story waist of time..........................................................................................................................",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie is not for everyone.",
            "content": "I can understand why probably most viewers will rate this movie low. This one is not for everyone. It's not to watch with your family or in a bigger group of friends. You will understand this movie and see it's little details and appreciate them when you are at least 30 something years old. This movie is not about crime - it's about love and man-woman relationship. I would say this movie is at some point closer to Bertolucci \"Last Tango in Paris\". The way the actress looks at Reeves in particular scenes you will immediatly understand what I mean.",
            "review_date": "2018-08-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "suspenseful and action packed; is NOT a \"porn\" movie",
            "content": "Suspense, action, and pretty scenery. Not saying it's the greatest movie in the world; but it's entertaining and suspenseful. I am mystified by the many poor reviews, and by the accusations that this is \"soft porn;\" no, no it's not. When people review the Sopranos and complain that there is mob violence; that is as much sense as some of the low reviews make. I dunno if a religious church group went to go see this en masse or what; but it's a decent flick.",
            "review_date": "2019-11-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Does no one review a script anymore before turning it into a movie?",
            "content": "Keanu is Lucas some diamond dealer who is told by one of his providers, Pyotr, to travel to Saint Petersburg for a deal involving a dozen blue diamonds. When he arrives there, there's no Pyotr. Still Lucas gets in touch with the buyer Volkov who is some dangerous mobster apparently. Days go by and still no Pyotr. Lucas is told that Pyotr's brother is in some Siberian mining town so off he goes. This guy only tells him that these days some new high-tech fakes are out there indistinguishable from the real thing. In the town Lucas also meets the lovely Katya who runs a cafe. Lucas gets beat up but the locals but he and Katya get involved even though she supposed to or about to marry some guy. There is some fellow diamond guy, a South African, whom Lucas keeps calling, who eventually warns him that the FSB has his eyes on him.The day of the deal he travels back to Saint Petersburg with Katya, where somehow one blue diamond appears (right). Back in the mining town there also appeared a blue diamond, but that one was fake. Volkov accepts the sample as a gesture of good will and invites Lucas to party. Katya shows up uninvited and has to pay the price by getting involved in some kinky display of brotherhood between Lucas and Volkov.As Lucas and Katya return their their hotel, the FSB is there. They make a deal with Lucas. He has to sell the fake diamonds to Volkov and he and the girl will be spared. He accepts and by coincidence and thanks to their status as \"brothers\" Volkov takes the diamonds without thoroughly checking them. The FSB gives Lucas a ticket to leave. At the airport of course dummy changes his minds, calls the South African to buy him some time, returns to the town to see Katya and also look for Pyotr who bought some peace of land in the town. Lucas, Katya, and her brothers go looking for and find Pyotr's corpse. Then they all leave except Lucas who has to look inside the house, who knows why. By that time Volkov's guys arrive, who knows how.When Keanu isn't making kick-butt movies he's making lame movies like this or Exposed. The story as I told it isn't half as bad. But it's drawn out about 20 minutes longer than necessary. And the focus isn't so much in that story but on his relationship with Katya and her family. Which again, shouldn't be an issue, a crime thriller romance, should be doable, but not at this uninspiring pace and with this many plot holes. With movie productions becoming globalized a strange phenomenon has surfaced, that of the embarrassingly sloppy script, typical of Chinese-co-productions. Here the Chinese aren't involved as far as I know, but they might as well be. This leads to the irony that apparently for Hollywood, US audiences are more discerning, even though all movies receive global distribution, but when production is also global things start falling apart.Movies that try to box in their characters into completing some acts in face of danger are always annoying. Nothing was keeping Lucas from leaving the country when he could, from not entering the house at the end, or for that matter, not even attempting the deal once Pyotr was a no-show day after day. As if characters in movies completely lose their sense of self-preservation. In any case, add to that the unsatisfying ending and you have a movie that you leaves you very disappointed. A shame because Keanu is always likeable, Ana Ularu is a revelation and a hottie, and an old-fashioned story involving the dirty diamond business should make for a good movie. Siberia unfortunately isn't that movie.",
            "review_date": "2018-10-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Decent enough, if rather slow paced, downbeat thriller",
            "content": "Lucas Hill is an American diamond merchant who has flown into St Petersburg to facilitate the sale of a dozen blue diamonds to a somewhat shady Russian named Boris. Unfortunately when he gets there the man who was meant to bring the diamonds is nowhere to be seen. Boris is unimpressed at being let down; Lucas promises he will have all the diamonds in two days. To this end he flies to a remote mining town in Siberia where he learns that there is a problem with the diamonds. He also meets Katya, the owner of the local café; the two of them soon begin an affair; something the men of the town aren't impressed with. When he returns to St Petersburg his troubles have increased and he is about to upset some very dangerous people.Having noticed that this film has less than five stars here on the IMDb I didn't expect much; perhaps those low expectations meant I enjoyed it more than if I'd expected a better film... either way I did enjoy it. The plot does move at a fairly slow pace but manages to be tense when it needs to be. Amazon described the film as 'John Wick meets Le Carré' but anybody expecting John Wick will be sorely disappointed... a couple of drunks would never put John Wick face down in the snow needing to be saved by a woman! The only connection is that Lucas is played by Keanu Reeves. Reeves is good in the role; the rest of the cast are solid enough although I'm not sure what a Russian viewer might think as most of the Russian characters are played by people from elsewhere. The film could have done with a little trimming; we didn't need numerous sex scenes. Overall I certainly wouldn't say this is a must see but it is decent enough; certainly better than I expected.",
            "review_date": "2021-07-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very soporific movie, no depth",
            "content": "I'm bored with this movie, but you have to admit, it's a very bad movie. The scenario has no substance, but what are we really talking about? Well, everything and anything, the boredom came very quickly, conclusion he's just dull. Keanu Reeves (who for me is an excellent actor) unfortunately can't save the film, he is very fair and very touching.\n Ana Ularu that I discovered is unfortunately very far from equaling it, she fails to make a character who is drawing and many mistakes on his part does not help. Great lack of presence, but perhaps it is due to his career (a thin filmography) hope that it improves.990/5000\nThe film is very distant, I had no compassion (just for Lucas;)) because the expressed feelings are without depth, Matthew Cross films a lightness close to the Abbyss, no line conductive and especially that of errors, when for example Lucas arrives in the bar or work Katya, I pass you the conversation between the two men (sex and useless) but does Cross see what he films? because in the background there is a Katya that \"is big no matter what\" is shocking and it makes the film, the connections are very bad.\nIn conclusion, the love story is not one, I read a comment comparing this Romeo & Julillette, my God did you read Romeo & Julillette ... Certainly Lucas walks his melancholy, but to have a story impossible to love, it is necessary to have a love affair in short, this is not the case. The history of diamonds does not succeed either. We remain on his hunger ... just watchable to fall asleep.",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time or money",
            "content": "Horrible. Just horrible. Don't waste your time. I'm normally a big Keanu Reeves fan. But this movie... not so much.",
            "review_date": "2018-07-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not a \"1\".",
            "content": "I think 6.5 would be a reasonable rating. I am giving it a 10 simply in protest to all the lame people saying it is a 1. Those people should be banned from giving ratings. Yes, the movie does move a little slow. The plot could have easily been made more exciting. The ending could have been much less disappointing. They could have left out the bear and vodka stereotypes. But all-in-all it was not a bad movie. There was some mystery. Some romance. Drugs. Sex. It was entertaining, just not Keanu's best movie.",
            "review_date": "2021-09-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cold",
            "content": "In contrast to something like Payback, where i didn't really have the deepest connection to the main character either, this really left me cold. And Keanu is portraying someone really cold indeed. I mean when he gets asked if he'd agree to sleep with a woman, he tells her, that he has to find someone. I mean that couldn't wait a minute? Or half a minute? I'm including the undressing and dressing in that one.All kidding aside (and there will be sex if you are worried about that ... I'm just saying, you might be), the movie has some passable action scenes, some very fine Russians (as some President would say) and a decent story overall ... bleak this may be, but maybe that is what gets you off - no pun intended",
            "review_date": "2020-08-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good actor bad movie",
            "content": "The movie is slow pacing. Good action on some moments. Bad story, so shallow for Keanu, they better get low budget actor.",
            "review_date": "2018-07-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I couldn't stay awake",
            "content": "I couldn't stay awakeI I was that bored I'm a retired movie freak I see at least 10 movies a week. You couldn't pay me enough money to watch this movie over again",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very bad trip",
            "content": "A long movie about nothing... No love inside, no action... Just a lonng way to tell nothing and put sex scenes...",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time, time, time and money...",
            "content": "It is totally waste of everything. don't watch it!",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "They missed out on a big opportunity here, could've been better!",
            "content": "This movie isn't anything special but it does have merit and manages to be very interesting through out starring Keanu Reeves giving one of his usual not bad but nothing spectacular performances. It's about a diamond dealer & his new lover getting entangled with a Russian mobster, The writing is done very well and the pace of the movie albeit is not a action movie but it moves along at a fairly quick pace. Music is pretty much non-existent, Cinematography is up to par the problem I have with the film is the under developed characters and the situations they are placed in, or why they would even do that in the first place. I won't spoil anything but this movie missed the mark a few times but I truly believe there was enough here to be a great film so I place this at a 6 not bad but nothing special.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terrible",
            "content": "Worste film ever... just sex no story, ana ularu make a lot of error, a poor actress. Keanu can't save this movie, but he still good.",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Depressville here we come!",
            "content": "Keanu must need the money badly to star in this tripe but at least its not as bad as his outing in the worst movie I have ever seen \"The Bad Batch\" but it does give it a run for its money.Utterly embarrassing sex scenes some so explicit my girlfriend went to bed lolThe story is drivel , the directing is plodding and utterly despairing at times and Keanu was even more wooden than normal.....and ohhhh the end , you just have to watch it to feel the utter pointlessness of it all.Watch it at your peril!",
            "review_date": "2018-10-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie was financed by an Russian oligarch.",
            "content": "Only reason it was made! I'm sure Keanu was probably paid in Blue Diamonds for this movie.",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "horribly underrated",
            "content": "The tension never stopped. Gloriously, there were no car chases, no kids, no dog/cat worship, no political correctness. Molly Ringwald was a non-entity.\nSome violence, but little gratuitous.",
            "review_date": "2018-12-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A world with no exit, indeed.",
            "content": "I guess most reviews are negative because the movie was advertised as a 'Keanu Reeves thriller' so they expected an action thriller. But John Wick this is not, and I'm really glad it isn't. This is a slow paced, very old school, psychological thriller. The air is thick with danger, the menaces are everywhere, the main character navigates dangerous waters, but there is no 'action' scene per se until the ending. The film follows its path, slowly but surely towards the inevitable. \nThe script is basic and rather clicheistic, but saved by strong, nuanced performances. \nTo quote two interviews, this is a grown-up movie about people and relationships. A bit of redemption, too.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not your typical Keanu movie",
            "content": "Watched this solely because I thought I'd see Keanu kick some a$$ but it never really happened. More of a romance movie.. Lots of Sex. Ashley st. George is a babe. Hope to see her in more movies. She kept my interest, but that's about it.",
            "review_date": "2018-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good until the crappy ending",
            "content": "The movie was actually good. Great plot and so many bad things happened that you were sure it would end great. The ending made me change from an 8 to a 6. It just sucked!",
            "review_date": "2019-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Get Your Lumber Here",
            "content": "Buying a ticket for a Keanu Reeves movie is like buying a Pot Noodle, you don't quite know what's motivating you, you know you'll be bitterly disappointed, and you swear minutes in that you'll never be so stupid again. But once every couple of years you do it - as if to commemorate that life could be so much worse.KR could not be more wooden if he came packaged two by four. His ageing face contains no wrinkles, they are merely knots and growth rings. I've read that he is a charming man. Fine. Just don't act. Play to your strengths - whatever they may be.Siberia is dreadful. You'd be better off eating dehydrated food from a Pot.",
            "review_date": "2019-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Unfulfilled promises from an otherwise nice suspense plot",
            "content": "Siberia is the story of Lucas Hill (Reeves) an american diamond trader who is left by himself to negotiate with a russian mobster by his fleeting (diamonds and all) russian partner Pyotr. \nThe plot takes Hill to a ever-rising dangerous situation making you guess what would the ace up his sleeve be that could give him and his lover Katya (Ularu) safe-passage out of the mess and into a happy ending. \nThat´s to say, nearly a hundred minutes of intriguing plot, superb acting, interesting characters, cool locations, etc., all contributing to building up a climax that ends up being as blunt and surprising, as unsatisfaying. \nIt´s not that you expected a ´John Wick´-ish solution to the tangle, but... really? Just... that?? You end up feeling lied to.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Avoid At All Costs",
            "content": "Fresh on Netflix I completely forgot this existed after it released in the back end of last year though to be completely honest I'm not convinced the cinematic release ever happened but regardless it fell by the wayside completely during the decent year in film of 2018. Anyway onto this, I saw it yesterday and I'd struggle to recall any story points if my life depended on it, which is not a good sign. There's a diamond mix up, Keanu Reeves who I'm pretty sure is nameless other than 'American' has an affair after his wife ends a Skype call, he breaks his image as John Wick and kills a dog and there's a conspiracy...I think. Now that took far too long to be worth the effort but all you need to know is there's nothing that happens, it does feel like a fill in story between Wick films that's supposed to build up the legend but fails completely. He's spends 90% of his time in Russia moving from hotel to hotel, changing his phone number and making the same call, then 'enjoying' (to say the least) his time with a random cafe worker called Katya who suddenly becomes his shadow and is in practically every scene. It culminates in Reeves finding his business partner dead and frozen and a gunfight where suddenly the clearly combat skilled American businessman offers himself to the villains essentially, standing in a clearing and getting shot in the head from behind before the credits roll. Thrilling! Utterly boring and very long sections plug the spaces between where he sits in on conversations that make jokes at him or where he stops a load of drunks making a mess but it's not worth an hour and 50 if your time, in the end being batched for me personally with the likes of 'Strangers: Prey at Night' and 'Rampage' amongst others in the truly appalling bottom end of the proverbial 2018 film ladder, skip this one",
            "review_date": "2019-04-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I disagree with most of the reviews here",
            "content": "I'm surprised by the bad ratings here. I thought the film was pretty good. The only bad acting is Keanu Reeves. So what else is new? Its dark and tragic and perhaps a little slow moving. He has a pretty steamy relationship with a Russian girl played by Ashley St. George. I thought that was all well done. Anyway, to me this film was a nice change of pace.",
            "review_date": "2018-09-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A failed attempt at metaphor",
            "content": "Wasteland. Sparsely populated. Knowing so few people and of those few, not many will be willing to help him. Arctic cold. Where one would be sent for the slightest of transgressions. A way station to somewhere. Into this world an American diamond merchant Lucas Hill is thrown-as Heinlein wrote a stranger in a strange land. Where he should have been aware of the old maxim \"Business is business\" and realizing too late he has been taken advantage of. Nihilism his only friend.\nAh if only... Siberia is none of those things. If only Siberia knew what it wanted to be. Neo noir? A straightforward drama masquerading as a crime thriller? A heist in the manner of Thief? It fails in the most fundamental way. It strives to be an existential drama without the underlying existentialism. Either Hamel/Scott and Ross didn't know how to convey this or were too lazy to give anything more than a slipshod effort.\nIf critics and users (here's looking at you Saban Films) were expecting John Wick Chapter 21, that's on you not Reeves who as Lucas Hill acquits himself rather nicely here.\nSiberia could have been Body Heat meets Blood Diamond set against the shadow of current Russian political climate with a bit of Thief thrown in for good measure. \nMuch has been made of sex scenes. I believe the intent was to initially show lustful convenience (what there are no other females around? She is the only woman at the bar/café he frequents). If there had of been, then his attraction to her would have been more palpable. From the first tryst at her urging to a gradual deepening of Lucas' love for her. The tone never changes from the first time he meets her to the last time he sees her. The latter should have evoked feelings of poignant tenderness in say the same way as Elba's/Winslet's did in The Mountain between Us. But fails to do so.\nAlthough I knew the outcome 5 minutes into the film, (the film is constructed in such a way as to lend itself to what should be an unexpected ending) it should have resonated more than it did.\nTo appropriate Jim Morrison, Siberia is pretty good but it could have been far better than it is.",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad taste",
            "content": "He kissed a girl who just suck another man thing, makes him look bisexual! Too much sex with no action! It should have been a porn!",
            "review_date": "2018-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Movie that takes itself seriously but it's just a joke ....",
            "content": "Really disappointed by this movie, I wanted to see it and well I would not have\nit is a film without soul, there are no characters, the only \"living\" is Lucas (Keanu Reeves) alone is caught in a drama and his suffering is real.\nKatya (Ana Ulary) I did not know her, I do not know if she did any other movies before, but she's a bad comedienne, she does not feel any feelings (she's pretty, though) but that's not the case not enough. In this Siberia, it is cold, very cold ... is like extreme cold it numbs us until we totally darken. This is not a love film, lol I read the opposite on a criticism, I said to myself Ana you do not have a heart! lol but actually the person who put 10/10 is a fan of Keanu lol so this explains that. I also like Keanu but despite his performance the film is bad, it is badly put together, when we are promised a direction finally it changes and in the end nothing has been accomplished. I'm disappointed, I do not know what the director wanted to do, but it's bad, maybe he himself did not know ... except the sex, what a pain to have to undergo so much sex scene in a story none. In general too much sex shows a great weakness in a scenario, this is also the case. One question, Why Keanu Reeves is he going to do this movie? ;)) I just said, \"It's a very big actor because living the feelings alone is very strong that\" .... at the same time it is very strong, it's still John Wick (and of course, many other very beautiful films to his credit) he lost himself in the siberia that between us is very poorly filmed too ... not had the feeling of being in Siberia. Siberia has the tone and look of a live-to-video feature.\nThe various twists are useless, nothing sincere, nothing profound, everything is said very quickly and there will be no real evolution. By that I mean that nothing will come to surprise you, there are very long scenes ... long ... it is a difficult path for the spectator.",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not only Keanu Reaves is present.",
            "content": "Many underlined the vacuity of the plot.\nI disagree. It requires an difficult decision to kill Keanu. Other actors have given much and someone has thought about behaving like real Russian people...not in a bad way, I mean. About a nubilous business, with so many real cases of deathly consequences. You got it. \nIf I went through to the grieving end, although in two parts, it is a solid, although improvable work.",
            "review_date": "2018-09-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Reeves is on a roll...",
            "content": "What a good film this was. Honestly, Reeves has really gotten some great material over the last few years and has made the most of it. Superb story with fantastic production, acting and writing...could have used a bit more in the action department, but maybe I got spoiled with the Wick offerings. Definitely worth the price of admission...",
            "review_date": "2018-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A tapestry",
            "content": "I read a lot of bad reviews but I put my trust in Keanu. Some will look at a tapestry and see a square made of yarn and some will notice the rich details and complex patterns. This this is a movie that is loaded with interesting and intricate story points.. all through the beginning, middle, and end. It will not please everyone, no doubt, for reasons that will become obvious after watching but Siberia is well worth the journey.",
            "review_date": "2018-10-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Somewhat Unusual",
            "content": "Lucas Hill (Reeves) goes to Siberia to make a diamond deal, but his partner Pyotr (Boris Gulyarin) has left the meeting place apparently with the diamonds. Lucas promises Boris Volkov (Pasha D. Lychnikoff) a sample with the remaining 11 to come later. And yes, this is love story too. Okay, while we wait for John Wick 3 to come about, we have Keanu Reeves in a role we don't normally see him in. He falls in love with a pretty Katya (Ana Ularu) and we are not sure why (We can see why) as we think his marriage to his wife (Molly Ringwald) seems to be okay. But, of course, we don't know anything more about that. And we only see Molly Ringwald for about 20-seconds in the beginning. When Lucas meets with Boris to give him the one good sample he has, Boris makes a very unusual sexual proposal now that Katya is also there as she followed Lucas to that meet. Boris wants Lucas to allow Katya to orally service him and Lucas will be orally serviced by Boris' girlfriend. Boris says this is all in the context of Brotherhood between he and Lucas. These are very uncomfortable scenes. Later on the Russian FSB (former KGB) gets involved and Lucas has a decision to make or not make to save Katya's life.Notables: Rafael Petardi as Paval, who protects Boris' interests; James Grace as Vincent, who warns Lucas the FSB is looking into him regarding the diamond transactions. The acting all around is very good and I am sure we will see more of the very pretty and striking Ana Alaru (See? You did notice) (7/10)Violence: Yes.\nSex: Yes.\nNudity: Yes.\nHumor: No.\nLanguage: Yes.\nRating: B",
            "review_date": "2018-09-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "John Wick on a depressing and dull Siberian vacation.",
            "content": "The trailer made this actually look like a cheap Wick spinoff with enough action and thrills for a VOD film to keep Your attention.Every actual action shot in the trailer is really only 2 separate :30 total sequences in the beginning and in the end of this film. Instead it's Keanu in a more reserved and boring Wick persona venturing around a bleak Siberian environment of rich Russian mobsters and a very annoying sex crazed Russian woman that is unconvincing. The plot drags around and really is cliche as they come with stolen diamonds and blown mobster kingpin deals with utterly banal dialogue. The ending comes abruptly with no real conclusion and the film is over. While Keanu delivers his signature acting style that's servacable for the most part, there's really no reason to watch this. It's essentially John Wick on a depressing vacation without any action or excitement Obsessed with a Russian chick.",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pouahh",
            "content": "A lot of sex with no sense, no sexy at all in a pooor story... Long time",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Russian garbage",
            "content": "Typical boring, Russian garbage. Netflix should remove all Russian made films from their site. They are rarely any good.I don't know why Reeves would sign on for such crap. I guess the money was too good to pass up.",
            "review_date": "2022-03-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stop copying all the bad reviews",
            "content": "When I scroll through the reviews after watching the film, it seems like most of the reviewers are just copying each other. Most are saying, \"worse film ever\". Worse film ever?!! Seriously? Maybe you only ever saw a few films then...OK, so compared with John Wick, it is nowhere near as good, but it's not that kind of film. No, it's not really good, and is a little flat and isn't exciting. But, it does make a nice change. Things don't always work out for the better in life, people's lives are a mess and can be depressing. This film captures that. Another reviewer remarked that you knew it was going to end badly for someone. But for who? The ending is not \"weird\", \"pointless\" or \"rubbish\". The ending is actually kind of perfect. If you want exciting, ignore this film. If you want a film that is slow paced and more like reality in a place where things are done differently, watch it. I will say that the Russian gangster was the best casted and what I expect from someone like this - enjoyed their scenes.Give it a try, but don't expect John Wick.",
            "review_date": "2021-05-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Depressing waste of talent and some decent performances",
            "content": "Lazy writing and a poorly developed plot sink this Siberian morass. The acting is actually quite good throughout, but the story really makes no sense. You're never quite clear about the motivation of Reeves and so he kind of wanders through the story-detached and unemotional.I think the acting could almost be strong enough to salvage something of the film had there not been a total lack of a third act leaving Reeves dead on the ground and a very underwhelming cut to credits.One is left just sitting there. Hence the poor ratings. The writer was either unloved as a child or lazy.And don't for a minute believe this is some deep character study that underscores the modern decathected ennui between two lovers who find themselves going nowhere mid life. While that's a theme (or an attempt at one). The movie never really has the balls to get into some of that material. Rather it's skips over some rather tense moments and maintains a flaccid detachment. There no great film here or great Cinema. Only the fake blue diamonds.Either way save two hours of you life and read Solzhenitsyn instead. This film is dreadful.",
            "review_date": "2020-11-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I really hate a movie critic",
            "content": "Because my opinion is what matters to me. Siberia is a jewel of a movie. Very hot. Very moody. Pacing reminded me of Bound. Sexy like Bound too. Reeves looks great. Lot of chemistry with Ularu. Perfect movie to see at home if you can't catch it in a theater with the limited release. I got it on Demand for $7.99. Hoping for some extra features when the blu-ray comes out. Commentary with Reeves and Ularu would be very special. Just throwing it out to the universe...",
            "review_date": "2018-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Somewhat interesting until...",
            "content": "The last minute.This film really doesn't seem to have a point. It's just about some people and a few somewhat interesting days of their lives. And then it ends poorly.Oh yeah, there's some sex, and Molly Ringwald has a speaking role, don't blink or you'll miss it. Reeves is a nice guy, and he's rich but lives a modest lifestyle, he probably did this movie as a favor to a friend.",
            "review_date": "2018-08-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible",
            "content": "The worste story ever... Keanu is good but there is no story here",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I said it before and I'l say it again Keanu Reeves simply can't act.",
            "content": "I said it before and I'll say it again Keanu Reeves simply can't act. I've watched mostly all of Reeves film, from Bill & Ted, to the Matrix trilogy the Watcher, John Wick, that mega piece of s...t Knock Knock (what a total crapfest) and I can safely say that Keanu Reeves is no actor, he is a nice face for the camera with absolutely no depth nor dimension in any role he plays. He is bland thru and thru. Let's face it, the Matrix is what gave him star power, because of the fight scenes, like John Wick. Take away that and all you have is a lousy actor playing roles in awful movies like Siberia compensating by being in numerous sex scenes. This films confirms that Keanu suck major ass a lead, without any fight scenes. He is just lousy. Avoid this stupid ass film at all cost.",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "If you enjoy John Wick you'll enjoy this, solid 5.7",
            "content": "Don't understand these brain dead ratings but I don't understand the world in general anymore when cheesy super hero movies get 9s 10s.Going by the old IMDb ratings from 10 years ago this is a solid 5.7 - 6. To have this in the 4s in the same category as Horrendous B movies is insane.There need not be a deep story to enjoy this movie. It's a slow burner with a very superficial story, but it's still very enjoyable. It's John Wick with less killing, if you want suspense it's definitely there.I enjoyed all the John Wick movies even though they weren't masterpiece but legit Solid 6s. If you enjoy those give this movie a try, the acting is very good. Ignore the horrendous ratings and enjoy a Russian nostalgic noir.",
            "review_date": "2018-08-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A slow-burning senseless moody B movie with no mood",
            "content": "Keanu Reeves as slightly dodgy diamond merchant Lucas Hill whose Russian partner goes missing, travels to St. Petersburg to find him, but instead he falls into an obsessive and passionate relationship with a local cafe owner (Ana Ularu) in Siberia. Movie has a dark tone in its cinematography and music, but it fails to reflect that quality in its story because it raises certain expectations, but it fails to live up to them as the film ends unexpectedly, thus, killing the excitement. The film's screenplay, also, fails to connect the dots on how Reeves has ended up in the situation he's in. At the end, movie works neither as an action film, nor as a romantic story, nor as a crime thriller. In trying to do too much, it falls between the cracks of each genre. Without characters interesting enough to hold attention, nor a story exciting enough to do the same, there is little to recommend in this film that lacks a final punch.5/10",
            "review_date": "2018-09-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu... why???",
            "content": "I cannot believe you have accepted this movie. Please don't watch it. The story line is so awful, if there is one.",
            "review_date": "2018-08-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Low key love story with hints of violence",
            "content": "Siberia is a love story and a vehicle for the two leads. They were well cast, both are good looking and have good lines to say, and are featured making love maybe four times. That part of the movie works well, and is romantic and filmed really well. Siberia is not an action movie, although all the players are there to make it one. It's charm is realism, and this depiction is probably much closer to how an innocent, but ultimately bad deal with criminals, actually pans out. On that score it certainly has interesting tension, and one will certainly feel for the dilemmas that face Mr Reaves. A stranger in a strange land indeed, and that is probably what the movie makers had in mind when they titled this Siberia (a lot of the footage is St Petersburg). How successful they were on this score is reflected in my score for the movie.",
            "review_date": "2019-08-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "icy, flat, just blows the surface",
            "content": "Lucas Hill (Keanu Reeves) negotiates the sale of diamonds to the Russian oligarch Boris Volkov (Pasha D. Lychnikoff). Among the threats, the risks and with other buyers trying to interfere with the transaction, Hill eventually gets involved with Katya (Ana Ularu), owner of a local bar.It is unfortunate to note the wasted potential: Russia offers many opportunities for opening up to explore crime, drama and suspense. However, the conduct of this film ends up leaving the story slow, unsurprisingly. The existing romance is actually an excuse for inserting multiple sex scenes, which add absolutely nothing to the characters, who in turn are empty, with no specific goals.\nRoss' glacial pacing does not help matters; Apart from not knowing how to evolve in both genres, Siberia has a disability based on an unfavorable scenario and where many moments are confused. One does not understand that the sexual attraction of the two protagonists in which the lack of chemistry is too visible provoking to leave the film several times. Chaos seizes a relationship that there is no where to take it.\nThe thriller plot works best despite some scenes that claim to be taken from a movie by Tarantino or Guy Richie and this is not always the most appropriate because of the tone in which Siberia is treated. Cold and soulless characters like these natural scenes that are not always exceptional and show the hardness and coldness of the region.\nPredictably throughout Siberia perhaps because of the fusion of tones on the sex becomes confused and very flat.",
            "review_date": "2018-08-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Rubbish",
            "content": "Waste of time this movie\nOnly first 5 minutes were promising, but it spiraled out.\nDeserves 0 stars.",
            "review_date": "2019-04-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Has its moments but fails under expectations",
            "content": "Probably the biggest mistake of the filmmaker in this case is to let Keanu carry his styling from John Wick into this movie. John Wick is so iconic now that if we have a protagonist who dresses like him, walks like him and talks like him, yet doesn't shoot like him; it will disappoint the audience. Well probably the movie was shot alongside John Wick 2 and Keanu might have put this condition on the filmmaker who had to play along.... Anyway, just watch it knowing that this is not a John Wick spin-off.Siberia is a retelling of the classic tale of a shady businessman/smuggler with not so friendly clientèle. Its every bit reminiscent of 'Lord of War' and 'Blood Diamond' but is neither exciting nor as thought provoking. Only thing which absolves this movie from being a total drag is the attention to the mundane aspects of a smuggler's life. There is something so uncouth and disdainful about the protagonist and his lack of innocence is disturbing. Is this the intended effect of Siberia? Perhaps!",
            "review_date": "2018-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "tasteless film ...",
            "content": "Seen yesterday for my misfortune;) I do not recommend, I love Keanu Reeves is other film than John Wick, talented comedian with great charisma but he got lost in a movie rambling. It's a shame because he is very disturbing but he is the only one ... I was bored stiff, Ross had made a first film that without being excellent promised, the second is totally missed, not convaiquant ... The gangster ' have laughed, so far from the truth ... Matthew Ross has nothing depth he stays on the surface and goes in all directions, in the end is this a love movie? No, sex? No, because despite the sex scenes too generous for my taste :) it's very cold and without conviction, no echo is between Lucas and Katya.\nThe character Lucas is completely lost, and so are we. It happens to search Pyotr, the time is counted for Lucas and apparently in this film the notion of time does not exist. Lucas goes for a walk, he trails ... he trails ... He has time to meet and have a good time ... at Matthew Ross sex is scouring.\n Neither good Thiller, nor good romantic movie, nor drama ... the film dissolves readily and is completely tasteless.\n1 star for Keanu Reeves only feels he concerned.",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Poorly written gangster film",
            "content": "This is a movie about diamond smuggling and Keanu is a diamond appraiser and a go between. It mostly involves the Russian Mafia and a small interaction with the FSB (KGB) and the married Keanu meets a Russian girl while he travels between Russian cities and waits for his supplier & contacts.The movie is painfully slow and boring as he waits around from his AWOL contact for the diamonds. The action consists of his getting beat up and left in the cold to freeze. Heckled by the girls brothers because she took him home and they thought the worst. Sex every 5 minutes because she wants to get back at her brothers who thought the worst. They don't show any body parts. Just kinky behavior or places. And then the FSB gets into the picture and Keanu gets blackmailed and caught between them and the gangsters. The ending was really rotten' especially after suffering through a horribly slow, boring movie.The actors did their best despite a horrible script and worse directing because the director also approved the script and then made it worse. The script writer and director should limit their careers to the porn industry since that seems to be their only interest. I doubt any respectable film would hire them after this. I feel sorry for Keanu but I don't know whether this porn theme was to his taste or not. Pardon the pun.First: Film Makers need to understand that people who like a steady diet of porn or sex will be buying their movies from a porn store. Not watching movies. The focus of this movie does not appeal to anyone who would watch it. Nor would the 5 or 6 acts of sex (every 5 minutes) appeal to the porn addicts without showing any body parts but do their best to imply kinky acts and places. Porn lovers aren't interested in a story line, only sex, so why pursue this type of story line which offends both the regular audience and the porn lovers at the same time. So nobody likes it and they get nothing but bad reviews from being totally out of touch with their target audience.Second: Keanu looks terrible in a beard. I realize the actors who are straight wear beards in Hollywood so they wont get hit on as much but it looks terrible and ratty and adds 15 to 20 years to their age.Third: It was so painfully slow and boring as we watched Keanu fly back and forth between Russian cities and sit waiting at each place while the background actors have to carry the film until they give Keanu something to do, since that is how the script was written and not his fault. Then they add a Russian girl to the formula whose behavior doesn't warm her to the audience. This is the fault of the script writer and director. Not her. Then they have Keanu who allows her to be disrespected on the utmost of unforgivable levels... at which point he loses the respect of the audience... which was already hanging by a thread due to the issue of cheating on the wife.Fourth: This is truly a horrible job of script writing. The story theme was thin, Cagney corny, a subject of diamond smugglers right out of the 1940's which is of no interest to the audiences and a pitiful lack of action and plot. Plus the really rotten ending. There was less than 2 minutes of Keanu showing us his trade (out of bed). The film makers & scriptwriters need to learn to create movies that the audience likes. Not what they like. But as far as the script goes, there is no dialogue, no story beyond the diamond transaction and the Russian girl to fill the time. There is no reason Keanu should be wasting his talent on movies like this. He should get a better agent and find better movies before he loses his appeal. He also needs to shave the beard and mustache. It is quite awful and would be hard to get a decent acting job with it. Maybe another Sci-Fi film and a better writer and director.Fifth: However, the audience would have liked to have seen a movie actually made in Russia with a story about the interactions of the citizens, the gov't, the authorities and how they live and function on a personal level and the misbehavior of our CIA and Corporations taking advantage of them. And the aftereffects of their changing gov't and lifestyles... without the sex and only a brief reference to the mafia. We don't need to see another boring shootemup story again. Nor an FSB torture nor a focus on politics. It needs to be a character driven story with a character like Dobrynin with his humorous remarks to JFK and Haig.Dr Zhivago was a big hit so there is an audience for it. Telefon was also a good movie to watch as was the film SALT. Perhaps with a touch of humor like the Get Smart film and Yellow cake (Uranium).However I cannot recommend this movie to anyone. Not even for Keanu's sake. It is the movie and the script problems. Not his acting. Actors have to follow the script and the direction they are given. Clearly Keanu has a bad agent which he needs to change ASAP and stay away from sex oriented movies and gangster films.",
            "review_date": "2018-12-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One of the most confusing screenplays I have ever seen",
            "content": "This is my attempt of summarizing the characters in Siberia.It starts with Keanu wanting to see Pyotr. We never actually see Pyotr, but we get around eight scenes of Keanu getting/making a phone call, where he expresses his urgency in seeing Pyotr. Then we get introduced to Boris, who sells diamonds as well. He is the only character in the diamond industry we see, along with Vincent. Vincent and Keanu, allying with other South Africans apparently, once teamed up against Lagos. This explains their friendship, I guess. Andrei also sells diamonds, but we don't see him. Samsonov is also involved in the diamond industry, and as expected, we don't see him either. All we know about him is he is \"a bad man.\" Volkov also participates in the diamond industry. A guy named Polozin has leverage over Keanu, and luckily we see him in a couple scenes.That's just the characters for the diamond industry. There are a whole lot of friends and family members from Keanu's multiple love interests.If that sounded confusing, that's because it is. This movie made no sense at all and I was confused within the first five minutes.",
            "review_date": "2022-12-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "never look at it",
            "content": "Big 0 !!!!!!!!!!!!!!!!!!!!!!!!!!\nI'm angry, abducted from my life",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The main problem",
            "content": "The main problem the way I see it is that Keanu Reeves is presently eponymous with John Wick. As in fans, including myself literally see him (the onscreen version of him as John Wick) so its hard to see him not respond to situations the way John Wick would. The fact that John Wick 2 came out not long ago and John Wick 3 is in the works can't help but insert bias. I know I have it. So having said I know it affected how I saw the unfolding of the movie. I'd say that if say Ryan Gosling was playing the role I would give it a higher rating because he hasn't been a one-man army in recent years (wasn't really that in Drive either). For Keanu though this is just the fate that he is going to be having for a while. I mean it was hard enough not seeing him as Neo but I got past that albeit nearly 15-19 years later (if I include both movies).",
            "review_date": "2018-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very mature adult movie.",
            "content": "I rented this movie on ondemand the first day it came out. Being a fan of anything that Keanu Reeves is in I was anxiously awaiting this movie as I knew it would be a different kind of movie for him. Mr. Reeves is a totally wonderful action star, but he is also a great actor when it comes to dark and psychological movies. This movie lived up to my expectations. This is a tragic love story between two people who are from different cultures and who have lives that they are trapped in. When they are thrown together because of a diamond deal gone awry, they develop a relationship that is both sensual, emotional and yes loving even though he is married and she is supposedly engaged. They become entangled in the Rissian mob about the diamond deal. Then things get dicey. The Russians don't play and they put these two people in a violent situation that they try to escape from. I thought the story was great. The characters were well played by Keanu and Una and their chemistry worked. They both exhibited great emotions through out the movie. Keanu's command of the Russian language was perfect. That in itself shows the work and passion he puts into every role he plays. All I can say is if your not interested in seeing a well thought out and acted movie for mature people who appreciate the noir type movie, then this movie is not for you. Of course there are a lot of CGI movies out there to hold your attention without you having to invest yourself in a thought provoking movie. I have already preordered my Blu-ray. Congratulations to all involved with this movie, a job well done.",
            "review_date": "2018-07-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "get a decent coat, keanu.",
            "content": "Diamond smuggling in Siberia. I guess. anyway, we pretty much know where we're going here. but, Keanu always brings something to the table. if you're a fan, then go. enjoy. he's one of the producers, by the way.",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The Cold Seeps Into The Performances",
            "content": "In dreary Siberia, diamond trader Keanu Reeves shows up to discover what has become of his missing partner. Instead of tending to business, he begins an affair with Ashley St. George, who doesn't like anyone. Others are interested in the big blue-white diamonds of questionable origin, as well as Miss St. George.Shot in a blue-grey haze to indicate just how cold the landscape and emotional content of the movie is, Keanu Reeves offers another of his blank-faced performances. He is certainly a serious actor, who works at his craft, but his range is of a peculiarly small variety, which makes him suitable for playing Bill, or someone who has half his brain carved out, but not someone with any emotional depth. He is a good-looking fellow who, like Robert Taylor before him, wishes to be a good actor, but who got a foothold because of his good looks, and keeps working because of it. The frigid story suits him, but does not hold my interest.",
            "review_date": "2021-12-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Kind of....Zzzziberia",
            "content": "Same image, same haircut with same performance. I'm not say Reeves is a bad actor but why he didn't change something different for his each recent projects? the main point is, He's keeping his \"very handsome\" look since Generation Um (2012) so far. even John Wick series were his nowadays success that everyone claps their hands. But come to this movie , it seems like he took some new elegant pictures for Esquire or another entertainment magazines. Personally I think it's not quite excited at all.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Great movie; intriguing plot, articulated characters, exceptional acting, layers of suspense, romance and raunch, what's with all the 1 star spam?!",
            "content": "Keanu, top form, he must have practiced the Russian dialogue for weeks!As far as plot goes, blows John Wick 3 away (which really seemed to revolve around the action scenes and body count).The producers of Siberia did a wonderful job - wonderful juxtapositions of color and texture, for example, actors wearing blue and then in the next scene a literal 'fire orange', followed by an (artistic) clip of white snow melting off a dark roof. Then an action scene. Finesse!Didn't really like the ending of Siberia though, it kind of reduces the opportunity for a sequel?Certainly noticed some goofs, but still found it (well over a thousand times) more entertaining than that (critically acclaimed?!!) movie Nomadland - which was like watching wet cardboard dry over a bucket toilet.",
            "review_date": "2021-07-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Middle of the road film",
            "content": "It was ok, not Keanu Reeves greatest film. Not as bad as most reviewers make out it was though. Could have been better and have to say did not like the ending but overall middle of the road film.",
            "review_date": "2021-05-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring",
            "content": "This is Keanu Reeves' most boring and obnoxious movie by far. There is nothing it can make you feel, not even angry.",
            "review_date": "2019-12-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Straightforward.",
            "content": "Short and sweet. \nThe film reminds me of older works in the same genre. The intersections between characters, their flow, seem to mimic reality. Crime thrillers of recent vintage tend to be bloated, Siberia is far from that.\nAna Ularu and Keanu Reeves gel well together. Reeves still has that quality which makes you root for the main character, despite what transpires.",
            "review_date": "2018-07-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Truly amazing",
            "content": "Siberia was a real gem I would recommend to everyone who likes Keany Reeves and are curious about Russian culture while enjoying great action scenes. It's a movie like we don't do anymore.",
            "review_date": "2021-06-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie made me cancel my Prime video membership",
            "content": "Do yourself a favour and don't hit on play when this movie pops up in your recommendations. You will regret spending watching it for 2 hours and then wondering why you not spent that time with something more useful.It has a non-existing story line with an American - I still don't know what he was up to - and many Russians who look like people who walked out of a western satire about Russia.Absolutely rubbish.",
            "review_date": "2021-08-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disappointed",
            "content": "DONT WATCH...you'll only wish you hadn't. It is the most disappointing film I have ever seen with a rotten boring ending. It's like there has been bits of other bad films put together, even The actors can't be bothered to try. Light weight porn.\nI'm so angry at myself for sitting through it but kept hoping it would improve. Again save yourself DONT WATCH.",
            "review_date": "2019-07-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Thank good I read the spoiler reviews",
            "content": "Thank God I took everybody's advice and switched off after half an hr. total crap no action no suspense. Just a half baked love story . Also I'm getting annoyed with every film having a sex scene In it. You never see two men going at it, so why do I have to endure this Heterosexual filth the whole time.",
            "review_date": "2019-05-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Is it a romance? a thriller?",
            "content": "Well the question, I ask myself again, is this a Romance, honestly no, I saw only sex with a small effect of a mediocre life, but nothing is fully explained. It lacks depth, truthfulness.\nOf the sex why not, (here, the sets don't last for a long time, but which coolness, that it is unfounded) but yew used wisely, there in this movie that's not the case. It turns out useless and lonnnng ... the characters are not absolutely developed, of no more real evolution for them.\nWaste of time this movie, it doesn't make increase, doesn't open the heart. The characters do not exist, (except Lucas, Katya, it's figuration, her feelings are not complete, fault the actress) we'll find see at this history which leads nowhere. For the part Thriller, it is so lonnng to set up it, (as the rest moreover) that it has no more interest ...\nWhat is shocking to me is the age difference, really ,all too often there are gaps, a father and her daughter (I know that in the movies at the moment, it's a pretty formatted language, him: 50 years old, her: 30 years old, yet it's not the beautiful woman of 40/50 years missing ... it's macho, why not him: 40 years and her: 60 years ...;)) especially as this age difference is not addressed, there is no problem ... Humm I am 48 years old and I could not even imagine having a love affair with a man of 28 years) You may say that l love is not old, it's right, a grandfather can love a baby ... yes, of course, but between a woman and a man that matters, I don't think we can love to 50 years old as at 30, and we do not make love in the same way at 50 as at 30, When I look back, I don't know the 30-year-old woman. I don't know who this woman is, I really changed. I'm writing all this to explain why I'm shocked.\nWhere are wonderful love stories ... such as Jane Campion's \"The Piano\", \"The Bridges of Madison County\" by Clint Eastwood, \"Matrix\" what a wonderful love story between Neo and Trinity ... I'm dreaming",
            "review_date": "2018-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "slow plodding movie",
            "content": "This was by far, the worst movie we've seen. Keanu's character's are usually driven & defined in what's ahead but in this movie he was bumbling his way thru the movie with extra tail along the way. There was no definitive plot as it was chocked full of meandering issues, some meaningless.",
            "review_date": "2021-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Long time since i have seen sucha a bad movie",
            "content": "Huge fan o f keanu reaves, so i watched even being poored avaleated.\n90 minutes of mi life that i will never see again",
            "review_date": "2018-08-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Oooh diamonds",
            "content": "It may not be a great thriller, but it is entertaining. It is true that the script has holes and it seems that a guy with Asperger has written it, because the way to indicate that the characters are going to make love is too direct and these scenes being a fast valve to advance the story (which reminds me of the masterpiece of Tommy Wiseau's The Room). But the other hand, Keanu Reeves is the perfect disciple of Robert Michum in this movie and i love the blue suit which he wears.",
            "review_date": "2020-07-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad surprise.",
            "content": "I don't understand this kind of film, it's a flatness. It has no direction, two films in one, but Neither of these of these 2 stories are develloped. Matthew Ross would have been choosing which story he wanted to tell.\nThat of diamonds is slightly better. The other (romance) is interest, the couple Lucas (Keanu Reeves) Katya (Ana Ularu) doesn't work. No complicity between them, no listening, it's a story I don't believe. It lacks a lot of deeds or words, maybe time to make credible this superficial relationship. Keanu Reeves is an ice cube and Ularu imposes nothing, no character, this woman is transparent, no real personality, I just perceived her pride and like all good the proud person thinks that hes only presence is enough, why do when you are the best? that's what I felt. The director should have chosen a real actress because there, the film is already painful to watch but more than the actor is bad ,it quickly reaches the horror. \nMy language to her is strong, but after the movie, it was so disgusting that I went to see on the web to understand who was this woman, during my research, I came across some interesting facts on her instagram, she could only tell people to go on IMDb to show their love (those are his words) so shameless craving must have a shameful nay. I have never seen something like that before. Very badly polished, everything is a must have for she and \"love is for the beings to decide what they will do\". Her request was without respect for the \"public\", I do not tell you all that I read that confirms are my pride, I just explain to you why I do not spare this woman, that may sound a bit extreme .\n So with that, I continue my criticism ...\nThe end, the exchange is pathetic, especially since Katya, one of the big concerns of this scene, shows an indifference to what she saw, to be more precise, she shows insane things. If Lucas on the other hand is very genious, very anxious Katya not at all, decidedly (I know I add a layer, but facing so much pride ...on the other hand, I am honest in what I say, I'm not excessive, I see in my life, I don't judge. In addition, I don't have the abitance to treat others badly because it doesn't go to a man when he is down, still when he is dead and gone. )this woman dream completely, no charisma, she played in inferno (very mediocre film too, none of this was Ana Ularu's fault, of course.) I don't remember her at all. you the truth, her presence on screen reach the almost to nought (that's her fault).\nThe other characters are a little more aggressive. In a film, it is not enough to explain to us that this woman is strong, if she does not live it. Boris (Pasha D. Lychnikoff) could have been convadictive, but scriptwriting weakness does not allow him. I hesitate to talk about dialogues ... probably a child wrote this scenario, blah, blah, blah that bring nothing concrete to the film. A great disappointment for me, to flee without turning around.\nI was long and I deviated a little bit from my criticism of Ana Ularu, but I thought it was important to write it, I apologize if it distresses you. Take care of yourself. Jacob",
            "review_date": "2018-08-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A dull diamond",
            "content": "Keanu looks like John Wick. He barely speaks and shows no emotion, even during sex. However Wick he is not. The only Wick you'll see in this film is in the diamond filled candle.\nA most dull film. Slow, confusing and cold. The ending was a slap in the face for all those who managed to stay awake.\nI watched this on Netflix - glad I didn't part with any money or diamonds.",
            "review_date": "2019-04-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I loved Ana",
            "content": "I loved Ana in this film. She was so gorgeous, so passionate, so full of love.If I were given the flint of Ana's love, I just might burn my house down!",
            "review_date": "2021-04-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pointless,forgettable,painful,embarrassing film",
            "content": "What a rubbish ending, and what was with the random pointless sex scenes, had a pistol yet he never used it, killed a guy with a machine gun but didnt pick it up to use it,.just went off randomly firing his rifle (badly) I read these reviews before watching and thought it cant be that bad I will just give it a go. How wrong I was, just rubbish dont bother watching it, netflix should remove this pile of poop",
            "review_date": "2019-08-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It pains me to rate a Keanu movie 1 star",
            "content": "But my god, what a waste of time this movie is.It's never explained who Keanu really is, I guess we're supposed to come to the conclusion that he's a diamonds trader on the black market..Has some basic firearms training and knowledge, but apparently he is \"not a spy\"Falls in love? Or just lust? with this ugly russian female for no real reason... you'd think someone in his profession would be used to temptations.Can't track down the person who's supposedly holding his millions of dollars worth of diamonds, seemed like a good idea for him to hold them didn't it?he's apparently forced to stay and complete the diamond transaction, where his cocaine blow job experience was enough to build trust with a russian mob boss so much so, to not verify 50M+ worth of diamonds, but let's be honest, the movie would of basically ended there since they would of killed him on the spot, which honestly, would of been a better ending.Fights 6+ dudes who all have fully automatic weapons with a bolt action Mosin-Nagant was it? Instead of just leaving and finding an alternative way to fix his problem.Dies from a dude who was able to walk up point blank with a shotgun out of nowhere...I'm not sure why Keanu made this movie, because I love him usually, but this one was a major disappointment. Unless you enjoy boring movies which make no actual sense, I'd stay away...",
            "review_date": "2018-08-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "How many companies they have financing this?",
            "content": "I got tired of watching how many production co names rolling as credits before the movie. dead give away to a rotten movie",
            "review_date": "2019-08-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just 4/10? Is that a joke?",
            "content": "This movie deserves anything around 7/10, 6/10 at the very least! What's the matter with you folks? Wonderful actors, especially the leads Reaves and Ularu, and gosh, what helluva chemistry between them! The bad guys give you some real creeps and even the.supporting actors were good. Story is is about love and obsession, not about diamonds and russian mafia! Very authentic, believable and well rendered and builds up till the sad ending with the consistency of a greek tragedy. So once again, what happened to you guys?10/10 to even the low ratings out.",
            "review_date": "2022-01-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why Keanu? Why?",
            "content": "I have not seen a bad movie like this for quite a long time. The summary looks appealing: a diamond dealer meets this girl and also do business with the Russian mob and Keanu is the main character. Good ingredients ... in theory \nHowever: no storyline, slow, boring love story with too many (bad) sex scenes. A disgusting scene where they swap girlfriends for a b. Job. 3min30 Shooting scene in the end less than average and the worse is the end. Keanu got shot in the back, the vilain and his ugly moustache smile... and... this is it!!!!\nWhy did you sign this movie Keanu? Why?",
            "review_date": "2018-08-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Story goes nowhere...",
            "content": "This is an attempt at a thriller with no real intrigue, just a lot of posturing. Confusing story that starts nowhere, tries to go for a big bang finish and fails to do so.\nQuite dissatisfying to watch.",
            "review_date": "2018-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "very shallow and very draft :(",
            "content": "Movie very disappointing, I wanted to see Keanu Reeves but the story is not good. It lacks a development of the characters. I got bored, there are moments a little exciting put very quickly the puff drops and does not make sense.\nI do not know what Matthew Ross wanted to explain but it's not convincing, he missed the boat. There is no atmosphere, the music is beautiful, the photography too but it does not stick with the film, the photography in warm tones and the film is very cold, especially the romance, it's just a story of sexual relation and in addition Lucas (Keanu Reeves) is very cold, it is also normal because the two protagonists do not know each other. And it's not passionate, it's more a rally when you're bored, more quickly Katya (Ana Ularu) introduces herself as a woman who has big problem and the moment she asks to say the name of his wife Lucas when he orgasm, it's completely ridiculous, because the characters are not so much adrift as that. It does not work, I saw it with a friend who was also extremely disappointed.\nThe storie with the diamonds is not fascinating, and even the dialogues are very weak, really a child could write that. It's not a mature relationship, as I say flat dialogues. in terms of dialogues, they do not bring anything and when that would be deep, it's just very but very superficial.\nThe poster promised a romance but it is very far from being a romance, it is not even protagonists with a madness, something disturbing, no it is flat jsute. At the level of the actors, only Keanu Reeves gets the pin of the game, a little Pacha D. but poorly directed, besides I believe that nobody is directed. Ross's camera is not in love, we have the impression that he put his cemera and he left for a coffee and when he comes back he does not know where he is lol for me very bad director, his first film being in the same style, just a little more consistent and a little atmosphere \"black\" here we are degrees still below. We lost our time, we must not rely on the movie poster lol. I do not recommend this film unless you want in your life a big and long waste of time to see a very mediocre cinema. \nI'm not angry with Keanu Reves, I'll go see the latest John Wick, he excels :)) Yet Keanu made good film Romance but he should not be in shape where the scenario did not speak to him lol Ana Ularu can't get rid of it, it is not up to the challenge, nothing big. And the choice of the actress is a little bad because the connection isn't passed between them. I didn't know her, I saw \"inferno\" but I don't remember her in the movie (a small role I think) so it's a little his first big film so it must be indulgent, she must there are still many lessons (life) to learn for must go much, much further in the cinema.\nPacha D.Lychnikoff is an actor that I appreciate but here the role is very poorly written, even if he does with a lot of conviction \"Russian rogue\" lol, It does not work, it's too bad. The fact remains that I have a great deal of respect for him. \nI don't recommend this movie unless your life is so depressing and you want to sink further.",
            "review_date": "2018-08-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What's with the bad reviews?",
            "content": "I almost didn't rent this because of the bad reviews. Anything with Keanu Reeves is going to be good. Plus Ana Ularu is gorgeous. I enjoyed it. It's kinda like a 007 movie with more balls and no glamor.",
            "review_date": "2018-09-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "no interest !",
            "content": "I saw a film that brings nothing, it's distressing\nthe story is very flat, the twists brings nothing to the story ... an abysal boredom\nMatthew Ross for is second film reiterates in the nothing, although his 1st film was a little more viewing. Keanu Reeves does not save the film, only him, however, feels emotions, but the scenario is too light so we have no real answers to the characters and honestly Lucas and Katya is zero lol it is not a beautiful history.",
            "review_date": "2018-08-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Subtitles would have been nice",
            "content": "I'm not a mind reader and I don't understand the Russian language so subtitles would have made for a better viewing experience. Not that it would have helped much as the editing was horrendous.",
            "review_date": "2022-06-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Baby, it's cold inside",
            "content": "Nothing to see here. The diamonds weren't the only blue things here in the drab, poor excuse for a spy caper that never manages to get itself up to speed. Keanu appeared as lost as the rest of the cast in this going nowhere sleeper of a flick, as he muddles through the scenes aimlessly, with little to no intensity. Who can blame Reeves though, the script was about as exciting as watching paint dry & the ending in & of itself - even worse!",
            "review_date": "2022-03-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Do people not like Film anymore?",
            "content": "I created an account just to air my grievance at this great injustice. This is a seriously good film. For mine Keanu Reeves best film. This reminds me of the reviews Red Sparrow got, instead these are much worse.\n*Spoilers* I try keep it to a minimum\nLet's start off with the pace. This film is not slow moving, if you find this film slow chances are your attention span may be too short. The pace sets up great moments between characters in this one.Second this is a character film. Not a lot happens yet a lot happens at the same time. We see this progression through the various choices that Reeves's character was forced to make between him or compromising Katya. The Brothers scene, the part were he is forced to sell the fakes and the ending.Lastly when it comes to the plot, there is quite an interesting plot. He is selling diamonds, however he cannot find Pyotr with those diamonds, yet continues to negotiate for the sale of them regardless. It was interesting to find out where these diamonds are and if he will sell them safely without compromising himself. The character progression in the film is working in perfect unison with this plot.I am shocked at the bad reviews this film has and am worried about what types of films people want if this is considered a bad one.",
            "review_date": "2019-11-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not Much To Say About This Movie Not Worth It",
            "content": "I Remember Old Times with Keanu Reeves I loved Speed, Point Break, Matrix Franchise, Johnny Mnemonic, Constantine, Street Kings, 47 Ronin, John Wick, John Wick 2 great movies rather then his big huge movies of John Wick He is making a lot of Rubbish Direct to DVD movies that sucked, like this movie, with this movie it's not really the worst movie i have seen i seen his worser movie was Daughter of God AKA Exposed one of the worst movies of time then to this, this was Interesting Pretty Interesting movie keeps you watching until middle then towards end it's very empty ends with nothing to it i find this bit boring it's nothing special to watch. when you watch this once you don't want to see it again. story followsLucas Hill (Keanu Reeves) negotiates the sale of diamonds to the Russian oligarch Boris Volkov (Pasha D. Lychnikoff). Among the threats, the risks and with other buyers trying to interfere with the transaction, Hill eventually gets involved with Katya (Ana Ularu), owner of a local bar. he has a wife but he said it's more then of friend, then he meets then they fall in love. i got confused about movie because is it a Crime Drama or Romance it's pretty boring his Russian partner goes missing, he journeys to Siberia in search of him, but instead begins a love affair. the story doesn't know where it wants to go still is he going to search for his partner or something but the story switch's another way around, I Knew where i was getting myself into i never got bored at middle of movie but got Interesting all that but somehow it ruined the ending, now i am not going to spoil ending but the ending is very empty one thing it happen's then movie ends nothing to explain whatever it happened just ends like that for Kean Reeves Fans I Mean this movie is really nothing specially he got big movie franchise of John Wick witch is great i loved John Wick to death i never hated one single bit of movie never have but with Keanu Reeves extra paycheck or his direct to DVD movies whatever you wanna call it. it's rubbish like Daughter of God Dumpster, Neon Demon Dumpster, Knock Knock Dumpster, jeez just his bigger role movies John Wick is best and greatest movies he does but not even good or great director or Underrated director like Scott Mann, no one can't make a good Worth Watching direct to DVD Keanu Reeves movie nothing this movie 2.0 i thought it was just time waster not very boring but until end it killed movie SO Badly like you made you to hate it but i thought someone could made this movie better i wished if they made a better ending, movie that could end better movie that has ending but ending in this movie is empty very empty and very Disappointed ending just ended like Scarface when Tony gets shot behind movie just ends well At Least Scarface is a great movie but this Heck No this movie ended nothing just ruined it so badly at start to Half way to end movie just turns out to be most sucked up tricked me to like it to hate it, if you fan of Keanu Reeves like me i have seen this movie believe when you will get to end you will hate it so bad, i have movie even more worse and worser was Daughter of God. jeez i rather watch 1 & 2 John Wick movies again and again, his got same haircut and same look from John Wick but i am waiting for John Wick 3 in 2019 seems like better movie then any of his upcoming direct to DVD movies.",
            "review_date": "2018-09-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "VIEWS ON FILM review of Siberia",
            "content": "Five production companies, one entertainment company, and one distributor had a hand in getting 2018's Siberia made. I'm no can-do Hollywood producer but I think it was worth it.Anyway, Siberia is a slow-burning and slow-churning thriller. It's similar yet antithetical to last year's The Snowman. Siberia's thrills nestle in the mind's eye and not in beatings, chases, or elaborate stunts. As something about a diamond merchant whose diamond selling deal goes sour and off the reservation, Siberia is like chic, Russian film noir with star Keanu Reeves playing a detective-free, Philip Marlowe type. Granted, Siberia could've improved on its standoff, shootout ending. It feels abrupt while portraying the Reeves persona as a protagonist afterthought (you see Keanu fending off bad dudes with a mag 10 and you salivate for more). Plus, side player Molly Ringwald who's an 80's actress icon, barely shows up in two faded scenes. Nonetheless, Siberia mostly draws you in and leaves your Basic Instinct-like psyche absorbed and content. Time to pour out a little cinematic liquor (in this case I'm talking vodka).Keanu Reeves as diamond trader Lucas Hill, sinks his teeth into a role that seems tailor made for him. Sans beating people up a la the styling of John Wick, Keanu relies on minimal talking, bleeding screen presence, and some gadgetry, physical hand movements. Keanu's Hill is in nearly every frame and you as the viewer, follow his every turn (and his many sexual trysts). Minus his work in Speed, Point Break, The Matrix, and Street Kings, this is probably my favorite performance from the guy whose name cordially means, \"cool breeze over the mountains\".Siberia's director is New York City native and Harvard graduate, Mathew Ross. His first flick titled Frank & Lola (which I have yet to see) supposedly is also of the racy, noir variety. With Siberia, Ross is manifest with his vision. He fills the screen with Siberian landscapes, various close-ups, soft-core sex scene realism, and cold, ominous background lighting. His calculated pacing along with Keanu's scruffy, roughed up stares into the camera, make Siberia work as crossfire fiction. In truth, this is not an action extravaganza or a headlong genre affair yet it sets you in motion. Would I recommend that you see Siberia with a refreshed open mind? As the Russians say, the answer would be a profound \"da\". Rating: 3 stars.",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Honest review",
            "content": "I will admit that the story is a little flat, but the acting, direction, and cinematography are very good. The latter three points strengthen the story, in spite of itself, but as a viewer, you can appreciate the work that was done.",
            "review_date": "2021-05-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I will review this with a question",
            "content": "Was Keanu taken hostage and had a gun pointed to his head to play this role?\nIf not, he must be on something. The same thing the director and the rest of the crew are. Except the russian girl's brother, that guy played his role quite decent, but really didn't make a difference.",
            "review_date": "2019-06-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "slower than slow",
            "content": "I hung in for 40 minutes waiting for something to care about in this film. I was bad and then it got worse. It was slow and then it became slower. I was bored and then I set myself free. I do not care how the movie ends, I only pray that it does.",
            "review_date": "2018-11-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just awful",
            "content": "Sorry Keanu, but what were you thinking? Ending is rubbish. Certainly not worth wasting hours of your life for.",
            "review_date": "2019-05-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Staggeringly slow paced",
            "content": "When will the movie start I kept asking myself and it did finally get going in the last few minutes the rest was a bore fest",
            "review_date": "2019-05-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dreadful",
            "content": "Wooden, boring, no plot, no script in fact it is a dead as a dodo.",
            "review_date": "2019-04-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "bad...bad",
            "content": "Keanu does not just make good films, but this one goes beyond mediocrity.\nA deadly bother\nI love John Wick Matrix 47 Ronin (the prod-post shot him, sad) .... he's a great actor, but even the best can make a very mediocre film, there's nothing to say about the movie because very superficial ...",
            "review_date": "2018-08-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Forcefully told yet contains subtlety in writing and acting",
            "content": "Reading the reviews here, the ambivalence among them piqued my interest, so I gave the film a watch. The majority of the reviews here do not match my experience. Accusations of bad writing do not correlate with the film I saw. Two cultures are juxtaposed, mainly from one culture's point of view, and though viewers may not like the result, thoughtful people cannot deny the truths presented. The film breaks certain writing taboos accepted in the commercial marketplace, and while containing both sex and violence, neither is gratuitous. The plot does not revolve around creating situations for maximum sensual thrills in the viewer, but in faithfully and carefully presenting a character-driven story. If you prefer not to watch this sort of movie, then I suggest you avoid this one. If you like films that successfully bridge genres between spy, thriller, and literary, then I suggest you give it a try. I thoroughly enjoyed it as one of the better new movies I have seen in a while and will remember scenes and story elements for some time to come.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Loved It",
            "content": "I'm not a film critic, a film maker or in any way affiliated with the movie producing business. All I know is what I like and what I don't like when I watch something, and the degree of each. I loved this movie. I thought Keanu and Ana had fantastic chemistry and I found the premiss of the story interesting. Also, living in a tropical country I have to admit that I'm partial to movies set in cold, wintery locations.",
            "review_date": "2019-09-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why, Keanu? Why?",
            "content": "Why did my husband get involved in this movie? I didn't know if it was a love story \"affair\" that I'm supposed to feel bad for the two main cast or if it was a thriller about the blue diamond sell that was going wrong. The love story wasn't needed. I would've enjoyed the blue diamond story better by itself if it was more exciting and with a better ending. What a waste of time. Well, not really... 2 stars because it starred my husband, Keanu. Hehe.",
            "review_date": "2019-02-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Because Keanu",
            "content": "I watched it for Keanu. I didn't hate it. The female love interest bugged me. Maybe I'm just jealous. Not much intrigue or suspense but lots of kinky sex scenes. Weird. Not as terrible as Exposed and not as awful as Bad Batch. I'm rating it 10 because Keanu but really it's a 4.",
            "review_date": "2018-11-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I wasn't expecting greatness but what the hell was this?",
            "content": "This popped up on Netflix and, whilst I am not a fan of Keanu Reeves, I was at least expecting it to be entertaining on some level. What I didn't expect is, what I can only describe as, the worst film I have ever seen in my 52 years on this planet and it's not because it's slow (I like a slow film) or lacks action, no it's because it is bad in every way possible. I cannot even begin to describe just how bad it is, so please just take my word for it and watch anything, just anything else at all because what ever you choose it will never be as bad as Siberia.",
            "review_date": "2019-04-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What?????",
            "content": "What was this supposed be? Keanu as the dumbest black market diamond trader of 2018? We used to love his method. But it was like he was never there in this mess. I hope some of the actors at least got a decent paycheck out this.",
            "review_date": "2019-08-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Hope you speak Russian",
            "content": "Half this movie they speak Russian and no subtitles so if you don't speak Russian it's very frustrating because you have no idea what they are saying. This movie is slow and boring. Very disappointed. I had high hopes. Don't waste your time.",
            "review_date": "2022-03-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time zzzzzzzzzzzzzz",
            "content": "What the hell was this about. Too much poor sex and nothing else.......",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A mix of nonsense",
            "content": "The story is boring and predictable.The acting is okay.There is a love story in the middle that does not make any sense and does not contribute to the story as a whole.The sex scenes seem to be parachuted into the movie to make it exciting, but they're not.Conclusion, do not waste your time and energy.",
            "review_date": "2022-03-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I'm sure Siberia's much cheerier than this pointless dross.",
            "content": "Pointless, crass, nonsense.You can sum up the plot in one line: Reeves goes looking for diamonds in Russia, doesn't find them, gets shot and dies.",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring",
            "content": "Totally poor from the off\nIt's a TV movie at best and can be summed up thusly;\nDiamond dealer seeks friend to make deal\nCan't find friend\nMeets with buyer\nTracks friend to back end of sinberia but finds Siberian girl\nNails girl multiple times\nNever finds friend\nDouble crosses dealer\nGets dead\nThe end",
            "review_date": "2019-05-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Load of crap",
            "content": "I don't usually rate movies but i was so pissed off after watching this load of crap that i had to. Only stayed till the end because of Keanu but boyy was i wrong! Waste of time!",
            "review_date": "2019-04-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "ABSOLUTE RUBBISH",
            "content": "By far the worst film ever made by Keanu Reeves.Nothing happens until the last twenty minutes where an experienced gangster insists on not verifying a $40 million diamond deal, instead, choosing to spend $40 million based on blind trust.Somehow, by having sex with a girl, the hero has managed to magically create an incredible bond with her family, who are willing to lay down their lives for him.Total hollywood rubbish.",
            "review_date": "2022-02-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waiting for something good to happen.",
            "content": "Very mundane, slow and even the short, pathetic action scene was boring.Hard to follow at first4 sex scenes, not even that tastyBoring StorylineNo gripping moments whatsoeverWaited for the film to start then it ended.Has the pace of an overweight dog.Highlight of the film was.... nope, still thinking.Potentially the worst film I have seen, even worse than Snowpiercer.",
            "review_date": "2019-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's a film, enjoy it!",
            "content": "Love Keanu in everything I've seen him in, don't know where the hate is coming from for this film.Nicely put together, great acting their off on an adventure I'm siberia lovely stuff. Give it a watch, have some snacks and relax.Music was trying to be a little too artistic for me but not to distracting.",
            "review_date": "2021-04-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What is wrong with Keanu Reeves?!",
            "content": "Crap like this? Wow! Seriously?! Keanu, I'm Russian(former), call me I'll explain you what's wrong with that movie...lol",
            "review_date": "2019-02-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I expected more....so much more.",
            "content": "Has Keanu Reeves lost all his money gambling in in Las Vegas?\nI don't know. I do know that this film defines the meaning of a waste of my time.\nIt hasn't even finished and I already know it will not end well. I feel trapped in a corporate away day in which I am shown a training video....only no one is stopping it to talk.\nThe worst film I have ever seen KR in. Pitiful.",
            "review_date": "2019-04-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another Keanu clunker.",
            "content": "Pointlessly boring. Keanu needs to be more selective in his movies.Don't waste your viewing time.",
            "review_date": "2021-05-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "There is a message",
            "content": "The movie has based on very intresting character - Lucas Hill - diamond expert. This man, on first sig look - has perfe tly evaluation of jewels, but has strange ethical , scale of value when comes to talk about wemen and Love. Here we see how he, at the beginig, heas fall in love with the charmy Katya, but in away, which you can call it passiv. She makes first step, offering to him, she. gives him a ride with her car, she wears his hiden diamond in a candle. He does not gift her even a soup, little with aromas, instead he ask her what she whants, he can take iniatiative , to the man, to lead.\n Very strange thing happens, when he has been asked-pushed to swing his love-friend-Katya-with the one of the businessman. Volkov just for one bjob each. Which is an act of becoming brothers, mnow they are \"blood brothers\" . Their trust asre raised, they earn confidance, but on expense of love.\n This act shows the moral, the character of Lucas - he can't defend his lovegirls. He is down on the strean of river, he does not take any atction to move up. The giuilt is always on the Pyoter - the problems with diamond is bbecause of him, the whole movie.,Lucs run from responsilility, hopin that something will phappens. Indeedd he does not run, he is sinks, regardeess of the warning of Vinsens - the South African.\n TMetaforicly Lukas lookson the women like a beautifull, \"the best you ever 3ee\"- diamonds. Katya - with taft charatucter , forward and beautifull, \"unalterable\" reminds him , associates , pull a string deep in the soul of Lucas Hill. Which. is already forgot what is love - he is only old firriend with his wife - they look squint away certain things. It is shown a little bit of their relation ship, but plenty to understand.-Lucas can't get enough from his wife\n But when he finds the love, he is timid , he keeps Katya professionally, like the same way, he does not sacriface anything for her. Can we exchange the love like a. diamond jewelyy - for a wile , let's our partner try it and then return it to us ?\n The women are not jewelas, but Lukes treats them as such, he cant fin. inner forces. to fight., to go out of the river that gooes to the waterfall-fateful. for him, He doesn't go against even once, he doesn't fight for what he whants\n Ofcourse Keanu Reeves do this movie on purpose, he build the character of lucas Hill like an opposite of Jhon Wick - who kills and fight. even. for. the puppy. left by his belovveed wife. Jhon Wick has will, Lucas Hill does'nt have ome\n The opposition of these two heroes, th two types of men is tryuly significant. Mr Reeves has proved., not once , that he is capable of self-deception in the mane of art and cinema playing roles of \"weak\"man - \"Knock, Knock\", \"The Whole Truth\". It is amazing the range of the actor., he can be super hero - Neo , or to be manfailuure - in this movie. The question is : Are the viewers wants , are they accept him like a lozer. Because, as it is known, Keanu is one of the favorities of the crowd. People loves to wattch. him.; how he fights, struggle do stun real stunt work mmostly wwithout a. double.\n Here comes the geniius move of this man. You see - your. hero, beloved actor , is in a blind alley, he is pushed , but dan't do anything. You begi start to askyourself - why he does not run, why he does'nt. shoot them, why he doesn't. do anythin for God, Please! Now you think, what I want should would do , if I mm on his place. This is it , This is the point of . Keany and dhedirector- to put you on the place of main hero - to feel with him . To feel that you want to fight for your love. What you gonna do, if you were on my pplace , ask Keany with this movie.",
            "review_date": "2018-08-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "If you dont like violence against animals dont watch",
            "content": "This could have been higher but the violence against animals was atrocious.",
            "review_date": "2018-10-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Simehria",
            "content": "Siberia: Dumb diamond dude gets himself killed.As always Keanu Reeves performance can barely be described as acting. The supporting cast is passable, but everything is so boring, bland and nonsensical that it is almost painful to watch. The lame, gratuitous sex scenes I just fast forwarded through. In the age of Internet, who needs all that failed 80s erotica in their action thrillers?",
            "review_date": "2019-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One For the Team",
            "content": "Okay, message received. He takes on the team, to take one for the team. Now that he's dead, the Russian girl, Molly Ringwald, won't be harmed. But wouldn't it have been better to sneak out of Russia with her? But then, would the Russian Mafia have targeted her brothers? Maybe. So, he takes one for... Not a badly done film. Very engaging. But it doesn't have a happy ending. Seen on Tubi, the free streaming site, which has indies, foreign films, major studio box office flops, and now, live TV.",
            "review_date": "2021-11-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time, this is movie is trash.",
            "content": "A very , very , very bad movie, the worst kind of movie. Awful in all the posssible ways. Unnecesary sex. This movie sucks! . Women are treated like garbage in this movie and you think why, why Keanu Reeves choose to work in this kind of movie... why...",
            "review_date": "2020-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Reeves Always Watchable",
            "content": "Keanu Reeves and Ana Ularu are very good as lovers in this film that is billed as a thriller. It is very good; but the first hour focuses more in the Romance than the thriller aspect. Reeves is an America in Russia. He is involved an exotic diamond deal that has several key players he is either running from or working for. Reeves is always good. This movie is not memorable but watchable.",
            "review_date": "2022-03-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "jumbled plot, undeveloped characters, sad -- even the great Keanu and hot Ulatu can't save it",
            "content": "It had promise but by the second act the viewer is confused. I am a huge Keanu fan and wished this was a JOHN WICK 3 but it is not. Ana Ularu is almost sexy enough to save it, but there were just too many lose ends and unexplained happenings. You didn't know who the dead guy was, who was a good guy, why he did things he did, it just raced down hill like a drunk diamond smuggler.",
            "review_date": "2018-09-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Do not waste your time. Unless you love Keanu",
            "content": "I managed to watch this wooden film, purely because it had Keanu in it. I think the term straight to Netflix, will replace straight to DVD in the future. If it hadn't got Keanu in it I think I would have stopped watching it. It is no John wick",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good leads",
            "content": "It's hard to say exactly what the aim was of the film making team behind the movie \"Siberia\"... Whatever it was, the film is better as a love story than as a crime drama and besides its title you get no sense of what Siberia is like. Constructed as half romance and half crime thriller, unfortunately \"Siberia\" loses focus, and doesn't emerge as a great version of either. The movie has its moments, especially in the performances of its good leads Ana Ularu and Keanu Reeves, but the film is ultimately a confounding mess of genres. The scenes between Reeves and Ularu are the film's best and, with its enigmatically appealing stars, \"Siberia\" might have worked better as a love story rather than a thriller.",
            "review_date": "2018-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "OMG no...",
            "content": "What did I just watch? And the ending?? Really should have listen to the reviews on this one. I love Keanu but this movie is just awful.",
            "review_date": "2018-09-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Quite Exciting! But...",
            "content": "Note that Keanu Reeves is not that kind of guy who curses sometimes and the ending could've been much happier by the way. Except for what I have written the movie was very good (the acting is very realistic and the story is amazing!)",
            "review_date": "2021-01-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nothing is perfectly choreographed in real life combat",
            "content": "I suspect those who have rated this one star have never seen a movie more complex than \"Transporter.\" This is not some John Wick movie ... nor is it intended to be. In fact, it is just the opposite. In this movie, just like in real life, no one is perfect.Lucas Hill, played by Keanu Reeves, is not some kind of superhero. He is just an ordinary man, caught in extraordinary circumstances. He makes mistakes. It happens. There is obvious chemistry between Reeves and co-star, the amazing Ana Ularu. This brings back memories of how great movies were once made. Every single character in this movie is perfectly crafted, and Katya, Pavel and Ivan are particularly outstanding.Beautifully shot, this is how movies were once made prior to the video-game/first-person shooter genre. The tension builds slowly, becomes palatable and finally explodes into a climax that neither tells you all the answers, or even explains all the questions.In real life, bear hunting in Russia has zero to do with sportsmanship. A bear is flushed from its den by dogs and surrounded by a circle of hunters who just open fire at it at near-contact distance. In the very real depiction of this in \"Siberia,\" Ivan's dog is accidentally shot by one of the drunken hunters, and Ivan's hands are shaking so badly he can't even load another cartridge in his rifle to do the right thing to put it out of its misery. The realness of this touching scene has not been seen in a movie for many many years.This is only one example of how real the director has made this movie. In actual conflict, people get hurt ... even the good guys. Bullets go through wooden walls. People fumble. Things go wrong. Bravo to the filmmakers who have made a film that credits the audience with the intelligence to enjoy how gritty and real this is.The final scene shows almost everything that happens in real-life combat: tunnel vision; loss of fine motor skills; the good guys sometimes miss and the bad guys sometimes don't. In real life combat, nothing is perfectly choreographed, and the best plans immediately fall apart the moment the bullets start flying. In real life, sometimes a cornered bear still comes out of its den with a lot of fight, even when surrounded. I have seen this film three times so far in the past two days, and have seen more and more details every time. I actually feel sorry for people who want to rate this one star and who probably have never seen an intense drama with some amazing actors who are not just there to act in front of a green screen, gather a pay cheque and hope for big opening weekend numbers. This movie is a keeper.",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "sad not bad",
            "content": "I stumbled over this movie in the bargain bin at the store, and as a general fan of Keanu Reeves bought it. Before putting it into the player, my spouse read off a bunch of the reviews posted here, so we were prepared for the worst. It surely was not Bill and Ted's or Wick or Matrix - maybe, just maybe, an attempt at a slice of real life - at least for some. It was a drama and had a plot. It was sad. It was supposed to be sad. I think the movie did what it intended to do, and in that regard it was a successful movie, if not a fun one. The movie was successful enough that I went to the effort to make this review (my first in IMDB) to contrast the vehemence from so many others. Perhaps some reviewers took personal offense at seeing Russia and Russians portrayed as they were? It could have been set just about anywhere and the same human elements could still be found.",
            "review_date": "2021-02-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Excellently directed, superb acting for a Russian film that hits the mark.",
            "content": "I've read the reviews from others and I'd say they watched this expecting some kind of Hollywood film or John Wick type of thing. It's not full on action, and in fact the action and the diamond deals are really the background scenery to this film which is really about the affair the American has while he plunges himself into the Russian underground. There are many Russian films that move at a slow pace like this film and take a lot of time to set a scene and explore the characters. It's a Russian director, and he has applied his style to it well. It was funny in many respects, but clearly they focused on the narrative, for example, the locals were not kidding about his jacket. He would have died walking around Siberia like that. The number of locals that seem to effortlessly speak English, despite the explanation for Anna's capability, was just wrong. Having been to these areas, there is no one that speaks English in these remote Siberian towns. St Petersburg, of course, but not out in the bush of Siberia. Appropriate and very Russian ending as well.",
            "review_date": "2018-08-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not essential. Film that has less interest.",
            "content": "The film centers on the story of a diamond dealer Lucas Hill, who flies to Russia to run a trade in rare blue diamonds. The film explores (without success) Lucas's struggles to get out of a dubious situation when his contract is compromised.\nThen he meets Katya (Ana Ularu) and from then on everything spoils, that I felt that the film began to wade. I felt that the romantic tension between the two characters wasn't at the rendez-vous. The chemistry between the actors isn't great, and the scenario is not really enough to develop the first steps of their relationship. I didn't appreciate Romance because of other flaws in character development.\nWhen romance sets in, the film forgets its thriller side, it becomes a secondary plot and nothing is done to develop it. There are very tense moments, but these moments never come to nothing, because the diversions of the romantic story cool the tension.\nAt the beginning I was quite intrigued but over time, boredom and disinterestedness settled down, especially since the story of romance became much less interesting and rather simplistic, I mean that the characters don't are touched, that what you learn as you go hasn't the will to explain.\nThe performance of Keanu Reeves is correct in this film. Keanu Reeves is an excellent actor, and despite the fact that he doesn't know how to play Lucas Hill in the movie, Hill's room to grow. Because of this recurring scenario problem, Keanu Reeves doesn't have the usual presence.\nAna Ularu in her role is much further down, I have noted an incalculable number of fault, the experience is lacking. Pasha D. Lychnikoff is doing very well, but the screenplay is so far from reality and flat that it doesn't help.\nIt's a film that for the most part is confusing, Matthew Ross struggles to locate any sign of life. Management is less and Matthew Ross doesn't film anything strong, no soul in this movie. I can't consider this film as good, it has not fulfilled its contract, neither at the level of the entertainment and even less with regard to its depth. A movie that we can do without.",
            "review_date": "2018-08-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I do not recommend!",
            "content": "This movie has to be one of the worst movies I have ever watched!And I do not recommend this to any kids in any age, it's just so bad and It has too many live scenes.",
            "review_date": "2022-01-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not JOHN WICK in Russia but more like Romeo and Juliet",
            "content": "I really can't understand why there are so many bad reviews about this movie. I watched it on the first day it was out on demand and I can't await its release on Blu-Ray/DVD. This movie is very different from all other Keanu Reeves movies. It's not so much about action and physicality - if you expect kind of 'John Wick' in Russia then this is definitely not your movie! - but about quite a different form of 'physicality' ... a pretty hot one. Ana Ularu and Keanu Reeves deliver strong performances. This movie is not your typical action thriller but - as Keanu Reeves describes it in an interview - a bit of a Romeo and Juliet story - romantically tragic.",
            "review_date": "2018-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "1 Star is too much",
            "content": "Like everybody else. I don't know why this movie was made. Keanu Reeves is a lousy actor who found the right movies to be in. But here his bad acting shows big time. Everything is cheap in this movie. Even the sex is with clothes on. How many people always have sex with their partners not naked?",
            "review_date": "2020-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So much wasted potential",
            "content": "As a fan of reeves movies I really tried to like this movie but there was simply nothing to like about it. More of a drama than anything else, and a bad one at that. Bad movie, bad ending. If your looking for a good keanu movie besides john wick check out \"man of tai chi\".",
            "review_date": "2018-08-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst Movie with Keanu Reeves Ever",
            "content": "It takes about half of the movie time to determine what the movie is about. Silly Ending and As one of the reviewers mentioned , better spent your time reading a book or newspaper",
            "review_date": "2019-05-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Slow paced by Great acting - Reeves Return",
            "content": "A great slow paced film set in Russia - Scenery is the winner here \nGood storyline and Reeves return is good - Ending disappoints but overall a good movie",
            "review_date": "2018-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tragedy mixed with embarrassment. WASTE OF TIME",
            "content": "Keanu, how somebody convinced you to play that movie? What have you done? Matrix needs to be fixed??\nCompletely waste of time. Probably the worst Keanu's movie. Top 3 of the worst movie in my life.",
            "review_date": "2020-08-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ending is too bad to give more, avoid.",
            "content": "The film itself is tense and almost delivers but the leads sudden death at the end just ruins it. Ok he did the right thing but it's just a flat ending and a wasted movie.",
            "review_date": "2021-06-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Subtitles",
            "content": "Having subtitles when they speak Russian would have been really good, we spent time until we turned it on ourselves not knowing wth they were saying. This movie is just ok, you think it's going to be about finding Pytor and the diamonds but it's more of the love story. The hunting scene was a major turn off for me though, totally unnecessary unless they were trying to show that Russians hunt stupidly. Bin also not big on mafia stuff.",
            "review_date": "2022-03-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "worst film EVER",
            "content": "I advice not to see this film ...5 sex scene ..slow ..stupid ending...not worth seen",
            "review_date": "2018-08-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Siberia offers a good summary of all you don't want to see in a movie",
            "content": "This movie is really painful to watch. I struggled to get to the end and only to be even more disappointed when I thought it couldn't go any worst. The sex scenes don't add any value to it, rather the opposite. They're just a waste of time which could have been spent in making the diamond story more credible. It honestly looks like Reeves has been forced into them. I can see why they couldn't find a more experience (and pretty) leading actress. The script and plot are so stupid and tawdry that even a school kid could have done a better job. To make up for it, this Ularu is having the best time of her life given the annoying kissing sound she makes. My wife went to sleep halfway through the movie. Smart move",
            "review_date": "2019-02-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Such a waste",
            "content": "Despite being a fan of keanu I just couldn't like anything about this movie. A man travels to Russia to sell diamonds that disappear along with his partner who is never seen. Instead of trying to find the diamonds (his only effort is to leave messages on his partners phone) he ends up spending the time with a girl he just met. Throw in some sex scenes, a five minute shootout and roll credits. I expected so much more than this drivel. My 12 yr old could come up with a better movie than this. Seriously if you want a good keanu movie other than john wick check out \"man of tai chi' I can understand what they were going for in this film but it just doesn't work. Either make a drama OR an action movie not both. The ending was just simply rushed and to many plot holes.",
            "review_date": "2018-08-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watched this only because of Keanu, but...",
            "content": "I only watched this movie since Keanu was in it, but if you cancel him out, don't watch it. Poor story line, lack of energy, no depth and no action, and to create a total disappointment, an unbelievable bad and abrupt ending.",
            "review_date": "2019-07-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why does this movie exist",
            "content": "This movie was trash at best. Don't waste your time.",
            "review_date": "2020-11-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible: Don't Waste Your Time!",
            "content": "Watching snow melt would be infinitely more exciting than watching this clunker! No wonder I had never heard of this movie before. Absolutely terrible plot, writing, acting, and directing...other that that, it was fine! LOL",
            "review_date": "2019-02-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "keanu lost his mind",
            "content": "I thought he was desperate when he starred in that trash, KNOCK KNOCK. This was horribly worse..why would he involve himself in such a crap movie like this ? Nothing redeeming about it.",
            "review_date": "2022-03-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So...",
            "content": "After watching this 'thing' as it's pretty hard to call it a movie, we wondered 'how the hell this script went through without anyone objecting?'.Then we decided to give it 3 stars. One for Reeves, another one for visuals and last one for its crew.But, we've definitely added this director to our blacklist and will try to avoid everything he does from now on.",
            "review_date": "2022-06-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "If I did not like Keanu Reeves I would not have bothered.",
            "content": "I really wanted to like this film. It was watchable but did Keanu have to be so expressionless in it?\nI appreciate, or I assume this was intended to be of the moody genre but I have to agree with other reviewers that it really was rather flat.\nI enjoyed the setting but found the scenario with the Russian mafia boss utterly unrealistic as though it changed from the indie style to trying to be more mainstream like Keanu's other more exciting films.\nWatchable but a bit boring.",
            "review_date": "2020-10-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watch it before you judge it.",
            "content": "Keanu trying different things is awesome. Guy is putting him self out there other than John Wick or Neo and this movie is proof he can be more.",
            "review_date": "2019-10-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring, slow and a bad choice for Keanu Reeves",
            "content": "This film offers a story about diamond trafficking that could have worked well as either an action or a thriller, but in the end it is a rather dense film, with too much dramatic weight and lack of plots to fill in the holes, making it a confusing film, difficult to understand and even boring. Although the sexual tension of the leads could have been a good thing, the erotic scenes feel forced and unnecessary. Even the double oral sex scene can feel uncomfortable. As much as you pay attention, it is difficult to understand and you have to read the synopsis to understand what the hell is going on. The script is quite weak and lacks meaning and emotion and it doesn't even have a very good direction, since the film doesn't seem to know exactly where to go. The dialogues are poor and do not explain much. The concept of traffic and the Russian mafia is good, but it is very poorly planned and poorly developed. What is applaudable is the rawness that it has and how it tries to tell something real, but sadly it does not succeed. Something that can be appreciated is the participation of Keanu Reeves, which at least gives the film some life. Unfortunately, it's a bad movie whose only advantage is having a good actor in the lead. At least the final confrontation was something more or less acceptable, but with an unsatisfying ending. In conclusion, Siberia is one of the worst Keanu Reeves movies that had an interesting plot, but was poorly made, so it's not surprising that it has so many negative comments. My rating for this movie is 4/10.",
            "review_date": "2023-03-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Listless, inviting all that watch to a life inducing coma.",
            "content": "Never more than a sub-plot. Massive emphasis on really poor sex scenes and yet Hollywood are rolling their eyes sounding their drum of indignity against such things as gratuitous sex?This film is inept, if the two actors were meant to be turning on some sort of child or an old man in a dirty raincoat, then why? It is designed for Dillards with really nothing left to libve for, I mean nothing!To sex this up with the suggestion that the sex scenes at least save the film is nonsense and toe-curling. I for one expected an all action robust KR movie but it sent me to sleep.I re-watched it and it still sent me to sleep.I am in the gang of reviewers that will never watch this again in my lifetime. So 1/10. It is so poor that I feel that 1/10 is one too many.Nothing to see here . Don't download. Don't watch. It has no twists no turns. It IS embarrassing.Its end at the pictures would have seen all spilling their popcorns and rushing out of any self-respecting cinema found in any country.It's junk. I thank you.",
            "review_date": "2021-06-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Couldn't even imagine a movie can be so bad",
            "content": "I rather watch paint dry or grass grow than this awful movie again. it's trully embarrassing. there is no plot at all, the movie boring to death, and it ends in such a stupid way, totally pointless. watched it at the cinema and when it finished people stood and just laughed like \"wtf just happend here\". this is really the worst movie i've seen in my entire life",
            "review_date": "2018-10-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever",
            "content": "I can't believe I spent the time watching this. Good thing I had my phone and Facebook",
            "review_date": "2019-01-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I did not like it",
            "content": "I was expecting a lot more from this movie. Unclear story, slow plot development, a clear hint of Reeves' role as John Wick (a marketing ploy that is completely inappropriate), and a romantic story that failed to excite me. Mostly because of the cheap erotic way she was portrayed.",
            "review_date": "2019-09-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Kuanu Reeves needed a paycheck, really really bad movie!",
            "content": "The kind of movie you get when a moviestar is in need of a paycheck.\nAwful, just plain awful movie.",
            "review_date": "2018-10-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Hey, Keanu.......",
            "content": "Keanu's acting \"talent\" escapes me. I don't understand why people enjoy watching his wooden style of \"acting\". Not my cup of tea, but obviously, there are some \"mouthbreathers\" that feel he's a genuine *star*. He's not. I get that the \"Matrix\" and \"John Wick\" franchises bring in the money, but I'm rather weary of seeing such stodgy performances. Whateves, right? This is another one of his best \"plywood pieces\". Ugh. My \"3 stars\" are more than deserved on this tripe.",
            "review_date": "2022-03-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "God-awful",
            "content": "So many gratuitous sex scenes, bordering on soft-porn. Gangsters who can't just make million dollar diamond deals without the seller being forced to have oral sex in front of them, so they can be \"blood brothers\". Too many groups of people (the South Africans, the Spetznas gang, Boris Volkov, Andrei and Pyotr and our hero, the girl's immediate family and friends--but no real exposition explaining anything).When he left the girl in the hotel to give Boris the single blue diamond, I thought that he was going to get busted, giving Boris the fakie, and his \"girlfriend\" taking the real diamond and scramming. That would have been good. But nooo...can't have actual suspenseful writing. Instead, his girlfriend inexplicably shows up at the meet, and is forced to perform oral sex on the gangster, or else! Of course she leaves what she thought was going to be a cocaine-and-booze party as if she'd been raped. Well...nobody told you to infiltrate a black-market million dollar diamond deal, dummy! And why would a gangster interested in diamonds FORCE his seller to do such disgusting things?Anyway, there was way too much time spent on the stupid sex and relationship with this Katya woman, who already had a beau, apparently (and our hero Lucas already married, too), as well as her vulgar family and friends (all male by the way). Very little explanatory dialog on what's happening--what did the S. Africans want? Why did the Russian police (FSB) force Lucas to sell the fake diamonds to Boris? What was the point of that? They didn't even show the cops busting him. Instead, they said \"if you don't do this for us, Lucas, you know what will happen to the girl.\" What? I thought they were Russia's FBI? Instead, they act like gangsters.Then in the end we see the dead (but not frozen?) body of I guess is Pyotr, sitting in a chair, with bloody marks on his arms as if he died of hypothermia during a heroin overdose in some shack? If so, why wasn't he in his house? What was he doing in that little shack? How did Lucas find him? And why was Katya's brother so nice to him? And why did Lucas linger around, when he should have been on a plane outta there? And how did Boris's men find out the diamonds were fakes, if Boris himself told the spectrometer guy \"we trust him. Put it away\"? I guess they used it after his \"blood brother\" left?We never got to see the bad-ass Spetznas gang leader. And how did a fake diamond end up in a candle in the crappy Siberian motel? Pyotr left it there? Why? Did he expect Lucas to find it?The entire movie was a confusing stinker, and every 15 minutes it was sweaty, gritty soft-porn sex between big-toothed Katya and Lucas, and I disliked both of them: him, for cheating on his wife (explaining it as \"squinting\" at things? ) and her for falling so fast and hard for this inarticulate American diamond smuggler, when instead she had a good man (by all accounts), \"Anton\" to be with. No scene rang true or felt authentic. Terrible writing and screenplay. And Keanu's deadpan, boring delivery, where he says. Everything. So. Carefully. And. Disjointed--wears on you after a while. And he is given VERY little dialog, I guess to make him some \"man of mystery\".1 point for the cinematography.",
            "review_date": "2022-08-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu you can do better...",
            "content": "Just a well filmed movie giving no thrill. Can't even decide if this is an adventure or a romantic movie. Any way is just under par...",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring.",
            "content": "My boyfriend and I rented this because we like crime thriller movies. For the first hour I kept wondering when any of this \"crime thriller\" action was going to happen. Most of the movie seemed to be a lot of sex scenes, not really what I had hoped for. We both fell asleep halfway through.",
            "review_date": "2019-02-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not as bad as many are suggesting",
            "content": "Problem with watching a movie starring Keanu Reeves these days is that many expect him to be a 'Neo' or a 'John Wick' and kick ass constantly.Personally I quite enjoyed this movie and the subtleties within it that flew over most people's head who just want to see a high body count.The ending was about as abrupt as it could have been and daft. If you are hopelessly out-numbered I'd like to think that I would perform a little better.Certainly not cornering myself in from the start and completely disregard the far better weapon that dropped at his feet when shooting the guy in the doorway. Then running out into the open to become a sitting duck. Who choreographed that mess?I was rooting for the Katya crew to come and help him out and save the day - anything would have been better than - oh he's dead - the end.",
            "review_date": "2021-06-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't bother keanu did make a bad movie!",
            "content": "Boring!!!!! Super boring and weird... Thought this may involve some action but it was more like a weird love story and keanu's character was a bit. KR doesn't make bad movies, until this...",
            "review_date": "2019-11-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I would rather burn my house down! Joking",
            "content": "Say your energy and watch Baywatch ! Terrible film with no plot and a pointless ending.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "As bad as a movie can get...",
            "content": "To put it plain and simple, this movie stinks, an awful joke played on the viewer. There's no other way to describe it since nothing really makes sense in this mess. The plot is catastrophic, the acting miserable, and the ending, oh man, just beyond belief, probably designed to leave you at the verge of nausea.",
            "review_date": "2021-02-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "Thought it would be ok with Keanu in it I was wrong, its slow all the way through, no plot, boring. Got all the way through just and still dont know what the film was about fully.",
            "review_date": "2019-08-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "fantastic, especially the ending",
            "content": "Plus the director holds on establishing shots instead of rushing",
            "review_date": "2019-08-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of my time",
            "content": "I love watching Keanu Reeves' movies but this is the WORST movie he has ever acted. The plot is so boring and plain stupid.",
            "review_date": "2018-11-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What the heck????!!!!",
            "content": "No words can explain how disgusted and ripped off I feel. This movie was one of the worst that I've seen in a very long time. Laughable. Please,please,please take my advice and skip this one.",
            "review_date": "2021-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time",
            "content": "Worst movie ever!!!! I can't believe that Keanu is producer",
            "review_date": "2019-12-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dreadful",
            "content": "Such a load o drivel ... I like KR but this was awful ... it's like he's just given up and can't be arsed.No idea why the sex scenes were needed ... almost comical ... the plot was as bad.",
            "review_date": "2021-05-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just don't do it... save yourself and your soul!",
            "content": "My god... this has to be right up there with one of the worst movies I've ever seen... ever! Why would Keanu even make this trash! Worst ending I've ever seen in a movie... period!",
            "review_date": "2020-01-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Totally not worth of attention",
            "content": "All movie I was waiting for an action... none. Half of the movie they was showing sex scenes. And the ending is totally- and that's all?",
            "review_date": "2020-01-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BAD",
            "content": "\"Siberia\" is a movie that would serve as torture for one of my worst enemies. Very bad.",
            "review_date": "2018-08-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The ending takes all the potential away",
            "content": "Wow am I dissatisfied with the ending. All that trouble for nothing. Just seem like such a pointless story. The roles are well played and everything but that abrupt ending to a slow story just seems lazy and careless with an actor like Keano. It's fine that it all ends bad - but like that is just too basic and no poetry behind that. It's like taking a dump on the entire movie- not to mention us the viewer and the time we spend to get to the conclusion of nada.What a waste of time and good efforts.",
            "review_date": "2019-04-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring Film",
            "content": "Just saw this. Boring. No suspense. Fails the Bechdel test. The handful of women in this are sexual objects or bargaining chips. I'm tempted to give away the ending, but you'll have to endure the 90 minutes yourself. I didn't realize Molly Ringwald was in it. I watched it because it was shot here in Winnipeg. The Russian exteriors must've been archival footage slipped in. I recognized a few actors but the others whom I knew weren't that visible. 2 out of 5 stars. Wasted story line. Acting was average. Mood was consistently monotonous.",
            "review_date": "2018-10-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu is not good enough to hold this together.",
            "content": "Why must they be looking at each other while getting head? This, on top of everything else, is what baffled me the most.This is a bad movie. There's no other way about it. The plot is bad, the pace is bad, the acting is bad, and Keanu is not big enough to keep it together and make it worthwile.",
            "review_date": "2020-08-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu blackmailed?",
            "content": "This popped up on Netflix and as it starred Keanu Reeves, I thought I'd put it on. This was a mistake. Wooden acting (apart from the sex scenes ironically), no character development and no plot whatsoever. I can only imagine either Keanu didn't read the script before taking the job or he was blackmailed into doing it. I was left so disappointed when the end credits came up. There are many scenes that are completely irrelevant and don't provide any depth. Its basically just filler material to make the film 2 hours. Nothing of interest happens In this time. I honestly think it was written by a child.",
            "review_date": "2019-10-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "painful",
            "content": "The story sound like a action movie and the trailer looks like a action movie but its not its just Keanu reeves being a weakling getting his butt kicked by 2 guys cheating on his wife with a lady in Russia nothing the DVD cover said and there are 2 fight scenes 1 him fighting 2 guys and getting his butt kicked if everyone thinks knock knock or exposed or generation um.. henrys crime and replicas are bad movies think again stupid keanu reeves movies him getting shot and cheating on his wife this is a bad dumb dull movie with some diamond trading but boring but keanu reeves did do some good acting but bad movie dont watch it.",
            "review_date": "2023-01-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why?",
            "content": "Other people have already dumped on this piece of trash better than I can however let me reiterate... it's disgusting, perverted and disheartening.",
            "review_date": "2020-11-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Confusingly Empty",
            "content": "There was no substance to this storyline at all.Acting not the worst but nowhere near the best.I'm still trying to work out what the actual aim of this movie was.",
            "review_date": "2020-11-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "always on the surface",
            "content": "There is no depth in any scene or any character. it's starts in the middle of the story and goes on like that. events are always on the surface, you can't understand what exactly going on. \nas other people said, the end of the movie is very absurd.",
            "review_date": "2018-10-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ignore the bad reviews. This is a good movie from beginning to the end.",
            "content": "I enjoyed it very much. It definitely could have been better. This movie is a love story more than anything.",
            "review_date": "2019-04-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Quality and Betrayal",
            "content": "Keanu Reeves broke thru his type cast with Bill & Ted and is now an actor to be taken seriously. It's refreshing to see an actor develop. Especially ones who are \"older.\"\n I've really enjoyed the recent John Wick films.\n The style, slow burn pace and art is impressive. The story isn't new so it's style over substance without being superficial or throwing around sparkly things.\n For 97 minutes I was watching a film I expected to linger with me and add to my list of favorites or recommend to others.\n And then, it nose dived within the span of a heart beat.\n I despise Hollywood endings. Hollywood's own ineptness is what churns out one bad vacuous movie after another.\n Foreign film is so much more honest. I'm not saying that as a pretentious film snob.\n I was prepared and hopeful to give this a 7 or 8 (to be more accurate, 7.5/10).\nIn the end, we were left with a story lacking redeeming qualities. Just 7 more minutes to make things right.\n As to others giving the film a 1/10 - because there isn't a zero - they have been betrayed and striking back.\n There is quite a lot of excellent elements and direction.\n The minimalism is a key factor.\n The filming was subtle although detailed.\nIf you do watch, watch as a student of sorts, not as the audience and take from it what you will.",
            "review_date": "2018-07-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why Kevin !!",
            "content": "A boring film is a porno film closer to a movie that makes you enjoy a dramatic",
            "review_date": "2018-08-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "I just watched this on a famous streaming website as it looked.the best they had. This movie was so bad I have cancelled my subscription. The worst ending I think I have ever seen and keanu Reeves playing a cheap John wick. This is up there when I took my 5 year old to see the emoji movie and I would say that movie was slightly.better. do not waste your money or time.",
            "review_date": "2019-06-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad acting, no story.",
            "content": "Thought it's going to be a great movie as Keanu Reeves was the main character. What a disappointment and waste of time. It was boring, packed with bad acting and pathetic sex scenes trying to cover up that this movie has nothing else to offer. Could not even watch it to the end.",
            "review_date": "2019-05-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cold shot",
            "content": "A nonsensical loss of time and space, no plot, an inconsistent development of events, basical acting, inexistent dialogues, a vodka shot Is even quicker and more exalting than this two Hours mobile.",
            "review_date": "2021-04-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terrible",
            "content": "Do not waste your life trying to be entertained by this catastrophe of a movie. Shockingly bad.",
            "review_date": "2019-05-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So you're thing,\"This isn't THAT bad...\"",
            "content": "But then you manage to make it to the end. That is where the whole thing just splats for want of a different word. I did not find any of the characters all that likable but I kept watching anyway and was left feeling like a deflated party balloon by the end. We watched it for free, I certainly wouldn't pay a penny to watch it, the waisting of my time was cost enough.",
            "review_date": "2021-04-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Money, money, money",
            "content": "John Wick 2014 Fantastic\nJohn Wick 2 2017 ok\nSiberia 2018 RubbishMy only thought why the Super Star of Matrixes, Sandra Bullock bus, John Wick 1,2,3 and then this Rubbish, Nonsense is $$$\nCheck it out, he's the producer also. Explains all the F&$king episodes with sexy Anna. Never thought Keanu would agree to be part of this project, which is mediocre at best and Trash at worse.No spoiler. Sit through this at your own peril.",
            "review_date": "2021-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This is the end...",
            "content": "Slow pace movie with poor story and stupid ending.Oh yeah, and bte Keanu is suddenly shooting like a pro hitting everything that moves, he even hits half hidden targets with one bullet, with some old rifle, being alone against 7 mafia killers with top machine guns.\nAnd then as you , at least , start hoping for a miracle he's finally shot after killing 6. and that's it. The end.P.S. Why was he pouring oil all over that cottage when I can't remember that he lit fire later?",
            "review_date": "2020-08-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Underrated story telling at it's best",
            "content": "Siberia is film making at it's best. I was quite surprised to see this film garnering negative reviews almost across the board. It seems most likely that people went into this film with John Wick on their minds, which I think is unavoidable and automatic. Even I began watching Siberia with thoughts of Wick in the back of my head. It's hard not to. However this is not John Wick or even an action film. The association with the Wick Series is apparent throughout the film. The same sets, clothing, accents, and even the main character's demeanour lends it's self to comparison. I think the association with Wick has doomed Siberia by creating a failure of expectations.Had this film been made in distance from the Wick series, it would be easier for viewers to appreciate the nuances that for me, made this film so powerful. On so many levels this film shined, in character development, in story, or how the film maker took a traditional Hollywood theme and made it their own. And it is on this last point that will make this film in hindsight a great film. It stands out from other films with the same goal in mind, to gain wealth from diamonds by providing a fresh platform that all other films seem to recycle through.The feel of the film seems to mix up past genres in small doses, a bit of Film Noir, old spy films, and Hitchcock. The interlacing of ethics and morals and choices characters are faced with creates high drama at various points through the film, and yet it is all so subtle. Even the apex of the film is hardly recognised due to the seemingly slow pace delivery, and yet watching the character's expression and acting captures the viewer in that moment of anguish and anxiety.The ending sequences are full of promise and that promise remains until the very end. While one's optimism might lead you to think of the old west gunfighter on a dusty street, the arch of the moment steals the viewer's momentum. It doesn't end with a bang as one would expect from characters we are invested in, or the star power of Mr. Reeves, but instead with a whimper. Yet it is realistic to the end.For those willing to look past the John Wick comparison, the viewer is treated to a well honed story that could have easily become convoluted. That the story escaped so many typical tricks and cliches of film making deserves to be applauded. I was left in the end, feeling invested in the two main characters, and empathised with their journey, and also feelings like I have watched something fresh and yet so old and time honoured.",
            "review_date": "2019-01-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Rubbish",
            "content": "Poor plot that makes little sense. Something about diamonds and a lost friend. The rest is just gibberish. Don't go into an armed standoff against special forces with a hunting rifle...duh.",
            "review_date": "2021-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "respect for the whole team in this movie",
            "content": "Respect for the whole team in this movie Respect for mister K and for romanian actress",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not sure what movie the other reviewers watched",
            "content": "This movie is dire. Unfortunately IMBD doesn't offer the option for zero star reviews, but that's what I want to rate it. It isn't even \"so bad it's good\", just pure crud. Don't waste your time.",
            "review_date": "2021-10-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrid English/Russian subs",
            "content": "Netflix watcher: Whoever did the selective subtitles needs a career change. Maybe it's my TV. There's a lot of Russian dialog that's important. But then there's English subtitles, and I can't help but read them. Bad form. Maybe I'm just an entitled American, sorry, planet.",
            "review_date": "2022-03-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie DOES NOT deserve a sub-5 rating",
            "content": "If you like action with a bit of romance and keanu's hallmark awkard badassery... You wont be disappointed. Rated 10 for enjoyment, start to finish.",
            "review_date": "2018-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful and boring.",
            "content": "I didn't know Keanu had started making porn. This movie was just boring and ridiculously hard to follow. I am hugely disappointed in the last few movies h's done. Won't waste my time watching any in the future. Do yourself a favor and pass on this.",
            "review_date": "2020-07-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ugh. This again!",
            "content": "The film was entertaining enough if you don't over think it, but the whole story is made pointless by the ending. I guess there was supposed to be a sacrifice, but you would never be able to tell because of the badly written ending.This sort of writing is sadly becoming more popular although it extremely rarely works. Most who attempt it just ruin the whole film, like this one.",
            "review_date": "2021-06-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "Do not waste your time watching this awful movie. Poor keanu",
            "review_date": "2019-04-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What did i watch?!! a total trash",
            "content": "Curious coz its keanu reeves but other than him in this movies, the writing, plot, etch is totally trash.. the main actress is just as stuff as a stick, lots of russian movie star, why did they cast her?!!!!",
            "review_date": "2020-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why? Why? Why?",
            "content": "Why did I waste my time? Why? Why? Why? Please do not watch this movie... I have no Words to describe it. Just don't watch it.. please.........",
            "review_date": "2019-04-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "just not your regular plot",
            "content": "I give 8 just because everyone's giving a bad rating to it. The ending is not like what you think or hope, so what? it's like you guys cry every time someone else have their own perspective? you guys remember this kind of movie like Maggie (2015) and other long , slow pace, and gloomy nuance movie like this, but this movie IS WELL PRODUCED, i give you that.",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "I sat for about 50 minutes waiting for some kind of action but it was so awful I had to hit the switch.",
            "review_date": "2020-01-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What a shame!",
            "content": "Good, good, good (30 mins in), mediocre, mediocre, mediocre (1 hr in - realise it's probably continuing to go down hill), bad, bad, bad (ending) rOBHO (Russian for s**t!)",
            "review_date": "2019-06-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Could be a porno with pretty good story and plot",
            "content": "Think of it to be a porno and it be pretty good. If you want an action packed movie this is not it. Keanu Reeves gets his ass kicked.",
            "review_date": "2018-08-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The point being?",
            "content": "Wow, one doesn't expect such a terrible movie from an actor like this. During the movie you're thinking \"it must lead to something\". No! To nothing. I've should have read the reviews, what a waste of time.",
            "review_date": "2018-08-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why did Keanu pick this script!!",
            "content": "Love Keanu but not even he could save this movie. I cannot believe he would have chosen this script! I fell asleep through it twice which will probably give you a hint of how boring I found it. If it was not for the fact that I am OCD about finishing things I start, I would probably have given up after the first ten mins. There is no drama, little action, boring characters and considering it is billed as a romance, no romance! The two main characters met said a few meaningless words, slept together, said a few more words slept together again yada yada and we are supposed to believe romance in what appears to be a short week. I don't normally give bad reviews or when I do I try to find something like but there is nothing. Scratch that I liked the end credits.",
            "review_date": "2022-11-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Now would be a good time to check your emails",
            "content": "If you are expecting some sort of John Wick spin off you will be in for a shock and I advise you keep looking, yes he puts on a suit and the dialogue I think is copied on Wick but OMG its not a fraction of the action. the movie story evolves at a near Geological pace. My teenage son jumped up at the end shouting is that it !!! I have nothing to say on this movie positive, and I'm not going to mention the dog, Oh deer",
            "review_date": "2019-05-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's become not just boring but painful to watch",
            "content": "For goodness sake do you have in holiwood any Russian life experts? All these nightmare fantasies films about Russian barbarians become not just boring but making sick to watch. Russian have more respect to foreigners and hospitality than you may imagine. Making films about Russians and thinking they behaviour such Americans is not just poor and amature but thick. Russians do not have dated gas cookers, interiors and clothing that filmed. They are also more smart and clever than usually presented. Siberian people are more kind, tough and helpful than Europeans. Despite the usual good acting, Keanu reeves unfortunately unable to save this trust from leaving a sick aftertaste and desire to forget this movie and regret about the waste of the time for watching it.",
            "review_date": "2018-10-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Garbage",
            "content": "Warning, stay away from this film. Can't believe Keanu took part in this one. He must have been gone beyond all senses when he read the script.",
            "review_date": "2019-05-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Someone should review the movies before put them on screens",
            "content": "I had the idea that movies starring actors like Keanu Reeves were a guarantee of a minimum of quality (a minimum), but this movie has given me a reality slap. It's so flawed that it really embarrasses me that I wasted my time watching this movie. Regrettable.",
            "review_date": "2022-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Damn",
            "content": "Should've not listen to my wife and watch this bloody movie",
            "review_date": "2020-07-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What are friends for",
            "content": "So the movie was so so and i pretty much just wanted to watch Keanu naked but my major take away about the movie is the importance of friendship and brotherhood. Hill and his wife being old friends who squint at the flaws of each other. Forming alliances with Katya's brothers though in the beginning was sour towards Keanus character but in the end, was strong and brotherly. Pyotr who Hill trusted failed him which led to his demise. In the end, Hill paid the ultimate price for the love of his wife and Katya, to sacrifice himself but not without a fight.",
            "review_date": "2019-03-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tedious, visually unappealing, and depressing.",
            "content": "Recipe for Siberia: Throw a large bunch of stereotypes into a pot with a handful of unlikeable characters, add vodka and stir. Strain carefully to remove any semblance of a plot or decent ending. There you have it. Siberia. Pour it out and walk away.",
            "review_date": "2020-04-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible!",
            "content": "Waste of time and energy! This could be way better but story is slow, boring and it's kinda not connected. Definitely the worst Keanu's movie ever!",
            "review_date": "2019-11-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not worth your time to watch",
            "content": "The director (Reeves) of this should have payed more attention to the characters. Keanu Reeves looked FAR too much like John Wick, even down to the clothes and the hair style. It would have been better if they had played up the original intention instead of wasting so much time on the love affair itself. It took up too much of a film that might have been better.Lucas' dialogue was the pits to say the least. He even SOUNDED like John Wick in his lines. He was supposed to speak and understand Russian but too many times he just stared at the other men and said nothing or just shook his head. Too much silence.The two days he was given to get the diamonds was more like four or five actually once you counted the days, nights and plane time. Those must really be fast planesIn the end, Keanu Reeves should stick with John Wick. He is far better at that.",
            "review_date": "2022-03-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "T h e _ w o r s t _ K e a n u _ m o v i e _ e v e r",
            "content": "Deadening slow story. He and she are the only good actors. Even the erotic scenes were worst. Scheity ending.",
            "review_date": "2019-04-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst movie you can ever see",
            "content": "The worst movie you can ever see.\nThere is no even a correct subject for this movie all is nonsense",
            "review_date": "2019-10-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dreadful",
            "content": "This was worthless. Don't waste your time watching it.",
            "review_date": "2019-04-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pointless",
            "content": "Pointless in every way. Scratch you head going through the movie trying to make connections and figure out something deeper then the straightforward story being told, pointless it is as straightforward as it seems.No great action, no surprise no feeling of connection with the characters.",
            "review_date": "2021-05-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What the f* i have seen?",
            "content": "Worst movie ever. I dont know how this movie is rated 4.3",
            "review_date": "2020-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "a meditation on how quickly things can go wrong",
            "content": "This isn't a balls to the wall action thriller a la John Wick. It's not a steamy romance movie, either. To me, it's a meditation on how quickly things can go wrong. How little of life is in our control, and how sometimes you just are swept up in things without any time to really understand.There are certainly elements of both action and romance, of course. Keanu Reeves plays Lucas, a humble salesman dealing with a particularly large diamond deal. Things go wrong from the very beginning, and we follow Keanu as he searches for a missing business partner who has already set a string of events in motion which were (to me) always inescapable.What feels initially like a straightforward gangster diamond deal flick then takes a sudden turn when Lucas crosses paths with a beautiful bar owner. What is initially a run of the mill episode of a salesman husband cheating on the road turns into something surprising for both viewer and Lucas.After some time exploring this strange and beautiful relationship Lucas has stumbled across we return to the tale of diamonds, and things continue to get worse and worse here. Once again, it seems to me that this is all largely out of Lucas's control. Keanu does an excellent job of portraying someone who is trying hard to make the best of the terrible hand he's been dealt.Eventually, Lucas has to make a tough decision. In some sense, we see Keanu make a much more difficult and masculine decision than he ever did in John Wick. He quietly shoulders all the responsibility for things beyond his control, likely saving the lives of the two women who meant something to him.The important thing to me with this movie is that it's almost completely believable. In real life things are messy, the protagonist isn't always a hero, but he/she probably does mostly try to do right. Most importantly, in real life things don't always end in a satisfying way. Sometimes they just end, and it's up to you to find your own meaning in the randomness of the experience.",
            "review_date": "2022-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WORST MOVIE EVER",
            "content": "Cant remember the last time I spent two hours of my life watching rubish!! Do yourself a favor and don't even consider watching this movie!\nI feel sorry for Keanu!! Second terrible movie in a row!!",
            "review_date": "2018-11-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Something New and out of the ordinary !",
            "content": "I really despise a basic formulaic knowing what to expect \"Love Story\". Unless it involves a Cary Grant / Grace Kelly etc.... vibe in that time period. \"Siberia\" is an unconventional take on your basic love affair / story. The film begins one way, and goes in many directions with Reeves and Ularu serving as the grounding factor that makes you want to keep watching. Reeves is his usual minimalistic self, a technique which he owns perfectly. And Ularu gives a stellar performance exercising her brilliant acting chops in all its splendor for all to see! If you want to see something thats not run of the mill, give Siberia a shot. You won't be disappointed ! Director Matthew Ross succeeds in bringing his vision across brilliantly.Check it out !\nSammy Peralta\n(Actor, Recording Artist, Producer)",
            "review_date": "2018-07-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Weakest film plot ever seen",
            "content": "Terrible film, is it a love film or what? Nobody knows..",
            "review_date": "2021-05-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What was that??",
            "content": "No other words. I've been watching it during a flight, but, I'm sure I could spent 2 hours much better, just watching the clouds beyond the plane.",
            "review_date": "2019-03-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very very bad",
            "content": "For real people. Don't waste your time watching this crap movie.",
            "review_date": "2018-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dear oh dear",
            "content": "If I could turn back time I'd have read some of these reviews, complete and utter garbage. It's so bad I felt i had to create an account just to write this review. And that 1 star really means zero star but I had to put 1 star for the review.",
            "review_date": "2021-05-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Complete waste of time.",
            "content": "Possibly worst acting of most of the cast, especially the female lead.",
            "review_date": "2021-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Mindnumbingly Atrocious.",
            "content": "It had all the promise of a good film - the beginning should have worked out and developed into a good story. I kept on thinking, \"It's got to get better! It's got to get better!\"\nAlas, I was wrong. The storyline never got out of 'neutral' and halfway worked itself into 'park' - where it stayed.\nThe sex scenes were as titillating as dried vomit on the pavement. This film cost me 2 valueble hours of my life which I'll never get back.\nKeanu Reeves muct have been really hungry to have made this turd of a film.",
            "review_date": "2020-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not what I was expecting..",
            "content": "From the description I thought this would be a mini version of John Wick on a budget. Boy was I wrong. There was way too much sex in it and it drug on with a very lackluster ending. I'm very surprise Keanu Reeves even acted in this. NOT a date night movie.",
            "review_date": "2019-01-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Actually a very good movie",
            "content": "At minimum watch the John Wick series before you watch Siberia. Then you will understand more about this movie, especially the ending. The plot was nuanced and intriguing. I thought the entire cast did a good job with their character portrayals.",
            "review_date": "2018-08-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wow, Just waiting for part 2!!",
            "content": "If there was an expectation coming into this movie, then I can understand. The hero didn't win, the movie didnt end. This movie did what most movies should be doing today in 2018. It left you waiting going what the #@$K just happened. From beginning to end we barely knew much about the star. The sound engineer,the atmosphere of the cold white north stole the movie. It was the humble beginning to a magical work of art. This movie will be applauded years after... which is always the best. Matthew Ross ... unbelievable... cinematography",
            "review_date": "2018-10-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Seriously? I like it!",
            "content": "I really don't understand all the hate about the movie. It's not a happy ending movie. We get that. It's a movie that portraits the cruelty of the mafia and the price you'll pay if something's get wrong. It's not a fairy tale. It's the dark and cold brutality of what happens when you get off the track. Forget John Wick. Lucas is just a salesman. He was genuinely real, a guy who meets a beautiful barmaid and fell in love with her, a thing that he obviously didn't have from his wife. Keanu was Keanu. Ana was simply amazing. That scene when she made him call her by the wife's name... damn!! So cringe and intense at the same time!! I don't like to see Keanu dead, but that's the whole point of the movie. He failed, he dies. And with him, all the hopes and love.",
            "review_date": "2018-07-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I Watched The Whole Thing",
            "content": "I'll watch anything with K. R. in it. I'm a fan of the guy and maybe I'm spoiled by his other movies.Giving it a seven because of Keanu. I understood the plot and where we were headed and the love interest.I enjoyed the back and forth between Reeves and Ularu. The chemistry was believable. But this either needs to be an action film or a romance. It can't be both.I got kind of a Lake House vibe with Russian gangsters.Liked the scenes with the Katyas brothers and friends.Then I saw the black suit with black shirt and tie and I thought, \"Here we go!\"SPOILERBut no, John Wick only killed about four or five guys and gets punked by the big bads unimpressive wanna-be tough guy lackey.The ending left a lot to be desired. The whole movie just needed more weight. Very thin.",
            "review_date": "2022-10-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wrote main character to be an idiot",
            "content": "The writes did a poor job in this one - Keanu should have insisted they fix the script.",
            "review_date": "2019-10-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boring!",
            "content": "It's the only word I can imagine after that movie. Boring!",
            "review_date": "2019-02-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dull and boring",
            "content": "The one moment I had to laugh at was the bald naked dead guy in the outside shack had his head in his right leaning in his right shoulder then when keanu entered for close look it head was on the left shoulder then comes out the shack it was was on the right again! How could they have missed this I noticed this mess straight away. How embarrassing.Keanu can do much better thsn this Bland movie.",
            "review_date": "2021-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Where the director should be sent.",
            "content": "Siberia is an unbearable slog of a film. Reeves character is wooden, even by Reeves' standard, caught up in an unimaginably awkward relationship with Katya played by Ana Ularu whose performance here might actually be career ending. The movie actually makes more sense if you don't speak Russian and turn off the subtitles.\nNary a drop of suspense or unpredictability, Siberia's only real mystery is why anyone would choose to produce such a work of utter junk.",
            "review_date": "2020-08-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Started good, ended poor .. wasted my time",
            "content": "I felt the movie director had no money left in his budget to finish the movie😂😂😂😂😂",
            "review_date": "2018-11-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time",
            "content": "Don't watch it, you will be very disappointed.\nEven Keanu Reeves can save this poor, poor screenplay.",
            "review_date": "2018-08-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Talented Acting, Convoluted Storytelling & Terrible Plot.",
            "content": "Good news and bad news.The good news is Ana Ularu (Katya) absolutely shines as the damsel in distress as the many facets of her character plays off in a subtle and heart-wrenchingly beautiful way through her thoughtful, seductive and adorable acting. She is the very reason I would rate anymore than a single star. I really wish her the best in her career, and hope she continues to blossom.The bad news is a handful. To begin with, Keanu's acting was typical of his stoic, nonchalant, conserved style - yet it becomes deeply problematic in the setting of this film. The decision of casting him as Lucas is puzzling. Lucas (Keanu's character) is a multi-faced, convoluted, at times a victim of cowardice yet simultaneously a courageous man capable of commendable acts of heroism. This requires an extremely subtle, sensuous portrayal that does not fit Keanu's acting profile at all. One could immediately recognize the disparity between personas in the numerous sex scenes between him and Ana - metaphorically, with her presence Keanu almost strikes as an amateur, heedless virgin who is not sure whether he should put his hands on her waist, or on her breasts. Ironically, his character Lucas, is supposed to be a 51 year old, married, shrewd, successful and experienced diamond smuggler. It is just out of proportion. In an attempt to finally mobilize Keanu's talent as an action-thriller superstar, the film ends with its only shootout sequence between him and 4 Russian gangsters who aren't even clothed with body armor. Yet it is of little to no consolation to both Keanu and fans of his work, as regardless of a vaguely pathetic shoot-out near a cabin in the woods (which supposedly serves as the exhilarating coda to all the build-up and suspense), Keanu suffers a tragic death being blasted into oblivion by a smug Russian Pablo-Escobar-lookalike thug shouldering a 12-gauge shotgun. We catch one final camera shot of Keanu's dead lifeless face on the ground, which is followed by somber music and rolling credits. To that I say: What the f.Besides the troubling casting decisions of the film's male protagonist, the larger storytelling and plot is probably even more to blame in terms of its stodgy approach in narrating a potentially intriguing set of events, and the sloppy, contrived design of the larger blueprint. A few examples and comparisons could help clarify this phenomenon.In terms of the uninspired storytelling, one could take the instance in which the story fails to make much sense when Lucas's perfectly harmonious marriage (suggestive of him skype calling his wife back home as he is on business trips), is immediately followed by his seeking out of Katya at 2am in the morning and having \"hot-rodeo-sex\" right on the couch of the empty bar. Okay, perhaps one could argue it's the duality of man. Sure, then what about the other case that could be made for an earlier sequence, when 2 drunk Russian cretins decide to ambush a tipsy Lucas and as one of them lays a hand on Lucas's shoulder, Lucas responds with disquieting speed as he counters the assailant in the stomach with a well aimed uppercut? So it seems our protagonist clearly is an advanced combatant with a high level of vigilance even when drunk - yet, a sucker punch (which ended the bar-fight sequence) to Lucas's face is supposed to knock him unconscious outside in the snow for ages until the bar closes and our dear Katya discovers his seemingly lifeless body? It just doesn't make sense. The story even teases us with potentials for exciting conflicts between Lucas and rogue special forces (Spetnaz) within his conversation with an associate's brother, yet it all accumulates to nothing but disappointment and a lingering sense of profuse confusion. So perhaps this truly was just supposed to be a softcore-porn/rugged-romance thriller. If so, don't give clues/hints of no avail! If so, don't cast an action star such as Keanu!To further the already illogical storytelling, the plot is its \"blood-brother\". It seems overtly contrived in moments as various scenic settings are reminiscent of Keanu's iconic \"John Wick\" style, with lavish, eastern European ecclesiastical architecture and illegal indulgences that insinuate the degenerate socialite lifestyle. Yet on the other hand, another 50% of the film takes place in what one could only describe as a resemblance of \"Old McDonald had a farm\" except it's in Siberia. It's just as confusing for both the viewer, as it probably was for our poor Keanu who just seems terribly out of place standing in front of Katya's earthly, pastoral wooden house, while he himself sports either a Porsche or Land-rover and expensive clothes... In one moment, Keanu is singing Russian drinking songs with rural locals in the Siberian forest exchanging cheeky Russian aphorisms - the next, he is sitting in a private club of a Russian gangster and coerced into instructing Katya to suck the other mans penis in participation in some grotesque ceremony of brotherly bondage... The list continues since there is just too many totally contradicting elements one could name, and even if this is some sort of artistic literary fusion of juxtaposition, it fails to achieve harmony. Ultimately, despite its best attempts, the film fails miserably in its marriage of its cast and plot, and if anything, it again just leaves the viewer unsatisfied both ways. Neither is the action thriller that never was, nor is the memorable love affair that seemed to never be.(This review has no intention in critiquing the character, aptitude and accomplishment of any of its actors. It is merely a commentary upon the objective work as a whole!)",
            "review_date": "2022-10-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "PSA",
            "content": "PUBLIC SERVICE ANNOUNCEMENTWell, there's 104 minutes of my life I'll never get back. One star is generous. Pet Peeve: When movies end abruptly, leave you hanging, with no real \"end\" to the storyline. It's so frustrating after investing a chunk of time (104 minutes, for example), getting emotionally invested in a movie, waiting for a fabulous ending, all wrapped up in a bow. Then the final credits start rolling up the screen. Really??!!?? That's the end? That's no ending! You've gotta be kidding. This is one of THOSE endings, and my whole purpose of this review.Groan. \nProceed at your own risk.",
            "review_date": "2018-08-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Somewhat good movie but weak climax (Spoiler!)",
            "content": "This movie has Keanu, so it has a fairly good storyline, similar to John Wick, but in Russia. With a decent love and sex interest. But he does gets his butt kicked for a changed. It's a fairly good, but somewhat weak story, that builds to a pretty good climax but then the writer and director just jump off a cliff with the ending! What a Horrible, weak and lazy ending!!! And this ruins to time invested in watching this movie. It has so much more potential.",
            "review_date": "2021-05-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Hatefully bad",
            "content": "The worst movie I've ever seen. I'm here wondering why I kept watching this after some f*ucking bad scenes. God, I'm very mad with myself.",
            "review_date": "2019-05-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very bad movie",
            "content": "It's just really bad. It's just really bad. It's just really bad. It's just really bad.",
            "review_date": "2018-11-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "delving into a screenwriters mind",
            "content": "This movie is nothing short of one authors journey to live out their fantasy of cuckoldry. Just goes to show that just because you have great actors doesnt mean a film can be saved, well unless that sort of thing is your kink.",
            "review_date": "2021-04-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What did I just watch?",
            "content": "Don't watch the movie by trusting Keanu in it. I've just lost one and a half hour of my life.",
            "review_date": "2018-11-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Totally stupid",
            "content": "One of the worse movies I have seen in the last 40 years, if not the worse....",
            "review_date": "2020-02-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Enoyable slow paced drama with tension below the surface",
            "content": "It's slow paced but great to watch when you want a film you can relax to but still be engrossed in how the plot progresses.\nMost other reviews seem to have expected to get another Jon Wick but this is different. I commend Keanu for not doing what other big A-listers do and just stick to the same movie types (Tom Cruise is a good example).",
            "review_date": "2018-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wanted it to be good",
            "content": "I think there is something lost in translation here....\nHad potential to be good but that must have gotten edited out and the story was lost.",
            "review_date": "2018-09-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Now I know why",
            "content": "I've never heard of this one.\nHe isn't Johnny Utah, John Wick or The One.\nHe tried, and that's about it.",
            "review_date": "2021-01-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What the f",
            "content": "Worst ending to a movie ever seen. What was the point.",
            "review_date": "2018-08-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It was ok. Not good just ok",
            "content": "It was alright until it got sleazy with the partner swapping scene and then thought what??. After that thought there was more to come then Lucas dies. Could have been so much better. Shame. On the plus side side there have been worse movies.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "waste of time.",
            "content": "Really shocked to see John wick here at this level.",
            "review_date": "2018-08-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "POOR",
            "content": "Shame. Worst movie I have have ever seen. Low budget! Bad acting and dialogue. A total waste of two hours.",
            "review_date": "2018-10-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Total CRAP",
            "content": "Here's a better plot. In the first 10 minutes Reeves goes down on the Russian. Reeves bites, the Russian bleeds to death, Russian henchmen kill Reeves. His body is thrown out into the wilderness and the bears and wolves feed on it, leaving no trace behind. Ringwold learns of his death and goes to Siberia to avenge his death. Kills all the Russian henchmen, takes the 50 million dollars instead of the fake blue diamonds. Before leaving Siberia she stops into the café where Katya works, their eyes meet, they fall in love, Ringwold takes Katya back to America where they get married in California and live lives of leisure on the 50 million dollars. If you think this plot seems weird, just waste your time watching this movie.",
            "review_date": "2019-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Still Waiting",
            "content": "Still waiting for the storyline to begin....love Keanu but this is just a mess of a movie....not got a clue what it was about!!!",
            "review_date": "2019-05-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The title should have been SI-WASTEYOURTIME-RIA",
            "content": "I really love Keanu and I was really excided for this movie.I had seen the trailers and it seem a really good thriller film with lots of suspence and with a catchy story.Unfortunately thet only action in the whole film lasted for 3 minutes.The other one hour and a half was filled with unessesary sex scenes (every five minutes there was a full sex scene involving Lucas (Keanu Reeves) and Katya (Ana Ularu)) and Keanu Reeves showing off how well he knows how to speak other languages.I found nothing interesting in this novie and I would definately not recommend it to someone else nor watch it again by myself.This movie (no matter how much I love Keanu and appreciate his work throghout the years) is a big no-no for me.",
            "review_date": "2018-08-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I wish I read the reviews before watching!",
            "content": "I usually don't write reviews for each film but this film deserves my attention. I lost 2 precious hours of my life with no sense. This film is full of banality and at some points is disgusting. There is no real beginning and end. It spots middle of an action and is just a small piece of the whole story which we can only imagine.The worst film!",
            "review_date": "2018-10-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "AVOID LIKE THE PLAGUE!",
            "content": "One of the worst movies I have ever seen. This is the second movie I have watched with Keanu Reeves that I couldn't make it to the end. I don't think he can act at all. Even the good movies he's been in his acting is poor.",
            "review_date": "2021-05-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Fail",
            "content": "Worst movie I have ever seen, don't waste tour time watching it!",
            "review_date": "2018-10-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu, give me back my ticket's fund!",
            "content": "Can i just leave the theater earlier?!\nIt's so boring and flat and tasteless.",
            "review_date": "2018-08-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A scam not a movie !!!",
            "content": "Very flat film with no relief, pretentious limit, it would make us believe that it will happen very exciting situations but none of that. We stay all the time in an extremely superficial film that wants to play in the big leagues and is actually a serie B at best. The characters are very little alive, it gets bogged down very quickly in a freezing cold, although Siberia is absent, it is only against the Russian mobsters and this \"couple\" who is not one .\nI was disappointed and had the impression of being anarched ... waste of time.",
            "review_date": "2018-08-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Seek help if you watch this till the end.",
            "content": "Why why why did I sit through this utter drivel till the end , I didn't even understand what was going on .As some said in another review Keanu Reaves must have been due someone a favour.",
            "review_date": "2021-04-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I spent 2h of my life, I want it back!",
            "content": "What was the point of this movie? What did we find out more or how did we improve as people?\nWas the only point that you need to hold and hug your wife after making love to her? There was nothing more to take with me from this time spent.\nReally disappointing.\nEven action scenes were boring :(",
            "review_date": "2018-08-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst then sitting ideal",
            "content": "What a waste of efforts & resources from director, Someone would expect better from Keanu at-least, No story no direction no logic no sense. ABSOLUTELY NONSENSE",
            "review_date": "2019-10-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What were they all thinking?",
            "content": "You have to wonder how these projects get funded and get finished. \nI suppose having Keanu committed was the main push. \nA lot of talented people were involved and got paid but the end results are not much. \nAna Ularu is the best part but there isn't much of a role for her here. Keanu's range is challenged once again. He is pretty hard to take seriously in these roles. You would think that the sex scenes might make it worth a look but not even. \nIt's really too bad!",
            "review_date": "2018-10-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "TOTAL waste of time",
            "content": "This is one of the dumbest films I've seen in my 52 years! The movie is like an attempt of a seven-year-old ! I assume they didn't spend much money on making it judgning by poor Keanu Rives who has spent the entire movie wearing the same clothes! If it wasn't for Keanu, I wouldn't have spent 10 minutes watching it!",
            "review_date": "2020-01-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why?",
            "content": "Why would Keanu Reeves commit to such a movie after coming off of such a great run with the John Wick movies?\nThe movie in my opinion had a just enough plot to keep you hanging on hoping for something to come along to save it but sadly it progressively got worse and then the ending was beyond bad. Major disappointment IMHO and I seriously tried to like it.",
            "review_date": "2019-02-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "Waste of time, money and patience. It's offensively stupid",
            "review_date": "2018-10-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The harsh criticism of others is wrong",
            "content": "Clearly many of the other reviewers have missed the movie synopsis and were expecting something else. This movie is worth a great deal more than the multiple ones it has received.I enjoyed the story, the acting and I enjoyed the pace. This won't win awards, but it is a different take on a love story, cleverly done.Each to their own, but worth the watch...in my humble opinion.",
            "review_date": "2019-04-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I can't believe I didn't read the reviews.",
            "content": "Put the washing machine on and sit in front of it for two hours instead of watching this film. It'll be more fun.",
            "review_date": "2019-10-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Enjoyable",
            "content": "This film was simple, & concise. We knew what was going on and what the characters were going through. Enjoyed the pacing. Not a lot of filler, or wasteful, scenes to extend the film. Performances were quietly intense. Enjoyed the chemistry between main characters.",
            "review_date": "2018-07-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not the best but not bad",
            "content": "When u watch it then u gotta read between the lines of what it's really about . it's not a happy movie but it's not the worst movie I ever rented from redbox . I've rented plenty of duds . this isn't a bad movie . it's a drama . it's put together all right . it's more realistic than it is fantasy . this is like John wick goes to Siberia before he comes back to life and becomes John wick . . it's something to watch before bed and go to sleep . You have to get into the story and pay attention is all . it's not bad actually but too realistic for most people .",
            "review_date": "2018-10-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Deserves a wider release.",
            "content": "I rented this movie on demand but I wish I could have seen it at the theater. Wonderful scenery in the movie. All of the actors gave superb performances. Especially Keanu Reeves and Ana Ularu. They are perfectly matched. This is a very different role for Keanu Reeves and he is great in it. Don't miss it if you are a Keanu fan.",
            "review_date": "2018-07-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst movie of 2018",
            "content": "This is simply the worst movie I have watched in 2018. Nothing heppens, no plot. Can not belive he played in this movie after reading the script.",
            "review_date": "2018-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Siberia is a movie about relationships between people...",
            "content": "First of all, I must sincerely admit that I've been immensely thrilled about this movie since I read its short synopsis and later saw the first picture of Keanu from the set in Winnipeg, Canada, and afterwards, I became even more worked up about the fan updates, photos which many of them graciously shared on their social media. I was following all the news with meticulous attention, very carefully analyzing videos regularly recorded by people equally interested in the film plot and especially one of its cast member, thanks to whom I found out about this indie production. But for him, I'm more than sure that I would have never come across it. When I first saw a trailer, I felt even more curious and eager than before and when so many bad opinions popped up about Siberia, I felt almost obliged to share with you my own insights and impressions. I started watching the movie in the late night and was a bit afraid of what I read in most of the reviews that the movie makes you fall asleep after very first minutes of its length. It is definitely not an action-packed flick with many plot twists incessantly bumping up your emotions. It is not an artistic masterpiece or a typical romance film about two characters ideally tailored to each other. Nonetheless, it is indeed a very engaging, original, intriguing production touching some a bit psychological issues of our lives. I know there are many people, so-called film critics, who consider it as a dull, lacking emotions, action, pace, chemistry between the leading actors, soporific low-budget film. I can't agree with any of these points, I didn't feel sleepy at any time or scene when I was watching it with unchangeably interest, and enthrallment with its very Russian, enchanting music composed by Daniel Bensi and Saunder Jurriaans. I think that the movie gains a lot also thanks to wonderful exterior shots of Saint Petersburg and real Siberian woods. At the beginning of the movie, we're getting to know Keanu's character, Lucas Hill, who is supposed to meet with his working partner Pyotr in a beautiful, yet so mysterious, Russian equivalent of Rome, known from such epic, unforgettable books like \"Crime and Punishment\", \"The Idiot\" by Fyodor Dostoevsky (which, by the way, I recommend anyone to read and due to them understand how important for not only the Eastern but worldwide culture this place undoubtedly is). Lucas is a reserved, stoic guy who isn't fulfilled with his current life and uncertain business he became a part of. After landing at the airport, he instantly drives to the hotel where he and Pyotr planned to see. This trip would have been just another ordinary deal for Lucas if only his partner had appeared with diamonds for Mr. Boris Volkov exquisitely played by Russian actor Pasha Lychnikoff (\"A Good Day to Die Hard\", \"Chernobyl Diaries\"). \"Volkov isn't a good man to disappoint\", ensures Lucas when he tries to contact Pyotr who just before Hill's plane has taken off called him being evidently very jovial about the perspective of earning a solid sum of money. Unfortunately, after this scene, nothing seems to fall into place. Lucas patiently tries to look for his apparently carefree colleague in a wilderness of Siberia, in a little village situated in the middle of nowhere, where he falls into a passionate romance with a fearless woman (probably equally fearless in real life) named Katya who, as it later turns out, has a very supportive family consists of thoroughly plainspoken brothers. Their first meeting is very little romantic. Although Katya, a modest café owner, seems to be intrigued by the lonely American straightaway. They differ a lot, they come from completely distinct worlds. Nevertheless, some strange, unexplainable bond connects them and later makes them two partners in crime (here we can notice some Bonnie and Clyde reference to this very unconventional couple). They found each other in difficult, definitely unfavorable circumstances, two lost souls searching for lively feeling, passion, an adventure. I can see in these characters two unsatisfied people with their repetitive lives, grey, bleak reality. Nothing vibrant, invigorating awaited Lucas. Nothing new, unusual Katya anticipated until they coincidentally decide to break the rules, the clichéd convenances which they always have to obey before. They eventually let themselves to explore something deeper, different, in a way releasing themselves from the invisible cages in which they were trapped, cages of their own limitations, faded emotions. When I first found out about Siberia, I didn't expect it to be a tragic love story. Since it is not stereotypical at all, I felt even more absorbed while watching it. I know that there are people, especially these all professional critics, who wanted to see another action, stirring film with Keanu running, shooting, wearing a bloodstained suit. John Wick was some kind of renaissance movie for our man, at least this is what journalists tend to write and, speaking honestly, I can't approve their view. Before John Wick, there were other great productions and I'm now referring to a very underrated samurai story \"47 Ronin\", a delightful comedy written by Keanu's long-time friend Stephen Hamel (who is, worth-mentioning fact, also an author of the Siberia story) and Keanu's engrossing brainchild called \"Man of Tai Chi\". Of course, non-fans, film enthusiasts could not know about all these projects, because, in fact, it was \"John Wick\" who sort of made Keanu recognizable and in the spotlight again among less well-informed folks. I believe that the negative and detractive reviews come generally from the viewers who were ready to watch Keanu beating up bad guys and being a killing machine, a man who terrifies Russians, not is petrified by them like it is in Lucas's case. I don't want to declare that Siberia is what I was hoping for because, as most of you, I really wanted to find out more about Mr. Hill's past, what brought him to become a diamond merchant, what kind of life he normally leads when he's not dealing with any business. The whole story was invented by a man who was involved in creating \"Henry's Crime\", the film I very much enjoyed and think about it as a very comforting, light comedy with some crime, romantic threads as well. The script was written by an Oscar nominee- Scott B. Smith. I know that some fans might have anticipated something huge, astounding, with a great dose of action scenes. However, I can't stand reading people's comments who can only complain about the supposed lack of emotions, boring editing, too explicit sex scenes (are they really? I'm not a big fan of film romances, but there are other movies with much braver script). Can't they detect how much effort and courage it actually took to make such film? The Mixed-genre movies aren't those which we got used to seeing, at least average viewers, usually films can be classified into one, two specific types. \"Siberia\" is a unique, exceptional film, kept in a rather indie climate. I like how they pictured Russians, pretty plausibly, and they did a great job casting real eastern actors instead of Americans ineptly attempting to impersonate Russian mentality and pretend their challenging for western performers accent. I think people should appreciate \"Siberia\" for its non-typical romantic thread, it's after all, in my genuine opinion, the movie about relationships between people- Katya's with her family, Lucas with his wife, Lucas and Katya's relation, Volkov with his \"blood-brothers\". It's a special film about finding love, not this one which we know from cute, immature Hollywood romantic comedies, in the most inconvenient circumstances, in a cold, frosty world. I can see some Romeo and Juliet reference as well-two seemingly unlike people, Katya's family influence, Russian clan who wants to dictate their female member the best way to settle down and live, and this way is far from she probably dreams of, sudden awaking of strong feelings between two lovers who descend from variant realities. People should appreciate Siberia for its idea of impossible love, for this little, unfortunately less exploited, suspense, action thread, its shooting scene which ends with a very moving, in my opinion, final, spellbinding music and, I wouldn't be myself If I didn't bring this up-Keanu's polished Russian, his distinctive coat and Canadian town Marquette which plays Russian Siberia area very convincingly. I hope sooner or later I'll be able to purchase Siberia on Blu-Ray, because I want to have it in my collection. To be honest, this indie production didn't wholeheartedly impress me, but it certainly engraved in my memory as a good, well-directed, extra-ordinary independent picture.",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WDUDTK!!!",
            "content": "Why Did U Do That KeanuThere are happy movies, action movies, sad movies, etc. this was the most pointless movie I've ever seen. Spoiler: filled with awkward sexuality continuously, a story line with little to no explanation as to why this situation is created for Lucas, and an abrupt ending that's not so much tragic as it is pointless. I watched this movie bc I like Keanu and my girlfriend has a celebrity crush. I don't understand why he would do such a film at this high point of his career. This is something you take as a step up from a commercial",
            "review_date": "2019-09-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst",
            "content": "This movie is one of the worst movies I've ever seen in my life this was a total 💩",
            "review_date": "2019-02-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Exciting & Enjoyable",
            "content": "An enjoyable film to watch with a great performance by superstar Keanu Reeves but also from the less known actors such as: Ana Ularu, Pasha Lychnikoff and Rafael Petardi. It's pretty catchy right from the start with Katya being very much in charge of her life until she meets and falls for 'the American'. The action revolves pretty much around them with loads of unpredictable scenes and great moments of acting by the two main characters! Overall I recommend it to everyone who likes action movies & difficult love stories!!",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terrible",
            "content": "Terrible lonnng movie!!!\nNot action nor adventure at any given point!!\nThank goodness I bought it on redbox for less than 2.00!!!",
            "review_date": "2018-10-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "AWFUL",
            "content": "I'm still trying to figure how turned back time and try to stop my self from seeing this AWFUL film 😵. There's no better word to describe this movie... TERRIBLE. I love Keanu but this is a shameful film.",
            "review_date": "2020-06-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time",
            "content": "I must say that I love Keanu but this movie is 100% garbage. I wish I could take back watching it. Do not make the same mistake.",
            "review_date": "2020-12-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Slow, Waste of Good Talent",
            "content": "I know Mr. Reeves likes to take interesting and unusual roles, but this movie is bad and a waste of his talent. Hard to follow plot. A lot more needed to be developed for the storyline to make it something worth watching. Slow and boring.",
            "review_date": "2018-10-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I don't know whats on",
            "content": "I really like going to the cinema and watching movies , so far i regret two times to sit in a cinema and pay for a movie. First one was \"Mother!\" last year ... now this one , but this one is 2 time worse than the mother ...... Please don't waste your time and money with this piece of ***** my Girlfriend fell asleep during the movie :D",
            "review_date": "2018-11-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please save your time and energy, avoid!",
            "content": "I like Keanu Reeves, and many of his films, so I decided to give this a go. It is dreadful. The acting is wooden, the Russians are all stereotypes. The storyline is almost non existent, and I got to the end wishing I had done anything else instead.",
            "review_date": "2021-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I can't believe how bad this film was!!! I was annoyed with myself to have spent 2 hours watching it!",
            "content": "Like most other reviews, I wanted to like this film as I love most films with Keanu Reaves. The acting was not bad, I thought most actors were pretty good, but... the plot was totally nuts! Nothing made sense... I wish I had never watched it.. I feel that even the 1 star rating is too generous for this film!",
            "review_date": "2021-05-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keanu Reeves being pranked by a Film crew.",
            "content": "If you have ever seen one of those situations where someone famous gets pranked and everyone else apart from them know, then you will get this film. What I imagine is happening is that Reeves has been told they are making a film and he has to stand in at short notice so hasn't had time to read the script first but \"don't worry Mr Reeves we will feed you the lines as we film!\" Then they put him in the most stupid scenes which is why he spends all the film with a look that says, \"is this really going on?\". I can imagine the pranksters laughing in a room someone and saying, \"make him do this now!\".The good bits of this film - the opening titles give you the idea that you are about to watch an exciting thriller or spy movie, they really built up my hopes. They are sadly wasted on this film. Maybe one day someone will make a good thriller movie called Siberia and can reuse them.Then the movie starts and that's where it all goes downhill. Some critics have said that this film goes at a snail's pace, they are wrong, it in fact goes along at the speed of a glacier. I am not sure what sort of boring life you must have to lead if this was a thriller to you, maybe you have been in stasis but awake at the same time for a few decades. You would get more excited watching a four-hour video of two people making flatpack furniture.There is a good reason that all the main characters drink copious amounts of vodka, and I assume that it is real vodka, so that they can get through their scenes.I won't spoil the film about talking about the plod, I mean plot, but I will say that if you gave a young teenage boy the task of imagining how adults get intimate and the kind of things they would do and say at those times it would be at least half of the film.All is not lost though. Should you have someone you want revenge on, invite them over and watch the film together. You will have the pleasure of knowing that inside they are seething with rage at losing some of their precious lifespan.I won't spoil the film about talking about the plod, I mean plot, but I will say that if you gave a teenage boy the task of imagining how adults get intimate and the kind of things they would do and say at those times it would be at least half of the film.",
            "review_date": "2021-07-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Farcical",
            "content": "Scott B Smith could not have done worse. Keanu Reeves would have done much better himself. It's obvious he was not even consulted. Keanu is at his best as an artist of the dance of death. Mr. Smith portrays his lead as some milk toast devoid of morals. I knew when i was eight years old that the Native American method of making a blood brother is to cut the palm of your right hand with your blade, and your intended brother does the same. You then clasp each others hand mixing each others blood. Mr. Smith thinks it has something to do with BJs. One never saw Keanu using cocaine or using drugs in any other movie. Mr. Smith writes from the perspective of a hedonist. The love scenes, wooden at first, did improve. Not due to Mr. Smith's writing. The improvement can be credited to Keanu, and his co-star, Ana Ularu. Then there is the plot. Does Smith write one that gives Keanu a chance to escape through guile? No, that would have required imagination. Has Smith ever seen a \"John Wick\" film. Doubtful. Keanu kills a bar full of men with his belt. It was Scott B Smith that died in this movie. Not Keanu Reeves.",
            "review_date": "2022-03-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "why ?",
            "content": "Not even a superstar like mr. Keanu Reeves could save such a stupid and childish film with a scrpt writen by a 16 year old (mentaly)",
            "review_date": "2018-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Crab!",
            "content": "Total trash!! Stupid movie. Very sorry that Kianu whom I respect a lot makes such a poor movie.",
            "review_date": "2018-11-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wtf!?",
            "content": "Slow and boring. Keanu was the only reason I watched it but I agree with most that even he couldn't save it.",
            "review_date": "2018-12-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I am a huge fan of Kianu, but this film is just so wrong...",
            "content": "The idea is the only good thing, everything else is just so stupid. And the end - come on! So so disappointed.",
            "review_date": "2020-01-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Roll camera...Action!",
            "content": "Probably we've seen already all kind of action movies already, but at least in this one you have a great cast Keanu Reeves(well no need of presentation right?) & Ana Ularu(the incredible West of Emerald City, seen also in Ron Howard's Inferno) for an indie movie and an entertaining plot... Give it a chance!",
            "review_date": "2018-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just a boring movie",
            "content": "Boooooooooring as hell , is it expected to buy ticket just to see kayano reeves kissing, regardless the quality? Shame",
            "review_date": "2020-03-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "zero stars",
            "content": "Slow, pointless and not worth watching. Just terrible!",
            "review_date": "2018-10-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "What happened with Keanu Reeves???? Very disappointed.",
            "review_date": "2021-05-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad!",
            "content": "Bad, boring... the worst film I've ever seen! I rated 1 because there isn't lower.",
            "review_date": "2018-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "Ana Ularu and Keanu. Thought I stroke gold.I logged into my account just to down-rate this.It was truly bad. Keanu's acting was worse I've ever seen and the plot made no sense whatsoever.",
            "review_date": "2020-04-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time! Worst of 2018!",
            "content": "First off let me say I love all different movies from Sci-Fi to Action to Kids to anything even a little entertaining. Usually love Keanu's movies so guessing he owed a director a huge favor and agreed to be in this movie without reading script. Feels like the very basic idea of a story was thought of and then never completed the chapters\n I watch 4 to 5 new movies a week and this is the worst I've seen in 2018 and maybe even the past few years.",
            "review_date": "2018-08-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I mean...",
            "content": "Seriously, c'mon Keanu, you can be the most nicest person on the planet, but this just doesn't make sense, in order to make sense you should deny this kind of senseless movies, that's all. I am not even sure if this movie has any decent scene, at least one? I am not sure. So talking about ridiculous scenes would be all day work. I'll choose only one. Really? Rich diamond dealer drinks in nowhere, and pls, that exit from whatever that place is, homeless person would have been looked better than you. I have one question from the director Matthew Ross: Why? Why'd you do that? Do you hate Keanu? Pls tell me at least you hate his career.",
            "review_date": "2019-09-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Could have been much better!",
            "content": "This film could have been great by taking a Jack Reacher approach and scored much better.Keanu Reeves's acting heartless much like Guy Pearce (post Lockout). Waiting for Keanu to take on a role like Lockout that hopefully will bring life back to a boring actor.",
            "review_date": "2018-09-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Move along, there is nothing to see here!",
            "content": "OMG ! this mediocre film, pure waste of time! amazing to see Keanu Reeves in a turnip. The story is nil, very confused, not exciting despite the sex lol scene\nNothing is likely. This film will quickly confuse, sound and fury signifying nothing, we learn nothing about the characters and I have not compatible, because we stay away, it's cold, the camera is also very cold; I did not see any interest, this film is rotten. The actors too and even keanu, which is limited, but it's still the best, only an actor can not save a movie.\nMove along, there is nothing to see here!",
            "review_date": "2018-08-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "As Dull as a Siberian Winter",
            "content": "As dull as a Siberian winter and just as long. Obviously Keanu didn't read the script or needed pocket money.",
            "review_date": "2021-06-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Save your time, it is true",
            "content": "Maybe i dont understood that movie. But ohh no words to say.",
            "review_date": "2019-09-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Can you name three characters",
            "content": "What was missing for me is that moment when one actually cares about at least one of the characters in a film. There's not enough backstory to evoke a connected feeling to the plot drivers: not the small town Russian cafe girl, who invites Reeves' character to have sex for no apparent reason (no chemistry here); not her brother and his bro-gang (too old to be but still high school bully-pranksters); not the brutish, misogynistic gangster or his gold-chained bodyguards; and not the Cheater, the bad boy businessman with a proclivity for guns-and-money criminal activity. And who, in a state of extreme twitterpation, has lost the presence of mind required to realize a booty call to cafe girl has a significantly high probability to segue into scream-till-you-sell-your-soul pain and anguish and possible permanent disfigurement.I had questions. Why did the writer bother to introduce the Reeves' character's wife? Yet fail to do a bit of gemological research for the sake of believe-ability? Why show the collective aptitude of brother's bro-gang in the first cafe scene, then again in the unnecessary and depressing hunting scene?Then I thought--this movie was filmed in Canada (mostly), it cost two million to produce and barely broke half a million at the box office. So perhaps it was (unintentionally) born to be a tax write off for investors?Better luck next time.",
            "review_date": "2023-02-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time",
            "content": "I like Kenua Reeves. I have probably only not finished a movie twice, I didn't finish this movie. It is awful!",
            "review_date": "2018-09-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ana stole the show ...",
            "content": "It's the perfect movie to watch on a winter afternoon. \nReal life drama and feeling that keep you glued to the screen and the acting of the actress Ana Ularu ( Katya ) stole the show in my opinion.",
            "review_date": "2018-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awkward slow and boring",
            "content": "Felt like a dumb stereotypical depiction of Russia with no depth or storyline. Waist of time give it a miss. You think the story will suddenly unfold but it just doesn't.",
            "review_date": "2021-04-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst American film ever, Poor Keanu",
            "content": "The stupidest scenario of totally unreal events. Why cant they get some Russian voice over for American actors playing Russians? Sex, snow, sex, snow, some blue diamonds, a bear, Russian mafia speaking with American accents. Not even funny. Why did they decide to turn St Petersburg Mayor's office into a hotel? It doesnt even look good. As if we dont have enough posh hotels to shot in. 2 hrs wasted. Felt sorry for Keanu Reeves to get himself into such a stupid film.",
            "review_date": "2018-09-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Disappointing very disappointing. To tell the truth I expected something much more complex, more interesting, more entertaining but in reality the film drags things a lot and the tremendous slowness that comes with its narrative affects theDisappointing very disappointing. To tell the truth I expected something much more complex, more interesting, more entertaining but in reality the film drags things a lot and the tremendous slowness that comes with its narrative affects the enjoyment because the story never immerses you.For those who compared it to John Wick or they think they're gonna see something similar to John Wick, forget it, nothing further from the truth.",
            "review_date": "2018-07-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThe movie has based on very intresting character – Lucas Hill – diamond expert. This man, on first sig look – has perfe tly evaluation of jewels, but has strange ethical , scale of value when comes to talk about wemen and Love. Here we see how he, at the beginig, heas fall in love with the charmy Katya, but in away, which you can call it passiv.   She makes first step, offering to him, she. gives him a ride with her car, she wears his hiden diamond in a candle. He does not gift her even a soup, little with aromas, instead he ask her what she whants, he can  take iniatiative , to  the man, to lead.\tVery strange thing happens, when he has been asked-pushed to swing his love-friend-Katya-with the one of the businessman. Volkov just for one bjob each. Which is an act of becoming brothers, mnow they are ”blood brothers” . Their trust asre raised, they earn confidance, but on expense of love.\tThis act shows the moral, the character of Lucas – he can`t defend his lovegirls. He is down on the strean of river, he does not take any atction to move up. The giuilt is always on the Pyoter – the problems with diamond is bbecause of him, the whole movie.,Lucs run from responsilility, hopin that something will phappens. Indeedd he does not run, he is sinks, regardeess of the warning of Vinsens – the South African.\tTMetaforicly Lukas lookson the women like a beautifull, “the best you ever 3ee”- diamonds. Katya – with taft charatucter , forward and beautifull,  “unalterable”  reminds him , associates , pull a string deep in the soul of Lucas Hill. Which. is already forgot what is love – he is only old firriend with his wife – they look squint away certain things. It is shown a little bit of their relation ship, but plenty to understand.-Lucas can`t get enough from his wife\tBut when he finds the love, he is timid , he keeps Katya professionally, like the same way, he does not sacriface anything for her. Can we exchange the love like a. diamond jewelyy – for a wile , let`s our partner try it and then return it to us ?\tThe women are not jewelas, but Lukes treats them as such, he cant fin. inner forces. to fight., to go out of the river that gooes to the waterfall-fateful. for him, He doesn`t go against even once, he doesn`t fight for what he whants\tOfcourse Keanu Reeves do this movie on purpose, he build the character of lucas Hill like an opposite of Jhon Wick – who kills and fight. even. for. the puppy. left by his belovveed wife. Jhon Wick has will, Lucas Hill does`nt have ome\tThe opposition of these two heroes, th two types of men is tryuly significant. Mr Reeves has proved., not once , that he is capable of self-deception in the mane of art and cinema playing roles of “weak”man – “Knock, Knock”, ”The Whole Truth”. It is amazing the range of the actor., he can be super hero – Neo , or to be manfailuure – in this movie. The question is : Are the viewers wants , are they accept him like a lozer. Because, as it is known, Keanu is one of the favorities of the crowd. People loves to wattch. him.; how he fights, struggle do stun real stunt work mmostly wwithout a. double.\tHere comes the geniius move of this man. You see – your. hero, beloved actor , is in a blind alley, he is pushed , but dan`t do anything. You begi  start to askyourself – why he does not run, why he does`nt. shoot them, why he doesn’t. do anythin for God, Please! Now you think, what I want should would do , if I mm on his place. This is it , This is the point of . Keany and dhedirector- to put you on  the place of main hero – to feel with him . To feel that you want to fight for your love. What you gonna do, if you were on my pplace , ask Keany with this movie.",
            "review_date": "2018-07-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The trailer made this actually look like a cheap Wick spinoff with enough action and thrills for a VOD film to keep Your attention.Every actual action shot in the trailer is really only 2 separate :30 total sequences in the beginning and inThe trailer made this actually look like a cheap Wick spinoff with enough action and thrills for a VOD film to keep Your attention.Every actual action shot in the trailer is really only 2 separate :30 total sequences in the beginning and in the end of this film. Instead it's Keanu in a more reserved and boring Wick persona venturing around a bleak Siberian environment of rich Russian mobsters and a very annoying sex crazed Russian woman that is unconvincing. The plot drags around and really is cliche as they come with stolen diamonds and blown mobster kingpin deals with utterly banal dialogue. The ending comes abruptly with no real conclusion and the film is over. While Keanu delivers his signature acting style that's servacable for the most part, there's really no reason to watch this. It's essentially John Wick on a depressing vacation without any action or excitement Obsessed with a Russian chick.",
            "review_date": "2018-07-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \ntruth is this Phucker couldnt act if you put a gun to his head. this direct-to-video turd is all sorts of boring except for a couple of awkward sex scenes and a weird Russian male bonding ritual involving two guys looking into each other's eyes and cumming simultaneously while being sucked down by each other's women.  there are no thrills to be found and ends abruptly with Kino Reeves gets gunned down.",
            "review_date": "2018-07-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "That Reeves would agree to act in a soft-porn film is regrettable but I suppose it should have been expected since his latest endeavors are over the top violent and 'sex and violence' tend to run together. It wouldn't have been too bad if theThat Reeves would agree to act in a soft-porn film is regrettable but I suppose it should have been expected since his latest endeavors are over the top violent and 'sex and violence' tend to run together. It wouldn't have been too bad if the sex acts had simply been implied, but they were so 'in your face' and frequent, that it turned a '2 1/2 star' movie into a '1'.",
            "review_date": "2018-10-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was really hoping that this will be close to the greatness that is John Wick by trailers, but the movie grows boring quite fast, plus the plot gets worse and worse. If you expect action - there is almost none. If you expect intriguing plotI was really hoping that this will be close to the greatness that is John Wick by trailers, but the movie grows boring quite fast, plus the plot gets worse and worse. If you expect action - there is almost none. If you expect intriguing plot and all that, there is close to none of that too. Basically they seemed to sell it as a movie similar to John Wick and it is far far away from that.",
            "review_date": "2018-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I leaned Russian diamond industry in Siberia.This movie also educated me about corruption of Russian politics.I had to watch too many sex scenes.This is not supposed to be a porn.It was hard to follow the plot due to Russian accent EnglishI leaned Russian diamond industry in Siberia.This movie also educated me about corruption of Russian politics.I had to watch too many sex scenes.This is not supposed to be a porn.It was hard to follow the plot due to Russian accent English and subtitles.",
            "review_date": "2019-08-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIf you cut the sex scenes you remain with nothing. The movie is about a professional married diamond trader which isn`t professional at all and a woman that even she learn that he is married and in a deep trouble keeps follow him and have sex with him. The pathetic ending is the cherry on top where the main character hid behind planks and it get protected by bullets, manage to kill almost all of attackers but not the last one....",
            "review_date": "2018-09-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A plot that goes nowhere and is confusing and an absolutely terrible and nonsensical ending as I see it.Numerous explicit scenes (with one being extremely vulgar), and raw language throughout. Probably doesn't even deserve a 4 but I did stayA plot that goes nowhere and is confusing and an absolutely terrible and nonsensical ending as I see it.Numerous explicit scenes (with one being extremely vulgar), and raw language throughout. Probably doesn't even deserve a 4 but I did stay with it, unfortunately, to see how it would all turn out.",
            "review_date": "2018-09-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Horrible, poor taste and completely pointless. I felt as if an hour an a half of my life was stolen and now I cannot get it back. Wow, Keanu. He is either in good movies or in complete crap. This one is absolute crap. CompletelyHorrible, poor taste and completely pointless. I felt as if an hour an a half of my life was stolen and now I cannot get it back. Wow, Keanu. He is either in good movies or in complete crap. This one is absolute crap. Completely tasteless.Movie promotes completely unreasonable unfaithfulness, tries to romance something so completely filthy and pointless as a meaningless hookup. I am very disappointed. Also the movie is very stereotyped, hence just poor taste all around. Do not recommend to spend money on this.If you can watch it free you will still most likely feel like you have wasted an hour and a half of your life. You have been warned!",
            "review_date": "2018-08-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why????? I love Keanu Reeves and some of his movies are absolutely my all time favorites (John Wick, Matrix...). What the hell is this? Nothing is happening. Really bad dialogues and absolutely no action. I kept looking at my watch and wasWhy????? I love Keanu Reeves and some of his movies are absolutely my all time favorites (John Wick, Matrix...). What the hell is this? Nothing is happening. Really bad dialogues and absolutely no action. I kept looking at my watch and was wondering when this would be over. Don't get me wrong, his acting was good but I have no clue why he accepted to join this project.",
            "review_date": "2018-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "(Mauro Lanari)After History refuted every messianic role played by him twenty years ago, Keanu retired into even worse films than a bad soft porn.",
            "review_date": "2020-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "very poor script and bad story,makes no sense,it's not interesting to watch,a very stupid film",
            "review_date": "2020-12-13",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "meta_rating": 3.2,
    "meta_summary": "When a business deal in Russia goes south, a U.S. diamond merchant (Keanu Reeves) and his lover (Ana Ularu) are caught in a lethal crossfire between the buyer and federal intelligence service."
}