{
  "title": "Captain America: Civil War",
  "rating": 8.0,
  "release_date": "2016-05-06",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller"
  ],
  "summary": "Captain America: Civil War picks up where Avengers: Age of Ultron left off, as Steve Rogers leads the new team of Avengers in their continued efforts to safeguard humanity. After another international incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability and a governingCaptain America: Civil War picks up where Avengers: Age of Ultron left off, as Steve Rogers leads the new team of Avengers in their continued efforts to safeguard humanity. After another international incident involving the Avengers results in collateral damage, political pressure mounts to install a system of accountability and a governing body to determine when to enlist the services of the team. The new status quo fractures the Avengers while they try to protect the world from a new and nefarious villain. [Marvel]… Expand",
  "critic_reviews": [
    "At the root of that is Civil War’s greatest strength – and the reason it makes all thought of the recent Batman v Superman debacle evaporate on contact. The Russos’ film has an unshakeable faith in these decades-old characters: they’re not wrangled into standing for anything other than who they are, with no gloss or reinterpretation or reach for epic significance required. This is the cinematic superhero showdown you’ve dreamt of since childhood, precisely because that’s everything – and all – it wants to be.",
    "What makes Captain America: Civil War such a terrific accomplishment is the way it takes what could have been the most crass and overcrowded story to adapt as a film and instead transforms it into an examination of just who these heroes are and what impact they’ve had on the world around them, and vice versa.",
    "If there’s a risk of the Marvel ‘formula’ becoming stale, there isn’t any evidence of that here. Civil War isn’t just a damn-near-perfect popcorn crowd-pleaser; it doesn’t offer any easy answers for its combatants, or the world going forward. Team Cap or Team Iron Man? The real winner here is Team Marvel.",
    "Matching its blockbuster scale and spectacle with the smarts of a great, grown-up thriller, Captain America: Civil War is Marvel Studios’ finest film yet.",
    "More than any previous Marvel adaptation, Civil War conveys the comics' light touch amid somber circumstances. In a bold stroke, those circumstances are of the heroes' own making.",
    "Despite its stars-and-stripes title, Marvel’s latest billion-dollar-blockbuster-to-be, Captain America: Civil War, is essentially a third Avengers movie – it’s also the best one yet.",
    "Striking and consistently engaging, the Russos deftly craft compelling blockbuster entertainment out of a a moral and emotional conflict, and that’s more impressive than any overblown display of loud and vulgar power.",
    "The conflict between Iron Man and Captain America drives a wedge through this community of heroes. And they fight, in one of the most joyous cinematic superhero battles ever filmed, the closest thing we’ve seen to an on-screen splash page.",
    "“Civil War” strikes that admirable balance: serious-minded action that never forgets to indulge in serious fun.",
    "At the end of the day, it’s still a comic-book movie, but one that actually raises serious questions about security, accountability and revenge.",
    "Captain America: Civil War appeals to me more strongly than any superhero movie of the last decade.",
    "In nearly every way Civil War represents the dizzying heights of the genre.",
    "Kudos to the Russo brothers, Joe and Anthony, for directing the hostilities for maximum impact and without neglecting character. Their thundering epic is also smart,  snappy, politically savvy and blessedly fast on its feet.",
    "After the nihilistic deconstruction of Deadpool and the flattening self-importance of Batman v. Superman, Captain America: Civil War reminds you how funny and exciting these pictures can be when they’re done right — you know, like comic books. The summer movie season has barely begun, and already the remedy for superhero film fatigue has arrived.",
    "Captain America: Civil War is a classic example of what the big-ticket summer movie experience is all about.",
    "While it’s not the greatest Marvel effort — that honor goes to the previous Captain America: The Winter Soldier — Civil War does pull outstanding performances from its two franchise faces, Chris Evans and Robert Downey Jr.",
    "The way in which Captain America: Civil War brings together a dozen or so heroes, sorts them into not one but two teams and then flings them at each other is its own special delight for comic book fans long accustomed to such things on the printed or digital page. And it must be pretty exciting for non-fans, too.",
    "In terms of narrative ambition, and giving meaningful screen time to an ever-growing stable of onscreen characters, Civil War rivals Joss Whedon's MCU standout The Avengers. And in terms of sheer thrill, it surpasses Avengers — at least for fans who come prestocked with an emotional investment in these characters.",
    "That Civil War doesn’t collapse under the weight of its various moving parts, that it manages to be the most serious entry yet in this franchise of franchises without sacrificing much in the way of valuable comic relief, is a testament to the creative mojo of directors Joe and Anthony Russo and screenwriters Christopher Markus and Stephen McFeely.",
    "By firmly rooting all of the film’s sprawling drama in a singular conflict, directors Joe and Anthony Russo manage to do what many superhero films have struggled with in recent years: find a truly effective reason to pit superpower against superpower.",
    "Marvel’s new “Captain America” is anything but bleak — what’s so audacious about the film, and so pleasing, is its quicksilver mix of hardcore action and bright comedy.",
    "Fun, happily, is one of the many ingredients in copious supply here.",
    "It’s that rare superhero movie that doesn’t grind you down with nonstop action or, worse yet, the usual tiresome cavalcade of smart-ass wisecracks.",
    "It’s a huge aspartame rush of a film: a giant irresistible snack, not nutritious, but very tasty.",
    "A nagging sense of incompleteness means that Civil War isn’t quite as satisfying as the first ‘Avengers’ (it’s all building up to the ‘Infinity War’ two-parter in 2018). But overall, this is Marvel at their best: a pacey, intelligent super-sized blockbuster and a roaringly fun night out.",
    "This chronicle of an epic clash between two equally noble factions, led by Captain America and Iron Man, proves as remarkable for its dramatic coherence and thematic unity as for its dizzyingly inventive action sequences.",
    "Civil War is an exciting, often giddy pop pleasure.",
    "While slightly overlong, this movie is bright, creative, insightful, affecting and, above all else, fun.",
    "Civil War’s main battle sequence is so effective because it’s six-on-six, and we’ve spent the past decade getting to know the combatants.",
    "Who emerges as the winner of this “Civil War”? The audience. The picture delivers in a big, big way.",
    "The bad news is, there are about ten movies going on in Captain America: Civil War, which is at least seven too many. The good news is, most of them are fun, and there are enough rousing moments to elevate the movie to Marvel's top tier.",
    "Those who attend this movie expecting to see a superhero smack-down won’t be disappointed, but anyone partial to Captain America’s saga may feel shortchanged.",
    "With every new installment of the comic book franchise, the scale gets bigger, relationships get trickier, new forces enter the fray.",
    "They’ve built up a vast ensemble of character types, all of them played by better-than-average actors, and that they can mix and match the drama, comedy, or action as they see fit.",
    "Crisply photographed, thoughtfully acted and often refreshingly amusing, “Civil War” injects doses of much-needed fun into a genre of filmmaking that’s become mired in dour pretentiousness, when it’s not ridiculing its own excesses in such meta-snark exercises as “Deadpool.”",
    "Thanks to strong performances, deft writing, and clear, snappy direction and editing, this newest volume of the Marvel Cinematic Universe manages to be at once a thoroughly entertaining standalone story while also serving and benefiting from stories that came before.",
    "Nothing in “Civil War” takes your breath away. All the exteriors are shrouded in the same overcast, indistinct light. Little in story terms is what you’d call daisy fresh. But almost everything in it works on its own prescribed terms, and the quiet moments register.",
    "This very crowded, reasonably enjoyable installment in the Avengers cycle...reveals, even more than its predecessors, an essential truth about the Marvel Cinematic Universe. It’s not so much a grand science-fiction saga, or even a series of action-adventure movies, as a very expensive, perpetually renewed workplace sitcom.",
    "If you live and breathe Marvel, this is one of the MCU's stronger offerings. If you are a spy coming in from the cold, the answer is not so clear.",
    "Posing serious questions about violence and vigilantism while reveling in both, Captain America: Civil War is overlong but surprisingly light on its feet. It builds upon the plotlines of previous Avengers outings, bringing together known marquee quantities and introducing the Black Panther and a new Spidey in winning fashion.",
    "The action, directed by Joe and Anthony Russo, is thuddingly effective without being terribly imaginative, but at least it’s not in the clobber-the-audience “Transformers” category.",
    "The undeniable fun of Civil War's action scenes only exacerbates the failure of the narrative to adequately contend with its own themes.",
    "I personally find the Russo brothers’ lightning-fast action scenes difficult to process — it’s as if cinema editing now exceeds the speed of human brain functions — but they’re undoubtedly exciting and skillfully constructed.",
    "Those who sit through its talky, belabored first half will be rewarded first and foremost with the finest fight scene of any \"Avengers\" film to date, one that doubles as a satisfyingly popcorny start to the summer season.",
    "The best way to think of Captain America: Civil War is as a toy box in which the sheer quantity of toys partly makes up for the lack of anything new. But the big takeaway is worrisome. Marvel has created a universe teeming with superheroes who simply don’t have enough to do. They’re all suited up with nowhere to go.",
    "I never found myself genuinely wondering what was going to happen next; the moves are too familiar. Even the big fight, entertaining as it is, feels like it's there not because of dramatic inevitability, but because somebody behind a desk decided it had to be. It's just a bunch of stuff.",
    "There's a certain bloatedness to much of the first half, while the film in general lacks the balance of humour to hard-hitting found in Shane Black's superb Iron Man 3 and/or Whedon's two Avengers outings.",
    "As the feigning wears off, and Captain America: Civil War crawls to a close, you sense that the possibilities of nature have been not just exceeded but exhausted. Even the dialogue seems like a special effect: “You’re being uncharacteristically non-hyperverbal,” Black Widow remarks to Iron Man. Translation: “Say something.”",
    "After the first two “Captain America” entries, the finest comic-book movies of the last five years, this one is disappointing. The story doesn’t make sense.",
    "Robert Downey Jr. gets to remind everybody that before this blockbuster turn he was actually a serious actor and may still be again. Stark’s frustration at the rigidity and short-sightedness of his confreres and his anguish at where it all leads are vivid and felt.",
    "There’s a “for fans only” feel to the latest “Avengers” movie, Captain America: Civil War, that won’t be to every taste. A talky, often ponderous exercise in comic book movie elephantiasis, it overdoses on characters, old and new, sometimes not even bothering to name them.",
    "Sometimes, more is less. Although it’s called Captain America: Civil War, the latest Marvel movie is actually a supersized “Avengers” picture -- overstuffed to bursting.",
    "The bigger these movies become, the smaller they feel. The more aggressively they reach for greatness, the more clearly they prove that its beyond their grasp. Marvel movies don't get much better than this. The trouble is, they don't want to."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I am a bit tired when I was watching this movie,so my opinion might not be correct,I’ll go see it again tonight.\r Captain America Civil War is everything that Marvel fans deserves.\r\nA good story to build up the atmosphere,damn good fightI am a bit tired when I was watching this movie,so my opinion might not be correct,I’ll go see it again tonight.\r Captain America Civil War is everything that Marvel fans deserves.\rA good story to build up the atmosphere,damn good fight scene mix with amazing camera work.\rThe characters are all well acting,especially antman and spiderman,their humor just knock it out of the park and just steal the show.Also I really like Zemo in this movie,he act like a really emotional and  scary villain.All the action scene in this film is just badass,the airport fight is the best fight I've seen in superhero movies.It is amazing to see so many characters in a movie,and still have their moments to shine.\rI took some points away is because I don't like the ending and some of the unnecessary set up scene.\rBut still an amazing movie",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Story is flawed\rAction scenes are good\rAt the places the VFX doesn't add up\rOver all a huge disappointment for the wait and does not live up to its predecessor the winter soldier",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was really nervous that my expectations were unrealistically high for this movie that I would be disappointed even if the movie was good. However, I am happy to say that I was wrong. This movie really delivered for me. There were intense,I was really nervous that my expectations were unrealistically high for this movie that I would be disappointed even if the movie was good. However, I am happy to say that I was wrong. This movie really delivered for me. There were intense, serious, darker moments mixed in with hilarious moments. Not to mention the action was top notch. The fight choreography was amazing, on par with the winter soldier, and the airport battle has to be one of the best action scenes of all times. It was honestly incredible. Spider-man and Black Panther were awesome additions to the MCU and I'm excited for their solo movies. Be sure to stay for the two end credit scenes. I cannot wait to see what the Russo Brothers do with Avengers Infinity War!",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Action was nice and safe i.e. no danger feel and very kids friendly. Zemo ultimate plans reveal was as bad as the fake mandarin. Nonetheless, a movie for the kids and general audience, zero enjoyment for the people who want a strong plot.Action was nice and safe i.e. no danger feel and very kids friendly. Zemo ultimate plans reveal was as bad as the fake mandarin. Nonetheless, a movie for the kids and general audience, zero enjoyment for the people who want a strong plot.\r Antman and spiderman participating in the war due to being starstrucked was ridiculous as scott land would definitely stay out of trouble with the law after finding redemption in his own movie while Peter Parker is definitely misuing his power to impress his idol instead of being responsible.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sorry but i am very disappointed by this movie. It has a lot of flaws too much jokes which are just stale. The Action was solid but i ve got the feeling half the film consisted just of action and that was sometimes very tiring. And i cantSorry but i am very disappointed by this movie. It has a lot of flaws too much jokes which are just stale. The Action was solid but i ve got the feeling half the film consisted just of action and that was sometimes very tiring. And i cant understand why they made him so young when the comic spiderman is much older and has family. Because this spiderman would be good in a standalone movie but in civil war he is just misplaced. As someone who has read the comics i give him 3/10 wouldnt i habe read them it would be 5/10 but not more.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Really getting bored of these now, but possibly not as bored as RDJ and Chris Evans look in one of the most crushingly bland films you'll ever see. To be fair, its better than BvS but that's the only positive thing I can say about this.Really getting bored of these now, but possibly not as bored as RDJ and Chris Evans look in one of the most crushingly bland films you'll ever see. To be fair, its better than BvS but that's the only positive thing I can say about this. Spider-Man is just flat out irritating and the way he is shoehorned into the story is horrible. Black Panther is just - nothing. Every 'joke' fell flat with the half empty audience I watched it with, and I've never seen so many punters take a loo break, and no one seemed to be saying nice things on the way out so don't think I'm alone in my thinking. Kids will be bored to tears until the airport scene. Admittedly, that scene will entertain the young, but they'll probably be asleep or on their smartphones by the time it arrives.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nExcept for the opening scene and the 40 minutes ranging from Spiderman recruitment to the end of Rissone in the airport, the film is shot with a field equal to that of a style TV series Agents of S.H.I.E.L.D. He does not have the breath of cinema. He does not have the eye of the cinema. It has not the time of cinema. And 'a film thought in 4: 3, with a depth of field and width of production from Netflix look.\rNot that this is necessarily a bad thing (especially when an episode of a serial has never been so beautiful) but we are at the movies **** not in front of the TV. Pretty much the only good thing left of Age of Ultron was thrown away (where Whedon, despite his past as filmed cable, a bit of cinema has tried to do so).\rThe two storyline of the film, although intertwined very well unlike film as BvS, have succeeded in half: the Zemo plan is uncertain to say the least, the bad fact won the uselessness of the film award and all the events related to Bucky, in my opinion, too much attention away from the concept of \"civil war\" and, in the first part, I have also quite bored (and I was not the only room). The storyline on the Civil War, although very interesting and presented in an almost excellent, with all the motivation consistent for each character to be part of one side or another, is developed very little and absolutely so flat and not very brave. Do not you feel the climate of \"civil war\" (I do not speak of rissoni cartoon, but the background that reigns around crossover that gave a unique feel to the reader, plunging him also it into a civil war, where the enemy are not outsiders but people who until recently were brothers), the protagonists often get lost in idle chatter and exchange flips. It lacks the drama, lacking the excitement and miss the involvement of the viewer (that's why I say that is cool)\rThen in truth there is the opening scene and especially those 40 minutes mentioned above that are a different story. All defects already explained that in my opinion are present in this film magically disappear, and the film becomes what it should be: an exciting, technically perfect and thrilling clash-encounter between supertizi. in short, a masterpiece (if you notice, also and above all from the point of view of directing the film changes a lot bringing us abruptly to the movies).\rAfter the airport scene, the situation is as before but with very muted aforementioned defects (the direction changes again!).\rThe conclusion I consider it a less courageous film TWS and therefore do not live up to its predecessor.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie, great development leading to this moment. Movie had a justifiable villain and the fight scenes were amazing.",
      "review_date": "2019-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A great continuation of the Captain America saga, though it's more like \"Avengers 2.5\" than a standalone Cap film. Despite that, Evans gives probably his best Cap portrayal yet: less brooding, but more assured. He's clearly comfortable in theA great continuation of the Captain America saga, though it's more like \"Avengers 2.5\" than a standalone Cap film. Despite that, Evans gives probably his best Cap portrayal yet: less brooding, but more assured. He's clearly comfortable in the role now, and is never outshone by Downey jr.'s Stark / Ironman. The usual great Marvel action sequences are back, with a story that takes a while to build but has a great twist at the end. At the film's center lies the question: should the Avengers be put under UN oversight, or not? Both sides are presented well, and the main threat is approached by each side in different (and conflicting) ways,  generating much of the tension for the final showdown. 8/10 for yet another great ensemble film from Marvel.Drawback: you need to have seen The Winter Soldier and Age of Ultron for all the characters' motivations to make complete sense.",
      "review_date": "2017-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Civil War is still a great movie I really love this movie. From the characters being well fleshed out as well as the action scenes being so great and personal. Also, the story is very unique with the heroes fighting each other. Also, it isCivil War is still a great movie I really love this movie. From the characters being well fleshed out as well as the action scenes being so great and personal. Also, the story is very unique with the heroes fighting each other. Also, it is the first time we saw Black panther and that was a lot of fun. And I thought the villain was decent. But let's be honest the story is pretty flaws and I just on big contrivance. but still, I think it's a great movie.",
      "review_date": "2021-12-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Captain America: Civil War\" is the third and final chapter in the Captain America series, the thirteenth installment in the MCU and the film that kicked off Phase 3 of this shared cinematic universe that brings together a number of\"Captain America: Civil War\" is the third and final chapter in the Captain America series, the thirteenth installment in the MCU and the film that kicked off Phase 3 of this shared cinematic universe that brings together a number of characters from Marvel comics. And it's also one of the best cbms ever made.Taking place after the events of \"Avengers: Age of Ultron\", \"Civil War\" finds the team divided as they disagree over international oversight of the Avengers. Two factions are created, one lead by Steve Rogers and the other by Tony Stark. This conflict leads to the debut of other popular Marvel characters, such as Black Panther and Spider-Man and a big fight between the members.\"Civil War\" meets the high bar set by the Russo Brothers with \"The Winter Solider\" and offers a fun, action-packed and entertaining, albeit more grounded and dramatic addition to Kevin Feige's successful franchise. It's a great example of how blockbusters should be made and offers much depth to iconic characters such as Captain America and Iron Man.",
      "review_date": "2017-11-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War is essentially the current culmination of what has transpired in the Marvel Cinematic Universe (MCU) since 2008 with the release of Iron Man 1, pitting two heroes, Captain America and Iron Man, against one anotherCaptain America: Civil War is essentially the current culmination of what has transpired in the Marvel Cinematic Universe (MCU) since 2008 with the release of Iron Man 1, pitting two heroes, Captain America and Iron Man, against one another in a battle of personal beliefs and morals. However, these are not the only players involved in this superhero extravaganza, with Captain America being joined by the Winter Soldier, Falcon, Scarlet Witch, Ant-Man and Hawkeye, and Iron Man teaming up with War Machine, Black Widow, Vision, and newly introduced, Black Panther and Spiderman. Civil War is definitely the most intense and mature of all the MCU films and what the Russo's (directors) really grasped well is creating an environment where we as the audience can invest and care for these heroes on an emotional level, which is testament to what the MCU has done with all these well-developed characters. Throughout all these years, we have seen all these characters evolve, not just as heroes but as people. The histories of both Steve Rogers and Tony Stark are central to the story that develops in Civil War, and the events that ensue creates the division within the Avengers, as well as the people watching the film unfold. This also helps our villain, Zemo, increase his influence on the audience, because as invested viewers, whether you picked a side or not, no-one wants the villain to achieve his goal. With great writing, great directing and great acting, this film acts on what it intends to achieve superbly, creating the best Marvel film seen to date.",
      "review_date": "2017-07-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nTHIS REVIEW CONTAINS SPOILERS!!! PLEASE READ THIS DISCLAIMER BEFORE STARTING REVIEW!!!\r*\r*\r*\r*\r*\r*\r*\r*\r*\r*\rGreat. Now that you're past the buffer, let's talk about this movie. Captain America: Civil War is the ultimate movie in a trilogy of Cap movies in Marvel's Cinematic Universe. Many people are labeling it Avengers 2.5, but I see it as the future of Marvel movies to come.\r Before I rave about this movie, let's talk about some downsides. There were a few moments where I was thrown out of the action (and I don't mean the Jason Bourne-type action you may be thinking about, I mean the plot, the general action of the movie). One was near the end of the airport scene (which will be discussed) where Scott Lang is taken down and gives a crummy quip. This is pretty nitpicky though. Second was the moment where Cap and Sharon Carter share a kiss. Cap says it was a long time coming, but this moment had little setup. Their relationship started in the last movie with them being neighbors and did not range farther than that. In this movie, Sharon is an ally to Cap. I believe that had they strengthened the relationship in the previous movie or simply laid more groundwork in this one for a connection, the moment might have been more believable. NITPICKING! Lastly, the camera movements regarding the action sequences at the mission in Lagos is dizzying, and not in the good, filmmaker way. I've seen Cap 3 twice and both times I got nauseous just trying to follow Black Widow with my eyes. But again, nitpicking.\r Now I've heard the argument from some people that it is unfair to have such connected movies in this Cinematic Universe because the emotional and storytelling heavy lifting has already been done in previous movies that have come out years before. I think that argument is utter bulls**t. It is. Let's get a reality check: people go and see these movies. Not just some, not just comic book fans, but a LOT. OF. PEOPLE. This movie as of now worldwide is on the verge of a billion dollars and is only on its third week of release. Both Avengers movies grossed over a billion dollars and the previous Captain America movies have made bank, not to mention every other MCU film. No film in the franchise has been a flop, not one. And in this culture we live in today, infused with fame and pop culture, there are enough people out there willing to help those who can't see the movies prior.\r Think of it like this. You're reading Harry Potter. All the books in the Harry Potter series are part of a shared universe, you gotta read them in order to understand the emotional weight of the story, not to mention the bare bones logic. You wouldn't read Order of the Phoenix without reading Prisoner of Azkaban and Goblet of Fire. You would be lost, seeing two years go by of story.\r And so it is with the MCU. While Marvel has done a stellar job with making great movies that standalone, the cohesion of the universe only ever adds to the power of the story and Captain America: Civil War is a testament to that. First spoiler of the day: The \"twist\" at the end of the movie that gets us our final fight in Siberia was actually shown to us very subtly in Captain America: The Winter Soldier. Had you not seen that movie, then you still weren't left out to dry because Civil War had enough setup to understand Tony's relationship to his parents and Bucky's involvement in the Winter Soldier brainwashing program. Having watched the previous movies only adds to involvement of the audience.\r Let me say this of the MCU before I move on. I heard some people I knew who watched the movie say that it was very confusing (they hadn't watched anything but Avengers movies) and what they were confused by was where characters were at in their story. I say that this is not an issue of the filmmakers but rather the audience. When you walked into the theater to go watch The Hateful Eight and you see a snowy mountain and Tarantino doesn't outright tell you where the carriage is that's traveling on this mountain, you don't get to complain about not understanding what's happening. It's all in the discovery. I'm gonna leave it at that.\r Now time for praise. If you'll sit back and relax, you will get so much out of this movie. If you are on the edge of your seat, the same will happen. There are so many moment that are just eye-popping. The soft moments are tender, sweet, and necessary for the wonderful pacing. The actors are stellar, especially RDJ in what is my favorite performance from him yet. Seriously guys, that **** killed his mom. Root for RDJ once in a while. Zemo is a bit confusing on the first watch, but is so much better on the second. GUYS!!! Watch movies more than once. You're supposed to. You can't get everything out of one watch.\r Now for the highest praise out of the whole movie: Three characters. Spiderman. Black Panther. And Giant Man. You heard me. I won't say more because you just have to experience the dedication these characters add to this movie.",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War is entertaining and introduces a couple of new, solid superheroes. The plot, characters and conflict are all developed deftly by the Russo Brothers and the acting is as natural as ever. However, at times it may feelCaptain America: Civil War is entertaining and introduces a couple of new, solid superheroes. The plot, characters and conflict are all developed deftly by the Russo Brothers and the acting is as natural as ever. However, at times it may feel overcrowded and convoluted.",
      "review_date": "2016-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A pretty weak villain with a plan that only worked because he somehow managed to get the right people in the right spot at the right time. Ask yourself: Wouldn't it had the same result, if he had just leaked his \"evidence\" to the media?",
      "review_date": "2016-06-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The fights in this movie are not very believable. In the original Avengers the friendly fights were done in the forest so no one will get hurt and there's not much to destroy. In Civil War the characters are doing ungodly amounts ofThe fights in this movie are not very believable. In the original Avengers the friendly fights were done in the forest so no one will get hurt and there's not much to destroy. In Civil War the characters are doing ungodly amounts of destruction to everything around them. All of this while the characters claim to 'still be friends' making it even more ridiculous. Hello, aren't we trying to make amends for the destruction we caused in the previous movies? And what is Cap's end game? Does he honestly believe he can go up against the entirety of the UN?\r The pacing also needs a lot of work. It falls into the classic trap so many Marvel movies are falling into recently of going much too slow in the beginning and going incredibly fast at the end. I think it's much worse in Civil War and other global scope movies than say Ant-Man because we're constantly jumping back and forth between random locations with minimal context.\r Also the story is weak. This is the problem with cliffhanger movies. They just don't have any obvious conflict in them. It's just one meandering story with no obvious end. There's just no build up or suspense. Just people fighting each other for the flimsiest of reasons.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War was alright. Too many characters and calling them by various names being its biggest sins, as it simply makes it hard to follow. The action scenes are poorly done and solely done in the name of, \"oh that's badass\"Captain America: Civil War was alright. Too many characters and calling them by various names being its biggest sins, as it simply makes it hard to follow. The action scenes are poorly done and solely done in the name of, \"oh that's badass\" or \"oh he/she is hot\". Even worse, they are poorly shot and wholly disorienting when they occur. The quips can be funny, but the comedic timing is dreadful and undermines potentially serious moments. Even worse, I f***king hate Iron Man. I hated him before this movie. I hate him now and he's like half the movie. The Iron Man movies are the only Marvel ones I do not like and it is because of how much of a whiny, self-righteous brat his character is that I truly despise him. This ultimately hurt here and made the overall film incredibly underwhelming. That said, the new character introductions are appropriately epic and done very well. The film is incredibly entertaining with good fight scenes (minus the disorientation), it is funny, and the disagreement is very well laid out as opposed to the film about the sons of Marthas. The acting is more than acceptable here and thoroughly feels like a comic book movie. Overall, after enjoying the first two Captain America's, Civil War was wholly underwhelming due to Iron Man and being overstuffed with characters (who are referred to by their real name and superhero name interchangeably). Civil War did not live up to my hopes.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPraises\r* The final battle between Captain America and Iron Man. It resembles a lot like Anakin vs. Obi Wan in Star Wars Episode III: Revenge of the Sith.\r* The visual effects\r* Robert Downey, Jr.'s dark performance as Iron Man. It contrasts to all the Iron Man performances he has done over the years.\r* Chris Evan's performance as Captain America\r* The casting choice for Spider-Man, Tom Holland. He looks just like Peter Parker despite the flaws from the writing.\rCriticism\r* The title of the movie being the third installment of Captain America instead of just calling it \"Marvel's Civil War.\"\r* Too much characters who don't resemble at all to the Captain America franchise, including Black Panther, Scarlet Witch, The Vision, and especially, Spider-Man.\r* Special criticism: SPIDER-MAN. He was supposed to be a very inspiring character with huge emotional background and very trustworthy to fight with. I prefer to call him, Peter Parker, \"Jr.\" because he wasn't that young in the comics when he became Spider-Man. He got bitten by a spider during his senior year of high school. I really hate how they presented Spider-Man in the MCU because it doesn't relate at all to how Tobey Maguire and Andrew Garfield portrayed him. Tom Holland was better than Tobey Maguire, but not as good as Andrew Garfield, because Garfield put a lot of emotion and heart while in the suit. In this movie, Peter said it's been 6 months since he got his powers, but he never explained why he became Spider-Man to being with. That reason will always be Uncle Ben. When Spider-Man said, \"Holy **** when Ant-Man grew, it literally killed my childhood. So, **** you, Marvel.\r* Aunt May's casting choice was the worst. It's a way to make humor gimmicks like Iron Man flirting with her in front of Peter. Ugh!\r* Civil War was supposed to be the darkest of the MCU, instead there was too much humor and too much meme references to mock.\r* The Vision wearing human clothes. Are you ****ing kidding me?!\r* It was meant to a Captain America movie, but they barely even focused on him. They focused more on the supporting characters than the actual main character.\r* Stan Lee calling Stark, \"Stank.\" Imagine replacing \"t\" with a \"k.\"\r* Special criticism: No deaths involved. Marvel is so much of a **** that can't kill off any character in Civil War.\r* Part Two of Special Criticism: The comic, Civil War, was supposed to be the most devastating storyline to be put in Marvel. What the hell was Feige thinking not resembling the majority of a darker tone from the comic to the movie? In the trailer, we assumed that War Machine was going to die and have Iron Man avenge him by fighting off Captain America even more. Nope, he gets paralyzed in the leg. That shot from The Vision could have killed him even before the fall.\r* Part Three of Special Criticism: The most significant part of the comic was the aftermath of Civil War: THE DEATH OF CAPTAIN AMERICA. In the end of the comic, Steve Rogers gets assassinated by a hypnotized Sharon Carter during his conference at the White House. This made a huge impact to the Avengers. Iron Man mourns for Captain America and regrets signing the Ant-Registration Act, including the harm he put into The Avengers. Iron Man was so mournful enough to recreate S.H.I.E.L.D. (New Avengers Initiative). Sharon Carter encourages Bucky Barnes to fulfill Steve Rogers's role as Captain America. He refuses until he finally remembers his entire friendship with him and Steve. He gazes at the suit and experiences hope. I wanted to see that as the end of the movie, BUT NOW I CAN'T. In the movie, Captain America is still alive and Bucky Barnes freezes himself again with no motivation (other than until the hypnotism wares off, but that doesn't count). What the hell have you done, Kevin Feige?",
      "review_date": "2016-06-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was an Avengers movie minus Hulk and Thor. Chris Evan had no personality and boring to watch. Storyline was huh, why are they fighting each other again? So Ironman is Spiderman's mentor, why? Spiderman is an iconic character andThis movie was an Avengers movie minus Hulk and Thor. Chris Evan had no personality and boring to watch. Storyline was huh, why are they fighting each other again? So Ironman is Spiderman's mentor, why? Spiderman is an iconic character and far more popular than Ironman. It was very Blah with lots of action.",
      "review_date": "2016-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All these 9 and 10 reviews are ridiculous.  Anyone that appreciates good, QUALITY movie making will abhor this film.\r The plot wasn't bad....brought up some serious issues by giving both sides.  The direction was HORRIBLE!!!! Typical of theAll these 9 and 10 reviews are ridiculous.  Anyone that appreciates good, QUALITY movie making will abhor this film.\r The plot wasn't bad....brought up some serious issues by giving both sides.  The direction was HORRIBLE!!!! Typical of the last two Superman and Bourne movies..... you have an amateur director who thinks that handheld cameras jumping around fighting and chase sequences in close-ups is exciting.  Add to that, extremely choppy editing, and you have a hodgepodge of odd spliced action that you can't make heads or tails out of it.  The action scenes had a lot of speeded up CGI  fast movements that were annoyingly unrealistic.\r Most young viewers are probably used to this type of directing and don't know how great action pictures should be shot.  I desperately wanted the camera to pull back and let me appreciate how the action was unfolding.  I literally could not make heads or tails out of most of a car chase in a tunnel because of this crappy directing style and editing.\r This was never going to be a super great movie; but it could have been a much better action film than it was.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie was absolutely amazing in every aspect, the debut for spiderman and black panther are shown proportionaly, the fight scene was epic and you found that the development of the character is very good, no doubt this is better than BVS",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just amazing on every level. I haven't had a feeling like this walking out of a superhero movie since The Dark Knight, and I'd be inclined to say that it might be the best comic book movie ever since The Dark Knight.\r The action. TheJust amazing on every level. I haven't had a feeling like this walking out of a superhero movie since The Dark Knight, and I'd be inclined to say that it might be the best comic book movie ever since The Dark Knight.\r The action. The airport scene is hands down the best action scene in any comic book movie ever. Not just this, but chase scene with Bucky and Black Panther was just awesome, and the final action scene is shocking, dark, and surprisingly violent for a Marvel movie. Pretty much the only thing you could criticize about the action in this movie is the shaky cam in the first few fights, but it wears off later on.\r The characters. Spider-Man!! F**K YES! FINALLY.... A PERFECT DEPICTION OF HIM! Tobey was a crappy spider-man and a great Peter Parker, and Andrew Garfield was a great spider-man and a crappy Peter Parker, but Tom Holland knocks it out of the park for both! Chadwick Boseman also played an amazing Black Panther. And best of all, they both play completely essential roles in the movie! Not just shoehorned in at the end. The rest of the cast (Cap, IM, BW, etc., etc.) is as awesome as they've always been if not better. But forget about all that, because it's time to talk about who is possibly the most underrated villain EVER! There's pretty much been no above average villains in the MCU up to this point besides Loki and The Winter Soldier (If you would count him as a villain), but this guy honestly breaks the trend. Zemo's motivations made complete sense and he wasn't just an over the top ridiculous antagonist. And if you think about it, he actually caused the most damage to the Avengers out of any MCU villain...\r Finally, the story. We all knew going into this movie that it wasn't going to be on nearly as big of a scale as the Civil War comic, but integrating the Civil War into a Cap movie like this is pretty genius. At it's core, this is a sequel to Winter Soldier. In that, Bucky Barnes is completely integral to the plot and the way they link his backstory to Iron Man is just phenomenal. The movie is two and a half hours long, and it absolutely doesn't feel like that, because it's so well paced and there's never that one moment where you aren't glued to the screen. Although admittedly the movie didn't take too many \"risks\", I understand why.\r In the end, like I said before, in my humble opinion, this is the best Marvel movie to date and is also the best CBM ever since TDK. In fact, the way it leaves you at the end of the movie feels a lot like TDK. In my mind, this is the first chapter of the end of the line that the MCU has been leading up to. And that makes me simultaneously sad that we're approaching the end, but super happy that the end is oh so FANT4STIC! Oh yeah, f**k that movie.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yet another masterful entry in the growing cinematic pantheon that is the Marvel Cinematic Universe, \"Captain America: Civil War\" is deftly paced, brilliantly performed, and incredibly well-staged, featuring a veritable ocean of jaw-droppingYet another masterful entry in the growing cinematic pantheon that is the Marvel Cinematic Universe, \"Captain America: Civil War\" is deftly paced, brilliantly performed, and incredibly well-staged, featuring a veritable ocean of jaw-dropping surprises for both the casual viewer and the comic book aficionado.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Marvel cliché superhero movie, again. Visuals are good, though repetitive. Action sequences are essentially the same as in every Marvel movie since The Avengers. Average, though cliché plot (Villain wants to turn the Avengers on each other..Marvel cliché superhero movie, again. Visuals are good, though repetitive. Action sequences are essentially the same as in every Marvel movie since The Avengers. Average, though cliché plot (Villain wants to turn the Avengers on each other.. AGAIN for the third time). An average movie overall.",
      "review_date": "2016-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I enjoyed the other two Captain Americas quite a bit, but this one got a little samey.  The action sequences are amazing, but the \"drama\" between those scenes gets - in a word - boring.  Hushed tones - sort of like Sherlock in \"Elemenary\" -I enjoyed the other two Captain Americas quite a bit, but this one got a little samey.  The action sequences are amazing, but the \"drama\" between those scenes gets - in a word - boring.  Hushed tones - sort of like Sherlock in \"Elemenary\" - don't work very well on the big screen.  75 is a little rich for me.   Would have made sense to see this get something closer to a 60.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Russo Brothers not only managed to craft an incredibly entertaining installment of the MCU franchise with great humor, some of the most breathtaking action sequences in any super movie but make a worthy sequel to Captain America WinterThe Russo Brothers not only managed to craft an incredibly entertaining installment of the MCU franchise with great humor, some of the most breathtaking action sequences in any super movie but make a worthy sequel to Captain America Winter Soldier. Civil War is one of the most mature super films to date that has thought provoking themes and a fantastic emotional core with Tony Stark and Steve Rogers that will leave you undecided on which team should choose to be on",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'moviecritic68' stated that the younger audience will be uprating this film; well, as a 13 year old whose favourite film at the moment is The Winter Soldier, the follow-up to it was boring. Extremely boring. Whether im being biased/comparing'moviecritic68' stated that the younger audience will be uprating this film; well, as a 13 year old whose favourite film at the moment is The Winter Soldier, the follow-up to it was boring. Extremely boring. Whether im being biased/comparing my views on this to that of TWS is irrelevant, because this film didn't strike me as entertaining. It had an interesting premise but didn't deliver it very well. However, the new portrayal of Spider-Man i think was the best since the original Tony Maguire performance, and I liked the inclusion of Black Panther. There were some good fight scenes: most notably the one between Iron Man and Captain America, and a majority of the cinematography was well executed, but overall, it was a very boring film that I had much anticipated. Rather disappointed to be honest.",
      "review_date": "2016-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n7/10, if that. Maybe 6.5/10. Not BAD per say, but this movie made a lot of the same flaws that Age of Ultron did, mostly due, I suspect, to a time crunch; such as hurried plot progression and failing motivation for both villain and character. Adding in Spiderman was just Marvel wanting to show off the character they'd bought but it really detracted from some of the gravitas. He was very good but he didn't seem to fit in with the overall story. And the side-plot involving him was one of the elements that had been a worry for the movie; that it wouldn't be a true Captain America movie as it wouldn't be about him as much as it should've.\r The movie was built up around the Accords but they pretty much were forgotten for the entire second half and it just became about Iron Man wanting to prove himself right over Captain America. They were the motivation, yes, but that became very hard to see by the time of the airport fight scene. And of course there was a lot of time given to the other Winter Soldiers but then it cut off when he killed them. A twist, yes, but one which wasted massive amount of film time. The fight scenes were decent but some of the employed elements, such as Ant-Man's surprise, were rather surprising--and not in the good way. It was the sort of thing that really didn't belong in a group hero movie.\r When it comes to movies about conflicting ideals, especially when, as in this case, both sides make solid and understandable points, it is usually important to give both sides their due so, even if one wins, both are understood. And it had that covered quite well early on with Tony's guilt and Steve's hero complex, but that theme was lost somewhere along the lines. Eventually Tony's team (minus Natasha) seemed composed of people seeking revenge (T'Challa), gratification (Tony), or just following blindly (Spiderman+Rhodey). There wasn't even any pressing NEED for them to fight, and that was what made the movie as a whole rather hard to swallow.\r Characterization, as with the plot, began well before taking a nosedive about halfway. There was a nice base, each character given their due and specific reasons to support their side, but as the difference in opinions arose it was lost by the wayside. Some of the most important elements were forgotten in place of cheap drama; Tony became a hothead with no care for Steve (a feature which was the entire point of Ultron), Peter became a fanboy without the ability to think for himself, and T'Challa sought revenge with no other thought through his head. (Or, for the record, explanation for his own abilities and suit beyond a passing comment of it being an heirloom.)\r All-in-all the movie gave the feeling that they were heading in one direction beforehand but a last-minute change forced them to scrounge for an alternative ending. Not quite bad, but shall we say... lacking.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As someone who isn't crazy about superhero movies, I can't help but be impressed by Marvel, and just how far their stories and characters have progressed in such a short time. Arguably the best of those characters is Captain America, simplyAs someone who isn't crazy about superhero movies, I can't help but be impressed by Marvel, and just how far their stories and characters have progressed in such a short time. Arguably the best of those characters is Captain America, simply because he's the one character people are most likely to relate to. The Captain isn't a billionaire or a king, and he doesn't have super abilities from another planet, he's just this wholesome, level headed guy, who you can't help but like. In his third feature film, Captain America (Chris Evans) comes into conflict with other members of the Avengers, as following a tragedy, the world governments decide the Avengers shouldn't be free to do whatever they want anymore. Some of them agree, some of them don't, and that's where the split occurs, leading to one of the best fight scenes I have ever seen. When I saw the previews for this film, I couldn't understand why the story wasn't used for an Avengers film. Even while watching it, I noticed that much of the focus isn't solely on Captain America, and I became even more convinced. This film was not a true stand alone like we've seen in the past, and that's because I think it was more of a transitional project than anything else. Clearly it seems as though Marvel is putting Captain America on the shelf for a while and trying to draw our attention to the new Spider-man series, starring Tom Holland. I must admit, I have never really liked Spider-man. I always saw him as bland and weak compared to the rest of the Marvel universe, but Tom Holland changed my mind in this film. He was all personality, in a way that Toby McGuire and Andrew Garfield couldn't even imagine. The charisma this good looking young actor puts out there should be enough to get anyone excited for the new series. As far as this film goes, the story was a bit complicated, and in my opinion there are far too many characters involved for this to be titled Captain America. In that sense I was disappointed, because I love the character, and was looking forward to another feature film about him. On the other hand, amazing new characters were added, a major story line was introduced into the Avengers genre, and I got to see the best action sequence I've ever seen, so while it wasn't what I expected, I still highly recommend seeing this film.",
      "review_date": "2016-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To all you people out there who said this movie is great, epic, amazing etc. I hope you got paid for spewing such lies. This is an exhausting mess, although not completely without its moments. I did enjoy some of it but let me break this downTo all you people out there who said this movie is great, epic, amazing etc. I hope you got paid for spewing such lies. This is an exhausting mess, although not completely without its moments. I did enjoy some of it but let me break this down for you. We have the first hour of nothing, politics, more nothing, contracts, discussions, and one of the worst edited fight scenes I have ever seen (I'm talking Quantum of Solace bad) honestly, skip it. The last hour is Captain America getting overshadowed by every other character in the damn movie. And smack bam in the middle is a 20 minute introduction to our friendly neighbourhood Spiderman. Meet 12 year old Spidey make his not so amazing entrance that really made me want to jump into the movie and slap him in the face. Would I recommended it? What's the point, you're all going to see it anyway, you're all going to pay good money, watch it, including the end credit sequences and see the next one.",
      "review_date": "2016-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pure perfection. This movie was in almost every single way a masterpiece, not just for the superhero genre, but for movies in general. Don't even get me started on the action scenes in the movie, because they were all superb.",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another great release for the Marvel Cinematic Universe and an excellent conclusion to what I think is their strongest lone superhero films: the Captain America trilogy. I believe the first Captain America film was another fun MarvelAnother great release for the Marvel Cinematic Universe and an excellent conclusion to what I think is their strongest lone superhero films: the Captain America trilogy. I believe the first Captain America film was another fun Marvel superhero movie, but with Winter Soldier and now Civil War the bar was certainly raised for the MCU. Within Civil War there is the classic humor, but it still maintains a much more serious and pressing plot, pitting friends against each other and dividing the Avengers team. The film's action is unparalleled as far as the rest of the Marvel films and Downey's Iron Man performance as well as Evans and the rest of the cast's acting is great. I thought the creators did a very good job of letting all the superheroes have their moments of glory, as well as introducing new players like Black Panther and Spider-man (both awesome), while still keeping the primary focus on Captain America and his loyalty to Bucky, his lifelong friend. A must-see for general movie fans, not just superhero fans. 8.5/10. Side note: the airport scene is incredible.",
      "review_date": "2016-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall, a very enjoyable addition to the Marvel catalog.  That being said, I thought the character playing the new Spiderman was weak, more character development was needed for the Black Panther, and more time dedicated to Captain AmericaOverall, a very enjoyable addition to the Marvel catalog.  That being said, I thought the character playing the new Spiderman was weak, more character development was needed for the Black Panther, and more time dedicated to Captain America given that it is, after all, his film.  Finally, the rift between Captain America and Iron man seemed a little too contrived, not painful or long lasting enough to make the needed impression on the audience.",
      "review_date": "2016-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America Civil War is the best Marvel Comic Book movie to date. I can not repeat how much I enjoyed this movie. The hype train did not derail, so glad this movie surpassed my expectations. The Russo brothers just get it, they haveCaptain America Civil War is the best Marvel Comic Book movie to date. I can not repeat how much I enjoyed this movie. The hype train did not derail, so glad this movie surpassed my expectations. The Russo brothers just get it, they have cracked the da vinci code to making great comic book movies. I can now say without doubt that Infinity Wars is in safe hands. My mind was blown. I'm gonna have to watch it in the theatre at least 4 more times. 5/5 stars, I recommend everyone to go watch this movie on the biggest screen in your city.﻿",
      "review_date": "2016-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First thing, if you have not seen previous Marvel movies, specially Captain America and Avengers, do not watch this movie, because you will have a chaos in the story lines. This movie has many similar aspects with DC Batman vs Superman movie.First thing, if you have not seen previous Marvel movies, specially Captain America and Avengers, do not watch this movie, because you will have a chaos in the story lines. This movie has many similar aspects with DC Batman vs Superman movie. It is interesting to compare these two movies, because here is very visible difference and how it should be in BvS movie. Reason why BvS does not make sense and this movie does is, that Marvel created a story for every character, so you know who are they, why are they the story and what problems they have to solve. This movie is great in visual, but I have a problem with some action scenes. Sorry, but we are in 2016 and some of the scenes looks ridiculous and absurd, when, for example, human-hero survive bomb  explosion just because he jump away from the bomb, but the bomb explode just about 2-3 m far behind him. The movie tries to be more darker and solve some serious moral superhero questions, but some jokes in thrilling moments are just not suitable and damage this serious atmosphere. I do not want have spoilers hare, so about the story - it is not bad, but could be better. Sometimes raises some questions like \"Why is he/she (not) doing this?\".  The movie is more focused to action scenes and visual effect. It is not bad movie, have many good aspects, but previous Marvel movies had better quality for me.",
      "review_date": "2016-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Marvel movie yet and best comic book movie yet. Why?\r -Spider-Man finally joining the Avengers\r\n-Black Panther\r\n-Avengers Disassembled\r\n-The Airport Fight Scene, Arguably The Best Comic Book Movie Action Sequence Ever\r\n-Zemo is theBest Marvel movie yet and best comic book movie yet. Why?\r -Spider-Man finally joining the Avengers\r-Black Panther\r-Avengers Disassembled\r-The Airport Fight Scene, Arguably The Best Comic Book Movie Action Sequence Ever\r-Zemo is the MCU's newest compelling villain\r-Lays the groundwork for Phase Three of the MCU perfectly",
      "review_date": "2016-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "best Marvel movie ever!\rAn exciting and sometimes funny film.\rmarvel keep doing so on I'm a fan!\rNow wait for x-men apocalypse\rAnd Doctor Strange!!!!!",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was one of the best Marvel movies I've ever seen! The plot fit well, the action was awesomely intense, and the character development was great. It's definitely worth your ten dollars to see it in the theater.",
      "review_date": "2016-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The cast, once again, as usual, is a standout. Chris Evans still proves that he is Captain America, distilling in him doubt and a questioning manner, while also showing him as a conflicted and true leader. Evans commands the film and everThe cast, once again, as usual, is a standout. Chris Evans still proves that he is Captain America, distilling in him doubt and a questioning manner, while also showing him as a conflicted and true leader. Evans commands the film and ever scenes that he is in, proving that the Marvel Cinematic Universe isn't complete without the character. Robert Downey Jr. once again proves that he is Tony Stark and that no other actor can depict the character. Downey takes a backseat to Evans in good fashion and doesn't try to take the film away from him. This is more Captain America, than Iron Man, with Stark only arriving into the film when necessary and never hogging the film away from Evans. Downey and Evans work well together, while successfully showing the different sides of both characters: Captain America as the leader and Tony Stark as the billionaire, who after the events of Age of Ultron, is guilt ridden. His decision to favor oversight comes from a civilian in Sokovia being killed during the battle, which has a huge impact over the film. Sebastian Stan makes a welcome return to Bucky Barnes, the brainwashed friend of Captain America, code-named the Winter Soldier. Once again this character proves that the Captain America trilogy is about one thing: brotherly love. Stan's depiction brings a sense of doubt and confusion, since he still trying to piece his entire life together, while it also partly ties certain events together. Scarlett Johansson is marvelous as always as Black Widow, delivering great lines and working well opposite both Evans and Downey. Anthony Mackie is once again amazing as Falcon, Captain America's new ally. Don Cheadle still works well with Downey and in the role of James Rhodes, having replaced Terence Howard in Iron Man 2. Jeremy Renner makes a great, small appearance as Hawkeye, as does Paul Rudd as Ant-Man, lending a sense of comedy to the film and giant surprises. Paul Bettany depicts Vision as an android attempting to come to grips with the world, while Elizabeth Olsen gets to further explore the character of Scarlet Witch, sharing some really great scenes with Bettany. William Hurt makes a welcome return to the MCU as Thunderbolt Ross, now Secretary of State. This approach seems to be done as a way to still make clear that The Incredible Hulk (the black sheep of the MCU) is still part of the universe. Hurt shows Ross as a complicated politician. Frank Grillo makes a great, small appearance as Rumlow at the beginning, while Emily VanCamp makes a welcome return as Sharon Carter and Martin Freeman is introduced to the MCU in a small role as Everett Ross, who will undoubtedly return for future installments. The real standouts in the film are Tom Holland as Spider-Man and Chadwick Boseman as Black Panther. Holland steals the scenes that he is in as Spider-Man, working exceptionally well opposite Evans and Downey, as well as Marisa Tomei, who depicts Aunt May. Holland is comedic, depicting the character as a nervous, geeky, unsure character. Holland seems to be the definitive version of the character, delivering a far better performance of the character than Tobey Maguire and Andrew Garfield, the two of whom are also fine actors. While some may say that Spider-Man is only featured in the film to introduce him into the MCU and also to setup the planned standalone film, I believe that Spider-Man worked out well in the film and lend a real sense of stamina to the film, especially the big fight. Boseman is amazing as Black Panther, delivering the character with menace and true purpose. Boseman is calm as the character, while the introduction is wild and spectacular. Daniel Bruhl makes a great appearance as the villain Zemo, who has a huge connection to the events of the film. While the character is different in the comic books, I can defend the change that had to be done, since it supports the film's plot and layout. Bruhl's approach to the character, as a calm and calculating villain, as well as the villain itself is spectacular, while he has got to be the best villain that the universe has had to see so far. The idea of having a normal, regular human face off against the Avengers is smart and total genius on the part of the filmmakers.",
      "review_date": "2016-05-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well directed action,well written and well balanced superhero flick.This by far Marvel's most mature film ever put to screen.With new great edition to the franchise that was well introduced and the different ideologies was well thought outWell directed action,well written and well balanced superhero flick.This by far Marvel's most mature film ever put to screen.With new great edition to the franchise that was well introduced and the different ideologies was well thought out with a great action fight choreography.It's serious but they blend some hilarious moments in some scenes perfectly.It's a fun action flick all in all.",
      "review_date": "2016-05-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's not \"the greatest superhero movie of all time\" as some have claimed. It's decent. The action is average and the pacing is terrible, but the overall divide between Stark and Cap is clear and believable, which is what really matters most.It's not \"the greatest superhero movie of all time\" as some have claimed. It's decent. The action is average and the pacing is terrible, but the overall divide between Stark and Cap is clear and believable, which is what really matters most. However, the film is not always terribly clear why the others picked the side that they chose. This is most obvious with Clint and Scarlet Witch, both of whom seem very out of character with the choices that they make. It is worth noting that this may be my favorite villain from all of the Marvel movies so far.\r The stark difference between the critical reviews of Civil War and Dawn of Justice is utterly baffling to me. The films share similar strengths and similar weaknesses. Both film studios need to straight up fire their editing crews, because Civil War (like DoJ) suffers from jarringly bad editing. Where DoJ suffers from scattershot editing that puts together the scenes in an unintuitive way, Civil War seems to start and stop multiple times before it finally hits its stride about halfway through the film. This is made even more clunky as the film tries to introduce multiple new characters without ever slimming down the main cast. Fortunately the new heroes are all well played. Also, Civil War's actors are often talking off-screen even during pedestrian conversations, and it's really obvious that the two actors are not in the same room, which dramatically weakens a couple key scenes.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I would safely dare say that there has been no equally spectacular movie as Civil War. It's the most emotionally compromising superhero film I have ever seen in my life.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Russo brothers have done it again!!! Captain America: Civil War like it's previous film Captain America: Winter Soldier, is a very balanced mix of humor, drama, and action, it's just what comic movies are supposed to be like! This filmThe Russo brothers have done it again!!! Captain America: Civil War like it's previous film Captain America: Winter Soldier, is a very balanced mix of humor, drama, and action, it's just what comic movies are supposed to be like! This film not only stays true to the characters, but also handles multiple characters very well. I loved this movie and I am looking forward to what the brothers have planned for the next Avengers movies in 2018 & 2019.",
      "review_date": "2016-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall this movie is bland. The only positive thing is the airport fight scene (Which is by far the best superhero action scene i have ever seen) and that's it. The rest is just a bland boring pile of nothing.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's good movie it has humor, romance and action sometimes it gets a little slow but is still fun movie and this movie let the history open for next avengers movies positive score",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Starts off a little slow. Why devote ten minutes to setting up a character's motivation when you could have done something productive like burning Clint's stupid farm to the ground? At points I felt it was a little heavy handed, but once itStarts off a little slow. Why devote ten minutes to setting up a character's motivation when you could have done something productive like burning Clint's stupid farm to the ground? At points I felt it was a little heavy handed, but once it gets going, it's really solid. Yup, certainly a wild ride. Not gonna lie, if you're very invested in the MCU cannon, this movie is emotional terrorism. Write a will before you see it.",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War - certainly not bad film from Marvel, but better still, personally, I can not call him. In the film, there are a number of silly defects that spoil the impression of the picture: from the cliched villain (plans andCaptain America: Civil War - certainly not bad film from Marvel, but better still, personally, I can not call him. In the film, there are a number of silly defects that spoil the impression of the picture: from the cliched villain (plans and motives which I guessed almost from its very appearance) and ending with the exaggerated title \"Civil War.\" This movie can boast the presence of interesting and funny characters. In general, the film manipulation deserves honorable 7 points and my respect, and remains at the level of the remaining parts of Captain America. If you're a fan of Marvel, or even movie-comics, then be sure to view, and if you are an ordinary viewer, who is not familiar with the universe, you can not even walk, still does not understand. Thank you for reading! :*",
      "review_date": "2016-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Due to unforeseen circumstances, aided and abetted by a rainy day, I found myself once again submitting to the very dubious pleasures of Marvel. Admittedly this is a few notches up from previous efforts and, despite a patchy and inconsistentDue to unforeseen circumstances, aided and abetted by a rainy day, I found myself once again submitting to the very dubious pleasures of Marvel. Admittedly this is a few notches up from previous efforts and, despite a patchy and inconsistent screenplay there is actually a germ of a good story being played out, albeit at monstrously excessive length. The mystery surrounding the deaths of Iron Man’s parents; the brief introduction of additional warriors and a fantastic stunt set piece involving Captain America and a helicopter are all plot points or moments that promise much. Unfortunately, pasting such highlights between endless fights and battles ensure that the story’s flow becomes a stop start affair. These action sequences are not only lengthy and unimaginatively staged, but are also loaded with the usual tiresome banter and unfunny lines which severely disjoint the passably good story and seem to have become a staple ingredient of these films. Technically the achievements are good enough, but it has to be said that the cinematography is very dark for much of the time. Also, the special effects whilst perfectly acceptable are not really showcasing anything new. Fans will, I’m sure, lap it all up. However, even as I contemplate this certainty the one question that keeps wanting to be asked is WHY?",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n**So Many Spoilers** **Spoilers**\r Marvel made some great films like Guardians of the Galaxy,The Avengers,Iron Man,Winter Soldier and Ant-man but they also made some mediocre ones like Thor the Dark world,Iron man 2&3 and The incredible Hulk and also the disappointing film Avengers:weak of Ultron .So \"civil war\" where do I need to put this? in the Great category of course.This by far Marvel's strongest film better than the Winter soldier,yeah I said it,Some people may prefer Winter soldier but for me is better than that.\r The Characters,They are all great,they where given enough time to shine especially spider-man, you won't be disappointed with Black Panther cause he is also great.The new Characters are great and I like to see them their upcoming films.Iron Man/Tony stark is amazing,it felt like Iron man 1,he regrets everything that he has done and that's why they need to put in check.Captain America is the same boy scout that you know and Chris Evans still nails it as the guy who dress up as a flag.And again the other Avengers where given the time to shine.The real villain Zemo is the first villain in the MCU that is just some guy who has a plan to tear the avengers apart and put some layers of the character but the villain is forgettable.I hope they use him and set him up as bigger threat in in some of the future marvel films cause he is not yet dead,he almost try to kill himself but Black Panther saved him.\r The action scenes are fantastic well some of the scenes felt too shaky but that was just one scene where Bucky,Black Panther and Captain America chase scene.The best fight for me was Cap vs. Iron man scene in the final action scene in the film,where Iron man founds the truth that The Winter Soldier killed his parents and Cap tries to save Bucky from Tony.The fight was amazing and I love to see it again.The second one was the Airport fight sequence,It was the best part of the film where the Superhero Vs superhero fight happened.The fight sequences where handled pretty well and they give emphasis of the heroes abilities and Spider-man's quips.Let me go on fanboying about spider-man,He is great and Tom Holland is the best Spider-man/Peter Parker better than the Tobey and Andrew's Version.He is given time and makes me smile when he appears in the airport fight sequence.He is also talkative and throw a lot of quips and I like it.My other favorite character,Ant-Man grows big like in the comics first time on screen.So the action sequences are great and the Russo Brothers really knows to do Action.\r The different ideologies between Cap and Iron man are handle well.the Sokovia Accords thing where they need to be under the eyes of the government and the Avengers id not anymore a private agency was handled well.The set-up of why Cap and Tony fight was handled greatly and they take time to emphasize their different ideologies.The 2nd major one was Bucky,Buck is huge in the conflict.He was framed by Zemo and make T'challa thinks that Bucky killed his father with a bomb while in the United Nations.The whole government think of that.Cap founds out about Zemo and wants to find him to know the truth and making them split in to two groups #Teamcap and #TeamIron man leading up to the airport fight,where they know where Zemo is heading and all of team cap was there to go with him but Team iron man founds them and the fight begins. Okay I am now explaining the plot but seriously it was handled greatly and make sense cause we know why they fight and why they where split.You will be confused of which side are you on cause both men are right in their respective ideologies.Marvel did a great job between the Punisher and Daredevil's ideologies and why not do a great one in \"Civil War\".\r So Captain America:Civil War is Marvel's strongest film with a plot that works,characters that we love emphasizes their abilities and powers and stay lovable. Action sequences that was fun to watch.It destroys Age of Ultron and is the best movie in the Cap's Trilogy.This is a fun summer movie.I recommend this.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was a good movie, but it was extremely one-sided for Captain America and his team, plus the motivations for his and Iron Man's fight were completely absurd. The movie also makes Iron Man to be someone stupider than he really is.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "FILME SENSACIONAL!!!! De arrepiar,filme muito bem feito,ótimos efeitos e lutas,encontro de vários heróis épicos a um novo passo para o universo cinematográfico da marvel",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Literally flawless. The action scenes were amazing. The characters were well written and their motivations were clear. The editing and pacing pretty much impeccable. Excellent humor, especially from Ant-Man and Spider-Man. Fantastic visualsLiterally flawless. The action scenes were amazing. The characters were well written and their motivations were clear. The editing and pacing pretty much impeccable. Excellent humor, especially from Ant-Man and Spider-Man. Fantastic visuals and CGI. I can't find one single bad thing to say about this movie. I guess if you start nitpicking, you'll probably find some flaws. Overall, it was the most entertaining movie I've seen this year. This movie is proof that you can make a great movie regardless of genre.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The vaunted big confrontation at the airport was a huge dud. The characters basically admit they're not even trying to hurt each other. I'm really tired of all these same-y Marvel movies; they were fun for a while but there's way too manyThe vaunted big confrontation at the airport was a huge dud. The characters basically admit they're not even trying to hurt each other. I'm really tired of all these same-y Marvel movies; they were fun for a while but there's way too many characters now and instead of coming up with good villains they just keep blaming everything on Nazis.",
      "review_date": "2016-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well\rThe Avengers - Iron man VS Thor and Hulk VS Thor\rAge of Ultron- Iron man VS Hulk\r\nWell MARVEL at this point -\"well there has never been Iron Man VS Captain America so lets do this.\"\r\nThe movie is no civil war\r\nPeople are fighting forWell\rThe Avengers - Iron man VS Thor and Hulk VS Thor\rAge of Ultron- Iron man VS Hulk\rWell MARVEL at this point -\"well there has never been Iron Man VS Captain America so lets do this.\"\rThe movie is no civil war\rPeople are fighting for no reason in the second act.\rThere was good emotional fight at the end but it was based on a assumption that Iron Man will somehow show up .\rCGI was crappy\rFor god sake this movie cost $250 million dollars , use it.",
      "review_date": "2016-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAs a movie civil war was good except it just lacked one thing: you can tell from the events of the film that the reason for the heroes fighting isn't the registration act, its because cap wants to protect bucky from the rest of the avengers. The main reason why panther joined in the first place was because he thought the winter solider killed his father, evidently he didn't. And at the end of the movie when we see Cap and Stark beating the **** out of each other, it isn't because of the registration act, it's because Stark finds out that the Winter Solider killed his parents and Cap defended him using the excuse that he was being mind controlled and didn't do it willingly, unlike what you've seen in the trailer which gave you the idea that the reason for them fighting is the Act.\r But the movie was good in more ways, Black panther was a very interesting character so was Tom Hollands Spiderman. The Airport fight was probably the best scene in the movie, it had all the elements need to give the viewer the feeling that these people are willing to beat the living crap out of each other.\r As a DC fan and as much i hate to admit it, Civil War was much better than Batman V Superman. It actually gave you a feeling that there is an actual civil war going on, unlike Batman V Superman which promoted the film for three years and showing glimpses of the fight making people think it was going to be awesome, but it ended up being a very short fight with a very quick conclusion (Not saying BvS was horrible).",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was a good movie, My Buddys and I are big marvel fans and saw this the first night it came out. It had a great but slow story to start it off but built up deeper into the movie. It also had great action and funny moments. People also gotIt was a good movie, My Buddys and I are big marvel fans and saw this the first night it came out. It had a great but slow story to start it off but built up deeper into the movie. It also had great action and funny moments. People also got to understand that this is leading up to infinity war and if you stay and watch the end credits, you get a quick look at the next movie coming sometime in 2017-2018.",
      "review_date": "2016-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is over-hyped plain and simple. With multiple plot holes and weak villains, However the action is fun and Spider-Man and Black Panther are awesome. I would wait until it on blu-ray or DVD and just skip to the action and Spider-Man scenes.",
      "review_date": "2016-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simplesmente Perfeito, não há outra palavra para descreve essa obra  A Marvel acerto em cheio mais uma vez. A parte do Homem Aranha, e do Formiga, foram sensacionais. A Luta no Aeroporto foi uma Ópera.\rRealmente um dos melhores filmes do ano.",
      "review_date": "2016-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The \"Civil War\", of course, can't avoid comparisons with the recent \"Batman v Superman\" film. In both films their authors decided to create confrontation between \"good\" heroes, thus adding philosophical depth and psychological authenticity toThe \"Civil War\", of course, can't avoid comparisons with the recent \"Batman v Superman\" film. In both films their authors decided to create confrontation between \"good\" heroes, thus adding philosophical depth and psychological authenticity to the heroes. Also both films have raised up a problem of the so-called \"collateral damage\" and responsibility for consequences of superheroes actions.\r While not referring to the question \"which movie is better\", I'll try to ask myself a question \"why the theme of confrontation between the \"forces of good\" appeared in the film adaptations now?\" I think the answer lies in the domestic US problems. Criticism of Bush's foreign policy and national security measure, I think, were essential in raising \"collateral damage\" problem and control of power in original comic book series. Coming to power of the \"leftist dove of peace\" Obama that has transformed now into a crisis of the US political establishment, manifested in the appearance of presidential candidates like socialist Sanders and populist Trump, tells about upcoming serious reformatting of traditional American values. What twenty five years ago has seemed unshakeable foundation of the US - individual freedom, liberalism, individualism, Christianity, reliance on the middle class, the belief in the \"American mission\", the constitutional rights, the right to freely carry weapons, the belief in the intransigence of good and evil (so- called \"freedom values\") - is increasingly shifting now to the so- called \"safety values\" - strengthening of state control and regulation, taxation, reliance on large corporations on the one hand, and people with low incomes, on the other, with the simultaneous impoverishment of the middle class, atheism, restriction of the right to carry weapons, moral relativism, non-interference in the affairs of third countries. This US' \"offset of values\", with the polarization of the supporters of \"freedom values\" and supporters of \"safety values\", I think, is reflected by the both blockbusters.\r In the previous Russo's work with Captain's story we already saw clash of these values when heroes revealed that evil has grown up inside of SHIELD and its operatives and head were converted to the HYDRA's side arguing that security and control will finish the world's chaos. In this Captain's story the same message was hidden by Ross brothers more subtly, when right and wrong sides are not so clear. As in life, it is difficult to see the evil in someone everyone accustomed to consider to be a hero and who considers himself to be good (as well as all villains).\r On the one hand there is Captain - the embodiment of the \"freedom values\" - who believes that you can not shift the responsibility for your actions on others including the state (like, for example, the Nazis did) or a coalition of states, knows that there \"at the top\" just ordinary people with their ambitions and desires, and that he won't become a puppet in the hands of cynical politicians only in order to get rid of guilt and absolve himself of responsibility. He is the embodiment of belief in uncompromising, absolute good and evil, inviolability of principles, justice, even if they are not supported by the majority, which out of fear is ready to give up freedom in exchange for security, to exchange risk-taking birthright for a guaranteed onion soup. On the other hand there is the Iron Man, oddly enough, the epitome of the \"security values\" - he comes from large corporations, he wishes to subdue the group's activities to external control, to absolve himself of responsibility, and thus in some way (how?) to protect others from \"collateral damage\".\r If motivation of Captain America is transparent - responsibility, adherence to the principles and concepts of good and evil, even if they are contrary to written laws, as well as loyalty to friendship, the Stark's motivation is questionable. Does he made his decision due to the conscious or unconscious desire to split the group and take the leadership from Captain America, isn't there monstrous selfishness hidden behind the rantings about the need to \"control\" (again, it is not clear how such controls could prevent \"collateral damage\"), maybe it is thirst for power and, at the same time, desire to absolve himself of any responsibility for the \"collateral damage\"? Look at the motivation of the real villains (Commies, Nazis) - they wanted to create a perfect system with total control for the \"security\" of common fellows, who they sought, were unable to bear the burden of freedom. Ultron was alike, but he grabbed his delusion ideas from Stark. For me, Stark is the main villain of the film. He begins to pursue those who disagree with him - put a pressure on them, put them (Wanda) under arrest. It is similar to most of the tyrants, a typical villain who wants to trample his opinion as one and only and to eliminate all who disagree.\r Behaviour of Black widow seems illogical - she is a clear candidate for Captain's team (unless she has stayed with Stark for sabotage like in the hangar scene). But suffering from guilt Wanda would rather choose Stark's side that allows her to shift responsibility to someone else. But she has chosen the right path of \"growing up\" - accepting responsibility. In the \"Age of Ultron\" she had read Stark's mind and warned Cap that Stark is \"capable of anything\".\r Distracting from the current political and philosophical background of the film, it may be noted that in terms of action this Marvel's cinema-comics keeps the style and the brand - despite the seriousness of the plot, Marvel's ease and jokes are still there even during fierce battles. The flick is dynamic and quite fun, though perhaps not as deep as the \"Batman v Superman\", but more fully revealing of the motivation of the main characters.",
      "review_date": "2016-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Opening to Marvel: Phase Three is a simple: Oh, by God!\"\r \"There was no way more perfect and majestic to start Phase Three of Marvel Cinematic Universe\"\r\n\r\nThis \"Captain America: Civil War\" Review contains some spoilers. If you have\"The Opening to Marvel: Phase Three is a simple: Oh, by God!\"\r \"There was no way more perfect and majestic to start Phase Three of Marvel Cinematic Universe\"\r This \"Captain America: Civil War\" Review contains some spoilers. If you have not seen \"Civil War\" film, please, do not read, this could destroy it.\r A few years ago, approximately, five or six years, Marvel had in its hands one script and one proposal that possessed enough unknowns. That project would receive the name of \"Avengers\". The biggest concern for the owners of the company was supposed to make a film where not only a hero was the protagonist, may break the story, be boring and completely commercial. Two years later, on May 4, 2012, \"Marvel's The Avengers\" landed in all movie theaters, solving each and every one of those unknowns on just the first day at the box office. Today, Mayo 2016, \"Civil War\" increases its number of participants to 12 heroes and 3 villains. Will this be the film event of the year? I don't know, I can only assure, Marvel has lost the fear and perhaps in the next few years its projects could reach total perfection (Avengers: Infinity War Part:1 or 2).\r Based on the Comic of 2006-2007, movie serves as a sequel to \"Age of Ultron\" and \"Captain America: The Winter Soldier\". After all the fighting and disaster in \"Ultron\", the Avengers return to discuss issues still more violent than in 2015, the death of innocents (something very, very similar to what we saw in \"BvS\", with Superman, and then say that they are polar opposites) and the dilemma, Does our help really help?\r Thaddeus \"Thunderbolt\" Ross (William Hurt, reprising his role from The Incredible Hulk) immediately ordered a conference to bring together to acclaimed heroes. After showing the dramatic and terrible consequences of their actions, it opens way for the culprit of this civil war. Sokovia Accords established by the United Nations. That treaty, aims to put each of the actions and missions of the Avengers in the hands of the United Nations for so, take care of each human life, taking into account that it will be them who decide if the heroes can act or not. As expected, not everyone agrees. They needed something for fight, here is their reason. After discussions, different thoughts, ideologies and equations, the decisions are made. 36 hours, two teams, a objective, an end, and Russo Brothers, Civil War has begun!\r I affirm with all security and respect that \"Civil War\" has the best sequences of action of Marvel films so far, with sophisticated and perfect choreographies and training. A true example, and personally one of the best parts of the movie, the fight at Berlin airport. The presentation of both sides, literally, made me cry, its class, its style, its elegance and its professionalism to mix and combine each of the specific abilities (physical and emotional) of the old and new heroes, to create a scene of entertainment, quality and long, long fight makes that truly the public continues to support to \"Marvel\" for continue, (Curious fact: Directors David Leitch and Chad Stahelski (\"John Wick\") are part of the second unit of the film).\r \"Spider-Man is the equivalent to Wonder Woman in Civil War\"\r Special relevance has the presentation of Spider-man and Black Panther. Their inclusion is appropriate, the first is introduced in way more relaxed and comic, who along with his fight and jokes makes this be the best performance in the Peter Parker story.\r Another hero who had appointment was a Black Panther, an heir to the throne full of hatred and pain, perfect for his own movie and with a fresh and innovative appearance. In addition, other friends already seen previously are incorporate to the group as \"Ant-Man\", associating the world of past facts (seen in the films) with the present, something that really strengthens and gives coherence to the Marvel Universe. While many characters used this as a springboard for their own films (Spider Man - Black Panther), all boils down to the personal conflict revealed at the end between these three men, it is something that goes beyond policies, laws, treaties or rules, this is personal. Russo brothers take the decision after pleasing to the public with that magnificent fight, they there will be no more effects, flying planes, cobwebs, or CGI, for that moment, they weave meticulously a narrow path to focus on the three real protagonist of the story, Tony, Steve and Bucky.\r And then, arrive the final fight, \"Iron Man\" vs. \"Captain America\" a dispute of friends. The fact that Bucky was defeated and they could fight each other was really fantastic, this is not a trick more to win more money, it is the destiny. Personally, I felt like the final fight between Batman and Superman, that anger but at the same time love, that hate but at the same time forgiveness , it created a swirl of emotions and thoughts that ended in fatalism. \"CW\" had all the unimaginable, and even the enigmatic and traditional cameo appearance of Stan Lee.\r Phase three has begun. If Marvel offers us more equal or better products that this, will sound crazy but, they could reach the level and love of critics and fans to \"Star Wars\" . Goodbye to the cliché about Marvel films are cheap fiction and paste sh_t, quality exists. \"Civil War\" gives us a true contrast of \"BvS\", but is just as tasty, fruitful and exciting. \"CW\" is the best film of \"Marvel\" so far. It plants strong and resistant foundations to the future to come, leaving a hard and impossible work for Warner Bros. with \"Suicide Squad\" and Fox and Marvel (again) with \"X-Men: Apocalypse\" in May and \"Doctor Strange\" in November.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beyond my expectations.Just saw the movie and it is incredible a masterpiece.I'm having difficulty in finding words to describe.It is a combination of action and humour.Marvel knows how to keep the attention on screen.The directors areBeyond my expectations.Just saw the movie and it is incredible a masterpiece.I'm having difficulty in finding words to describe.It is a combination of action and humour.Marvel knows how to keep the attention on screen.The directors are amazing.They made a history.I'm so happy that spidey is finally in MCU.Loved black panther looking forward for the solo movie.I'm just curious can the Russo brothers get any better.Marvel found the best directors for infinity war.Don't listen the bad reviews they don't know anything about a real movie",
      "review_date": "2016-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Jé suis un ravis quand je regardé les film etait superb bien malgre je pas vraiment pu a comprendre l'histoire ou les but du film\r Dans les film il y a pas tout les star come Hulk n'etait pas sur dans les film. est les fans on besoin d'uneJé suis un ravis quand je regardé les film etait superb bien malgre je pas vraiment pu a comprendre l'histoire ou les but du film\r Dans les film il y a pas tout les star come Hulk n'etait pas sur dans les film. est les fans on besoin d'une bonne histoire, j'etait competent devoir ant man et spider man",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was by FAR THE worst movie of the year!  They stole from Batman vs Superman...had ALL kinds of plot holes.  Jokes fell flat.  The movie was just...plain...aweful!!!  Stay away from this piece of trash!  I wanted to gouge my eyesThis movie was by FAR THE worst movie of the year!  They stole from Batman vs Superman...had ALL kinds of plot holes.  Jokes fell flat.  The movie was just...plain...aweful!!!  Stay away from this piece of trash!  I wanted to gouge my eyes out half way through this trash!",
      "review_date": "2016-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I do not know what I found most ridiculous in this film, if was was the giant ant man imitating the kung fu panda, or the little truck that grows and explodes, or the spider man mimicking the Empire Strikes Back or the villain, that wasI do not know what I found most ridiculous in this film, if was was the giant ant man imitating the kung fu panda, or the little truck that grows and explodes, or the spider man mimicking the Empire Strikes Back or the villain, that was certainly the worst villain ever created for a hero film, with the more stupid story ever ... how he would know that the winter soldier had killed the parents of iron man ??? How do he would know the heroes would arrive together in the Syberias base? worst story ever!",
      "review_date": "2016-06-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am quite impressed with Civil War, because beyond being a simple movie of superheroes, is a Solid, perfect, mature and dark drama. Who is the one who has the reason? That is the question I asked myself while watching the movie. Civil War isI am quite impressed with Civil War, because beyond being a simple movie of superheroes, is a Solid, perfect, mature and dark drama. Who is the one who has the reason? That is the question I asked myself while watching the movie. Civil War is a roller-coaster of emotions, because unlike the comic, which all the time favors the Captain America, in the film both sides are defended with various arguments, so much so that you get to have great sympathy for the team of Iron Man.\r The film is a drama, pure and solid, quite political, I dare to say that it is the movie of the Marvel universe more mature and serious that I have seen, in effect, follows this humor characteristic, but on this occasion it is not feel forced.\r The action is spectacular, the choreography of each battle is very well developed and the battle at the airport is epic, fun, Brilliant and amazing, accompanied by a good soundtrack. The CGI may be the least impressive of the film, because sometimes the characters looks like a 3D animated cartoon. but those scenes are minimal (thank god)\r Civil War is a masterpiece. The best film of the whole universe Marvel and probably the best film of Superheroes that I have seen.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent movie with an untypically grownup story. The airport battle is the funniest thing I've seen in a while. The only problem I have with \"Captain America: Civil War\" is like in so many recent films the 3D. It turns all this great andExcellent movie with an untypically grownup story. The airport battle is the funniest thing I've seen in a while. The only problem I have with \"Captain America: Civil War\" is like in so many recent films the 3D. It turns all this great and fast paced action sequences into a stroboscopic blur. It's a shame that Disney/Marvel who earn billions with these movies, are not willing to invest some of this money in a better technology. There's a reason why Peter Jackson used HFR for his Hobbit-movies.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Russo Brothers have outdone there selves by creating the most personal, character driven film the MCU has had so far. You really understand both sides of the argument over the Sokovia Accords and it even has you debating over who is rightThe Russo Brothers have outdone there selves by creating the most personal, character driven film the MCU has had so far. You really understand both sides of the argument over the Sokovia Accords and it even has you debating over who is right and who is wrong. But on top of the great characters and story it's also a really exciting, entertaining and straight up awesome movie to watch. Spider-Man and Black Panther and both great new additions that flow right in with the story, the action is amazing (airport battle scene, just saying) and it leaves you wanting more and more. Bravo Russos. Bravo Marvel! You hit it out of the park with Civil War!",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very satisfying superhero movie. The story is interesting and character driven. The action is top notch.  There is a nice mix of humor and drama. It has its flaws of course, but it is certainly the best superhero movie of the year so far.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best, if not the best MCU movie to date. The Russos and the writers managed to blend in the actions, mystery, emotions, and of course, the quips. \"Captain America: Civil War\" is an appropriate finale for the ever-improving CaptainOne of the best, if not the best MCU movie to date. The Russos and the writers managed to blend in the actions, mystery, emotions, and of course, the quips. \"Captain America: Civil War\" is an appropriate finale for the ever-improving Captain America trilogy. While it doesn't break new grounds in the genre (\"The Dark Knight trilogy\" and 2012's \"The Avengers\" have that honor), it certainly did enough to offer something new to the audience (In a much better way then the other Superhero vs Superhero flick earlier this year.While some people think that the villain is weak and boring, I think it's one of the smartest villains in MCU. While a great many people see this is an Avengers movie, there are some (including me) would still see this as a Cap movie. The Civil War event and the other Avengers are build around the Cap/Buck story arch, a continuation of \"The Winter Soldier\". Yes, this is a busy movie (Also the longest in the MCU), but it doesn't feel that long and/or boring, thanks to the lighthearted momentsAs far as box office go, I have no doubt this will certainly be Disney's 3rd gargantuan hit this year, and might possibly be the biggest of the year.",
      "review_date": "2016-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America Civil War is the thirteenth film of the Marvel Cinematic Universe. It is directed by Anthony and Joe Russo, with a screenplay by Christopher Markus & Stephen McFeely.\rIn Captain America: Civil War, disagreement overCaptain America Civil War is the thirteenth film of the Marvel Cinematic Universe. It is directed by Anthony and Joe Russo, with a screenplay by Christopher Markus & Stephen McFeely.\rIn Captain America: Civil War, disagreement over international oversight of the Avengers fractures them into opposing factions - one led by Steve Rogers and the other by Tony Stark.\rCivil War is definitely one of the best Marvel movies to date, and absolutely on par with The Winter Soldier which was also great. They are both on top in the Marvel Cinematic Movies ranking of mine so far. The conflict between these well beloved characters is done in a brilliant and fantastic way by the amazing Russo brothers who took the cheese out of the first Captain America movie , made one serious and great second movie, and build upon them both with the third outing.\rEveryone does a great job here, Chris Evans has made Captain America his own same as Robert Downey Jr for Iron Man. It features a very big ensemble cast and not one of them is anything less than great on the role. The fight scenes are also some of the best ever made in a comic book movie, even better than in The Winter Soldier. Especially the airport scene is just mesmerizing and totally stands out from everything else that's going on. Spider-Man is also unbelievably well done and Tom Holland is just fantastic. I am one of the few people who actually loved The Amazing Spider Man movies, and really got mad to hear that they are going to reboot the character again but I can see now that it was worth it. The visuals are great from beginning to end, the music is also good as usual. The villain is something that most people though it was the weakest point but I strongly disagree with that. He had reasoning as to why he is doing those things, and he pushes the other characters in new directions which is also necessary.\rI generally adored this movie, and even though I am a DC fan, there's just no denying that Marvel knows what they're doing and that is why they are much more successful right now.",
      "review_date": "2016-05-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "WHAT I LIKED: The final act of this movie is the real take-away, as the final battle alone is enough to warrant your money. It's emotionally heart-breaking and thankfully proves that Marvel aren't afraid to test the boundaries of theirWHAT I LIKED: The final act of this movie is the real take-away, as the final battle alone is enough to warrant your money. It's emotionally heart-breaking and thankfully proves that Marvel aren't afraid to test the boundaries of their characters and relationships. The gravitas of this though, is only possible thanks to an efficient set-up that the Russos craft really well, that's littered with great action, exciting sequences and touching moments that all really click together.\rWHAT I DIDN'T LIKE: That super-efficient set-up does strip some life from the movie though, as the Russos don't give long enough in each moment to create real engagement or emotion. This in turn makes it feel a little manufactured, and less human than other MCU stories.\rVERDICT: Whilst not quite engaging on such a human level, Civil War is expertly made, and contains the best final act in any MCU movie ever.",
      "review_date": "2016-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well I'm totally convinced I have outgrown Marvel movies.  The whole movie was a total yawner for my wife & myself.  I'm sure the younger crowd is pumping the rating up as they also do for animations & horrors.  Can't recommend for the matureWell I'm totally convinced I have outgrown Marvel movies.  The whole movie was a total yawner for my wife & myself.  I'm sure the younger crowd is pumping the rating up as they also do for animations & horrors.  Can't recommend for the mature audience but then I again I should have known this before going myself.",
      "review_date": "2016-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best movie of the year keep up the good work Marvel. Much more relation so imba. The characters written well. They got feelings and not just boom boom. Good job. Just please bring us more villains. Would be better.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War was great, but could have been legendary. The acting all around is fantastic, the action is top-notch (the airport fight is one of the best action scenes in the whole MCU), and the new characters and plot line areCaptain America: Civil War was great, but could have been legendary. The acting all around is fantastic, the action is top-notch (the airport fight is one of the best action scenes in the whole MCU), and the new characters and plot line are great too. My only problems are the ending and the fact that if you have not seen a marvel movie, you will likely be confused. Overall, however, this is a thinking man's superhero movie and I personally think Marvel has done it again.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very fun movie, tight action sequences, good pacing. Two separate plot lines which convene in the end with a twist. Not confusing or convoluted. Follows a good pattern of superhero movies, a great addition to Marvel's lineup.",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCaptain America: Civil War is Directed by Anthony and Joe Russo, and starring in the film is Chris Evans, Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Emily VanCamp, Tom Holland, Daniel Brühl, and Frank Grillo. Now, I know I wasted characters listing the cast, but it was worth it, because this movie was amazing, and very surprising. The film goes through multiple flashback for the first 30 minutes of the film, it shows where Bucky was before The Winter Soldier, Bucky was being kept under ice just like finding Captain in ice, but Bucky was in a Russian controlled facility. It was great to know that they did a bit more backstory on Bucky because it was still hard to figure out how Bucky became The Winter Soldier. The main story can be somewhat compared to the comics, it had some elements from the comics which were great. The cast of this film was unbelievable, for a film with this many comic book characters in one whole movie, the cast really brought those characters off the pages and onto the Big Screen into Marvel Cinematic Universe, and those characters that have been brought back and first time being on screen like Black Panther, and Crossbones, while Ant-Man, War Machine, Falcon, Vision, Scarlet Witch and Sharon Carter have been brought back after being in previous film in the MCU. The Biggest surprise for me was Tom Holland who played Spider-Man, he knocked it out of the park as Spider-Man, he was even better than Andrew Garfield which was an even bigger surprise because I thought what can be worse than Andrew Garfield? I thought Holland was going to be even worse than Garfield, but now I realize that I was so wrong, I mean Holland was hilarious, funniest Spider-Man ever. The whole cast really was awesome, I'm really glad that in the end they set up the Black Panther movie and they teased the new Spider-Man movie. Overall, Civil War was damn good, I cannot see how this movie could be executed any better than what I saw. I can't wait to see what happens in the next movie in Phase 3, Doctor Strange, 6 months from now.",
      "review_date": "2016-05-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Painfully boring with the exception of the airport scene. Spider-Man was pretty irritating, not sure if I could stomach a whole film with him. The villains plot is the dumbest thing I've ever heard. And please , just stop putting Black WidowPainfully boring with the exception of the airport scene. Spider-Man was pretty irritating, not sure if I could stomach a whole film with him. The villains plot is the dumbest thing I've ever heard. And please , just stop putting Black Widow and Hawkeye in these films",
      "review_date": "2016-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even more disappointing than Batman vs Superman. Nothing really happens plot wise, Civil War is honestly just an introduction for Black Panther and Spider-Man. Stark and Rogers don't come off as the main guys until the very end of the movie.Even more disappointing than Batman vs Superman. Nothing really happens plot wise, Civil War is honestly just an introduction for Black Panther and Spider-Man. Stark and Rogers don't come off as the main guys until the very end of the movie. Even then, The main villain Zemo was just more entertaining than either of those guys.\r Honestly, It's not worth watching. You are better off waiting for the home video release. It's sort of funny really because critics praise it when it suffers from similar flaws that BvS had, Which they bashed the heck out of.",
      "review_date": "2016-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A much better movie than Ultron but it suffers from the same problems, namely trying to fit too much stuff into a single movie. You got a Winter Soldier sequel, an Ultron sequel, a backdoor pilot for Spider-man and Black Panther, a politicalA much better movie than Ultron but it suffers from the same problems, namely trying to fit too much stuff into a single movie. You got a Winter Soldier sequel, an Ultron sequel, a backdoor pilot for Spider-man and Black Panther, a political and personal drama, and a setup for the next installments... How about just making one cohesive movie?\r My biggest pet peeve with those movies is that they're constantly taking huge leaps of logic which are presented as making perfect sense when they really don't. In this movie we're supposed to buy that Captain America and Iron-man would go to \"war\" over a disagreement that could have been easily worked out. There's also tonal issues where the movie jumps from ultra serious to slapstick comedy and it doesn't really go together. Take for example the airport scene which is great, but doesn't really match the tone of the rest of the movie and to be honest THAT is the movie I want to see rather than this tired, sluggish, forced drama. I just don't care about the problems of fictional country Sokovia, I just want to see a fun hero movie.",
      "review_date": "2016-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The heroes're divided and so the fans!\r Before watching this I thought what the Avengers are doing here. I believed they got the title wrong. Once I watched it, I'm still the same. Because it did not look like the Captain America's film, heThe heroes're divided and so the fans!\r Before watching this I thought what the Avengers are doing here. I believed they got the title wrong. Once I watched it, I'm still the same. Because it did not look like the Captain America's film, he never was dominated, so calling it as his film totally inappropriate. Technically, it is a third Avengers film and well done. I liked it, it was entertaining. But the Civil War means it's nothing a nation's war within, just these super-guys fight for themselves against what kind of administration they want to come under.\r I think they have heard that people's complaint about blowing up the buildings during reviewing other films by bringing up this one. So they finger pointed those events in this narration and that is one of the reasons for the Civil War to take place. Particularly disturbing the public and loss of many lives when these powerful men fighting the bad guys. The fun part is they are off the street and had a most important confrontation of the film in a deserted airfield. So does it make people who were whining about that be happy?\r I don't know, but as an entertaining film, it did everything it can give the best for the viewers. Like the title and posters reveal, the heroes are divided here and probably you're going to take a side. Like usual, I'm with the Stark. So if you're like me, then you would feel the annoyance with the opposite team, particularly like Antman and obviously Captain America's rebellious decision. It was like the world versus United States, because only Americans are behind Captain America. Anyway, I did not like dividing the fans and what this film has been a serious damage. I hope the fans won't take it seriously.\r 8/10",
      "review_date": "2016-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Marvel continues to straddle the fence between catering to two demographics children and adults. And herein lies the downfall of marvel movies. Whilst the 3d and special effects are amazing and can at times, keep you riveted to the screen,Marvel continues to straddle the fence between catering to two demographics children and adults. And herein lies the downfall of marvel movies. Whilst the 3d and special effects are amazing and can at times, keep you riveted to the screen, that is all the movie is. The storyline could have been laid out better. I enjoyed watching the movie in 3d but as more of a novelty than a great piece of cinema.",
      "review_date": "2016-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Tiresome.  The same tropes from any other Marvel movie remixed.  The flick has an inert feel and a certain arbitrary feel.  You can turn it on, leave for a few minutes, come back, and its still the same impetus of \"look how I suffer for allTiresome.  The same tropes from any other Marvel movie remixed.  The flick has an inert feel and a certain arbitrary feel.  You can turn it on, leave for a few minutes, come back, and its still the same impetus of \"look how I suffer for all of you\" schtick.  The action scenes are so predictable its like watching someone brush their teeth.  For fanboys only, of course.",
      "review_date": "2016-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Giving a 4 just for the airport fight and Tony Stark meeting a certain character shortly beforehand. Those were the only two enjoyable scenes in the whole movie.\r The rest was painfully dull, the villain was boring and his plan made noGiving a 4 just for the airport fight and Tony Stark meeting a certain character shortly beforehand. Those were the only two enjoyable scenes in the whole movie.\r The rest was painfully dull, the villain was boring and his plan made no sense. Tony Stark and Steve Rogers seemed completely out of character. It really feels like ~2 hours of the movie were just quickly hobbled together in order to set up the airport fight.",
      "review_date": "2016-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great action and good introduction of the new Avengers to the movie series - Spider-man and Black Panther.  Ant-man, although he already had his own movie, was also a nice addition.  The movie is kid friendly and fight scenesGreat action and good introduction of the new Avengers to the movie series - Spider-man and Black Panther.  Ant-man, although he already had his own movie, was also a nice addition.  The movie is kid friendly and fight scenes well-choreographed.  And the story line held for what the movie was trying to do - government trying to keep the Avengers under government control with the Avengers split on the idea which leads to the 'Civil War'.   Not sure what's up with the Super Hero against Super Hero trend (Batman vs Superman).   However, Civil War was much more intense as far as the level of rivalry between the two Super Hero groups and they really didn't come together at the end as they did in Batman vs Superman.  So I was not a big fan of the script - and I think both my boys (9 and 10) felt the same way.  We much prefer Super Hero versus villain over fighting amongst each other.  And for that reason, rather than the 8 this movie probably deserves - because it was well done.  I'm giving it a 6 since I did not like the story line and especially how the movie ended.",
      "review_date": "2016-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I found the film quite dull in most parts especially the action scenes midway through. The story never really go me interested until the end. The end of the film saves it from being a total disappointment.",
      "review_date": "2016-09-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While there were a lot of good action scenes and funny parts the drama got heavier than I would have liked.  I took issue with the whole premise, because even though I understood it, they were mad that they saved the world at the cost of aWhile there were a lot of good action scenes and funny parts the drama got heavier than I would have liked.  I took issue with the whole premise, because even though I understood it, they were mad that they saved the world at the cost of a thousand lives etc.  Without spoilers it turned our beloved characters against themselves and made a lot of the movie miserable as they bickered and fought.  It wasn't a bad movie, but it was my least favorite of the series.",
      "review_date": "2016-06-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Captain America: Civil War is a few notches above the average Marvel movie thanks to an exciting premise and good effects. The movie is overlong, and by now all these Marvel spinoffs and sequels are starting to lose their edge-- it seems likeCaptain America: Civil War is a few notches above the average Marvel movie thanks to an exciting premise and good effects. The movie is overlong, and by now all these Marvel spinoffs and sequels are starting to lose their edge-- it seems like now its only about the money.",
      "review_date": "2016-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Once again, I'll keep it short with this one, since I can't say much that hasn't been said: \"Captain America: Civil War\" is an amazing superhero film that is excellently-written, wonderfully-acted (especially by Tom Holland), action-packedOnce again, I'll keep it short with this one, since I can't say much that hasn't been said: \"Captain America: Civil War\" is an amazing superhero film that is excellently-written, wonderfully-acted (especially by Tom Holland), action-packed and visually strong, while featuring some great character development. Even in an industry dominated by superhero films, \"Captain America: Civil War\" stands tall among the many superhero movies in theaters nowadays and it's definitely worth watching.",
      "review_date": "2017-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I've got to admit this is a good movie, I still did not enjoy it as much as others though. It definitely has plenty of action and a good plot. However I did not lik it that there wasn't a strong final fight with the main villain of theWhile I've got to admit this is a good movie, I still did not enjoy it as much as others though. It definitely has plenty of action and a good plot. However I did not lik it that there wasn't a strong final fight with the main villain of the movie. Still an enjoyable movie though.",
      "review_date": "2017-11-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall a pretty good movie but for me the marvel universe is just a little too big, there are so many characters in this movie and so many sub plots it just becomes a little too much, winter soldier was better in my opinion and i continue toOverall a pretty good movie but for me the marvel universe is just a little too big, there are so many characters in this movie and so many sub plots it just becomes a little too much, winter soldier was better in my opinion and i continue to prefer stand alone smaller movies to these big team up/vs movies, still well worth checking out though, airport fight is great, ant man and spiderman steal the show",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am really just burnt out with marvel super heros. The movie plot was really ridiculous how the governments wanted to put the avengers under the control of the UN because there was a few thousand casualities after they just saved 7 billionI am really just burnt out with marvel super heros. The movie plot was really ridiculous how the governments wanted to put the avengers under the control of the UN because there was a few thousand casualities after they just saved 7 billion people! Another thing I was just bored to be honest and kept checking my watch feeling like this movie would never end. Part of the reason why millions of people like game of thrones is because ANYONE CAN DIE and that makes the story exciting. This avengers crap is just boring because we all know nothing is going to happen when they fight.",
      "review_date": "2016-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most perfect superhero movie made to date. It not only balanced its huge cast but gave every character a satisfying arc, with the main characters hitting some surprisingly moving, honest-feeling emotional highs that I would not haveThe most perfect superhero movie made to date. It not only balanced its huge cast but gave every character a satisfying arc, with the main characters hitting some surprisingly moving, honest-feeling emotional highs that I would not have expected in a superhero film. It also introduced the MCU's first African leading man superhero, Black Panther, in an absolutely glorious way--can't wait for his standalone film as a result of this fantastic intro the Russo Brothers' gave him in this film, and Chadwick Boseman's arresting performance.",
      "review_date": "2017-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "feels way too familiar.  Enter a marvel movie, expect a marvel movie.  Dont get me wrong, this movie is good, its just that the heroes still feel not as big (superheroes need to feel huge and powerful), the action was really good, but exceptfeels way too familiar.  Enter a marvel movie, expect a marvel movie.  Dont get me wrong, this movie is good, its just that the heroes still feel not as big (superheroes need to feel huge and powerful), the action was really good, but except for one scene, it was non threatening, cap and iron man both got the snot kicked out of them but without taking much damage, or rather, they looked like rag dolls taking hits.  The villain was again not that threatening.  A lot of cheesy one liners and in some instances a bit of bad dialogue.\r Keeping all of that aside though, the movie was really good (I dont like the idea of a young spiderman, but it worked, and we didnt have to wait for the end credits to get a glimpse of him)\rThe story was well thought out, as with all cap america movies, the story is really good, some characters needed more depth (iron man especially, his reasoning was not explored much but atleast you understood why each person was doing what).  This movie like all marvel movies is targeted towards a very very broad audience and manages to entertain the vast majority.",
      "review_date": "2016-05-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Russo brothers did a fine job directing this movie, the problems I had with it is that half the superheros (antman, spiderman are the main examples) felt filler more than anything during the movie and it really wouldn't have made aThe Russo brothers did a fine job directing this movie, the problems I had with it is that half the superheros (antman, spiderman are the main examples) felt filler more than anything during the movie and it really wouldn't have made a difference taking a few heroes out. But in terms the movie and plot. This movie had one of the best plots in the MCU... it's funny coming from a superhero movie. But I felt that the MCU's civil war was more about relationships with the heroes rather than the problems with the sokovia accords.\r Which is why I thought Antman and Spiderman are filler, although they were the spotlight towards both sides of the heroes. The only real reason they were there is to show off Spiderman, Giant Man and crack a few jokes from Tom Holland and Paul Rudd. There was NO reason to be there... I personally like them in the movie, but they served no purpose... end of story.\r I did like the relationships built towards superheros, examples are Vision/Wanda, Capt/Iron Man, and Capt/Bucky. For a 2 hour and a half movie, they did a good job focusing on each character... I just wish they did the same for Antman and Spiderman. And considering this was a Capt. America movie, The relationship between Capt/Bucky and Capt/Iron Man is going be much strong no doubt.\r I really like this movie, but because it was 2 1/2 hours long... there are stuff going to be lacking but I found myself entertained this so far has to be the best movie they've ever made in the MCU, and I cannot wait for how the Russo Brothers will execute Avengers: Infinity War",
      "review_date": "2016-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Um dos melhores filmes que vi em 2016. O enredo é brutal. Deixa-nos sem saber que lado escolher, a história esta muito bem montada e os personagens são top, até deu para introduzir novos e a apresentação deles ficar top. Um filme cheio deUm dos melhores filmes que vi em 2016. O enredo é brutal. Deixa-nos sem saber que lado escolher, a história esta muito bem montada e os personagens são top, até deu para introduzir novos e a apresentação deles ficar top. Um filme cheio de primor e ação do melhor com um final top.",
      "review_date": "2016-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "NOT BAD but NOT GREAT and maybe GOOD. If you like non stop special effect action then you will probably love this movie. My main 2 points of dislike for this movie are 1) It was mostly non-stop fight scenes and scene leading to the next fightNOT BAD but NOT GREAT and maybe GOOD. If you like non stop special effect action then you will probably love this movie. My main 2 points of dislike for this movie are 1) It was mostly non-stop fight scenes and scene leading to the next fight scene & 2) They over do the Bucky brainwash thing and the Bucky and Capt. A fight scene, especially since that was the bulk of the last movie (which I loved).\r So take it for what you will. The acting was great but the flow of the story not so much. A little repetitive for Marvel standards but I was entertained enough to not be pissed I spent the $11 at the cinema.",
      "review_date": "2016-06-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is a very mediocre movie. Definitely has good parts to it (Paul Rudd kills it btw) but I could have waited to catch this redbox. I felt like there weren't really any stakes or really a \"Civil War\" at all, until the last fight. Every time someone threw a punch, they stopped for a second to ask if they're still going to be BFFs later on.Then they resume punching. It really ruins any tension and I'm surprised they didn't learn after making Ultron comic relief in the midst of fighting.\r Worst of all, the movie didn't add anything of substance. In fact, everything is back to normal at the end of the movie, but now there are more friends in the Avengers. I feel like they could have given this movie more of a reason to exist than to be *just* a setup for Black panther and Spiderman. In fact, it doesn't even follow the comic book so Captain America stays alive at the end which would have been a dope thing to see on film. As a fan of the first Avengers and Winter Soldier, this movie definitely could have been better.",
      "review_date": "2016-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Captain America: Civil War\", A.K.A. Avengers 3, is a spectacular blockbuster. That being said, it lacks any form of personality or character development. Spider-Man is laughably unnecessary, but Black Panther RULES. Can't wait for that\"Captain America: Civil War\", A.K.A. Avengers 3, is a spectacular blockbuster. That being said, it lacks any form of personality or character development. Spider-Man is laughably unnecessary, but Black Panther RULES. Can't wait for that movie! Go see this, it's tons of fun and great on the big screen.",
      "review_date": "2016-05-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is the better movie about superheroes. The old people who said that this movie is for kids and fans... the truth is different. All characters have their very well distributed value. A big part of the movie is unpredictable. WithThis movie is the better movie about superheroes. The old people who said that this movie is for kids and fans... the truth is different. All characters have their very well distributed value. A big part of the movie is unpredictable. With pure action sequences. This movie is being underrated by the people who didn't understand the main purpose and why the things are how it are... Just an amazing action movie for smart people.",
      "review_date": "2016-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Muy buena película, de las mejores en el universo cinematográfico de Marvel, con unos cambios en relación al cómic pero eso no la hace mala, sino más interesante",
      "review_date": "2016-05-21",
      "source": "metacritic"
    }
  ],
  "num_reviews": 153
}