{
  "title": "Deadpool",
  "rating": 8.0,
  "release_date": "2016-02-12",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller",
    "Fantasy",
    "Comedy",
    "Romance"
  ],
  "summary": "Based upon the Marvel Comics anti-hero, Deadpool is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with new abilities and a dark and twisted sense of humor, Deadpool huntsBased upon the Marvel Comics anti-hero, Deadpool is the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with new abilities and a dark and twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life. [20th Century Fox]… Expand",
  "critic_reviews": [
    "It’s impossible to envision a sequel with pleasure – this kind of lightning wouldn’t strike twice – but the first one could hardly be improved.",
    "Compared to Deadpool, \"Guardians of the Galaxy\" is a bastion of sobriety and good taste.",
    "Smart, sexy and outrageous, Deadpool delivers.",
    "It’s a voraciously self-aware comedy, one that dines out on the inherent inanity of its own premise as much as it does the movies it’s competing with.",
    "Deadpool is one of those movies that’s all the more successful for how easily it could have gone so very wrong. It’s suffused with an arch, self-aware wit...yet it takes its romance and revenge storylines just seriously enough to keep us engaged.",
    "It is almost preposterous how little \"plot\" there is in the film...What it has in spades is attitude, and right up until the moment the film began, I was afraid It was going to be so juvenile and filthy that I would end up annoyed by it. Instead, from the very beginning of the opening credits, it is clear that director Tim Miller and screenwriters Rhett Reese and Paul Wernick have crafted something deeply silly that isn't remotely interested in playing by the conventional rules of what we've come to think of as \"the superhero genre.\"",
    "It takes a strong stomach for extreme violence and over-the-top obscenity, but if you're willing to roll with that, Deadpool is a hoot.",
    "What sets Deadpool apart is its overall genre-busting tone, which blends a wealth of meta humor, the wisecracking Reynolds' significant skills with a one-liner, and a genuinely funny script that isn't afraid to offend anyone.",
    "Deadpool is neurotic and needy – and very entertaining. An innocent pleasure.",
    "Loud, lewd, inventive and outrageous, Deadpool is a delight. All credit to Reynolds and co. for having the steel balls to go this far.",
    "It takes a little while to get in gear — or perhaps just to adjust to what's going on here — but once it does, Deadpool drops trou to reveal itself as a really raunchy, very dirty and pretty funny goof on the entire superhero ethos, as well as the first Marvel film to irreverently trash the brand.",
    "As a vehicle for the impudent comic stylings of Ryan Reynolds, this cheerfully demented origin story is many, many cuts above “Green Lantern,” and as a sly demolition job on the superhero movie, it sure as hell beats “Kick-Ass.”",
    "Loaded with sass, sex, and sadistic violence, Deadpool is not your youngster’s comic-book origin story. Deadpool earns every bit of its R rating, a quality that’s sure to appeal to fans weary of the macho, apple-pie-eating, altruistic superheroes who buck for attention in the comic-book stables.",
    "It's also violent to point of sadism, explicit both visually and in terms of language. A potty-mouthed splatterfest, in fact — but a funny one.",
    "This movie's junky feel is part of its charm. Sure it goes on too long and repetition dulls its initial cleverness. Still, Deadpool is party time for action junkies and Reynolds may just have found the role that makes his career.",
    "First-time feature director Tim Miller has created a work that’s both aggressive and not aggressive enough.",
    "Deadpool is, on the whole, a big bowl of fun filled with great stunts, gory fight scenes, and sexy poses.",
    "They even make the requisite cameo by Marvel founding father Stan Lee feel profanely inspired. Not your usual Marvel superhero scene? In this case, that’s a good thing.",
    "Maximally cheeky. Perversely potty-mouthed. Riotously funny. Insanely violent. Uneven as all get out. And fun, fun, fun.",
    "Deadpool's flawed insolence is appealing, like a mangy pup crawling into your lap.",
    "There are more funny lines and opening credit sight gags in this than most comedies have in their full running time.",
    "It doesn’t have the most adrenalized action sequences or the deepest origin story. What it has is the balls to mess with the formula and have some naughty, hard-R fun. It’s a superhero film for the wiseasses shooting spitballs in the back of the school bus.",
    "This humor could be profoundly ugly, given how it's aimed at reducing other people's grotesque deaths to punchlines. But first-time director Tim Miller keeps the tone light — in his hands, Deadpool is more a snickering, naughty nut than an authentic sociopath.",
    "Deadpool is a send-up of Marvel movies but in no way a takedown of them. It’s not subversive — it’s meant to elasticize and enhance the superhero genre, to flatter the audience for being hip enough to get all of those in-jokes.",
    "It’s no surprise that the teams hired to bring a property like Deadpool to the screen know how to keep the machine oiled and humming; it’s the ones who somehow manage to temporarily stick a wrench in the works, adding something human — a feeling instead of another quip — who are worth your attention.",
    "Deadpool might even stand as one of the strongest and most inventive films of the high-early-late superhero baroque — if we could just turn off its built-in commentary track.",
    "More often than not, Deadpool’s bratty energy feels liberating, allowing for a sexier, dirtier, more hilarious superhero movie than the typical all-ages Marvel affair, which is so concerned with maximising profits that it risks offending no one.",
    "The eccentric touches—a Wham! musical cue, a dash of screwball body horror—are just accents on a stealth franchise extension. At a certain point, you have to do more than just recognize and point out the mold. You have to actually shatter it.",
    "As is often the case with such violence, it eventually becomes numbing. By its midpoint, once the novelty of a superhero movie showing super levels of violence wears off, the thinness and lack of spark in the fight scenes becomes more readily apparent. By the film's end, they are hard to distinguish from any other superhero fare. Similarly, lack of imagination keep the film's prodigious swearing and occasional nudity from feeling like anything original.",
    "For grown-ups, however, Deadpool avoids enough pitfalls to both embrace and flambé the superhero genre while also finding time for romance, doling out equal handfuls of bullets, barbs and warm fuzzies.",
    "The movie's far from dull. But first-time feature director Tim Miller's film serves as critique as well an example of what ails the superhero movie industry.",
    "If only Deadpool were as clever, dark and funny as it believes itself to be.",
    "The whiplash contrasts between snideness and sincerity is deeply rooted in the main character's psychology.",
    "The ambition is laudable, but Tim Miller’s movie, far from seeming reckless and loose-limbed, comes across as pathologically calculated, measuring out its nastiness to the last drop.",
    "You're initially jazzed by his effrontery, but Deadpool, with his relentlessly glib, nothing-sacred attitude, is not an individual who wears particularly well.",
    "It's buckshot humor that is funny when it lands; cringe-worthy when it doesn't.",
    "For a film that vocally questions convention, it's perhaps a shame that Miller and co. played it so safe with a fairly cookie-cutter origin story, but it's really just there to give Reynolds ammunition to riff on. Whether the studio might be willing to push the character further into the leftfield in the future will depend on whether Deadpool warrants sequels.",
    "The sheer number of dick jokes will soon numb you to their impact, but this is a fun, if patchy, alternative to the glut of ‘the world is about to end unless we do something’ comic-book films.",
    "The fourth-wall-smashing is fun in a Ferris Bueller kind of way, but it’s never pulled off with the devious panache of Blazing Saddles, let alone Funny Games or Hellzapoppin’. Since it's this stuff, rather than the ongoing thud-thud-thud of bad language and gore, that feels mould-breaking, it’s a pity Rhett Reese and Paul Wernick’s screenplay doesn’t have the courage to experiment a little more.",
    "It seems less irreverent than self-congratulatory.",
    "Deadpool, intended as a spiky antidote to superhero oversaturation, ends up impaling only itself.",
    "It’s hard to imagine a movie much more aware of itself both as a movie and as a moment in a cultural progression of similar movies than Deadpool.",
    "It’s a remarkably straightforward origin flick, lacking in true satire of its genre, carried almost entirely by its lead. Deadpool is a fun character, but he’s still in search of a fun movie to match his larger-than-life personality.",
    "It’s a film that desperately wants to upend the tropes of the comic book movie, but perhaps more shocking than anything that comes out of the mouth of its often obnoxious titular hero, is how blandly the picture sticks to the origin story playbook.",
    "Bloody, shallow and oh-so-smug, Deadpool is so eager to offend that it’d almost be sweet if it wasn’t so, well, relentlessly annoying.",
    "While Deadpool’s core audience will appreciate the way it flatters their knowledge of genre conventions with winking, cynical humor, too much of this stuff just plays like smug self-satisfaction. The movie is so impressed with itself that the viewer’s satisfaction seems completely irrelevant.",
    "This one is a “different kind of superhero movie,” meaning even more fiercely attached to the mode of artistic expression known as “puberty.”",
    "This is bad, borderline garbage, but disturbing, too, in that it’s just the kind of fake-clever awfulness that might be cinema’s future.",
    "For an 11-year-old sneaking into the theater for his first R-rated movie, Deadpool could prove to be a revelatory trip. For myself, it was an exhausting, grating experience, lacking in wit and cleverness as it crumbles underneath its wall-to-wall torrent of jokes. If this represents a new stage for comic-book adaptations, the future is even more dismal than one could have imagined."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I have never been a fan of the comedy genre, but Deadpool really helped me understand why a few laughs from time to time can really allow you to escape from your every day life. Just go watch this movie for the spectacular opening credits.I have never been a fan of the comedy genre, but Deadpool really helped me understand why a few laughs from time to time can really allow you to escape from your every day life. Just go watch this movie for the spectacular opening credits.\r Not only is Deapool a wonderfully acted superhero movie with a demented heart but also a sort of game changer that this genre needed for quite a while. With its extremely simple story, Deadpool is what most superhero movies should strive for. Instead of slapping us with end-of-the-world events, these movies need to focus on presenting us with a cohesive story that can work well on its own.\r And yes, Ryan Reynolds kills it.",
      "review_date": "2016-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you love Superhero movies or Deadpool then you will love this movie and it will make you laugh every second and amazing cgi for a low budget!!!!!!!",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What do you expect from Deadpool? He's been around the internet for a very long time, and he's well known for his 4th wall breaking and childish humour. So what do you expect from a Deadpool film? Exactly that. The film is childish, full ifWhat do you expect from Deadpool? He's been around the internet for a very long time, and he's well known for his 4th wall breaking and childish humour. So what do you expect from a Deadpool film? Exactly that. The film is childish, full if violence and gory with fart and piss humour, and a dozen 4th wall breakage. Exactly what a Deadpool film should be. If you expect a \"Avenger\" type of super hero film, you're watching the wrong film, and you've probably lived behind a rock for some time if you don't know what Deadpool is about. This film delivers where it's expected. It's not Interstellar, A clockwork Orange or any other type of \"awesome\" films. It's Deadpool, and it delivers exactly what you expect of Deadpool; childish humour with gore and fart jokes, including breaking the 4th wall more times than you care to count.",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is a breath of fresh air in an overcrowded genre. The humor, writing, acting, and directing are all superb. As for how wonderfully obscene and over-the-top Deadpool is as a character, he still has a lot of heart, and audiences willDeadpool is a breath of fresh air in an overcrowded genre. The humor, writing, acting, and directing are all superb. As for how wonderfully obscene and over-the-top Deadpool is as a character, he still has a lot of heart, and audiences will have no problem connecting with him.",
      "review_date": "2017-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sure it's dumb, it's loud, it's crass but it's also very fun.\r Ignore the fuddydunnies who complain it's not aaaaaaaaaaaaaaaaaaaaaaaart darling just because the producers wouldn't give the critics the prerequisite rimjobs to get goodSure it's dumb, it's loud, it's crass but it's also very fun.\r Ignore the fuddydunnies who complain it's not aaaaaaaaaaaaaaaaaaaaaaaart darling just because the producers wouldn't give the critics the prerequisite rimjobs to get good reviews, I would say now it's on DVD, rent it, and watch the opening credits, if you don't laugh then move on, but on the other hand if you have sense of humour you will sit down for a funny, action packed dumb movie. (although that said it's dumb as in understanding movie, the actual plot is far more cohesive and logical then star trek beyond of suicide squad.)",
      "review_date": "2016-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For me Deadpool was the best movie of 2016. They nailed it . Movie is really entertaining while having good humour. Saw it twice can't wait for DP2. How can you hate on this movie ? Really how ?",
      "review_date": "2016-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film did work and it had a few nice laughs. The Deadpool character is the kind of an annoying, but likeable A-hole with a heart. Small sell contained story that was kind of underwhelming. Yeah it was fun to ok and I was entertained fromThe film did work and it had a few nice laughs. The Deadpool character is the kind of an annoying, but likeable A-hole with a heart. Small sell contained story that was kind of underwhelming. Yeah it was fun to ok and I was entertained from start to finish. I just think Blade is my go to guy for \"M\" rated superheroes that is all. While Deadpool seems kind of tame for over the top comedy violence compared to something like the really outrageously The Brothers Grimbsy.",
      "review_date": "2018-12-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not the best Marvel movie and not the best comedy either but it was kinda cute I guess so I'd feel guilty to give it anything less than a 7.",
      "review_date": "2019-09-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Incredible Hulk isn't very Incredible.Edward Norton gives a good performance but the concept of Hulk itself just seems tired. There is no new outlook on the hero just simply a repeatedly mediocre take on a very one dimensiona",
      "review_date": "2020-12-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Прикольный фильм отличный экшен есть шутки над которыми можно посмеяться!",
      "review_date": "2021-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool has a very good story, good antagonist, was very well acted by the cast, and the fight scenes are very enjoyable. It being Rated R was the best decision that they could have made. Hopefully movies like Deadpool, Logan, and Joker showDeadpool has a very good story, good antagonist, was very well acted by the cast, and the fight scenes are very enjoyable. It being Rated R was the best decision that they could have made. Hopefully movies like Deadpool, Logan, and Joker show these studios that taking that risk can pay off. Great Movie ",
      "review_date": "2020-11-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "✅84%The peak of the X-Men franchise besides Days of future past. This movie is both funny and sad. A very entertaining film.",
      "review_date": "2021-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fun,exciting and just enjoyable,Deadpool is a good superhero movie that introduces the best of the titled character and the 4th wall break which brought a freshness to the genre.The film suffered from a dull setting and uninteresting plot andFun,exciting and just enjoyable,Deadpool is a good superhero movie that introduces the best of the titled character and the 4th wall break which brought a freshness to the genre.The film suffered from a dull setting and uninteresting plot and a villain who was somewhat cliched and has no physical threat to him but those sufferings was covered due to the sheer amount of entertaining gags,action which was a well executed and because of Deadpool and his trusty friends.The movie could have been better It is really due to Fox's fear of a flop and how greedy the studio that gave them a low-budget and yet the dull and more expensive  X-Men Apocalypse was just a bore.",
      "review_date": "2016-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very entertaining film. I'm not a comic book person by any means, but the character is very funny and likable. The fourth-wall breaking was hilarious.\r There isn't much of a plot, but we don't really need one - just enough of a setting forVery entertaining film. I'm not a comic book person by any means, but the character is very funny and likable. The fourth-wall breaking was hilarious.\r There isn't much of a plot, but we don't really need one - just enough of a setting for the jokes, stylish action scenes,  and to tell us why Deadpool is who he is, and why he's awesome. The addition of the two X-men characters was a great way to show off his unique character, and also tie in with the overall X-men franchise.",
      "review_date": "2016-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool shakes up the comic book genre by bringing it's brand of R-rated bloody violence and humor. In a world of PG-13 comic book movies (which I like) it feels like a nice change up. The self-referential humor is really great as isDeadpool shakes up the comic book genre by bringing it's brand of R-rated bloody violence and humor. In a world of PG-13 comic book movies (which I like) it feels like a nice change up. The self-referential humor is really great as is Deadpool's dialogue, the violence is also very entertaining to watch. It slows down a little little bit in the middle but in the end it doesn't detract to much from the film's kick-assery (yes, that's a term now).",
      "review_date": "2016-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Let's go give it to ya....yesss Deadpool rocks.This is one of the Coolest movies I have ever seen.From the action, music tracks to the dialogues everything was awesome.",
      "review_date": "2016-06-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool: \"From the studio that inexplicably sewed his **** mouth shut the first time, comes... me!\".\r One of the greatest anti-hero - the Merc with a mouth - Wade Wilson was once a special forces operative but turned mercenary. After beingDeadpool: \"From the studio that inexplicably sewed his **** mouth shut the first time, comes... me!\".\r One of the greatest anti-hero - the Merc with a mouth - Wade Wilson was once a special forces operative but turned mercenary. After being subjected to a rogue experiment, he finds himself with accelerated healing and transforms himself into Deadpool. Armed with weapons (and a wicked sense of humor) he will stop at nothing to track down the men responsible.\r Never have I seen so many fans (or moviegoers), dying to see a character like Deadpool on the big screen; it's a bit like how everyone wanted to see The Avengers on the big screen back in late 2011. It's bad enough that the studios can't seem to get the character right with the disaster that was X-Men Origins: Wolverine. But the respect and love that fans have for this character stayed strong until everyone's prays was finally answered by this movie. And it did not disappoint, because Deadpool lives up to hype by being entertaining and hilarious. While I don't think it's an A+ like Chris Stuckmann rated it or a masterpiece of all comic book movies, but did I have fun watching this movie? ABSOLUTELY. It's a film that fans wanted and got.\r I can't imagine anyone else in Hollywood playing Deadpool but only Ryan Reynolds. He was born to play this character and he's the only actor that I think of to do the character justice. Reynolds as expected did that, and that's make the character of Deadpool he's own. He was terrific has the mouth talking, ant-hero bad-ass. This is Ryan Reynolds come back role after his past disasters roles that mostly involves Green Lantern and Origins Wolverine (that this movie brilliantly makes fun off).  Reynolds was just perfect for this character and he did a great performance in this film. He delivered the comedic timing and the somewhat of a hidden charm that Deadpool has. Ryan Reynolds absolutely nailed it.\r The writing in this movie was surprisingly good, which I didn't expect for a movie with this kind of character. Of course there are Easter eggs, references and nods to the comics and Marvel movies, but in this movie it's done in such a way that feels kind of refreshing. I know for a fact that I missed a lot of the jokes and references due to amount of laughter that I had while watching the movie. I can say it with a brave face that the writing is this movies biggest strength, because it's self awareness on Marvel movies and itself was all top notch.\r I'm so happy that this movie is rated R and not some water down PG-13 movie, because if you honestly think a Deadpool movie should be rated PG-13, then you really don't know the character at all. I'm taking to you Grace Randolph. Just because some little eight year old boy (who probably doesn't know who Deadpool really is), whats to see the movie, but can't because he's not old enough to see it, doesn't mean it should be changed to a PG-13 for someone who doesn't even know the character of Deadpool. These fans have waited 7 or 8 years for this character to be done right, so this little boys mother should teach him some patience.\r Now for the flaws: How much better would this movie be if it had visual comedy. I mean Edge Wright should seriously do a Marvel movie, because I know for a fact that he will make the best Marvel movie ever when it comes to it's comedy, pasting and execution (something that Age of Ultron couldn't do). I highly recommend seeing Every Frame and Printing video on \"How to do Visual comedy\", because Tony Zhou knows some much about movies better then I do. But that's what I felt was missing in this movie and I know this is Tim Millers first big film (And an impressive one as well), but I'm just saying that it would be really brilliant if there was visual comedy in a movie with Deadpool.\r While I did think the writing was great, but some of the jokes in the movie I didn't find that funny. And no, it's not because I didn't get it or I didn't understand the reference, because all of the jokes and reference in this movie I understood clearly, it's just that I didn't find some of it funny.\r Overall Deadpool is a fresh, entertaining comic book movie that it's hard for any comic book lover not to like this movie. You bet I'll be seeing the squeal when it comes out since I know it's in good hands.",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is laugh out loud hilarious, super gory, and, best of all, super fun. Ryan Reynolds kills it as \"The Merc with a Mouth\" and the ensemble cast is solid too, especially the X-Men: Colossus and Negasonic Teenage Warhead. This is easilyDeadpool is laugh out loud hilarious, super gory, and, best of all, super fun. Ryan Reynolds kills it as \"The Merc with a Mouth\" and the ensemble cast is solid too, especially the X-Men: Colossus and Negasonic Teenage Warhead. This is easily the funniest superhero movie ever, as Deadpool throws one liner after one liner and they all hit pretty damn well. The action is super fun too, finally giving the genre some blood to go with the action. My only con preventing it from being a 10 is Ajax, who falls a bit short as a villain. Overall, Deadpool did not disappoint and I strongly recommend any fan of superhero movies or R-rated comedies see this gem.",
      "review_date": "2016-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is going to be one of the funniest movies of the year. The film is not only action-packed and so entertaining, the film is super funny. This is not a movie you want to miss.",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'll start off by saying I'm not really a fan of most superhero movies other then batman and the first couple of Spiderman movies (before they got really bad). I thoroughly enjoyed this movie! Good special effects and a lot of humour madeI'll start off by saying I'm not really a fan of most superhero movies other then batman and the first couple of Spiderman movies (before they got really bad). I thoroughly enjoyed this movie! Good special effects and a lot of humour made this one of my favourite superhero movies to date.",
      "review_date": "2016-05-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If anyone remembers the last time Deadpool made a film appearance it didn't go over to well, Most people hated how they ruined the character. Luckily they learned there lesson and have made up for there mistakes. The movie has all theIf anyone remembers the last time Deadpool made a film appearance it didn't go over to well, Most people hated how they ruined the character. Luckily they learned there lesson and have made up for there mistakes. The movie has all the elements that a Deadpool movie needs: Great Humor,Gorey Action and that little pinch of Boobs. Action scenes come together in a perfectly orchestrated bloody slaughter, No other way to really put it. Things will happen that leave you speechless. The humor is also so perfect they know what was done wrong in the past and they fixed there wrong, Poking fun at things like a CGI suit, Sewing his mouth shut and a few others.It's also nice to see Marvel let them go with a R rating. Well watching Deadpool I never really felt much a dull moment or lost interest, It keeps you entertained from start to finish and leaves you wanting more.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After the dull and unfaithful version of Deadpool in X-Men origins and Ryan reynolds other comic book filmsGreen Lantern,Blade Trinity and R.I.P.D. I wasn't really that excited of the upcoming Deadpool film even with their smartAfter the dull and unfaithful version of Deadpool in X-Men origins and Ryan reynolds other comic book filmsGreen Lantern,Blade Trinity and R.I.P.D. I wasn't really that excited of the upcoming Deadpool film even with their smart advertisements and marketing.And also the studio that ruined the character is funding it.But again I was wrong the film is great.\r The movie is fun and enjoyable.With it's R rating this movie doesn't shy away with sex and blood.The movie cuts it's budget fearing of a flop but instead it was a success.The main douchebag Deadpool is well portrayed and true to it's comic counter part with 4th wall breaking and always cracking jokes.The other one were also great they  were funny and has some comic relief.The villain is okay but not that great.the plot is much more pf a revenge plot was cliche but because of deadpool's awareness and his offensive jokes are just plain funny .Because Ryan Reynolds wants to do the character justice,it really works.the film is a fresh breathe of air of the superhero genre cause superheroes this days are the same but Deadpool gave us some laughs and new things to the table .The film covers it's flaws and shows its potential.",
      "review_date": "2016-05-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just from the trailers, you can tell that this movie is not for everyone, and definitely not for kids, despite the fact that parents were bringing their kids in to see it during my showing of it.\r Starting from the moment that the openingJust from the trailers, you can tell that this movie is not for everyone, and definitely not for kids, despite the fact that parents were bringing their kids in to see it during my showing of it.\r Starting from the moment that the opening credits begin, I could tell that this was the Deadpool movie that I have been waiting to see for years. Ryan Reynolds has completely redeemed how the character was completely mishandled in the Wolverine movie. This movie earned his hard R, with over-the-top violence, sex, nudity, swearing all over the place, and a complete shattering of the fourth wall. The humor may be a bit sophomoric at times and some of the younger audience might not get all the pop culture references, but that's Deadpool for ya. And I loved every moment of it.",
      "review_date": "2016-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is a good film for the character,it was well portrayed by Ryan Reynolds so thus the supporting who did great too.The movie is funny and the 4th wall break is just good,it's well paced,it takes time to breathe and the villain was okayDeadpool is a good film for the character,it was well portrayed by Ryan Reynolds so thus the supporting who did great too.The movie is funny and the 4th wall break is just good,it's well paced,it takes time to breathe and the villain was okay but the only problem is that the scenes from Wade Wilson was a bit off or uninspired it looks dull but The deadpool scene were amazing and the other problem is the plot,it's just another generic ,by-the-numbers revenge plot.Deadpool is a good film because it didn't setup any future sequels,the story is simple but it fits the movie well,the characters are great and Deadpool is just cool.It has problems but it was covered up of how Awesome Deapool isI said 2 times in a row.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fun and faithful to the source material, Deadpool is a politically incorrect hero and inaugurates a new era of comic-based films in a necessary moment of innovation.",
      "review_date": "2016-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As with any movie, it comes down to acting, writing, sound, special effects etc.\r Acting. Loved it. The characters were perfect for the roles they were designed to be. The acting was spot on for the nature of the movie, the jokes were doneAs with any movie, it comes down to acting, writing, sound, special effects etc.\r Acting. Loved it. The characters were perfect for the roles they were designed to be. The acting was spot on for the nature of the movie, the jokes were done in the spirit of the character and the storyarc.\r Special Effects They were good. The budget wasn't the highest, but they made a good go of it.\r Sound Also great.\r Humour. Loved it. The jokes were well done for the character and what Deadpool is supposed to be. Ryan Reynolds delivered as he should have, the 4th wall was broken in true Deadpool fashion.\r Budget. It needed a larger budget, but as an R rated movie it was seen as a bit of a gamble.\r This brings me to the fact it's R rated. The gore, the violence, the jokes... FINALLY something I can laugh at and get behind. None of the soft hands that deliver most other movies in this genre.\r I HIGHLY recommend this movie.",
      "review_date": "2016-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was the funniest movie I have ever seen.  Stripes, Blazing Saddles, Beverly Hills Cop.  This was one of those movies, Leave the kids at home for this one though because it is R for a reason.  There were times where I was laughing soThis was the funniest movie I have ever seen.  Stripes, Blazing Saddles, Beverly Hills Cop.  This was one of those movies, Leave the kids at home for this one though because it is R for a reason.  There were times where I was laughing so hard, and then another joke is delivered and I am left gasping for air.  Overall, this was the most fun I have had in a movie theater since I was 17.  Kudos guys for a job well done.",
      "review_date": "2016-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A barrage of action and humor blend seamlessly, providing an immensely entertaining experience. The story features love and revenge, with well-paced flash-backs to the origin story of Wade Wilson as he becomes Deadpool. He is the 'merc with aA barrage of action and humor blend seamlessly, providing an immensely entertaining experience. The story features love and revenge, with well-paced flash-backs to the origin story of Wade Wilson as he becomes Deadpool. He is the 'merc with a mouth', and gaining his powers does little to change his personality; he is a selfish and damaged man who and hides behind his sarcasm. Both in and out of costume, he brings laughs as he chats up friends, enemies, a taxi driver and the audience. Deadpool is no typical movie adaptation of a comic book character. The film unapolegetically targets the young male demographic, and is nowhere near family-friendly like Spiderman or The Avengers. Deadpool, which is very R rated, is intended for mature viewers who enjoy extremely immature comedy in addition to over the top violence. It's not for kids, except the ones with 'cool parents' of course.\rDirector, Tim Miller, who has worked on the blockbuster video game series, Mass Effect, and one of my favorite films, Scott Pilgrim vs. The World, strongly impresses in his first feature film. The CGI effects are well-utilized and Deadpool's signature style of breaking the fourth wall is a frequent treat. The plot and pacing provide a steady stream of fun with no lull's in the action. The film has its common themes and cliches like any, but makes fun of them to viewers as they occur, turning anything generic into a laugh. Be prepared for a vulgar, perverted and crude joke filled journey of over-the-top violence. If nudity or atypical sex scenes offend you, then beware. The satirical humor can be dark and twisted similar to South Park at its most extreme. Not all the comedic dialog lands flush, but the creatively colorful language from Deadpool and friends keeps the laughter coming. Both the visual and sound effects were fantastic, and the music fit well.\rRyan Reynolds feels perfectly cast as the quick-witted anti-hero. He is completely believable as the jokester, and shows his diversity in the more emotional scenes. Ed Skrein stars as the antagonist/villain, Ajax. Although the character is a prototypical British baddie, his back and forth with Reynolds is great. Ajax is regularly backed up by the ass-kicking Angel Dust, played by Mixed Martial Arts star, Gina Carano. Actor T.J. Miller provides comedic support as the best friend, Weasle. Morena Baccarin, who plays the role of Wilson's girlfriend, Vanessa, impresses in a silly and fun role in stark contrast to her work in V and Homeland.\rWhen Reynolds is Deadpool, he has another pair of supporting characters in the form of X-Men, Collossus and Negasonic Teenage Warhead. The former is played by Stefan Kapicic and Greg LaSalle, who split the work between voice and physical acting respectively. The Latter, who I'll call NTW, is Brianna Hildebrand, who didn't even know what role she was auditioning for nor what her powers would look like on screen, but pulls it off well.\rThis movie is not for the easily offended, and not to be taken seriously. Entertainment value is what counts, and Deadpool has it in droves. It oozes originality from the advertising campaign all the way to the opening credits and post-film teaser. I can't think of another movie that entertained so consistently. Consumers have already cast their votes with their wallets, as Deadpool took in about $130 million this opening weekend, slicing up the previous box office record set by The Matrix Reloaded in 2003 by over $15 million. I recommend you view this film and see what the buzz is about, assuming you are an adult with a sense of humor. Disclaimer: I am not responsible for the corruption of any innocent souls that may result from watching Deadpool.",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome, fantastic, everything I could have wanted from a Deadpool movie, personally I cannot find any flaws within this film. masterclass and convincing performance from Reynolds. Violent, funny and relevant. It's smashed the box office andAwesome, fantastic, everything I could have wanted from a Deadpool movie, personally I cannot find any flaws within this film. masterclass and convincing performance from Reynolds. Violent, funny and relevant. It's smashed the box office and I'd happily go and see it again. It holds the title for the only film I have ever pre-ordered the blu-ray version for whilst still in the theater. Go see it.",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Huge film who make me laught a lot. The super héro is in fact a bad ass man with the brain eat by bees.\rWe want more Deadpool please !!\rSpecial mention for the writers who give it the shot",
      "review_date": "2016-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hilarious, fantastic representation of Deadpool himself in one of the most distinctive super hero films of all time. Straight from the intro sequence I knew this film was going to be awesome! I'm not just jumping on the bandwagon just becauseHilarious, fantastic representation of Deadpool himself in one of the most distinctive super hero films of all time. Straight from the intro sequence I knew this film was going to be awesome! I'm not just jumping on the bandwagon just because everyone else think it's a great film. Compared to a lot of other big action films, I genuinely believe Deadpool deserves the hype and praise it's been receiving. This film merges great comedy with awesome action in a sleek, stylish manner. Okay, so some parts here and there didn't quite make sense and some jokes were a bit dry, but with the low budget this film had they clearly made the most out of it. This is basically a great blockbuster film produced on a shoestring budget.",
      "review_date": "2016-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is what a Deadpool movie should look like! Action sequences are great - I was smiling the whole time. I was waiting for it since first footage leak and I was not disappointed. Not a 10 point score because it could be little bit more accurate to comic book (some characters are merged together - for example Ajax and Dr. Killebrew are one person) and could have more action and less backstory.",
      "review_date": "2016-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is what comic based movies should be like!\rHad the theater laughing every 2min or more frequent - the jokes come fast and land 75% of the time.\rLittle nuances and cameos here and there, but the content and quick banter make this movieThis is what comic based movies should be like!\rHad the theater laughing every 2min or more frequent - the jokes come fast and land 75% of the time.\rLittle nuances and cameos here and there, but the content and quick banter make this movie enjoyable, plus a little 4th wall breaking.\rOne thing to improve - focus on the main character...what really did the other \"X-men\" do? Not much, other than be a sounding board and joke fodder for our rebel.\rDefinitely worth a theater visit, much better than the \"doom and gloom\" of the other Marvel/DC offerings.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I scored this as a 10, because the movie adaptation is faithful to the source material. Even more so than Harry Potter. Deadpool isn't a hero, he's just a guy who does whatever the hell he wants. Again you can't rate this movie with plot orI scored this as a 10, because the movie adaptation is faithful to the source material. Even more so than Harry Potter. Deadpool isn't a hero, he's just a guy who does whatever the hell he wants. Again you can't rate this movie with plot or character development cause again, when you read or watch Deadpool you except gags, violence, and breaking the 4th wall...(or 16 walls, for those who watched). When you watch this movie, its heavy violence, cursing, and nudity. Don't bring kids. Seriously, don't. It's Deadpool, not Spiderman.",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At its core Deadpool is a love story, a really violent, vulgar, and perverted love story.  I had a blast with this film no question Ryan Reynolds was born for this role.  A-",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is not a movie for children.  If you enjoy late night Anime cartoons then you will love Deadpool.  The writing is spot on.  The editing is fantastic.  The CGI was money well spent.  I cannot wait for the next film.",
      "review_date": "2016-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A silly, irreverent movie which is a pretty good adaptation of Deadpool to the big screen. If you like Deadpool's sense of humor - if you're a fan of the character from the comics - this will be something you definitely want to see.\r If youA silly, irreverent movie which is a pretty good adaptation of Deadpool to the big screen. If you like Deadpool's sense of humor - if you're a fan of the character from the comics - this will be something you definitely want to see.\r If you aren't familiar with his brand of humor - basically, dead baby comedy, combined with some crudity and some violent sociopathy. Your inner 15 year old will probably love this movie, but if swearing bothers you, this movie will bother you.\r If you want to see a silly R-rated superhero movie which makes fun of superhero movies while still being an entertaining superhero movie, this might be up your alley. It has good action scenes, a fair few good jokes, and the plotline is coherent and pretty easy to follow.",
      "review_date": "2016-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As an avid comic book reader, I am very harsh of comicbook movies that change anything about a character. This movie was BY FAR the most accurate film adaptation of a comic book character that I have ever seen. From now on when I readAs an avid comic book reader, I am very harsh of comicbook movies that change anything about a character. This movie was BY FAR the most accurate film adaptation of a comic book character that I have ever seen. From now on when I read Deadpool comics I will hear Ryan Reynolds voice in my head. The only people that could possible give this film a negative review would be those that never read Deadpool and have no idea what kind of character they are going to see.",
      "review_date": "2016-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a 10 out of 10 for fans of the comic: the movie captures Deadpool almost perfectly. The writers also stick to Deadpool as he has been written in the comics, with the exception of tinkering with his origin just a bit. In short,This is a 10 out of 10 for fans of the comic: the movie captures Deadpool almost perfectly. The writers also stick to Deadpool as he has been written in the comics, with the exception of tinkering with his origin just a bit. In short, Deadpool fans (and fans of Marvel's universe) should be ecstatic that the studio did not eff this one up. If you haven't read the comics but like Ryan Reynolds and like comic-based movies that don't take themselves too seriously, this is still a 7 out of 10. Do not, do not, take you children to see this. Beyond being hyper-violent and containing nudity and colorful language aplenty, it is rather dark at times.",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool was just...WOW, when i walked out of the cinema i just couldn't believe how good it was as it had a small budget,was small scale and the movie was short for a superhero movie, but that's what made it good you can clearly see theDeadpool was just...WOW, when i walked out of the cinema i just couldn't believe how good it was as it had a small budget,was small scale and the movie was short for a superhero movie, but that's what made it good you can clearly see the director,producers and cast did great with the material they had.\r First off the humor..oh my gosh my humor was great,Ryan Reynolds is there perfect choice even before this movie we knew that(X-Men Origins Wolverine) and the dude brings the character to life with his portrayal .Even from the opening credits this movie starts to make you laugh and the first 10 minutes of this movie has the is best opening scene in a superhero origin story because origin stories are usually slow paced then improve to a faster pace, but this movie starts off with a fast pace and even when Deadpool isn't shown you never get bored because of the crude,rude humor,one-liners and characters in this movie.\r The rest of the cast's performances were good as well as the chemistry between Ryan's Wade Wilson and Morena Baccarin's Claire was great, you bought the romance these two characters had,cared for their relation as it was a weird and odd relationship.Wade's Friend Weasel was also decent comic relief and the two X-Men characters Colossus and Megasonic teenage warhead(yeah) fit perfectly into this movie.The villain Ajax portrayed by Ed Skrien was actually good, this guy was a generic bad guy, but worked for this movie as he was a threat to Deadpool and people around him(and the guy was an a**hole).\r What made this movie different from other superhero movies is the R-rating, at first i wasn't sure about it because from the trailers i thought they would go over the top with the R-rating, but i was wrong as this movie was better because of it, the gore,violence and of-course language was right for this movie even with some very EXPLICIT scenes it never feels out of place.The action was great, again the R-rating makes the action better and how can you not love a movie that opens up with an action sequence and one more thing to point out is even if this movie was part comedy it had some small scenes where the movie grew dark and i was really surprised by this because it fitted well and the intensity was amazing.\r Now the BAD, this movie had a few bad things about it like we all know Deadpool isn't a superhero more antihero because the man is a clear and there was this whole subplot in the movie where they tried to make Deadpool be a proper hero but you know it couldn't work as the subplot was just unnecessary and pretty obvious also i pointed out that the movie has good humor there are some scenes whereby the humor feels out of place at specially whereby the movie is supposed to feel intense it just doesn't work.Then there are some annoying filler moments whereby they tried to rub some humor but just felt unnecessary  and of-course with a small budget comes some bad CGI at times, but rather than that this movie is perfect.\r Deadpool is the perfect origin story for the character as the movie is funny,action packed,weird and just fun,the studio made up for that monstrosity in X-Men Origins Wolverine(they shut his mouth),didn't go over the top with the R-rating and the movie was just fun despite the small budget.Superhero fans with love this movie and non-superhero fans will have a good time-BRING ON DEADPOOL 2.",
      "review_date": "2016-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I went into the movie expecting a raunchy version of a typical Marvel movie with a passable plot and plenty of action. And that's about exactly what I got out of it. It wasn't bad, but it wasn't that great either. The story can be paired atI went into the movie expecting a raunchy version of a typical Marvel movie with a passable plot and plenty of action. And that's about exactly what I got out of it. It wasn't bad, but it wasn't that great either. The story can be paired at the level of writing to, say, the first Captain America movie which is predictable and pretty uninteresting. The saving grace for this movie is obviously Deadpool himself and the humor that comes with him. I don't think I've audibly laughed out loud at a recent film as much as I did during this movie and who can blame me? Deadpool's character is pretty refreshing for the big screen. Overall, Deadpool's charm won me over to enjoy this movie despite the story.",
      "review_date": "2016-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Now I know this movie is getting praised left, right and centre, but I find that it's being put on too high a pedestal simply because it's trying to be different and it's loyalty to the source material. Don't get me wrong, I really liked theNow I know this movie is getting praised left, right and centre, but I find that it's being put on too high a pedestal simply because it's trying to be different and it's loyalty to the source material. Don't get me wrong, I really liked the film, it's just I expected more.\r The action is there. The jokes are there. Spot on casting, solid performances, yet, it feels like it's missing a real story. At its core, this is a Deadpool origin story. Nothing more, nothing less. A shames as it would have been nice if it had more to it than that. Also, the movie feels short.\r Still, bottom line is this movie is great, just hope the sequel has more substance.\r Overall:\rA fun movie that does the name proud, a shame there wasn't more.",
      "review_date": "2016-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "deadpool is here and he is foul mouthed and random as ever. Ryan reynolds nailed this character perfectly and the only donwside is i wish the film was longer. that's how good it was. the comedy, characters and effects were all fantastic here,deadpool is here and he is foul mouthed and random as ever. Ryan reynolds nailed this character perfectly and the only donwside is i wish the film was longer. that's how good it was. the comedy, characters and effects were all fantastic here, no complaints. i don't want to spoil anything but the movie is paced very nicely and the comedic badass deadpool steals the show... obviously. if you like deadpool or comedic \"superhero\" movies that aren't for little kids then you owe it to yourself to see this phenomenal representation of Marvel's greatest anit hero. i rate deadpool 10/10 chimichangas",
      "review_date": "2016-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is a great superhero movie. I don't read his comic book and don't know his origin so I can't comment on that. But I do know he is a crass and violent character. This movie was violent, hilarious, with a pretty decent origin story. ItDeadpool is a great superhero movie. I don't read his comic book and don't know his origin so I can't comment on that. But I do know he is a crass and violent character. This movie was violent, hilarious, with a pretty decent origin story. It was way better than I expected and is one of my favourite comic book movies.",
      "review_date": "2016-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool was a great comic book movie (as even Deadpool claims it's not a superhero movie - he's not a hero). It had a very generic story, but the acting is great. Yup. Acting in a comic book movie is great for once. And then the jokes pushDeadpool was a great comic book movie (as even Deadpool claims it's not a superhero movie - he's not a hero). It had a very generic story, but the acting is great. Yup. Acting in a comic book movie is great for once. And then the jokes push the quality up even higher. It was funnier than Zoolander 2.",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply the Best Superhero movie ever. I left the theater with my head up high, eyes shining bright, utterly delighted with what I have just seen. \"SUCK IT WOLVERINE\"",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is proof that Fox can do a super hero film justice if they put their minds to it. After the abysmal Fan4stic; I was a bit nervous about this movie. The marketing was top notch but I dared to hope that the film lived up to theDeadpool is proof that Fox can do a super hero film justice if they put their minds to it. After the abysmal Fan4stic; I was a bit nervous about this movie. The marketing was top notch but I dared to hope that the film lived up to the marketing. I couldn't be happier to say that Deadpool finally has delivered the Deadpool fans have been wanting. Not sewing his mouth shut was an excellent start.\r The movie earns its R rating with a copious amount of nudity, gratuitous violence and wanton profanity. Reynolds was born to play this character. The film opens by treating you to one of the best opening credit sequences ever. The film also manages a great balance of action, exposition and 4th wall self awareness. In fact its the 4th wall breaks that offer some of the films more entertaining moments. Reynolds even pokes fun at himself as well as his former movies like Green Lantern and other Marvel properties and indeed Fox themselves.\r The fact that Fox took the risk to make this film as they did should be applauded. It also bears mentioning that the supporting cast are good as well. Colossus is incredibly likable as is his young trainee Negasonic Teenage Warhead. My one criticism is that the villains themselves weren't all that interesting and were pretty obscure.\r The movie also has one of the best cameos of Stan Lee ever! If you love Deadpool you owe it to yourself to see this film. This was made for the fans. Also be sure to stick around through the end credits as well!",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Really well done movie! with a lot of smart jokes, kinda remind me of siper-man humor a bit more on the dark side maybe hehe. Has the right action, history and villain, I recomend it to watch it! even more so if you are with a bunch of friends!",
      "review_date": "2016-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well directed, action packed, and....... hilarious. This is by far the funniest Marvel movie I have ever seen. The action was intense and realistic, keeping the theater entertained for all of it's run time. This is great!",
      "review_date": "2016-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought it was awesome, they didn't overdo it with jokes, and when they did make a joke it was at the right times, I loved every bit of it.\r.10/10\r .",
      "review_date": "2016-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fantastic!\rDeadpool is one of my favorite comic book characters of all time, and after seeing the trailer for this, I fell into the hype.  Let's just say that it surpassed my expectations.  The movie captures Wade's sarcastic, goofy, 4thFantastic!\rDeadpool is one of my favorite comic book characters of all time, and after seeing the trailer for this, I fell into the hype.  Let's just say that it surpassed my expectations.  The movie captures Wade's sarcastic, goofy, 4th wall breaking and raunchy personality very well, even if it's not perfect.  The movie is all about Wade trying to fetch back his wife from the man who gave him his \"mutant powers”.  It’s the classic “save my wife from the baddies” shtick, but what happens in-between makes for a fantastic Marvel movie.  One thing I liked about the film was that it didn’t drag out Wade’s backstory similar to Ant-Man; instead switching between the present and his backstory, it's a minor thing, sure, but for me, it helped the pacing of the movie.  The movie has vulgar humor, intense fight scenes, and some romance sprinkled in.  I especially liked the movie's portrayal of Deadpool's 4th wall breaking, such as telling the viewer not to leave popcorn on the floor, telling the viewer his backstory himself, etc.  It's a fantastic film overall, but I expected a bigger connection to the Marvel universe, such as the rest of the X-Men, or even Spider-man.  Vulgar, bloody and hilarious, Deadpool should not be overlooked.\r Deadpool gets a 9/10.\rWhat? A 10/10? Come on, Wade, it wasn't that go- *shot*",
      "review_date": "2016-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At last, a superhero with some biting wit. Makes for a more enjoyable story line, not totally a physical action movie.  It does have it's fight scenes, it's romantic tie in, something for everyone.",
      "review_date": "2016-06-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Se agradece que el cine de super-héroes madure. Es el reflejo más fiel de un super-héroe llevado a la gran pantalla. Se nota el presupuesto menor de esta película con respecto a otros títulos pero sin embargo ese tono adulto hace que destaqueSe agradece que el cine de super-héroes madure. Es el reflejo más fiel de un super-héroe llevado a la gran pantalla. Se nota el presupuesto menor de esta película con respecto a otros títulos pero sin embargo ese tono adulto hace que destaque y sea realmente una peli que no te puedes perder.\r 100% recomendable",
      "review_date": "2016-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am very happy that they got deadpool right and we have a R rated deadpool movie. I loved the comedy in this and I also loved the action. They also did a great job with the movie even though they had a low budget.",
      "review_date": "2016-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Anytime you see a review that gives a 0 or a 10, my advice is to skip it. There is an obvious bias there. Were there parts of this movie that just irritated the heck out of me? Yes. Is it a very crude, toilet humored, violent, film withAnytime you see a review that gives a 0 or a 10, my advice is to skip it. There is an obvious bias there. Were there parts of this movie that just irritated the heck out of me? Yes. Is it a very crude, toilet humored, violent, film with scenes of sex and nudity? Yes. Are the action scenes worth seeing? Yes. It was refreshing to see a different kind of hero movie. It reminded me of how The Crow made me feel when I first saw it. It was a different kind of hero movie. It was dark, full of action and very gritty from the beginning to the end. That is what made that film very good. Deadpool has a similar feel except it has a much more sarcastic main character and is seriously funny.\r Is this the best movie I have ever seen? Not, by a long shot. Is it a really good movie worth the price of a hefty admission on a Friday night? Absolutely. If you don't like toilet humor, high school boy humor, and silliness....don't see this movie. Nothing is more irritating than someone who goes into a movie like this and expects a wholesome, uplifting, and moral experience. This movie is not for you. It is also absolutely not for kids. There is nudity, sex, and very vulgar language and humor. Although I love movies like this, I will NEVER let my children see it until they are old enough.\r It was a movie given to us...the adults who never really grew up! It is definitely a movie I will buy when it is released.\r Ryan Reynolds gives us what he always does....his snarky one liners and his hilarious sarcasm. I've like most of his films, but this one really allows him to bring out that sarcasm. I loved him in Blade: Trinity and his personality in that film. It is similar here...but amplified 100 times. He is silly, but he is a talented actor as well. I loved the conversation between him and Weasel when he (Weasel) saw him after his change. You'll know what I mean when you see it.",
      "review_date": "2016-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I expected this movie to be good, I have to admit that I didn't expect it to be this good. Deadpool's character was hilarious and it was refreshing to see a superhero movie that didn't let the villains live to cause havoc another day.",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A film, and legendary comic and kelp are both funny and interesting as his Ant-Man comics were good but old subject more. I'm a good mark for this movie.",
      "review_date": "2016-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you go into this film wanting wit, suspense, clever and original humour then your going to be disappointed. Deadpool for me was greatly refreshing with so many superhero films falling flat in recent years it was wonderful to watch a filmIf you go into this film wanting wit, suspense, clever and original humour then your going to be disappointed. Deadpool for me was greatly refreshing with so many superhero films falling flat in recent years it was wonderful to watch a film that didn't take itself seriously, that gave you the action and the jokes and the \"drama\" without sitting through 45 minutes of flashbacks to un-needed filler pieces or waiting 80% of the film for a un satisfying conclusion. Deadpool gives me hope for the future of the superhero franchise that has been lacking for a long time. I think a second film could easily kill off some of the happy memories I have from the original, but if the team behind the film take the essence of the film without it being a direct copy and paste of he same jokes then it could have some potential",
      "review_date": "2016-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Funny, irreverent, crude, foul-mouthed and totally entertaining. I haven't had this much fun at a movie in a long time. Although it has some dark parts, Ryan Reynolds carries the movie with his sadistically, off-the-wall, brand ofFunny, irreverent, crude, foul-mouthed and totally entertaining. I haven't had this much fun at a movie in a long time. Although it has some dark parts, Ryan Reynolds carries the movie with his sadistically, off-the-wall, brand of self-deprecating humor. It's worth the price of the ticket and definitely a future part of my DVD collection.",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was nice and I would take kids to it however the sex scenes (which I felt were forced) and the large amount of swears but this was still nice and I this is the closest to getting a youtuber with a good appearance on tv (if watching at home)",
      "review_date": "2016-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "From what I've see it's definitely a movie for the fans so casual audience won't quite understand the detail and humour in this movie. Plot in this movie was good, side characters are great and humour was on the top. I found this movie easilyFrom what I've see it's definitely a movie for the fans so casual audience won't quite understand the detail and humour in this movie. Plot in this movie was good, side characters are great and humour was on the top. I found this movie easily one of my favourite comic movies.",
      "review_date": "2016-05-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is easily the best movie I ever watched. I really recommend you watch it with your friends so you can see how deadpool became dead pool. Anyone who rates this movie under 6 has not seen it (or they just hate it)",
      "review_date": "2016-05-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A remarkable surprise, Deadpool is great! Reynolds owns this character and was totally made to play him. This movie is so funny, and really is amazing how this movie came together.",
      "review_date": "2016-06-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clearly one of the best movies ever made. I do NOT understand why there are so many mixed and negative reviews! People and critics do not count how tough it was to make it? How limited money they had? You HAVE to take these account. This isClearly one of the best movies ever made. I do NOT understand why there are so many mixed and negative reviews! People and critics do not count how tough it was to make it? How limited money they had? You HAVE to take these account. This is not a typical Marvel superhero movie. It was created for fans, and such movies do not have big cash supporters.\r-hey studio, we are making new superhero movie that no one knows about, Guardians of Galaxy, rated Pg13\r- OK here is  $170 million\r -hey studio, we are making new superhero movie that everyone on internet knows about, Deadpool, rated R\r- Ok ... take this 58 million USD",
      "review_date": "2016-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just going to say it right now, Deadpool is amazing. This movie is not for the weak stomached, but if it's your kind of thing to hear bad language, horribly amazing (to put it lightly, in a non-Deadpool way ;)  ) male genitalia jokes, andJust going to say it right now, Deadpool is amazing. This movie is not for the weak stomached, but if it's your kind of thing to hear bad language, horribly amazing (to put it lightly, in a non-Deadpool way ;)  ) male genitalia jokes, and bloody action scenes, all the while being a love story? Yea but mainly the action and fourth wall breaks. Love the movie, and if the description above is your kind of thing, WATCH THIS MOVIE!!!",
      "review_date": "2016-06-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Did I ever think Fox could make a good Deadpool movie? Nope, especially post-Wolverine Origins. And particularly since First Class is the only great non-Bryan Singer X Men film. But they did it. Somehow, Fox loosened up enough to let a realDid I ever think Fox could make a good Deadpool movie? Nope, especially post-Wolverine Origins. And particularly since First Class is the only great non-Bryan Singer X Men film. But they did it. Somehow, Fox loosened up enough to let a real creative vision through and avoid another Fantastic Four situation.\r This movie is what a Deadpool movie can, and should, be. My only real complaint is the lack of a compelling villain and seemingly no connection to Weapon X or Stryker. Fox didn't seem to want to explore the X Men universe in the movie - possibly because of the timeline shenanigans and not knowing what their present day X Men-verse looks like (Apocalypse is in the 80s)",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Since to me, comedy movies haven't really do a good job to entertain or make me laugh. Deadpool proved that comedy isn't dead. Since the classical 'Hangover', comedy hasn't been doing great. I never laughed so much in a movie, ever. DeadpoolSince to me, comedy movies haven't really do a good job to entertain or make me laugh. Deadpool proved that comedy isn't dead. Since the classical 'Hangover', comedy hasn't been doing great. I never laughed so much in a movie, ever. Deadpool was fun, action-packed, and hilariously good. I can't call it the best super-hero movie, because it's basically a parody. But I can tell you this, this is one of my favorite movies and I would definitely watch it 20 or more times.",
      "review_date": "2016-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Doesn't pull punches, and makes me like Ryan Reynolds again. Dude put it on the line for this movie, which may have single-handedly saved X-men movies for a future generation. Gold.",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Tim Miller's \"Deadpool\" is an absolutely hilarious superhero movie that faithfully illustrates the merc with a mouth from the marvel comics everyone loves right onto the big screen. Some jokes do feel a little too forceful and excessive atTim Miller's \"Deadpool\" is an absolutely hilarious superhero movie that faithfully illustrates the merc with a mouth from the marvel comics everyone loves right onto the big screen. Some jokes do feel a little too forceful and excessive at times and the plot is as basic as it gets, but the movie knows that too and it does not give a fuuck about it. From its opening scene to credits, the film ceaselessly takes jabs at past and present trends and even shiites on Marvel for its 'limited' budget. It never takes itself seriously and goes all out with all kinds of comedy gold, something you don't see mixed often with the superhero genre. Of course credits to the writers and director for fusing the hype blockbuster marvel superhero formula with comedy, but it truly was Ryan Reynolds who undoubtedly made all this happen so smoothly. His flexibility and natural talent both as a actor and comedian is well shown in his character as he overturns his previous failure as green lantern into a success, winning his fans over as deadpool. Overall \"Deadpool\" is a great Marvel movie; it isn't great in a sense that we have a bunch of avengers coming out as cameos fighting evil, but great in a sense that it delivers what everybody loves, blood-pumping action and grade A comedy, with a cheerful whistle.",
      "review_date": "2016-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is the most anticipated Marvel movie since the Avengers and for good reason. If you are unfamiliar with the character, Deadpool is the outcast of the superhero world. He's got the moves and the abilities, but rarely does or says theDeadpool is the most anticipated Marvel movie since the Avengers and for good reason. If you are unfamiliar with the character, Deadpool is the outcast of the superhero world. He's got the moves and the abilities, but rarely does or says the right thing, for that matter, he doesn't get along much with anyone either. Ryan Reynolds stars as the not so super hero, and he is literally perfect for the role, it's as if the comic book was written last week with Reynolds specifically in mind, it was that great of a match. There is certainly a ton of hype around the character, the actor, and where it may eventually lead, but the truth is that the story really isn't anything special. I assume the film is meant to be about the character and how funny he is, making the story an after thought, but how can that be in a major motion picture? The film is your typical, guy falls in love, loses his girl because of a bad guy, and then goes looking for revenge, a common theme in every Marvel film. There is nothing different, exciting, or shocking about the story. For the purposes of Deadpool, it's all about the character. He curses, he kills, he makes fun of other Marvel films, and yes he's very funny, but to me, it was also a bit over the top. Since being acquired by Disney, Marvel is trying more and more to appeal to adult audiences and wants to show that its films can be just as bloody and crude as anybody elses, point made. The first time I watched Deadpool, I thought it was a weak story and a little over the top, but the second time I saw it, I thought it was a weak story and really over the top. The bottom line, the character is great, Ryan Reynolds is amazing, there are some great one-liners and laugh out loud moments, but as far as the story goes, it leaves a lot to be desired, as it was predictable, weak, and has been done time and time again.",
      "review_date": "2016-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is not going to let any fans down. This is the way the character had to be portrayed in a film adaptation. Its raunchy, its wild and its ridiculously funny the whole way through. It still does not beat X-Men Days of Future Past butDeadpool is not going to let any fans down. This is the way the character had to be portrayed in a film adaptation. Its raunchy, its wild and its ridiculously funny the whole way through. It still does not beat X-Men Days of Future Past but the film is at least in my top 3 Fox Marvel films so far. Its so self aware. No one is safe from the jokes even Ryan Reynolds himself. Ryan Reynold's has worked so hard to get a screen version of the true Deadpool character and all his hard work truely paid off. Reynolds is Deadpool now. There is no doubting, it's just like Hugh Jackman for Wolverine. This movie has romance that suits Deadpool and is really believable. The side characters are great although I did wish I would've saw more of TJ Miller. I thought he was starting to get so funny in one scene towards the end and then you don't see him again in the film. I hate to say it but there is really nothing out there like this. Remember when you go to see this film that it only took 50 million dollars to make. THATS OUTSTANDING. The action is so well filmed and although it is over the top its not really to the point where it becomes cheesy. Who knows how many knockoffs we'll be getting now but now is a good time to be a Deadpool fan.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't understand the Critic Reviews since this Movie is so awesome.\rDidn't enjoy a movie like this for years!\rYou really have to check this out :)  !",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool was an amazing funny comedy, fourth-wall breaker, jaw drapping, and a perfect Superhero movie I've ever watch! The action sequence & the goddamn jokes was so funny, since they [20 Century Fox] made a huge refrences through everyDeadpool was an amazing funny comedy, fourth-wall breaker, jaw drapping, and a perfect Superhero movie I've ever watch! The action sequence & the goddamn jokes was so funny, since they [20 Century Fox] made a huge refrences through every Marvel cameos & characters.\r The plot (NO SPOLERS!) was more kinda of-a revenge, & get the girl story, but people seems to talkin s--t about it, but who the hell cares...?\r Recomended for fan or no fan (but still Marvel fan) of Deadpool!",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thank you for giving us a true to comic Deadpool and not some PG abortion.\r If you were a old comic reader who was sorely disappointed in Wolverine's depiction of the merc with a mouth, then this will be what your looking for.   If you sawThank you for giving us a true to comic Deadpool and not some PG abortion.\r If you were a old comic reader who was sorely disappointed in Wolverine's depiction of the merc with a mouth, then this will be what your looking for.   If you saw nothing wrong with the earlier depiction you probably should just stay away from this movie.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is exactly the movie promised by the marketing campaign: it's a really fun and silly ride. Basically everything that a good popcorn movie should be.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent!!  In short, it's fast paced so there's no boring sag. It's action packed whilst not brainless, the writing is great and all the characters are so well cast as well as acted.  This film makes you realise that Ryan Reynolds isExcellent!!  In short, it's fast paced so there's no boring sag. It's action packed whilst not brainless, the writing is great and all the characters are so well cast as well as acted.  This film makes you realise that Ryan Reynolds is actually Deadpool's alter ego, his everyday disguise.  Very few films make me want to watch it again on the same day. Perfect 10.",
      "review_date": "2016-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not shocked...by some of the lower scored reviews on here because as we all know, there are people out there that have no taste in comedy.  Claim they do...but these are people you generally stay away from because they will destroy theI'm not shocked...by some of the lower scored reviews on here because as we all know, there are people out there that have no taste in comedy.  Claim they do...but these are people you generally stay away from because they will destroy the world around you.  Over 1500 positive reviews so far on Deadpool and only 120 negative tells you that this movie has a TON of promise and a promising future.  This is entertainment at its best.  Ryan Reynolds wanted to play this character again after that cow-pie of a movie (Wolverine Orgins) which as we all...yeah.  Anyway, one of the funniest movies I've seen in years and I can't wait to pick this up on bluray!!!  10/10",
      "review_date": "2016-03-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "With its never seen before marketing strategy; Deadpool smashed the box office with its 4th-wall-breaker humor. It’s a blast with all these random meta-references, splendid action & funny, but also meh-humor. It’s a fun ride for some, but aWith its never seen before marketing strategy; Deadpool smashed the box office with its 4th-wall-breaker humor. It’s a blast with all these random meta-references, splendid action & funny, but also meh-humor. It’s a fun ride for some, but a meh for others. It’s a classic revenge story that might be too non-inventive & lack a higher purpose to smaller characters & antagonists. But it manages to bring an almost unknown character to life, in a hilarious & immature way – even though the movie didn’t bother to add some extra focus to the story than on visual shine.\r Personal rating: 75/100\rCritical rating: 73/100",
      "review_date": "2016-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I 100% got what I wanted from this movie, it was fast, funny and violent. I didn't expect anything less from a Deadpool movie.Ryan Reynolds is fantastic as Deadpool. He makes you care for the guy behind the mask and he captures the comedicI 100% got what I wanted from this movie, it was fast, funny and violent. I didn't expect anything less from a Deadpool movie.Ryan Reynolds is fantastic as Deadpool. He makes you care for the guy behind the mask and he captures the comedic brilliance of the Deadpool character. Everybody else does a good job, don't think there was a bad performance anywhere in the film.This film won't be for everybody but if you know anything about Deadpool and enjoy the character on any level then this film does him justice.",
      "review_date": "2016-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The X-men universe expands a step wider thanks to the unusual mutated tones of storytelling compared to other Marvel's superheroes that surprisingly turns out very effective and brilliant. Despite a formulaic yet expected superhero plot, theThe X-men universe expands a step wider thanks to the unusual mutated tones of storytelling compared to other Marvel's superheroes that surprisingly turns out very effective and brilliant. Despite a formulaic yet expected superhero plot, the non-linear narrative by slipping the several action sequences together with flashbacks added with the heavy adult-related hilarious jokes throughout the film are wildly entertaining. The film stays faithfully to the characteristics of Deadpool - both humors and violence, which are perfectly portrayed by Ryan Reynolds, who is definitely the right actor to suit the character. The romantic chemistry between Wilson and Vanessa is emotionally engaging and convincing compared to Wolverine, making it a great option for Valentine outing. Changing his suit from green to red, Reynolds certainly has a lot of fun time in this non-family-friendly superhero adventure and the overall outcome has made the classic Deadpool shines among the other superheroes from the same studio.",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is one of those movies you don't want to take your kids with, but if you want to get creative on the way of raising your kids, don't start with a film with torture scenes, on the other hand if you are 17 or older, you are probablyDeadpool is one of those movies you don't want to take your kids with, but if you want to get creative on the way of raising your kids, don't start with a film with torture scenes, on the other hand if you are 17 or older, you are probably screwed up enough to the point where you start to seek out for something else to entertain yourself with. Anyway, Deadpool is a awesome film directed by Tim Miller and starring Ryan Reynolds as the one and only Deadpool. Now, as this film really doesn't feel like it has a script, that really doesn't matter, why have a script when you have constant and unexpected 4th wall breaks to tell the story right? Maybe, there is a story to the film between Deadpool and his fiance where unexpectedly it gets tied into Deadpool's plan for revenge on the important Francis who turned him into what he is. I hope you all realize that this film is undoubtedly funny as **** from it's LMFAO moments like all the 4th wall breaks, the cast was really difficult to recognize other than Ryan Reynolds, TJ Miller, and Gina Carano, the CGI in the film was hardcore **** for a film with a small budget, which is surprising, and don't worry people who can't handle really flashy lights, this film is ok for you to watch, also don't go seeing this movie when you don't know what Deadpool is, cause if you do that and walk out on the movie, you just wasted your money. The movie's soundtrack was perfect enough. The length of the movie couldn't be any longer or shorter as all of the crazy **** that happens right before your eyes happens for your own enjoyment. Honestly, I have never seen a film so spontaneous and surprisingly random through bloody and Gorey gunfights which are insane, along with a great lead character. Deadpool is something you will never see like this ever again.",
      "review_date": "2016-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A brilliant, joyful film which revels in violence and delights in the hilarity provided by the protagonist. Reynolds is superb, and the script is exceptionally well executed, with a storyline that unfolds at a cracking pace, and actionA brilliant, joyful film which revels in violence and delights in the hilarity provided by the protagonist. Reynolds is superb, and the script is exceptionally well executed, with a storyline that unfolds at a cracking pace, and action sequences beautifully choreographed and crafted to allow for a myriad of comic moments. This was so much fun and thoroughly enjoyable; I haven't laughed so frequently in a film for a while. This is an absolute must see, and happy International Women's Day to all! 9.02/10",
      "review_date": "2016-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie contained some really bad jokes (not funny bad, either, bad bad. Especially the line about the brown pants. Ugh.) However, it also contained a ton of GOOD jokes, great character interactions, a pretty decent story, and the mostThis movie contained some really bad jokes (not funny bad, either, bad bad. Especially the line about the brown pants. Ugh.) However, it also contained a ton of GOOD jokes, great character interactions, a pretty decent story, and the most likable superhero lead from any superhero movie or show I've seen in the past few years. However, do not be an idiot and take your kids. Some idiot parents behind me brought what looked like their two eight year olds. And let them stay. For the whole movie. Not smart.",
      "review_date": "2016-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very intense movie, after watching it and reading about the low budget they had, I renewed my love for this movie and for the great team behind it. Great visual effects.",
      "review_date": "2016-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Let's just say I got just what I expected from this movie and over half the jokes landed. Now I may be a bit bias because I love jokes, fourth wall breaks, and especially I love Deadpool doing what he does best. He makes the best jokes inLet's just say I got just what I expected from this movie and over half the jokes landed. Now I may be a bit bias because I love jokes, fourth wall breaks, and especially I love Deadpool doing what he does best. He makes the best jokes in awkward situations and murders people. This movie is well paced and it has a simple plot that is both funny and well written. It follows some of the comics and it proves that we CAN have rated R superhero movies IF there is passion in both writing and actors. I am very hyped for Deadpool 2 already!",
      "review_date": "2016-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is the best comic book adaptation I have seen in a long time. There is action, an interesting origin story and a lot of jokes and puns. Don't show this movie to your kids!",
      "review_date": "2016-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is a movie that will make you lose faith in movies. Hell, it made me lose faith in humanity. If this is the kind of thing people will praise as the new gospel, then we as a race are in serious trouble. Deadpool is a bland superheroDeadpool is a movie that will make you lose faith in movies. Hell, it made me lose faith in humanity. If this is the kind of thing people will praise as the new gospel, then we as a race are in serious trouble. Deadpool is a bland superhero movie, a vulgar comedy, and a cynical corporate exercise rolled into a rotten chimichanga of the worst impulses of modern Hollywood.",
      "review_date": "2018-06-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Can't explain that high score and why people are so excited and crazy about this full crap. If you are a fan of a nonsense story, flat humor, all the way perverted jokes and super annoying main character, than okay.. go for it. But if you areCan't explain that high score and why people are so excited and crazy about this full crap. If you are a fan of a nonsense story, flat humor, all the way perverted jokes and super annoying main character, than okay.. go for it. But if you are a fan of real comedies or action movies or whatever genre movies, as well as real humor, that could make everyone laugh, without rudeness, then you should be offended by this Deadpool-full-crab-teen-shi*. It wouldn't be funny even if I was 10 years old .The whole movie is annoying and dumb like the most part of Marvel's work and I feel offended by such movies, because eventually films are made according to the viewer and dam* I'm not that stupid and I don't deserve crab like that.",
      "review_date": "2018-07-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I rarely give out tens and never to comic book movies, but this here is the most fun I've had at the movies in a very long time. Most super hero movies are very serious with some forced humor that falls flat. Deadpool made me laugh from theI rarely give out tens and never to comic book movies, but this here is the most fun I've had at the movies in a very long time. Most super hero movies are very serious with some forced humor that falls flat. Deadpool made me laugh from the opening credit scene to the after closing credit scene. I wanted more when it was over. Ryan Reynolds is perfect for the role. If you're ok with vulgarity and have a good sense of humor, Deadpool is for you.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I mostly enjoyed this movie. It's  a stupid vulgar and over the top flick that's  good for a few laughs but the story acting and dialog aren't  that good. It's  good for a single viewing if you go in with low expectations. Overall  a lotI mostly enjoyed this movie. It's  a stupid vulgar and over the top flick that's  good for a few laughs but the story acting and dialog aren't  that good. It's  good for a single viewing if you go in with low expectations. Overall  a lot better than both Wolverine films.",
      "review_date": "2016-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The superhero movie boom has gone on long enough that it's time for something like this: a self-aware quasi-parody. The genre needs to make fun of itself a bit. It's a little dirty, plenty violent, and a lot of fun.\r Ryan Reynolds nails theThe superhero movie boom has gone on long enough that it's time for something like this: a self-aware quasi-parody. The genre needs to make fun of itself a bit. It's a little dirty, plenty violent, and a lot of fun.\r Ryan Reynolds nails the title part, though the supporting cast has some head-scratchers, from Ed Skrein's one-note overconfident charisma to Gina Carrano's can't act-ness. And while Morena Baccarin made plenty of an impression as a zen master prostitute on Firefly or as the frigid alien queen on V, it's subsequently hard to buy her in this role which requires a little more zest. Nonetheless, the movie works well enough.\r There is an end credits scene, a Stan Lee cameo, and everything else you'd expect from a comic book movie.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nDeadpool is the first Fox comic book movie that's unashamed of its source material. Sometimes the lack of budget is obvious, but Tim Miller succeeded in translating the aesthetics of a Rob Liefeld comic to the big screen. It's an ugly-looking film, but that works to its advantage since the merc with a mouth lives in a disgusting and nasty world. Kudos for the offbeat pacing in the action scenes (I loved the montage of Deadpool upgrading his costume). Sure, there are plenty of cliches, but all of them are executed in a witty fashion you don't see very often in the genre.\rRyan Reynolds' delivery is on point (his dialog fits him like a tailor-made tuxedo) and won't make you miss Nolan North. He finds himself in the perfect playground to display his comedy and action chops. The supporting cast happens to be fantastic as well. Ed Skrein is having a blast as an \"evil for the sake of being evil\" villain, TJ Miller and Morena Baccarin have chemistry to spare with Reynolds, and even Gina Carano turned out fine.\rIt's a flick made by fans for the fans, and a breath of fresh air in the comic book adaptations landscape.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "No denying that Deadpool is a fun movie, but still expected more from the movie, but still very worth seeing, it is to die laughing from beginning to end.",
      "review_date": "2016-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Violent, bloody, and funny beyond belief. I advise you to stay for the post-credit sequence.\rI don't like many of Deadpool's lifestyle choices (I hate Wham!), but I stand behind his right to love it.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was a fun and funny movie. Pretty standard plot, exactly what you expect to happen will happen, happy ending. But the side jokes, the snarky lines are what really makes it. Ryan is perfect to play Wade. I;m not going to act like it showedIt was a fun and funny movie. Pretty standard plot, exactly what you expect to happen will happen, happy ending. But the side jokes, the snarky lines are what really makes it. Ryan is perfect to play Wade. I;m not going to act like it showed new ways of how film a movie and had crazy revolutionary fight scenes, it was just a standard superhero movie with a fun tone.",
      "review_date": "2016-02-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is pure entertainment from start to finish. It is remarkably true to the character of Deadpool. It has several laugh out loud moments. Honestly no one who is interested in super-\"hero\" films will be disappointed or will feel shortDeadpool is pure entertainment from start to finish. It is remarkably true to the character of Deadpool. It has several laugh out loud moments. Honestly no one who is interested in super-\"hero\" films will be disappointed or will feel short changed by this movie.",
      "review_date": "2016-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Saw it with less than 20 others in theatre, the humour is not that funny, sure there are a couple of laughs here and there, but hilarious...absolutely no, maybe its a crowd thing. It is entertaining with a small cast and a lot of extras toSaw it with less than 20 others in theatre, the humour is not that funny, sure there are a couple of laughs here and there, but hilarious...absolutely no, maybe its a crowd thing. It is entertaining with a small cast and a lot of extras to fill up the body bags from some good action. Will there be an Deadpool 2, I think so, it hits a few good points for a more grown up superhero type of movie. But don't let the kids see it, it needs a bit of chopping up to get to a PG.",
      "review_date": "2016-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's a good movie for sure. They did not have the budget of movies like the first Iron Man for example but the result is more than honorable. It has very funny parts and Reynolds plays the character well. Some side characters, AjaxIt's a good movie for sure. They did not have the budget of movies like the first Iron Man for example but the result is more than honorable. It has very funny parts and Reynolds plays the character well. Some side characters, Ajax especially, are average and the movie feels a little bit rushed sometimes. But it works great and the references to 80s pop culture is spot on. If added to an x-men movie, Deadpool could add the \"spice\" it misses.",
      "review_date": "2016-02-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Deadpool is a complete masterpiece and a dream come true for comic book fans. The script of this movie is just nearly flawless. The 4th wall breaking , the hilarious references , Mind blowing action sequences with gore, great performances andDeadpool is a complete masterpiece and a dream come true for comic book fans. The script of this movie is just nearly flawless. The 4th wall breaking , the hilarious references , Mind blowing action sequences with gore, great performances and complete opposite of a generic superhero movie. Ryan Reynolds is definitely the perfect Wade Wilson. Overall a perfect comic book adaptation.",
      "review_date": "2016-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Me and my girlfriend loved it! 6,5 rating by critics? These critics need to have sex with an older avocado to fully grasp the concept of the movie!!!!",
      "review_date": "2016-02-14",
      "source": "metacritic"
    }
  ],
  "num_reviews": 149
}