{
    "title": "Hidden Figures",
    "rating": 7.5,
    "release_date": "2016-12-25",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "summary": "As the United States raced against Russia to put a man in space, NASA found untapped talent in a group of African-American female mathematicians that served as the brains behind one of the greatest operations in U.S. history. Based on the unbelievably true life stories of three of these women, known as \"human computers\", we follow theseAs the United States raced against Russia to put a man in space, NASA found untapped talent in a group of African-American female mathematicians that served as the brains behind one of the greatest operations in U.S. history. Based on the unbelievably true life stories of three of these women, known as \"human computers\", we follow these women as they quickly rose the ranks of NASA alongside many of history's greatest minds specifically tasked with calculating the momentous launch of astronaut John Glenn into orbit, and guaranteeing his safe return. Dorothy Vaughn, Mary Jackson, and Katherine Johnson crossed all gender, race, and professional lines while their brilliance and desire to dream big, beyond anything ever accomplished before by the human race, firmly cemented them in U.S. history as true American heroes. [20th Century Fox]… Expand",
    "critic_reviews": [
        "Hidden Figures, both a dazzling piece of entertainment and a window into history, bucks the trend of the boring-math-guy movie.",
        "This bracing movie...gets off to a spirited start and rarely lets up, sharing with viewers a little-known chapter of history as inspiring as it is intriguing.",
        "The film’s made with more heart than art and more skill than subtlety, and it works primarily because of the women that it portrays and the actresses who portray them. Best of all, you come out of the movie knowing who Katherine Johnson and Dorothy Vaughn and Mary Jackson are, and so do your daughters and sons.",
        "Feels utterly fresh for our times.",
        "Lots of movies are labeled as \"inspirational\" – Hidden Figures truly earns the right to the term.",
        "The film's big breakout is Monáe, the Grammy-winning musician who impressed in a small role in Moonlight but showcases a wealth of talent as the youngest and most opinionated of the three main women.",
        "You might just find yourself applauding during certain moments of dramatic triumph in Theodore Melfi’s unabashedly sentimental and wonderfully inspirational film, and yes, some of those moments feature people working out high-level math problems.",
        "This is one of the year's best films.",
        "A triumphant and heartwarming film, not an angry and scolding one, that carefully maps how excellence and determination win over the doubters.",
        "Hidden Figures might not be as groundbreaking as the women whose story drives it, but like those women, it does what it does very well.",
        "Charged with streamlining Figures’ knotty real-life histories, director Theodore Melfi (St. Vincent) tends to paint too much in the broad, amiable strokes of a triumph-of-the-week TV movie. But even his earthbound execution can’t dim the sheer magnetic pull of an extraordinary story.",
        "It's a lesson that African-American culture offers more inspiring stories than Hollywood has chosen to tell.",
        "Taraji P. Henson excels in a heart-warming history lesson that proves not only rocket men had The Right Stuff.",
        "Directed with what you might call resounding competence by Theodore Melfi, Hidden Figures isn’t pushing the cinematic boat out in any new directions, but it steers its prescribed course nimbly and nicely.",
        "Essentially Parabolas & Prejudice, it isn’t the most nuanced piece of work out this month. But nuance be damned — an uplifting plea for equality, this is a story calibrated for maximum effect.",
        "When executed with love and peopled with actors who breathe life into their characters, Hidden Figures is precisely the delight it aims to be.",
        "A crucial episode of the nineteen-sixties, centered on both the space race and the civil-rights struggle, comes to light in this energetic and impassioned drama.",
        "The film may not be restrained but stars Taraji P. Henson, Octavia Spencer and Janelle Monáe are powerfully effective and its little-known true story is so flabbergasting that resistance is all but futile.",
        "From one scene to the next, you may know more or less what is coming, but it is never less than delightful to watch these actors at work.",
        "Hidden Figures is a bouncy, almost garish feelgood girl pic. A movie that knows right from wrong and doesn’t see any use in complicating matters.",
        "While Hidden Figures hits many of the beats one would expect, Melfi’s film strikes a delicate balance of injecting levity within the character-based historical drama that propels the story forward.",
        "While Hidden Figures is likable and illuminating, it is, nevertheless, routine and predictable.",
        "It’s candied history. The timeline is all wrong, the soundtrack is too cheery, the movie is too eager to please. Yet at the end, I found myself tearing up anyway.",
        "The story that Hidden Figures tells is so irresistible that you can almost forgive the fact that the movie itself is resistibly unoriginal. It’s an unabashed crowd-pleaser with a heavy history lesson undertow.",
        "Hidden Figures is an admirable attempt to dramatize an overlooked aspect of American history. Working from a screenplay that he co-wrote with Allison Schroeder, director Theodore Melfi (“St. Vincent”) delivers a crowd-pleasing film that often resembles a sitcom but frankly addresses the social inequities of the period.",
        "The movie indicts exclusion and racial hierarchy without finding villains inside that system.",
        "Historical fudges aside, Hidden Figures provides an example of determination and talent triumphing over an unfair and repressive system.",
        "For all that it tells a highly unusual story, Hidden Figures is a classic Hollywood feel-good movie. This has been a year of notable achievement for African-American performers and stories, from the surprising observations about masculinity in Moonlight to the gently told civil-rights saga of Loving. In that sober-sided company, Hidden Figures is a face-licking puppy dog of a film.",
        "Its positive message about education, the value of hard work, and the power of social commitment make it a must-see for parents and kids alike.",
        "It is old-fashioned in a good way, classical and well-acted, and that it has no surprises keeps it from being disappointing, even as it keeps it from being great.",
        "A paean to the unsung, Hidden Figures is also a romanticized tribute to everyday problem solvers who, in the movie’s eyes, are their own kind of superheroes.",
        "Hidden Figures is feel-good history, but it works, and it works on behalf of heroes from a cinematically under-served community. These smart accomplished women had the right stuff, and so does this movie.",
        "Hidden Figures, directed by Theodore Melfi (St. Vincent), is a canny and necessary crowd-pleaser in which not one moment feels like life itself. But, together, in their superb Hollywood falseness, they accrete into a portrait of our best idea of our national character while still exposing bitter truths about who was allowed to be what back in that age of presumed \"greatness.\"",
        "The fine, spirited work of Taraji P. Henson, Spencer and Janelle Monae as irresistible rooting interests, as well as Kevin Costner’s winningly lived-in turn as the head of Langley’s Space Task Group, deepen a film that’s propelled by sitcommy beats and expository dialogue.",
        "Hidden Figures is empowerment cinema at its most populist, and one only wishes that the film had existed at the time it depicts — though ongoing racial tensions and gender double-standards suggest that perhaps we haven’t come such a long way, baby.",
        "A fairly entertaining gloss of a docudrama elevated by its cast.",
        "Warm and witty performances by Spencer, Hensen and Monae, the stoic moral stature Costner plays and unlikable-until-they’re-reasonable turns by Dunst and Parsons make Hidden Figures a winner, a piece of unknown history rendered flesh and blood funny, uplifting and never less than entertaining.",
        "The central characters' dogged refusal to cede their places on a team that keeps trying to reject them is a moving display of heroism.",
        "This is heartfelt, inspiring stuff and there is no doubt that this is a true story that absolutely merits wider recognition.",
        "The tone is earnest, with dialogue that sometimes plods when you want it to fly — a running time of 127 minutes doesn’t help the pacing — and a couple of pieces of casting are infelicitous: Jim Parsons gives a flat performance as the fictional Paul Stafford, NASA’s lead engineer, and Glen Powell is years too young to play John Glenn, who looks like a gung-ho frat boy.",
        "Just as importantly, though, is the tone of Melfi's film...which blends humor and emotion into the proceedings, to heartwarming effect.",
        "The film aims for the stars but might have gone stratospheric if it cooled its jets ever so slightly.",
        "Everything in Hidden Figures is smoothly efficient but also a little anticlimactic and frictionless — the story’s happy ending a little too easily achieved.",
        "Hidden Figures is an earnest movie, but not a very exciting one. The screenplay feels as engineered as a Gemini rocket launch, with every scene and line carefully calculated.",
        "For all of its current touchstones, Hidden Figures feels far too late, both in the recognition these women deserve and the filmmakers’ goodhearted but dull approach to their stories.",
        "At a time when calls for diverse media dominate the industry, Hidden Figures hedges its bets with a family-friendly commercial solution: warm and fuzzy storytelling that’s both progressive and safe.",
        "Hidden Figures is a nice movie. At its head is a trio of good performances from Taraji P. Henson, Octavia Spencer, and Janelle Monae. But it is in essence a feature-length version of an inspiring social media image macro, or perhaps a Google Doodle. “Did you know that black women were important at NASA?” It has little else to offer."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "So, if you like a little bit of NASA history and if you are a computer software developer like me, 35 years, then this movie is a perfect historical backdrop. If you like well-made, enjoyable movies that a treat to the mind, the heart and theSo, if you like a little bit of NASA history and if you are a computer software developer like me, 35 years, then this movie is a perfect historical backdrop. If you like well-made, enjoyable movies that a treat to the mind, the heart and the soul, then this is the movie. If you like good acting, good story-telling and a glimpse of the what racial segregation used to be like, than this is your movie. The only reason I didn't give this a movie a 10 and gave it a 9 instead is, because at times the movie tries to hard. It didn't need to, but it's definitely worth seeing. Enjoy.",
            "review_date": "2017-02-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures is a story that deserves to be told, and it is told perfectly well by a decent cast, although there´s nothing in this formulatic biopic to lift it above average status and make it truly stand out.",
            "review_date": "2017-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Real life drama that has a complacent taste but well compensated with remarkable roles, and a story of struggle against prejudice. Perchance a black horse of Academy Awards.",
            "review_date": "2017-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "No words to describe how brilliant in every aspect of a movie ! This ought to be the biggest inspiration of a colored american dream to achieve.",
            "review_date": "2018-01-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lord, let us give thanks for the miracle you have given us in your infinite wisdom, generosity, and mercy. Lord, thank you for blessing the world with Janelle Monae and her wide range of talents.Why Spencer nominated？",
            "review_date": "2017-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Does this deserve a Best Picture nomination, Best Supporting Actress nomination? No. Did it get one by affirmative action? Undoubtedly yes. Yet it is a good true story and well made and is the same kind of popular entertainment that has aDoes this deserve a Best Picture nomination, Best Supporting Actress nomination? No. Did it get one by affirmative action? Undoubtedly yes. Yet it is a good true story and well made and is the same kind of popular entertainment that has a good message but was not a huge sensational blockbuster (those often get overlooked by the sheep at The Academy) like such past hit nominees that didn't deserve it \"The Help\", \"Seabiscuit\", \"The Cider House Rules\", \"Awakenings\", \"Dead Poets Society\" etc.",
            "review_date": "2017-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First thing's first, it's an uplifting and inspiring story, but nonetheless, it's also a very formulaic, by-the-numbers crowd pleaser as well. Taraji P. Henson, Octavia Spencer, and Janelle Monae all give fine performances as the titularFirst thing's first, it's an uplifting and inspiring story, but nonetheless, it's also a very formulaic, by-the-numbers crowd pleaser as well. Taraji P. Henson, Octavia Spencer, and Janelle Monae all give fine performances as the titular characters, as do Kevin Costner, Kirsten Dunst, Mahershala Ali, Jim Parsons, etc in supporting roles, but they simply can't help the film feel like nothing more than a predictable narrative and formula we've seen too many times before. I also honestly found the overall film, the score/music choice in particular very corny. Overall, it's definitely a feel-good film with an inspiring true story with some dedicated performances from great actors and actresses, but don't go in expecting anything extraordinary in terms of the inspiring true story subgenre.",
            "review_date": "2017-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Does this deserve a Best Picture nomination?  No.  Did it get one by affirmative action?  Undoubtedly yes.  Yet it is a good true story and well made and is the same kind of popular entertainment that has a good message but was not a hugeDoes this deserve a Best Picture nomination?  No.  Did it get one by affirmative action?  Undoubtedly yes.  Yet it is a good true story and well made and is the same kind of popular entertainment that has a good message but was not a huge sensational blockbuster (those often get overlooked by the sheep at The Academy) like such past hit nominees that didn't deserve it \"The Help\", \"Seabiscuit\", \"The Cider House Rules\", \"Awakenings\", \"Dead Poets Society\" etc.  The Academy goes for either high brow pretension or sugar coated schmaltz with a good moral message.  And yes it does go for undeniably great benchmark films too.  This picture falls squarely into the second category.  All the players are good.  Costner seems perfect for his part.  It's a nice movie about race in America during the sixties and the space race that was of the same period.  It blends the two subjects perfectly.",
            "review_date": "2017-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yet another \"based on true events\" (i.e. pretty much totally false) racial pandering Oscar bait flick. They are pretty much cranked out 2-3 per year by formula these days.FYI: my uncle used to do ballistic calculations similar to those doneYet another \"based on true events\" (i.e. pretty much totally false) racial pandering Oscar bait flick. They are pretty much cranked out 2-3 per year by formula these days.FYI: my uncle used to do ballistic calculations similar to those done by Katherine Johnson for a major defense firm. He said it was the most boring, mind-numbing job he'd ever had, \"basically like being a mathematics janitor\". You're mostly just checking and double-checking math results that an early (hence somewhat unreliable) computer spit out.Frankly movies like this do blacks a grave disservice, just like that one about the African \"math genius\" who in reality is a mediocre club-level player who peaked at age 19 and only won awards through affirmative action. Revisionist history might sell, but it won't actually enlighten people who are interested about the true history of race in America.",
            "review_date": "2017-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's innocent by-the-numbers stuff with charming performances from a stellar cast. If that's all you go in wanting, then you'll get everything you want. Anyone who wants something risky or new best look elsewhere.",
            "review_date": "2017-01-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tremendous mythmaking of the highest order!  Having lived thru much of the actual history, I'm aware accuracy is of interest AND composing a Progressive myth, based on accurate history is high art.  The script has the good fortune of factsTremendous mythmaking of the highest order!  Having lived thru much of the actual history, I'm aware accuracy is of interest AND composing a Progressive myth, based on accurate history is high art.  The script has the good fortune of facts telling a story of the epic struggle of educated blacks to be accepted at NASA against the backdrop of more facts, the epic courage of the early American astronauts and NASA administrators.  The high point for me occurs when Kevin Costner takes a metal crowbar to the sign \"Colored's Bathroom\" with 15 colored women, the \"computers\" watching.  Wow.  Priceless mythmaking of the highest order, small personal acts of courage and justice demonstrating and highlighting more truly human values than the norms of mainstream culture.  The cast and direction is flawless in my humble opinion.",
            "review_date": "2017-07-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures tells a story that, in a world of gender and racial equality, would already be known worldwide. It is at times comedic, and fun, but never shy's away from demonstrating the harsh realities of society.",
            "review_date": "2017-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Such a great movie! It is such an incredible story that most of us had no idea about. It was inspirational, funny, and all around a must see movie for this year.",
            "review_date": "2017-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Boring. Spancer is very BAD. The actress never appears to fully connect with the character, delivering a series of doleful little-girl-lost poses — and, later, pantomimed iron-jawed determination.",
            "review_date": "2017-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent film with stellar performances from Costner, Spencer and Monae. Taraji P. Henson, however, delivers her finest cinematic work yet! Best movie of the year by far!",
            "review_date": "2016-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A flat-out winner and incredible crowd-pleaser that fires on virtually every cylinder. With the possible exception of the need for a better-developed back story, this inspiring, thoughtful and humorous historical drama hits all the rightA flat-out winner and incredible crowd-pleaser that fires on virtually every cylinder. With the possible exception of the need for a better-developed back story, this inspiring, thoughtful and humorous historical drama hits all the right notes and does so without going over the top, becoming preachy or lapsing into heavy-duty schmaltz. The picture's incisive script and superb ensemble cast performances make this one to see.",
            "review_date": "2017-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is just an enjoyable feel good film that does not deserve an Oscar nomination for Best Picture. It is enjoyable and you do learn something. However, the rough edges are scrubbed down and the film is sanitized. I wonder if this is done soThis is just an enjoyable feel good film that does not deserve an Oscar nomination for Best Picture. It is enjoyable and you do learn something. However, the rough edges are scrubbed down and the film is sanitized. I wonder if this is done so that more white audiences will feel comfortable. The film is predictable and is a color by numbers effort. That said, I enjoyed it but never felt challenged or unsure of where it was taking me.",
            "review_date": "2017-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The other side story of the historic event!This film did not just represented the black people, but the women as well. Today we talk about discrimination against women, though this film is an example that it all had started way long ago,The other side story of the historic event!This film did not just represented the black people, but the women as well. Today we talk about discrimination against women, though this film is an example that it all had started way long ago, yet the struggle has not ended. Anyway, this is a biopic, a biopic of three women and their struggle not just being a black, but being women. When the nation was eager to send its first man to the space, there was some trouble within the team who are behind it to work together as one. Lots of inspiring events reveal how the history was made and the working culture was changed forever inside the NASA.The film was nominated for the Oscars in the three slots, but did not win any. That's fine, because I would prefer those real women to be recognised over what this film had achieved. All the three actresses were good. Their roles were unique from one another. Really a wonder film about three real persons in one film. Something rare in films to highlight their achievements equally. The personal life, as well as their professional was well briefed.The others like Kevin and Dunst in small part were also good. Directed by just a one film old filmmaker. He did good. The screenplay was adapted from the book of the same name. Deserved all the awards and praises it had received. After seeing how it had ended, a sequel could be possible. Mission Moon. I hope they would consider it! Seems a nice idea!8/10",
            "review_date": "2017-09-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not the biggest cinematic achievement of the year by any means but a way better film than usual when it comes to this genre of cute films full of good intentions that show as some type of history page to teach us a lesson. In this case it isNot the biggest cinematic achievement of the year by any means but a way better film than usual when it comes to this genre of cute films full of good intentions that show as some type of history page to teach us a lesson. In this case it is absolutely entertaining from start to finish, funny, fun and poignant. It helps a lot that the vehicle used to tell the story is a scientific achievement. Not common in films unfortunately. It´s woth the mention that the incredibly talented musician Janelle Monae makes a great debut in film with this one. Also fantastic the other two actresses as always of course. Recommendable.",
            "review_date": "2017-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Narrating a timeless true story in a fashion that honours the women involved, Hidden Figures rises due to the strength of the cast and a feel good tone throughout.",
            "review_date": "2017-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Poignant, entertaining and well-acted. Hidden Figures brings the audience a surprisingly funny real story that becomes unforgettable thanks to its breathtaking interpretations.",
            "review_date": "2017-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a gorgeous movie, featuring an amazing cast.From the very first moment in the movie I was hooked. I really wanted to see how Theodore Melfi adapted Margot Lee Shetterly's book. But more importantly I wanted to see Katherine G.This is a gorgeous movie, featuring an amazing cast.From the very first moment in the movie I was hooked. I really wanted to see how Theodore Melfi adapted Margot Lee Shetterly's book. But more importantly I wanted to see Katherine G. Johnson, Dorothy Vaughan and Mary Jackson's story. I was not disappointed. Taraji P. Henson, Octavia Spencer and Janelle Monáe were phenomenal. Not only was this a movie I'd happily watch at the cinema multiple times, but I will be rushing out to buy the Blu-ray the moment it comes out.",
            "review_date": "2017-02-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures tells the inspirational true story of some of the first black women who got to work for NASA. It has great direction, performances, writing, and in the end a great takeaway message.",
            "review_date": "2017-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures is a pretty by-the-numbers drama that I probably will forget existed in a few years, but it is worth a watch.Acting: Taraji P. Hensen was very good, but I'm not disappointed she didn't receive a best actress nomination.Hidden Figures is a pretty by-the-numbers drama that I probably will forget existed in a few years, but it is worth a watch.Acting: Taraji P. Hensen was very good, but I'm not disappointed she didn't receive a best actress nomination. Janelle Monae was fine, but I still want her in more movies to see if she has a bit more range. I'm surprised Octavia Spencer was nominated for supporting actress, and she didn't even really do anything. She didn't have much of an Oscar scene and a very limited role in the entire film. I wouldn't say Monae deserves the nomination over her though, as Hensen was the main focus and had the largest role. Kevin Costner was a good pick for his role, and Jim Parsons was good. He basically acted like a calmer, less-funny, racist Sheldon from Big Bang Theory, but he was convincing enough. Plot: The movie is pretty by-the-numbers, not doing much to stand out. A movie like Jackie would definitely stay in my head longer than Hidden Figures. The cinematography is fine, the screenplay is fine; almost everything in this movie is simply \"fine.\" They didn't do anything wrong throughout, but nothing really new happened. I was afraid it would feel like a TV movie, as the trailers depicted it. At times it felt a bit reminiscent of a TV movie, but it definitely felt like a real, best-picture nomination deserving movie.Overall, Hidden Figures is a relatively simple movie that is worth your time, but don't expect it to be talked about or remembered too clearly in a few years.",
            "review_date": "2017-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've enjoyed all the oscar nominated films - but this film stands out as the clear winner. A cracking story, with laugh out loud humour, it fills the heart & reminds us of those who have achieved so much with so little recognition. DON'T MISS IT!",
            "review_date": "2017-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love intelligence, resilient women, and astronauts. I also am a woman working for a tech company, so I knew going into this that I would enjoy it. I had to actively tell myself to not let me love for Taraji P Henson blur my opinion of thisI love intelligence, resilient women, and astronauts. I also am a woman working for a tech company, so I knew going into this that I would enjoy it. I had to actively tell myself to not let me love for Taraji P Henson blur my opinion of this movie, but in the end, it was just a joy to watch. It was a classic, I laughed, I cried, I found myself fearing for John Glenn’s life even though I knew how that would work out (history, obviously). I worried the idea of Kevin Costner in ANOTHER “coach” type role would bore me, but it didn’t. I worried that Jim Parson’s only has one tone, and he does. But that was fine, because it all just worked, and was a true feel good film that felt perfectly relevant, even despite the time period. 9/10",
            "review_date": "2017-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Everything felt too fast-tracked and the only one we really focused on was Catherine, the others being just cameo or short sections focusing on them. That is the reason why this didn't receive a complete 10 from me. Otherwise, this was anEverything felt too fast-tracked and the only one we really focused on was Catherine, the others being just cameo or short sections focusing on them. That is the reason why this didn't receive a complete 10 from me. Otherwise, this was an awesome movie, impressive!",
            "review_date": "2017-03-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have only raves about this movie. I have waited a few days to write a review since I watched it mostly because I knew I would write a book if I didn’t. This movie touched me in so many ways, and it made me feel like I could touch the moon.I have only raves about this movie. I have waited a few days to write a review since I watched it mostly because I knew I would write a book if I didn’t. This movie touched me in so many ways, and it made me feel like I could touch the moon. Being a woman in the business world, even today there are struggles we face, I couldn’t imagine having been an African American woman in the 60’s trying to get to the top. From the cast to the movie itself, everything was stellar, and probably the best movie I will see all year.The story centers around Katherine Johnson, Dorothy Vaughn, and Mary Jackson; three African American women working at NASA, all with dreams of their own. Katherine is an amazing mathematician, Dorothy has dreams of being a supervisor, and Mary wants to be an engineer. Individually, they face seemingly impossible stepping stones in order to get to where they want to be. One by one, they start to see their dreams unfold before their eyes, all while watching the world change around them.I found myself relating so much to Taraji P. Henson’s character so much. With my profound love for math, I know what it feels like to be a woman in a man’s world, the story touched me and made me have a different level of respect for this woman. Janelle Monae’s character Mary was a driven woman who would do whatever it took to reach her dream. She went before the court and had the most inspiring quote of the whole movie, which is the quote I used at the beginning of my review. We all know Octavia Simpson only plays characters who are as strong and beautiful as she is, her story touched me mostly because she never gave up, and she never let failure or a hard road dampen her dreams. These women are all someone I think we can aspire to be.The rest of the cast included Kevin Costner, Kirsten Dunst, Jim Parsons, Glen Powell, and so many more amazing actors. They all give stellar performances. The entire cast couldn’t have been chosen better. The film stuck to the original story and the facts very well, which I appreciated. It’s always good to enjoy a film, and learn a little bit about history as well. There’s just something about a movie that makes you feel good and knowing that it’s all true. It gives you hope that the world isn’t as bad as you think it is.I know I didn’t go too deep into the story with this one, but its all facts. You can read the book, you can look it up. Just know that this movie will make you laugh, it will make you cry, it will make you feel good, and it will give you hope. It’s a movie you can take the whole family to. I promise you won’t regret seeing this, and even if you have to pat $15, its worth it. If for nothing else, the acting is the best you’ll see in a film all year.",
            "review_date": "2017-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was great in many ways. The actors were amazing, they felt like the real people! They also told a part of history not many people knew about, which is great for the story. Also, the movie was powerful and got it's message out. TheThis movie was great in many ways. The actors were amazing, they felt like the real people! They also told a part of history not many people knew about, which is great for the story. Also, the movie was powerful and got it's message out. The only negative thing is that they dragged out the ending a little. I would say for sure watch as I think it was amazing and more people should know the story.",
            "review_date": "2017-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Conventional Oscar-baity storytelling? Yes.Borderline generic soundtrack? Yes.Jim Parsons in a movie above and beyond him? Yes.\n\nThen why the hell am I giving this movie 4 stars, you may ask... Well, for starters it is Oscar-baity but in aConventional Oscar-baity storytelling? Yes.Borderline generic soundtrack? Yes.Jim Parsons in a movie above and beyond him? Yes.Then why the hell am I giving this movie 4 stars, you may ask... Well, for starters it is Oscar-baity but in a Forrest Gump way, not in a The Birth of a Nation way.Yes, Jim Parsons is in this, but he's the perfect typecast for intellectual **** This and all other casting choices were perfect. I didn't care too much for Mahershala Ali's storyline but it wasn't bad.Overall, an extremely compelling story driven by extraordinary performances makes this movie great.I was extremely skeptical about this movie, and it knocked me off my feet.PS: Kevin Costner lives to play 60s characters. The director rejected Spiderman to direct this, watch out for this guy. The cinematography was amateur, several shots were slightly unfocused for no apparent reason, if not for this, I would've given it 4.5 stars.",
            "review_date": "2017-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nHidden Figures shines light on an important story that needed to be document centuries ago (apparently).I have to say this film is wildly overrated and is only being nominated for the facts that it has Black women as the main characters and while thats \"groundbreaking\" and is a positive message that alone doesn't decide the grade of the film Hidden Figures like most race specific movies it tended to play on that.For the most part when I tried to keep awake the story was portrayed masterfully but the acting seemed shotty and typical for their roles some of scenes had pacing issues but in all the movie is completed well its just indistinguishable between historic movies.",
            "review_date": "2017-03-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a great movie… but… you do perceive you’re being manipulated by the biased, radical left agendas of the Hollywood elite – which you are.  It’s all too evident.  Many of the scenes have been embellished to promote those agendas, and doThis is a great movie… but… you do perceive you’re being manipulated by the biased, radical left agendas of the Hollywood elite – which you are.  It’s all too evident.  Many of the scenes have been embellished to promote those agendas, and do not reflect historical truth (see Wikipedia discussion), such as the “colored bathroom sign” scene, and the “control room scene,” in which they invite Katherine in to observe the launch.  While, the racial and gender biases portrayed, obviously did exist in the 50’s & 60’s in some parts of the country, some were natural extensions of the societies that existed at the time (e.g. state of natural families and the roles of the members (fathers and mothers) of those families, gender roles of the time, etc.).  However, if you can get past the manipulation… it is a great movie… and… it does tell a bit of history… which, previously appears to have been ignored.",
            "review_date": "2017-06-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is great. I knew it would be good, but I was so happy after watching that I had to own it and the book. I loved the dynamic between the three women. They were really fun to watch on screen. Whenever I thought of doing that kind ofThis movie is great. I knew it would be good, but I was so happy after watching that I had to own it and the book. I loved the dynamic between the three women. They were really fun to watch on screen. Whenever I thought of doing that kind of math without modern calculators, I felt even for respect for Katherine. I'm glad that the romance didn't take over the plot. It was nice as a subplot. Anyone who is thinking about seeing this movie should. It is amazing.",
            "review_date": "2017-07-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a wonderful movie. It tells a fascinating story and tells it well. These three women rise above the racial and gender discrimination of the time to do a service to their country and its manned space program. The performances areThis is a wonderful movie. It tells a fascinating story and tells it well. These three women rise above the racial and gender discrimination of the time to do a service to their country and its manned space program. The performances are uniformly excellent and make the characters seem like real people, not symbols.I am old enough to remember how the Shepard and Glenn Mercury flights ended, but I still felt a sense of tension around their depiction.",
            "review_date": "2017-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lord, let us give thanks for the miracle you have given us in your infinite wisdom, generosity, and mercy. Lord, thank you for blessing the world with Janelle Monae and her wide range of talents. For convincing her to act and pursue a careerLord, let us give thanks for the miracle you have given us in your infinite wisdom, generosity, and mercy. Lord, thank you for blessing the world with Janelle Monae and her wide range of talents. For convincing her to act and pursue a career in Hollywood, we are unworthy of your bounty Lord, for we are but simple sinners, doomed to be imperfect. Yet, you have graced us with the sole being of perfection among us and for that, we are eternally grateful. Amen.Aside from Monae though, Hidden Figures is a pretty simple story. Telling the real life story of the black women who helped to put a man in orbit and land on the moon, it is an inspirational feel good story that is by-the-numbers. Shoving the story of these women into the feel good biopic cliches, Hidden Figures loses some of its impact as a result. Fortunately, feel good movies are always going to leave you with a goofy smile on your face after watching it and Hidden Figures fits the bill there. That said, do not expect it to be different from any other inspirational biopic you have ever seen.Blending in some light comedy to brighten the racial tensions of the story, the film actually does a solid job showing the racism the girls face working for NASA. The film really defines the racism in looks with the girls being stared down upon entering any room. Co-workers assume they cannot handle the work, only to be shown that they can. Yet, first impressions often define treatment and the women of Hidden Figures are never treated perfectly by co-workers. That said, as a PG-rated move, there are n-bombs here, which leaves the film to resort to subtle racism. Honestly, this works better for a film of this type as, by 1961, the tides were turning enough to force people to not be so overt and brash with their racism in the workplace. Hidden Figures really captures this with things still labeled as being for \"coloreds\" or the girls being excluded even when they should be filled in on the information. The film takes the same approach to sexism with people expressing obvious sexist thoughts that they are taken aback to learn are sexist. Towards the end of the film, Vivian Mitchell (Kirsten Dunst) tells Dorothy Vaughan (Octavia Spencer) that she is not racist to which Dorothy tells her that she believes she thinks that is true about her, highlighting the subtly of the film with racism and sexist thoughts. The film clearly tries to bring them to the surface and does, but the racist and sexist actions of characters in the film are often done simply because it was the way things were and colored people or women doing these things was completely unprecedented.However, while the film largely handles the racism elements over it, it cannot help but burst into bombastic monologues about the ills of racism and the importance of overcoming it. These monologues are largely done by Katharine Johnson (Taraji P. Henson) and Al Harrison (Kevin Costner). The director of the Space Task Group, Harrison lets the racism occur until Katharine informs him about it, at which point he puts an end to it. Clearly seen as a white savior of sorts for Katharine in particular, Harrison repeatedly makes large displays of inclusion, yet still excludes Katharine and kicks her out at the request of his superiors, in spite of her talents. He makes the most attempts of anybody to include her, but clearly does so begrudgingly. This does not stop the film, however, from using his character as a white savior to lend a helping hand to the disenfranchised among us. Returning to the original purpose of this paragraph, the film may do a good job at crafting the air of racism and sexism around of every turn. However, it lacks the subtly in its dialogue given to its black characters to really pull it off. As a result, the film plays out with Katharine just telling people off left and right. While she is correct and free to express her thoughts, it feels to in your face and overt. Maybe she was like, I do not know, but as a film, there are ways to show her fight back and prove them wrong without having to jump up in their face to do so.Of course, these emotional monologues only further serve to make the film feel conventional. What good is a feel good and inspirational film without moving speeches by the oppressed? Regardless of whether the real women were like this, the characters in the film are pigeon holed into a palatable package that will not offend white people like slave dramas often do. Instead, these stock characters allow white audiences to largely look past their race and have a good time anyways, even if all the white characters are portrayed as the evildoers they potentially were to some degree. That said, the rise, the breakthrough, the challenge at the end, the fall, and then the final ascension to praise, are all tried and true inspirational feel good biopic cliches. Director Theodore Melfi ensures that this film hits each beat on the nose.",
            "review_date": "2017-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fifty-six years ago, the first Black women came to work at NASA, a milestone during a time that in a way appears similar to our modern-day culture. Maybe there are no more Jim Crow segregation laws, but we still see Civil Rights protests byFifty-six years ago, the first Black women came to work at NASA, a milestone during a time that in a way appears similar to our modern-day culture. Maybe there are no more Jim Crow segregation laws, but we still see Civil Rights protests by angry citizens flaunting picket signs, gender discrimination in the workforce, and consistent scientific breakthroughs from widely respected corporations. You might believe me when I say how very little has changed since then, as we are ultimately guilty of repeating the same mistakes, which the newest biopic, Hidden Figures, subtly proves to us.​It churns your stomach to remember the function of class relations in 1961: all colored people by law could only touch specially separated computers, bathrooms, and coffee stations labeled, “colored.” The police also had the privilege to escort a Negro out of the library for setting foot in the “White” section. Unbelievably, these rules to living were active not too long ago. Yet these circumstances allow the delivery of an uplifting true story about man’s historical progression and future potential.Three ladies of color are seen beside a nonfunctioning car in the Virginia countryside. So who else would come to ruin their day other than a stubborn police officer? It looks like a deep pit of doom until they suddenly get the car functioning again, and successfully convince the officer to escort them to their jobs at  NASA.One is sent to the other “colored” workers in a separate room from the rest of the campus, one is left to work in the testing facility where the other men bully her, and one gets the worst of it—she spends day and night working behind a desk, ruthlessly mistreated by everybody else. Her incredible knowledge in analytical geometry makes little difference; she still gets deliberately discriminated by her coworkers, and has no other options other than to race half a mile across campus to the nearest “colored” bathroom whenever she needs to relieve herself.The cast and crew’s hard work results in a loyal adaptation, both to the true story and to the Margot Lee Shetterly book it’s based on. Educational facilities everywhere will benefit from its survey of the cultural influence on NASA during its early efforts of launching man into space. If that’s not a landmark event in societal progression worth telling, then I don’t know what is.Although beside the meticulous recreation of the Civil Rights era’s segregation, the overall period setting offers nothing new to the cinematic experience. Director Theodore Melfi’s direction brims in the epitome of generic: creating too squeaky-clean of an atmosphere in order to be the sole “family-friendly” Oscar buzz movie. The bright colors and made-for-television sets do not recreate the sickening feel of the era it attempts to establish. Although the period does get needed justice by showing a series of news footage from the time, the slightly-off-focus cinematography fails to craft the feel of immersion.The shifts in tone and character may feel a bit too sudden to produce any further realism in the environment, the overwhelmingly masculine society triggers a series of intriguing tests onto the three women. At home, one of them must act as both mommy and daddy to her three daughters, adding to her already boiling pressure. The challenges on and off the job never seem to quit, and the remarkable chemistry between the three leading ladies: Taraji P. Henson, Octavia Spencer, and Janelle Monáe, halt any dull moments. Henson particularly deserves special recognition in her portrayal of an independent woman we want to succeed; her transparent discomfort comes across as all the White workers stop and stare at the color of her skin.While a picture about the Civil Rights era probably didn’t need to dwindle its content down to a profitable PG-rating, the job still triumphs based on the difficult subject the cast and crew had to handle. In light of recent memories we have succumbed to throughout 2016, all of us: man and woman, dark or light, millennial and baby boomer, ought to use a high quality feel-good drama to look toward a brighter 2017.",
            "review_date": "2017-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the early days of NASA, black women were employed as \"computers\" to help calculate the complicated math involved in space flight. This film tells the amazing story of 3 of these exceptional women (played by Octavia Spencer, Taraji P.In the early days of NASA, black women were employed as \"computers\" to help calculate the complicated math involved in space flight. This film tells the amazing story of 3 of these exceptional women (played by Octavia Spencer, Taraji P. Henson, Janelle Monáe). The spunky script peppers the continuous indignities and inequities that are heaped upon them with humor that adds warmth and humanity. Their performances are all winning. This film is fascinating in its exploration the early history of our space program, but it also delves into the discrimination against these women in an easy to swallow, entertaining package. A few snappy songs by Pherrell Williams adds even more verve.",
            "review_date": "2017-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Based on true events because that's always a real crowd pleaser these days and this is no exception. Starring Taraji P. Henson, Octavia Spencer, Janelle Monáe who are owning every scene. Also starring an agitated Kevin Costner who spends aBased on true events because that's always a real crowd pleaser these days and this is no exception. Starring Taraji P. Henson, Octavia Spencer, Janelle Monáe who are owning every scene. Also starring an agitated Kevin Costner who spends a good portion of the movie standing around chewing gum. But who cares about him, this movie is all about the women and the incredible work they did for NASA. The movie reels you in from the moment it starts, doesn't go over the top and keeps you invested in this extraordinary story. It's inspiring, it's funny and you'll definitely enjoy it. Recommended.",
            "review_date": "2017-01-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's absolutely charming. A movie that shows how deeply dependent we are with our past, because it unfortunately still makes sense in the present and who knows... the future.",
            "review_date": "2017-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome.  This is a fun, interesting and enjoyable movie to watch. Bring a friend, grab a bucket of popcorn and put your smile on. You will have fun and it is money well spent!",
            "review_date": "2017-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures tells the real but unheralded story of three mathematicians, Katherine Goble Johnson (Taraji P. Henson), Dorothy Vaughan (Octavia Spencer) and Mary Jackson (Janelle Monae), whose work at the US Space Agency, NASA contributedHidden Figures tells the real but unheralded story of three mathematicians, Katherine Goble Johnson (Taraji P. Henson), Dorothy Vaughan (Octavia Spencer) and Mary Jackson (Janelle Monae), whose work at the US Space Agency, NASA contributed significantly, to the success of America's space programme. The movie documents the struggles Johnson, Vaughan and Jackson had to go through in segregated America, compounded by discrimination against women, to get ahead in their chosen fields; Johnson, with a special mathematical talent, Vaughan with computing know-how and Jackson, a mathematician aspiring to be an Engineer. The story largely centres on Katherine Goble Johnson but Taraji P. Henson's portrayal does not quite drive the movie, only picking up at two points, when her character dramatically confronts Al Harrison (Kevin Costner) her boss at the NASA Division where she works, over segregation and a particularly symphonic scene where she engages in solving a complex mathematical problem on a chalk board. It is three members of the supporting cast that keep this movie humming along very nicely, for its duration; Costner who puts in an effortless performance as Al Harrison, director of the Space Task Group assigned the responsibility of putting a man into orbit, Janelle Monae who deserves applause for her virtuoso performance as Mary Jackson and Academy Award Winner, Octavia Spencer (The Help), present as a reassuring, steadying hand. This is a beautifully filmed movie with an engaging story.",
            "review_date": "2017-02-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "a great film with big purposes. It may be slow at some places but the music makes up for it. The soundtrack is amazing. A story that needed to be told, great work.",
            "review_date": "2017-06-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A brilliant insight into a time of segregation and the those who fought to over come it while striving to pushing the boundaries of human exploration.",
            "review_date": "2017-01-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a story worth telling and worth knowing.  At a time when mean-spirited hatred and bigotry are in danger of being normalized again, I hope every person in the U.S. sees this movie as a reminder that government, \"the establishment,\" andThis is a story worth telling and worth knowing.  At a time when mean-spirited hatred and bigotry are in danger of being normalized again, I hope every person in the U.S. sees this movie as a reminder that government, \"the establishment,\" and conservative white males don't have all the answers.  Never have.  Never will.  Every person needs and deserves to be honored and included.",
            "review_date": "2017-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Saw Hidden Figures at the AMC Southdale.  Positive, fun, uplifting.  Glad I saw it once, and would enjoy seeing it a second time. I enjoy going to the theater and learning about history.",
            "review_date": "2017-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved this movie it was spot on with the rich history of 3 plus more brave women of color.  Just go see the movie I really don't come one metacritic to give reviews but I decided this movie should get more credit than it deserves it wasI loved this movie it was spot on with the rich history of 3 plus more brave women of color.  Just go see the movie I really don't come one metacritic to give reviews but I decided this movie should get more credit than it deserves it was really good and RIP to Glean Armstrong, I didn't know that he trusted these brave women of color to get him into space and land with their math calculations which helped in getting NASA into the next century. Please give this moive and Oscar and Golden Glob. It's a must see for everyone. I took notes during the movie. Also Ms. Johnson has a building named after her that's rare for a woman of color even her friends ran the IBM department and help develop the heat shield to protect the astronauts coming back from orbit.  10/10 for me",
            "review_date": "2017-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When you watch a movie based on true events that you watched when it was happening and know the ending it takes a good director, Theodore Melfi, good screenwriters, Allison Schroeder and Theodore Melfi, to get you caught up in the eventsWhen you watch a movie based on true events that you watched when it was happening and know the ending it takes a good director, Theodore Melfi, good screenwriters, Allison Schroeder and Theodore Melfi, to get you caught up in the events being  shown on the screen and \"Hidden Figures\" is such a movie.There is also another part to the film that has a tag line \"the untold true story\" and that is a story most people, Black and White, don't know about. The film takes place in months leading up to John Glenn (played by Glen Powell) who figures importantly in this film aside from being an astronaut and racism is still ingrained in the American consciousness. The latter is shown in small and large ways, each effective, whether it is a woman having to run a half a mile to go to the 'colored women's bathroom\" even though she is capable and does help NASA solve many problems to get men in orbit around the world and get them back safely.Taraji P. Henson is real life Katherine Goble Johnson, a mathematical genius, who knows 'her place' and is insulted not only by words but by actions. She is only one woman of two in an office of a dozen men and she is Black having to put up with some indignities to do a job she loves, wants to keep, but when she reaches a point that she has had enough she is not afraid to open her mouth.The other woman in the office, the group's executive assistant played by Kimberly is not welcoming and the head engineer, played by Jim Parsons, first has no respect for Katherine and then disdain only to question the knowledge she gives that is more accurate than his. The only one who doesn't care about her sex or color but her much needed knowledge is her boss Al Harrison, played believably by Kevin Costner.There are other people in Katherine's life aside from her 3 children whose husband/father is dead, her mother and, about half way through, a very romantic army officer Mahershala Ali but two others, her best friends, also faces racism because of being Black, though very smart accomplished women. Dorothy Vaughan, played by a strong Octavia Spencer, is in charge of the West Computing Group, as they are referred to, made up of Black women which segregates them from the White women in the East Computing Group. She does the work and puts in the time that a supervisor does but she isn't given the title and certainly not the pay. She delivers a put down with a smile that hides her pain but tells the truth.The third woman is Mary Jackson, played by a saucy, smart Janelle Monae, who wants to be an engineer but, due to Virginia laws, is not allowed to attend the classes she needs to get the degree. (Ah Virginia, the State that is also the basis for the movie \"Loving\" and tells  another true story about that State's laws.) She has a husband, played by Aldis Hodge, who hesitates in backing her but has a Polish-Jewish refugee, played by Olek Krupa, from the concentration camps, who is all for her going for her dream.Based on the nonfiction book by Margot Lee Shetterly one doesn't know how much of the script by Schroeder and Melfi was \"Hollywoodized\" but a lot of it rings true and the production designs by Wynn Thomas and the costumes designed by Renee Ehrlich Kalfus certainly reflect the era.The acting by all is first rate but Taraji P. Henson, Octavia Spencer and Janelle Monae give powerful performances showing how strong and accomplished Katherine, Dorothy and Mary were, the indignities they suffered and how just by being themselves they are role models for all of us.\"Hidden Figures\" has two story lines intertwined and as exciting as the race to the moon became the true story of what these three smart women had to go through because of their color was more interesting as the former was familiar to me while the latter was a learning experience about these women I knew nothing about and everyone should.",
            "review_date": "2017-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very enjoyable movie about three pioneering black women in rocket science, and how they went from being descriminated to being among the masterminds of NASA. The chemistry between Taraji Henson, Janelle Monae, and Octavia Spencer isA very enjoyable movie about three pioneering black women in rocket science, and how they went from being descriminated to being among the masterminds of NASA. The chemistry between Taraji Henson, Janelle Monae, and Octavia Spencer is undeniably sharp and warm, and the storyline is very well crafted and nicely directed. Once again, a VERY enjoyable movie, very inspiring. A must-watch!",
            "review_date": "2017-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am not a huge fan of science movies or math movies, or any mix of the two with history, so going into this movie I was not expecting much, but I was SO wrong. This movie is not some boring documentary on NASA that you show on a rainy day inI am not a huge fan of science movies or math movies, or any mix of the two with history, so going into this movie I was not expecting much, but I was SO wrong. This movie is not some boring documentary on NASA that you show on a rainy day in elementary school, it's a power important movie that I strongly suggest seeing. Starting off with the acting, we have great performances by Taraji P. Henson, Janelle Monae, and Octavia Spencer. The bond between these ladies feels so authentic and real.. It really felt like they were good friends who've known each other for years. We also have the plot, which without spoiling is about African American Women who did phenomenal work at NASA but were not given the credit they deserve due to the color of their skin. It's a sad thing to watch because you just want them to get awarded for their amazing work and you can't help but root for these ladies. There are really nice moments in this movie that make you want to cheer, but some that make you want to boo and cry. It's so sad to think that this type of injustice was so regular back just a few decades ago. It not only tackles racism but also sexism, these ladies were not only mistreated for their skin but also for their gender. You just can't help but wish the best for these ladies and I really loved rooting for them throughout the film. The only thing that I have to say negatively about this film is the backstory of the ladies could be a bit more shown. I would of liked to see a little less scenes of the equations and a little more of the main character's, Katherine Johnson, Love Life and kids, as well as the other ladies a bit more. I would like to see or learn how they really became good friends and why those 3 in particular became so close. This is not a movie that you show on a rainy day in science class, this is a remarkable film that you should take your kids to go see right now to teach them the lesson of equal treatment and how to award people no matter what gender or skin color they are.",
            "review_date": "2017-01-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "High quality docudrama of the convergence of two of the outstanding achievements of the 1960's; mastery of space exploration technology AND Americans of Color rising on their heretofore suppressed and ignored first rate talents and making theHigh quality docudrama of the convergence of two of the outstanding achievements of the 1960's; mastery of space exploration technology AND Americans of Color rising on their heretofore suppressed and ignored first rate talents and making the crucial difference between glory and ignominy in the still fragile Space Program. An all American Movie Recreation of extraordinary people over coming extraordinary resistance and not so quiet bigotry to create an America capable of reaching for the stars,",
            "review_date": "2017-01-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“Hidden Figures” stars Taraji P. Henson,  Octavia Spencer and Janelle Monde portraying three African American ladies  of unusual skills and talent who became indispensable computer-members of the team that helped bring our country into the“Hidden Figures” stars Taraji P. Henson,  Octavia Spencer and Janelle Monde portraying three African American ladies  of unusual skills and talent who became indispensable computer-members of the team that helped bring our country into the space age and, in particular, the safe orbit and return of Astronaut John Glenn. Also starring Kevin Costner, the film is based on the book by Margo Lee Shetterly with a noteworthy screenplay co-written by director Theodore Melfi and Allison Schroeder. This movie describes the abuses and mental hardships that these ladies had to undergo, endure and ultimately overcome while tending to the task of aiding their country in its time of need. Set in the early 1960’s against the background of Reverend King and the others who were fighting for civil rights, the film brings home the plight of this victimized minority when even using a coffeemaker or restroom in the NASA compound became an issue. Yet, throughout all of these indignities and humiliations, these women persevered and performed above and beyond all expectations even surpassing at times the supposedly talented white engineers and the newly introduced IBM computer that NASA was so heavily relying upon. Perhaps the view of two elderly African American ladies with their young granddaughters sitting in the row in front of me in the theater made me realize how significant and important this film is because it showed us all, including those little girls seated in front of me, how tenacity, talent and dignity can conquer adversity and help those with such qualities achieve the accolades and acknowledgments properly due them.   When one sees a film about the Holocaust, the question often arises as to how many great minds were lost in this mass horror. This film, in its own way, likewise poses the question as to how many great minds were lost or forsaken in the name of prejudice and hate. I recommend this film to persons of every color and gender because it is inspiring and informative and well deserving of an 8.0 rating.",
            "review_date": "2017-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved this movie. It combines the NASA space program, something for the United States to be so proud of, with the Civil Rights Movement, one of the darkest times in US history. The story is beautifully told and the three women who star inI loved this movie. It combines the NASA space program, something for the United States to be so proud of, with the Civil Rights Movement, one of the darkest times in US history. The story is beautifully told and the three women who star in the movie were brilliant.",
            "review_date": "2017-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My mother and I had tears in our eyes while watching the movie about the good old days - not. Having grown up in the South, but moved to the North , I had forgotten about segregation of bathrooms, etc.   This also shows the chillingMy mother and I had tears in our eyes while watching the movie about the good old days - not. Having grown up in the South, but moved to the North , I had forgotten about segregation of bathrooms, etc.   This also shows the chilling experience of being the only woman in a male dominated field.  These days are so much better in every way.  Hard to believe we went to space on the backs of human calculators. The wind tunnel scene typical of the way Negros were treated in the good old days that we are going back to.",
            "review_date": "2017-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a very enjoyable film about three talented and heroic black women in mathematics who were instrumental in the space program.  It is well written, the music by Pharrell Williams is effective and fits the period, and the plot movesThis is a very enjoyable film about three talented and heroic black women in mathematics who were instrumental in the space program.  It is well written, the music by Pharrell Williams is effective and fits the period, and the plot moves forward at a brisk pace.  The acting is also very good, particularly Octavia Spencer's turn as an underpaid supervisor.  If this influences more young black women into going into the sciences, so much the better.  There's nothing wrong with a crowd pleaser.",
            "review_date": "2017-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden figures is truly an inspiring and eye opening film. Not only did these women really exist, they did remarkable things in a time where the World would not recognize their contribution. Despite some very typical movie tropes this film isHidden figures is truly an inspiring and eye opening film. Not only did these women really exist, they did remarkable things in a time where the World would not recognize their contribution. Despite some very typical movie tropes this film is well made and well deserving of the critical praise it is receiving.",
            "review_date": "2017-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Hidden Figures\"? It is a nicely paced, warm and fuzzy, uplifting story with outstanding performances, especially from Janelle Monae. This isn't quite classic. It sometimes has the feel of a made-for-TV movie. But in spite of the few hiccups,\"Hidden Figures\"? It is a nicely paced, warm and fuzzy, uplifting story with outstanding performances, especially from Janelle Monae. This isn't quite classic. It sometimes has the feel of a made-for-TV movie. But in spite of the few hiccups, the history lesson, alone, is worth the price of admission. In a year that really wasn't that great, artistically, I think \"Hidden Figures\" is the best movie of the year.",
            "review_date": "2017-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very inspiring. Also very much a walk down memory lane. Watching the movie it was easy to forget the cast was star studded. The most surreal thing about watching this movie, in a very small town in Texas, was the entire theater applauding andVery inspiring. Also very much a walk down memory lane. Watching the movie it was easy to forget the cast was star studded. The most surreal thing about watching this movie, in a very small town in Texas, was the entire theater applauding and cheering when the women stood up for themselves. The rampant applause and cheers included a rather large contingent of younger people whom obviously do not get the full significance of those historical moments. It was truly a pleasure to watch, and to see the reaction of the rest of the theater. MAYBE this can help inspire a new generation to make personal choices to help bring change in peaceful ways, for all Americans to follow.",
            "review_date": "2017-01-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A well-meaning crowd-pleaser, with nice performances and a truly exceptional true story running things, that never chooses to rise above its safely formulaic Hollywood trappings.I found this movie's depictions of such clearly bigoted whiteA well-meaning crowd-pleaser, with nice performances and a truly exceptional true story running things, that never chooses to rise above its safely formulaic Hollywood trappings.I found this movie's depictions of such clearly bigoted white people and their Civil Rights era forms of racism (colored bathrooms and coffee pots) that never really digs into the more insidious nature of institutional racism, to be problematic. This overtly racist world feels so far removed that it almost makes it seem like racism has been solved, that it's no longer an issue.All you have to do is be exceptional, a once in a lifetime genius, and racism won't be able to stand in your way. It suggests that black people do have to work harder and be superior in an obvious way in order to overcome, and this is never addressed in the movie. Don't be common, no one can help you then.",
            "review_date": "2017-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like movies that are based on facts, historical events and figures, then you will like this as I did. I gave it a resounding 10 because it did well in reenacting the vital contributions made by 3 female Mathematicians towards the \"RaceIf you like movies that are based on facts, historical events and figures, then you will like this as I did. I gave it a resounding 10 because it did well in reenacting the vital contributions made by 3 female Mathematicians towards the \"Race to Space\" time period. It also did well in demonstrating the institutional racism the mathematicians faced as employees of a federal agency in a newly segregated era. There were times I laughed, and cried-sometimes at the same time. Great writing, great acting, great movie.",
            "review_date": "2017-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "'Hidden Figures' is a top film for 2016 and well deserved for an Oscar nomination for Best Picture. Based on real events, the film is a historical drama the takes liberties with some of the actual facts, particular the timeline of the events,'Hidden Figures' is a top film for 2016 and well deserved for an Oscar nomination for Best Picture. Based on real events, the film is a historical drama the takes liberties with some of the actual facts, particular the timeline of the events, but makes up for this by concentrated on a greater story of a 1960's America that has been sadly neglected. The film gives us the experiences of 3 very bright African-American woman who must deal with mid-20th century racism, sexism, and segregation while employed as 'computers' (human math calculators) before the age of electronic computers for the agency soon to be known as NASA.  Working far below their abilities, the three main characters provide the key work for the launch of America's first successful man-in-space flight.There were several excellent films released in 2016, but so far, there is only one that satisfies the Academy Award requirement for a film that will be historically timeless. That film is 'Hidden Figures', a film that will be remembered long after the other contenders are forgotten.",
            "review_date": "2017-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is such an enjoyable movie.  The three actresses who play the NASA geniuses are excellent.  Each one of them is fighting a personal battle in a timeframe jjst a couple of hears before the Civil Rights Act was passed.  As African AmericanThis is such an enjoyable movie.  The three actresses who play the NASA geniuses are excellent.  Each one of them is fighting a personal battle in a timeframe jjst a couple of hears before the Civil Rights Act was passed.  As African American women, they are held back in many different ways.  One woman has to run a half-mile just to use a bathroom that is designated for \"coloreds\".  Watching this movie, it is often hard to believe that the U.S. was like this back then.  Also, seeing their part in the early stages of NASA's space program is a story I have never heard.  It is fascinating and uplifting.  This is a movie everyone can enjoy.  Highly recommend it!",
            "review_date": "2017-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Starring: Octavia Spencer, Janelle Monáe, Taraji P. HensonGenre: Drama Director: Theodore Melfi Run time: 127 mins Theodore Melfi’s Hidden Figures, based on the book by Margot Lee Shetterly, tells the story of Katherine Johnson’s lifeStarring: Octavia Spencer, Janelle Monáe, Taraji P. HensonGenre: Drama Director: Theodore Melfi Run time: 127 mins Theodore Melfi’s Hidden Figures, based on the book by Margot Lee Shetterly, tells the story of Katherine Johnson’s life through some of the worst times in 1960s segregated America. It was during this time of social unrest, social inequality for the black community, and for women, that Johnson helped break through the glass ceiling into the stratosphere.Hidden Figures follows the interwoven accounts of Dorothy Vaughan, played by Octavia Spencer, Mary Jackson, played by Janelle Monáe, and Katherine Johnson, played by Taraji P. Henson – three African-American women who participated in some of NASA's greatest successes.   Johnson’s work for NASA was pivotal in helping to win the space race to get man to the moon, after the US lost the race with the Soviets to get the first rocket to space and then lost again in getting the first man up there.Johnson was selected to move integration forward at the graduate programme at the then all-white West Virginia University.  Johnson taught mathematics, French, and music in public schools in Virginia, until 1952, when a family member told her about a job opening at the National Advisory Committee for Aeronautics at the Langley Aeronautical Laboratory.Johnson co-authored the 1960 report: Determination of Azimuth Angle at Burnout for Placing a Satellite Over a Selected Earth Position, a report containing equations describing the trajectories for placing manned mercury capsules into low-earth orbit and returning it safely to the planet's surface. This made Johnson the first credited female author in the flight division.Hidden Figures picks up story when Johnson was known as one of the ‘computers who wear skirts’, a division within N.A.S.A that calculate complicated sums, during a period of time before advanced computers. Among these problem solvers were a group of exceptionally talented African-American women, some of the brightest minds of their generation.  This didactic tale couldn’t come at a more important time, with divisive political movements threatening to build walls and close borders.  Hidden Figures has an important message quoted from Kevin Costner’s character, Al Harrison: “A rising tide lifts all boats.” Costner’s character is always looking for the bigger picture: the mathematical breakthrough to give America the edge, an equation that didn’t exist yet.  The answer, however, came from a formula that was always in front of them, they just couldn’t see its value. Ends...",
            "review_date": "2017-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good, but not great.  One thing I have to mention is that this movie was NOT in wide release in Canada, so I had to find it at a different theatre than my local Cineplex.  Because I had heard so much about it, perhaps my expectations were aGood, but not great.  One thing I have to mention is that this movie was NOT in wide release in Canada, so I had to find it at a different theatre than my local Cineplex.  Because I had heard so much about it, perhaps my expectations were a little too high - I was disappointed at how pedestrian it was.  Humour thrown in for the sake of humour and a romance that was completely unnecessary.  Of the Oscar contenders I saw throughout the year, it wasn't the best film, however it has momentum only because of the Trump effect.",
            "review_date": "2017-02-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "boring characters who don't get challenged and every one just is to smart for the math problems and interesting storytelling",
            "review_date": "2018-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie tells an effective story, but is uninteresting visually and has quite a few weak performances, along with some subpar dialogue. The film's cast gives quite weak performances, particularly Henson, who the movie seems to hold up as aThe movie tells an effective story, but is uninteresting visually and has quite a few weak performances, along with some subpar dialogue. The film's cast gives quite weak performances, particularly Henson, who the movie seems to hold up as a much better actor than she is in reality, bar Costner and Spencer, who both give solid performances. The movie could have been great with an improved script and a revamped cast. Though for all it's flaws the movie works decently as a feel good movie.",
            "review_date": "2017-12-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the arc of history you do not often see an underprivileged group shatter multiple glass ceilings. The incredibly brave women of Hidden Figures do exactly this. As African Americans, they shatter the barrier of entry to the hallowed hallsIn the arc of history you do not often see an underprivileged group shatter multiple glass ceilings. The incredibly brave women of Hidden Figures do exactly this. As African Americans, they shatter the barrier of entry to the hallowed halls of NASA, one of the crown jewels of the military industrial complex. As women they shatter the boys club of aerospace and rockets, where females were generally relegated to secretarial or clerical roles. Again as women, they shatter the upper echelons of scientific cliques, where many advanced subjects and challenges were deemed too difficult for females to undertake. This story needs to be told and retold. I literally cringed at the harsh treatment that these women faced in the bigoted time circa 1961. It seems the white establishment went out of their way to insult and humiliate their fellow African Americans, who showed amazing restraint and grace. It is quite alarming that a vast segment of America wants to return to this era, to put ‘minorities in their place’, but thankfully that clock will not be rolled back any time soon.It takes incredible courage to be the first, the pioneer and the vanguard, to pierce the veil of discrimination and shove your way into the room. The bravery of these women is exemplary and admirable through the ages. A must see movie to understand the cruelty of the past, and the possibilities born from courage and ambition. To me the historic space missions were a side story, the real subject was the journey of these strong, brave ladies of NASA.",
            "review_date": "2021-04-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures, as the title suggest; reveals a topic unknown for the audience that enriches the understanding towards to fight of women and colored people for their rights. The story begins with a promise, our gifted protagonist shiningHidden Figures, as the title suggest; reveals a topic unknown for the audience that enriches the understanding towards to fight of women and colored people for their rights. The story begins with a promise, our gifted protagonist shining during her childhood; that invites the viewer to believe in all the wonders embodied in these three women, which are going to be exposed. Since then, the level of edification is big enough in order to identify the spectator with the characters and their situations: racial segregation, discrimination, undervaluation, labor exploitation and more. An interesting thing is the mutualism that develops around the three women, how each other complements the next one, how they support themselves and solve their flaws. None of them could have done it without the other two. The problem with the movie is that, there is nothing more than that; is just a story, a beautiful one, but there is no much to think about it. Octavia Spencer is charming as always, but Taraji P. Henson is astonishing, the acting surprise of the film.",
            "review_date": "2017-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "+Exceptional cast deliver best performance+Excellent soundtrack+Above average cinematography\n+Excellent pacing\n+Writing keeps cast engaged\n-Accuracy sacrificed for drama in some areas of the film\n\nDoes everything a great movie should. You+Exceptional cast deliver best performance+Excellent soundtrack+Above average cinematography+Excellent pacing+Writing keeps cast engaged-Accuracy sacrificed for drama in some areas of the filmDoes everything a great movie should. You feel taken away by the excellent cast and cinematography coalesced to produce a willful movement of emotions in me that I would call true escapism. You really feel the push back of will for this trio of female characters in this segregationist culture. The male dominated workplace displays both overt and subversive racism. Occasionally jarring, moving and very engaging. Watching this reminded me of how powerful an effect a decent film production can have on an audience.",
            "review_date": "2018-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Sadly yet another best picture nominee that was great in concept, historical significance and costuming... But not that riveting of a picture. There were some great moments but I wish they would have gone more deeply into the characters ofSadly yet another best picture nominee that was great in concept, historical significance and costuming... But not that riveting of a picture. There were some great moments but I wish they would have gone more deeply into the characters of these amazing women.",
            "review_date": "2017-05-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "these are big shoes to be filled..Hidden Figures\n\nMelfi's adaptation of Shetterly's book fails to grasp the stakes and magnitude of the content that the entire feature orbits around. And it can easily be filtered out from all the runningthese are big shoes to be filled..Hidden FiguresMelfi's adaptation of Shetterly's book fails to grasp the stakes and magnitude of the content that the entire feature orbits around. And it can easily be filtered out from all the running sequences it executes since it could have been a bit more intense than it actually pretends to be. The narration is not only adaptive and gripping but contains layered dialogues that strikes well on your mind that highlights the entire sequence through it. If Henson; the protagonist, fails to live up to the potential of the role offered to her and mind that these are big shoes to be filled, she is blessed with an incredible supporting cast that helps elevate the momentum in each frame. No matter how stereotypical Costner's character gets, he still delivers thoroughly and on the other hand Spencer too leaves a long lasting impression through her performance. Although, Monae, Dunst and Parsons are surprisingly not convincing enough to blend in aptly into these numbers along with a bit amateur editing and lazy background score. The theme of the tale is genuinely fascinating as the three lead characters resonates their persona with such impactful notions in the storytelling that you cannot not be moved by it. They swoop in as their savior with such subtilty that you are practically wolfish rooting for more and more. And with the conflicts like such and the rivalries that anchors and holds them down, these moments glorify them itself. Melfi is undoubtedly a better writer than the director, his nature to weave out a gripping structure is much more powerful than convincingly projecting one. A tale fragile and powerful as Hidden Figures probably required better methodology and treatment in order to draw out more than a nod from the viewers, but the work that went in here is still plausible enough to explore these figures.1",
            "review_date": "2018-10-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures, takes an audience on a rollercoaster of a ride between race, civil rights, and national politics, leaving them in high spirits wanting more.",
            "review_date": "2019-08-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Hidden Figures nuanced historical references can bring inspiration and nostalgia to those wishing to remember the great accomplishments done by three ladies that have succeeded in making their names no longer hidden in this earth.",
            "review_date": "2022-10-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An entertaining and inspiring movie into the untold story of three mathemiticians at NASA.Worth seeing.",
            "review_date": "2021-01-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't remember this movie super well. but i remember loving it and it's feminist message. Also it is a true story.",
            "review_date": "2022-06-04",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 125
}