{
  "title": "Sing Street",
  "rating": 8.4,
  "release_date": "2016-04-15",
  "genre": [
    "Drama",
    "Comedy",
    "Romance",
    "Music",
    "Musical"
  ],
  "summary": "In 1980s Dublin, 14-year-old Conor (Ferdia Walsh-Peelo) is looking for a break from a home strained by his parents’ relationship and money troubles, while trying to adjust to his new inner-city public school where the kids are rough and the teachers are rougher. He finds a glimmer of hope in the mysterious, über-cool and beautiful RaphinaIn 1980s Dublin, 14-year-old Conor (Ferdia Walsh-Peelo) is looking for a break from a home strained by his parents’ relationship and money troubles, while trying to adjust to his new inner-city public school where the kids are rough and the teachers are rougher. He finds a glimmer of hope in the mysterious, über-cool and beautiful Raphina (Lucy Boynton), and with the aim of winning her heart he invites her to star in his band’s music videos. There’s only one problem: he’s not part of a band…yet. She agrees, and now Conor must deliver what he’s promised - calling himself “Cosmo” and immersing himself in the vibrant rock music trends of the decade, he forms a band with a few lads, and the group pours their heart into writing lyrics and shooting videos. [TWC]… Expand",
  "critic_reviews": [
    "Sing Street is a wholly appealing genesis of teenage romance and music-group therapy for one Irish boy and a instant retro classic for those still hungry like the wolf.",
    "Few films are ever as enjoyable and endearing as Sing Street.",
    "It's touching, and you can dance to it. What's not to love?",
    "It’s like a lost John Hughes movie with Irish brogues and cars that just happen to drive on the other side of the road. It’s also, sadly, exactly the kind of sweet little film that too often gets buried in a box office ruled by broader comedies and bloated superhero epics",
    "The whole film is unlikely, a joyous story of youth, innocence, sweet earnestness, charming ineptitude and a shaky but productive belief on the hero’s part that he can do anything he pleases.",
    "It's pretty much impossible not to love Sing Street's young hero as he stumbles around Dublin, dumbstruck and smitten, at turns clueless and confident.",
    "John Carney has a humorous and loving eye for detail, an intuitive ear for dialogue, and the film is extremely personal in a way that is universal.",
    "Sing Street is the most romantic movie you'll find anywhere these days, brimming over with music, fun and the thrill of first love.",
    "If you’re put off by the filmmaker’s previous work, then the autobiographical Sing Street isn’t going to be the movie that wins you over. But fans of Carney’s lush romanticism and hook-laden lyricism will be thrilled to add this one to their playlist.",
    "Sing Street is a winsomely entertaining musical tribute to how passion can pave the way towards a better life.",
    "What makes Sing Street such a joyously entertaining film (besides the songs) is that it thinks the best of its characters, and it presents them the way they’d like to think of themselves.",
    "Carney, who wowed everyone with Once, has a knack for this kind of film. Sing Street promotes his best attributes, and succeeds in delivering toe-tapping, head bobbing thrills, heartfelt, if cheesy romance and big laughs.",
    "If it’s not great — think of a sort of JV “Commitments” and you’ll have the idea — it is surely winning.",
    "Carney’s emphasis is more on performance than craftsmanship. His camera lovingly covers the actual act of bringing music to life, and he makes being in the middle of a band look like the most revitalizing and rewarding place on Earth.",
    "Just as with \"Once\" and \"Begin Again,\" Sing Street will make you laugh, cry and leave you humming its songs for days.",
    "You’ve seen every element of Sing Street hundreds of times before — it’s Carney’s knack for assembling them that makes the difference. In his hands, this isn’t just a nostalgia trip. It’s an homage to teenage kicks and the urgency of getting them any way you can.",
    "It's a sweetly funny, charming and poignant depiction of this very specific time in life — at once universal and specific — when anything seems possible. And with killer pop tunes to boot.",
    "Did you like The Commitments? Did you like We Are the Best!!? Well, Sing Street isn’t as good as either of those two, but it’s still pretty terrific.",
    "Sing Street is far more boisterous and certainly funnier than Once, but it remains in a minor key; “finding happiness in sadness,” is how one character puts it.",
    "Like an updated The Commitments in rouge (liberally applied), Sing Street nails the details.",
    "The truest and most tearduct-tugging relationship here is that between Conor and his lank-haired college-dropout brother, played with spaced-out warmth and wistful good humor by the ever-likeable Reynor.",
    "It’s a small gem that deserves to be discovered.",
    "Even though Sing Street covers familiar ground, its director knows how to make his pigeon-hole adorable. The address’s charms win you over in the end.",
    "Sing Street reminds us of being young and lost in a song, realizing with a jolt that someone else had the same feelings we did.",
    "Carney gets everything right here: Sing Street hums with authenticity.",
    "As he did with \"Once,\" Carney with the somewhat autobiographical Sing Street mixes hardscrabble realism with highly charged romanticism, filmed on a low budget with mostly unknown talent.",
    "Warm, ingratiating, with a beat you can dance to, Sing Street is a feel-good movie that never demands to be liked. Instead it asks, politely and irresistibly.",
    "The songs, written by Carney and Gary Clark, have a goofy but genuine appeal. Watch out, or you might end up downloading the soundtrack.",
    "The director’s skill pushes what could have been the same old song into a likable testament to the saving powers of young love and rock ’n’ roll.",
    "Carney’s film (unlike his disappointing previous effort “Begin Again”) is mad, irrepressible youth incarnate, by turns as exuberant as “The Commitments” and (nearly) as heartfelt as “Once.”",
    "John Carney’s peppy flashback musical Sing Street is to his earlier \"Once\" what a glossy major-label debut is to a scrappier first album: Both have their pleasures, but the former can’t help but look a little artificial when compared to the latter.",
    "While Sing Street is often infectious its its scraggly energy, one wishes Conor’s other band members were slightly more fleshed-out, which would make their already-absorbing performances sing even more.",
    "The charms of Sing Street should not be underestimated. Partly because its manner is unassuming and its story none too original...it’s easy to overlook Mr. Carney’s ingenuity and sensitivity.",
    "Sing Street pleases, all right, and even occasionally hits on truth.",
    "The young nonprofessional actors are a fresh, natural bunch, even if the bandmembers might have benefited from more individual character development.",
    "John Carney’s 1980s-set Sing Street is like a barnstorming tribute group. It’s crowd-pleasing, heart-warming, hits all the right notes, and is eager to please.",
    "As long as Sing Street stays on this sweet, sentimental path, the film is an agreeable toe-tapper. Scratch the surface too deeply and you’ll find some historical inconsistencies, idealized events, and a depressing environment roiling in Conor’s familial home and nation.",
    "All traces of grit from John Carney's earlier films have been scrubbed away in favor of relentlessly crowd-pleasing slickness."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A film you just can't help fall in love with.  John Carney really gets this genre.  The way he takes this young man's journey and ties it into this band is incredible.  A real must see film.  A",
      "review_date": "2016-07-27"
    },
    {
      "review_title": null,
      "content": "John Carney has directed 3 films about music. ONCE which was turned into a Broadway show, BEGIN AGAIN, and SING STREET.\rThis could be a prequel to ONCE, as there seems to be an element of truth to all the films. A teenage boy Conor isJohn Carney has directed 3 films about music. ONCE which was turned into a Broadway show, BEGIN AGAIN, and SING STREET.\rThis could be a prequel to ONCE, as there seems to be an element of truth to all the films. A teenage boy Conor is enrolled in a new school(this is Ireland in the '80s) because his parents are breaking up and can't afford to send him to his current school. He meets a girl a bit older than himself and trying to impress her, asks if she would like to be in a video with his band. When she says 'Yes', he then has to recruit kids from his new school to form a band.\rAnother element of the film is the relationship Conor has with his older slacker brother Brendan, who wanted to be a musician but his mother wouldn't let him leave home, and Brendan backs Conor's attempt to get the girl,Raphina, and take the path he was unable to in his youth.",
      "review_date": "2016-05-24"
    },
    {
      "review_title": null,
      "content": "It's even difficult to find a satisfying way to describe how beautiful this film is. The music gets you, the message is clear and efficiently delivered.",
      "review_date": "2016-10-22"
    },
    {
      "review_title": null,
      "content": "Sing Street is a song that celebrates the youth, dream and the purest teenage love. You danced as you were  floating in the fine tunes and lyrics that are absolutely beautiful and smart. When the song and dance ended with a note that wasSing Street is a song that celebrates the youth, dream and the purest teenage love. You danced as you were  floating in the fine tunes and lyrics that are absolutely beautiful and smart. When the song and dance ended with a note that was perfectly sweeter than bitter, you realize that you've grown up a little bit again.",
      "review_date": "2016-07-06"
    },
    {
      "review_title": null,
      "content": "This movie is written for those who still have an imagination, It's not about explosions and far away places with exotic settings that create imagery for us. Sing Street is a simple movie with very little distraction, It;s written in the timeThis movie is written for those who still have an imagination, It's not about explosions and far away places with exotic settings that create imagery for us. Sing Street is a simple movie with very little distraction, It;s written in the time of the 80's. No cell phones, no internet and no artificial substance. A movie  for the modern romantic that will definitively make those shine that are dreaming of something better. A rare find,",
      "review_date": "2016-07-31"
    },
    {
      "review_title": null,
      "content": "Writer/director John Carney has previously helmed 2 films about musicians and their creative process (\"Once\" & \"Begin Again\"). This one revolves around a young teen in 80s Dublin who forms a band to impress a girl. The resulting group ofWriter/director John Carney has previously helmed 2 films about musicians and their creative process (\"Once\" & \"Begin Again\"). This one revolves around a young teen in 80s Dublin who forms a band to impress a girl. The resulting group of misfits is cute in their awkward innocence, while the period style and music pervade the film's atmosphere. The band performs a number of original songs (by Carney) that prove to be catchy pop fun. In addition to the musical treats, it's a truly sweet story of a young man's efforts to express himself and his love. Sure, you can bask in the nostalgia of MTV's early days, but you'll also find yourself charmed by the film's buoyant youthful optimism.",
      "review_date": "2016-05-14"
    },
    {
      "review_title": null,
      "content": "A thoroughly delightful viewing experience, Sing Street is a sweet, melodic, and truly charming film. Flush to the brim with truly fantastic music that sweeps you up in its essence, Sing Street is the definition of movie magic. Its plot andA thoroughly delightful viewing experience, Sing Street is a sweet, melodic, and truly charming film. Flush to the brim with truly fantastic music that sweeps you up in its essence, Sing Street is the definition of movie magic. Its plot and characters can be quite cliche, but the magic and feeling it gives you is anything but. Instead, Sing Street's typical plot is anything but a problem, instead it simply serves as the foundation for a film that will make you fall in love with watching the film and the characters. The characters are also very well-written, multi-dimensional human beings facing real problems (divorce namely). The film's approach to their real problems is most certainly incredibly relatable and hits home. Aside from the music, the comedy in the film is also quite strong with many lines causing me to actually laugh out loud, which is a rarity nowadays. Overall, Sing Street is a charmer that really sweeps you up in its magic and should please crowds of all ages.",
      "review_date": "2016-08-12"
    },
    {
      "review_title": null,
      "content": "Back to the 80s with rock and roll and romance.\r I seriously thought this might be an overrated film. I knew it was too early to judge it, so I was not expecting anything extraordinary and then it struck me with its progress, I was cleanBack to the 80s with rock and roll and romance.\r I seriously thought this might be an overrated film. I knew it was too early to judge it, so I was not expecting anything extraordinary and then it struck me with its progress, I was clean bowled by its style and cuteness. I don't what others think, but this is John Carney's masterpiece according to me. I liked his other films, but this is something I think a perfect dose of contents. In two words to say it is a Golden Touch. I rarely like music and musical films, and it had been long since one I had enjoyed very much like this. Definitely this should be one of the top ten films of the years.\r This is an Irish-British film that is set in the Dublin, 1985. It is about a high school boy named Conor, who just got transferred from a private school to a free state-run boy's school after his parents imposed a plan on the budget cut. New school and problems are ahead where he has to come out of it on his own. During getting used to it, he meets a girl who lives nearby the school and to impress her, he lies that he has a band and looking for a female singer. So then he forms one with the amateur musicians and the journey begins for these teenagers that reveals in the remaining film how long they are willing to go.\r \"Your problem is that you're not happy being sad. But that's what love is, Cosmo. Happy-sad.\"\r At the end of the final scene, there is a note that says 'For brothers everywhere'. I was impressed by that, because I did not pay attention on that while watching the film. What I meant was, this is not some teenage love story, actually it was about the brothers, but overshadowed by romance theme. I recalled my memories on those parts and quickly realised the centre of the story that how it was developed. The one who played the older brother of Conor simply looked alike Seth Rogan and that is the character you have to watch out for. He's only a supporting character, but the impact was indirectly larger on the story.\r Of course, falling in love might make you do crazy things, even you can become a rockstar overnight. But there's a first step for everything and it is not assured that you will be succeed by those attempts. That is where comes the experienced hand, the brother, a close friend who stood by us since our birth. It is easy to fall in love, but it is not easy to have a brother who guides us in every move on that.\r In this film the sreenspace between them was very little, but that did not stop to disclose how one's inspiration that got from love to mold accurate shape and to lead the right path. I don't have any brother, but I felt how it would be to have one. So all the brothers in the world must see it, this is dedicated to them.\r \"It's like when you don't know someone, they are more interesting. They can be anything you want them to be. But when you know them, there's limits to them.\"\r I did not grow up in the 80s, but was very close to it and I know how it would feel to be born in that generation. Jeans, thick hair and curls, everybody was so thin, weird make-ups with strong eyeliner, big eyeglasses, cassettes, you would love this film if you remember those stuffs from your fading memories.\r A very stylish music-comedy and on the romance side, this film was very cute. All the actors were brilliant, especially the lead boy whose first film was this and the girl amazing with her totally electrifying look. They both going have a great future in filmdom. Not to miss out the supporting cast who did their part so well, especially the brother I talked about in the other paragraph.\r All the sound tracks were awesome. I should start adding them to my 'film songs' collection, especially 'The Riddle of the Model' which defines this title and the film's climax song 'Go Now'. So from the cast to crew, equal credits must given to the music composers and lyricists from the real 80s bands. The film had a perfect runtime, I would have had no issue if it was extended for another half an hour.\r The pace of the narration always kept in a same position, but towards the final quarter it has gone up. Yes, I loved the ending, it was touching, but I don't know how to describe it, only one can experience it by himself. A film I watched without any anticipation, now it is one of my favourite films. Todays generation might take it as another rock and roll inspired theme, but only the middle aged guys and some old ones would know how to enjoy it. So don't miss it out if you are one of them.\r 8.5/10",
      "review_date": "2016-08-17"
    },
    {
      "review_title": null,
      "content": "A charming, funny, coming of age period piece about a hopeless romantic teen who discovers talents he never knew he had as he woos the object of his desire. This finely produced feel good offering both inspires and tugs at the heart strings,A charming, funny, coming of age period piece about a hopeless romantic teen who discovers talents he never knew he had as he woos the object of his desire. This finely produced feel good offering both inspires and tugs at the heart strings, but it successfully resists the temptation to become schmaltzy or cliched. The film also deftly spoofs the early days of music videos, mimicking their unapologetic silliness but without going over the top in doing so. To be sure, the picture could have used a bit more back story and greater character development among the supporting players, but, on balance, \"Sing Street\" never fails to entertain. A raucously fun time at the show.",
      "review_date": "2016-04-30"
    },
    {
      "review_title": null,
      "content": "this is about Live, Love & Laugh! really love the presentation. heartwarming, funny & loveable. charming cast, full of issues but very light, fun and simple. one of the best movies about music of the year!",
      "review_date": "2016-11-23"
    },
    {
      "review_title": null,
      "content": "Once again, the nose-in-the-air folks over at Slant miss all subtlety - not to mention being oblivious to the tenderness - of this gem of a movie. The critic accuses the director of (gasp!) \"coasting on sincerity and high spirits\". What aOnce again, the nose-in-the-air folks over at Slant miss all subtlety - not to mention being oblivious to the tenderness - of this gem of a movie. The critic accuses the director of (gasp!) \"coasting on sincerity and high spirits\". What a horrible thing to feature in a movie: sincerity and high spirits. Instead: sweetness, fun, fantasy and escapism begone! Show not your face at Slant's local movie house. Seriously, though, this is a delightful, witty, fun little movie that really does capture the times and, moreover, leaves you with a bit more hope for the human race. Not a bad way, I venture, to spend an evening with your loved one(s).",
      "review_date": "2016-04-26"
    },
    {
      "review_title": null,
      "content": "Sing Street looks great to live in not just because it's a great movie, it shows how dramatic this movie can be. Be prepared to listen to its songs though. Opinions can be opinionated.",
      "review_date": "2016-04-24"
    },
    {
      "review_title": null,
      "content": "A charming coming-of-age film where the 1980s time period is as much a character as it is the setting.  John Carney continues to blend music and reality extremely well.",
      "review_date": "2016-12-07"
    },
    {
      "review_title": null,
      "content": "Sing street. Great. Love the entire carney trilogy of once, begin again and now, sing street. I was just interested if anyone else made what I think was a not so subtle reference to a young Lennon McCartney connection, when the lead hooked upSing street. Great. Love the entire carney trilogy of once, begin again and now, sing street. I was just interested if anyone else made what I think was a not so subtle reference to a young Lennon McCartney connection, when the lead hooked up with his musical partner, who was a dead ringer for a young Lennon .",
      "review_date": "2016-11-19"
    },
    {
      "review_title": null,
      "content": "This movie is a the best romance i've ever seen. it's musical it' makes you laugh it makes you cry.\rand it's also historical it brings you to 30 or 40 years ago as a high school teenager.\rI recommend everyone to see it.",
      "review_date": "2016-08-28"
    },
    {
      "review_title": null,
      "content": "Sing Street is an escapade into the life of a Dublin teenager, and his journey of the evolvement of him and his growing relationship with the girl he wants to start a relationship with, being the primary reason he’s started his band. However,Sing Street is an escapade into the life of a Dublin teenager, and his journey of the evolvement of him and his growing relationship with the girl he wants to start a relationship with, being the primary reason he’s started his band. However, this film injects a great amount of 80’s atmosphere into the band and provides a great sense of nostalgia with the 80’s theme, definitely making the main characters adventure, an adventure into the music industry. So, you’re not only starting to see this main character evolve in terms of understanding how music works thanks to the wisdom of his older brother, who is a fantastic character who gets just the right amount of screen time by the way. The side characters just seem there to fill in the shoes of the Sing Street band, and I wished we got to see more of them, as the story really primarily focused on the main character Connor and his want-to be girlfriend Raphina. The story moves along very well, every scene with Connor is entertaining, especially in the sense that the nostalgia in the film for people born in the 80’s gives people a sense of familiarity with the character – so when you see him succeed him in his aspirations, and see what it took to get there, it makes the film very satisfying, really adding to the feel good factor. This film was a welcome surprise and gets from me an 9/10 91%",
      "review_date": "2016-11-24"
    },
    {
      "review_title": null,
      "content": "Best feel good movie you will see this year. Actually one of the most enjoyable films i have seen in years. You will be captured from opening until close. Oscar worthy soundtrack and the cast was adorable. Nailed it.",
      "review_date": "2016-12-05"
    },
    {
      "review_title": null,
      "content": "A wonderful feel good movie and that feel good feeling will stay with you for a long time. The songs are great they are upbeat, sad, hopeful a range of emotions. ´The cast is truly special and work very well together. In my opinion everyoneA wonderful feel good movie and that feel good feeling will stay with you for a long time. The songs are great they are upbeat, sad, hopeful a range of emotions. ´The cast is truly special and work very well together. In my opinion everyone just give this one a watch!",
      "review_date": "2017-02-18"
    },
    {
      "review_title": null,
      "content": "A high-flying modern musical whose ballad of reckless optimism does not come without darker undertones. And one hell of a soundtrack. It's a joyous film deserving of multiple viewings.",
      "review_date": "2017-02-23"
    },
    {
      "review_title": null,
      "content": "This movie is a delicious experience. Smooth, fluid and full of love. The 80's is well represented everywhere. Musics, clothes, cars, etc. The idea of the main character don't bawl to the bulling guys is perfect. Sending this message I couldThis movie is a delicious experience. Smooth, fluid and full of love. The 80's is well represented everywhere. Musics, clothes, cars, etc. The idea of the main character don't bawl to the bulling guys is perfect. Sending this message I could understand that using brain is better than muscles. Which is a good message to the youth nowadays. I had been watching a lot of movies like that but this one, It took me. It literally \"makes me up\". for me is a big and certain 10.",
      "review_date": "2017-04-22"
    },
    {
      "review_title": null,
      "content": "There are no adequate words to give this movie the praise it deserves. I would gladly give this 11/10 if it didn't break the rules. An absolutely amazing, funny feel good movie of the year. The songs are simply fabulous, acting to perfection,There are no adequate words to give this movie the praise it deserves. I would gladly give this 11/10 if it didn't break the rules. An absolutely amazing, funny feel good movie of the year. The songs are simply fabulous, acting to perfection, bloody brilliant. Recommended, without a doubt.",
      "review_date": "2016-04-15"
    },
    {
      "review_title": null,
      "content": "Sing Street is one of the best Irish films ever made. While it does favour style over substance at times, and features some clichés, it makes up for this with a great cast and music.",
      "review_date": "2016-04-18"
    },
    {
      "review_title": null,
      "content": "If you've ever seen the excellent movie \"The Commitments\" you don't really need to see this one. It's like an awkward tween version of that far better film. Might be suitable for middle schoolers who loved Glee, but otherwise?",
      "review_date": "2016-12-19"
    },
    {
      "review_title": null,
      "content": "Really fun movie with heart. I honestly wasn't expecting to enjoy it as much as I did. It's one of the better non-musical musicals I've seen in a while. If you're a fan of 80's music (honestly, what self-respecting human being isn't) thenReally fun movie with heart. I honestly wasn't expecting to enjoy it as much as I did. It's one of the better non-musical musicals I've seen in a while. If you're a fan of 80's music (honestly, what self-respecting human being isn't) then this should be a blast for you. It's innocent without being unrealistic, and realistic enough without relying on cheap Netflix style trashiness to get it's point across. Great movie",
      "review_date": "2017-11-11"
    },
    {
      "review_title": null,
      "content": "I must be a stick in the mud.  I thought the story line was too far out, the family situation was the only touch of reality in the movie, the rest, someone's teenage imagination of real life.",
      "review_date": "2016-07-27"
    },
    {
      "review_title": null,
      "content": "Sing Street does carry a nice message about having optimism, has decent songs, and has a lighthearted feel- good feel to it. That's all I can say about this. That's because the the characters are not interesting, the film is overly long, theSing Street does carry a nice message about having optimism, has decent songs, and has a lighthearted feel- good feel to it. That's all I can say about this. That's because the the characters are not interesting, the film is overly long, the story is overly simplistic / unrealistic, and the whole thing is very forgettable. While it has good intentions and a nice message, this is nothing more than a glorified Hallmark movie.",
      "review_date": "2016-08-12"
    },
    {
      "review_title": null,
      "content": "Familiar concept, excellent execution. Sing Street has a sweet central romance with likable characters, great performances and incredible music that's sure to stick with you and have you singing it for a long time.",
      "review_date": "2016-12-16"
    },
    {
      "review_title": null,
      "content": "Sing Street is an incredible film. It's a classic story of young love, and features an excellent mix of licensed and original songs. The writing is sharp and funny, and every character is three dimensional and interesting. The acting is spotSing Street is an incredible film. It's a classic story of young love, and features an excellent mix of licensed and original songs. The writing is sharp and funny, and every character is three dimensional and interesting. The acting is spot on throughout, and the emotions really touch you. I loved the film's pace, it was brisk and exciting without ever feeling rushed. There's so much to say about Sing Street, but the main thing you should know is that it's a fun movie and well worth your time. Watch it!",
      "review_date": "2016-12-02"
    },
    {
      "review_title": null,
      "content": "Having loved John Carney's first film \"Once\", I was really intrigued to see what great magic he might be able to come up with for this film and its all-too-nostalgic 80s setting, and that's exactly what he does here! The lead actors areHaving loved John Carney's first film \"Once\", I was really intrigued to see what great magic he might be able to come up with for this film and its all-too-nostalgic 80s setting, and that's exactly what he does here! The lead actors are constantly funny and likable and their songs are even more charming and irresistible! Great throwback to some other old classic bands throughout as well! Despite the somewhat formulaic plot structure (kid moves to new school, kid gets bullied, kid does something big to stand up against the bullies and impress his dream girl, etc), it does have enough unique moments to stand out as a truly fun and most importantly, heartwarming film! Overall, it didn't quite hit home with me like \"Once\" did; however, the acting, music, and always fun 80s setting all came together to make this one great and fun musically good time!",
      "review_date": "2016-05-17"
    },
    {
      "review_title": null,
      "content": "This movie captures that little wish we all have in our past-why didn't I follow through with my dreams-wish I could go back and change things!!  This amazing movie is reminiscent of those 80 movies that we all loved, complete with new songsThis movie captures that little wish we all have in our past-why didn't I follow through with my dreams-wish I could go back and change things!!  This amazing movie is reminiscent of those 80 movies that we all loved, complete with new songs and a cast complete from an 80's mold.  The characters and cast are also reminiscent of those actors that we loved in those 80 movies.  If  you want to go back and relive the music and the movies of the time, don't walk, but rush out and get this one on a DVD fresh with new songs with an 80's flair.  I loved it so much I am going to buy the soundtrack so I can listen to the music over and over.  I trully hope we see more of actor Ferdia Walsh-Peelo as he is over the top in this movie which in my opinion will soon be a cult classic, and also hope that director  John Carney does more movies as I will seek them out based on the creativity of this gem.  Kudo's to all involved as every aspect in this movie is perfect from beginning to end.  In my opinion one of the best of its kind in the last decade!!",
      "review_date": "2016-10-14"
    },
    {
      "review_title": null,
      "content": "Sing Street is a musical comedy-drama that's written, produced and directed by John Carney. On the lead it stars Lucy Boynton, Maria Doyle Kennedy, Jack Reynor, Kelly Thornton and Ferdia Walsh-Peelo.\rThis movie is about a boy who lives withSing Street is a musical comedy-drama that's written, produced and directed by John Carney. On the lead it stars Lucy Boynton, Maria Doyle Kennedy, Jack Reynor, Kelly Thornton and Ferdia Walsh-Peelo.\rThis movie is about a boy who lives with his two parents that are seemingly on the verge of breaking up, and they move him to a free state-school. There he falls for a girl who then he decides to create a band to impress her.\rThis movie is much deeper than that, and I think it benefits from it a lot because this is one of the best films I have seen in a very long time. The acting is phenomenal from every single actor here, starting with Ferdia Walsh-Peelo on the lead as Conor Lalor who gives genuinely one of the best male performances of the year. Ferdia Walsh-Peelo as Raphina, the girl who Conor falls for, is also amazing. But who totally stood out to me was Conor's brother in the movie, Brendan portrayed by Jack Reynor. I can not believe that this is the same guy who was in Transformers: Age of Extinction. I remembered him instantly from that monstrosity but with every second passing with him on screen I was more and more impressed.\rThe writer-director John Carney does a wonderful job here, from the camerawork to the incredible soundtrack that just stays with you long after you've seen this masterpiece. The life lessons are perfectly conveyed to the audience and the \"kid\" in all of us. I am certainly not what would be considered as an 80's kid and I might have not got all the references but that did not stop me from enjoying the movie so much. I felt for the characters and let me just say that the ending is so emotional and works so well with the story that was being told, that completes this absolute masterpiece of a movie and I can't wait to watch it again.",
      "review_date": "2016-09-05"
    },
    {
      "review_title": null,
      "content": "This movie is great, it is wildly romantic, hilarious, and smart. The songs are great and the characters are fun. Sing Street is one of the best movies I've seen. I love it so much.",
      "review_date": "2018-03-15"
    },
    {
      "review_title": null,
      "content": "A movie that I haven't heard of until like a month ago could end up being the best film of the year. The acting is superb, and the music is very catchy and awesome. There is never one dull moment in this movie and the movie is extremely fun.A movie that I haven't heard of until like a month ago could end up being the best film of the year. The acting is superb, and the music is very catchy and awesome. There is never one dull moment in this movie and the movie is extremely fun. I believe this is one of if not the best film of the 2010's. Do not miss this film this year. This is one everyone needs to see.",
      "review_date": "2017-05-19"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSo the movie starts in Ireland with the main character, Conor, playing guitar in his room while his parents argue in the background. Then his parents call a family meeting and they tell Conor and his two siblings they are cutting back on spending money and as a result Conor will go to private school; which in America would be more expensive. Anyway, Conor goes to private school and the priest/principal is like a huge d***. Later that day Conor watches MTV with his brother and it is revealed they share a bond over music. His brother explains to Conor how revolutionary Duran Duran is, and at that point you know what you've signed up for in the movie department. Conor meets a short redhead kid who is nearly impossible to understand, and he introduces Conor to a singer songwriter named Eamon who wants to start a band. They form a Lennon/McCartney bond faster than any musicians in the history of music and start a band with three other people who contribute very little to the movie. That's when Conor meets a beautiful young girl named Raphina whom he wants to impress and sweep off her feet. He tells Raphina he's in a band and he's looking for a girl to be in a music video their shooting. She tells him she doesn't like boys, or some cryptic bulls*** that a 16 year old girl would say to get attention. She says she'll be in his music video if she \"has time.\" You've got time you attention grubbing teen. Then Conor and Eamon write an amazing first song called The Riddle of the Model. Like if this was the first song I had ever written I would be so goddamn excited. He brings over a cassette tape to Raphina and she enjoys the song so much she agrees to be in his music video. After they shoot the video Raphina reveals she has a boyfriend, but she still wants Conor to give her a lot of attention so she agrees to be in more of his videos. Conor is convinced if he writes a good enough song, Raphina will be his forever. He then continues to write unbelievably great songs for an angsty 15-year-old Irish boy, but Raphina continues to show little desire to be with him. Then in school he is confronted by the priest/principle about his angsty behavior, and he is told to wash the makeup off of his face. Conor refuses, and the priest grabs him and takes him into the bathroom, and there is a brief moment where you totally think he is going to sexually assault Conor, but he only nearly drowns him in the sink. Conor leaves school upset, but Raphina is outside waiting for him to acknowledge her, then as if she couldn't get any more annoying she starts calling him \"Cosmo\" for no reason. Conor writes his best song yet and invites Raphina to shoot the music video, she says she'll be there. The day comes and surprise, surprise Raphina bails. Where did she go? She moved to London with her boyfriend so she could try to be a model. Conor is completely broken up by this. In addition to Raphina abandoning him, his parents have decided to get divorced because his mother has been cheating on his father. Time goes by and he has not only written more songs for his band, but successfully landed a gig to play prom. Right before they play prom Conor walks by Raphina's house, only to find she is still living there. London did not work out for her, and her loser boyfriend shockingly abandoned her. Conor gives her one last tape and storms off. Raphina listens to the tape, has a moody walk through the park, and \"realizes\" Conor is the one for her. Conor nails his gig with his band, and Raphina shows up right at the end. Conor has decided to sail away to London with Raphina and abandon his band after writing half of what could be a number 1 album. He hugs them goodbye, runs through the streets with Raphina, then gets home and asks his brother to drive them to the pier. His brother agrees, and Conor goes into his parents' room to steal his father's boat keys. He grabs the keys, looks at his father sleeping on the floor while his harlot mother takes the entire bed. He then says \"I love you Mom,\" and walks out the door. \"Thanks for breaking up the family homewrecker, I love you. And I won't even say goodbye to Dad at all, I'll just steal his boat keys and flip him two fingers while I shout 'deuces'.\" The movie ends with Conor and Raphina sailing off into the ocean, assuming they will make it to Wales on however little gas they have, literally shoving the 'coming of age' genre down our throats in one foul swoop. Before the credits role, the screen says, \"Dedicated to Brothers Everywhere.\" HOW WAS THIS MOVIE ABOUT BROTHERS?! If that was the case they definitely could focused more on his brother than the young, naive romance and the band that was destined to play no more than Prom. Fortunately for us, the Sing Street soundtrack will be available long after we get over our frustrations with the film.",
      "review_date": "2016-06-09"
    },
    {
      "review_title": null,
      "content": "Though it isn't the most original film in the world, \"Sing Street\" is an energetic, upbeat and surprisingly touching musical with irresistible charm and great songs. The performances are excellent, with an Oscar-worthy turn from Jack ReynorThough it isn't the most original film in the world, \"Sing Street\" is an energetic, upbeat and surprisingly touching musical with irresistible charm and great songs. The performances are excellent, with an Oscar-worthy turn from Jack Reynor and great work from its younger stars. The music is toe-tapping and catchy, and the movie blends feel-good optimism with heartfelt drama wonderfully. It also manages to recreate the feel of 1980's Dublin perfectly, and should leave a smile on your face by the time the credits roll. Overall, Sing Street is another success for John Carney and one of the best movies of 2016.",
      "review_date": "2016-09-02"
    },
    {
      "review_title": null,
      "content": "The movie is really awesome, with a lot of emotion and memories of your childhood, when you wanted have a band with your friends and take to the girl of your dreams.",
      "review_date": "2017-03-13"
    },
    {
      "review_title": null,
      "content": "With a killer soundtrack, full of heart and an irresistible sense of charm not only in atmosphere but the characters as well, Sing Street quickly became the most underrated movie of 2016 so far. Sing Street is going to be one of those smallWith a killer soundtrack, full of heart and an irresistible sense of charm not only in atmosphere but the characters as well, Sing Street quickly became the most underrated movie of 2016 so far. Sing Street is going to be one of those small indie movies that unrightfully went under the radar and should have been seen by more people. The feel good movie of the year.",
      "review_date": "2016-11-20"
    },
    {
      "review_title": null,
      "content": "Enjoyable musical comedy-drama about a boy transition from being a child to being an young adult narrated trough 80's music and fashion. It's not the most original story ever written but do it's job properly talking about family, music, love,Enjoyable musical comedy-drama about a boy transition from being a child to being an young adult narrated trough 80's music and fashion. It's not the most original story ever written but do it's job properly talking about family, music, love, effects of economic depression in a small community and growing up. Fast dialogues, good original songs... play a lot the \"nostagia effects\" card.  Some characters and situation remind me of 1991 film \"The Commitments\" for example the hot-tempered Barry of Sing Street is very similar to Mickah Wallace in Commitments",
      "review_date": "2017-02-16"
    },
    {
      "review_title": null,
      "content": "A fun, silly movie that packs a surprisingly emotional touch. Music fit the film well. Actors well cast. The touching older sibling relationship steals the show.",
      "review_date": "2017-05-21"
    },
    {
      "review_title": null,
      "content": "If you are in the mood for some cutesy escapism look no further than Sing Street. It's a very sweet movie with great songs and nods to the 80s musical scene, but it did go overboard with its fluffiness for my taste.",
      "review_date": "2018-09-20"
    },
    {
      "review_title": null,
      "content": "Sing Street is a fantastic movie that explores heavy themes of music, growing up, and young love. In a lot of ways it is reminiscent of Back to the Future, which is in fact referenced several times throughout the film. It takes place in theSing Street is a fantastic movie that explores heavy themes of music, growing up, and young love. In a lot of ways it is reminiscent of Back to the Future, which is in fact referenced several times throughout the film. It takes place in the 80s and follows a young boy as he deals with a troubled family life and having to move to a new school. However he has a passion for writing/playing music, and soon falls in love with a girl which gives him something to live for. The film has some really great performances and original songs that make it a must watch. Anyone that is obsessed with 80s films/culture definitely needs to check this movie out.",
      "review_date": "2017-07-16"
    },
    {
      "review_title": null,
      "content": "Comedia irlandesa con mucha chispa y sin aspavientos, su mayor encanto es la nostalgia por los 80s y canciones de epoca bastante contagiosas. Sin falta",
      "review_date": "2016-10-01"
    },
    {
      "review_title": null,
      "content": "I'll officially declare right now that I think Sing Street is the most under-watched movie of 2016. When I watched it, I was in a rather empty theater; when I finished watching it, I left my seat in awe, convinced that this movie is terrific.I'll officially declare right now that I think Sing Street is the most under-watched movie of 2016. When I watched it, I was in a rather empty theater; when I finished watching it, I left my seat in awe, convinced that this movie is terrific.\rSing Street is another reminder that movies don't have to be dark to be good. It features great characters, a great story, and is thoroughly a joyride. While here, I might as well mention that every time a song is played, the scene is just brimming with life and energy. It is that enjoyable. If I had to admit of any tiny shortcoming, it would be that this movie is more or less cliché, but here, I'm rewarding the movie for the effort and how the clichés are handled. There is nothing cheap lingering in this movie.\rbecause it really is something to witness, I'm not going to spoil it here. Instead, I'll be happy to honor it a seal of approval.",
      "review_date": "2016-10-19"
    },
    {
      "review_title": null,
      "content": "From the director who gave us “Once” and “Begin Again”, John Carney crafts the third movie in his music-based trilogy as he takes us back to 1985, when a Dublin teenager (Walsh-Peelo) forms a pop band to win the heart of an aspiring modelFrom the director who gave us “Once” and “Begin Again”, John Carney crafts the third movie in his music-based trilogy as he takes us back to 1985, when a Dublin teenager (Walsh-Peelo) forms a pop band to win the heart of an aspiring model (Boynton).Carney exactly knows how to blend storytelling and music into his films by letting his memorable characters unleash their best versions by expression through music. His old-fashioned technique provides us a sweet and heartwarming movie which is impossible to watch without a smile in your face. It perfectly meshes coming-of-age, romance and music elements to tell a compelling story with nice dialogue.As always, Carney's films are composed of delightful original songs: Drive It Like You Stole It and Up being two of the most stand outs.Sing Street is also fantastically supported with period settings of blasting nostalgia to everyone who grew up in the 80s, whether the brilliant soundtrack or fashion. It serves as a homage to the pop-culture of that time and an escape to rediscover yourself through music.John Carney crafts yet another intoxicatingly heartfelt romantic musical making Sing Street his best film, so far.",
      "review_date": "2017-07-09"
    },
    {
      "review_title": null,
      "content": "I'm a little late to the party on this one and all the other 9/10 user reviews pretty much sum up how I felt about this beautiful, funny, romantic, delightful film. To the tiny percentage of critics and users who didn't like Sing Street, forI'm a little late to the party on this one and all the other 9/10 user reviews pretty much sum up how I felt about this beautiful, funny, romantic, delightful film. To the tiny percentage of critics and users who didn't like Sing Street, for some inexplicable reason, well..your judgement of what makes for good cinema is horrendous, and your credibility to offer your opinion on movies is shot.",
      "review_date": "2018-01-23"
    },
    {
      "review_title": null,
      "content": "no me esperaba nada de esta película, pero desde los primeros 15 minutos ya te engancha, si tuviste una banda en la adolescencia esta película te va a traer nostalgia, muy buenas tomas y excelente música de fondo",
      "review_date": "2017-03-21"
    },
    {
      "review_title": null,
      "content": "I didn't expect a lot of this movie, but it did a good job. A very enjoyable teenager story set in the world of 80s rock music. Very touching and funny. Great songs.",
      "review_date": "2017-01-04"
    },
    {
      "review_title": null,
      "content": "Sing Street was the hidden Gem of 2016, One of my 3 favorite movies of the year, a joy to sit through, great music and along with a great cast of unknowns it is a wonderful feel-good flick, this is another snub by the very pretentious and allSing Street was the hidden Gem of 2016, One of my 3 favorite movies of the year, a joy to sit through, great music and along with a great cast of unknowns it is a wonderful feel-good flick, this is another snub by the very pretentious and all too politically correct critic, The Academy Awards, This movie is 2016's version of \"In America\" another over-looked movie.",
      "review_date": "2017-02-20"
    },
    {
      "review_title": null,
      "content": "I love this movie! My favorite of 2016. I wish I'd seen it on theaters but it didn't even get a release date in my country. I definetely recommend this to anyone even if you're not into musicals. Strictly speaking, this isn't a musical, it'sI love this movie! My favorite of 2016. I wish I'd seen it on theaters but it didn't even get a release date in my country. I definetely recommend this to anyone even if you're not into musicals. Strictly speaking, this isn't a musical, it's a coming of age movie that features music. The characters are great and the story is compelling that after watching it your day is gonna get brighter and you'll leave with a smile on your face.",
      "review_date": "2018-02-24"
    },
    {
      "review_title": null,
      "content": "Sing Street is the definition of feel good and such an entertaining experience for me. Set it the 80s, Sing Street has this charm whether it's in its story telling or characters that makes it easily one of the best films of 2016. Anyone canSing Street is the definition of feel good and such an entertaining experience for me. Set it the 80s, Sing Street has this charm whether it's in its story telling or characters that makes it easily one of the best films of 2016. Anyone can enjoy this movie for its light hearted story of youth and love. Carney's vision is fantastic and I loved every second of this film. A Must See!",
      "review_date": "2017-12-17"
    },
    {
      "review_title": null,
      "content": "One of the sweetest most delightful romance films I've seen in a long time. John Carney is such a wonderful director and Sing Street is where he shows his true colors. The music is great, the characters are likeable, the performances areOne of the sweetest most delightful romance films I've seen in a long time. John Carney is such a wonderful director and Sing Street is where he shows his true colors. The music is great, the characters are likeable, the performances are good. I wouldn't consider it a masterpiece, but it just hit me on a personal level so it's definitely in my top 10. It's one of those films that can always put a smile on my face. Pure joy!",
      "review_date": "2019-07-22"
    },
    {
      "review_title": null,
      "content": "A moving film with a lot of great original songs. The one thing I didn't like that much was the romance.Also, Some moments towards the end feel kinda unearned",
      "review_date": "2020-09-25"
    },
    {
      "review_title": null,
      "content": "John Carney's masterpiece, completely rewatchable. Joyous, funny, sincere and killer songs (& videos) Was a complete surprise but is still my favourite film of the 2000s",
      "review_date": "2020-02-08"
    }
  ],
  "num_reviews": 91
}