{
    "title": "Yoga Hosers",
    "rating": 4.5,
    "release_date": "2016-09-02",
    "genre": [
        "Thriller",
        "Fantasy",
        "Horror",
        "Comedy"
    ],
    "summary": "15 year old-yoga-nuts Colleen Collette and Colleen McKenzie love their smart phones and hate their after school job at Manitoban convenience store Eh-2-Zed. But when an ancient evil rises from beneath Canada’s crust and threatens their big invitation to a Grade 12 party, the Colleens join forces with the legendary man-hunter from Montreal15 year old-yoga-nuts Colleen Collette and Colleen McKenzie love their smart phones and hate their after school job at Manitoban convenience store Eh-2-Zed. But when an ancient evil rises from beneath Canada’s crust and threatens their big invitation to a Grade 12 party, the Colleens join forces with the legendary man-hunter from Montreal named Guy Lapointe to fight for their lives with all seven Chakras, one Warrior Pose at a time.… Expand",
    "critic_reviews": [
        "Yoga Hosers is the best film Kevin Smith has made in a long time, which admittedly isn’t saying much. But this new cult comedy-thriller may well represent a turning point for the writer-director.",
        "Yoga Hosers isn’t a bad time at the movies, but it’s painful when the gags fall flat.",
        "Yoga Hosers is a movie that feels like it was more fun to make than to watch.",
        "Yoga Hosers is tiring, and not because it's dumb or inherently obnoxious. No, as RogerEbert.com's resident Kevin Smith apologist, it pains me to say this, but: this movie should have been made by someone with more discipline.",
        "While Yoga Hosers continues Smith’s quest to push himself into increasingly strange and uncomfortable directions as a filmmaker, it’s either too derivative or too malformed to work the vast majority of the time.",
        "Kevin Smith's Yoga Hosers is a flabby, goofy, comically inert cartoon.",
        "Some of Mr. Smith’s prior work made me laugh so hard that I cried; Yoga Hosers made me want to cry for different reasons.",
        "There’s enough weirdness for Yoga Hosers to possibly generate some stoner cult appeal, but it’s shoddily slapped together, with a clearly first-draft script, terrible editing (by Smith the elder) and continuity errors.",
        "Even fans who've stuck with Smith for two decades may draw the line at this outing, which offers ingredients just as inexplicable as those in Tusk (it's a sort of spinoff of that film) without the captivating weirdness that sometimes brought that midnighter to life.",
        "Trouble is, Yoga Hosers isn’t really a movie. It’s a quarter-to-1:00 a.m. SNL sketch, nightmarishly distended into oblivion. It’s a corny Canuck joke, told for 88 surreally unfunny minutes. It has a target demographic of one: He wears hockey jerseys and, again, loves his daughter.",
        "Any of the film's attempts at moralizing are subsumed by Kevin Smith’s obsession with taking aim at his critics.",
        "Yoga Hosers is lazy, unfunny, and self-indulgent.",
        "[A] lazy affair that aims for inspired lunacy but misses the mark by a mile.",
        "If it’s true, as Kevin Smith noted in his lengthy introductory remarks at Sundance, that “failure is just success training,” then he should be in the best shape of his career after Yoga Hosers, an imbecilic, strenuously wacky helping of see-what-sticks juvenilia.",
        "Unless you’re Kevin Smith, don’t expect Yoga Hosers to be funny or clever or well directed. It isn’t for you.",
        "Mr. Garman’s showcase has very little to do with anything else, but he’s a pal of Mr. Smith’s and, at the very least, his performance is a filet of wit amid a heaping helping of comedic byproduct.",
        "Instead of a film that’s gleefully outlandish (see: “Sausage Party”), Yoga Hosers is a drag. It contains none of the vivacity of “Clerks,” “Mallrats” or “Chasing Amy,” and plenty of references to those days of yesteryear. It’s a cannibalization of all that we once loved about Smith and his movies."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Charming in that slapdash, \"Kevin Smith\" way - but not very funny, and shave off more laughs if you're not a part of Smith's in-joke club (like I am).",
            "review_date": "2016-09-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The conversations between the girls for a lot of the movie were pretty interesting and I was enjoying the film.  Then the end happened and the film completely lost its way.  With just ridiculous characters and Ralph Garman doing impressions.The conversations between the girls for a lot of the movie were pretty interesting and I was enjoying the film.  Then the end happened and the film completely lost its way.  With just ridiculous characters and Ralph Garman doing impressions.  I like and defend Kevin Smith but the second half of this film is indefensible. The first half gets a B the second half an F. So a generous C-",
            "review_date": "2016-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It may not be the nex big KS movie but you can tell he enjoyed making this movie with his daughter.\rDumb jokes with nazi bratwurst so expect stupidity.\rIt was a stupid yet fun ride.",
            "review_date": "2016-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brutal honesty: This film was made simply because Kevin Smith's daughter and her friend (who happens to be Johnny Depp's daughter) wanted to be in a film. Period. It stands as a reaffirmation that Kevin Smith's creativity crested with \"Dogma\"Brutal honesty: This film was made simply because Kevin Smith's daughter and her friend (who happens to be Johnny Depp's daughter) wanted to be in a film. Period. It stands as a reaffirmation that Kevin Smith's creativity crested with \"Dogma\" and then fell off as rapidly as a crashing jet. Tired jokes and stereotypes about Canada, horrible plot, idiotic characters with almost no character building, cheap effects...\r No doubt he'll just blow off all of the negative reviews as haters or people who just don't get it. Maybe that last part is true. Maybe the only person who \"gets it\" is Kevin Smith or people who are so stoned out of their head that anything with flashy lights can seem like a great film (by his own admission, Smith is one such stoner). The only good thing I can say about the film is: Well, it wasn't as bad as Nine Lives.",
            "review_date": "2016-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Saw this with my daughter, who is Mr Smith purported target audience and as a long time podcast listener we were both bored out of our minds. We managed to get to Johnny Depp's second scene and she wanted out. I caved and skipped to theSaw this with my daughter, who is Mr Smith purported target audience and as a long time podcast listener we were both bored out of our minds. We managed to get to Johnny Depp's second scene and she wanted out. I caved and skipped to the action scenes at the end and although she was more amused all I could think was that Gremlins did it all better.\r It's just not funny, everything misses, I wouldn't even know where to begin picking apart it's flaws. It's top down, inside and out.\r Maybe as a Smith/Depp family movie I'm sure they love it but as a fan of Kevin Smith's 8 stories he keeps retelling endlessly on his podcasts and as a dad I was sorely disappointed.\r Last word for my daughter:\r Boring!",
            "review_date": "2016-10-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I like Kevin Smith, I listen to Smodcast regularly and I appreciate his \"why not\" attitude, but that doesn't mean his audience has to lap up whatever happens to leap from his head. I went into this movie thinking, well... \"why not\"? But I wasI like Kevin Smith, I listen to Smodcast regularly and I appreciate his \"why not\" attitude, but that doesn't mean his audience has to lap up whatever happens to leap from his head. I went into this movie thinking, well... \"why not\"? But I was left just thinking \"why?\"",
            "review_date": "2016-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the worst movies I have ever seen in my entire life.  I hope Kevin Smith and everyone else involved kil themselves after the impact of this movie finally hits them",
            "review_date": "2016-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best movie of 2016 - KS' masterpiece meant for the archives or destined to be launched on a satellite to show distance life the best humans have to offer.\r You have hosers doing yoga. Whats this about a hot dog nazi you ask?",
            "review_date": "2016-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Full disclosure: I paid to see Yoga Hosers because I'm a fan of Kevin Smith and support his endeavors for all the free funny he provides in the form of Podcasts and You Tube content. That said I liked the movie more than I thought I would!Full disclosure: I paid to see Yoga Hosers because I'm a fan of Kevin Smith and support his endeavors for all the free funny he provides in the form of Podcasts and You Tube content. That said I liked the movie more than I thought I would! It's something of a mashup of Clerks (because they're in a convenient store), Critters (cheesy monsters) and Bill & Ted (goofy teenagers living in their own pop culture bubble). The movie isn't meant for me, but I feel like I need to defend all of the **** reviews he's getting. It seems like most people's complaints center around the movie is un-relatable (It's make believe folks!) or the fact he puts his friend's in it, which is something people gripe about with Adam Sandler or any Judd Apatow picture. I'm not comparing Smith to either of those guys, but he's been upfront and earnest as can be about who this movie was intended for. Tween girls, not himself. He believes that once it bombs in theaters it will eventually find its intended audience. Until then, maybe we can douse the fires and put away the pitchforks. So here's a 10 big Kev.",
            "review_date": "2016-09-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Kevin Smith's follow up to horror-comedy Tusk and the second entry in the \"True North Trilogy\" ups the humor, weirdness, and stupidity. You can tell it was built from the ground up to be a dumb B-movie. It's evident that Smith and crew wereKevin Smith's follow up to horror-comedy Tusk and the second entry in the \"True North Trilogy\" ups the humor, weirdness, and stupidity. You can tell it was built from the ground up to be a dumb B-movie. It's evident that Smith and crew were having a lot of fun making it. Fortunately some of that fun makes it's way into the movie making things a little easier for audiences to swallow. One just has to come into it with expecting outlandish absurdity.Much like Tusk, the movie is kind of batcrap crazy. Only this time it's more in the realm of just plain stupid. It's a fun kind of stupid, but stupid nonetheless. The kind that's going to turn off a lot of people that don't have a stomach for over-the-top ridiculousness. The intentional silliness and refusal to take anything seriously is amusing. Smith fills the movie with clever one-liners and amusing scenarios that poke fun at this technology obsessed generation. The ranting of an old man? Perhaps. Luckily the two leads are given some sharp dialog to combat it and provide the audience with some chuckles.Eventually though all this goofiness and oddball imagination reaches a point where it all beings to feel like too much. That's when the \"Bratzis\" (bratwurst Nazis) finally show up. We an amusing first conflict and then the plot deepens, we meet the main villain, and we start wishing things would wrap up already. Mercifully it does, but not before that eccentric sense of humor and absurdity that started as the movies strange sense of charm and strength in spite of it's flaws starts to get on our nerves. Then there's the stuff where Smith just takes shots at his critics.After Tusk I was expecting something weird, funny, and maybe even moronic. Turns out that's exactly what I got and I found myself suitably amused throughout the majority of it's runtime. It lacks Tusk's charm and quality (a big red flag should be going up if you didn't like that movie), but altogether it can prove amusing if you're just looking for some cheap laughs and something different to watch with your brain turned off. If B-movie horror-comedies aren't your thing then don't bother checking this one out. It's the kind of movie you watch for the silly jokes and just to see what kind of bizarre crap happens onscreen. It does go to moronic at times, but it's not a total waste of time if you know what to expect. And let's be honest, the plot description should give you a pretty darn good idea of what that is.6.2/10",
            "review_date": "2016-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This isn't a master piece, but take it for what it is. It's a comedy, and it's funny. That said: Enjoy yourself. This was well done for its budget. Maybe a little offensive, there are Brazis in it after all, but it comes together.",
            "review_date": "2016-09-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Kevin Smith has once said that any idea that he comes up (even if it's a bad one) he can't turn down.\r You should.\r\n\r\nYoga Hosers feels more like a bad SNL sketch then an actual movie. Well, South Park can also be thrown in the mix, butKevin Smith has once said that any idea that he comes up (even if it's a bad one) he can't turn down.\r You should.\r Yoga Hosers feels more like a bad SNL sketch then an actual movie. Well, South Park can also be thrown in the mix, but even it's bad episodes isn't as annoying or painful than this garbage.\r But then again, I am just an evil critic who hates everything and everyone. Or that's what Kevin Smiths sees or thinks when reading critical reviews. That's an actual scene in this where a character goes on quick rant on someone by calling them a soulless evil critic who hates everything. Which is basically away for Smith to get all of his anger out from the last critical bombs. Sorry but I think Iñárritu got that across a lot more smarter in a much superior film called \"Birdman\".\r F\rU\rC\rK\r Y\rO\rU\r Oh and there's this tried gag in the movie where every Canadian say ABOOT (about). The reason why I'm bringing this up is because the film literally focuses on this way too much and the running joke got on my nerves quicker then I imagine. Yes I get it they saying it differently. I'm guessing it's suppose to be funny, because of how intentional the actors say it, but even for a joke it's still piss poor.\r Alright I'm done talking about this piece of ****",
            "review_date": "2016-10-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film will never be part of the Criterion Collection, but I have a feeling that if you have any knowledge of Kevin Smith’s filmography you would know that going in. Yoga Hosers takes place in the same universe as Tusk & is apparently theThis film will never be part of the Criterion Collection, but I have a feeling that if you have any knowledge of Kevin Smith’s filmography you would know that going in. Yoga Hosers takes place in the same universe as Tusk & is apparently the second part of a new trilogy—The True North Trilogy—and it’s absolutely ridiculous. It’s also one of the most fun experiences I’ve ever had in a theater. Harley Quinn Smith & Lily-Rose Depp are awesome reprising the Colleens from Tusk. Also returning is Johnny Depp’s Guy Lapointe, who has to be the most ridiculous character of Depp’s career. You’ll recognize the usual gang of idiots you expect to find in a Smith film, and quite a few more…the cameos never seem to stop on this one! If you need special effects more advanced than anything spotted in the Puppet Master franchise, this may not be for you…but if you just need to get out and have an awesome time, it’s worth checking out!",
            "review_date": "2016-09-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Anyone bashing Kevin Smith, what were you expecting?  This was a good time at the movies, the 2 Colleen's were great characters and hopefully will be part of the \"crew\" moving forward in the cameo roles in the new Mallrats, and whatever elseAnyone bashing Kevin Smith, what were you expecting?  This was a good time at the movies, the 2 Colleen's were great characters and hopefully will be part of the \"crew\" moving forward in the cameo roles in the new Mallrats, and whatever else Kevin has coming up. The wait in between his films is hard enough, just go and enjoy! Kevin Smith fans will support him no matter what he does. Haters gonna hate I guess!",
            "review_date": "2016-09-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't get it. I know everyone hates this movie but seriously, what the hell is this? Kevin Smith just does things for himself now with no regard to anyone else and it's supposed to be an artist's liberation? Very few auteurs get away this,I don't get it. I know everyone hates this movie but seriously, what the hell is this? Kevin Smith just does things for himself now with no regard to anyone else and it's supposed to be an artist's liberation? Very few auteurs get away this, let alone Smith and art this ain't. Everyone needs perspective and Smith seems to have completely lost it in service to his internet fanboydom that's become all about feeding his ego.",
            "review_date": "2017-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In yoga, you're right and they're wrong.They have targeted two things in this film. Mocking yoga and attacking (film) critics. They knew the film wouldn't be good enough for film critics, so they used an indirect attempt to slam them. AndIn yoga, you're right and they're wrong.They have targeted two things in this film. Mocking yoga and attacking (film) critics. They knew the film wouldn't be good enough for film critics, so they used an indirect attempt to slam them. And for as yoga, martial arts would have been a better idea, though they wanted the spiritual effect. Especially from the perspective of two current generation girls.\"This is so basic.\"This is a spin-off of the director's previous film, 'Tusk', starring Justin Long and he can be seen in this as well in a different role. A tale of two high school girls who work part time in their father's mini supermarket. They are passionate about yoga and got a best yogi to train them. But when they encounter an unexpected threat, they exploit everything they have learnt to tackle the situation. That's the story, and then follows the conclusion.With this, Johnny Depp's daughter Lily Rose was introduced to the film world. I did not know he was in this, I had to find out after I heard his voice, but he was in a completely unrecognisable appearance. Father, daughter working together, that too in her first film, really wonderful to hear, but the choice of film does not convince. Seems a good concept, but a bad story and execution. Particularly, it was like a 40 minute television episode, so for a feature film it was too short and stupid. At least it is watchable, but not worthy, so I suggest you to make a right choice if you haven't seen it.4/10",
            "review_date": "2016-12-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely no effort from anyone involved.The script has clearly been written in a few hours. The acting from Smith and Depp's daughters is single-take and the extras all put in better performances than the leads, because they clearly allAbsolutely no effort from anyone involved.The script has clearly been written in a few hours. The acting from Smith and Depp's daughters is single-take and the extras all put in better performances than the leads, because they clearly all thought they were going to be in a real Kevin Smith movie.This isn't a real Kevin Smith movie. It's a home movie, made to put something on the Smith/Depp daughters resume, and was doubtlessly put together within a week. Don't bother wasting your time, here...... They didn't.",
            "review_date": "2023-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow what can I saw about this one. Stupid, not funny and just ignorant. The once promising career of Kevin Smith is now tarnished. This movie tries so hard to be funny and fails on every single joke. Your mouth will drop on how asinine theWow what can I saw about this one. Stupid, not funny and just ignorant. The once promising career of Kevin Smith is now tarnished. This movie tries so hard to be funny and fails on every single joke. Your mouth will drop on how asinine the jokes are and just the whole scope and direction of the film is.",
            "review_date": "2017-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This esoteric follow up to Tusk from director Kevin Smith is bewilderingly strange, and uninspiring. Smith and Depp (the youngers) are both adequate but unpolished, though the ridiculousness of the script didn't really call for excellence.This esoteric follow up to Tusk from director Kevin Smith is bewilderingly strange, and uninspiring. Smith and Depp (the youngers) are both adequate but unpolished, though the ridiculousness of the script didn't really call for excellence. Depp the elder reprises his role of detective-with-atrocious-accent, perhaps included to make this a complete family affair. The storyline is dumb, the pacing is odd and mercifully the film is brief. Where Tusk was hideously unsettling, this is strangely banal and absurd in equal measure. Do not bother, even if you're a Smith fan. 3.02/10",
            "review_date": "2016-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Yoga Hosers has a stupid story executed kinda poorly, so I get why many people hate on it, but it has charm. I think the plot (though silly beyond belief) is fun, the two girls have great chemistry and Johnny Depp's Guy Lapointe actuallyYoga Hosers has a stupid story executed kinda poorly, so I get why many people hate on it, but it has charm. I think the plot (though silly beyond belief) is fun, the two girls have great chemistry and Johnny Depp's Guy Lapointe actually worked for me this time. I genuinely enjoyed the first 2/3rds of Yoga Hosers, but the last act is just trash.",
            "review_date": "2018-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Sorry boot that.\"It would have been a 3 star before that but that's the laziest Canadian joke one can make.  Beyond that, it's like they just aimed for the lowest common denominators.  And the casting is just Hollywood nepotism at its worst.",
            "review_date": "2017-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A very poor comedy that relies on stereotypes far too much, and very unfunny humour. I'm not sure if Kevin Smith has too much money and is just finding ways t get rid of it, he used to be very funny, but seems to be losing it these days,A very poor comedy that relies on stereotypes far too much, and very unfunny humour. I'm not sure if Kevin Smith has too much money and is just finding ways t get rid of it, he used to be very funny, but seems to be losing it these days, certainly after this and Tusk.",
            "review_date": "2017-03-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honestly, I know it was stupid... Ridiculously stupid, but it was so dumb that it was hilarious. The acting could've been better, but all in all, it wasn't as bad as the critics made it out to be.",
            "review_date": "2019-09-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not exactly sure why so many people dislike this movie.  It is a fun horror light movie it is a very good vehicle for the two main stars.  It's certainly not redefining any genre or a super deep movie.  But what it is, is a movie with charm,Not exactly sure why so many people dislike this movie.  It is a fun horror light movie it is a very good vehicle for the two main stars.  It's certainly not redefining any genre or a super deep movie.  But what it is, is a movie with charm, fun and memorable moments as well as a bad guy that chews the scenery in all the right ways.",
            "review_date": "2021-11-28",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 41
}