{
    "title": "Tees Maar Khan",
    "rating": 2.6,
    "release_date": "2010-12-24",
    "num_reviews": 176,
    "genres": [
        "Comedy",
        "Crime"
    ],
    "summary": "Posing as a movie producer, a conman attempts to trick an entire village into helping him rob a treasure-laden train.",
    "reviews": [
        {
            "review_title": "I Feel Cheated",
            "content": "There are different expressions and feelings one has when he comes out of a theater after watching a film. At times I am thinking, at times smiling, at times in awe of what I just saw and at times thanking myself for not being one of the characters. When I came out of the houseful theater on the first day second show of Tees Maar Khan (TMK), the only emotion I had was anger. Sheer anger. I felt cheated and betrayed and disappointed. This is going to be the worst review I will ever write for a movie.Main Hoon Na and Om Shanti Om did not go too well with me either and I am not too agreed with the Farah Khan way of filmmaking but TMK still managed to shock me. Farah is a fantastic choreographer but as a director, she just killed a cine-goer inside me. The best thing about this two and a half hour was the promo of 'No One Killed Jessica'. I am so looking forward to that.Apparently an official remake of After the Fox, TMK is a story (if it can be called a story) of a con artist pretending to be a film director to put his hands on 10 tons of precious antiques. During this process you come across Three Gay partners of TMK: I don't know why they act gay but they do. Probably it was supposed to be funny. Two Gay cops chasing TMK: they don't act gay; they are gays and they even hint at marrying each other. Three Gay villagers: they become friends with Katrina Kaif and she calls them girls. Twin Criminal brothers: and they are not just twins, they are conjoined twins. Not to forget, they wear gay clothes and act gay too.With all this overdose of gay jokes, there are idiotic police officers trying to nail TMK down and they crack unbelievably horrible jokes. There is TMK's mother who is slightly better than the rest when it comes to being funny. The film starts with a lousy animated title song of a baby in the mother's womb and he has his eye brow pierced even then. In the time when special effects have gone to a new level, TMK brings a basic animation which makes you wonder where the film is headed to.Songs come out of nowhere and are forcefully fitted in to the scenes. The overly hyped Sheila comes and goes in the first fifteen minutes. A scene finishes and TMK decides to call his friend Salman Khan of Dabangg for a song and dance. Are you serious? The choreography, however, is good. 'Wallah Re Wallah' and 'Bade Dil Wala' were enjoyable.The film has Akshay Khanna as Aatish Kapoor in the worst possible supporting actor role. He plays a film actor who wants to win Oscar just like Anil Kapoor did for Slumdog. Interestingly, Anil never won an Oscar for that film. Aatish also comes up with his own version of Jai Ho called 'Day Ho'. Yes, Day as in DAY TIME. He thinks it's funny and dances on this song with great zeal. He is probably mocking Saif Ali Khan because he is also seen in a Saif like bandana.Katrina Kaif has lost a lot of weight and looks good with her navel show throughout the film. She is one actress who follows the director's brief to the tee because she knows she is not talented enough to improvise. Here too, she seems to be following the director's brief and overacts as much as possible. Actually, she overacts more than it's humanly possible for any actress.Actress, I said, because Akshay Kumar is also there. What was he thinking? I have no idea. To start with, 50% of the times he also acts gay and delivers his dialog with lady-like hand movement and voice. Mostly when he is playing the movie director. It seems to be deliberate a take on Karan Johar though. Here is an actor who was touching the pinnacle of his career a year back with highest grossing and enjoyable films but since Singh is King he has come up with one dud after another.The less said about Farah the better it is. My main culprit, however, is Shirish Kunder. Mr. Kunder is trying to pull up a one-man-show here. He is the writer, editor, lyricist and even the producer of TMK. As an editor, he has a credible history but as a writer his previous work is 'Jaan-e-man' which he also directed. That Akshay starrer was also a pretty lousy show. I would strongly suggest Mr. Kunder to remain in his limits i.e. editing.TMK is likely to have a 50 crore opening weekend which has so far been achieved only by Dabangg. It will be a shame if it grosses more than Dabangg did because Dabangg was a very highly entertaining effort. TMK will for sure recover its cost and make profits for the producers (which is unfair) but I don't expect it to do well with audience in the second week onwards.I go to the cinema with the expectations to at least get value for my money and time. In that regard, TEES MAAR KHAN is not a movie. It's a CRIME and the people behind it need to be punished in such a way that it becomes example for others attempting to create such a shame.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most irritating movie of all time",
            "content": "Right from the first scene till the end scene the viewers will ask question to themselves what is going on.plain jokes and it looks like the actors were told to deliver the dialogues by themselves as the director couldn't get the dialog writer. plain jokes, over acting over the top performance from each and every actor even the most serious natural and sober actors like akshaye, sudhir and anjan did over acting in this movie. songs boring, no action scenes. no problem, G3 and phir hera pheri which even AK didn't liked were far better movie and entertaining than TMS. why AK backed this project as producer and why farah khan is continuing movies after the crap MHN and OSO.she will never ever become manmohan desai.even her brother should stop making movies.Advice: don't waste your money and timerating 0.5 out of 10",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute rubbish",
            "content": "What kind of a film is this? There is no story whatsoever, not one joke is funny and everyone screams, screams, screams and screams in the film till you want to kill yourself in frustration.All the jokes in the film are in poor taste and just about everyone is made fun of. This is the kind of film that makes you wonder whether the writers of the film have any common sense or rather, does this film have any writer in the first place.The only saving grace is Akshaye Khanna who is in form and performs well as the Oscar-hungry actor.It seems as if Akshay Kumar wants to end his film career by choosing to do films such as this and his string of pathetic films in the past 2 years.Director Farah Khan has shown a lot of promise in her first 2 films and must write scripts herself instead of entrusting this responsibility to others.Shiela Ki Jawani has been superbly choreographed and the end credits are in trademark Farah Khan style.But are you ready to endure two hours of torture for 10 minutes of fun? Trust me, it's not worth it.A nonsensical, idiotic, lame and senseless film. Avoid it at all costs.",
            "review_date": "2010-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What the FK is going on?",
            "content": "Farah Khan (FK) seems to have lost her bearings with this one. Being fun loving and irreverent is one thing, but making a movie full of PJs is really pushing it! Akshay Kumar's brand of comedy seems completely out of sync with Farah's brand of humor and the result is a disaster only made tolerable if you are salivating over Katrina Kaif grooving to 'Sheila Ki Jawani' or seeing Akshay and Salman dance together. The script is pretty nonsensical and a stretch even by outrageous plot standards (a conman making a fake movie and convincing a big Bollywood star that it will win an Oscar? Seriously, give me a break!!) and the jokes are pretty weak all through. Tees Maar Khan, for lack of a worser word, is utter trash!",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie of 2010",
            "content": "TMK is the worst movie of 2010. The story is awful and direction of Farah Khan is even more awful. I wish Farah had put more effort in script rather than songs. Apart from Akshay Kumar nothing is this movie is good. Some of his cheeky dialogues will make you laugh but again its not worth to watch the movie.Movie has copied several scenes from various movies and Farah has tried to put all Masala in the movie for which she is famous for. But unfortunately story don't have the weight to carry this movie. Senseless jokes are not going to make a movie entertaining.Don't watch the movie. That's my verdict. Forget about previous movies of Farah Khan, they were good because of SRK and the direction tips she were getting from Karan Johar. This movie seems good only during the songs.Worst movie of 2010.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a movie!!!!!!!!",
            "content": "This wasn't a movie it was \"the change\" in passive sense.it was a bloody slap on the face of Indian cinema entertainment.nothing was of sense ,cant be categorized under any category.was it done just for money making by taking big stars and releasing on Christmas. May god Save the Indian cinema from the bad effects of upcoming nonsense movies Like this. Never watch this movie .... Few stupid things to be noticed: -- -poor jokes, poorly executed action sequences –dialogues full of overacting. –good actors were not able to show their talents due to bad direction and poor script. –promotion was done as if a blockbuster movie was going to be released.A strict law should be made to check the movie's quality before its release, because its just like robbing viewers pocket in a gentle way ..",
            "review_date": "2010-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "want to take revenge from your enemy? just tell him to watch this",
            "content": "By making this movie the Bollywood directors-producers had clear this thing that we people are mad and we'll clearly like this BULLSH!T which has made by them...and i think they are right, what we Indian viewers really want is the senseless comedy, item numbers and the great stars like Akki-Salmaan that is why the movies like TMK, No Problem, G-3, Dabangg etc etc are the big hits...this is creating trouble for those viewers who like the off beat films, the directors-producers of India are making these comedy films and in reply they are making the huge profits out of it because of us only, i never wanted to see this movie but my parents insisted me and i was there at the cinema, starting 5 minutes had clearly explained us that this movie will be not easy to handle at all, and yes i was right...script poor, storyline average, acting of the full cast except Akshay Khanna was seriously poor and poor direction...people don't like the movies which need to use mind and this is clearly proved by making such a SH!T...i am angry now, this is the waste of money, time and cast! Sorry if i had hurt anyone's feeling but this is true which i had mention above.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why does everyone hate this movie so much?",
            "content": "I thought this movie was incredibly hilarious. The makers tried to introduce a different type of humor thats more commonly found in western films. Maybe the Indian audience is not able to relate to it, and thats ok.If you like movies such Zoolander, Ace Ventura, sausage party, give this one a shot and you might like this as I did too!",
            "review_date": "2019-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Inane and Pedestrian!",
            "content": "TEES MAAR KHAN Bollywood is replete with examples of fetishes of film makers who closely associate these fetishes with the success of their films. The earliest example is that of film maker J Omprakash who always wanted his movie titles to begin with A; and in recent times we have the example of Karan Johar, who has a similar fetish with the letter K. Farah Khan, who began her career as a choreographer and quickly moved into the shoes of another Khan choreographer (Saroj Khan) quickly won a lot of acclaim for her work and then decided to expand her role to include film direction. Having got the box-office ringing with her first two ventures, MAIN HOON NA and OM SHANTI OM (both of which had Shah Rukh Khan playing the lead), she perhaps concluded that since both the films had three words, three is a lucky number for her. So soon after the success of the first two movies, she gave birth to triplets and her husband, an electronics engineer, Shirish Kunder and she floated a production house called Three's Company! She also perhaps knew that the presence of Shah Rukh Khan in the first two movies was a big factor for the success of those movies, but because she was not having him in her next movie (I will not go into the reasons for that here), she felt that the word KHAN appearing in the title would help. When she was finding it difficult to combine the word KHAN with her fetish for \"TEEN\" to get the title of her new movie, I presume a well-wisher perhaps told her that using a multiplication factor of ten would triple the chances of the movie's success; thus the word \"TEES\" came into the title. The choice of the third word was relatively easy, since the phrase TEES MAAR KHAN connoted a braggart and which was in tune with the character of the script itself. The next exercise was to find an inspiration for this tale and happily for her, that was also a three worded Peter Sellers starrer: AFTER THE FOX. Also, perhaps other well wishers suggested to her that she must have as many Ks as was possible in the film crew and therefore had her husband Kunder work for the background music, write(?) the story, co-produce and write some of the lyrics. The star cast also had a number of Ks: AKshay Kumar, AKshaye Khanna, Katrina Kaif, Sachin KhedeKar and special artistes like Salman Khan and Anil Kapoor! Now about the movie itself. Claiming to be a parody, it turns out to be a rather inane effort. Several scenes of the movie looked utterly pedestrian both in conception and execution and the only saving grace is the performance of Akshaye Khanna in the role of an Oscar hungry actor. Of course, the review will not be complete without the mention of the much touted Sheela Ki Jawaani number by Katrina Kaif; but Katrina with her innocent looks doesn't ooze with oomph despite the raunchy lyrics and the dance movements. I would rate Munni Badnaam from Dabangg (also choreographed by Farah) as a better song although the joke which I heard when I was coming out from the theatre was: Agar Sheela Ki Jawaani Pehle Aati, to Munni Badnaam Na Hoti!",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Farah Khan Has Lost It.",
            "content": "Having heard over the past two years that this film was \"on\" and then \"off\" and then \"on\" and then \"off\" and then finally \"on\" again, it made me feel like that someone was switching the lights on and off countless times. Then I heard that SRK and Farah Khan had fallen out with each other and that Akshay Kumar was in along with Katrina Keif.Written by Farah Khan's husband, Shirish Kunder, the theme of the movie is based on an old Peter Sellers movie, \"After the Fox.\" A thief gets his chance to plan to rob a train and he does this by hiring a actor and a movie shoot in a village nearby.Starring Akshay Kumar, Katrina Keif, Anil Kapoor, Akshaye Khanna and Arya Babbar, the movie is directed by Farah Khan, written and Produced by Shrish Kunder and Ronnie Screwala. Vishal Shekhar provide the music score.Farah Khan has had a previous \"flop\" on her hands - \"Janemaan,\" though it was not directed by her but by Shirish Kunder. That movie did not star Shah Rukh Khan either but the other two, \"Mein Hoon Na\" and \"Om Shanti Om\" did and proved to be successful for her, though the latter did have some problems.Katrina Keif, though has lost a lot of weight and ensured that her style of dancing could be compared that of Malaika Arora Khan in \"Sheila Ki Jawani\" compared to \"Munni Badnaam Hui.\" Serious roles, such as the one in \"New York,\" suit her better then the one she plays in this one.Akshay Kumar, perhaps needs to consider doing serious roles than this. Certain types of comic roles do suit him and he does execute them very well. But unfortunately, this cannot be said here.The music! Well the only thing that can be said is that at least one song - \"Sheila Ki Jawani\" is a memorable number, though it has come under a lot of criticism since the release of the movie. One other member of the industry that Farah Khan had always had but didn't this time was the music director, Anu Malik.The plot fails to lift off, the comic lines and the dialogues could have been written well and its with this that I conclude that this was a movie that was riddled with disaster from the moment it was announced.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Underwhelming experience",
            "content": "Watching Tees Maar Khan was an underwhelming experience. I went in to this movie with mixed expectations. I had high expectations based on Farah Khan's previous efforts - \"Main Hoon Naa\" and \"Om Shanti Om\". At the same time I was not fascinated with Shirish Kunder's \"Jaan-E-Mann\".Tees Maar Khan sets a new low in story telling, narration, poorly conceived characters, direction....the list goes on. The movie revolves around Akshay Kumar playing the title role of a conman who steals antiques by tricking the police. While this seems like enough meat for the story to make a 2-hour movie, however watching the movie proved otherwise. To start with there are not enough sub-plots or situations that highlight the mastery of a con-artist. Perfect example of a movie that highlights this need is \"Catch me if you can\", where there are multiple sub-plots that highlight the skill of the con-artist. There are not enough twists and turns in the story to keep the viewer interested. In general the narrative does not stick to a focused plot; there are miscellaneous gags, unwanted songs, meaningless sub-plots which only add to the misery of the viewer. All the above can be ignored if this is a movie that is not to be taken seriously. There are examples of movies that thrive on frivolity where twisted humor takes center stage and captures attention of the viewer (Austin Powers, Main Hoon Naa are good examples). But this movie is not funny either. There are a few good one liners and hysterical situations that do tickle the funny bone. But even more irritating are the umpteen attempts in the guise of painful dialogues and gags that are intended for humor, but do not really evoke laughter. Trying to laugh at some of the sequences in this movie is like an aborted sneeze which I want to get out of my system, but cannot.To exacerbate this pathetic movie, there are half baked, loosely defined characters that are acted out by clueless actors. Akshay Kumar tries hard, but has very few opportunities to excel. Akshaye Khanna actually does a good job of playing the role of a self-adulating actor who is obsessed with the idea of winning an Oscar award. But his character is too one dimensional to keep the viewers interested. Katrina Kaif gets the award for playing the role with maximum screen time with minimal relevance to the movie.To summarize.... save your self the time and money this holiday season by giving this movie a skip.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "New scams on rise!!!",
            "content": "I tried to see this movie last night with my wife in a multiplex called PVR Cinemas.I divested Rs. 540/- as ticket charges on the movie. One by one i was getting signals from nature not to see the movie. Like first i did not get enough time to get my favorite sub at Subway, but i thought i'll buy nachos inside PVR. Even inside i didn't get nachos, on top of that i also did not get the sandwich inside PVR. I ignored all these bad signs and went ahead to see this AWFUL, CREEPY, MINDLESS movie.Akshay kumar once knew acting, he may know it now also but the great director Farah Khan is utilizing all her resources to bring the man (Akshay) down by using cheapest of cheapest PJ's in the movie. I wonder who write these, moreover who approves these... Once upon a time she also made a movie known as \"Main Hoon Na\" which i liked to some extent as it is a light hearted movie, but TMK is not something i expected.I still like akshay as a hero/actor, he has done so many good movies.I beg him not to do movie like these, plz plz plz.Believe me friends you can laugh at least 100000000000 times more by just watching 1 performance of any character in Comedy Circus.( i don't know how many zeor's i added here because of frustration) Please avoid this movie to save yourself from heart attack.Last night i have vowed not to see any forthcoming Farah khan's movie unless and until i get at least 100 out of 100 good reviews.I think this is a scam by which Hindi film industry is trying to make films which ppl will leave before ending (like i got 15 minutes after the interval) and they still have to pay money for the full movie.",
            "review_date": "2010-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TMK \"I need my money back or I should get rewarded to handle this jigsaw kind of torture\"",
            "content": "Just watch \"After the Fox (aka Caccia alla volpe released in 1966 US n UK)\" it's totally copied from that and therefore no need to say about the movie, more frankly; script needs a super computer to understand and then let others understand that what was happening in it, I live in Mumbai and I admire Akshay Kumar a lot, n believe me this TMK \"Sucks\"; only stars can't make good movie u need a \"script\" and here it's all messy, farah should love her husband but don't pamper him by making a bogus movie on his stupid script, this movie is worthless 4 those who have brain and completely made for zombies (brainless), katrina is beautiful but she failed here so as farah's nonsense direction, so don't misguide people because it's their hard earned money and should not be get fooled.... have a great life cya...... advice to farah plz don't direct movies u r making us (indians) look like a fool in front of the international cinema, akshay plz read script b4 u sign anything, katrina u need serious acting lessons don't b a dumb, and to writers plz get a life and stop copying movies from Hollywood, don't ruin Indian cinema... TMK is just awful and a great shame in terms of cinema",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Extremely Awful",
            "content": "Watching Tees Maar Khan was an underwhelming experience. I went in to this movie with mixed expectations. I had high expectations based on Farah Khan's previous efforts - \"Main Hoon Naa\" and \"Om Shanti Om\". At the same time I was not fascinated with Shirish Kunder's \"Jaan-E-Mann\" but this movie is even worse.I was so stupid that i thought this Comedy would be better than the other comedies that were out this year, but i was so wrong once again. Bollywood movies are so much disappointing me, like never before. what is happening. i am so stupid i expected a good movie from the great Farah Khan. the music already wasn't much impressive, considering Vishal Shekar's other 3 movies. Story was very much weak and completely annoying. screenplay was weak. nothing great about this movie anything. disappointing. silly bad movie.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incoherent, garbage bag of hamming entertainment",
            "content": "TEES MAAR KHANEntertainment is a tricky affair. On one hand, film makers present their conviction in an idea or story that can be moving or heart warming whereas some choose the shorter path to success by giving the audience a mindless mess of comedy that can only be short-lived. Careers have been established with the former ideology but disaster has struck when in the name of entertainment, what was served to audiences was a garbage truck full of forced humour, mindless plots, overacting and trashy dialogues. That has happened far too often lately. In retrospect, 'Main Hoon Na' was at least sincere with its story and performances. The actors, music and comedy combined to produce a refreshing entertainer. 'Om Shanti Om', at least the first half, was funny, musical and refreshing as well. However, while riding on the success and fame of two somewhat convincing successes, one does not gain the right to take the audience on a ride. Farah Khan has done just that and brought the audience down to her own level with 'Tees Maar Khan'. A supposed con-artist named 'Tees Maar Khan', along with his aides – Dollar, Soda & Burger is out to execute their greatest job so far: Looting the royal treasure from a running train with the help of villagers who have been beguiled into believing that it's all part of a movie being filmed. Get the point? Right from the beginning, nothing seems convincing at all. Akshay Kumar lauding his character with a multitude of dialogues indicating that 'capturing him is pointless' has no effect. DON says something similar but with lasting effect. It's because of something called 'direction' which is missing from this movie. The greatest Con- artist who fools Indian Police and the Interpol is so unconvincing that one would wish he would take up another job. Akshay Kumar overacts his way through a character that has no life, background or foreground. Numerous flops in the last 2 years still has him playing the repetitive roles in brainless flicks. Hopefully, 'Patiala House' can change things for him. Akshaye Khanna. What can one say for him. The Oscar hungry character of Atish Kapoor is funny at first but when he hams through every incoherent scene, it becomes an overkill of the once wonderful actor from 'Dil Chahta Hai' who was unforgettable as Sid. Some of the supporting cast that includes Arya Babbar, Sachin Khedekar, Murali Sharma and Apara Mehta have done better justice to their roles than even the lead actors. The only reason why people will knowingly spend money on this movie is because they were lured by Sheila Ki Jawani. That song is worthy of its hype. Rather, Katrina Kaif is worthy of her position in Bollywood right now. Her moves, classy attitude and to-die-for looks in the 'item number' will thoroughly entertain and Farah Khan has done her primary job of choreography quite well. We only wish for Katrina's versatility to be challenged as she was in 'Raajneeti'. Vishal & Shekhar will only ride on the success of Sheila and nothing else. Compared to Farah's previous two, this film's score is a dud. Even Salman Khan's cameo cannot save the mediocrity of Wallah re Wallah. The editor in the film must surely be the security guy outside Dhuliya bank since he was asleep all the time. The dialogue writer churned out only a handful of witty one liners before they too were lost in between the hamming, overacting, repetition and senseless situations. The key to successful comedies of late, has been in dialogues as one cannot really create funny scenes without a screenplay in existence. Cinematography was very average and this film lacks the big budget feel if at all it had one. In case it did, UTV will have to rethink Farah Khan's calibre as a director they can invest in. Farah Khan literally showcases her stupidity on multiple occasions. Take the airplane scene for instance where it all seems so over-the-top. The prolonging of the train's arrival in Dhuliya prepares you for the worst. The headless horse rider sequence was among the most incoherent of all, while the in-film director Tees Maar Khan's clueless behavior on the film's set must be an enactment of Farah Khan in reality. Finally when the train is stopped and the heist ensues, it all seems tragic as there was nothing funny, glorious or memorable about the basic premise of the 3 hour ordeal. The actors too, look weary of the proceedings in the end and one cannot help but dread Farah's intention of making a sequel to this time-wasting garbage of nonsense. 5.23 on a scale of 1-10.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Boring, Insufferable, Avoidable",
            "content": "Ever since Dabangg rocked the screens, Bollywood has been racing to come up with the next pure Masala entertainer. Tees Maar Khan promised all this and then some. Alas, the wait just got longer...Before I start on TMK, let me assure you I am a big mas ala movie freak – Wanted, Dabangg, Houseful, Singh is King, you name it I loved them all. Gosh I even liked Chandni Chowk to China! And didn't have too many problems with No Problem either... Tees Maar Khan however is not half as good as even the last two films mentioned. Which is why unabashedly promoting this film by linking it with Dabangg records makes me sad. And angry. More so, as it comes from a director whose last two films (Om Shanti Om and Main Hoon Na) were superb.The problem with Tees Maar Khan is... well, everything! Let me start with the storyline. A master thief who is smarter than everyone get his life's biggest challenge, of robbing a moving train. Not just some small treasure, but the whole train. So he makes a plan by getting a movie star and charading a movie shoot at a village next to the railway line, so that the villagers will stop the train and provide the manpower to take away the loot. Original? Well so it would seem in case you haven't watched the 1966 Peter Sellers' After The Fox. Which, by the way, was among Sellers' forgettable ventures, and is not even pure Hollywood – rather an Italian film. Anyways, our film makers picked up this DVD one fine day and decided to Bollywoodize it, with some item numbers and a mas ala touch. Could have been a cracker, but for that you need a great screenplay and rock solid direction, both of which are sorely missing out here. While watching the film, it seems the director went directly from the basic story-script to the dialogue writer asking for some memorable witty punchlines . You see, we're making a mas ala movie here, and Wanted worked, maybe only because of the dialogues... or is it? So \"Ek Bar Maine commitment kar Di...\" becomes something like \"Tees Maar Khan Ki Zabaan aur...\" uff whatever! Then there is the heavily promoted line of \"Tawaif Ki Lut ti Izzat Bachana aur Tees Maar Khan Ko Pakadna...\" which could really have been a nice memorable line. If only it did not come every 5 minutes in the movie. Now for the acting part. Or whatever passes for it. If you thought SRK hams, wait till you see Akki in this one. It is so over the top that a few minutes into the film you feel whether Farah Khan directed the movie, or was she busy tending to her triplets at home. Never expected Katrina to 'act' so it is not a let down at all. But Akshaye Khanna was fine. Not a great performance, which we expect of him, but given everyone else around this definitely deserved an Oscar!!! ;-) However, both he and Kat do not have much footage, and neither do the others. Why not? Read on...Okay so whats good? Need I tell anyone that Shiela Ki Jawani is one cool item song? Or that Wallah re Wallah has Salman dancing in pure Munni Badnaam Hui style. But what is even better is that if you are going to the theatre for these two, then you might as well come out in the first 45 minutes, once these songs are over. Yes, the director does not make us wait too long. And do watch out for the Sallu-Kat chemistry in the second song. Another saving grace is the editing. The poor screenplay and pathetic performances largely are subdued by crisp and fast editing which make you not realise the absurd crap you're watching. At least not till the last half hour of the movie when the editor probably fell asleep. Cant blame him, except for the fact that this guy is also credited with the story and screenplay too (Yeah they probably didn't realise too many people would have seen a 1966 Italian film dubbed into English) Considering the film is barely above 2 hours, cut out another half hour of songs, credits, etc you are left with an hour of complete nonsense partly saved by the editor. Although this chopping off large portions of footage probably consisted of everyone in the cast except for Akki's scene. Which mean unbridled loud acting – even by his standards. The inspiration of keeping the film short probably came from Dabangg. Good thought, but crisp editing is like a Tadka. Out here the Daal is missing. And rotten.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The worst movie ever?",
            "content": "I read a review somewhere warning people not to watch TMK even if they got free tickets and as I would realize later, the review was spot on.I saw about an hour of the movie and then walked out as it was intolerable. The so called gags are not funny at all. There is oodles of overacting by all actors and full use of clichés. Having seen Main Hoon Na and OMO, I know that Farah Khan likes to make brainless masala movies, but TMK is beyond brainless. The entourage of Burger etc. that follow Akshay Kumar, the stuck to each other brothers who speak at the same time, the gay CBI officers - it is NOT funny.What does one want from TMK - slapstick comedy - None ; humor - NONE ; great acting - NONE. I don't think Akshae Khanna will take much time to pull out his newly weaved hair when he sees this movie in a multiplex.Watch this movie only for 2 reasons: 1. You want to compare it with the worst movie you have ever seen 2. To watch Shiela ki Jawani on a big screen",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Would never suggest this movie to my foes",
            "content": "Don't worry I don't intend to dish out spoilers, giving away the synopsis or plot or even a hint on the story line. The movie opens with Sanjay Dutt narrating the hind sight into the protagonist's current state of affairs. I was wondering why Sanjay Dutt's voice was chosen, my roommate was kind enough to educate me on this choice. To start with Sanjay Dutt's voice is kind of synonymous with the comical negative character (read gangster, thief ...), attributed to the fame of Munna of Munna Bhai M.B.B.S. The start to the movie though does not leave a bad taste in the mouth, is not what a comedy flick should begin with.The movie lacks a theme or story line that would inherently support the intended comedy. For most part of the movie it seemed that the actors are trying in desperation to make the audience laugh. For example, a meeting of top cops of Mumbai chaired by the commissioner discusses the possibility (or a lack) of ancient treasures getting stolen. Gibberish is introduced in the form of a participant interrupting the speaker every few seconds. These puns cry for a few laughs at best, and in time become annoying.Akshay Kumar seems to have made a resolve to sink deeper with every new comedy flick; TMK adds value to that resolve. With such frivolous plot, the burden of carrying the movie rested solely on the shoulders of the actors, and they have done a fine job of letting that slip. Katrina Kaif with little or no role in the plot was intentionally brought in for her dancing prowess. I would suggest she take more dance classes before venturing this path again. Moving on to Akshaye Kanna, I'm not sure as to the link between his role and comical intent of the movie. His claim of donning a guest role in this movie is weak, he is present on screen through most of second half. This movie probably will do more damage to his acting career than fix it. The background scores and the songs are definitely not worth mentioning, half the numbers are remixes thus taking away the need for remix artists and DJs. None of the songs are worth humming, even the sticky \"Sheila ki Jawani\" with its bad hinglish lyrics. The movie sports an occasional burst of a kid shouting \"Tees Maar Khan\", ruining the few laughs for your money.TMK is bad rip from a 1966 movie \"After the fox\", which was a fun movie with character. TMK's story line is like evoking laughter by beating below the belt. The script fails to build the lead actor's character and hence does not muster any sort of harmony from the audience; it fails to evoke any kind of sympathy for the lead role as the story line jumps from comical to scary and to serious. The transitions, being abrupt keep the audience guessing the genre of the movie through its length.Half way through the movie the story line, actors, guest actors completely lose direction and wander in different direction. Some sequences either have no bearing on the movie or lack the chaining required in storytelling. The director seems to have lost the purpose when it crosses the half way mark. Many of the obvious realities have been over looked or abandoned to make room for mindless comedy which by the ways fails to make people laugh.A few takeaways from the movie, There are many ways to make the audience laugh; this probably is the worst way. Now that the benchmark for the worst, other would only need to just do incrementally better. This movie is a must watch to expand your scales for rating movies. I have expended time and money in watching this movie, I urge you to watch this movie to make me look less gullible.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crap",
            "content": "What a pathetic attempt at movie making?I knew before hand what to expect of a Farah Khan product. But this one surpasses my expectation. And not in a good way.Nothing about the movie is funny or sensible. The spoofs and the humor do not click. This movie is just plain pathetic low budget flick.The good part about this movie being low budget is that the marketing and song attraction will definitely generate enough footfalls to recover the distributor's , producer's and investor's moneyThe problem with this pathetic movie is that it gets way to predictable and boring. You are never excited to know what's in the next frame or next scene. In fact, you cannot wait for the movie to get over with.I believe that's the worst failure of any movie. If you're neither excited about the 'What's next' nor are you 'enjoying the moment' - that's when the movie fails.The songs are good - but again - what a waste!The only thing that is worth watching are: a) Sheela ki lachakti kamar b) Akshaye Khanna is sort of funny c) The first fake shoot scene of a bank robbery with a Vitiligo man pretending to be a GoraI wish these directors would stop dumping such non-nonsensical farce on the Indian audience. But in order for that to happen we should stop visiting the cinema halls and stop patronizing movies from these non-sense production houses.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movies of this century",
            "content": "I can't rate this less than 1 or else I would have rated it -1000000/10. People please don't waste your money in this c**p, I walked out after 15 minutes as my brain couldn't take the stupidity any more. Acting = fail, script = fail, directing = fail. I think a monkey could have written and directed a better movie than this. DO NOT WASTE YOUR MONEY (don't even bother downloading it). I mean I don't even want to write 10 lines (as I am forced by IMDb) regarding this stupid movie. This is why people don't respect bollywood movies. Katrina Kaif acted like a cheap prostitute from Amsterdam (if you know what I mean!), definitely not family friendly. I want to donate someone money to farha khan, so that she can learn how to write and direct properly. I am ashamed of liking her previous work. It felt like she went to toilet break when the acting was taking place. WORST MOVIE EVER.",
            "review_date": "2010-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pathetic, Horrible",
            "content": "An awful piece of utterly stupid so called jokes, pathetic acting, horrible script, overtly over enacted scenes. I don't remember seeing a movie as bad as this in a long time! One may feel that this movie is so called non-sensical comedy and I may not be the one who likes these but just to clarify on this, I have enjoyed Welcome, Jodi No. 1, etc! Even No Problem is a one time watch but this one is just too bad! The only good thing about this movie is its music. I don't understand how actors like Akshay Kumar end up doing such movies. A movie that just does well enough to spoil the festive mood. I got headache, I was super annoyed, I lost time, I lost money when I saw Tees Maar Khan!",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Money n Time Waster",
            "content": "Farah Khan in first place is a choreographer and does not know how to make a movie. She does not fit in a place of director. This movie can be considered like a lay man making a movie for the first time in life and jumbles it all up.TMK is a total disaster in Indian Cinema. This movie combines all Indian Movie scenes copied in one film which makes it a total mixture or call it Mix Bhel. This movie has a bit of good acting from Akshay Kumar rest of the cast does over acting in the film. The story line is nowhere seen in the whole script and it makes your head feel terrible when you exit the cinema hall. For the part songs 'Sheela Ki Jawani' & the title track are at least audible but the rest are more annoying. Overall I think i cant even rate this movie but for sake of a rating I would give it a 1 out of 10. So watch it at your risk.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't WATCH IT !!",
            "content": "I rarely review here at IMDb but i needed to review this particular film.The story is weak screenplay is weak the direction is LAME.The jokes in movie are all old and lame i say AGAIN ALL.I did'nt laughed on one joke,so senseless movie it wasOnly good thing about movies is its title song which is good and its item number 'Sheila ki jawani' rest all film is utter piece of crap i would suggest you to rather watch these two songs on youtube than to watch it in cineplex and waste your money and more importantly your TIMEI would suggest dear readers that please for god sake don't watch this boring movie.",
            "review_date": "2010-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do not bother to see this movie",
            "content": "Catch a repeat of another Farha Khan movie instead. The director has let herself down big time with this one. The plot is utter nonsense (if ever was one), gags are outdated and overdone. Dialogues are no better than a B-grade movie. In fact you sometime get better trash from the b-graders. There are couple of ads stashed in too. The whole thing is quite fast paced, a blurry hazy 2.15 hr run of absurdity. Production quality low. It is very evident that the makers did not spend much money on the movie or time on the script - so save yours. The 2 stars I gave, one for Katrina, for her 'jawani'. Another for Salman - for his 60sec Dabang cameo inside a song.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "a movie disaster called TMK",
            "content": "I don't understand what the hell was there in the mind of Farah Khan and Akki when they gave a thought for making TMK. It's a total wastage of time and if you really want to enjoy the movie, you must keep your brain at home and should not think WTF is going on the screen. I believe Akki must understand now that the monotonous style of comedy has been common and audience has shown the feedback on the movies 'Khatta Meetha' and 'Action Replayy'. Undoubtedly Akki is one of the most talented actors and he must not do the foolish activities. As far as Katrina is concerned, She was there in the movie for no reason but only to show the \"Jawani\" of \"Sheela\". I give this movie a poor 2 out of 10.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a bad movie she made this time",
            "content": "It looks like Farah Khan has followed her brothers footsteps in make such rubbish movie. Real real bad...please avoid it even if you get pirated copy. It is suppose to be a comedy movie, but maximum time you will laugh is 4-7 times in entire movie. Other then Akshya Khanna no one has looked promising in that movie. No proper planning in screen play, utterly chaos. Poor script. Looks like this movie was made to flop. Just dance numbers are good which you can watch it on MTV or Channel V. I am a big fan of Farah Khan movies, but after this I will seriously think twice. Its sad that she couldn't make hatrick. Akshay same style has become so monotonous, and minimal role for Katrina has always been her trade mark.",
            "review_date": "2010-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such a riot!",
            "content": "I'm surprised at some of the harsh reviews here. I am not a Bollywood fan, I probably watch one Bollywood movie every 2 years.. and I just loved this one because it made me laugh.It makes fun of some of the embarrassing truths about Bollywood. Take Slumdog Millionaire and the obsession about getting an Oscar. By making a spoof out of it, the movie finally made me believe there are at least some sane people in Bollywood who have some self-respect. Why should we care about the Oscars when we have awards of our own? The Oscar isn't even that great an award.You need to watch this movie with family or a bunch of friends who have some exposure to Bollywood movies. Everything is exaggerated and that's what makes it fun. Looks like both the Akshays really enjoyed their role. Loved them both here. The dialogue is purposely done in a filmi style. They are making fun of the industry. Come on people! Have a sense of humour about it.I'm giving it a 10 to offset some of the poor reviews here. Come on folks!",
            "review_date": "2011-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utter Nonsense",
            "content": "I have said it all in the summary. Farah Khan has no brains and seems quite proud of that. Either that or she thinks the audience has none and looks down upon them through the film. I need to write 10 lines for a review but the film isn't even worth that many lines of criticism. Akshay Kumar seems to have gone mad or desperate being part of such lame stuff. First with her brother in Houseful and now this. Comedy isn't about obnoxiously overdone loud gestures. To make an audience laugh one needs to think. Shirish Kunder deserves a slap on the face for his effort in the 'thought' department. 'Sheila ki Jawani' is all that the movie has to offer but that can be seen at home on the television.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unbearable Nonsense",
            "content": "I didn't expect much from the movie, but was hoping to have a few good laughs as I was going to watch a movie in a theater after a long time. I was disappointed. Total nonsense from start to finish. Colorful sets/clothing and item numbers are not enough for a 2+ hour movie. Not sure what the writer and director where thinking, but I guess they tried to mix and match or spoof movies like Austin Powers and Sholay to name a few. Storyline was non existent and they never even bothered to tie the loose ends.In any case, the end result is a useless movie with not much to talk about(IMDb forced me to write 10 lines)",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stay away as if it is plague",
            "content": "All I can say is, stay Away From Tees Maar Khan like it is a deadly contagious disease. I wonder how UTV got into the business of co- producing this movie. Though Main Hoon Naa and Om Shanti Om were block busters, I always doubted the potential of Farah Khan as a director. The story strength in her movies has been on the downward graph since Main Hoon Naa and has hit a new low with Tees Maar Khan. Evidently, SRK carried both these films on his shoulders with his presence and aggressive marketing. Though these movies were over the top, they were entertaining. Shirish Kunder, Farah's husband is credited for the story, dialogues, lyrics, editing, background score and music for this movie. Thinking of it, he should have played the item number Sheila ki jawani as well and honestly, it wouldn't have made a big difference to the out come of the movie.The whole movie is based after an Italian movie 'After The Fox' released in 1966 which was not very successful. Farah Khan makes a complete mockery of the original by trying add nativity and more comedy to the movie. Akshay Kumar makes a jackass of himself playing Tees Maar Khan. Katrina Kaif is just there for the skin show in Sheila ki jawani. The way Farah Khan portrayed the character of Aatish Kapoor to make a mockery of Shahrukh Khan is so sick to the point that you would even want to slap Farah for doing this to who she called her best buddy, just for not acting in this movie. But now, the joke is on Farah, since now everyone knows that the SRK factor carried her earlier movies and made them block busters.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "She is Farah and She is awful.",
            "content": "well the title tells it all. the movie is awful and does not deserve any plus review. farah with this movie has been trying to make \"DABANGG\" out of it but it was useless. the movie from any angle is nothing but a worst piece of 3 hours wastage of your precious time and money. IN OTHER WORDS THE MOVIE IS NOT WORTH YOUR MONEY. INSTEAD GO FOR ANY PRIYADARSHAN MOVIE OR EVEN \"NO PROBLEM\" WILL ALSO DO. \"MUNNI SET BADNAAM HOGAYI\" BUT \"SHIELA KI JAWANI NA BADNAM HUII AUR NA MUNNI KO TAKKAR MARII\" AS I MIGHT ADD AGAIN: \" TEES MAAR KHAN NA DABANNG HAI AUR HAR PROBLEM KA SHIKAAR HAI\". Simply Awful. Instead there should have been some Sanjay Dutt movie or i must say watch TNA wrestling as you will find attitude there instead of WWE as they are now moving to Disney Kids channel.",
            "review_date": "2011-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please carry pain-killer with you",
            "content": "Really don't know how to break this. But, please avoid going to cinema hall to watch TMK. Farah's comedies are typically brainless. So, I hadn't had much expectations. But this time, I really believe, that the opening credits should have contained one fair warning, 'Hazardous to health'. Comedy cinemas deserve appreciation, as it involves a lot of hard work from the actors. But, a mindless comedy such as TMK needs to be thrown out to garbage boxes. As a cine-goer I prefer a cinema, which has a soul. A bunch of badly packed adult jokes and a lot of overacting, mixed together can not be classified as a cinema, forget comedy. Sorry Farah, sorry Akshay, a thumbs down from me.P.S. I was thinking to rate the cinema with 0 stars. But found out, that was not possible in this site.",
            "review_date": "2010-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad Days of Akki continues",
            "content": "Here comes the worst film of the year. I am not finding any words to criticize this movie as there is nothing to write about. Here is some reasons why I did not liked the movie...Aksay Kumar: exhibition of unbearable over-acting. I am fond of his acting but do not know what happened to him after Singh is King.Katrina: nothing she has in the film except one song. This is not her fault; she had nothing to do in the movie.Aksay/Katrina: The film maker did not use their chemistry. They hardly had any romantic-scene. As said earlier Katrina had nothing to do in the movie even where Aksay is there.Direction: Well, let's not think about it at all. I do not know how she can make such movie. From her two earlier movies it seems she at least know what most people like. At lease I liked Om Shanti Om not because of SRK but for the making of the film.Akshay Khanna: tried his best Story: Nothing Dialogues and Punches: Golmaal-3 also did not have any story but it had a good number of gigs and punches which make that movie such hit. But this movie does not have anything like that. The only interesting dialogues you can get which you already got from the trailers.Music: Not so good.Choreography: Not so good.Those who are thinking of watching the movie be warned. It is better to spend the money anywhere else.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tees Maar Khan Review- Entertaining story ruined by overdose of comedy",
            "content": "Movie: Tees Maar Khan (UA)Note: Parental guidance recommended for kids due to the song \"Sheila Ki jawani\"Rating: 3.5/5I would review TMK in short, since there is not much to be described about this movie, only except that this movie is an entertainer. The film has good elements like comedy, songs, performances etc but the overdose of comedy, however, acted as a negative point for the movie.Akshay Kumar performed well. He did full justice to his role. The script is not bad at all. Katrina doesn't have anything much to do except for her glamorous part in the song \"Sheila Ki jawani\". The story and screenplay are also good. Inother words, TMK has a good script and director Farah Khan does justice to it. But however adding too much comedy was bad, otherwise the film was good.The music is good, with songs like \"Sheila Ki Jawani\" being crowd pullers. I wonder if people were only there in the theatre for watching the song. When the song came, people were delighted and cheered up even more than they did for Akshay Kumar's entry. Seriously they cheered for him as well, thanks to his powerful star presence and the fact that it was a \"House full\" single screen theatre in which we all were watching the film.But still, despite of whatever the negatives, TMK has its own elements of Masala. There are some bits of comedy which would make you die with laughter. Many might not find it a big entertainer, but yet everyone can pick up what they like, in this film. For those looking for Akshay's comedy can enjoy his comedy, those rushing to cinemas only for the song \"Sheila Ki Jawani\" can pick it up as their fun element, and those looking for a festive entertainer, like me, can enjoy this film.On the whole,TMK is a one time comedy film that can be watched, but you have to leave your brains at home! I was going to give a rating of 3 out of 5, but a 3.5/5 for the overall presentation. Worth a watch.",
            "review_date": "2015-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A waste of Rs.150 and three hours",
            "content": "The movie not only disappoints but makes you want to leave the theater in less than 5 minutes. Bad acting by almost everyone, no story plot gives one a headache. A waste of Rs.150 and three hours. Totally avoidable. Farah Khan has done a terrible job at directing, dialogs and choreography. Waste of acting prowess of Akshay- Kumar & Khanna. Although the only role that is well cast is for Katrina- that of an amateur actresses and she plays that well, since she cannot act to save her life. Bad Choreography. Bad Acting. Bad story. Bad Dialogs. Bad Screenplay. The movie leaves nothing to look forward to after the first 5 minutes.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Please save your precious 2 hrs by avoiding TMK.",
            "content": "I registered at IMDb just to tell you people how disgusting the movie is.After the first 20mins you'll realize that this movie isn't gonna give you anything but a severe headache.I couldn't believe I wasted my 400 bucks watching this utter piece of crap.Akshay Kumar is such a pain in the a**.There are absolutely no duologue's for Katrina in the picture.Movie is full of dumb jokes and PJ's.Each n every person in the film is overacting.I just can't expect such a dull direction even the thought of directing such movie by Farah Khan.This movie will be the 1st commercial flop for FK.Absolutely worst movie of the year 2010.I reckon don't waste your precious time and money watching TMK. PLEASE AVOID AT ALL COSTS.",
            "review_date": "2010-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The film that parodied itself",
            "content": "It's no secret that Farah Khan has watched a lot of 70's and 80's cinema. With her debut venture Om Shanti Om, it was dead clear that she was inspired by old films. While watching it, I had a strong feeling that it's a parody of some kind. But the hard hardest part of making a parody is preventing it from becoming what they are paroding. Tees Maar Khan is a victim of it. It's far worse than any of the old comedies.Without insulting any actor particularly, I would say all of them were poorly written. They were caricatures, they were overly dramatic, they were very unlikable and acting was over the top.But does it deserve to be in the bottom. I don't know but I have seen movies far worse than this. Humshakals, Race 2 ,Judwaa 2 to name a few. Infact, most of the Punjabi comedy films are worse than this. Also, RGV ki aag, Himmatwala, Humshakals have ratings well below 2.0 but still not part of this list (they used to be, earlier) .Definitely not the worst I have watched. Also, that overrated Main Hoon Na is just as bad. It's not even Farah Khan's worst. As for Akshay Kumar, he has Joker, Mr. and Mrs. Khiladi, Sabse bada khiladi in his kitty. These films deserve to be in bottom 100, 250 or whatever, before Tees Maar Khan.",
            "review_date": "2020-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Half-Baked!",
            "content": "Farah Khan's much awaited film 'Tees Maar Khan' finally reaches to it's audience. Sadly, 'Tees Maar Khan' is a letdown. The writing defies logic in each sentence, and comes out unconvincingly.'Tees Maar Khan' is the tale of a con-artist, who plans to do a heist, which might be the biggest con witnessed in history. His journey from the moment go, is an insult to the word 'logic'.Shirish Kunder and Ashmith Kunder's Screenplay is full of loopholes. Sure, the film begins ably and the first hour somehow manages to hold your attention. But, the second hour goes for a complete toss. The jokes fall flat, and the culmination also doesn't leave any sort of an impact.Farah Khan's previous films, 'Main Hoon Na' and 'Om Shanti Om', were genuinely entertaining films, but 'Tees Maar Khan' isn't half of the entertainer one expects it to be. Her direction is hen-picked, due to the weak screenplay.The soundtrack, as well as the background, both are good. Acting wise, Akshay Kumar as 'Tees Maar Khan' is effective. Katrina Kaif doesn't get much scope, but she still manages to make her presence felt. Akshaye Khanna, however, is the real surprise packet. He is truly outstanding as an Oscar-Hungry Film Star. Sudhir Pandey is superb! Arya Babbar registers an impact. Salman Khan, Chunkey Pandey and Anil Kapoor appear in brief cameos.On the whole, A Half-Baked Entertainer, that fails to live up to it's gargantuan expectations. Watch it, but only if you must!",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible Movie!",
            "content": "The movie is so bad that I had a terrible headache for hours after watching it! It's a disgrace to modern Bollywood cinema! Bad acting, really bad story, and super-bad dialogue(s)! I'm so disappointed and angry that I wasted my time and money to see this flop show!The storyline has way too many gaps. The constant nagging chorus of screaming the movie name over and over is super annoying! The film locations are cheesy at best. I can't believe Farah Khan will deliver such a dud, after entertaining movies like 'Om Shanti Om' and 'Main Hoon Na'. I guess what people have been saying is right.. Farah cannot deliver a movie without Shah Rukh Khan. It's a relief to see that SRK is not part of this movie!! Thank you, SRK!Watch it at your own risk!",
            "review_date": "2010-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "worthless movie",
            "content": "I have great expectation form Aksay kumar and Farah khan, but this the worthless movie in bollywood history.This movie have no story line as well as comedy, nothing. Farah Khan has no idea about script. All actors are coming and dancing and joking like a fool. Aksay is a great thief all over the world but he has stolen only a Maa-ka Mobile and Chanki Pandey's Dress ( please don't ask me for what purpose because FK has no answer ). Akshy Khanna who have great Skill of acting made a bulls!!@#%. Only Katrina has a great item no but Shella ki jawani is not a movie. only one thing you can notice in this movie that is the name of the movie Khan-o me Khan Tees Maar Khan.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fun as long as you don't take it at all seriously",
            "content": "I'm kind of astonished by all the harsh reviews of this one... I found it pretty entertaining, albeit in a very silly way. I think the only way to approach a movie like this one is to realize right from the beginning that ordinary rules of logic are not going to apply, and stop expecting things to be remotely realistic or plausible, because they're not going to be. It's a deliberately ridiculous, over-the-top, screwball comedy, and if you expect any sort of realism or logic from it, then yes, you're going to be disappointed. It seems like some of the other reviewers were expecting something a little more serious and sensible, and I could certainly see how this film could be jarring if that's what you're after.But if you're just looking for something campy and fun, and are prepared to completely suspend disbelief, then it's definitely worth watching!",
            "review_date": "2011-08-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie EVER !!!",
            "content": "I cannot believe a movie like this exists. The only appeal in the movie is Akshay Kumar (lead actor) who is known for his excellent comic skills and brilliant dialogue delivery to make even a dead body laugh... BUT he fails with a Rock Bottom. Movie is not only loose but have extremely bad jokes. Even a 5 year old can come up with better jokes. Heres an Example: Mohan Night Samalan (also know as M Night Samalan), the director of Sixth Sense... His middle name is night because he was born at night... also, explains why he is dark in color (because he was born at night). Farah Khan as a director has slapped bollywood across the face and made all Indians around the world humiliate. Took my Mexican friends (who are big fans of bollywood movies) and kept laugh all through the movie... NOT because it was funny but because it was so bad. The end credit shows all the film crew (like director, producer, story and screenplay writers, costume designers,etc) accepting Oscar Awards. I think they expect this movie to win awards. Here it is... WORST MOVIE OF ALL TIMES !!!Please don't get me wrong. I am not giving a bad review because i hate the movie but because its a very bad movie. Though i wanna say one good thing before i end this review. The only worth watching few minutes of the movie are during the song SHEILA KI JAWANI. Song is Awesome and Katrina Kaif is Gorgeous. Unfortunately, the song is at the beginning of the movie and from their movie is a landslide to hell.I wish i could give those $10 to Charity so some kid could buy his/her books and pencils.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unpopular opinion! Its actually a TROLL film",
            "content": "I personally find this film quite enjoyable especially on a lazy sunday afternoon when it airs on star gold. I can agree this is not a film you would have liked to spend your money on to watch it in theatres when it released 11 years ago but still i find it quite hilarious.Yes there is no logic sense anything. In fact, this film feels more like a troll movie , kind of short videos you see nowadays youtubers make regarding trolling someone, so i feel Farah Khan intended to take a dig at oscar films. In fact, many got offended by this film solely because it shows indian villagers as mere fools. Those days the concept of troll was not well known amongst Indians and hence they took such films seriously and got offended.If you can keep aside your critical viewing eyes like I do everytime i watch it and treat the film as a mere troll film, you will enjoy it quite a lot from moments like --> 1. Confusing Danny Boyle for Danny Danzongpa 2. Akshaye Khanna and Akshay Kumar's interactions were hilarious especially his constant assurance that he will get an Oscar and literally the Jai Ho tune starts to play 3. That milk like white guy who is told to chew a gum making him look like he is speaking constantly cracks me up.Overall, this is my personal veiw, not affected by anyone's negative review or anything. I can still watch this film a 1000 times as it is much funnier than the crap hamming like comedies that come out these days.",
            "review_date": "2021-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "horrific",
            "content": "awful movie, bad generic comedy and poor cinematography.... from my perspective its to worst movie of 2010 also i would like to ask farah khan that why did she sign katrina kaif for this film. Surely someone like rani or kajol would of fitted perfectly for such a role and akshay khannas dialogue delivery was out of sync. Furthermore it had some funny moments awful movie, bad generic comedy and poor cinematography.... from my perspective its to worst movie of 2010 also i would like to ask farah khan that why did she sign katrina kaif for this film. Surely someone like rani or kajol would of fitted perfectly for such a role and akshay khannas dialogue delivery was out of sync. Furthermore it had some funny moments",
            "review_date": "2010-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not your typical Bollywood comedy, TMK is truly hilarious!",
            "content": "I watched the movie while vacationing in India with 5 others between the ages of 21-28 (three men, two women, and I was the only NRI). Each of us thoroughly enjoyed the movie, laughing from beginning to end. We were joking about the movie days after watching it. On our recommendation, our uncles and aunts watched TMK, and they returned with the complete opposite view -- like many of the reviewers on this site, they hated it. Immediately it occurred to me that this might be a result of a generation gap, or an open-mindedness gap. This movie shares many similarities with Austin Powers or Anchorman or any other \"absurdly\" funny movie you're familiar with (note: I hate most Bollywood \"comedies,\" so I bring up Western titles. I loved 3 Idiots but it's a different type of comedy.) Yes, the storyline is unrealistic, but that enhances the comedic value of the movie -- it's not supposed to be serious. Yes, Akshay Kumar \"overacts,\" but that's his character and he plays that role exceedingly well. Yes, the jokes sometimes lack depth, but the movie is replete with memorable one-liners. I'm dumbfounded as to why people hated the movie so much. At the risk of sounding insulting to others, my only explanation is that many of the reviewers were simply not ready for such a film. It does feature several homosexual characters, but most younger generation Indians, I'm guessing, can roll with that. Maybe it takes a certain level of experience with absurdity or sarcasm that maybe the younger folks are more experienced with (I apologize about the \"maybes\" but I'm trying my best to provide possible explanations as to why so many people disliked this movie). I urge you not to write this movie off. Watch the trailer on this site -- if you find yourself chuckling at some of these scenes, then I guarantee you will find yourself cracking up at the movies. Like myself, you may even buy the DVD and put it in your comedy collection (next to your Friday and Big Lebowski).",
            "review_date": "2011-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The worst movie ever... even the dumb ppl might find this movie dumb",
            "content": "Except the chart burster item song, there's nothing much in this movie. Advicable to walk-away from the hall after the item song which comes within the first 30mins of the movie. It sucks big time on the narration, editing, supporting actors, said that, even the lead actors cannot be tolerated. I was v much surprised to know this movie is directed by Farah Khan, my guess, she might have left blank minded after shooting the item song, to completed the movie, she shooted something and washed hands of the movie. 5 Min's of non-sense of this kind is OK, but full movie...s**ks big time.Kindly avoid this movie.",
            "review_date": "2010-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Senseless Piece of Trash--an Eye Sore.",
            "content": "Senseless, meaningless, stupid film that denotes the slow death of Indian Movie Industry. This Industry will never recover after dirt films like \"Three Idiots\" and \"Dabaang\". This film is pure waste of celluloid that could have been used for a documentary on child hunger or other social causes. This Director Farah Khan is a brain dead lunatic who is fit to be put it to an asylum along with Akshay Kumar who is churning out films like rotti's since there is no acting or any talent required. This movie is a disgrace to the Film Industry and yes, it will do well since the majority of the population has a field day with this kind of lunacy. This will be a box-office success since good films have no chance of break even and good producers and directors have given up any hope. This idiots and imbecile Khans should be kicked out the industry and kicked out to where ever these lowclass lowlifes came from. Who are the morons been given money to them make movies. They should be selling kabobs on the roadside. They are producing filth in the name of films.",
            "review_date": "2011-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Nutshell Review: Tees Maar Khan",
            "content": "The story is simply the telling of international master con artist Tabrez Mirza Khan aka Tees Maar Khan (Akshay Kumar), who gets contracted to rob a moving train full of antiques under the watchful eye of the police who's on board to guard the national treasures. He hatches an audacious plan which involves his own cover of being a director, and ropes in an entire unsuspecting village of naive villagers to aid in his scheme, even convincing a desperate superstar actor Atish Kapoor (Akshaye Khanna) that he's the real deal with a film that can make Atish finally reach out for his obsession of winning an Oscar award finally, after inadvertently passing on a role that went to Anil Kapoor for Dumbdog Millionaire.Yes you read that right, and that's only the tip of the iceberg in the number of references the film makes to the industry of Bollywood and Hollywood, though while Farah Khan's OMO had a barrage of cameos in part thanks to the number Deewangi Deewangi, here the cameos are limited though no less an impact nor taking away any of the fun when mentioned, from Danny Boyle to M Night Shyamalan with comedic spoofs to names, places and films. Some may find fault that the composition of the film may remind one of her earlier effort such as the film within a film structure, in essence, this is a filmmaker's film and Farah Khan aces in making it something that you'll need to see more than once to catch everything she throws into it which all worked in a magical manner. Even her crew become extras on the set, and like an ode to her industry and co-creators whose industry is recognized in the same way she closed OMO.But the fun boils down to the fantastic item numbers Farah puts into Tees Maar Khan, scoring plenty of points with the coup she managed with Katrina Kaif, highlighting her sensuality and sexiness all at the same time through the much talked about Sheila Ki Jawani. While I had half expected the audience to break out into a boisterous mood, I swear the hall was stunned into silence as everyone gawked at what I would put my money on as the Item Number of the year, period. And what a way it was to introduce Kaif's Anya, the live in girlfriend of Tees Maar Khan who's in on his secret, an aspiring though talentless actress wannabe. While Kaif nails this bimbotic, airhead role to perfection, it is her musical numbers that impressed all the time.And to top that within the same film even, Farah Khan pulled off another coup, which again stunned the audience a second time round with audible gasps of disbelief, before breaking out into laughter for the very wry and sly manner in which reel life mimicked the real, or at least whatever the tabloids want us to believe. We know Salman Khan, who had a successful year with his Dabangg, will make a cameo appearance here, but to have him perform in a number and sharing the same frame with both Akshay Kumar, and especially ex-flame Katrina Kaif, was a sight to behold in Wallah Re Wallah, especially when Akshay in character almost always become protective of Anya from other hot blooded male predators. One word: Amazing.While Akshay Kumar may be one of the more industrious actors from B-town, not every film turns out a classic. I had high hopes for his pairing opposite Aishwarya Rai Bachchan in Action Replayy last month, but the story unfortunately tanked. I suppose he has more luck almost always opposite Katrina Kaif, and here he's back to what he does best, playing macho characters. His Tees Maar Khan possesses this impossible swagger and a master of disguise, relying on his wits to get out of sticky situations and dexterous skills of thievery to earn a living, emerging always one step ahead of the cops in pursuit. The introduction to his character came right from the start as an animated baby before and during the opening credits, influenced by his film loving mom while watching cop and robber films with the fetus deciding to live a life of crime instead.If there's a minor flaw, I'm complaining about the lack of English subtitles before the opening credits, which thankfully was a short scene. Certain subplots also weren't necessary at first, until you realize they were pieces to wrap up the third act to paint a more sympathetic picture of Tees Maar Khan as the half Robin Hood who develops a heart of gold for the villagers he intended to snook, but influenced slowly through the pangs of guilt and compassion to embody and enrich the character. Split down the middle with the intermission separates the film like the recent Ashutosh Gowariker outing Khelein Hum Jee Jaan Sey, with character introductions and planning before the actual commencement of the action in the latter half, Tees Maar Khan screams Fun with a capital F right from the start, with very deliberate over- acting, an audacious plot and over the top presentation that makes it the right film to end this season with plenty of laughs and a reminder not to take everything so seriously. Farah Khan is in top form with her direction and vision on how TMK is to be presented, ensuring repeat viewings for many reasons at many levels, be it to catch certain scenes again, or to count the number of easter eggs inserted. Relax, have fun, and take it away, Kat!",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Remake but funny",
            "content": "This movie is just a remake for the Hollywood comedy movie 1966 after the fox, but still funny with Indian taste.",
            "review_date": "2021-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It truly deserves more than 'Tees Maar'",
            "content": "Tees Maar Khan is an awfully scripted movie which takes it for granted that the audience are dumb and stupid people who left their brains outside the theater. Actually a TMK promised to be an out-and-out comedy but a comedy movie at least demands a few hilarious(if not more) even if it doesn't have the best of the story. This is Where the movie fails. There is no story n the jokes r too idiotic. Even the dumbest of the person may not laugh over that kind of jokes. The 1st half of the movie passes briskly thanks to the Wallah Wallah and Shiela Ki Jawani and some funny moments. But it is in the 2nd half the movie fails miserably. So much so that the actors start screaming their lines. SCREAMING Doesn't MAKE THE DIALOGUES FUNNIER, And in the end there's a misplaced song \"MERE DESH KI DHARTI\" which I felt was completely futile and kinda disrespecting such a patriotic song. I wont talk much about the story because FRANKLY there is nothing to talk about it.Vishal Shekar duo have given good music for the movie and the songs \"Shiela Ki Jawani\" and the title track have already been chart-busters. Akshay Kumar has tried hard to maintain the tempo and get into the character. But given the poorly written character and mediocre jokes even he couldn't help this movie from sinking.Katrina Kaif has nothing to do but look good. She slips through her lines just like a robot. Though she looks smoking hot in the number 'Shiela Ki Jawani' which was nicely choreographed. Though, Akshaye Khanna has done a good job as a Oscar-hungry over-the- top actor . Other actors are passable.TMK neither has good jokes nor connects with the audience emotionally as her previous movies 'Main Hoon Na' and OSO. Give this movie a Miss at all costs and save yourself from spoiling your festive mood.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Totally Ridiculous !.. Don't Ruin your Christmas.",
            "content": "This movie is a HEADACHE, 2 hours of head-banging. Seriously how can Farah Khan comes up with sucha senseless movie. Well I am not that disappointed cuz I never expected much, but I know there are lot of fans who were thinking of spending a fun filled 2 hours in a holiday season with friends or family. For those, the movie is a huge letdown. Sorry guys !May be farah was considering audience first and critics later but she lost both of'em. Audience are as disappointed as the critics. All the hypes created around 'Sheila Ki Jawani' could not safeguard the movie. And for Katrina, Wow! she has luks, she has moves, she has everything excepting the most important of all - ACTING. :(. The only thing that was still fine was the akshay khanna's role . Otherwise the movie was full of overacting, stupidity and dumb jokes. And the last thing, I m a big fan of Raghu (Roadies) but farah made him look like a joker in the movie. Please please give him some serious villain role and he'll do awesome, I know. :)",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mercilessly being written off! Not so bad...",
            "content": "The genre of movies to which TMK belongs to is generally Spoof or typical Bollywood Masala movies. Reminds you of the yesteryear's Govinda fare. Leave your brains behind for this one! One thing is for sure, it was crisply edited. The movie did not bore me. I do love my share of refined movies like Guzaarish, Johny Gaddar, My Name is Khan to name a few, but this movie has its own space! Farah Khan entertains us and how! I loved Akshay's rendition of Tabrez Mirza Khan aka Tees Maar Khan's character. In fact, even Kat was lovable in her dumb belle avatar. Sheela Ki Jawani impressed and so did the song with Sallu in it. You could see the chemistry between Sallu n Kat in the song. I even liked Akshay Khanna in it! And I am not a big fan of either Akshay Khanna and Kumar, but still, loved the movie. All in all, the story seems predictable, the plot line thin, but the characters will entertain. Typical popcorn timepass movie.",
            "review_date": "2010-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True colors",
            "content": "This was a perfect fit for Katrina. She is supposed to act a role of an aspiring film artist who does not have any skill. What a great fit. Wow.As usual Akshay overacts.The original Peter Sellers movie AFTER THE FOX has a well deserved 6.5. The Indians- hating Sellers must be laughing in his grave on is movie. How difficult was it for Farah Khan to copy the original without deviating the storyline? And lastly what is wrong with the Indian moviegoers....this movie made tons of money....",
            "review_date": "2013-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tees Maar 'Farah' Khan",
            "content": "In her third outing as a director, Farah Khan seems to have lost her midas touch. TMK,a screwball farce revolving about a conman conning pretty much everyone around him is neither funny nor clever. Akshay Kumar plays his usual comic self we now associate him to from his earlier films with great elan,while Katrina looks hot but lacks any sense of comic timing. The only surprise is Akshay Khanna who manages to make the best of the very little that is offered to him. He is definitely one of the most underrated talents in Bollywood.TMK offers a few giggles here and there and thankfully Farah keeps the running time short and we are spared from not having to waste anymore of our precious time. By the end you feel the director herself had conned us the viewers by making a movie which is a complete farce from beginning to end and sadly doesn't rise to deliver anything exciting.You know things are not looking well,when the guy sitting in front of you at the cinema is busy playing 'Angry Birds' on his Ipod.Bring back the colorful dramatic musicals Farah,we love them!",
            "review_date": "2010-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's every bit as bad as you'd expect it to be!",
            "content": "The Indian film industry is bigger than Hollywood...producing about 800 movies a year. Yet, despite this, IMDB's infamous Bottom 100 List only has two Indian films which earned this terrible distinction. \"Tees Maar Khan\" is the lowest rated of the two....coming in at #34. So why would I choose to see it? Well, I have been trying to see all 100 of the Bottom 100...and this film makes it my 91st such picture. But is it really THAT bad? Is it bad enough to deserve inclusion on this list of big budget crappy films? You betcha!Instead of recounting the plot of this film all about the master thief, Tees Maar Khan, I'll point out why I eventually turned off the film before it was so incredibly annoying. The acting was among the worst, if not the worst, I've ever seen...and I've reviewed nearly 22,000 films on IMDB. Almost all the actors seemed amateurish and childish....with lots of caricatures instead of folks who were believable. Heck, the folks in \"Airplane!\" seemed much more real and well acted compared to \"Tees Maar Khan\". Add to that the most hellishly annoying theme song in history, a horrible opening which included a terribly rendered CGI baby and the character 'Jagtap' and you have a recipe for career suicide....and I can only assume director Farah Khan was tired of making films and he made this one to permanently derail his career! A chimp would have done a much better job than Farah...and the acting could only have been more subtle had they gotten the chimp!! It's a pretty looking film...but one that constantly annoys the viewer and makes you wonder WHY...why make a film that deliberately provokes the audience to turn off the film and find something better to do...and ANYTHING would be better!! Sticking toothpicks in your eyes would be better than having to watch \"Tees Maar Khan\" and shoving flaming spears into my ears would be better than having to hear that godawful theme song one more time! Avoid this film like it's the Bubonic Plague!!",
            "review_date": "2019-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was not meant to be taken seriously....",
            "content": "But because following the brilliance and success of films like 'Main Hoon Na' and 'Om Shanti Om' people were expecting more from choreographer turned film director Farah Khan. Having just seen it, I have to say that it's a 'leave your brain' at home type film. Even the monster hit item song it churned out ('Sheila Ki Jawani' sung by Sunidhi Chauhan and picturised on Katrina Kaif) was very mediocre.The film's plot in a nutshell: international criminal Tees Maar Khan(played by Akshaye Kumar) eludes the police with trickery and convinces his dim-witter girlfriend(Katrina Kaif), a down of his luck actor(Akshaye Khanna) and an entire small village to help him rob a bank and a train filled with prized possessions under the pretense of shooting an epic movie. There is nothing here that we haven't seen before which is why Khan needed to take it to the next level which she did not. I have heard that the film is a bad remake of some other films like 'Catch me if you can' and 'After the fox' but I did not see any elements of those films here. TMK was just a lazy film churned out by a brilliant person who just wasn't on her A-game this time around. That's all.If you must embark on this journey, get ready for spoofs of every Indian movie ever made with the Oscars in mind (i.e. Lagaaan, Mangal Pandey & Slumdog Millionaire etc.), jabs at actors like Aamir Khan and Shahrukh Khan, director M. Night Shymalan and more. It is narrated by Sanjay Dutt with special appearances by Chunkey Pandey, Salman Khan, Anil Kapoor and Twinkle Khanna as themselves. The Akshayes (Kumar and Khanna) did the best with the horrible scripts they were given. As for Katrina Kaif who might as well be the longest running joke in Bollywood history...a bad actress playing one is just that.",
            "review_date": "2011-07-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Is it the worst ever made?",
            "content": "I am extremely sorry if you even started reading this review, because to read anything related to this movie would be such a waste of time, but i wanted to warn others who have been spared to watch this trash before they even think of riding the adventure. There is NOTHING to be written about the story, as there EXISTS NONE. Every actor seems to be competing with each other in the race of who is the WORST actor (cant blame them as there is nothing in the script to act)You may think i will be biased, but watch it to decide if i actually am!!!A movie of this level of rubbish stuff could only have been made by Farah or his husband who made \"joker\" later...it would be a good debate which one is worse :PSave your day and watching just about ANYTHING ELSE.",
            "review_date": "2013-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tees baar Maaro Khan ko",
            "content": "'Sheila Ki Jawani' is fun, but 'Tawaif ki luti izzat' overdone. Likewise, director Farah Khan's third baby Tees Maar Khan is a joke stretched too far, with she poking fun at all and sundry from Hollywood to apna Bollywood, be it Manoj Day Ramalan shooting a jingoistic Brit-bashing period piece in rural Dhulia, or an Oscar-obsessed actor Aatish Kapoor (Akshaye Khanna) ruing his missed chance to work with Danny Doyle in Dumbdog. And ah! there's also Chunky Pandey in chaddi dancing to the raunchy cameo 'Choli mein Holi'.If you haven't got the drift yet, let's take the lid off this part-funny-part-frustrating piece of campiness which is clearly the remake of the 1966 Italian clunker 'After The Fox' (starring the inimitable Peter Sellers), but quite absurdly credits Farah's hubby and the film's editor Shirish Kunder for writing the story.Like Farah's previous film Om Shanti Om, TMK too has a few in-house jokes on Bollywood. The character of Aatish Kapoor (Akshaye Khanna), an intense, overacting superstar, coming pretty close to being a spoof of Shahrukh Khan. On the other hand, Salman Khan walks away with claps and catcalls after a spirited cameo in the song Wallah-re-wallah.All said, TMK may not be Farah's best work to date, but it sure does not entertain for half its running time before coming to an expected Happy Ending.After seeing the film I thanked GOD that Farah Khan didn't approached to SRK for this futile crap.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "piece of trash",
            "content": "a much much awaited flick which i at-least was desperate to watch... after the success of her two hits earlier Farah seemed promising and i was expecting a lot of humor, even mindless humor but it never came. story starts with teesmarkhan n he takes on an assignment and the whole movie is plotted on same. even if i was to make a movie i would have come out with a better storyline. the start is good with Katrina oomphing on sheila Ki jawani. an then the story falls down and keep falling. the only scene worth a laugh is \"choli me Holli\" shooting scene. what else is funny is akshay khanna's gimmick on jai ho. otherwise you keep holding your head throughout even with a short running time of 2 hours 15 min.first of all none of the actor is credited to act normally. exaggerated acts are assigned which make movie look like dumb. everyone is felt over acting throughout. then what a cheap thing to go with Farah khan who made good budget movies earlier. the whole movie ends in a village. no script at all. dumb plot.overall a waste of time i must say. avoid it.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worse even than Chinese Torture",
            "content": "Firstly i would like to mention why i gave two stars to this movie. One star is to the song SHEILA KI JAWANI(although it is awesome to watch but sadly it lasts for only 4 minutes or so) and the another star to Akshaye Khanna and Akshaye Kumar(yes, both deserve half-a-star).It revolves around one con artist (Akshaye Kumar) who can never be kept in prison and whatever the circumstances he manages to escape every time. He gets a contract to commit a heist of Indian antiques by two brothers who are connected physically(Raghu and Rajiv)and he accomplishes it with the help of residents of a village and an actor aspiring to get an Oscar(Akshaye Khanna) in the most ridiculous manner. Then TMK is double-crossed by his bosses and he overcomes it to a HAPPY ENDING.This movie revolves around a heist which is supposed to take place from an unstoppable train. But the biggest irony is that the train stops in just 10 seconds and the robbery thing is just plain rubbish. Akshaye Kumar has just stuck to the same expressions and behavior since last year or so and it is not funny anymore. Akshaye Khanna as an Oscar-crazy actor is over-the-top but induces laughter in some scenes. And now, Katrina Kaif. The only reason i suppose she did this movie is to show her toned body. The song Sheila arrives quite early in the movie, and after that all Katrina Kaif does is show some skin and tries to act like a bimbo. And oh yes, she also does a Marilyn Monroe.There are so many more absurdities that it is impossible to point out why i disliked it. Please try to avoid this one or you are going to regret watching this nonsense.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another flop bakwas of Akshoy Komor",
            "content": "Why does Akshoy Komor does such cheap movies? He should be careful in selecting the director and the script. His acting was as bad as his other movies. Ghatiya bakwas.",
            "review_date": "2021-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it was Ohh ...so bad!!!!!!",
            "content": "After waiting eagerly for this movie, I sat in the theater and then was extremely eager for it to End because this movie was atrocious and that's putting it politely. There is nothing good about this movie and I can bet I've seen better plots and characters with more depth in blue movies. Right from the plot to the visuals, the acting, the directing it was simply contrite, clichéd and awful. There was absolutely no dramatic scene at all and the visual effects were just creepy and over the top.Farah Khan once said that she doesn't care a damn for what the critics opine! Well you got to believe the critics this time because the only good thing I can say about Tees Mar Khan is Katrina's performance in 'sheela ki jawani' but the question is, are you that desperate for an eye-candy? Farah Khan please for the love and beauty of a Bollywood movie never make a movie like this ever again.",
            "review_date": "2011-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Horrible",
            "content": "If there was any award to give the worst ever made Hindi film it should go for this film. The promos gave an indication that it could be a funny film spoofing Bollywood, the title song and Sheila Ki Jawani became huge famous and one expected the film would be equally great.Sadly the film is a big fiasco and an insult. Farah Khan earlier made some watchable films, MHN was quite decent and a homage to 70's(which she got stuck with), OSO was theek thaak but this is completely nonsense.The film is a remake of AFTER THE FOX(1969) but it's such an insult to watch that you beat your head. The plot is juvenile, handling is even worst. Farah Khan makes every actor overact, tries to make every scene funny but sadly the film makes you exhausted.The start is okay with the Sheila number but sadly as the film proceeds it gets tiring to watch, the spoof part is overdone terribly and stands out for it's foolishness, the entire headless daaku angle is so stupid it makes you fall on the ground.... The entire con angle is treated so badly that it makes BUNTY AUR BABLI a masterpieceDirection by Farah Khan is terrible, she is mostly thought as an intellectual and holds pride that she is a 70s movie buff something she herself has maintained but sadly she lacks skills to make such a film Music by Vishal Shekhar) is decent, Sheila number is superb(don't miss Vishal as the director), Walla Re Walla(with appearance of Sallu) Title song and Bade Dilwala are decentAkshay Kumar normally a fine comedian here gets on the nerves with his over the top portrayal, his girly like walk and expressions in the first half don't really work Akshaye Khanna too perhaps felt it was a nice platform to show his comic side but sadly he is made a carricature though he does contribute to some funny moments. Katrina Kaif sizzles in the Sheila song sadly she doesn't do anything worthwhile rest Apara Mehta is funny, Raghu Ram and Rajiv Laxman who normally beat the out of everyone in Roadies here are made to resemble Tin Tin cartoon conjoined twins and they irritate. Aman Verma and Murli Sharma are not funny Sachin Khedekar has some moments all that I can say Ali Asgar overacts, Arya Babbar has some funny moments rest are okay",
            "review_date": "2012-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "With no declaration of being an official remake anywhere in its titles, I would take it as a shameless COPY of Peter Sellers AFTER THE FOX and that too way below the mark.",
            "content": "Talking about Farah Khan and her TMK, I already knew that the film was heavily inspired from Peter Sellers AFTER THE FOX (1966). But sadly, there was no declaration of any sort anywhere in the starting titles or in the ending ones from the makers about its copyrights. Therefore I would take TEES MAAR KHAN as another shameless copy from the West which is surely not a decent gesture from anyone involved with the film. Coming to the movie itself, in simple words it's a very pale and mediocre interpretation of a very exciting plot. Revolving around the character of a wanted criminal Tees Maar Khan, the story mainly deals with a big heist planned by him fooling a whole village of innocent people including a policeman. The plot is as it is taken from the Peter Sellers famous Classic Comedy and even some jokes are adopted like a true remake. The only difference in both lies in the character played by Katrina Kaif.TMK starts as an uneven ride right from the start with a long plane sequence which is not able to raise enough laughs. The first half has no story development as such and the actual heist plan starts post intermission. As I feel, Farah Khan knew that she has got a weak first half and that's why she very smartly included both the item songs, \"Shiela Ki Jawaani\" and \"Wallah Wallah\" in the first half of the movie itself to keep the viewers hooked in.The second half starts off on a brighter note and does manage to entertain the viewer for a few moments. But then everything starts happening so easily that you lose the interest in the proceedings and the weak climax leaves you in a confused state where you start thinking, that what was it all about? From the performances view-point the film is one of the best guidebooks on hamming and overacting. In fact kudos to the director, Farah Khan for directing such a unique movie in which almost every single actor is hamming and overacting like never before. Yes, we know that this is her own style of making a film, but at least it has to be entertaining for the audience, as it was in her last \"Om Shanti Om\".Reviewing TMK in it various departments, I would like to write more about the movie in the following straight forward points.A. The film simply wastes a great potential comic plot in all that hamming and overacting by its entire star-cast.B. The only saving grace of the movie is \"Shiela Ki Jawaani\" song along with \"Wallah Wallah\".C. Akshay Kumar does show his old comedy sparks at regular intervals, but here I would like to convey him that \"there is a very thin line between confidence and over confidence which clearly shows off on the screen very easily. So please be aware of that\"D. Katrina Kaif should unarguably include TMK in her weakest or worst movies ever, as she just remains a mere show piece in the whole movie and has not got even a single good scene except the famous item song. In fact, I think some of her fans might question her that \"Why you had to do it?\"E. Akshay Khanna can easily forget about this venture since he has done only shouting and hamming in all his scenes which is far away of being termed as Acting. F. Raghu and his brother Rajiv, unexpectedly play complete contrasting characters on the screen moving away from their famous small screen images. And somebody tell them that they both look like fools in the movie, as the joined villain brothers, who just have to giggle and speak together in their few scenes. In the supporting cast Akshay's three con friends are funny at places and Arya Babbar makes a feeble impact. But both Murli Sharman & Aman Verma in the role of two Officers try too hard to be funny.G. Truly speaking, from the entire cast if any person made me laugh loudly in just a few scenes then it was Sudhir Pandey in his short role of Akshay Khanna's secretary.H. Musically, I didn't find anything exciting in the soundtrack other than its innovative and catchy title track sung in different voice textures. Interestingly this track is credited to Shrish Kunder and the rest of the songs are from the famous musical duo Vishal-Shekhar who have done just an above average job. Frankly speaking, I even didn't like \"Shiela Ki Jawaani\" a lot as I strongly feel that the song surely would not have become so famous minus Katrina Kaif in another project not backed up by any Akshay and Farah . I. It was really amazing to see Shirish Kunder taking the whole credit of STORY and SCREENPLAY in the titles where in reality it is all copied.J. Farah's love for Manoj Kumar and his works continues in TMK too. But what a degrading way to use the hugely famous national integration song \"Mere Desh Ki Dharti\" in the climax.K. Overall, coming from FARAH KHAN who gave us \"Om Shanti Om\" in the past, this is a weak project which works only in parts and fails to connect with the audience instantly. With neither the lead character of a thief winning over the viewers nor his heist making the things exciting, the film fails to give you a wholesome entertainment as expected from its successful director.Rating : No Rating (Since its just a Shameless Copy and even if they have bought the rights, they had no guts to openly admit it in front of the viewers by writing that in their titles.)",
            "review_date": "2011-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Over-the-top\" on just about everything",
            "content": "The moment promos start going overboard I suppose the \"kats out of the bag\" that a con-game is marinating under the hoods to hive-off bad eggs and the latest offering from Farah Khan fits the analogy to the \"T\". After a ideal masala entertainer \"Main Hoon Na\" and not too bad \"Om Shanti Om\", I was very much keen to checkout the media-thrashed product and boy, it stinks! For starters, every character in the movie is loud, over-the-top and at their hamming best! Seems there was a competition amongst themselves for a trophy, sadly everyone wins!Akshay Kumar: Should seriously apply brakes to his career rather than risking himself getting trapped into Govinda's shoes. Instead of sleep- walking its a good idea to keep an eye on the proceedings if you have put in your moolah. Katrina Kaif: If you negate \"Sheela Kijwani\" there was nothing about her in the movie. Akshaye Khanna: I have never seen him in stooping to such low-levels in his career. And mockery about Anil Kapoor/ Jai Ho could have been more aesthetically delivered (on that note, the mist is now cleared how the original choice is shaking the foundations of mannat on his decision about Slumdog M).Arya Babbar: Hardly leaves an impact.Vijay Maurya: Appalling to see a powerhouse of talent reduced to an inconsequential role of a sidekick. To see Vijay Maurya and Ali Asghar in the same frame is an insult to the Indian Cinema. Plot is thinner than the pringles and comedy appalling. Con-games depicted were not childish, but baby'ish. Voice-over seems to a latest trend in Bollywood these days and Sanju Baba's contribution is merely a novelty. Likewise for Mr. Anil Kapoor.Marriage and motherhood have taken a toll on the taskmaster director. Its evident that her hubby Shirish Kunder has donned multiple hats to fill in the gaps which sadly doesn't rescue titanic hitting the iceberg. If not anything SRK did a brilliant job of Quality Assurance when collaborated with Farah. Some combinations are irreplaceable hence should kiss and make up in the interest of self, the industry and most importantly for the sake of saving the torture to the audience.",
            "review_date": "2011-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Being mindless is tough unless You are Farah Khan",
            "content": "Farah Khan the celebrated Bollywood choreographer returns for the 3rd time at the helms of affairs as a director after \"Main Hoon Na\" & \"Om Shanti Om\". If there is one thing we have learnt from her earlier works is to expect plenty of senseless plot developments, action sequences without a purpose, beautifully choreographed dance numbers and the absence of any storyline. All in all some serious entertainment minus the all so serious perspective. The fact that her previous works were runaway hits in the box office, almost assures us, that her next would follow suit. If the promos were anything to go by, it all looked rather amplified, with a certain \"Sheila Ki Jawani\" ruling the Indian music charts in the last month or so. Katrina oozes sensuousness in the video.Akshay Kumar replaces SRK as the main man in the enterprise after AK had assured the cash registers rang big time in Farah's brother Sajid's \"Houseful\" earlier in the year. Add the other Akshay of the industry (Khanna) with a ridiculous wig and a plot thinner than wafer. Than punctuate the narration with rampant digs on almost everything You can fathom from Slumdog Millionaire, Danny Boyle, Anil Kapoor, Steven Spielberg, Sleepy Hollow, Aamir Khan, Manoj N Shyamalan to Manoj Bajpai and then to Manoj Kumar\u0085 As for events there is a hugely popular song which I have hinted about earlier, a couple of robbery scenes and in a style only Farah Khan can pull a few cameos from Anil Kapoor, Salman Khan & Chunky Pandey. Editing is the weakest aspect of the production and the song sequences the best.The most intriguing part of the movie is the acting. It all looked like a lot of goofing around was captured in a camera and eventually put together as a movie. The irony is; that sums the better part of the story. A particular scene describes the 2+ hrs long narration of the movie beautifully. Akshay Khanna's character after the director says \"action\" is at a loss as he has no idea what he is to supposed to do. The director enacted by Akshay Kumar chews his hands and pulls his hair in disgust and eventually comes up with something as incomprehensible as the movie itself.Well that is \"Tees Maar Khan\" for You. Go and watch it for \"Sheila Ki Jawani\" because its on 35mm and sounds better than Your home theater. Let me know if You agree with Farah about mindless being a tough job !!!",
            "review_date": "2010-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average",
            "content": "An average mindless film. Akshay Kumar was good in his role and had good comic timing. Katrina Kaif was just there for the glamour. Missable.",
            "review_date": "2020-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Complete torture",
            "content": "Remembering this pile of crap from 2010 I remember been proper bored to death of this watching it at home. I'm sure it was a outright torture for all most everyone who watch it specially in cinemas",
            "review_date": "2020-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Really Funny movie!!!",
            "content": "This movie already looked very good from the trailers and promos...When i went to watch this movie at the cinema, i was hoping for a lot and i was happy at the end! Really funny!!! It was just so funny, i could not stop laughing... Akshay Kumar was out-of-the-world... his character was so wow... his acting in this movie was super!!! I really liked Akshay Kumar's dancing in this movie... super-super!!!Other thing which i really liked was the costumes which Akshay Kumar was wearing in the movie... each of his costumes had a 1st Class look and feel!!! I love it!!!Overall, a worth watching movie!!!My rating: 7/10",
            "review_date": "2010-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disaster",
            "content": "Just like 1997-1999, 2008-2010 was a horrible year for Akshay Kumar. All his movies after the super hit Singh is Kingg flopped badly. Although Housefull was a hit film, all his other films flopped. Tees Maar Khan was Akshay Kumar's last release in 2010. The movie is an example of a D Grade Film with absolutely no sense. The movie is about Tabrez Mirza Khan aka Tees Maar Khan(Akshay Kumar) a conman who likes to con people and get all the goods. He is very clever(but stupid for choosing such a film), he never looses. He has an old mother and his lover Anya Khan(Katrina Kaif). The movie goes on like this until Akki gets an offer to do the impossible. The story's main focus is on this impossible con job which Tees Maar Khan has to do and when he succeeds, the badguys ditch him and he gets caught. But, he manages to catch them and the ending is retarted with a filmfare award series. Story wise, the movie has no sense. The story is basically a pile of silly scenes put together to make you laugh. Acting wise, Akshay Kumar repeats his loud comedy from his previous film Khatta Meetha which also flopped, Katrina Kaif does good in her item number but she's wasted, the rest are all terrible and should go back to acting school however the reason why I gave the film a 1 is Akshaye Khanna. Him as the hungry Oscar actor is really good. Besides his performance, the movie is a stupid comedy and a waste of money. Please avoid at all costs, even No Problem was better than this.",
            "review_date": "2011-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worthless flick that reeks of Overconfidence! Keep Out!",
            "content": "After two successive hits, 'Main Hoon Na' and 'Om Shanti Om', the bare minimum that you expect from Farah Khan is a pop-corn entertainer or at least a fare that you can tolerate for a couple of hours. Well, that didn't happen with 'Tees Maar Khan'.If it were so bad, one would wonder, did she keep up with Akshay Kumar's track record of mindless comedies especially those with Katrina which raked in moolah? No way! She just took his comedies to an all time nadir sure to fail miserably at the Box Office.While Farah Khan stands to take all the blame for being the Director, in fact, Shrish Kunder seems to be errant. Juggling writing, editing, lyrics and production proved to be too much for Kunder whose previous outing with Akshay, Jaan-E-Mann had flopped baldy. She probably had a tough time melding family and business. Based on a 1996 Peter Sellers starrer, TMK is about Tabrez Mirza Khan (Akshay Kumar) who calls himself semi-Robin Hood, for he steals from the rich but gives not to the poor. Obviously, catching him is a tough act for cops. He is hired by con-men Johari Brothers (Raghu and Rajiv of 'Roadies' fame) to steal a train full of antiques. To accomplish this, he masquerades as a Hollywood Director Majoj Day Ramlan and stages the act of making a film. He casts an Oscar-obsessed star (Akshaye Khanna) and his B-grade wannabe actress girlfriend Anya (Katrina Kaif) and deceives an entire village into accompanying him thinking that they're acting out a crucial scene.Although the premise itself may not be a bad thought, considering that it worked for an earlier film, incoherent scenes, poor dialog, taste- less humor et al lead to the most worthless two hours of your life. Farah the Choreographer excels with songs Sheela-ki-Jawani and Wallah- Re-Wallah, but they do too little to keep the sinking TMK afloat. For the filmmakers, disability, color or gender preferences seem to be source of their humor. While one was a joke on a dark robber being visible only when he smiled, the others included Siamese twins who seem to talk simultaneously and a villager with a skin condition being cast as a Briton. Three villagers dressed in Pink act effeminate and a cop- duo chasing Khan are shown to be amorous. True, brainless comedies often work, but TMK seriously undermines audience intelligence. If Farah Khan and Shirish Kunder thought casting a hit pair, copying a foreign film, a couple of songs and silly gags are all that movie should have, they've been caught on the wrong foot. To keep your sanity, just stay away from this flick.In the closing credits, the film-makers are seen awarding themselves. Let them, for they won't be able to lay their hands on the real stuff anyway!",
            "review_date": "2011-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why does Farah Khan try directing ..horrible",
            "content": "Not sure why Farah khan directs movie , its just better for her to choreograph . the movie does not have a script and story is baseless. you just cant sit for the second half and jokes are pretty ...dumb ...except for the song ....the movie is no good . u can just come out of the movie after the song, not sure how couple of people were laughing for some junk jokes ...acting ...Akhsay is great as usual but he cant do anything ..Kat is body shopping ....not sure what age group people would like this movie ....would not suggest anyone to watch. went for Hindi movie after long time excepting the Hindi movie industry to improved or matured , but we still find these kind of movies coming again and again , not even worth watching in TV.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nonsense comedy at it's worst",
            "content": "Director Farah Khan will stop at nothing to get a laugh out of you. No disability is too sensitive to make a joke of, and no stereotype too overused to flog one last time. In a scene from her new film 'Tees Maar Khan', a dark-skinned thief nicknamed Ismail Koyla who only commits robberies in the night, is finally arrested when his shining teeth give away his hiding spot. In another scene in which a movie is being cast, a toothless villager presumably suffering from leucoderma is selected to play a British officer because he has white skin. A pair of conjoined twins only speak in unison and repeatedly hi-five each other. And three effeminate village boys forever dressed in pink assist a heroine with her make-up, and roll their eyes longingly at a hunky filmmaker. If you're outraged by such low-brow humor, 'Tees Maar Khan' is going to be a long, hard slog for you.Adapted from 'After the Fox', a 1966 comedy starring Peter Sellers, this film stars Akshay Kumar as Tabrez Mirza Khan or 'Tees Maar Khan', a master criminal who learnt to steal even before he was born, because his mother was addicted to classic Bollywood crime films while she was pregnant with him. When Tees Maar Khan is hired by the notorious Johri Brothers to rob a train stuffed with roughly 5,000 crore rupees worth of antiques, he pretends to be a Hollywood filmmaker named Manoj Day Ramalan, and under the guise of shooting a period film, enlists an entire unsuspecting village to help him with the heist.Despite several staggeringly silly set pieces - including a sequence in an airplane in which 'Tees Maar Khan' escapes from the clutches of two police officers - the film's first hour races by briskly thanks to breakneck pacing, and at least two energetically choreographed dance numbers. But by the time you've settled into your seat post intermission, the screenplay begins to come apart. There's a particularly awkward gag involving a headless horseman, and that leads to a supposedly poignant moment in the film that is entirely contrived. Even the train heist sequence isn't filmed dramatically enough, and the Manoj Kumar tribute at this point seems forced and overstretched. Tees Maar Khan, surprisingly, doesn't match up to the standards set by Farah Khan with her previously directed films. Both 'Main Hoon Na' and 'Om Shanti Om' were smarter, funnier films that benefited from the writer-director's irreverent humour. But for this film she hands over the writing responsibilities to Shirish and Ashmit Kunder who appear to have drained the film of any smartness. The dialogues are repetitive, and the jokes in 'Tees Maar Khan' are mostly puerile and not very funny at all. In fact, it's an arrogantly written script that seems to take the audience for granted. However, it's a testament to Farah Khan's directing skills that she makes even this disappointing film work on at least a few occasions. She draws out a winning performance from Akshaye Khanna as the Oscar-hungry filmstar Aatish Kapoor, who's still hurting from having lost a role in 'Slumdog Millionaire' on account of his foolish secretary. Despite the incessant hamming, Khanna easily emerges this film's best joke. Katrina Kaif, in a smaller role, as Tees Maar Khan's struggling actress girlfriend, submits herself completely to the silliness of her character, and at least succeeds in evoking a smile out of you. In the choreography department, there are few who can rival Farah Khan. The 'Sheela ki jawaani' number is one of the film's early highlights, a sight to behold not only for the dance movements but for the complete staging of the production - the music, the costumes, the lighting, and the editing. The 'Wallah wallah' set piece too, featuring Akshay Kumar and Salman Khan, has an infectious energy that is indisputable. Even if you go in willing to suspend your disbelief, 'Tees Maar Khan' is not an easy film to enjoy. Akshay Kumar works very hard to make the buffoonery look like fun, but he's saddled with such poor material, it's no surprise it doesn't work.Working with Akshay Kumar for the first time, it's surprising she delivered not the trademark Farah Khan entertainer one expected from her, but a typical harebrained Akshay Kumar comedy instead.",
            "review_date": "2011-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slapstick Comedy",
            "content": "Everyone seems to hate this comedy, but I've seen worst Hindi comedies. To say it is really stupid is an understatement. It's insaneness is shocking but ultimately adds to the zaniness of the non-storyline. Only Akshay Kumar has the courage to act in such shocking trash. Despite this, there were scenes that were laugh out loud funny. In light of the darkness engulfing our planet this might be just what the doctor ordered to make us momentarily forget our troubles. Good for one watch!",
            "review_date": "2018-08-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tees Maar Khan,an awful movie!",
            "content": "Tees Maar Khan directed by Farah Khan,is awful.If Razzies were held in India,Tees Maar Khan would have surely got nominated for all the categories and even win all the awards.I feel pity on Akshay Kumar,a very talented actor,who directors simply sign because he is a big star and make a waste out him.As for Katrina Kaif,I feel sorry for her since she worked so hard for Sheela Ki Jawaani but still the movie flopped.Akshaye Khanna is a supreme talent wasted in this junk.Story: Tees Maar Khan revolves around conman Tabrez Mirza Khan (TMK, Akshay Kumar) who has been a criminal since he was young. He was caught in France and was deported back to India. Two police officers Chatterjee (Aman Verma) and Mukherjee (Murli Sharma) took him but he escaped.He is in love with the struggling actress Anya (Katrina Kaif). TMK takes a job from the Johri brothers to rob a non-stop train loaded with precious antiques. He cons the people of Dhulia village into helping him by saying that he will make a historical film about their village. He approaches the greedy but popular actor Aatish Kapoor (Akshaye Khanna), who is eager to get the Oscar award and fools him into working in his film. The robbery goes well but all the villagers and Tabrez Mirza Khan get arrested. TMK claims they are innocent, but he gets arrested anyway.The movie is completed and, at the premiere, Aatish, Anya, TMK's mother, Dollar, Soda, Burger and all the villagers walk the red carpet with Tees Maar Khan and the police. After the film, Tees Maar Khan escapes. Later, at his private jet, the Johri brothers enjoy what they got until Tees Maar Khan and his gang throw them out of the plane. The film ends with TMK and his mother becoming rich, Aatish receiving Oscar awards from actor Anil Kapoor, Anya becoming an actress and the whole Dhulia village opening their own saloons, party halls and the village inspector opening a poster signing stall to all the people from America.The story is bad.The screenplay is very bad.The direction is bad.The music is bad.The dialogs are awful.None of the actor's performances are worthy of mention.All in all Tees Maar Khan is awful and painful both combined!I am going to give it a zero on ten(0/10)",
            "review_date": "2012-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nah, this isn't worth watching.",
            "content": "The film is about a conman played by Akshay Kumar and a difficult task he is assigned. One thing really annoys me. Akshay Kumar is a very talented actor, but he doesn't seem to do himself justice these days and wastes his talent doing movies like this. The less said about Katrina's performance,the better. Actors in supporting roles do their bit fine. Granted, this film had the third biggest opening weekend after Dabangg and 3 Idiots, but that was because of all the hype. Trust me, it doesn't live up to it at all. The music is, I suppose, OK.Verdict: it is acceptable to watch it only if you have free time in abundance. I give it 3/10",
            "review_date": "2010-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant movie",
            "content": "This film is exceptionally well made...The depth, innovativeness, and the provocative nature of this film is outstanding! A great film is all respects...The character arcs of Akshay and Akshay are amazing...Katrina is a beautifully talented actress and gets into the SKIN of the character. This film isn't for everyone...It's only for people that appreciate quality cinema and films that really make you think! I am glad this film was made because it really represents the intellect of our nation (India)...Only people as smart and intellectual as us can appreciate such quality art...The direction, writing, the acting and cinematography was brilliant...I also loved the beautiful lyrics...It shows how far the industry has come..\"SHeila Ki Jawani\"...Oh the poetry...Oh The subtext...It's brilliant! Please watch this movie only if you appreciate quality films that have something different to say...If you enjoy films like \"Udaan\", \"Black Friday\", \"LSD\", \"Phas Gaya Re Obama\", then this film is NOT for you...This is a quality film unlike those...Those films are extremely regressive while TMK have \"progressive\" written all over it! This is where out cinema is heading...Hooray!",
            "review_date": "2011-02-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Complete torture",
            "content": "Farah khan has just proved that why she should just stop making movies because this is not a movie,this is epic garbage in fact farah khan should give money to all the people who have watched this movie either in home or in theatres,everything is pathetic in this movie from hero to heroine to supporting actors,the only reason i gave it 2 stars because of Sheila ki jawaani otherwise i would have given it 0 stars",
            "review_date": "2017-09-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sheila also can't save the movie",
            "content": "Did Farah Khan direct this movie? Is it the same person who mad hits such as Main Hoon Na and Om Shanti Om? Several questions come up like these after watching Tees Maar Khan.The screenplay written by the Kunder brothers is just not watertight.Its loose in several places.Farah tries hard to make it an entertaining fare but there are hardly few laughs which are far and between.Music by Vishal-Shekhar is just about okay barring \"Tees Maar Khan\" and Sheila Ki Jawani. Performance wise,Akshaye tops as Aatish Kapoor.While Akshay Kumar as Tees Maar Khan is simple.Katrina is just beautiful.That's it.Sudhir Pandey is truly fantastic as Bunty Baweja.The villagers only shout and ham throughout the movie.The henchmen of TMK are just about okay.Aman Varma,Murli Sharma,Vijay Patkar and Sachin are gap fillers. On the whole,A Major Disappointment.",
            "review_date": "2011-04-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bollywood of 2010 and beyond",
            "content": "After having read negative reviews about this movie and seeing it in the bottom 100 list on IMDb, I decided to try out this movie. Obviously, it wasn't worth spending even a single cent on a movie that has Akshay Kumar as the main lead and is trashed universally. I was lucky enough to be able to borrow this movie from the public library.The movie sets its low standards right from the opening credits - a dancing foetus in scenes that are just a rip-off from opening credits of Bond movies. The movie just keeps trying to fathom the abyss of movie making and never tries to redeem itself. Reminds me of what late Roger Ebert wrote about \"Freddy Got Fingered\" - \"This movie doesn't scrape the bottom of the barrel. This movie isn't the bottom of the barrel. This movie isn't below the bottom of the barrel. This movie doesn't deserve to be mentioned in the same sentence with barrels.\" There is nothing in this movie that is worth mentioning - because this movie lacks anything that has semblance to the art of movie making - acting / story / direction / dialogues. This movie does not even fall in the category \"so bad it is good\". The movie is just based on the recent Bollywood premise that if you hire popular actors, spend money on promotion and promote it as a \"brainless entertainer\", there is a certain demographic that will flock to theatre to spend their (or their parent's) hard earned money. It is just like flipping a coin - some movies end as winners, some end being losers. Equally disappointing is the fact that movies that were released after \"Tees Maar Khan\" have followed this formula and have earned big bucks.I do not have any admiration for Akshay Kumar's acting skills since I saw \"Deedar\" in theatres 20 years ago. And after 20 years, his wooden face and expressions haven't changed a bit. To expect any acting from Katrina would be akin to expect that mortal can create miracles and cure human beings. But what is painful is to see talented actors like Anjan Shrivastav, Sudhir Pandey or Apara Mehta in roles that are an insult to their acting talents. And somehwere along the lines I have a suspicion that this movie, although credits Farah Khan as director, is ghost directed by her hubby, Shirish Kunder (who has four or five other credits to his name in this movie). Farah has done a decent job in \"Om Shanti Om\".I have given one star only because a)IMDb does not allow negative star ranking b) you can see Farah's choreography skills in the \"Sheela\" song.",
            "review_date": "2013-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The jokes on us!",
            "content": "Almost all of us are ruing about the fact that we had gone to watch TMK with a lot of expectations after all the hype and anticipation surrounding Farah Khan's latest third movie. The problem is that Farah Khan took it for granted that what most viewer's look for in a movie is a great star cast, nicely choreographed songs and a comic like story. All of these were also widely used to great success in her earlier movies which was done sensibly around a visible story. But the problem with TMK is that it does not tell anything that the viewer can relate to and like other Farah Khan movies she adds an artificial humor to it only excessively this time. Her earlier movie characters had some true to life feel although there were unusual things happening to them but their reactions seemed real. Like SRK's emotions in Om Shanti Om when he enacts receiving an award or when he first meets his dream girl. Here Akshay Kumar plays the role of a big-time crook or con-man but his con jobs seem completely unreal and so does the way his character acts through it. There's absolutely no sense in watching someone with a brain of a monkey do feats of a rocket scientist. It's as if there was already a movie with the same concept that was made with a serious tone and Farah is trying to make a spoof out of it. The viewers don't have a clue as to what she intends to make fun of as the spoof is on an original movie that doesn't exist or no one watched.While no one expects real acting in a spoof, the role of an actor of Akshay Kumar's caliber is required to have some substance to it. It would have been perhaps better suited to cast some unknown or small time comedian in this completely silly role than to waste Akshay Kumar's skills and star image. Also instead of dressing up this mess with senseless scenes and songs Farah Khan should have made an effort to make the characters look real and get some sensible acting out of her cast particularly Katrina who will only be noticed for the item song. The viewer's watch comic movies to forget their worries but they're not stupid. So Farah Khan should sit down with those who write the story before deciding how to make a comedy scene than the other way round. Also the gay concept is getting kind of old but she seems to still live in the last decade. This is certainly not a good way to end a decade in Bollywood!! Its the viewers who pay the price of a ticket and they are the ones who decide if a movie is really worthy of appreciation. Patting oneself on the back and creating fake hype is just a way to cheat and insult the earnest viewers who unknowingly fall in the trap of watching these duds. A over hyped movie like this is nothing but a bad elaborate joke on the intelligence of those who spent their money on buying the tickets. But right now no one is laughing.",
            "review_date": "2011-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "pretty funny!",
            "content": "i didn't like 'mhn' n 'oso' n after reading most reviews panning 'tmk' thought of skipping it including the fact it's a copy of sorts of the peter sellers' 'after the fox'. me thinks: the trailer and promos never invoked laughter! on top of that Akshay Kumar desperate to act young! anyways, took a chance n saw it 1st day 1st show! Farah and bro and directors like them may appear to be all filmi and for bollywood, but in reality are out to make a quick buck with the opening weekend collection. and nothing for the art of film making nor creating an impression for others to be inspired from. quite repetitive in places! how long will she in particular pay homage to Indian (commercial) cinema in one way or the other? lady, come up with your own style to be acknowledged as 'Farah maar khan'. \"never the less 'tmk' is funny n crazy! made me lol! and this one reminded me to be as fantastic as 'Mr Natwarlal'. the 2nd half was equally hilarious! Aryan and Akshay Khanna are good. Kumar is not over but doesn't look young as those 2. would have given it 3 stars if it had been 'original.\"",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "tees maar khan sucks",
            "content": "1. No Story 2. No huge sets 3. No nice songs except title song and sheila ki jawani. 3. All actors are wasted. 4. Akshay has nothing to prove as TMK. Like no action no acting no big stunts. Just a man who escape from jail and doesn't even show how he does it. 5. The treasure of 500 crore is not even showed once to believe it. 6. There is no villain in movie the two twins are wasted on the name of villain coz they no were looks like the owner of 500 crore worth asset or even capable of handling it. 7. The task of stealing 500 crore is give to TMK (Akshay Kumar) who himself is not shown capable of anything. The guy cutting vegitable in his home cant be shown dashing or capable of handing such a huge task its so unrealistic. 8. Katrina is total wasted. Lots of overacting. Sorry there is no acting. She just comes on screen to say one thing oh I have to put more make-up. 9. All other actors are really wasted like akshay khanna God know why is he even there\u0085 other TV serials actors. Some of them are really doing good role on TV but hope this doesn't ruins there image. 10. Farah Khan need a crash course on making movie. Unless she admits that all she cares about is money and not entertainment.",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "shame for Indian film industry",
            "content": "I can understand why most of the people have rated AWFUL for this movie. i guess Farah Khan has totally lost it. She is better at choreographing shila ki jawani or other songs. All the stupid jokes were disgusting. Akshay Kumar needs to take a break and look for some better roles. and what can i say about Katrina Kaif? I heard once that you were looking for roles like the one in 'no one killed jessica'!! How will you get such a movie if you keep on doing roles like the one you have done in Tees Maar Khan! The only dialogue that Katrina says is, \"I will apply more make up on the face\". I hope none of my friends watch this movie as its a disgrace to the Indian Film Industry.",
            "review_date": "2011-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best C-grade films of Bollywood",
            "content": "Farah Khan's third installment of masala potboilers, Tees Maar Khan is a total washout! This is nowhere close to Main Hoon Na or for that matter entertaining Om Shanti Om. TMK is entertaining,yes! But only in parts and pieces - while the rest of the film is a dull fare and absolutely senseless. Absurd, weird and utter nonsense! More so, looks like a C grade Bollywood Masala Film and worse - actors like Akshay Kumar, Katrina Kaif and the rest are too loud in the film that our Ear Buds would need relaxation!Tabrez Khan aka Tees Maar Khan is an internationally wanted con artist infamous for his \"half-ROBin Hood\" act. He has his three sidekicks who are seen hitting Men! A C-grade film actress as his lady love and a Bollywood Superstar dreaming of an Oscar - are all caricatures of this NO PAISA VASOOL film! Heavily inspired by an Italian film, 'After the Fox'. And how is 'After the Fox' plagiarized by Shirish Kunder and made into a Farah Khan film is thus:TMK is been hired to rob a train that has worth crores of wealth. Its an impossible task and to do so, he enacts as a Hollywood Film Director and with a Superstar (Akshay Khanna) plans to shoot a film at the village wherein the train passes and they plan to stop the train as a part of their film shoot! And the rest, you can easily guess!A story which has immense possibilities of comedy is reduced to actors trying buffoonery - something often mistaken by filmmakers as guaranteed laughter. Everyone in the film overacts and are desperate for every act! Looks like Farah and Kundar purposely gave such freedom to the actors and told them - do what you want to do! Salman in a Qawwal and Anil Kapoor towards the climax are just a treat to watch! Now, tell me - Do you actually want to C this C grade film? If there is something that is worth watching, is just the C-eela Ki Jawaani! which deserves to be of a repeat value in the Big Screen!Overall, there is nothing gr8 about this film, and can be watched at your leisure when it hits the Small Screen pretty soon! And yes, Farah - Shah Rukh KHAN guarantee Hits and Blockbusters to you, but a Tees Maar KHAN't, and that is damn sure!",
            "review_date": "2013-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "MyReviews: Teez maar Khan is a Logic-less Entertainer",
            "content": "This is a film for all those who would like to see their stars walking here and there, shouting, screaming, doing some idiotic act in very colorful costumes – green, red, pink, yellow, blue..Plot: Tabrez Mirza Khan a criminal who can always flee from the police / law without any loopholes. Tabrez Mirza Khan is assign to burgle a train carrying very old Indian antiques, knowing his track record. Thieving something which weighs near 10,000 KG from the train need huge number of people for his support, So he acts as a director from Hollywood and encourage a Bollywood actor Aatish Kapoor (Akshaye Khanna) to act in his film. And also Tabrez and his friends convince an entire village to be a part of his film. Direction: The basis of the film – script, dialogs and presentation highlight foolishness of the characters. Shirish and Ashmith Kunder (Dialog writers) – deserve some award for this movie, they had put together all kind of idiotic, foolish sentence together. Well, what can I write about his script!!!@.Performance Akshaye Khanna – he is very effective. He is the least over acted among the whole cast. Katrina Kaif - looks gorgeous in the Sheila Ki Jawani song.. That's all. Katrina had given her career's worst performance without any questions. Akshay Kumar – over acting at the core, he might get the \" best 'over' actor \" award. Rest of the cast: tried their best to over act, to over react, and they had passed with 100%.Pluses: Sheila Ki Jawani.. song is electrifying, thanks to Katrina's charm, and choreography is extremely good and the song Wallah Re Wallah... is also good enough to catch your attention for few reasons.Minuses: Irritating court room sequence. Johri brothers (Twins) - uniform in bright shirts and converse the same sentences in chorus. Arya Babbar – A village cop with thoughts of becoming popular / an actor. Three men in pink shirts, as Anya's make up assistants. Lot of unpleasant jokes on the color of skin is included, ( Manoj Night Ramlan's skin color) and its horrible to see in a movie with the popular stars. Usage of the name like Danny Doyle, Manoj Day Ramlan. In addition to all these there is few insensible gay jokes. - To be continued.....Many slapstick comedies are releasing these days, but they fails when actors act like idiotic and mentally challenged people. Teez Maar Khan – Main Characters, Police Officers, Criminals, and all the other characters emerges as foolish cartoons. The whole cast is acting like there is some Oscar's for 'over acting'. Everything is over the top here. The TMK have many needless situations and odd characters. Tees Maar Khan just refuses to make any sense at any point of time.",
            "review_date": "2011-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not a film it's a a torture",
            "content": "It's not a film it's a a torture shame on bollywood",
            "review_date": "2020-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Strangely Charismatic",
            "content": "I disagree with people who found this movie awful. I must admit, initially, I found that the actors were over-acting and the storyline seemed ridiculous, but THAT was the beauty of this movie.Tees Maar Khan is a full-blown comedic Movie. Its very ingeniously disguised as overacting and pointless. IF you think about it, a con-artist getting a group of villagers along with a big-shot-Actor to be a part of his grand scheme of things pretty much sounds like all BOLLYWOOD movies. I think its about time Bollywood comes out with movies like this.A Bollywood Movie usually drags on a simple storyline through hurdles and hurdles of endless disappointments just to get to the obvious ending. I can't sit through a full Bollywood Movie at any given time without being bored out of my mind. But Tees Maar Khan occupied every single minute of my time and I honestly thought the movie was only an hour and a half.It was the overacting that made this movie simply beautiful. Its like a \"Scary Movie\" version of all Bollywood movies mushed up together.I found this movie very strangely charismatic with the cast and storyline. It was out and out entertaining! It was honestly worth watching, but keep an open mind. Movies that doesn't revolve around love and its hurdles are just overdone and boring.",
            "review_date": "2011-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Funny if a bit slapstick",
            "content": "I liked the lead song a lot, I would give that song a 9/10 as, it sounded to me like it was standing up for women's choices in life and could be interpreted to mean standing up against violence against women.",
            "review_date": "2019-09-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So much underrated",
            "content": "Don't what's the problem with people\nIt's very funny movie\nAmazing sense of humour.",
            "review_date": "2021-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad,Rediculous movie with story.",
            "content": "Tees mar Khan is world's biggest disgusting,rediculos movie ever made, this film is directed by Farah Khan.Akshay Kumar's acting is bad in this film.don't watch this film.",
            "review_date": "2019-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of worst movies of Bollywood",
            "content": "Tees Maar Khan is one of worst movies in history of Bollywood. The movie has plunged Bollywood to all time low. Makers of this movie think they can get away with anything with help of superstar hero and big heroine flashing skin in item song.Direction By Farah Khan is beyond imagination. It is horrible to say least. Story was copied from Peter Sellers movie After the Fox but i think there is nothing called story in it. it is joke of a movie.Performances - Akshay Kumar doesn't live up to expectations. He did average job and was too much loud in some scenes. Katrina Kaif is horrible. Akshaye Khanna did well considering his job was to play a loud hero here. Rest were nothing great.In other words, Tees Maar Khan is super crap movie and deserved to be flopped.",
            "review_date": "2011-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Utter Garbage",
            "content": "How the hell was this movie greenlit? This is honestly one of the worst movies I have ever seen. Between the shoddy acting, annoying songs that come at the worst times (save for Sheila Ki Jawani), and lack of a narrative, Farah Khan truly disappoints in a way that no other director can.The songs are absolutely terrible in this movie. The main characters will be tricking an entire village full of idiotic dimwits and buffoons, and cut to a song.If you haven't heard the title song, you cannot say you know what the word \"annoying\" means. As for the ever so hyped Sheila (which is done within the first twenty minutes of the movie), we get introduced to Katrina Kaif's character and never see her again except for a few ditsy lines here and there.Don't get me started on the so called humour. The worst screenwriter of the year goes to Shirish Kunder. Housefull (2010) is intelligent compared to this garbage crap.As for the two male leads - the less said the better. Akshaye Khanna's career has reached an all time low (we're talking lower than the Marianna's Trench). As for Akshay Kumar, this movie really took a toll on his career.Finally, the worst director of the decade award goes to none other than Farah Khan. The same director who brought you the excellent \"Om Shanti Om\" is now duping innocent moviegoers into wasting their money and time.",
            "review_date": "2020-09-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Movie is amongst the worst films I've ever seen...........",
            "content": "With a combination of Akshay Kumar & Farah Khan for the first time on the big screen I had huge expectations from this film...And more-so, when Sheila Ki Jawani turned out to be a highly appreciated item number.... But honestly speaking, I seriously have no words as to how bad this movie actually is.... After having heard the remarks from my friends I never went to the theaters to see it.... I got to see it on DVD at home & after the first 10 minutes or so I had actually shut it down.....later on I tried watching the movie when A friend of my challenged me a 100 bucks to watch it....But, I could only complete watching the movie in 5 installments...... This movie was a complete disaster!!!!! If IMDb had the option of negative rating would definitely give it a ~~~10!!!!!!! :D",
            "review_date": "2011-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Silly, time-pass entertainment!",
            "content": "I rated this movie relatively high to bring up the score. If you are looking for an intellectually stimulating movie, did you really think this would be it? If you are looking for fun, time-pass entertainment than you will certainly enjoy Tees Maar Khan! This movie is SUPPOSED to be dumb. That is what makes it brilliant. The silly puns and obvious jokes... they're supposed to make you roll your eyes and laugh while thinking 'Oh my God, did they just really say that?' Each character is larger than life, from the \"blonde\" bimbo Anya (Katrina Kaif) to the suave, catch-phrase using, wanna-be \"Don\" Tabrez Mirza Khan (Akshay Kumar). The plot is your average story of a conman attempting the heist of his life. The clichés are what make this movie great... I guess some people just don't get that. Those people need to stop taking themselves so seriously.Am I perhaps giving Farah Khan too much credit for creating a brilliant satire when really it is just a poorly made comedy? Maybe. But even if that is true you will find moments where you can laugh, even if you're doing it while thinking WTF? I do agree that Akshay's brand of humor and Farah Khan's style do not mix too well. I think both are fantastic at what they do, but in this movie their skills clash and are ultimately compromised. It was painfully obvious at points that this movie was made for Shahrukh Khan in a sort of slapstick version of his \"Don\" flick. If only he had not gotten into a fight with the director...The best performance by far was that of Akshaye Khanna as the Oscar-obsessed superstar trying to give his ultimate performance. The exaggerated intensity and self-importance with which he performs every scene is hilarious. Even the long, flowing \"hero\" looking hairdo was spot on.No, it's probably not the kind of movie you would watch again unless it came on TV, but if you need some Bollywood over the holidays just go see it. Don't think about it too much. In fact, think of it as a mental break. If nothing at all, go and enjoy the songs! Vishal and Shehkar do it again with \"Sheila Ki Jawani\" and \"Wallah Re Wallah.\" The beats are awesome and Katrina Kaif is sizzling.",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of best no brainer",
            "content": "Don't expect \"reality\" in this movie.It's full time non sense.But damn it's stupid, rubbish and funny.One of top actors together making this story,\nI imagine nothing but them having fun during shooting.",
            "review_date": "2022-06-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Well I Love this movie.",
            "content": "I don't care about other reviews.But this one was a decent comedy movie.",
            "review_date": "2020-11-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The worst movie of all time.",
            "content": "Akshoy Komor has been delivering bakwas movies all his life. He should retire.",
            "review_date": "2021-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I have to give it 10 stars because the humor was just out of this world",
            "content": "I do understand people's frustration, BUT, that being said, this film was amazing. I loved it so much because the story and songs and dialogues were so unique and new. I don't know why at the time when it came out 13 years ago so many people hated it, but I've watched it dozens of times and it was just so refreshing each time. I don't understand why everyone always refers to this film when discussing flops. I loved this film because the humor was just so good and watching it each time brings back the nostalgia. It's just really funny and iconic, especially all of the songs were iconic and the story was also really unique and different.",
            "review_date": "2023-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most awful movies..",
            "content": "I really cant fathom what's gone into Farah Khan... She has a talent of making extremely bad movies...This movie was so childish and jokes were so flat that could put you to sleep in no time... Except for Sheila ki Jawani, there's barely anything thats mentionable. All in all, the movie was written, acted in a way that it felt that director had no part to do.. Everyone did, what they wanted, in the worst way that too.. Im sorry Akki, I swear you have lost all respect.. giving greatest worst movies - Blue, Tasveer, this and what not... Time to act like a seasoned actor..",
            "review_date": "2013-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If it's not clear to people that everything here is on purpose than it's no surprise bollywood comedies have become trash.",
            "content": "This movie is self aware. It's not like writing terrible dialogue, and overacting is something the makers and actors in this Movie are known for. It mocks everything and people have learned to accept terrible, offensive dialogue and overacting so much that they can't see that all this movie does is dial it up to 10 to make fun of it. Yes some scenes are actually bad even for a movie calling out tropes. Yes it could have been better easily but the harsh reviews that the movie has received don't point out the more controversial dialogue of the film but simply critisize it for the acting and stupid story which shows that they didn't get what they were going for.Now I'm not claiming to know better but if you can believe that a director known for making ok drama movies before this would go soo wrong at making a comedy than you either consider bollywood comedies great or had even lower expectations from Bollywood.",
            "review_date": "2021-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dull and Spectacularly Unimpressive but for A.Khanna",
            "content": "This movie helped me confirm my long standing faith in the acting talents owned or acquired by Akshay Khanna . Leaving aside his magnificence the entire team of this movie should perform Harakiri sans any honor. The people who didn't catch the warning signals from the lame and lousy promos discovered to their misery the almost farcical treatment of comedy in this movie. The funniest part is that the movie fails to tickle in all those areas where it was supposed to. All scenes featuring Akshay Kumar alone are unbearably boring. His timing and use of subtle symbolic devices to create humour was conspicuously absent . The story wasn't written, it was scribbled on a discarded Platform Ticket by an uninterested imbecile. The screenplay is a disaster. Even the potentially funny situations were converted into dreadfully un-funny scenes . The movie however redeems itself through the herculean comic effort by Akhshay Khanna, a man virtually ignored if not boycotted during the movie's promotion. His performance is quite good and adds life to the dead script. He delivers the payload when required. His gestures, actions, diction is immaculate. The only character who actually plays the character he he was assigned with intensity and conviction. Cameos by Raghu Ram (ok they are two individuals) also help the viewers to stop looking at the price tags on their tickets. A movie which may tickle when viewed again in parts, but which surely shouldn't have been made with any star cast.",
            "review_date": "2011-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it would have truly been a Tees Maar Entertainer",
            "content": "Like a Hollywood movie Start. A good First Hour but suddenly down in second hour. Tees Maar Khan is also a formula-ridden outing with \"tadka-maar-ke\" entertainment.Shirish Kunder is champion in editing as always. Music is also fine. \"Shiela Ki Jawani\" and \"Badey Dilwala\" song is good to listen.The Dialogues are not superb and the main weakness of the movie is its screenplay.No doubt on the capability of its star cast. Akshay Kumar, Katrina Kaif, Akshaye Khanna, Ali Ajhgar, Aman Verma they all do well. Things are well but if only its content was powerful enough, it would have truly been a Tees Maar Entertainer!!!",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why always COPY!",
            "content": "Just by watching the previews I had an inclination of what movie they copied this Indian Movie on - I don't know if many people remember An old Peter Sellers Movie called \"After the FOX\". Well people here you go! Indian version. Far worse and sad! The thing is it can be so much better as they did take a really funny movie to do an Indian version of. However they add the dumb unneeded comedy and kill the movie.What is the matter with Akshay? Why can't he do movies as he was doing. I think the last good movie I saw of him was Singh is Kinngh! After that it just went downhill! Dude! You are so much better than this nonsense!! I am your biggest fan and I am disappointed in calling you my favorite star now.",
            "review_date": "2011-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "really what a FK ....guys this is the worst movie of decade",
            "content": "what a real waste of time energy and money. a complete crap nonsense and idiotic.guys please avoid this senseless and stupid freak show. Really has Katrina Kaif gone insane?what the hell is she doing (apart from wearing little clothes in Shiela....) Akshay kumar is good but what can he do when the director has lost her bearings. No sense of humor,just plain BAKWAAAAAAS. What a whimiscal plot...a conman making a dumb movie with a top actor in it and that winning an Oscar. it is a stupid take on poverty,villages,Oscar and underworld the music is bad apart from the only song.... well,the only positive thing about the movie is that it lasts just three hours and then you feel like a free bird out of a boring,crap and junk cage. farah khan should stick to her formulas only,she must not try anything new.",
            "review_date": "2010-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst Movie Ever",
            "content": "This movie is probably the worst movie of all time in the history of Cinema. I wonder when they are filming such a pathetic movie they cannot realize what kind of filth they are creating.I am very disappointed with Farah Khan, after making two good films she directed this piece of garbage. The story in this movie can not be understood by humans.All actors are wasted in this movie, I cannot think of any reason why Akshay and Katrina Kaif agreed to star in this movie, they paid a huge price for there friendship with Farah Khan.If you have still not seen this movie you should thank the lord almighty as God has saved you from such mental anguish and trauma. Don't spend money on watching this movie instead help the poor and needy.",
            "review_date": "2011-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best movie ever",
            "content": "this is the best movie ever it's a well-made remake of after the fox - 1966 starring peter sellers. The action & acting of each actors is amazingly done the music is excellent except the song \"Happy Ending\" is not that good but the rest is amazing my favorite choices are: \"Wallah Re Wallah\", \"Sheila Ki Jawani\" & \"Badey Dilwala\". My recommendation is go out watch this movie in the theaters forget about stress and pressure of school/work, trust me you will have an amazing time. Akshay Kumar & Katrina Kaif couple is yet successful again after the successful hits: \"Namastey London\" & \"Welcome\".Music Rating: 8/10 Movie Rating: 10/10 Acting Rating: 10/10",
            "review_date": "2010-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "torturous!",
            "content": "Big stars(especially Akshay Kumar) ,extreme promotion,showpiece Katrina Kaif , add to it the most stupid director Farah Khan, makes a perfect recipe for one of the most stupid film of Indian film history.But not to worry, Bollywood is the most resilient creature in the world, and I' am damn sure that they will continue to make such debacle.Now lets be specific, actually the script was written by a Noida based rikshawala Satyender Sattoo!OK jokes apart,don't dare to watch this movie,that's it. I have other things to do and I can't give even my faltu time to review this title.After reading all this if you are still interested then may the god save you,best of luck.",
            "review_date": "2011-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sheila Ki Jawani fails to make it even watchable.",
            "content": "What to expect from the movie: 2.5 hours of complete waste of time. Basically challenging your brain to believe that you are actually watching some thing so messed up.Reasons to watch it: 1. Nice Songs 2. Salman Khan Cameo 3. Sheila Ki Jawani: The item number (song pictured on Katrina Kaif) 4. Farah Khan film.Reasons not to watch it: 1. It is a great possibility that movie was shot without a script. 2. Overdose of performances by every actor. Special mention to Akshay Kumar, and the roadies duo Raghu and Rajiv (they humiliated themselves). Film making. Akshay Kumar, tries too hard to act in this one but fails. 4. Tees Maar Khan's assistants are unbearable. 5. Before the story settles down, something stupid always stops it.Farah Khan gets full score for choreography but none for direction.",
            "review_date": "2011-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Would win Oscar for the worst movie of the year",
            "content": "Well this is one of the few movies I have watched and have started hating the actors in it for what the hell they were trying to enact !! It really does not make any sense. The story , the plot , the humor is all so idiotic. Akki's over-acting skills really don't surprise me these days. Thats all that seems to be left in him after these long years of stardom.How can a normal sane person believe such incredulity of a conman being hailed as the Robin Hood and then he goes on to create a movie .. Worse still it wins an Oscar !! Oh my God . I had the worst time watching the whole length of the worst-comedy and blunt acting skills on the part of everyone present. Apart from the yummy item number the movie is a strict no-no. So I would happily award it the worst movie and recommend it for Oscars if Farah is so keen to win it the other way round !!",
            "review_date": "2011-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Epic Fail",
            "content": "They tried to be funny but they failed in every way possible. Honestly one of the worst movies i have ever watched. I wasn't expecting much from it but i also wasn't expecting that less. This movie gives Bollywood a bad name. For a comedy movie all i could feel was disappointment and not a single laugh. The action scene didn't help either. The Story was so boring i almost fell asleep half way through. It made no sense. And the acting was just too much. I can't believe actors like Katrina & Akshay Kumar agreed to work in this movie. A big fat flop for Director Farah Khan who actually directed some good films like Main Hoon Na, Om Shanti Om.",
            "review_date": "2016-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good of All Movies",
            "content": "Akshy was good man and his movies are very like in Pakistan .I wish Akshy visit Pakistan and make a movie..",
            "review_date": "2021-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great Bollywood comedy!",
            "content": "A great movie to pass time. Very funny, with a great performance from Akshay Kumar. A little bit cheesy at times, but has many quotable and memorable scenes.",
            "review_date": "2022-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Should've been supportive of original comedic experimental films",
            "content": "Its a nice popcorn movie, with a lot of feel good moments. People just want reasons to be offended now a days. Yes, there are a lot of gay moment but none offensive imo. Everyone has fun, everyone gets trolled. But more representation than \"woke\" movies.This movie will stay my all time favourite. And I do not like how this movie is trash talked, like yeah Khan experimented, and it wasn't well received. But it really killed and demotivated creators from experimenting. And now we have tasteless remakes.Back to Tees Maar Khan, with great non offensive comedy, it's a film that doesn't pretend to be overly smart. And just wants everyone to have a good time. Wholesome af.",
            "review_date": "2022-06-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Someone shoot me please.",
            "content": "Okay, seriously either this movie was complete genius and was poking fun at its audience, or it was the worst movie I have ever seen in my life. That was a waste of my money, time and brain. I definitely lost some brain cells over this movie. The jokes are useless, the acting is .. I can't even comment on it, the whole movie is a big fat idiotic joke. Sheela ki Jawani was the only thing in the movie even worth listening to, and it definitely isn't the best song you've ever heard. You could just as easily utilize youtube for your music video watching needs and thats good enough. The rest of the movie is useless and ... i'm rambling.Just do your brain a favour and don't watch it.",
            "review_date": "2011-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time",
            "content": "No story, Nothing to gain from this movie. Farah Khan could be given a worst director award for this movie.",
            "review_date": "2018-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TMK utterly sucks,from beginning to end ,its nothing more than a waste of money and time.",
            "content": "First of all all the hype created around TMK is nothing other than a waste of time and money. Tees Maar Khan doesn't live up to the high expectation of the people . Rather it falls flat . As the promos and the preview suggest , th story is about Tabrez Mirza Khan aka Tees Maar Khan. A con artist ,a thief who is capable enough to open any lock , in any place of the world, let that be on a flying plane or a running train. the story revolves around how he undertakes a job to rob a running train containing 10,000 kilograms , worth antiques. well , routed to be as one of the biggest hits of 2010, TMK turns out to be one of the biggest flops of the year joining Ravaan and Kites.With silly one liners and awful con tricks TMk is one of the worst con movies i have ever seen till date. With a little or no use of the acting skills of Katrina Kaif and Akshaye Khanna , Farah Khan wastes them totally.the only interesting part of the movie is the song Sheila Ki Jawani that might drag the audiences to the theaters but if you take my opinion friends don't go for it if you have no intentions of wasting your money and time on one of the awfully scripted,directed movies of all time.i would rather call it as FARAH KHAN KI AAG rather than Tees Maar Khan it worst than Ram Gopal Verma Ki Aag.",
            "review_date": "2011-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Its Christmas... I would say no more..",
            "content": "Well the movie is more of a slapstick comedy, which revolves entirely around Aksha Kumar, who is playing a con man in the movie. The chemistry between Katrina and him is clearly evident in the songs, and his character along with his side-kicks do manage to entertain in pieces. Intelligent one liners , few of them, and in first half primarily... Better go with your better half !!! The story is not very strong, but the screenplay comes alive with our beloved Akki's delivery and his body communications. Raghu and Rajiv add a bit of a flavor to it, but then even that wears off after some time. Definitely not the best works of Farah, good surprising guest appearances and a lot of intended spoof of almost entire bollywood helps you curve your lips every now and then. All in all, the movie definitely could have been better, Katrina does rock you early on with her 'Jawaani'. I, particularly enjoyed her performances in all the songs(seemed as if that was her entire camera exposure in the movie) One time watch probably...",
            "review_date": "2010-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Torture mat maar Farah Khan",
            "content": "The botomline is that Farah Khan should stop directing and stick to choreography, which she is good at. The movie is not even a mindless spoof. With empty cinema hall seats, adding more to the horror of watching such a terrible movie one ought to think twice before continuing after the intermission. Coming back to the movie, the direction was immature, pathetic screenplay, bad appearances for actors like Anil Kapoor, Akshaye Khanna and Katrina Kaif. One of the worst seen in my life. The movie might have been a \"box office\" hit if Shahrukh Khan had featured in place of Akshay Kumar. I plead to everyone not to encourage anyone to watch this movie as i was misleaded by my friend to watch it.",
            "review_date": "2011-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't Waste Your Time...",
            "content": "The best way to judge a comedy is by how many people laugh out loud at the jokes...and our theatre was silent throughout this film, generating a couple of quiet giggles in one or two scenes. People were actually grateful for the intermission! The story was too far-fetched and unbelievable, the actors was intentionally over-acting, to an extra-ordinary level. Even the serious scenes were spoilt. Too many unnecessary guest appearances just for the sake of it, without adding anything to the story. The script was terrible. You can see why Akshay Kumar's career is going down-hill - Singh is King was the last good movie he made. The only good thing about this movie was Katrina Kaif - she looked HOT!!",
            "review_date": "2011-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the most stupid film of this century",
            "content": "don't dare to watch this movie,let me suggest u a way of letting others watch it for u,if u are enemy with someone gift him/her this crap.I am sure like hell whoever gonna watch the whole movie is gonna be freaked out.and they won't be able to speak or hear anything in hours.I don't honesty understand whats wrong with Bollywood,its like you have money and you need a way to spend it,so this is what farah khan did. seriously Bollywood grow up.I thought while checking the movie if I ever had a bazooka I would surely point it to farah khan.because this is not movie making this is bloody crime.i hope the viewers are not as screwed up as the director herself.and another thing is this movie is semi hit in India(i don't know how come) Katrina sucks in acting big time and akshay(no comments) i think he has escaped from a mental hospital.those who makes this kind of script ,movie should b arrested in 24 hours on a non bailable warrant. I am utterly sick of Bollywood. when will u grow up?",
            "review_date": "2011-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One among 'top 5 worst movies ever made' in Bollywood with top rated actors.",
            "content": "There is a huge list of things which are wrong at so many levels with this film.To begin with this obvious and ridiculous plot it seems director has taken viewers for granted. In what seems to be make a laugh a riot movie it has become so-bad-that-its-good kind of film. This movie is benchmark of what not to do with top rated star cast and money producer has vested in movie.The only thing that goes in favor of this movie is iconic \"Sheela Ki jawani\" item song that would be remembered for ages for Katina Kaif.Its waste of talent that Akshay kumar has. It seems he has stopped reading scripts and rather started accepting movies for money only.",
            "review_date": "2016-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Copy of \"After the Fox\"",
            "content": "What stops Hindi film producers from acknowledging their sources? This one rips off Vittorio de Sica's hugely entertaining film with Peter Sellers, \"After the Fox\". The entire story line is copied, even scenes! It is a telling commentary on the inability of Indian directors to evoke humor. Their concept of it is exaggerating into caricatures. Such splendid artistes as Anjan Srivastav are reduced to jokers of Asrani at his worst (Patal Bhairavi). Akshay Kumar isn't a patch on Victor Mature's excellent performance in which he mercilessly pokes fun at himself. The less said about Katrina the better, except that she is worse than Brit Ekland in the original.",
            "review_date": "2012-10-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not too bad of a movie",
            "content": "This movie was one of the funniest I had seen in a long time. The story was OK but there could have been more to it. The acting was meh. A lot of scenes were plain boring. There were some unnecessary parts in the movie that had me face palming all over the place. The comedy is where this movie shines. The last few bits had me in tears from laughing so hard. While some may not agree, The funny parts of the movie made up for most of the horrible and unnecessary parts. The acting did not seem to bother me too much. The songs were not too bad and the actor choice was pretty good. Over all this movie was not too bad like most people say. Taking all the positives and negatives from the movie, It deserves a 5. Honestly, I don't understand why there is so much hate for this movie though it was a decent release.",
            "review_date": "2016-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the funniest movies I have watched.",
            "content": "Best acting and best performance. It is just as it was supposed to be, Awesome.Akshay Kumar's movies are always great and this movie is one of them.Apart from being funny this movies is also family friendly. You can watch whole movie with the family without hesitation.",
            "review_date": "2022-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "My love for Farah Didi knew no bounds after watching Tees Maar khan:\nSome very obvious reasons:\nCharacter\n1. The Characters can't be more appealing, from Tees maar Khan alias Tabreez Mishra who is a con artist with magical powers to Aanya, a good for nothing wannabe actress and acrobat dancer to Johri Brothers, two twins who can't be separated from each other to a Sasta Leo Caprio without any acting skills who is obsessed for an Oscar; they all transcend boundaries of great character.\nStoryline\n2. If there is one movie that rightfully comes close to enigma and beautiful portrayal of this movie, then it has to be inception. The plot of the film is unbelievable; I mean literally unbelievable.   Managing to develop a con artist who is blessed with such magical powers that he stole watches and jewelry the very moment he was born. And leaving no stones unturned in making us believe that a whole village can be fooled to do a robbery of a train full of antiques.\n\n3.Dialogues \nDialogues were up there with Shashank Redemption, to give you a taste of few:\n\"Textbook se copy karta hua student and tess maaar khan ke bheje se nikla hua plan kabbi fail nahi hota.\"\n\n'Tube se nikla hua toothpaste or tees maar khan ke die hue jubban kabhi wapis n jaati'\n\n\"Kuute ke muu se haddi or tees maar khan ke haatho se gaadi dono cheene Bakar h\"\n\nAnd my personal favorite was \nBoss, dhoop aa raha hai.... Accha? Jao Suraj ko bolo thoda baju me hat neko!\" \n\n4. Cameo\nIf there was any scope of brilliance left in the movie, it was filled by Sallu Bhai's cameo in 'Wallah re wallah.\"\n\nSome  not very obvious reasons to love Farah Didi\n1. So, Bollywood has the habit of subtly glorifying Racism, but Farah Didi managed to do it so openly without any repercussions, which is commendable.\nIn one scene while referring to a criminal the dialogue says, \" Ismail koyle se kaala h, ya koyla ismail se kala\" and \"Ismail ke pass do hatyar h, ek. Raat ka andhera, dusra Ismail ka smile.\"\n\n2. In one dialogue which is repeated more than once Tess Maar khan says \"Tawaif ki lutti izzat bachana; aur tees maar khan ko qaid karna; dono bekaar hai\" and you can't expect anything more from the movie now.\n\n3. In one scene Farah didi wasn't able to find a white man to play a Britisher's role in her film, so she takes the help of a person with albino and stuffs bubble gum in his mouth as a language barrier again without any consequences. \n\nConclusion\nThis is one such movie that should be kept in a museum to tell people that this is a quintessential masterpiece and this is the only movie one should set as a standard for a perfect movie.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely a terrific musical hearkening back to the glory days of Hollywood musical films. The dancing, music and choreography are enjoyable and superbly done. The plot is comically hilarious even better than many of the old time Hollywood favorites. This is a movie for fun and entertainment.",
            "review_date": "2018-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tees Maar Khan is not a good movie, but some jokes are worth laughing while 99 percent of them are not.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the beginning I wasn't into it. Akshay was portraying his common \"cool guy\" persona so i was going to turn this off after the first half hour. I am glad i didn't cause this movie was actually really really funny. The songs were catchy and fantastic. Not much serious drama or action. Mostly comedy and a moment or two that evoke a mental \"awww\". The songs were well done and the thing this movie does best is it makes fun of itself and other bollywood movies. I don't want to spoil a lot.",
            "review_date": "2014-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "half a star for being funny .. I so love akshay kumar's acting in a comic role",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hoularious and turns the world upsidedown  for tees maar khan",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Katrina Kaif can be most dumb actress produced in India so far. Worst entertainer from FK.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bollywood cotton candy, but it's good to splurge once in a while; even when you know it's bad for you.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is it that Indian movies keep getting worse and worse. This movie is a waste your time. The only good thing was Katrina Kaif.",
            "review_date": "2012-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Right, there's a lot of flamboyance, a lot of money spent on production, big stars, sizzling item song, whatever, But what's the film's point again?",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kumar does another great role as lead actor. A silly comedy that doesn't bother much with action or drama, but still features trademark vibrant colors, dancing and music. Even the requisite musical about love is in there, no matter how unnecessary! Too long, but very entertaining.",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tees Maar Khan has the 80s masala included, however doesn't really make an impact on anyone. It fails badly at entertaining, making you laugh, cry or swing your hips! An epic fail, though the thing that makes you laugh throughout the film, is the hilarious script. It does have quite a boring and stupid story, however too much comic ends. The thing that ruins the hype, is too much over-acting.\r\n\r\nRecommended (One-Time Watch)\r\nVerdict = Below Average",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total nonsense attempt at entertaining, does have a few laughs and dialogues and they item number of course. Best watched in the background when browsing the Internet or reading a newspaper",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a good time pass movie! Great jokes, and good acting!",
            "review_date": "2011-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie tried to be original, but suffers form the poor script and amateur Direction.",
            "review_date": "2011-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie started with soo much promise. I thought i was in for a ride of the likes of Dhoom 1 and Dhoom 2, but i was sadly mistaken. This movie turned into a slapstick comedy that was a little over the top but really with Bollywood flick like this you should just sit back and enjoy the show not really think about anything. THe thing i liked about this movie was the baby scene in the beginning of the movie but other than that the title song was the best everything else was second rate the acting was over the top. Average Bollywood film. :)",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie wasn't as bad as many friends made it out to be. I was laughing all the way through.",
            "review_date": "2011-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much, much better than the reviews or revenues suggest. If you like comedy with some intelligence, here it is. Self-deprecating, hilariously over-the-top yet subtle and somewhat intelligently slapstick, which is why it may not have appealed to the audience fed on a different diet. And of course, great songs and dances.An example: Katrina is supposed to act as a typical Indian actress bimbo with no purpose and in doing that so convincingly she comes up with one of her better performances as well as of course her best dance sequences.",
            "review_date": "2011-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nothing good in this film",
            "review_date": "2011-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tees Maar Khan s an 2010 Hindi action comedy film directed by Farah Khan, starring Akshay Kumar, Katrina Kaif and Akshaye Khanna in the lead roles. Anil Kapoor and Salman Khan make a special appearances in the film as well.\r\n\r\nTees Maar Khan revolves around an overconfident conman named Tabrez Khan (Akshay Kumar) who has been a criminal from birth. (Yeah you read that correctly, he stole the doctor's watch and nurse's chain on the birthing table) Tabrez is a thief who is capable of opening any lock in the world, be it on a flying plane or a running train. The story revolves around how he undertakes a job to rob a train containing millions of dollars worth in precious antiques. Tabrez's love interest is played by Katrina Kaif as Anya Khan who nails her bimbotic airhead role to perfection.\r\n\r\nNot my cup of tea. It all looked like a lot of goofing around was captured in a camera and eventually put together as a movie. One of my friends took part in a Bollywood Competition and Sheila Ki Jawani was her talent piece so truth be told I just watched this movie for the song. (and Katrina oozes sensuousness in the video.)",
            "review_date": "2011-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Con artist pulls a robbery while filming a false movie",
            "review_date": "2011-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tees maar khan sets new low for cinema making with atrociously unfunny jokes,extreme overacting,poor direction and unbelievablyy silly script.Akshay kumar tries hard to make the audience laught but barring a couple of scenes his effort falls flat on face.I never thought katrina kaif as an actor much but she gives a career worst perfomance.Akshay khanna what can one say about him.Is this the same actor who gave a wonderful perfomances in Dil chahta hai and Race.I have been a big fan of farah khans previous film Main hoon na and Om shanti on because they contained smart one lines unlike our other bollywood comedy. fims.Consider yourself very brave if you're able to survive the entire film, because it tests your patience like few films have before. Tees maar khan it turns out to be everything that the previous farah films were  not - way-over-the-top, too-long-too-boring, and entirely mindless.Some films kills u slowly.Tees maar khan kills u with excess. It one's of those painful movie-watching experiences you wouldn't subject even an enemy to. tHE ONLY REASON I DIDNT GIVE THIS ONE ZERO is because i cant.\r\nTake a long walk in the park there is no reason why u should torture urselves by watching this nonsense",
            "review_date": "2011-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice escapism is you leave your brain at the door.",
            "review_date": "2011-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so random, but I loved it! I didn't want the movie to end! Real feel good movie!!!! The introduction alone captured my attention! I look forward to seeing the next film by Farah Khan! Akshay,Katrina,everybody including the \"British Sweeper\"(lol) did a fantastic job! Can't wait to watch this again!",
            "review_date": "2011-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's completely absurd.  The plot in nonsensical.  The acting is atrocious.\n\nLuckily, most of the movie is filled with decent song and dance numbers.  I watched it with my 3 daughters this afternoon, and they enjoyed it immensely.  It really has no \"value\" for adults, unless you're just skipping between dance routines.\n\nOne joke was pretty silly though: The idea that a criminal is pretending to be the brother of director M. Night Shyamalan...by calling himself \"M. DAY Shyamalan.\"",
            "review_date": "2011-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess Farah Khan can't make good movies all the time.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Humor of the Farah Khan and Sajid Khan variety.",
            "review_date": "2011-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My rating: 2 / 5 stars: Average Comedy",
            "review_date": "2011-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no disputing the verdict delivered on TMK. It's awful indeed. BUT, for those of us who've taken a liking to Farah Khan's style of movie-making, one can actually 'see' her behind every scene/frame having fun practicing her craft, trying to create a slapstick cult flick (but of course falling flat), and that's some consolation. After all, a couple of good laughs she extracts from us with the 'Oscaar'-crazy Akshaye Khanna character count for something! :-) \"Go Farah! Don't be beaten down by this debacle . But, next time, make sure you grab a script before you head out the door with your camera! In fact, you should have beaten Rohan Sippy to the punch to grab 'Dum Maaro Dum' to make yet another fun celebration of the 70's and 80's\".",
            "review_date": "2011-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good acting job though by almost everyone",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a marvelous epic Mishap which happens very rarely.Very Poorly Scripted and Executed though extreme talent potentiality. Farah Khan should go back to her day job and choreograph rather than establishing All time Low record in Bollywood.",
            "review_date": "2011-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/2  star for making this movie \n1/2 star coz they have casted Katrina kaif",
            "review_date": "2011-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half is good acc' but the second half is not bearable to watch, this is what happens when husband of a desi cow translate an itallian movie & tries to take it's credit.",
            "review_date": "2011-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cant rate this movie as there is no way of giving a negative marking out here, but consider it minus N for now.. THE SICKEST movie I ever saw. We just couldnt stand it after interval and left the theater in the middle of the movie.. Farha, please stop directing movies, seriously. You surpass yourself each time you come up with an idea of a movie.. that is, if it can be called an idea, since it is NEVER original. And Katrina and Akshay, why would you guys want to be a part of such a disaster?! It is a crime to torture the audience with such bu****it.",
            "review_date": "2011-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie of all time",
            "review_date": "2011-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "is watchin' SHILA KI JAWANII..... lolzzz",
            "review_date": "2011-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it at Inox in Pune. Excellent sound effects and the art  direction rendered a larger than life feel to the movie. Sheila ki jawani, the item song which has become very popular, was very well choreographed - sexy and sensuous without being vulgar. The story apart, everything else about the movie was good.",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "baah .... only thing that had a blast was the tyre of the volvo which i was travelling .. good that the movie  stopped and we were saved !!",
            "review_date": "2011-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an awesome creation of Farah Khan and nation is thankful to her for WASTING a versatile actor like Akshay. She has really worked so hard to create this disaster. The ending concept of giving self-award should be registered in world's history. '''''''''''''''''''''''''To all who can see the comment, its my request to give your view on this bullshit''''''''''''''''''''''''''''''''''''''''''''",
            "review_date": "2011-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the worst movie of 2010",
            "review_date": "2011-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After her earlier venture into movie making, everyone had great expectations from the director, Farah Khan, but we are nothing but disappointed.. The technical aspects are not even worthy of being discussed and as a movie, it fails into impress from the very beginning..",
            "review_date": "2011-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome and full entertainment movie.........",
            "review_date": "2011-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is it that Indian movies keep getting worse and worse. This movie is a waste your time. The only good thing was Katrina Kaif.",
            "review_date": "2011-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Avoid this horror show. Meh, people even call this a movie*scrunches nose*",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "worst movie of the decade..!!",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 1.8,
    "rt_summary": "A criminal mastermind (Akshay Kumar) plans to trick unwitting townspeople into helping him steal antiques from a heavily guarded train."
}