{
    "rating": 4.4,
    "release_date": "2019-07-02",
    "num_reviews": 218,
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "summary": "After security expert Ray Breslin is hired to rescue the kidnapped daughter of a Hong Kong tech mogul from a formidable Latvian prison, Breslin's girlfriend is also captured.",
    "reviews": [
        {
            "review_title": "Not quite worth the effort...",
            "content": "They should have stopped after the first movie. Whereas the 2013 movie \"Escape Plan\" was actually good, the 2018 sequel \"Escape Plan 2: Hades\" and now the 2019 \"Escape Plan: The Extractors\" have been abysmal, to put it bluntly.The storyline in \"Escape Plan: The Extractors\" was just pointless, and it even seemed that none of the cast actually bought into the plot, script and storyline here either. Just what were writers Miles Chapman and John Herzfeld thinking here? How did this script actually make it to become a movie?The movie is monotonous, and that is actually putting it mildly. There is no adrenaline kicks throughout the movie, and it quickly settled into a boring trot and never got out of that mundane gutter. Yet, I managed to endure the ordeal, as this is a Sylvester Stallone movie after all. Not one of his best movies, not even by a longshot.It was actually Devon Sawa whom carried the movie here with his performance, as he was the one that had the most screen time, the most energy and the most on-screen presence, whereas the likes of Sylvester Stallone, Dave Bautista and Jin Zhang were just autopiloting their way through this movie at the hands of director John Herzfeld.\"Escape Plan: The Extractors\" not only lacked a proper storyline, it also lacked character motivation and the ability to engage the audience. The entire movie just felt like a copy/paste job quickly put together for the sake of cashing in on the franchise before it is too late.By skipping out on watching \"Escape Plan: The Extractors\" you will not be missing anything vital to the franchise. This 2019 movie wasn't really worth the time or money invested into it. As such, my rating for it is a mere three out of ten stars.",
            "review_date": "2019-10-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Muddled B-sequel",
            "content": "ESCAPE PLAN 3 is of much the same quality as part two in the series, which is to say that it's not very good. The first time was a proper fun action movie, light and forgettable, whereas these follow-ups are B-movie cash-ins, nothing more. The prominent presence of Stallone on the cover is misleading too, because he tends to have little screen time and ends up a supporting actor in his (supposed) own movie.The plot of this one is entirely muddled, with an evil kidnapper hiding out in the dark and dingy confines of an old prison and our heroes having to go in an rescue their loved ones. A bunch of once-famous faces are included for no real reason, and others like 50 Cent barely register. While I was pleased to see Zhang Jin in the cast (MASTER Z: IP MAN LEGACY being a recent favourite of mine), his fight scenes, although hard-hitting, are slightly spoilt by dodgy editing which detracts from the choreography. Better are Dave Bautista and Stallone himself, both of whom get a brutal fight to themselves, although you have to wait towards the end to view them. The rest isn't particularly worth bothering with.",
            "review_date": "2020-02-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Much better than the last one",
            "content": "After watching Escape Plan 2 you have the lowest expectasions for this one. Then with the big fear of this also beeing bad i was surprised to see that it was an ok action movie.. It will never be a classic worth watching again and its nothing like the first one, but is ok. the production is at a higher level than in number 2",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Getting worse...",
            "content": "Novice writer and creator of Escape Plan, Miles Chapman, had a great story and concept with the 1st film, flopped on the original premise in the 2nd film, and seems like he ran out of ideas and got lazy for this 3rd film. What happened to Stallone escaping OUT of prisons? Where was the tech and gadgetry for the \"extraction\"? Oh wait, exploding fire bullets? Pshhh give me a break. Then add major plot and scene issues. Again, lazy writing. The directing was lousy with terrible camera work and editing. The score was annoying and out of place. Basically an all-around cheap C-grade production, that even the original great lead cast couldn't save. The martial arts fight scenes were choreographed really well, but it felt like director John Herzfeld had shaky hands recording with his iPhone4. It's a shame this one couldn't even compare to the first film. The 2nd film was even better than this one. It's a very generous 5/10 from me - mainly for Stallone, Bautista, and the 5 mins we saw 50 Cent.",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another Superficial Escape Plan",
            "content": "Sylvester Stallone movies can be fun. In Swedish director Mikael Håfström's \"Escape Plan\" (2013), Arnold Schwarzenegger co-starred with Stallone, and these two legends collaborated to break out of an impregnable black site prison. The last-minute revelation about the prison's mysterious whereabouts capped this imaginative cat & mouse suspense saga. Stallone and Schwarzenegger contended with the smart but ruthless Warden Hobbes (Jim Caviezel of CBS-TV's \"Person of Interest\"), who kept close tabs on their shenanigans. The $55 million \"Escape Plan\" coughed up $25 million domestically but generated $112-million overseas! Reportedly, the lucrative Chinese box office prompted Summit Entertainment to slap together back-to-back sequels. Stallone reprises his role as Ray Breslin. A former criminal prosecutor turned prison security expert, Breslin is a past master at escaping from the most foolproof prisons. His Houdini-like talent for breaking out of the tightest prison intimidates wardens.In director Steven C. Miller's \"Escape Plan 2: Hades\" (2018), Breslin landed in a totally automated black site prison where a robotic physician attended to the inmates' health. In \"15 Minutes\" director John Herzfeld's \"Escape Plan 3: Extractors,\" Breslin breaks into the prison! Basically, WCW wrestler Dave Bautista has replaced Schwarzenegger as Stallone's ace-in-the-hole. Bautista's character strikes from without to within, while Stallone works in reverse. Bautista's heavily armed goon appears with miraculous punctuality to link up with Stallone. Aside from Stallone, Curtis \"50 Cent\" Jackson's bespectacled computer nerd Hush is the only other original cast member, but his presence is peripheral. Jamie King is back from \"Escape Plan 2: Hades\" as Stallone's love interest, but their relationship is ill-fated. Victory walks arm-in-arm with sacrifice.Although he has top billing, Stallone doesn't dominate the histronics as much as his Chinese co-stars. Mind you, he spends more time on screen here than in \"Escape Plan 2: Hades.\" Two factors distinguish \"Escape Plan\" from its quickie sequels. First, both sequels clock in considerably shorter than the two-hour \"Escape Plan.\" \"Escape Plan 2\" ran 94 minutes, while \"Escape Plan 3: Extractors\" saves time at 88 minutes. Indeed, the end credits take up ten minutes, with the conflict depicted in 78 minutes. Interestingly, \"Road House 2: Last Call\" scenarist Miles Chapman emphasizes \"Extractors'\" ties to the original. Not only did he pen \"Escape Plan,\" but he also wrote both sequels. Primarily, Chapman splits the episodic action up between Ray and Trent as well as the two Chinese bodyguards who are captivated by Daya. If you've seen \"Escape Plan,\" you may remember Ray Breslin's unscrupulous partner, Lester Clark (Vincent D'Onofrio of \"Full Metal Jacket\"), who supervised the logistics of putting Breslin into prisons with a fake identity. In \"Escape Plan,\" Clark double-crossed Breslin, but his treachery cost him his life. He dies screaming in a cargo ship plying an anonymous sea. As it turns out, the \"Extractors\" villain is Lester's obnoxious son, Lester Clark, Jr. (Devon Sawa of \"Final Destination\"), and he wants payback! This is reminiscent of \"Die Hard\" and \"Die Hard with A Vengeance\" where the brother of the original villain challenges the heroes.The daughter of a billionaire Chinese business mogul, Daya Zhang (Melise of \"The Shannara Chronicles\"), wants to invest in the post-industrial town of Mansfield, Ohio. She argues their corporation-- Zhang Innovations--can revive the local economy. Moreover, Daya assures her father, Wu Zhang (Russell Wong of \"New Jack City\"), that the investment will improve the company's worldwide brand image. No sooner have city officials vowed to accommodate Daya than a team of mysterious gunmen disguised as an airport ground crew kidnap Daya. Despite the best laid plans of Daya's alert bodyguard, Bao Yung (Harry Shum, Jr. of \"Crazy Rich Asians\"), he finds himself outnumbered and outgunned. The villains knock Bao senseless, and Lester Clark, Jr., plants a flash drive on him with Ray Breslin's name. Naturally, Wu Zhang is furious about his daughter's abduction.\nMeantime, a stranger, Shen Lo (Jin Zhang of \"Pacific Rim: Uprising\"), provokes a brawl in Breslin's office. He wields a rolled-up umbrella as a weapon and floors Breslin's bodyguards. No sooner has Shen eliminated all resistance than Breslin gets the drop on him. Shen Lo hands Ray a disk with data about Daya's whereabouts. At this point, we learn Wu Zhang's company built the prison in \"Escape Plan,\" and the Saudis commission a similar facility in the desert. According to Shen Lo, Wu has reaped billions from incarcerating and torturing innocent people by the thousands. Shen probes Ray about Lester senior's connection to Wu Zhang. Shen vows to topple Zhang. Moreover, Shen was once Daya's bodyguard, but his romantic sentiments prompted Wu to fire him. Sadly, Herzfeld and Chapman never elaborates about this subplot in an actioneer where public displays of affection are minimal.Shen and Bao tag along with Ray to rescue Daya. Meantime, Ray contacts Trent DeRosa (Dave Bautista of \"Spectre\"), and he identifies the prison where Lester's son has Daya as 'the Devil's Station' in Latvia. Ray and his girlfriend Abigail (Jamie King of \"Escape Plan 2: Hades\") are poised to leave when Junior's men surprise Ray and snatch Abigail out from under Ray's nose. Meantime, Shen isn't the only one who wants to destroy Wu Zhang. Junior demands $700 million from the Hong Kong patriarch. In the complex Miles Chapman & John Herzfeld screenplay, Lester has grabbed Abigail to give Ray another reason to come to him. Our heroes enter the dilapidated prison without fanfare via the sewer. Ray carves up one of Lester's roughneck henchmen with a bloody knife. Fireworks erupt as Shen and Bao trip the alarms in the 'Devil's Station.' Lester's trigger-happy henchmen capture Shen and Bao, but they don't remain long in captivity. Meantime, Trent ambles nonchalantly into the rugged prison with a fearsome shotgun and blasts away at the unsuspecting felons.Director John Herzfeld stages some agile hand-to-hand combat scenes that compensate for the expository boilerplate scenes. Altogether, \"Escape Plan 3: Extractors\" generates more intrigue than \"Escape Plan 2: Hades,\" but neither overshadows the original \"Escape Plan.\"",
            "review_date": "2019-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dear Sly, please stop!",
            "content": "How does such a great movie spawn two horrific sequels?? What a bludger of a film. The whole thing is just a mess.",
            "review_date": "2019-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible awful mess, Stallone blew it, another horrendeous RANT",
            "content": "Escape Plan 3: The Extractors Another horrendeous RANT on a peace stinker DTV sequel garbage from Stallone!Another movie that Stallone did belongs in the trash. I like the first Escape Plan and in that movie Ray Breslin played by Stallone was not a violent person in this movie he is a stone cold killer. I couldn't finish this movie. It was boring as hell, colors were again yellow like someone pie on the camera. Plot is a mess and makes no logic at all. Again Chinese people are in this movie again just like in Escape Plan 2: Hades. What is up with Sly nowdays about Chinese people? I don't get it.This movie is garbage, it has shaky cam just like in Part 2. The cam moves up and down like you have a migrene! I don't want to watch Escape Plan 2 and 3 ever again! I did finish Hades, this movie I gave up. The plot is about a guy from the first movie getting revenge on Sly so he kiddnaps Sly's gf and another Chinese girl and he extortion a rich Chinese man. Stallone looks like a fat whale and he barely moves and walks. Is Stallone turning in to a Steven Seagal wannabe nowdays? Russell Wong is in this movie and I loved him in Vanishing Son I, II and III, even in series I loved him. Russell is really old and he is not a bad-ass martial artist like he was in Vanishing Son. Did Stallone try to imitate and copy the movie Fortress (1992) with Christopher Lambert in Hades and in Extractors? Becasue Hades was like a sci-fi film, Extractors wasn't, but it is still forgetable.What is going on with Sly these days? This was unnecessary made, Stallone did not need to make 2 badly awful sequels! Did he do it for the money? Or did he thought it will bring his career back on the top. I hope they don't make another Escape Plan movie sequel, because I want waste my time watching it! I hope people don't buy DVD or Blu-ray disc and spend $10 + shipment together for this god awful crazy movie.Escape Plan 3: The Extractors I am glad that people like such a badly boring, slow snor fest of a movie! It is a garbage waste of money, waste of talent everyone, each one of the cast. This is a mess of a movie. Stallone does not act like he does in Rocky, Rambo, Cliffhanger, Demolition Man or Over the Top he is wasted in here! So Breslin's enemy kills his gf Abigail played by different actress now from the first film. Sly try's to cry than he turns in to a vigilante and goes after the guy who killed his gf. Why did Stallone had to do that? Just why? Jamie King is awful, she was awful in this movie. 50 Cent he is the same old. Dave Bautista is on this movie he never left both of the movies.This is my horrendeous RANT on Escape Plan 3 if u want to watch a good prison movie about prison escape watch Fortress (1992) with Cristopher Lambert much better movie, better actor than Stallone! The first Escape Plan is a good movie and people put it down and hate it, but like Hades and this one? I don't get it. Escape from Alcatraz (1979) with Clint Eastwood is much better movie than Escape Plan 3: The Extractors! If you ask me both Escape Plan sequels movies are god horrible snory fest GARBAGE!",
            "review_date": "2019-11-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not bad. Completely enjoyed it.",
            "content": "Escape Plan series is one of my favourites. Every film is so surprisingly great and I totally love them. No matter how much people hate them, I really love every single film including the second one which most people are saying it's bad. This third film is also a great one. Everything's great and so, it becomes one of my favourites.Although this film is a great one, there are two things I don't like. One is Abby could have tell the truth to Les. But she didn't. What I don't get is why. Why didn't she tell him the truth? And her death is really not that good. I know that it was necessary to give Braslin some pressure. But it still makes so sad.The other is that the casting director is not that good. What I mean is that the other actors and actresses are in the right places except for the Daya character. She was supposed to be fluent in Chinese language. But when the actress talked in Chinese, her speaking is the worst I've ever seen. I couldn't even catch it properly. I had to read the English subtitle to get what she's said. I totally understand the other Chinese actors and actresses said, except her. Furthermore, her acting is the worst I've seen in the whole movie. So, if the casting director chose the other actress instead of her, it'd be better than this.I still can't believe that I would see Tong Xin from one of my favorite \"Shui Yue Dong Tian\" TV series again in this film. I can't believe he would grew up like this. But it's really good to see him like that. I feel like his character is so sexy. 😂😁One more thing I'd like to mention is that they made Les didn't know how to fight. I mean he should've known a little. I was really expecting to see more actions between him and Braslin. But there wasn't any. So, I'd say I was a bit disappointed.All in all, I feel like \"Escape Plan : The Extractors\" is a bit inferior to the first film but it's still doing good and totally spending time. I don't know about the other people, as for me, it was a great film and I completely enjoyed it.",
            "review_date": "2019-06-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not bad at all 👍",
            "content": "Ignore any negative reviews, this is a 7/10 for sure, and I'm a tough movie critic, very enjoyable. But I will tell you this under no circumstances watch the second one, it's awful !!!",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WAYYYYYYY better than \"Escape Plan 2\"....but....",
            "content": "Sly is actually a BIG part of this one,and he goes FULL RAMBO MODE! I actually liked this one. The ONLY thing is the advertised 97 minute run time. I don't think TWO MINUTES of movie bumper intros,and 10 minutes plus of end credits should factor into the run time. The movie is actually REALLY SHORT! Other than that....if you DIDN'T like the second one,\"Escape Plan 3\" is FAR superior,and worth a watch......in MY opinion.",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please end the franchise after this one (2)",
            "content": "Because the second Escape Plan already suck out all of my hope for another good old school action franchise starring Sylvester Stallone so with the third one The Extractors (2019) I set my expectation as low as possible and it definitely works when I find myself enjoy this movie quite a bit due to both Sly and Bautista got more screentime plus anytime Jin Zhang got to display his martial art skills but I seriously hope this out of breath franchise end with this one",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What was that?",
            "content": "Watched this on a flight, drawn in by Stallone. I could not understand how people with money invested in producing this script and Stallone, who must have an idea about good movies, agreed to be in it.Without spoiling it, the character motivations are ambiguous at best, and completely illogical at worst. The beginning of the movie is an absolute mess - I kept hoping everything would come together, but it was just a bad script. It was as if nobody cared about what they were doing, from writers to actors to editors, nobody was interested in making a great movie. What was that BS about buying a building in Ohio? And why did they return to Ohio from Lithuania or wherever that prison was? And Why did they put the bad guy's father in a cargo box?Why go through the hypocrisy of faking a plot here? On the same flight, I watched John Wick 3. Also an action movie that doesn't go into developing a deep plot, but at least they were self aware about it and made the bare essential plot line (kill assassins before they kill you) make sense. In this, they couldn't make a coherent story out of \"save girlfriends from kidnappers.\"Pure trash.",
            "review_date": "2019-12-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Deserves better than 4.3/10",
            "content": "This wasnt that bad. It was a basic formula. Cheesy. But it was entertaining and a good way to kill a bit of time. Turn your mind off and watch for fun.",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Weak Plot, Boring for an Action Film",
            "content": "There is no real connection to any characters in this movie, as there is no real regard to who lives and who dies. The action is okay, but the blood Is cartoonish and fight scenes are so clearly staged it makes them boring to watch.",
            "review_date": "2019-11-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I only review this movie because the original Escape Plan (2013) movie with Arnold Schwarzenegger was good. So simply watch and enjoy the other Escape plan. Not this one...",
            "content": "I only review this movie because the original Escape Plan (2013) movie with Arnold Schwarzenegger was good (7 stars). So simply watch and enjoy the other Escape plan. Not this one...The other Escape Plan (2013) was fun and it had lots of old school action stuff. And above all, it had Arnold Schwarzenegger teaming up with Sylvester Stallone. That was worth a watch as well.This 2019 version of the Escape Plan though is definitely worth only 1 star. I dont usually give 1 stars, but this movie is such a blatant cheap rip off, that the word trash is adequately describing the place where it should be put inside FOREVER...",
            "review_date": "2020-04-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A subtle promotion of the original movie?",
            "content": "The movie starts with waterboarding you with a list of production companies, with each title appearing on the screen you start thinking whether they were scared to give more than hundred bucks each or just wanted to launder as much money as possible?I would be glad to say that this film is nothing and his existence doesn't harm you. As soon as you hear about it and take a glimpse into the pile of shaky shots, empty pompous one-liners, goofy free blood splashes with 80ies hit sounds you will gather all the good memories of the first movie, which was a decent action.The disappointment covers you entirely when you realise that YouTube videos are made better but then you remember that Sylvester Stallone is there and your hands drop down while heart aches with regret that he steps into these stinky projects.Just don't watch it.",
            "review_date": "2019-11-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A much better installment but nothing to get excited about.",
            "content": "I really enjoyed the first film. Not only did it have the two huge action stars together, it had an interesting storyline too.Then came part 2. It was dreadful. Absolutely terrible film that made zero sense and was pathetic and embarrassing. So when I spotted part 3 my expectations were super low. I decided to give it a look anyway and it seems that Sly has learned a lesson after the last disappointing addition. much better not as good as the first film by any stretch, and it won't win any awards for originalityz there's barely a storyline, the usual kidnap and then rescue scenario. But it's done quite wellz some amazing martial arts and Stallone shows his angry Rambo side with some cool kills.A much better additional ion to the franchise. Just avoid part two.",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Action quite brutal and intense! Should watch it before judge!",
            "content": "This installment is about Ray rescuing a mobile tech billionaire daughter \"Daya\" and his crew \"Abigail\" out of a so called Devil's Station in Latvia! All the action in the film is quite brutal and intense! Even the martial art is portray so good by all the actor involve in the fighting! Such as, Bao fighting at the plane garage and Shen fighting in a room when waiting to meet Ray! As turnout, the mastermind of this kidnapping is Lester's son! He want to revenge for his father dead in the first film! The setup when rescuing at the Devil's Station is a bit slow but the fighting in the station are intense until the end! Ray brutally stab several guy when finding Lester's son! Trent brutally shot down several guy and take down a guy by breaking his waist! Shen also show off some intense martial art and take down a guy by breaking all his bones! Ray revenge for Abigail dead by killing Lester's son at the end! He brutally punch Lester's son in the cell and eventually slice his throat to death and fall down after that! Daya got saved at last! That's it! A quite entertaining action film!",
            "review_date": "2019-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "7/10 Entertaining and well done action scenes",
            "content": "Entertaining and well done action/fight scenes with some surprising moments. I did not actually watch the 2nd one cause it looked awful but I liked the look of this. 7 MAX",
            "review_date": "2019-06-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Considerably Better Than The First",
            "content": "Escape Plan: The ExtractorsAfter 9 (yes 9) company logos the movie opens with some scenic shots of Mansfield, there are no opening credits at all.The rooftop scene from the trailer is our introduction to Sly about 10 minutes in. It's hard to decide if Sly is actually the lead here. I have to say I think he is. He certainly has the most screen time. Two Chinese actors (one a bodyguard of a kidnapped girl and one (introduced as Mr. Friend early on) who has a run in with Sly early on) have the next highest amount of screen time. Out of the two, I'd say the latter has more.Based on what I had read, this has been totally saved in post production after the test screening. I liked it considerably more than the second movie. The acting is better, the directing is better and I even liked the score better, I'd say it is better on every level.I will say this though, it doesn't start well, but it gets better, there are a few twists and it ends well.All in all, it's better than the second, but not as enjoyable as the first.",
            "review_date": "2019-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Popcorn rescue action film",
            "content": "I liked this movie quite a lot. I approached without any great expectations. I knew at this age and scenario, Sly will not be doin a great deal here. And that's so.\nA mighty chinese business tycoon's daughter was taken and has to be extracted - that's the job. Some personal angles were brought into play. But mainly this movie was showcasing action.\nThe chinese players brought the kung fu display. Quite good. And the American stars were doing the bone cracking wwf style things. Some shooting.\nThe main part is shot in a prison in Latvia.\nIt can be considered as a polished high end version of the better quality Steven Seagal style video movies. Sometimes they are pleasant enough.\nSly wasn't required to do much physical action except at the end. 50 cents showed up in a blink and miss scene. The main villain was built up a lot from the screen play but the climax seemed underwhelming. No stylish brainy hi-tech plans or grandiose screen bursting moves. But some hand to hand comabats were nice.",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than the second, not as good as the first.",
            "content": "When the first one made 25 million in the US, but a further $75 million in China, it makes sense that it got Chinese backing for sequels and the producers took the money and ran. Whilst the second one used Stallone and Batista for a poster and credit only to suck you in, it was a vehicle for Asian market with Asian stars. With a more competent direct on John Herzfeld on the third, there's a noted improvement. First Stallone gets about 40 minutes of screen time, whilst he barely got 10 minutes in the second one, there's still great fights for Max Zhang to shine, but Stallone gets more to do here, 50 cent is in it for 2 minutes (always a bonus) and Bautista is the Terry Crews of Expendables, big guy with the big gun, gets a few minutes to shine. HIghights include the career resurgence of Martial Arts Action Star Daniel Bernhardt gets a great end fight with Max Zhang and Stallone gets brutal with Devon Sawa 90s heartthrob from the Final Destination movies. Overall, a vast improvement on number 2, nowhere near as good as the original, but we get fights, we get blood and we get Stallone kicking but here and there. It's easy to see why he's established Balboa Pictures in his twilight years and doesnt want to get caught doing these sequels and Backtrace style films for a quick payday. He cares more about his career than a Cage or Travolta or Bruce Willis at this point and doesnt want to do this for the pay cheque. Overall, starts bad and gets better and ends well. Worth a watch and support with your purchase.",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Absolutely awful",
            "content": "I normally love movies like this. Loved the first one with Arnold Schwarzenegger. Couldn't hate this one more. Disappointed I could not give it a 0/10 rating. Almost an hour into it and nothing interesting has happened. Don't waste your time.",
            "review_date": "2019-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Oh no",
            "content": "No Sly, what happened? Low budget chinese feeling.",
            "review_date": "2019-08-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Morphing into The Expendables",
            "content": "Film has very tenuous links to the first one and abandons what that was actually about, you know, the whole escaping from prisons thing! Here the prison is just a location that's used but could be set anywhere as its a hostage rescue and the other prisoners were just generic extras anyway. Im not even sure what the purpose of ray breslin going was to begin with as it seemed to be making huge leaps to get a plot. Eventually he gets a reason but it was a bit of a stretch ti begin with. Really it just seems to be a vehicle to make Expendables lite without all the usual suspects. Wasn't terrible just run of the mill stuff and very forgettable.",
            "review_date": "2019-06-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WHY SLY!!!!!",
            "content": "I don't understand why a movie that grosses 25 million in the US gets a green light for 2 sequels. I am a huge fan of Sly but there was no reason for him to make these 2 sequels. Incredibly bland and boring and certainly one of his worst movies that he has been in.",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Decent addition to the franchise",
            "content": "I completely disagree with one of the other reviewers who said this was a bad movie...if you liked the first two films, then you'll most likely enjoy this one as well. Nothing new here, but it's solid entertainment for fans of the franchise. And sly is actually GREAT in these films, regardless of what others think.",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What was the plan exactly?",
            "content": "Suddenly Escape Plan 2 and the Ebola virus don't seem so bad. I don't blame Sly for taking the money, but this film is nauseating. Completely devoid of redemption. Boring, brainless, soulless cash grab that has nothing to do with the wonderfully-crafted original film. F",
            "review_date": "2019-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Somewhat Deceptive Casting",
            "content": "50¢ was in the movie for only about five minutes. But other than that, it has plenty of action. Some gunfights, but a lot of martial arts. The plot isn't realistic at all, but it's fine as dumb fun.",
            "review_date": "2019-06-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Escape Plan 3 Review",
            "content": "Security expert Ray Breslin (Sylvester Stallone) and his team are hired to spring captured tech heiress (Malese Jow) from an impregnable prison in Latvia. The odds ramp up when Breslin's girlfriend and colleague Abby (King) is also taken hostage.\n\"I'm done with prisons,\" drawls Sylvester Stallone's security expert Ray Breslin and watching Escape Plan 3 it's hard to disagree. Third time round for Stallone's 4th string franchise (Rocky, Rambo, The Expendables are all higher up the cinematic food chain) the emphasis here is less on the problem solving of previous outings and more a dull cycle through grim punch-ups, bad acting and blatant attempts to woo the Chinese market - The Grandmaster's Jin Zhang and Crazy Rich Asians' Harry Shum Jr have prominent if, like everyone else, underwritten roles in the melee.\nRather than a prison break, this time round it's a break in. The reheated old guff that passes for a plot sees Breslin and his cohorts (Bautista, Curtis '50 Cent' Jackson, Jaime King) looking to extract Daya (Malese Jow), the daughter of a Hong Kong tech giant (Russell Wong) from a giant Latvian penitentiary ominously known as Devil's Landing. Daya and Breslin's partner Abby (Jaime King) are being held hostage by a goon (Devon Sawa) with a grudge against Breslin that stretches back to events in the first film (don't worry we didn't remember either). Previous Escape Plans had a sci-fi tinge. This one is rooted firmly in bargain bin action licks circa 1992 and has little invention or charm to up the ante. It also plays that DTV trick of promising big name stars on the poster and failing to deliver - Dave Bautista appears fitfully and Stallone only a little more.\nDirector John Herzfeld has a background in non fiction and the film bizarrely opens with a tone poem about modern America, almost a documentary on the Trumpian rust belt heartland. After that it's the expected slog through dull exposition, decent if repetitive martial arts fights (in aircraft hangers, office blocks plus a good bit with a crowbar), women-in-peril tropes, endless creeping through dimly-lit sewers, bad speechifying and in Breslin, the most uncharismatic character in Stallone's back catalogue. And that includes Joseph \"Joe\" Bornowski in Stop! Or My Mom Will Shoot.",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I personally enjoyed it.",
            "content": "Just wanted to say i am so glad i ABSOLUTELY take NO notice of reviews on here UNTIL i watch a film. Enjoyable watch for me. Bye.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "See and decide for yourself",
            "content": "I often wonder why someone would trash a movie because they're unable to understand the plot.\nThis movie has got all the grit, action and suspense you'd expect from it.\nThe east meets west mix of cultures is endearing. I don't need to give away any spoilers, watch it for yourself and decide. Don't make a decision based on the reviews here.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Impressive...",
            "content": "Is how Sly Stallone is held together at 103 years old.The story was equally sewn together.Some of the action sequences were okay, but this installment lacks the intricate prison puzzle that the first two had.I am also disappointed that the female character seems a little subservient and weak. I understand this is still vogue in China, but there are still capable women.It seems like a political knot between Chinese d American cinema.Without Stallone this would be a 1",
            "review_date": "2019-11-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "No that bad!",
            "content": "Ok it's better then Escape plan 2 and Backtrace by a long shot!\n1. Sly is in it about 80%.\n2. Some good action\n3. Rated R",
            "review_date": "2019-07-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stallone needed money??",
            "content": "Absolutely positively the worst Stallone movie made. Even a Rocky 38 would be better than this junk.",
            "review_date": "2019-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another nice one from Stallone.",
            "content": "The plot and the actions scenes are well organised. I would almost not watch it when I saw the ratings but I'm glad I didn't consider the ratings. It's another good work from Sylvester Stallone bring the first movie into caption in this new sequelae.👍👍",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "it has nothing to do with an \"Escape Plan\", there was not even a PLAN",
            "content": "Nothing to say\nif you like Stallone, do not watch this",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Extract yourself from this horrible film.",
            "content": "Escape Plan: The Extractors (1 out of 5 stars).Escape Plan 3 is by far the worst and terrible film in the series. Right up there with the second movie. The first was decent and entertaining. The direction, writing, acting, and storyline are just flat out boring and terrible.The plot does refer back to the first movie with the connection with the first bad guy. The theme of sins of our fathers idea. Ray (Sylvester Stallone) and Trent (Dave Bautista) and Shen (Jin Zhang Jr.) team up together to go save Abigail (Jaime King) and Daya (Melise) who is involved in an expensive business. When the two girls are kidnapped by Lester (Devon Sawa) and placed in a torn down high security prison.The plot is boring. It has a couple of sub plots about a chinese billionaire company. Two Chinese guys are tasked at rescuing the girl. They both know Ray Breslin. It does wrap up the trilogy well. But poorly executed.The writing is terrible. The direction is horrible. With a boring story. The action sequences are also dull. The fight scenes are nothing new. I am wondering if it was something wrong with the DVD or if the director did manage to forget to put subtitles for when the characters were speaking Chinese for ¼ of the movie. It was difficult to make out what was going on with the sub plot. This is also one of Stallone's second worse films besides the second film. The rest of the cast was dull with their roles. The villain is forgettable played by Devon Sawa.Overall, Escape Plan: The Extractors is a terrible film. The action is bad. The story is boring. The writing is cheesy. The direction is worse. The film feels like they were about to include a twist with the sub plot of the story but managed to forget about that too. It was terrible overall.",
            "review_date": "2019-07-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Truly...I enjoyed watching this movie...",
            "content": "Don't believe on others bad comments..This is not boring..Give it a shot..",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Maybe This Not Good Enough But You Can Not Say Bad",
            "content": "Let me tell you something. This is a short and simple movie. Run time only 1:27 hours. If you think that the lead actor is \"Sylvester Stallone\" and this movie is going to be crazy! man take a break, they have to give a chance to new directors and simple scripts that's how we get a blockbuster. The story is very very simple. There is a lack of vision for the camera they missed some simple details. Dave Bautista did amazing. I like the new guy Jin Zhang, specially for his martial arts. Anyway this movie is not bad but you can watch other movie if you don't have much time. If you're a fan of Sylvester then go for it with no regret. Once again it's not the best but not the worst.",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "ACTION ACTION ACTION!",
            "content": "Sly killed it with this third installment o Escape Plan - I will its better than ONE and we will forget TWO altogether. As an action seeker, this film provides all the right goods - MMA - Boxing - Kungfu - integrating so any styles and left me cheering. Escape Plan THREE will be on my purchase list. Keep Punching SLY!",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "By far the worst of the 3 Escape Plans",
            "content": "So this time, they had to break IN to a prison. That's a new twist and kinda cool, except... All they did was walk through an underground tunnel! No action or drama or calculating a plan to get past ingenious security. Nope, just walk in through the basement.\nDo foreign billionaires really form conglomerates in small towns in Ohio? We didn't get that either.\nAnd the bad guy films a ransom video in a Belarus prison. Then a minute later, he kidnaps the girl in L.A. And then a few hours later, back in Belarus.\nUnless he can teleport like Star trek, none of that is possible !",
            "review_date": "2019-10-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Violent and thrilling sequel in which security expert Ray Breslin/Stallone is hired to rescue the kidnapped daughter of a Hong Kong tech mogul",
            "content": "Nail-biting action movie blends suspense , thrills , twists and violent struggles . Regular but professionally shot by John Herzfeld with a fine cast , such as : Stallone , 50 Cent , Devon Sawa , Jaimie King , Jeff Chase , Daniel Bernhardt , Russell Wong .It is believed that no one can ever flee from impregnable jails , until a daring man makes possible successful attempts at escaping from the most infamous prisons all around the world . He's called Ray Breslin (Sylvester Stallone) , as he manages an elite team of security specialists trained in the art of breaking people out of the world's most impenetrable prisons .This film narrates how to be the preparation and execution of the thrilling rescue of the kidnapped people .After escaping death by the skin of his teeth in Escape Plan 2: Hades (2018), Ray Breslin, finds himself in the impenetrable Latvian prison known as the \"Devil's Station\", to retrieve Daya (Melise) , the abducted daughter of a powerful Hong Kong tech mogul (Russell Wong) . When she goes missing Ray is assigned in what appears to be a routine ransom job ; however , things go wrong . As Breslin and his crew delve deeper , they discover the culprit is the deranged son of one of their former foes . Beinf targeted by Lester Clark Jr. (Devon Sawa) son of an old contender Lester Clark Sr (Vincent Donofrio) .Then this structural-security authority Ray must carry out his mission with the help of his most trusted operative, the resourceful technology expert Shu Ren (Curtis 50 Cent) and former friends , intimate associate Abigail Ross (Jaime King replacing Amy Ryan), Trent DeRosa (Dave Bautista) , and the businessman's bodyguard, Bao (Harry Shum) , among others . Then , Breslin's girlfriend (Jaimie King) is also captured and is holding her inside the massive prison . However, this time, it's personal, and Ray has one more reason to succeed at all costs. No one breaks out alone .The most formidable secure prison ever built . Breaking out is an inside job. Prepare for the Damage! Prepare for the Last Escape.No one breaks out alone.\nThis moving flick contains suspense , violent brawls , thrills , action pace , violence with grisly slashing , intrigue , lots of gore and blood and being pretty entertaining . The movie takes place into a fortified compound , four walls of a jail , basements and tunnels , involving the preparatives and execution of the dangerous rescue . The simple and light plot is usual : Ray nicknamed ¨the Houdini of breakouts¨, and his team--Hush, Trent DeRosa, --must infiltrate the impenetrable stronhold , before the determined kidnapper starts killing the hostages . This is a thrilling story of action and tension in which masterminded Ray carries out this elaborately detailed mission and, as far as anyone knows, executes relentlessly his objectives . The final confrontation between the starring and baddies is stimulating and has some extraordinary surprises . Film runtime is adequate , it is fast-moving and is neither boring, nor tiring , but bemusing . It stars the veteran Stallone who confronts risks and sufferings for reaching his purports . Sylvester Stallone is top-notch as a tough and obstinate hero , the security expert Ray Breslin , who is hired to rescue the kidnapped daughter of a Hong Kong tech mogul from a formidable Latvian prison, subsequently Breslin's sweetheart is also captured. Support cast is pretty good , such as : Curtis '50 Cent' Jackson , Dave bautista as Trent DeRosa , Devon Sawa as Lester Clark Jr , Jin Zhang as Shen , Harry Shum Jr. , Jaime King as Abigail ,Melise as Daya Zhan , Daniel Bernhardt as Silva , Jeff Chase as Frankie , Lydia Hul as Jules , Russell Wong a Hong Kong tech executive, Vincent D'Onofrio as Larry Clrake Sr , and Holland Herzfeld , director's son , who was the Los Angeles Regional 220lb Wrestling Champion of 2012, among others .The motion picture was regularly written/directed by John Herzfeld who roomed with Sylvester Stallone at the University of Miami. After appearing in movies such as Death Wish and Serpicio, Herzfeld guest starred in many television shows including playing Starsky's brother in Starsky & Hutch. Moving behind the camera Herzfeld wrote, produced and directed several distinguished and highly-rated television films, including; The Ryan White Story with George C. Scott and Sarah Jessica Parker, Daddy with Dermot Mulroney and Patricia Arquette, The Preppie Murder with Danny Aiello and Sandra Bullock, A Fathers Revenge with Brian Dennehy and Stoned for which he won a directing Emmy and was nominated for writing. Herzfeld has written/directed nice films such as : Bobby Z , Reach Me , Daddy , Last Winter , Two days in the valley , Fifteen minutes , Don King only in America, Two of a Kind . Herzfeld went on to win the Directors Guild of America Award and an Emmy nomination for his HBO film Don King: Only in America starring Ving Rhames .The trilogy is formed by the original and best : ¨Escape plan¨ in which Breslin finds himself set up and incarcerated in the world's most secret and secure prison, no-one had managed to escape before,¨The Tomb¨ -a highly fortified prison based on his own design- and he must use his skills to escape with help from the inside. Dealing with experiences of convicts of a prison that is a hell on the earth , reflecting the hardship existence of the inmates . Here we see men tortured men , harassed and humiliated in a gaol where rules the strongest law. And , ultimately , it takes place the successful break-out from allegedly perfect prison , with two inmates Ray (Stallone) and Rottmayer (Schwarzenegger) , both of whom are equally two-fisted , and equally determined to regain his freedom , and they attempt a daring escape from the dangerous prison. While Warden Hobbs (Jim Caviezel) controls The Tomb with brutal efficiency, along with his team of masked guards led by Drake (Vinnie Jones) . It is followed by ¨Escape plan , Hades¨ (2018) : Years after he fought his way out of an inescapable prison, Ray Breslin has organized a new top-notch security force. But one of his team members goes missing, as he is kidnapped and disappears inside the most elaborate prison ever built, entirely computerized and constantly changing shape , then Breslin must return to the hell he once escaped from ; directed by by Steven C Miller with Stallone , Dave Bautista ,Titus Welliver , Jesse Metcalfe . And ¨Escape plan , The extractors¨ (2019) : After security expert Ray Breslin is hired to rescue the kidnapped daughter of a Hong Kong tech mogul from a huge Latvian prison known as Devil's Station, then Breslin's girlfriend is also captured. This Trilogy of movies without a doubt result to be three suspenseful and intriguing films to be liked for action fans , being the first a pretty good movie , turning out to be one of the most original Prison sub-genre movies of the last years ; however the second is a lousy sequel , while the third turns out to be a mediocre follow-up .",
            "review_date": "2020-03-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just made for the Chinese market",
            "content": "This movie is just another in a long line of\nChinese produced rubbish, made purely for the Chinese market.\nThey always have Chinese stars who can barely speak English, and the Chinese are never the bad guys.",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "No prison break",
            "content": "I only gave it 6 because of the fight choreography. The martial arts scenes were brilliant, the storyline was somewhat predictable. The whole movie was like 63 mins long, too short. The first was the Bomb! Enjoyed the second but the third was just not that enjoyable",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just another one-man army vs. the baddies..",
            "content": "And yes..it's just as cheesy as it sounds..No good plot whatsoever here..just some people punching and gunning each other..and in the end, the so-called \"hero\" gets his poetic justice type of revenge..Hell, they even added the girlfriend-killed type of false emotional moment and then the hero gets his revenge after and hour and half of torturing the viewers brains and eyes in a lame attempt to play on the emotional side and yet it just failed soooo bad.\nI mean yes the kung-fu parts are good but that's it.. nothing else is.",
            "review_date": "2019-08-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Director and Actor 🎭 bring old-school action into the modern game",
            "content": "Being a huge fan of both Stallone and Herzfelds past work. I was overjoyed to see they've finally collaborated on an action film that delivers on all fronts.\nHerzfelds direction is smart and concise. As he brings out the very best in Stallones ability to translate inner rage onto the screen. The climatic fight scene at the end feels totally unscripted and visceral. A welcomed alternative to many of today's over choreographed fight scene ballets IMO.I'd love to see these 2 team up again for a sequel and or another project. 🎥I completely enjoyed this movie and remain a fan of both the Director and Stallone 🌟 🌟 🌟 🌟 🌟\nPS\nThe rest of the ensemble also brings their A GAME. With Batista and crew chewing up the action themselves like woodchippers! Bravo 👏 to this production team.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another one!",
            "content": "Take it from someone who has watched more than forty Sylvester Stallone movies in three weeks. Even I didn't really want another Escape Plan movie. Yet here we are.Thanks to foreign markets - while the film went straight to video in the US, it played in theaters in Russia, Italy, United Kingdom, Australia, Turkey and Portugal - this movie was announced even as Stallone was filing Escape Plan 2.Security expert Ray Breslin (Stallone) is hired to rescue the kidnapped daughter of a Hong Kong tech mogul - who is trying to revitalize small towns in Ohio like Mansfield - and his girlfriend Abigail Ross (Jaime King) from a prison run by the son of Lester Clark Jr. (Devon Sawa, Idle Hands), whose father was the bad guy wat back in the first film.Curtis \"50 Cent\" Jackson and Dave Bautista return for one more mission, one where everything seems shot under a gold filter. There's really nothing that I liked about this film other than Bautista and Stallone's interactions.Director John Herzfeld started his directing career with ABC Afterschool Specials before directing the critically savaged Olivia Newton-John and John Travolta film Two Of A Kind. He also directed The Ryan White Story, The Preppie Murder, Casualties of Love: The Long Island Lolita Story (seriously, the fact that I haven't covered every single Amy Fisher film that I've watched on this site is such a missed opportunity), the Tarantino-influenced 2 Days In the Valley, Don King: Only In America and Reach Me, which also starred Stallone.In fact, he and Stallone go way back to 1976's Cannonball, a movie that Herzfeld acted in. He also appears in Cobra as one of the criminals Stallone sets on fire near the end of the movie and directed Inferno: The Making of The Expendables.Here's all you need to know about the film, thanks to IMDB: The opening production looks last for 90 seconds and the end credits are almost nine minutes, so 11% of the film is just production info.",
            "review_date": "2019-09-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What the hell is this series?",
            "content": "Why does Escape Plan exist as a trilogy? I mean done correctly it could have been fine to do a sequel or two but this was thrown together and tossed out straight to DVD like a fan made film only with less passion. The second film was atrocious and this one is not as bad but still as completely forgettable and horribly executed. There is literally no sensical reason for this to exist but even less reason that Sly Stallone and Dave Bautista would do these films? Both have much bigger careers than this and in this film they seem so bored and completely useless that it begs me to wonder why this exists. No one is a bigger Sylvester Stallone fan than I am, no one. (I bought this film blindly on Blu-Ray because it's necessary to own it for me) . The first Escape Plan is such an incredible movie and then this junk drags it's name through the mud. Where this one wins over the previous one is that they actually tie it a little bit into the first, there is some very decent martial arts scenes from some very talented martial artists and the villain was actually not bad played by Devon Sawa. Outside of that there is very little worth seeing here. Stallone's role is fairly limited as is Bautista's except for a few main fights and Curtis Jackson has about 40 seconds of screen time. This is a huge miss and I hope we can finally bury these sequels where they belong and focus on how good the first film was. 5/10",
            "review_date": "2019-07-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better action no action for escape plan",
            "content": "Better action no action for escape plan, good in action, there's no escape plan, wait for the forth sequel for the best.",
            "review_date": "2019-06-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "NOTHING SPECIAL,ABIT DULL & BORING & NO WHERE NEAR AS GOOD AS PART 2!!!",
            "content": "Escape plan 3 doesn't follow on from the cool & exciting ending of the excellent \"Escape Plan 2:Hades\" & i don't know why?It seems everything that happened in part 2 is forgotten, including his new young team?Nothing makes any sense!!!But I've recently found out that \"mr. BIG ego\" yes i mean \"Stallone\" hates part 2 & thinks it's the worse film he's ever been involved in?I think it's because he was only a small bit part/extended cameo in that sequel & the cool new younger team hurt his ego, that's what i think, so he came back with this 3rd entry & is the main lead focus again so he likes it, but just because \"Stallone\" is back as the lead doesn't mean it's a better film as it's not!!!Infact this 3rd entry feels even cheaper than part 2 & has none of the cool looking cinematography or the excellent music that part 2 had, the fights are just ok but the overall film is actually very dull & boring!!!",
            "review_date": "2019-09-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Make your Plan to see Escape Plan! 🌟🌟🌟🌟🌟",
            "content": "Writer, Director 🎥 John Herzfelds collaboration with Stallone shows how 2 Ol Dawgs can still bring new tricks to the 21st century Action Genre. By bringing the very best of practical effects and realistic fight scenes into sync with anything out there today.It's apparent these 2 guy's know what the audience wants and needs as EP3 delivers!\nSupported by Batista and crew, it's a must watch for any fan of action!I'd love to see further collaboration between the actor and director for future projects.Great job to all and thanks for the ride. 🌟🌟🌟🌟🌟🎥👍🏼👍🏼",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Weak all around with some decent action",
            "content": "If this film was released in the 80s it would have been ok. The Extractors lacks all type of intelligence. The plot and movement of this movie is made to play against the viewer instead of telling a story that follows any true character process and development.Watch this if you like action but don't care at all about a story. Probably best for a long flight when you need some kind of entertainment and really care nothing about quality.",
            "review_date": "2019-10-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "No storytelling and no screen play. Avoid",
            "content": "I chose to watch the movie since I am a Stallone fan. I tried hard to sit through the movie (not watch it) sit through, I could not I stopped after 45 minutes. There is no screen play and zero story value. It really stinks.",
            "review_date": "2019-06-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Poor production",
            "content": "Poor storyline and acting... Disappointed my self for watching this.",
            "review_date": "2019-06-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Maybe Sly's worst movie",
            "content": "I had no expectations, yet I was pretty disappointed. Most of the acting is really bad, but the plot is actually so stupid, I had to stop the film halfway through.",
            "review_date": "2019-09-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than part 2, but still horrible.",
            "content": "The only good thing about part 3 is that it had some decent action and some entertaining death scenes, which completely ripped off Expendables by the way. Other than that, the story is non existent, the ending is meh, and the actors look like they're aware about the crap they're in. Please end the series, while the fans might still remember that part 1 was actually entertaining",
            "review_date": "2019-10-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "10 BECAUSE ACTION ROCKS AND IT DESERVES IT!!!!!",
            "content": "I AM AN ACTION JUNKIE!!!! The scenes were choreographed by 87eleven - by far the most superior group of stuntmen working today - hello John Wick Franchise - this movie gets a 10 based on action balls alone!!! Sly, Bautista, Max Zhang (Chinese martial arts extraordinaire) give us memorable fights of precision and fury. In saw this prescreened film - I suspect some snarky commenters - have not seen the film as it hasn't been released - maybe well placed competitors - GO SEE THIS MOVIE and prepare to enjoy the action ride!!!",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "ACTION - SICK FIGHTS - SHOCKING DEATHS",
            "content": "A must see for those who enjoy action, MMA, and humor.",
            "review_date": "2019-07-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I feel that I lost some IQ point after this movie",
            "content": "The background story doesn't clear a little sloppy.\nThen the break to the prison one of the guys just hit in, knocked the door .",
            "review_date": "2019-10-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "GREAT MMA FIGHTS. STRONG CASTING. VERY ENTERTAINING.",
            "content": "They changed genres from ESP1and 2 - This is old school violence and a story of revenge.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "YES SLY!!!!!!",
            "content": "If you thought Sly was done with hardcore action and transitioning to the \"peace loving grandpa\" retired stage of his career - boy are you wrong! I attended an early screening and the audience cheered, moaned, and gasped. Sly gives a true beat down and displays his diversity chops. Bautista rocks us with wit and badassdom. MMA fans will love. Looking forward to release to watch and rewind!",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better Then The 2nd one",
            "content": "I really enjoyed this movie. Big improvement compared to the 2nd one that sucked. The plot was actually good with some surprises. The acting and cast were all decent. Hope this movie comes out on Netflix",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "the worst of them all...",
            "content": "I actually thought the 2nd one wasn't that bad, they were still ESCAPING out of prisons.... so I decided to watch this one too, since I like Devon Sawa and hadn't seen him in anything in a while. Wow what a waste!\nThere is no prison, there is no plan. They break INTO a building (\"prison\" I guess) to rescue a hostage (Chinese tycoon's daughter) and Ray Breslin is only there because the bad guy just so happens to be the son of his former partner (who sold him out in the first movie) and he wants some kind of revenge.Only good thing about this movie is the martial arts by Harry Shum Jr and that other Asian guy... lol",
            "review_date": "2019-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Holy S*#t! This is a edge of your seat thrill ride!",
            "content": "No it's not a cinematic masterpiece like \"Gone With The Wind\", and it's not supposed to be. \"Escape Plan: The Extractors\" is why you go to see an action adventure film, to be entertained and escape into world that has you hanging on for a ride. WOW, this movie does all of that and more.\nJohn Herzfeld has made the best installment of this movie franchise. This movie is raw, intense, and gritty. The action and fight scenes are AWESOME, and the way that it is shot makes you feel like you are in the middle of it.\nStallone hasn't been an action hero for 40 years by accident. He knows how it's done and delivers.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't trust the others.",
            "content": "My first review.\n33 year old danish male.The movie was so bad, that I had to turn it off arter 45 minutes. I was bored out of my mind.",
            "review_date": "2019-09-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I think this movie was rushed.",
            "content": "It's was an ok movie. Needed more time to get things in order and better planning. If there is a next one. I hope they put more time into it like the first one. Good watch.",
            "review_date": "2019-07-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's really a better installment than the second one.",
            "content": "When I had watched the First Escape Plan i was totally amazed by the concept. And as I am an Sylvester Stallone Fan i enjoyed that movie very much.But the 2nd one kinda disappointed me. It was boring since from its initialization. And being a too much tech savvy doesn't suited that film.But the 3rd one i mean this one. It kinda bounced back to its originality. And I liked that. But still it didn't created that much Thriller in which the first one had done a tremendous work.It was looking like that the actors and directors were feeling lazy and they wanted to end the movie asap. I liked the fight scenes but I had expected some mind bending jail escaping like the first one. I had also expected Sly to perform some good action. But it's ok considering his age. It's a good thing that the film was not too much lengthy.Overall my review is 6/10 stars.",
            "review_date": "2019-07-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I stopped caring after 30 sceonds",
            "content": "Maybe even less. And stopped watchin after 30mnIt's this kind of movie with zero everything : no style, no substance, no acting, no tension, no fun... There's no way it can keep me focused on the screen.By the way, I think i didn't even finish the second movie. Only the first one was kinda watchable.",
            "review_date": "2020-12-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Avoid it at all costs",
            "content": "Not good. not good. like the 2nd movie this was another failed and boring action - prison flick starring stallone.\nthey said it was better than part 2. they were wrong.\nif u exclude first like 30 minutes which were actually decent then the movie decent to chaos.\nthe only good thing was last 10 minutes with \"rocky\" punching the evil guy and the two Chinese karate dudes.\nthe first movie was great. the 2 sequels were a failure. both of them.",
            "review_date": "2019-08-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Most boring film ever",
            "content": "Idk why the genre is action when there is no action at all in this film. I can say this for everyone that this was the worst film of this year. Only the first one was good",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "MINI EXPENDABLES",
            "content": "I can't see why this movie's being rated below 5*. It is filled with action packed, great fight scene, and I even it pretty much.",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dumb movie.... dont even consider to watch this...",
            "content": "Ohhh wasted a hour and half of my life.... just bad... sooo bad.... they just filmed this because they have nothing to do i guess... dumbest action scenes... really bad...",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad Ass movie. Truly enjoyable.",
            "content": "Truly enjoyable. Sly is raw and intense. Bautista could have a longer fight scene with more attitude. Good ol fashion ass kicking movie by stallone. Herzfeld is a great director, need more collarobations with stallone in future",
            "review_date": "2019-06-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "SOMETHING'S FISHY",
            "content": "There are many suspicious 1 star user reviews. They ALL begin as follows; \"I chose to watch the movie... I thought there can't be worse movie... I don't understand why a movie... I watched the first 20 minutes... I have seen bad movies... I don't think I've ever written a review... I just don't know why this movie was made... I fell asleep...\" etc...There's a strangely, similar pulse and rhythm in every opening sentence...Many reviews were posted before the move came out in any format or country.",
            "review_date": "2019-07-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "not the franchise you hope for",
            "content": "I should have know from trailer and title, that there is no ESCAPE PLAN in this movie, just you're generic bad ass movie, with bad plot and lazy writing ...a lots of useless scene, useless death ... and drag it to fill the movie, absolutely a joke movie, much worst than a lot of similar plot movie,\nfighting is like yea yea yea hit the bad guy, the good guy will win the fight ... oh the good guy will get a lot of hit first .ofc ...just pure B movie,\nwasting great actor",
            "review_date": "2019-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than #2",
            "content": "If you like Stallone, you'll like this. An actual decent rescue mission plot. Better than EP2. I enjoyed this for what it was - revenge action. Dave B in a couple of delicious scenes of intense violence. A couple really solid hand to hand fights that were really well filmed and edited. This director knows how to film action.",
            "review_date": "2019-10-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Confusing and boring",
            "content": "I fell asleep 3x during this film. Boring and confusing. Stallone swears in it and most of it is filmed in the dark. In my uhd hdr copy the asian actors appeared green...just awful. Plotless and dumb.",
            "review_date": "2020-02-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time...",
            "content": "Holy crap, Think this is the worst movie i have ever seen, Escape plan 2 was bad, but this just in another league. But hey Dave Bautista is in, that's Nice...",
            "review_date": "2019-07-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Such a huge disappointment",
            "content": "Thumbs down Sly... The movie was a major bummer... I tried my max to find something that would be distinguished but couldn't... Sorry bud",
            "review_date": "2019-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This is not bad",
            "content": "Sure it's not as good as the first one. But it's not a 4,4 as well. Decent enough story and action.Stallone has some good action scenes.See it when it's on Netflix when you are into a beer and some action.",
            "review_date": "2019-09-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terrible film dont waste your time",
            "content": "I enjoyed Escape Plan but this movie is awful, weak plot, some terrible acting and I had to turn on subtitles towards the end to understand what the two heroes were trying to shout.",
            "review_date": "2021-05-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of life",
            "content": "Stallone is fairly mediocre actor and although this franchise is bellow everyone expectation he still manages to pull even worse acting.Pull the plug man.",
            "review_date": "2019-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad movie",
            "content": "I do not like the film, because it shows the unprofessional acting, the bad effects in the movie, where the production tried to make a good sequel to \"Escape plan\" - the first part, but failed.",
            "review_date": "2020-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This Movie Has Lots of Action",
            "content": "I watched this movie 8/15/2020 and I really enjoyed this movie. It has lots of action. I've always admired the actor Russell Wong. Harry Shum, Jr. from the series Shadowhunters is in this movie as well. I don't know why all the hate or the low ratings. I suggest watching the movie and seeing it for yourself.",
            "review_date": "2020-08-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't say Can't. Those are last words.",
            "content": "Zhang Innovators is coming to Mansfield, Ohio. Several people in the entourage are kidnapped and held for ransom. The kidnapper is the son of Ray Breslin's (Sylvester Stallone) dead partner. He wants revenge on Ray for killing his father. The victims are held at a black ops site in Estonia. Ray and company to the rescue.There were not really any great scenes or memorable lines. Dave Bautista had some great bullets and good kill shots. The prison consisted of old stone wall, iron bars, wooden chairs, and battery powered lamps. I am not sure why they needed millions of dollars of software or electronic anything. What exactly did Zhang provide?Guide: F-word. No sex or nudity.",
            "review_date": "2019-06-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Even more Escaping (not so much planning)",
            "content": "This does not live up to the first one (haven't watched the second one yet, though as far as I've heard, haven't missed out on much), but it is entertaining enough. Good action/stunt scenes, with some chinese influence (since they started financing movies, it makes sense).Stallone is back and Bautista was in the second one too, but there are a lot of new faces too. And while we do know where this is going, this is not why you are going to watch it. The story is playing second fiddle to your thirst for suspense and action of course ... that thirst can be stilled to a degree",
            "review_date": "2019-09-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better Than Expected",
            "content": "You can tell this was shot in 4 weeks, between the shaky camera scenes and the thin plot. But the fight sequences were excellent and I enjoyed the movie overall",
            "review_date": "2019-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This one might need an escape plan.",
            "content": "With this film, Sly Stallone goes the way of Steven Seagal in pictures like \"A Good Man\" and \"The Perfect Weapon\". Not quite as bad, but still resembling a cash grab for fans of action flicks who like to see the principals on screen. I actually didn't know there was a series of these pictures, and though this is a lower rated sequel than the original \"Escape Plan\", I'm not really inclined to catch the prior ones based on this installment. Probably the coolest thing about the story is that it takes place in a location called 'Devil's Station', with security expert Ray Breslin (Stallone) leading a team of adversarial Japanese martial artists (Jin Zhang, Harry Shum Jr.) in an attempt to free a number of hostages taken prisoner by the son of a former rogue employee.. The resolution seems almost anticlimactic in the way Breslin dispatches the main villain (Devon Sawa), though it's not enough and quite too late to save his girlfriend Abigail (Jaime King). Or the picture.",
            "review_date": "2019-12-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "least better then second but still not best as first film",
            "content": "Never understand why they rushed the franchise too quickly, i mean 2nd Escape Plan 2 Hades just came out last year it flopped very hard got a lot of crap from movie reviews and Critics that hit the crap of it, look Escape Plan 3 was in production while Escape Plan 2 was releasing. i think they should of rushed the franchise too fast i mean to me this movie is like they rushed it too much with film not running hours i mean if they toke Escape Plan 3 more time they would have added more ideas and more action and much more fun and exacting then this would been a lot better, this should come out like 2020 notslaright away slaright forward, it's not just film rushed they rushed entire film story, the writers and director just keep rushing and rushing if they toke it slowly they would have more better ideas for the film. the film what is their to say about ? this is more of rescue mission i rather call this Rescue plan. the prison isn't much at all nothing, this film could have a lot and more and more ideas to add in, give baustia more to do and Stallone does have a lot to do but he needs little bit more given to do, escape plan 2 and 3 are in china sales marketing not in US marketing sadly first Escape Plan made 25 million in the US, but but a further $75 million in China, it makes sense that it got Chinese backing for sequels and the producers took the money and ran it was a vehicle for Asian market with Asian stars i wish that was never been in involved at allwhat i like about this movie baustia is been giving more to do he is in screen a lot more then second film, Stallone always their he is always in action but he needs to be given more to do. the action is good a bit of shaky camera witch annoy's me but it doesn't make me to hate film. the prison looked a bit more dark and rioting hell looked like they could off put more ideas for prison looked like make it more like hell, film doesn't show prisoners that much i mean the place looked like hell a lot so i was thinking from trailer of my thoughts and guess prisoners would have been psycho's crazy people extremely like brawl cell 99 type of look of film, that's what i was expecting but that doesn't happen in film, the plot avoids escape plan 2 hades but this is a lot connected with first escape plan (2013) witch that should been like second is\nstory starts off a kidnapped daughter Daya Zhang (Malese Jow) you have new Asian guy witch he wasn't that bad actor good martial arts but not bad as actor not like guy from second film, Shen Lo (Max Zhang) the grandmaster, IP Man 3, Pacific Rim: Uprising well his girlfriend got kidnapped he goes up to Ray Breslin place but stupidest thing ever he beats up all people from place i am like ? so his a bad guy he beat up a innocent people up could killed them then Ray Breslin (Sylvester Stallone) lead him up and was hired by Hong Kong tech mogul from a formidable, Hush (50 cent) wasn't much in movie i surprised really i am only in 2 scenes that's it sadly, after that for a rescue plan to get Shen girlfriend Daya then somehow Abigail Ross (Jaime King) a love interest to breslin gets kidnapped i am like great ? so this is a rescue plan i swear if i was writer to this i rather call this title not escape plan because this time Ray Breslin doesn't go prison or he doesn't get kidnapped or turns himself in, they go to this location of prison what plan ? what escape plan???? what was plan no one escaped not even 2 girls who were kidnapped that's it they didn't escape at all i mean if you are going to make escape plan movie how about this plan in my plan Ray girlfriend Abigail got kidnapped then villain forces him to turn himself in or else his he will kill his girlfriend ? then he turns himself in how about that story ? then he makes a plan then gets his girlfriend out then they can kick ass ? seethat makes more sense to it then directors or writers of film rushed it too much. the villain is good better villain then another 2 bad guys from 1 two escape plan movies those villains were lame as hell but this Lester Clark Jr. (Devon sawa) known for Final Destination witch i don't want to explain who he is unless you watch the film and find out because that's spoilers, now the entire movie is just not much i mean their is action a lot of it but not a lot as escape plan 2 or 1 the action Stallone kicks ass in film but not as much of crazy action like in first film he does, i liked another villain (Daniel Bernhardt ) known for john wick, matrix, bloodsport 2 and 3, kill em all, i think Stallone and Bernhardt should have fight scene together or Dave Bautista but you have Max Zhang fighting with as showdown not much at all sadly could have Daniel Bernhardt more in it have showdown with Stallone or Bautista. the action was fun and full on violent and dark, their are things you don't see coming in film while your watching it. john Herzfeld director who made 15 minutes, and another Stallone film reach me and he helped project in expendables that's why Stallone hired him on the third, there's a noted some improvement in film but not all of it because their is needed more improvement a lot of it, it needs better action, need to give Stallone much more of action to do because to me it's not enough, give Bautista as well more screening time and more to do in action, make prison look like more of hell and brutal and very scary like van damme movie in hell. Stallone gets more to do here in film, the camera and cinematography is not best, this 3rd film is good, a lot of fun action, Stallone did great but not best in film, baustia got more screening time but he needs much more often, their should been much more of ideas and crazy things for a prison movie should made it like first escape plan style that has everything but sadly who has this franchise has gone down to china sales market to direct to DVD sadly and thanks to Steven c miller ruined sequel then John Herzfeld toke over it look i see what idea he has but it wasn't enough he rushed the movie to fast the running time is 1h 37min. Stallone needs to stop doing direct to DVD films he cares more about his career not like Nicholas cage or john Travolta or Bruce Willis at this point and doesn't want to do this for the pay cheque. i want to see Stallone landing in a proper career with million dollar movies i didn't want to see the ended up like this as in china marketing all that nothing wrong with that i expected this to be a fully American dollar film marketing, it's how escape plan 2 flopped and it didn't get a success like first film. i liked title escape plan devils station but it changed into extractors because they are in arescue mission not a escape plan, because Stallone never got taken to prison at all it's more of rescue mission that's all it is if give it a look the film wasn't bad i watched i enjoy it nothing wrong watching this film this was fun, and a lot of action, story never saw coming at all, Stallone kicking ass in great age. 7.10 not best and much better, but it's better because it's fast forward movie, new actors were better, better villains, it's just good time waster film for fun give it a look it's pretty good if you hated second film or your curious if this is was good, it's good and better then second film i am not saying it's bad movie i am saying it's good but it didn't need to rush it because director John Herzfeld could have better ideas, but what they did to movie wasn't that bad at all give it a look i am huge die hard fan of Stallone and Bautista together.",
            "review_date": "2019-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "still sucks",
            "content": "Maybe better than the second part, but it still sucks.\nthey should've just kept it just 1 part",
            "review_date": "2019-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Doesn't feel.like name",
            "content": "It is an ok movie nothing like the first one but if you have nothing to do then it is worth watching. The thing is that there is no plan and no escape",
            "review_date": "2020-01-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What you get when you pair an ICON with TRUE ARTISTIC DIRECTOR!",
            "content": "This is the best in the series! John Herzfeld brilliantly directs and maneuvers through a great action script. It is so beautifully shot you could hang most of the shots on your wall- the mark of a true artistic director. The coloring and lighting is something to take note of- absolutely powerfully gorgeous. Sly puts in another compelling and powerful performance. He Is hitting it out of the park again! Fantastic collaboration. Let's hope for more from this team!! Watch it! You will thoroughly enjoy it!!",
            "review_date": "2019-07-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Too Dark literally!",
            "content": "Poor lighting...I could except everything else but it's horrible.",
            "review_date": "2021-07-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Blink , and you miss it",
            "content": "It being nothing .Watch the movie with your eyes closed, you're still not missing anything .\nDon't watch or listen to the movie, and sort your match collection instead, you will not have wasted 90 minutes of your live .",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Best of the Franchise",
            "content": "I'm a huge fan of the franchise and usually sequels don't do justice but this one is by far my favorite. I've been of a fan of John Herzfeld since the Death Wish and Cannonball\nDays. Loved 2 Days in the Valley and truly love his take on this. Even if you're not a fan of the other two it's totally worth watching just to see Herzfeld's superb execution of this action packed tale. Fans of the genre will not be disappointed.",
            "review_date": "2019-07-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why So Dark",
            "content": "So far it's what I expected, ok for an afternoon viewing as I like the series. One question, if they had lots of financial backing, why couldn't they afford lights......even all the inside scenes are extremely dark, was there not at least a light switch they could turn on in the room, if they couldn't afford movie lights? I don't want to turn it off, but I can only hear most scenes....maybe I shouldn't be watching this movie during the day?",
            "review_date": "2020-01-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not as dumb as reviews",
            "content": "If you see all the reviews and ratings it would seem like a really bad movie. But isn't the case, acting is good, screenplay is good well story is average but overall worth watching.",
            "review_date": "2019-07-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "umbrella brella brella",
            "content": "Daya Zhang (Malese Jow), the daughter of Chinese tech mogul Wu Zhang, is in Ohio looking for manufacturing space. She is kidnapped by a professional team headed by Lester Clark Jr. His father was the corrupt ex-partner of Ray Breslin (Sylvester Stallone) and he's looking for revenge against Ray. Bao Yung fails as Daya's security. Shen Lo is Daya's love and seeking Breslin's help. Breslin's crew includes Trent DeRosa (Dave Bautista), Hush (Curtis Jackson), and Abigail Ross (Jaime King).There are a couple of good fights. The umbrella fight is terrific. It's relying on acting from guys who are limited. The writing is clunky. The flow is disjointed. The directing is second tier from veteran John Herzfeld. Sometimes, he seems to be trying for indie hand-held action. Other than a few fights, this movie never had a chance. Unless he can get more of that Chinese money, Sly should let this franchise die.",
            "review_date": "2019-07-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "DON'T WASTE YOUR MONEY!",
            "content": "The plot and everything in it was so stupid! Most of the time they're speaking in Chinese, but don't give you enough time to read the damn words, i.e., there for; you don't know what they're saying and what's going on!!\nSylvester Stallone's skin looks like it was falling off of his face...He looked greenish and gross!\nRETIRE STALLONE!!! RETIRE!!!",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Grossly Underrated",
            "content": "Not a bad action film at all. No comic book super heroes, more of a team effort instead of the 1 man army and definitely watchable. Reasonable martial arts fight scenes with no trampolines and supernatural flying, just choppy action choreography. All in all, the film is entertaining, just not memorable.",
            "review_date": "2021-02-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So boring!",
            "content": "2 & 3 are the worst. The first one is still the best. Got bored after 30 minutes. Just another cliché. Don't even bother to watch it.Why they didn't keep Amy Ryan?",
            "review_date": "2022-01-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Keep up the bad work!",
            "content": "With all due respect to Stallone legacy, this is the worst movie I've seen starred by that legend, but hey! I just love this series! All fight scenes and all cliche drama atmosphere makes those movies perfect for spending some few time after a long day of work!\nHope next shoot may be done in Brazil, we've lot of prisions here!",
            "review_date": "2019-07-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than the Second One",
            "content": "Escape Plan: The Extractors was better than the second movie and hopefully this will be the last, Stallone is back but the story is different, no high tech prison, no breaking out, this one was personal. Jaime King who portrays Stallone's wife is captured along with the daughter of a Chinese tech mogul. Extractors are sent in from Breslin's team in order to free the prisoners from an old Latvian prison. Some of the cast members returned that included 50 cent and Dave Bautista. Overall it was a good movie to watch once.",
            "review_date": "2021-01-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't understand the ick reviews?",
            "content": "What do people expect from an Indie movie?This was really well done and is a good movie for what it is, small enough budget to where \"Hollywood\" would have no interest, but good enough to watch more than once.I'd never heard of it until I found it on Amazon Prime, so I decided to give it a try.LOVE the fight scenes and the martial arts is top notch.Sort of an \"Eastern European Expendibles\" vibe, it's definitely worth a watch.NICE twist on one of the lead characters, which you don't normally see in film.I highly recommend this film for some awesome action.Don't listen to the negative reviews.",
            "review_date": "2022-05-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Fun action flick",
            "content": "The first one was fun, the second one funny if you know specifically what makes a bad movie bad, otherwise it would've been unwatchable since you had nothing to look for, the third one was fun again.The main difference with the first movie is that the third is really a run-of-the-mill break-m-out flick with only a minor twist and not a disoriented-find-your-orientation break-out flick. The plot? You did to my father, so I do to you. With two abductees that makes for a minimally layered flick with hope for two to make it, two turning into three or a couple more.Do you have expectations? Drop 'm. Don't have any? Sit back, kick back, and enjoy your popcorn. The movie is edible too.",
            "review_date": "2019-09-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pure junk",
            "content": "I would consider myself as a pretty fine Stallone fan. I love almost every movie of him but let's get one thing clear: escape plan 3 is pure junk. Boring, uninspired, with lots of low budget flair, and not even comprehensive fight scenes.Escape plan 1 is a modern classic. Part 2 at least delivers some fun. Part 3 you better skip.",
            "review_date": "2021-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The Future Of Movie Making",
            "content": "In the third movie of the series, the daughter of a Chinese tech manufacturer is kidnapped, Sylvester Stallone must tear himself away from complaining about his girlfriend's snoring to rescue her from an Eastern European prison with the aid of his trusty team of David Bautista and 50 Cent.The film is most notable for the way almost every scene is shot at low light levels through color filters (or perhaps that was done in editing); cyan is favored for outdoors, yellow for the corridor of the prison. Also worthy of note is that the movie begins with animated logos for the six production companies that take up a minute at the beginning. I am also reliably informed (by the IMDb \"crazy credits\" section for this movie) that the end credits last 8 minutes and 45 seconds. For a 97-minute movie, it's a harbinger of a future in which a feature-length movie will be sequels, with opening credits, closing credits, and the lead performers reciting a few catchphrases from their earlier movies, as Stallone does here.",
            "review_date": "2023-03-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not too bad",
            "content": "It could have been better, but it was good enough entertainment for a summer night's watching. It was a good quality production, which made it a worthwhile watch. The acting was good across the board, the fight scenes of course were excellent. Sucks to be Abigail, though.",
            "review_date": "2020-06-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Entertaining but lacking",
            "content": "It was entertaining and dramatic enough, but feels rushed and thrown together rather quickly. I was confused by the casting of Abigail... as I recall she was played much better in an earlier installment by someone else. I am most impressed by Devon Sawa as a villain and honestly why is he not in popular film anymore? He's better than most popular actors these days. Overall I was more entertained by this than any movie Netflix makes.",
            "review_date": "2021-05-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than expected..",
            "content": "For a cheesy action movie it was better than I anticipated. It certainly was not as good as the first of the franchise. It's action filled and the acting was reasonable. Fight scenes were well choreographed. It isnt a movie that everyone will enjoy.",
            "review_date": "2020-03-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "typical boring action",
            "content": "Boring, predictable, nothing interesting. Good actor Sylvester, has confidence, courage, experience, good manners.\nBit emotional. Few realistic details such as weak to no emotional response to death, just like in our real life.\nBit realistic doing of favors and emotions between characters, and feelings of hope, trust, confidence...but still too weak, too quick.\nUnclear story, especially beginning. Few unrealistic story twists in form of bit unreal action, and finished too quick.\nSince I personally do not like actions without mystery, sci-fi, etc, I gave this movie bit higher rating, to compensate for my disliking of this genre.\nOverally, nothing interesting to see here, not worth watching. Waste of time. One more star is for good main actor Sylvester.\nWorse than \"hades\" sequel, which was at least bit more scientific, interesting.",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "waste of time",
            "content": "Don't bother watching..u'll regret wasting your time",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better Than the Rating, But Still Deserving of its Criticism",
            "content": "This movie didn't have a lot going for it. It was the third film in a failing franchise, it was released direct-to-video, which is always a blow to a movie's popularity and appeal, and it was competing with many other frankly better action films of the year, such as \"Cold Pursuit\", \"Fast & Furious Presents: Hobbs and Shaw\", \"Shaft\", \"Angel Has Fallen\", and another Stallone vehicle, \"Rambo: Last Blood\". I recently watched it, and it wasn't bad, but it could've been better, and I really hope this is the last film in the franchise.The plot follows Ray Breslin (Sylvester Stallone) and his team as they attempt to break into an infamous prison, where a team of mercenaries holds the daughter of a wealthy businessman captive. They're hired by the girl's father to do the job, but things become personal when Abigail Ross, Breslin's girlfriend, is also kidnapped by the villains.The first film was great. It was an entertaining, thrilling, excellent action movie that was notable for pairing Sylvester Stallone and Arnold Schwarzenegger, two action legends, and it did that quite well. The second film was very different. It was released director to video, and Arnold was replaced by Dave Bautista (who I personally really like), and it had nothing to do with the first film. It was critically panned, and audiences hated it too. It was marketed as a vehicle for Stallone and Bautista, though it ended up focusing on heavily on Huang Xiaoming, an actor relatively unknown to American audiences, and Bautista appeared in 2-3 scenes total, and did next to nothing. Even Stallone's role was downplayed. All this, along with a noticeably lower budget, greatly brought the film down, and many were hoping the third installment would be an improvement. I thought it was, though only marginally.Miles Chapman writes the story along with John Herzfeld, who also directed the film. Miles wrote all three films, though neither this third film or the second were as good as the first in terms of story and pacing, as well as characters and their development. He's by no means a bad writer, he just had the misfortune of crafting such a good story the first time around that in trying to top himself, he didn't deliver as much. The pacing and flow of the plot is fine, and it was definitely an easier story to follow than the previous film's story.John Herzefeld is directing, as I said, and he hasn't done many other movies, though he has some experience in directing an action film, having done \"15 Minutes\" with Robert DeNiro in 2001. He isn't a bad director, and he crafts some fine action sequences, and paces and shoots the film quite well. I wouldn't mind seeing him do some more bigger-budgeted, more high-brow movies.The actors' performances were all fine, with Sylvester Stallone continuing to be interesting onscreen. He really is a good, underrated actor, and people sometimes forget that he can act as well as he can shoot and fight. This movie gives him some moments where he can actually act, and he does quite well. It would be nice to see him in some more action movies that allow him to flex his muscles as a serious actor. Dave Bautista also works, and he is a terrific action star who I think never really gets his due. He doesn't get a lot of moments to really act, though he does fine for what he had to work with. He does look good in action sequences though, as he proved in \"Spectre\", \"Heist\", \"Bushwhick\", \"Final Score\", and \"Stuber\". He's a great leading man and I hope to see him in more solo action films, though it was definitely nice to see him do WAY more in this film than he did in the last one. Max Zhang and Devon Sawa were also nice surprises, and they both spelled their roles more than I thought. Sawa in particular really surprised me, creating a more imposing and human villain than I was expecting, and he was definitely less overacted and underdeveloped than the last film's villain.The action in this film is the high point, as it's very entertaining and in large quantities. There were a lot of great sequences, especially some excellently choreographed martial arts fights that really showcase the actors' skills, particularly Max Zhang, who it seems went mostly unsung in many reviews. There were some other pretty brutal fight scenes, and it seems like each main actor got one good fight scene. Bautista got a good fight scene and a cool scene in which he mows down several men in a hallway with a large gun (reminiscent of Terry Crews in \"The Expendables\"), and there was a particularly visceral and brutal final fight between Stallone and Sawa. This fight was an excellent scene and probably one of the most vicious beatings I've seen put to screen.In fact, most of the action in this film is bloody and sadistic, much more so than the first two films. Two scenes in particular come to mind: Stallone stabbing a man in the stomach with a knife many times, and him jabbing a metal rod through a man's neck. Both scenes were intense and gory, and a little disturbing actually. Later, Stallone holds a man and slits his throat with a knife while telling him to \"shhh\" before kicking him over a balcony. From what I hear, this gleeful, unflinching violence is even more magnified in Stallone's other action vehicle this year, \"Rambo: Last Blood\". So if graphic and gory violence that's only intended to be shocking, mildly disturbing, and maybe stomach-churning isn't your thing, look elsewhere.This movie's plot was more simple than the last one, and it decided to juggle far fewer characters than the last film, which was way less confusing, making it more enjoyable. It was also connected to the first film, unlike \"Escape Plan 2: Hades\", which already made it more interesting. Once into the plot it became pretty standard stuff, but it worked for me.MAJOR SPOILERS AHEAD:My main, and really only, problem with this film, was the graphic, brutal, pointless killings of several main characters in the film. One of Stallone's crew is gunned down after being taken hostage, and the most egregious death, the senseless killing of Abigail Ross (Jaime King), Breslin's girlfriend. She had been captured earlier in the film by the villain as a way of getting back at Breslin after he arranged the killing of the main villain's father in the first film. The kidnapping of Abigail was fine, as it added a personal element to the story that made it more engaging, since we like Breslin and his friends, but then she is suddenly murdered by her captors midway through the film for seemingly no reason other than shock value. I get that it was probably a realistic plot choice, as Sawa's character really wants to make Breslin feel what he felt when his father was killed, but it took away the personal element and stakes of the film. I didn't much care about the billionaire's daughter or her friend who was also kidnapped, and having Breslin's love also be taken suddenly made me feel more invested. To add to this, her death is needlessly brutal, with her throat being clearly slit onscreen and blood visibly flowing from the wound. The only pluses for this plot point were Stallone being able to throw himself into the role by showcasing his anger (an emotion he does well), and the brutal beating he gives Sawa in the end.So that was an issue for me, as up until that point in the film, it was just a regular, mindless action movie, which I wanted going in. Suddenly after the aforementioned murder scenes, it became way darker and more personal than I was expecting, and it almost reached the level of dark glorification of a vigilante movie. Especially in the end, the final fight and death of the villain was very dark and depraved, as it was entertaining, and the killing of the villain was almost torturous, and way darker a moment than I was expecting from this film.END OF SPOILERSAnother issue, really more of a marketing problem, is 50 Cent's lack of involvement. Much like the last film heavily marketed Bautista and then did nothing with him, this film does the same with 50 Cent, only even worse. 50 Cent only appears in 2-3 scenes total, and has about 5 minutes of screen time. I'd wanted to see him do way more, since he's been a pretty solid actor over the course of the series, and his character is one of the most interesting since he and Stallone are really the only two actors to appear in all three films. So don't go in expecting 50 Cent to play a large part.All in all, \"Escape Plan: The Extractors\" is an ok third outing, that doesn't deserve the 4.4/10 rating. I think anywhere from 5.6-6/10 would be more accurate. It was a rote and routine action movie, though the action sequences were entertaining and flashy, and for an action movie, you could do a lot worse. You could however, do a lot better.",
            "review_date": "2019-12-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not bad but boring",
            "content": "The movie was not bad. But it was quite boring. I struggled to watch it all even though it is less than 90minutes long.\nIt was not bad but I felt that I have seen this kind of movie again and again.\nThe plot is simple but decent. The only fighting scenes worth watching were with the 2 Chinese actors.\nIt could have been much better but the acting was lifeless.\nThe 4 star rating is really low for the movie. It is a decent movie to watch.\nBut it should have been straight to DVD.",
            "review_date": "2019-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Read this Review the other Reviews are Bots",
            "content": "I am getting tired of these Bot reviews, These reviewers are not even expert Critiques yet alone have never worked in the industry so they do not have any idea what it takes to build a set, act or even direct, Shame on them! Now on to the movie review!First the score of music is fantastic and on point unlike the last 2 they were ok but finally Stallone found the right combination, Some critics say the director was ok but some of you do not know this but Stallon does it all and puts most of his money into these movies. The characters get better and better and to tell you the truth Sylvester Stallone is a Network Engineer to say the least he always is able to get really good actors to act into his movies. The camera director was on point! Great drone coverage and very good movement, I was able to see the details even when it was supposed to be a blurr, I hate blurr movies that all you see his a bunch of struggling and that's when you lose me. 50 Cent had a small role this time where he was filmed separate from the rest of the crew, Chances are 50 cent has been busy with other projects and had less time for this film but that's ok because the real star Sidekick of this movie was JIN ZHANG 45 years old and has the moves of a 20 year old reminds me of Jackie Chan and Jet Li when they were in their prime. Dave Bautista is back like always and finds time to film in between Marvel and Guardian of the Galaxies which comes out in 2020. We lost Jaime KIng that played Abigail Ross in this movie which tells me that this is the last of the franchise, it is unfortunate because I love this franchise and it can keep going like Fast and the furious unfortunately it does not have a huge following that Fast and the Furious has and thus the end of a good idea. Devon Sawa seemed to be a good bad guy in this movie but he didn't really give me the serious bad guy vibe that is seeking revenge at every corner. I would of gone with a big finally where Stallone could of lost his house, Blown up, His plane, his building and everything that made the company what it is today because of his father helping him build it. Then finally the end would be the same and of course Sylvester Stallone becomes RAMBO all over again lol... South America... if you didn't get that joke then you need to keep up with the Rambo franchise because they are all connected in some way.",
            "review_date": "2020-01-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "So bad",
            "content": "Super weak plot, content for maybe 10 min of an average movie. The rest is a bunch of broken extremities, throat cutting and pointless dialogues.",
            "review_date": "2019-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Awful",
            "content": "The story line is awful, 3 stars just for the action.",
            "review_date": "2019-07-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stallone ever had any acting talent, he was just lucky with two out of 100 films, and this shows his lack of talent",
            "content": "Have you ever met the guy? He seems to have an IQ of about 75. This film is unwatchable and the worst parts are the scenes Stallone is in.",
            "review_date": "2019-07-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why was this made???",
            "content": "I just don't why this movie was made..a quick cash grab I guess. The first movie was amazing and fun. The second one, while different was interesting with the unique and complex prison. Then this one... it really had nothing to do with \"escaping\" at all and was more of a rescue the hostages mission from some pathetic excuse for a prison. Alcatraz, while deteriorating, was a better and more impenetrable prison compared to this lame castle dungeon. This dungeon had nothing intimidating about it, just worn down crumbling walls and various small cells and passages modeled after something from the 18th century.I was really looking forward to this once I heard it was being made before they finished the 2nd film. This was an embarrassment and waste of time that I'll never get back. I thought it would have been a direct continuation of the 2nd movie, but had nothing to do with it whatsoever. Everyone involved in making this should feel ashamed for producing this dumpster fire trash!",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watchable but not like first part..!!",
            "content": "Same concept of escape from prison..\nCan watch for action sequences..\nOne time watchable movie..!!",
            "review_date": "2021-05-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just awful",
            "content": "Truly truly awful. Nothing redeeming what so ever. Save your time go watch some paint dry",
            "review_date": "2020-07-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better fight choreography than John Wick 3 But...",
            "content": "Its still a poor imitation of the original.Stallone is looking good and back with a vengeance but not even he can save this retread.Hades was hell on earth , this is slightly better than the second one but not by much!",
            "review_date": "2019-12-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not as good as prt. 1",
            "content": "It is hard to outdo part one. Maybe if they had not killed of Vincent in part one. Who know though.",
            "review_date": "2021-03-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Predictable plot but still a good action movie.",
            "content": "This is your basic rescue movie. The action is good and the filmography and stunts are done well. If you enjoy action movies, this one is worth watching.",
            "review_date": "2019-10-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Too much foreign language",
            "content": "Not bad action, but too much of the film was spoken in Chinese with no subtitles. Couldn't get the gist of what they were talking about, stupid.",
            "review_date": "2019-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Escape plan with easy come out !",
            "content": "If you are expecting this is another escape theme movie from Sylvester Stallone then you will be disappointing, because it only an average action movie. Thrill of escaping from difficult prison is missing here. But here you will get bonus of martial arts sequences of Jin Zhang. Yes, Jin Zhang, that talented martial art actor (known for Grandmaster, IP man3 and Kill Zone 2 with Tony Jaa and Jing Wu), who did better work than Rambo here. Stallone and Dave are fighting as usual. Story is simple and straight divided in two parts, one kidnapping of daughter of rich technical security expert and second one for freed her from kidnapper's prison (?). Movie is average only watchable for some (only a litter word is better) fight sequences of Rambo and Dave and extra bonanza of Jin Jhang. Otherwise movie can be skipped out. Just watchable for once but not so expectations.",
            "review_date": "2019-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Violent but lacking fun action",
            "content": "A Stallone film I haven't seen? What, it's already part 3. How did those two first parts go unnoticed? Well, I decided to watch it anyway. The backstory was left a bit mystery...but how complicated can an action flick be?Ok, well...this was not a very fun movie. It starts quite slow, like some agent/detective thriller. Most of the movie is the villain doing villainous things and the heroes planning to go to rescue. The overall tone is somehow cold, and most of the movie seemed depressing to me. I mean, the last two installments in Rambo series were also violent and pessimistic but managed also to be entertaining action flicks. But this one pretty much not. I believe there may be fans to this kind of gritty violent thrillers that abstain the cheesiness of \"fun\" action films. But probably this one isn't particularly great even in that department. Me personally started to wish I was watching some 80s action movie instead.Alonside Stallone we have many side characters. Dave Bautista plays Stallones ally, a big dude with a giant shotgun on his shoulder. When he started diving to action I thought he's cooler than Stallone - finally the movie is getting good! Too bad he was there only briefly. Then there's martial arts guy Jin Zhang who does some great fighting and almost steals the show as the main hero.I have one more complaint. The camerawork was often too shaky. Freehand cam is ok if it's used wisely (or if you're an amateur just doing movies for fun) but this was one of those movies where it seems like the camera must be shaking all the time, even in slow scenes when people are just talking. I don't get what's the appeal in that.Overall not a terrible movie but...not good either. The only reasons to watch: the novelty of it being Stallone, Bautista shooting shotgun in a short scene, and the several martial arts scenes.",
            "review_date": "2021-09-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Jawn was ass",
            "content": "Waste of time, too much loud music and the story line was trash but good try. Just stop making these, the first one was amazing and now they keep trying. They should have went to different prisons and fed off the first one. Garbage",
            "review_date": "2019-07-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than the 2nd",
            "content": "I haven't seen Devon in awhile. Woo he looks really good with age. Kind of a cross between Gerard Butler & Vic Morrow. Delish. Therefore this one was better than the 2nd but still not as good as the first.",
            "review_date": "2022-07-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dear Sly. Please make more.",
            "content": "This one is a nice entertaining movie. Just mindness action. Clear your mind and enjoy. Indeed not as good as the first, but better as the second.\nIgnore low ratings and see for yourself.",
            "review_date": "2020-11-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Eh...",
            "content": "The first film... great. The second film... average. The 3rd film... average but the worst of all the films. Definitely watch the first and skip the second two. They're waste of times.",
            "review_date": "2020-10-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Some Escaping. Little Planning.",
            "content": "The CGI in Escape Plan: The Extractors is so incredibly and undeniably horrific, that at one point, the blood gushing out of one of the characters is PURPLE!!! Was rendering red blood too expensive for the movie's extremely modest budget, or was it just fourth-rate junky work? I guess we'll never know.Apart from this movie's horrendous effects, relative to Escape Plan 2: Hades, Escape Plan: The Extractors is actually pretty decent and an improvement on its predecessor, though really that doesn't mean much, however in isolation, this movie is still a loosely put together film that makes it to its end barely in one piece.The most prominent improvement from the second installment was this movie's action sequences, which were far superior and entertaining, with Dave Bautista and (Max) Zhang Jin displaying some rather impressive final fights, while the story's more grounded nature proved to be more engaging and coherent, albeit still flimsy and inept, especially with how Ray seemed to have lost the energy he had at the end of Hades to hunt down the organization behind these underground prisons, everyone having their own separate plans in motion during the escape, and Bao Yung the bodyguard's presence and story being so abruptly abandoned. To be fair though I suppose, the imagery shown during the credits, which is not a post-credit scene however, sheds some light, though confusing, on his current status, while hinting a possible sequel, which hopefully will never happen, and should never happen.Even with its horrid CGI, Escape Plan: The Extractors is better than Hades, which admittedly was a welcomed surprise, with a better story and better action, but it is still tremendously inferior to the original.4.3/10.",
            "review_date": "2021-11-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not recommended",
            "content": "I won't recommend anyone to watch because it's not worth of your time. The plot is not likely nothing that connects the title of movie actually . Better be not watch",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Escape Plan III",
            "content": "Marginally better than The Escape Plan II, though that really isn't saying much. Why did they bother making a third after such a poorly-received second instalment?Anyway, in The Extractors (aka Escape Plan III) Sylvester Stallone's crew are breaking into a prison this time - an old, desolate one in Eastern Europe, where the bad guy is making things personal - rather than getting someone out. Lots of bloody violence and Stallone ends the movie as he ends most of them: looking like he's been through the ringer but still walking tall and resolute, dang it.Would have been best to stop after the excellent first Escape Plan. That was fun. The sequels? Not so much.",
            "review_date": "2022-10-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ok, I know it's cheesy",
            "content": "But I enjoyed it. I dig the Chinese badasses as well as the villains, and of course Bautista!! Dave is always fun to watch and his acting is getting better. Yea, like Dwayne Johnson and Statham, their sardonic lines get cheesy. But they are in fact screen badasses!\nThis movie keeps you interested, and in my book, if a movie does that, it's worth a 6 or 7. Some movies you just have to dismiss their art value and enjoy them with all their flaws.",
            "review_date": "2019-10-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Soooo boring...",
            "content": "This movie was so boring i almost fell asleep.\nIn fact some watcher has fallen asleep.",
            "review_date": "2020-02-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Beware the reviews",
            "content": "The first movie was decent, the next 2 were horrible. Like many I was wondering how these 2 sequels got green lit until I learned most of the budget was back by Chinese investors. This is why we have a Chinese action star in the 2 sequels. It also makes me suspicious about how many of the high rated reviews for this movie are probably fake ones from Chinese rating farms. Definitely not a good movie, better then the 2nd, way worse then the first.",
            "review_date": "2021-01-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Love sly but cmon....",
            "content": "Sinply put escape plan 10/10\nEscape plan 2 . 1/10\nEscape plan 3 . 1.5/10Sorry sly worse choices uve done",
            "review_date": "2019-06-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Poor entertainment",
            "content": "I'm a huge Stallone fan and a big on the first Escape Plan. This one\nthough is really poorly crafted with rusty plot, cliché quotes, too many plot holes and bad directing. It is done only to make a movie this year and earn some bucks. You can watch it just for an easy tiring night. That's it.",
            "review_date": "2021-04-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not great not terrible",
            "content": "Not great not terrible. The first one was great. This seems like a cheap movie to me.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wow and shame",
            "content": "I don't have much to say, other than: what garbage from such a great cast and team. Like the old saying, quit while you're ahead meaning stop making garbage movies after you've had a successful run.",
            "review_date": "2019-07-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "An OK action film. Nothing more.",
            "content": "Simply put its watchable but nothing that good. Its a cheap looking direct to DVD generic action film. It has a simple rescuing hostages plot that makes the film a breaking into prison film rather than breaking out. Stallone and Dave Bautista do what they can with the material. 50 Cent is advertised as a lead but is only in it for 5 minutes or so. The thing I got a kick out of is the run time. Take out the end credits and the opening logos and the film only runs about 75 minutes. The end credits go very slow and put little bits of the film in there to boost the run time to 88 minutes.",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Sorry to see Sly in these lowbudget movies",
            "content": "Was better then the second one. But far away from the first one. Really hope Rambo Last blood is 100 times better then this espace plan films",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "LOVE THE ESCAPE PLAN FILM SERIES",
            "content": "Action, espionage, revenge, betrayal, anger, death, violence and major kick ass fighting! This installment has it all! Stallone, Bautista, 50 were familiar faces with the addition of Harry Shum, Jr, Devon Sawa and Jin Shen to up the badassery ante some more! Not sure what film other low scoring reviewers were watching because this latest installment is definitely worth watching for anyone that enjoys a good action thriller badassery flick.",
            "review_date": "2019-10-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Seems like it was made in one day!",
            "content": "I see myself as one of the biggest Stallone fans there is, and Sly is a huge role model of mine, but I seriously have no idea what the heck this movie was! As I say that I can hear Stallones voice in my head barking \"It's a F-in' Extraction!\" The first movie of this series I thought was incredible. It had suspense and cleverness, and almost had magician type escape-artist elements to it. The 3rd instalment of the Escape Plan franchise offers none of that. It's just like Sly was walking around his house bored one day muttering to himself \"I'm Ray Breslin, I'm Ray Breslin, I'm Ray Breslin! Ray Breslin wants to kick some @$$!!!\" It's just another movie about the good guys kicking @$$ and saving the girl! I give it 6/10 just because I like Stallone so much.",
            "review_date": "2019-10-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not bad. Always nice to see Sly.",
            "content": "Its not bad at all. Very exciting and moves quick. Good movie always nice to see Sly. He looks good. A good movie during the Covid 19 outbreak to kill some time.",
            "review_date": "2020-03-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dont waste your money",
            "content": "HORRIBLE.... What a waste...What happened Stallone its getting worse",
            "review_date": "2019-07-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't do it",
            "content": "I wasted almost 2 hours watch this. Watching nothing is more exciting than this.",
            "review_date": "2019-10-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than the previous one but still so much missing something!",
            "content": "The first part was quite successful. Another terrible and this about the middle ground. But even though Stallone is once again in a bigger role, it still doesn't save this. Hopefully it will remain a trilogy.",
            "review_date": "2020-12-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Doesn't really follow on!",
            "content": "SO, 1st film was very enjoyable probably 8/10 for me, basic but it's a Sly and Arnie film, what you expect?2nd film pretty poor but I like martial arts stuff so I struggled through....and *spoilers* it ends with Sly saying hes coming for the big bad money men running the prisons....\n3rd film they storm a mini prison and dont chase the big bass that run the big bad prisons in 1st 2 movies....this is just a black site and they aren't escaping they breaking their friends or out and the daughter of a person responsible for some tech in the big bad peoples prisons but that's only connection.I wanted them to be hunting the top dogs, not dealing with a dumb kid with daddy issues although I love when things link up....overall I managed to watch, enjoyed as much as the 2nd but I was expecting to see them get their vengeance not some random place you can break into with a couple of shotguns.",
            "review_date": "2021-05-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not in the Escape Plan genre",
            "content": "This film differs from the two previous Escape Plan films. The movie itself was also disappointing.There was nothing from this that separated it from the amount of bad action movies made. Some good fighting scenes, that's all it has to offer. I've seen it, will never see it again.",
            "review_date": "2019-07-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Avoid",
            "content": "Don't waste your time watching this one, I watched because I've been a Sly fan.\nIt's the worst escape plan movie.\nNothing to watch.",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A simply cracking action no brainer",
            "content": "Ok so if you're looking for a similar experience as the first, you will be disappointed, firstly because its short, very short, this hampers its ability to really connect, secondly it lack the budget and finesse that the first had.If you're looking for something to wash away the sour taste of the second, well then it kinda helps in that respect.One thing that this has over the second is way more Stallone, and not just just any Stallone, the blood of Rambo is coursing through his veins, and it packs a punch, several to the gut in fact. Stallone's performance was for me the highlight, brutal and honest.Then added to the mix is Dave Bautista, who has a few brief but enjoyable moments to shine, and on top of that is some sublime martial arts moments, non more so that Jin Zhang and Daniel Bernhardt's almost dance like fight.50 Cent was also there very briefly, near the beginning.Over all its a distilled shot of action that burns bright and fades fast. I just wished there was a little more of it, especially after being force fed the long drawn out bland gruel that was the second film.On a final note, ignore the bad reviews, and give it a go, you might be surprised, I was.",
            "review_date": "2020-02-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cringe",
            "content": "So boring I stopped watching in the middle. They should have stopped making it in the 1st one since the 2nd and 3rd are so had to watch",
            "review_date": "2019-07-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dont waste your time",
            "content": "Very bad script unfortunately ......... doesn't suit Sylvester Stallone",
            "review_date": "2019-06-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad american propaganda",
            "content": "Bad american propaganda. Really bad...First part was good but second and this one is disaster",
            "review_date": "2019-10-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Would love to give it a higher rating",
            "content": "Half the movie was in Chinese. There was no captions for the Chinese conversations. You spend a LOT of time wondering what's being said and that makes it really easy to lose interest fast.\nThe martial arts and fight scenes were great. The story line was good.",
            "review_date": "2019-07-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stallone has really fallen down",
            "content": "In the 80s and 90s a movie with Sylvester Stallone was a guaranteed hit. His movies were so well received they made him the highest paid actor at one point in time. The only other actor in his league was Schwarzenegger.Well Arnie went into politics and a successful tv show career. Stallone on the other hand has really fallen into low budget, bad movie oblivion.This crappy movie is an action pic with no action. Stallone must be just trying to stay on top of paying his bills because his career sucks.This is the third entry into the Escape Plan series which I'll admit I liked the first one. Not sure what's going on in this one because a lot of interesting character development is subtitled. The other half is tough guy Bautista and 50 cent walking around looking tough. That's it, I mean that's all that's happening here. No story line, no action, just some ugly stunt men who get killed or hurt over what happened in the first movie.I have not been so confused since The A Team movie 2010.",
            "review_date": "2023-01-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Possibly Stallone's best ever film",
            "content": "Wow just wow. I got goosebumps watching this, it's that epic. Forget the rocky collection, forget Stallone in the Rambo's, it's all about the escape plan trilogy. This third one was best of all. Cannot be missed.",
            "review_date": "2021-05-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Biggest let down",
            "content": "Don't care if it had good actions scenes the script killed it! Very boring and slow then there was good actions scenes but can't be forgiven.",
            "review_date": "2021-07-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "An odd film",
            "content": "Escape plan minus an escape plan.Sly seems to have found a vehicle for minimal action.Nothing to do with the Escape Plan franchise and consequently lacked a plot. It isn't bad but it's not good.",
            "review_date": "2021-09-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "There are so so many ways this could have been better",
            "content": "I wonder why I waited for this. If the movie took so long to release they should have put more thought into it. It boils down, poorly, to bad guys doing bad things to good people, good people making bad decisions and then bad guys getting getting beaten and broken up. ..... the end",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BORED",
            "content": "I watched the first 20 min and i was completely bored, could not watch any further.\nIts a shame because I thoroughly enjoyed the first 2 films.",
            "review_date": "2019-06-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "reaching the new low",
            "content": "I have seen bad movies but this one has its own league but lot better than 2nd one so u can guess the quality of movie story wise, screenplay,action scene.",
            "review_date": "2019-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just Stop Already..",
            "content": "Not the greatest film , better then Hades. But Far worse than the original. What a \"Disappointing Series\"",
            "review_date": "2019-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Well third times a charm is not the case here.",
            "content": "Watchable, totally watchable but it was worse than all the rest. Which is crazy due to the great cast they had to work with. There was just not enough meet on the bone to chew on. It really seemed like this was fully directed by Stallone like with no outside help. Seems like he may have thought it was just good enough. But it wasnt, but it wasnt terrible either, far from it. Give it a go you will end up feeling the same way, there really only one way to feel about a moive like this: it was just ok.",
            "review_date": "2019-07-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A clusterf#@$ of a movie",
            "content": "What a disaster. The first one great, didn't know about the 2nd one, and this one should have been shelved before release.\nThe entire movie was like one really, really, really long run-on sentence. Plot was boring and predictable , story was weak at best, and apparently they have airplanes that can fly half the world Ina few minutes (if you actually subject yourself to watch this, you will understand what I mean).\nA few of the fight scenes were alright, but the rest, yikes!\nI rented this for free from redbox, and am more disappointed that I lost a free rental on this bomb.",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Respect for Sly",
            "content": "The movie is not so bad. Just to spent 2 hours. We have to respect Sly.",
            "review_date": "2021-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Terrible",
            "content": "Watched this and the 2nd one in one night and now I've wasted more than 3 hours of my life to this!The problem I had with this film was that they had to force the plot so much! They showed clips of the first films protagonist because nobody remembered who it was and didn't care! Then the bring his son in to cast revenge but the plan is weak asf, they had 2 of the chinese guys, who were breaking the kidnapped woman, in their captive but yet didn't kill them? They don't know who they are what so ever, so why not kill them?The film is just filled with errors for example the henchmen shoot one of their captive and show his blood on the floor, then they drag him and there's no trail? Sloppy! Stallone literally uses a flash light all the time in the tunnels, if I can see, you can see mate! In the tunnels or just after, Stallone sets up his flash light to be on strobe and has a guy walk through the door and investigate it, the other henchman then closes the door behind him and starts to get into a better position till Stallone goes through a different doorway next to the very same door and jams a pole through his head, what is the point of the first door? It's next to a doorway which leads to the same place and which no one saw before!In the \"big\" final fight scene, Stallone gets shot and it looks like it's hit his eye as there's a lot of blood there, next scene when Stallone goes into hand to hand combat, no blood on his eye? If you're going to make a film then don't piss off the audience with cheap film making, be consistent with what's just happened at least! Also Stallone is like 70 I swear, how is no one kicking his arse?At the very end there's a scene where the bodyguard jumps out of a pipe into the tunnel and then falls to the ground, what on earth does that add to the film?! Nothing at all! Please don't say it's to set up another film and somehow he is the new protagonist!! I started to watch the credit scenes at the end and there is just huge text behind whoever is on the screen for instance with the director, the text just reads director? Seems like more attention was put on the end credits than the actual film!Also how many producers do you need? I think I saw 10 at least? None of them said anything like \"why are we doing this\" 10 producers and still a bad film!",
            "review_date": "2020-07-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Incohesive, confusing, and boring.",
            "content": "Contains Spoilers:Apart from a few decent martial arts fight sequences, the rest of the movie sucked.As a fan of 80s and 90s action flicks, I look forward to seeing newer movies with those action stars, but this one was truly disappointing.The story line was incohesive and all over the place, with some parts truly unrealistic. The bad guy's goal didn't make sense. He kidnapped a Chinese business tycoon's daughter and her assistants so that he can hack into the business and take it over and \"break him\" as some sort of a revenge plot. Why would he also kidnap Stallone character's girlfriend at the same time as revenge as well, when that would just cause Stallone's character to come out to Latvia to look for her and possibly ruin the original plan of ruining the Chinese business tycoon.The good guys had to break into the hellish prison, but there was no break in involved. Two ran through the front lawn that had explosives and got caught right away. The other just walked in through the sewers which they just happened to have a blueprint for on their computer (remote old prison in Latvia which likely wouldn't have digitized prison sewer blueprints).During few scenes when the main bad guy in the prison yelled \"lock them up,\" the locking clunk sounded like a modern automatic locking system for all cell block doors at once. But yet the cell doors were individual type that they still had to use keys for.In one scene Bautista's character is shown walking inside the prison, but it's unclear how he got there, bypassing security and cameras.In another scene one of the Asian heroes used a taser to start a fire from chipped stone in his prison cell. In a fight scene between the Asian hero and a bad guy, I thought the bad guy was the main bad guy, but it wasn't. They just looked alike.Shows you how easy it is to not pay attention, and lose track to what's happening due to a poor story line. It's a big boring mess. Watch it for the cheesiness but don't get too exited.",
            "review_date": "2021-10-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A new respect for Sylvester acting skills",
            "content": "The last scene when Ray beats Lester in the cell, the rage the anger the hate in that scene is unparalleled",
            "review_date": "2019-07-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very Good",
            "content": "I feel like a lot of others are saying on here: \"Better than the 2nd\" \"A lot of fun\" \"Exciting\". This is a good watch, and like another said, Stallone has an edge in this movie, very Rambo-ish. I enjoyed this movie, especially the martial arts scenes.",
            "review_date": "2019-12-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The movie could have better action",
            "content": "Since, this prisonesque brand has shifted to action the movie needed more action aswell Sly and Dave really outdid themselves but tbh all actors were underused and the movie could have been better with an amazing cast. What happened to prison escape plan, it became straight out action?",
            "review_date": "2019-08-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dumb waste of time",
            "content": "I don't have high intellectual expectations for this kind of movie and just expect genre appropriate entertainment but this movie is an offense.A mean daddy's boy whose authority seems based on glaring at goons and foes and a bunch of heroic oafs stumbling into a dumb trap - all mostly set in a rusty old prison gallery - ain't cutting it.",
            "review_date": "2019-06-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "No, why?",
            "content": "The first part was okay, the second part was worse and this one shouldn't have been. No fourth part, please.",
            "review_date": "2021-04-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What do you guyd expect to five it a 3 rating lol",
            "content": "It's a good movie, better than the second one, I enjoyed it a lot and it has my 10. I really get confused with these ratings, for example tarantino movies are much worse in my opinion and they have an insanely high rating. Where's your brain people?",
            "review_date": "2020-10-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Movie rewiw",
            "content": "It's just OK movie,nothing else. First and second movie was definetly better than this but it wasn't bad. Just ok and that's it.",
            "review_date": "2019-07-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "You will turn off after 10 minutes boring as hell",
            "content": "Don't waste your time u need to retire sly trust me",
            "review_date": "2019-07-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Hard to watch",
            "content": "Every now and then you watch a movie and afterwards you want to ask the director and the crew; did you watch this yourself? Really? Didn't you think a single time: whoa, let's stop shining those flashlight into the camera? What is it with that over-use of flashlights anyway?\nThat really annoyed me and it turned out to be representative for the directing of the whole movie.Story is poor. Like the most basic revenge story you can come up with, and than have it told by a little kid.\nMain setting is supposedly \"a hell of the worst kind\" and \"a maze\". But it turns out to be just a poorly maintained prison that's everything short of a maze; people just walk in and out and have no problem or whatsoever to find each other. Showing only four or five rooms and a corridor doesn't give you a maze-feeling either.\nLots of those little things that shows nobody cared. How does it make sense that only once you're in the \"maze\", you think it might be a good idea to load your shotgun? Good for you that nobody saw you coming. You know, being in a heavily guarded maze and such...Acting is very lazy, except for Stallone maybe. He tries to hard, like he's trying to save more than his girlfriend. A movie, for instance.\nScenes with Bautista are specially hard to watch. Looks like he has to do this because of contractual obligations, certainly not because he wants to.A disappointment.",
            "review_date": "2021-02-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Selvestar",
            "content": "It is the film's worst disgrace that the director has brought out non-motivating events in the history of a famous actor such as Sylvester",
            "review_date": "2019-07-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What's with the weird cast?",
            "content": "Casting hispanics as asians? Getting casts who can speak real mandarin to play as a huge Chinese company's boss? Lazy scriptwriting, bad plot and extremely uneducated casting.",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad Action Movie I have Ever seen",
            "content": "Verry Bad Action Movie ever.Please don't\nwaste your time",
            "review_date": "2019-06-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Decent action, but the casting of actors that can't speak their native Chinese is super annoying",
            "content": "First, this is my first watching the Escape Plan franchise movie (I didn't even know about them, until I saw the trailer in the DVD I rented from Netflix. I have to say the action scenes are pretty good. I did enjoy the intensity and choreography of it.What super annoys me about the movie is the actors hired that are supposed to be Chinese from China. I know most of the moviegoers will never pick it up, unless they study Chinese a bit in high school or college, or they are actually fluent Chinese speakers. But the fact that you have actors that are playing the part of Chinese investors from China, and the Chinese employees that works for that corporations, and they can't even speak Chinese well enough to pass for native speakers? That is just lazy casting. I can understand if these actors can't speak English well, because that it literally their second or third language, it would actually be believable. But the actress that played Daya Zhang (Malese Jow) spoke fluent English, but I have to try really hard to translate her horrible Chinese pronunciation (the movie would be way better off using voice over on her Mandarin Chinese lines). Considering there are literally a billion Chinese people on this planet, plenty of them are fluent in both English and Chinese.\nObviously if the action movie star hired can't speak their Chinese lines fluently I can at least understand. Use voice actors for the few Chinese lines they have to say in the movie, and the movie will be even more awesome and authentic. Just saying, listening to horrible foreign language by supposedly native speakers is like hearing nails on the chalkboard.",
            "review_date": "2020-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Poor movie",
            "content": "Sly please change your wig. It is ridiculous.\nI am bold myself. Please respect yourself and what you did. You are amazing.",
            "review_date": "2019-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "More of a hostage flick than a prison escape.",
            "content": "As explained in the title, this is more of a hostage film where Breslin has to rescue his team mates once again, but unlike the 2nd (which is also horrible), this is just...well, horrible. Nothing really to do with escaping a prison, (even if it yet again takes place in a prison),but more to do with Rambo killing everyone in the way. Can in fact see a lot of similarities between Rambo: Last Blood (2019) and this, strays from that with the standard son of former friend (of main character) wants revenge plot. You can also tell that the writers and Sly knew this might be last one in series, predictable stuff happens.",
            "review_date": "2020-04-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst one of the series",
            "content": "To put in simple words, Ray Breslin has become a stupid mix of Rambo and Rocky. More precisely, the taste for violence of Rambo and the over-dramatic acting. It's simply not the same caracter build as the previous two. This development in character was totally un-necessary and illogical. It makes no sense at all !",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "normal",
            "content": "Very normal film There is no new story, events are fast and not perfect, photography is wonderful, scenes of murder is not good for good",
            "review_date": "2019-06-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "it's fine",
            "content": "The movie was fine, I mean, I liked the action scenes and the fights but no more than that!\nI think they could do better with the plot...",
            "review_date": "2019-08-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "average",
            "content": "I think this is an average action movie. some good special effects, when someone fires a gun. maybe I liked a bit more of one of the older Escape Plan movies, where the story was based mostly on Ray Breslin, when he was locked in a maximum security prison. for that movie, I would rate it 7/10, but this one only 6/10.",
            "review_date": "2020-12-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Brutally Honest to its Genre",
            "content": "It's a real treat to see director John Herzfeld and Sly working together on this film. Two long time friends with a rich history creating a film brutally honest to its genre. They put their heart in, and it shows. Fight choreography was great. Plus it was filmed in the same prison that Shawshank Redemption used for some of its scenes. This should keep fans happy and ready for more.",
            "review_date": "2019-07-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not worthy of the ''escape plan'' franchise.",
            "content": "Eventhough the movie was not bad, I believe it was super shallow. A girl gets kidnapped then somehow Ray Breslin gets involved. The previous movies had detailed planning and sophisticated methods and ideas to accomplish the break out while in this movie the team just went in, shot some bad guys, hand to hand combated some more bad guys and walked out.\nThe fighting is good though, realistic and greatly performed. But the story is plain simple.",
            "review_date": "2019-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just Okay...... nothing special",
            "content": "Ok.. I think a problem with the movie is it's trying so hard to make people feel loss. The storyline is simpler than how the movie is trying to make it longer. It could have been better if ended with happy ending but no, it leaves us just ok, that's that. Nothing special",
            "review_date": "2019-08-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Estonia doesn't use rubles. It's EU!! Do your research movie makers.",
            "content": "Really, really bad. Chinese must have payed a lot to Stallone to participate in this garbage.",
            "review_date": "2019-06-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I don't normally write reviews but....",
            "content": "I don't think I've ever written a review for a movie but I mean this movie was just terrible. I normally like cheesy action films but this was just atrocious. So many plot holes, terrible acting, irrational decision making, and unrealistic CGI. I want my hour and a half back.",
            "review_date": "2019-06-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disgusting and nonsense",
            "content": "Don't waste your time for watching this nonsense movie.",
            "review_date": "2019-07-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "a good typical action movie , better rating",
            "content": "I liked this movie ! i watched it just now going in with not to much expectations ! but it has the action and suspens to keep me interested and hooked througout the whole movie ! all actors did a good job . not a must see, but if you like the typical action type movies like most of us with stallone in the headroll than yeah ! watch it and you will not be dissappointed !",
            "review_date": "2019-10-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't Understand Bad Ratings",
            "content": "It wasn't a star wars or Harry Potter caliber film but it was good. Filled with action and a little gore-y but worth a watch and later on down the road I wouldn't mind watching it again.",
            "review_date": "2019-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Night Vision to see it",
            "content": "I only heard voices and barely saw the characters , you'll need night vision device to see this movie . What this movie makers think when they filming this movie , are they on crack or something ?",
            "review_date": "2021-10-17",
            "source": "imdb",
            "lang": "en"
        }
    ]
}