{
    "title": "Student of the Year 2",
    "rating": 0.0,
    "release_date": "2019-05-10",
    "num_reviews": 382,
    "genres": [
        "Action",
        "Comedy",
        "Drama",
        "Romance"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Next Kalank from KJO! Tiger Shroff should be a stuntman at most.",
            "content": "The film has everything, glamour, songs, girls, action, comedy except one thing ....acting.The soulless characters makes film utterly boring for a sensible viewer. Story is too shallow where a lot could have been explored in a college life.Tiger is mocking audiences in the face, instead of being a stuntman he is being projected as an actor just because of nepotism in Bollywood.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tatti Hain tatti.",
            "content": "So, I went with my colleague to watch this movie just for fun. And oh boy we had no fun. The script was cringworthy, the dialogues were illogical and everything was rubbish. surprisingly the newcomers gave good acting performance. I really love tiger Shroff but it's high time for him to look at scripts before signing. He is still in his baaghi mode. Don't watch this movie. Don't waste your money or time. It's tatti.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism, that's why!",
            "content": "I had two free movie tickets, so i went, against my will. It was literally the torture. First one was disaster itself too. I didn't even wanted to write this review but i decided to do some social work. Its hot out there, get your mom an ice cream by the money you were about to buy tickets, because she loves you.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "KJO at his worst..",
            "content": "Nepotism Rocks.Audience should watch avengers 2nd time other than this FLOP.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Kalank",
            "content": "Most wrost movie I have ever seen..\nBest part in the this movie is interval time.\nTiger shroff is not a student he is a stuntman",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wonted!",
            "content": "Writers of Bollywood are lacking to produce unique story lines! Fake usual fantasies. Just introduce updated old songs and movies and collect the credits! This is the trend of Bollywood now!",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bollywood Nepotism Mafia",
            "content": "Except money which these rich nepotism products already have and also shown as lavish sets and locations and costumes , there is no single thing in this movie which is good , no acting , no story , no sense no entertainment , spending your hard earned money to watch such kind of nepotised trash will go to feed there career further. I sincerely urge the audience to not watch this movie in theatre and give that money to some needy person or watch some underrated good movie or watch avengers again.Don't support such cinema and nepotism culture , if you give them your hard money like that ,this menace of nonsense movies with talentless starkids will never end and every year they will launch dozens of nepotised trash.\nAnd kjo seriously need to quit Bollywood.\nThis movie was made to just wash the kalank of #kalank.\nBoth kalank and soty2 are super worst movies of Bollywood history.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another \"Kalank\" from Karan Johar. Don't watch!",
            "content": "Please save your time and money by not watching this disastrous and pathetic movie. It's worst than Kalank and Race 3.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disaster of the year 2 (kalank the 1st)",
            "content": "Don't go with critics who liked performances of the lead actors coz they are paid critics... TIGER SHROFF just knows one thing and that is to do stunts every now and then, ANANYA PANDEY is not good and this two are part of Nepotism gang so they will get praised and Nepotism is on a high in Bollywood and this film is worse than a B grade movie... If you wanna make India look like a developed country then avoid this kind of films and specially films where money is wasted on nepotism!",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "FLOP",
            "content": "Boring Movie.Worst acting by Tiger.KJO at his worst",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Super duper flop",
            "content": "Karan Johar i want my money back...please guy's don't watch this movie save your money and save your time.. Karan Johar give us another kalank movie..totally potty movie",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's just a potty...",
            "content": "This movie was boring,senseless,humorless and this was overall biggest flop movie of 2019...",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Super duper flop...",
            "content": "Karan johar i want my money back....😡😡😡😡\nPlease guy's don't watch this movie save your money and save your time....another kalank karan give us u same on karan",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "You need to have nerve of steel to watch this garbage",
            "content": "Movie Name - Student Of The Year 2\nGenre - Romance / Drama\nRating - Disgusting 0.5 /5Sometimes I wonder whether few filmmakers prepares any script before making a film. Spending so much on location, songs and dance would not give the inception of a good film unless script is thoroughly worked upon.SOTY2 tells the story of 3 friends with the Kabaddi Inter School competition at the background - Rohan (Tiger Shroff) who joins the college for his girlfriend, Tara Sutaria. There is a spoilt brat, Ananya Panday, who thinks she can rule the college with her care-free attitude.Director Puneet Malhotra (I Hate Luv Storys, Gori Tere Pyaar Mein) does not do justice to the area of direction at all. As the movie begins, you are greeted by glossy and candy floss environment of college (reminds you of Kuch Kuch Hota Hai and Student Of The Year 2012 ) with unnecessary insertion of songs. The main drama unfolds in the later reel which again is intolerable with screenplay written surely by a school kid. Art direction and Cinematography is excellent especially. Songs are poor. Dialogues are less-impacting. Performances are over-top. Tiger Shroff does his best but could not do much with the lame script. Glam dolls -Tara Sutaria and Ananya Panday are meant for making the film more attractive.Overall, a pathetic film in every sense.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "headache of the year",
            "content": "Not even worth it\nplease don't support these kind of movies\njust don't",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "1 word - Garbage",
            "content": "Even 1 star is more for the acting skills of Tiger shroff. Watch kota factory on Tvf dont waste money for such pathetic mess in cinemas.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie forever",
            "content": "This movie is unrealistic, bad story line, over acting.....I think #Dharmaprodduction has no sense when they started this type of project ......",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pure garbage",
            "content": "This movie is so bad, after half an hour I got up and left. There's half hour of my life I am never getting back. There is no acting, I don't know why would they even bother to make this kind of movies. I can't give this movie below 1 because there is no rating below 1.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie does not deserved even 1 star.",
            "content": "Don't waste your money and Time on this pathetic movie . :)",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "ALL TIME DISASTER",
            "content": "Just ask the director what he wanna do, either he want to show a love triangle or a dancing competition like ABCD , a sports completion like chakde india, the poor director is so confused .,pls help anyone..\nDon't go anywhere to see this natural disaster of movie...and wait..Just go once but only for Ananya",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "SOTYISPOTY",
            "content": "Waste of money and time. Digusting plot and more disgusting acting.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "3 Idiots of the Year",
            "content": "Disclaimer: No spoilers to give out! You already know the story.\nCostumes, locations - 10/10\nScript - 0/10\nActing - 2/10The movie tries to be Jo Jeeta Wohi Sikandar really hard but fails miserably. The movie has no heart and fails to hold your attention unlike Jo Jeeta. Tiger, yet again has the same one tone dialogue delivery and expressions and the same goes for Tara and Ananya.The film has flashy songs, costumes and acrobatics galore. The director wants you, the audience to cheer for Tiger, whose body is broken in half in a Kabaddi match(?) but Tiger's lack of acting range makes even that impossible. You could probably pop into the theatre post the interval and still get the story or the lack thereof!\nSo, wait for it to come out on platforms like Netflix or Prime. Save your money!",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A DISASTROUS ATTEMPT RACING FOR TRASH.",
            "content": "Once again, Karan is back with only those actors out of a thousand who doesn't know how to act, so sick.\nWe as an audience can't anymore critice bollywood for its production of trash, as it is not going to change, nor does Karan Johar.\nYou know, this trash 🗑 contains everything, remake of a song from the 90s, songs with only noise but no music, expression-less face of Tiger Shroff, body show off of female leads, no proper direction nor screenplay, pathetic story with lunatic performances.\nWe can't say anything anymore when there is nothing to talk about. Rubbish comedy with fake and improper elevations, no proper storyline, and tiger is just there to show off his muscular skin but nothing else. May be someone need to seriously guide him to act.This movie sets a perfect example and stands as a big inspiration and motivation to other directors as of how a film should not be made.\nOverall- a disastrous and pathetic film.\nBottomline- skip this as soon as possible",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A Movie Which Can Not Be Spoofed",
            "content": "After an amazing 2018, and mindblowing movies in 2019, here comes Dharma to take a 146 minutes dump on Bollywood. Such cringe performances are mere product of nepotism. I myself have no problems with star kids unless they are as good of actor and actresses like Ranbir and Alia. This movie is cringe, meaningless and unworthy of your money and time. The whole movie is out of place. I respect Karan Johar for some of his movies. But this just needs to stop right away.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tatti of the year",
            "content": "Please don't waste you time and money for this garbage...",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why K'jo Makes such Irrelevant movies",
            "content": "Ugh. I haven't seen this movie nor going to see in future. Still giving 1 star bcuz it's the least i can give to This Trash oh god K'jo is Epitome of promoting nepotism. Just to launch two new faces in Bollywood he made full length movie to waste audience precious time",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "dumb movie",
            "content": "Totally dumb movie for dumb people.\nkaran johar on for destroying future .",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very low standard movie from Dharma",
            "content": "Sorrowfully, Dharma productions have witnessed a big change in its movie standard since last year. Soty2 is a complete copy of the first story and feels very boring and uncomfortable. We don't need such films but instead we look for some creative and diverse films from Dharma. Very disappointed!!",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stupidest.",
            "content": "The difference between genius and stupidity is that genius has its limits. This film does not have limits in it's stupidity.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "My 300 Rupees gone to waste.",
            "content": "Karan Johar has no idea what type of Movies should be made as these types of Movies are old fashioned and well known to the public for all these years. People wants to see Reality with new concept and logic. (which the Movie was lacking for) Tiger Shroff hasn't changed that much. He is still living in Baaghi mode. New heroines don't even know how to do acting in the movie. Poor direction, illogical dialogues, got nothing to do with College life, Worst screenplay, everything is worst actually. I just want My 300 rupees back.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I wish there was an option for negative ratings",
            "content": "This movie is nothing but a good example for KJO, new female casts that people don't want movies without a good story and acting. People are now awaiting only with real stories or stories with some logical ideas and ofcourse with good actors. Nepotism don't work anymore...Actors and directors now make movie for their own fun, they barely care about the movie and it's story... Struggling actors although not famed are far more better than this movie's cast...",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of money.",
            "content": "Didn't like this money at all. Well am watching this movie just after Endgame. So, it's a kind of my mistake, i should have gone for detective Pikachu.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Sad movie",
            "content": "If only there was a possibility to give zero. Highly disappointed with Dharma productions on last few movies released by them.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the year",
            "content": "Better save your hard earned money rather then watching something like this.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "They think viewers are IDIOT.",
            "content": "This is not SOTY this POTY or \"The Bakchods of the Year.",
            "review_date": "2020-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "WORST movie EVER",
            "content": "This movie is a complete waste of time, energy and money. It you have to, burn your money literally rather than watching this utter disaster of a movie. This movie is a disgrace for bollywood. Film makers needs to learn a hard lesson that we won't accept such horrible movies anymore.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "SAY NO NO ....",
            "content": "Do not take a risk its just a fairytale story no reality or logic applied in it so ...a really big NOOOOOOO\nand ya its 0/10",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "KHULE ME HAGNA BAND KARO",
            "content": "Theatres should provide blanket as well for these kinds of movies.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst at best",
            "content": "Kya haga hai bhaisahab mza aa gya. Save your money and skip this horrendous movie.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Are you really expecting it to be a good movie...",
            "content": "Total useless!! Total garbage!! No story!! You will find everything except study.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "How bad is this movie? Much worse than you think.",
            "content": "Karan johar has lost it. Nepotism at its worse. Very bad actors with absolutely no charisma. Switxhed off after 1 hour.",
            "review_date": "2019-09-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I am angry with people who are complaining they wasted their money and time to this movie.",
            "content": "Everybody knew that this movie is total garbage. People who went in theatres to watch it are dumb fools. What did they expect?? I am angry to these fools because of whom garbage like this earns n continues to leave their legacy. Meine toh ye film nahi Dekhi. Or piracy me b nahi dekunga.",
            "review_date": "2019-07-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "worst movie of the year",
            "content": "Kj this movie 2nd kalank kuch nehi np story no gd song time wast plz guys don't wast ur money nd time plz don't go watch this movie",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Why did they have to make another Student movie?",
            "content": "I am a Screenwriter and Director so I don't really like to be harsh with my opinions because I know what effort goes behind making films.I also know for a fact that a script goes through multiple changes in the course of the making of a film. Obviously at the start their is a script and then the director brings in his sensibilities that change the script. Actors add their own ideas as well, and in the final stage of editing, the editor along with the director make final changes to the story and it is then that we get the end product.I'm giving this backstory because in most cases this is how a film gradually progresses to it's Final Cut, but I can't seem to find it in my heart to say this for SOTY2.I wish there was an option for no stars because if there was, that's what I'd give to this film.First, I don't understand why the indian film makers want to keep making terrible versions of the same film over and over again. Second, the concept had no new quotient to it, so why the hell bother making another film.Except 2 songs, all the songs were rubbish. Again, what's with the constant remakes. I'm really bored with this culture. The direction is awful. Acting I wouldn't even like to comment on because the less I talk about it the better. There is definitely potential in the artists in the film but they were underutilized. The characters barely had an arc, unnecessary storyline and confusion created that makes the film look like the work of an amateur.I wish Ananya and Tara started their career with different films so we could actually see their talent. ( I do think given good roles and good direction they could do well)Tiger was doing a repeat of things he does and He looked really bored doing the same thing. Cut the guy some slack and give him something good to do - like please!Also I feel terrible for actors like Gul Panag who were just an absolute mockery in the film. Not to miss Will Smith who chose this film of all the films to fulfil his wish to be part of a Bollywood number - wish someone had warned him what he was getting himself into.Like I said I want to give the film a 0/10 but since I don't have that option I'd give it a 1/10.",
            "review_date": "2020-02-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "IMDB should include negative ratings",
            "content": "There is no reason why I should be writing this review. I will not add any value whatsoever. However, I am writing in to express my shock , when I found that people have indeed rated this movie 10.",
            "review_date": "2019-09-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the year",
            "content": "Kota factory is far better then soty2.One of worst movie of all time.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism of the Year 2",
            "content": "I would rather flush Rs. 200 note down the toilet than buying a ticket for this movie.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tatti",
            "content": "I made an account just to give this a 1 star, movie sucks. don't waste time and money on this piece of junk",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Funny at it's best😂😂😂",
            "content": "It's funny if you take yourself as a joke and go spend money on this god awful piece of garbage😂",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Kutta bhi na DEKHE.. BC",
            "content": "Kutta bhi na DEKHE.. BC...F####G MOVIE..\nNo Script, No dialogue, everything was hilarious except the Theater chilling AC.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "SOME IDIOTS ARE COMPARING SOTY 2 WITH AVENGERS ENDGAME 🙄😐",
            "content": "No words...IF ANYONE CAN GIVE STOY 2 10⭐...says it's better than AVENGERS ENDGAME 😐😐😐\n113 out of 143 users gave 1⭐ ...so that's it🙏🙏",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "2.26 Hrs of complete nonsense.",
            "content": "1- Movie in which no actor knows acting\n2- The lead actor of the film apparently just wants to show off his gymnastics.\n3- This movie was released in cinema halls.\n4- The price of tickets were 200-600\n5- The songs were like half of the movie.\n6- This movie will have a part 3 i.e SOTY3",
            "review_date": "2019-11-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Weak story bad dialogues and performances sucked",
            "content": "Compared to the part 1 this movie totally sucks it's a real shame because tiger shroff is a great talent and he gets wasted like this. People can call it nepotism but u can't deny that tiger is the future I hope with his ability to dance stunts etc he gets some challenging roles to i feel he still needs make his mark as an actor but this movie I'd call it a disaster for an entertainer I don't know what ever the box office numbers are but this is totally boring even on tv.",
            "review_date": "2019-09-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your time and money 🙏",
            "content": "One of the worst movies I've watched in 2019 after kalank 😑\nI've only went for harsh beniwal 💙",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Negative ratings not present",
            "content": "Better donate my money to beggars.\nThis movie deserves an oscar. What a wonderful script, direction, reality, acting, songs, wow!",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Only for Low IQ People",
            "content": "What more could you expect from a 5 IQ director Karan Johar, and The underdeveloped Brains of star kids.\nI just wish No one from Hollywood ever watches this movie, cuz it will create very bad reputation of Bollywood in the west.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism factory",
            "content": "This is a pure display of lavish nepotism on screen, more of a high society flick who wants to see some new fashion statements and high class college trends.. Except college culture like Study.. Classes... projects.... submissions.... everything you see is extracurricular.. well..Karan johar cannot pull me to pay him for making rich star kids more rich.. Whereas there are a lot of struggling actors in line who are much more talented than these slim zero size brats.. Never ever falling into this puddle...",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Seriously a Duffer !",
            "content": "Oh Man ! What a waste of time ! Pointless movie throughout! Worst acting tiger shroff,he should stick to his gymnastics only and leave acting ! The movie has nothing,nothing at all ! 0.5/5.",
            "review_date": "2021-09-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Copy of Jo Jeeta woh Sikandar",
            "content": "Seriously I have no comments . Just like to say to avoid this film at all cost",
            "review_date": "2020-08-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "No content in the movie.",
            "content": "I m big fan of Tigar shrof. But what I feel about him is that he is only working on in his dance and fighting skills.\nAnd about this movie, now everyone wants movie which has content and story. This movie is for children who are in between 8th-9th standard.\nIf this movie would have released 5-6 years ago then it would have got good ratings ( not more that 5).\nSorry Tigar, I do like you but this is my honest review.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Recycled Trash",
            "content": "OK first things first, some reviewers have said that the people who have disliked the film are jealous of Tiger Shroff? seriously? To Tiger's Credit he has done his job well, he's great at dancing and so in fight sequences but is it enough to make a great film? NO ! Sorry We are not in 80's where people would flock in theaters just to watch Amitabh Bachchan bashing a couple of goons. Audiences are becoming smarter and looking for better content.And there's no content in SOTY2. This is a recycled version of the landmark bollywood film 'Jo Jeeta Wohi Sikander'. Just add some random songs, different situations or scenes but the film is more or less the same. The original SOTY was nothing great but Karan Johar knows the pulse of his audience. He knows how to get them in theaters. So he provided the right dose of entertainment, skin show and songs and people somewhat did like the first part.But Punit Malhotra is no Karan Johar. He has missed the mark totally. OK I get it that they wanted to throw a fantasy world of students right in front of us which we can accept given if we are really entertained, but where is the content? The reason why Baaghi series work because Tiger does exactly what he's known for. He's loved as an action hero but sorry ! how can he play an action hero while playing a student? And even if he does, the situations are hilarious to believe.Secondly, both the girls are a waste. I don't understand about the appreciation Ananya Pandey is getting. All I could hear is the word 'duffer' from her mouth atleast 60-70 times in the film. She acts like a papa's princess which can be hardly called great acting. And for Tara Sutaria, oh boy! what were the writers thinking? The poor girl didn't even get a proper developed character so its hard to expect any great acting from her. She switches boyfriends in the film but is never really sure whom and what she wants.The actor who leaves some what impression is Aditya Seal but then again even his character is riddled by cliches. Music is a Big Letdown. Not even a single song is worth remembering. Also the film drags in the portions between Tiger-Ananya-Tara. They just don't leave an Impact.On the plus side, some scenes do make you laugh and they come mostly from Tiger's gang of friends. The scene at the pub in the first half and the second one when they ridicule Aditya Seal during the opening ceremony of The Dignity Cup. But they are very few and far in between.Problem of the film is predictability, the same story we must have seen so many times before which is why the audience has rejected this recycled piece of trash and rightfully so. And it's high time our producers should empower good writers who can deliver good stories and directors with better execution",
            "review_date": "2019-05-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of my entire life 😭😭😭😭😭😭😭",
            "content": "This is by far the worst movie I have ever seen, I will even say that I found race 3, zero and kalank better than this pathetic excuse for a movie......Karan johar at his best of nepotism.... I mean I found this movie good for nothing and worst of everything like setting, character development, acting and plot. I am giving it 1 only because of Harsh Been other this movie is a big 0 for me.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "We all need Refund. Total wastage.",
            "content": "Remember the money this movie will make is all because of the audience's mistakes to go and watch it. They should really refund all the ticket money's to the audiences.",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Does this movie has dragons ??🤔🤔",
            "content": "It has more twist than GOT season 8....And it's saying review is too short😂😂😂",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Torcher Movie.",
            "content": "Product of NEPOTISM. Rubbish movie.No acting. only PPT of expression dance.No story , just mixture of 2-3 college movies , jo jeeta wohi sikander, kuch kuch hota hai.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "VERY BAD",
            "content": "Just watched SOTY2. Very very bad film. Coming from such big banner is utter surprise. How can such film be even made.\nTotal disappointment.\n1/10",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Karan Johar has lost it.",
            "content": "Probably the worst movie ever.\nThink it's time for Karan to do something else for a while.This movie is pure garbage.There is absolutely nothing special about this movie. Everything about this movie is garbage.To Karan Johar who the hell have a ring in a kabbadi game? If you are going to do a movie about sport do it right.",
            "review_date": "2019-09-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Absolute trash.",
            "content": "Very poor story. Absolutely cringe dialogues and horrible acting. What else can you expect from these appaling actors who got into Bollywood by nepotism.",
            "review_date": "2019-06-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dear movie patron, your admission to this film has been rejected.",
            "content": "Dharma Productions is on the verge of having a streak of underwhelming films starting with Kalank and now this one. The prequel has that lightness and overwhelmingness depsite some flaws it had and now the SOTY team decided to go beyond their redemption by keeling a sequel for the audience.So the story evolves around a middle class chap Rohan Mehra who scores a seat under the sports quota in Saint Theresa. Mridula a.k.a Mia is Rohan's childhood crush who is also a student there and Shreya, the most popular gal in the institution. Manav is the son of one of the trustees as well as Shreya's brother who has a cold shoulder with Rohan with the ambition of defeating him to become Student of the Year. How Rohan's ambitious dreams come true basically forms the backbone of the story.What was Punit Malhotra smoking before coming up with such a cocaphonous flick? The story was very predictable and too nepotistic because of what power and influence of one person can do to another person who doesn't have these traits. Dialogues were too \"dramabaazi\" meaning too 80's for such a delicate film.Acting had some slight redemption but only for the newcomers.Tiger Shroff acts basically like he is auditioning for a film for the first time just like his other films. Too much fighting and just seeing him kick ass and dance isn't going to make acting a redeeming quality.Tara Sutaria was the only potential figure in the acting department because she had that natural glow of a college student and she was decent throughout the movie.Ananya Pandey was also decent and she didn't disappoint at all. She had that personality of a popular college girl with snobbiness which is something to look for in a popular gal.Aditya Seal didn't do much besides bullying Rohan throughout the film and same like Tiger Shroff, same identities but opposite.Samir Soni, Gul Panag, and Ayesha Raza were fine as well but had short roles as they were educational figures.Music was very average at best and no song stood out as such although Jawaani was a beautiful recreation but evrything else around was sub-par. Seems like Vishal and Shekhar overthought some things while composing.Cinematography was well executed by Ravi K. Chandran who shot Dehradhun beautifully but transitionally, it was loose in terms of editing.Overall, too nepotistic and predictable2/5 - Grading Scale: F -53%",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Crap",
            "content": "The only good thing about the movie is the eye candy Tara sutaria and she was the best actor among the cast.",
            "review_date": "2019-11-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "whos the loser",
            "content": "Want to procure the prestigious title of #StudentOfTheYear2? Then u need to adhere to certain rules n regulations. 1-U should belong to the under privileged community. 2-U should be a good sportsman, kabaddi being ur forte. 3-U should take panga with the advantaged, rich stud who owns the school. 4-U should fall in love with his sister, doesnt matter if u already have a lover. 5-U should be a terrific dancer. If u fulfil these conditions, then u r the winner. So whos the loser? The common man who viewed this film. What did he lose? His money, his time, his energy, his sanity. Rating 1/5.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ultimate chutiyaaaapa nepotism film 2",
            "content": "Nepotism mafia of Karan Johars can never come to an end .\nSob MC watch these kind of bakwaas.KGF was the best movie which was depromoted by karan Johars paid review.If you depromote other movies u will have tatti of the year 2. Rip nepotism",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Students without study",
            "content": "I watched this on Prime video only for fun...and literally I was laughed so hard . because it was so pointless,Tiger is jumping in every scene( ROFL)..Oscar winning acting by Tiger, Tara and Ananya .. students did everything in this movie except study..No rules in college,In short 'Akhand C***yapa'... Karan Johar's 2 masterpiece in 2019 kalank and Tatti2..sry Soty 2",
            "review_date": "2019-12-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cliche and Boring and show off",
            "content": "Karan johar again proved why is he called the flag bearer of NEPOTISM.\nThere is nothing new in the movie except for the new girls. The actors doesn't look like students at all.\nTiger does what he does in every movie and he knows nothing more than that.\nAnanya does her part well\nTara is just the eye candy in the movie.\nDirection is poor\nScreenplay lacks continuity\nMusic is awfully boring\nAction is good\nBest work in the whole film is done by ADITYA SEAL\nOverall, even if you leave your brains at home then too the film will make you bore.\nIts too cliche.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Objection to false disclaimer, in the movie.",
            "content": "At the very beginning there is the notice that 'no animals were harmed in the making of this film' but that is totally untrue. 'Tiger' was treated very bad during the entire length of the film. He was beaten a lot ... all the time. Though, thank God it never required any medical attention to be involved, even with the bones dislocated. He was made to jump around a lot, pretty unnecessarily. I don't think he was forced to dance unnecessarily, as he can be seen liking it. The best thing the filmmakers did was to keep him miles away from any study. As a student, apparently everyone wishes for such a year, though we are obviously fearful of repeating the class, but we are happy that these students can have it, due to such a well thought out script.",
            "review_date": "2019-09-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "1 star is even generous for this epuke",
            "content": "This is my request imdb to introduce 0 and negative ratings also as I badly wanted to give this movie a negative rating, tiger shroff please spare us and join Olympics and ananya can't act, only tara n jay seal were saving grace",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "When nepotism got its best",
            "content": "When a Karan Johar's movie announced most of the Bollywood movie fans become so excited and waiting impatiently until the release. However, in 2019, Karan Johar's movies became so boring to watch. After a huge flop 'Kalank', there is 'Student of the year 2', which is another flop.\nFrom the cast of the movie, the plot, the music, and everything are so boring to watch.\nThe plot is a typical story we always heard of. There is nothing unique, different or interesting.\nThe cast, especially, Tiger Shroff can dance well (we agree on that without a doubt) and he can do the stunts all right. But acting and emotions, he needs to work on that. (Sorry to his fans) Other characters couldn't make any impact on the movie either.And when Karan Johar selects cast for his movies he needs to think about it twice. He should think about the skills, not the parents/relatives of the actors or actresses.If someone wants to watch the movie so badly, go ahead. If someone wishes to see a movie which is different and exciting, this is not a movie for you.",
            "review_date": "2019-10-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Save your ticket money",
            "content": "Donate your ticket money instead of watching this .....aaaaarrrgh this is so much annoying on so many levels you might wanna leave the theatre before the end ,worst movie and even worst acting done by the lead .... It's really that bad save you money even if you are a millennial",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Most people will relate.... NOT",
            "content": "This movie totally reminds me of the times when I used to roam around with bikini babes, drive in Ferraris, get wasted, fornicate around, dance/play sports for getting admitted to engineering and medical colleges during my 12 year stint at my government school.",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Director should know we got just 1 human life",
            "content": "1 precious human life. 2-3 hours are sacred. Going to use them, that too by paying 250 bucks for this non-sense is the worst mistake I have done in my life. Still can't erase the pain from my mind. Rather donate this money to the poor.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just a GARBAGE",
            "content": "This is the worst Movie I've ever seen. Full of garbage, nonsense. Even the expression of the Actors ( Tiger Shroff) was not justified. Total waste of money.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Big Surname matters!",
            "content": "By the mercy of God,\nI got to watch so much realistic kabaddi that now I'll stop watching pro kabaddi.\nThe truth of Indian education system has been put on the screen today by Karna Johar.\nIf you want to know about Indian education system & Indian students, then definitely watch this film.\nIndian students who sacrifice curricular activities for studies, go to college to become something, all lies.\nKaran will tell us the truth that in Indian education system, curricular activities is given more importance than studies, we go to college for romance & no matter how many short or vulgar clothes you wear, no one will stop your even your sports teacher & will make you realise that the name of all cool colleges starts with \"St.\"Welcome to Karan Johar school of Nepotism,A school Where is\n\"Jhalak Dikhhla Jaa\" in the name of the dance competition & Bollywood director is the judge, not your Principal. \"Olympic\" in the name of the sports competition.Where, whenever the children fight among themselves, no teacher, principal or guard comes to stop them.Where love is just a joke,Where people don't walk & do parkour,Where there's no limit on students.And studying..... isn't compulsory, there's no coercion you can study if you want to.A film in which the acting, direction, story & logic doesn't matter at all\nBut Tiger's dance & stunts, the screen time of Ananya & Tiger for being a statue (expressionless) matters, because Tara is better than these two so according to laws of Karan Johar Nepotism no screen time should be there for outsiders, what will happen to these two struggler.\nA film that will make you realize how poor you're & it's important to keep your brain out before watching it.",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bakwas",
            "content": "Ekdam bakwasss. No story, No acting. Some clowns are dancing without facemask.",
            "review_date": "2020-06-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever",
            "content": "Never seen anything worse then this. Acting from tiger the only good part rest is all just bad bad and bad",
            "review_date": "2019-08-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watch Kota Factory",
            "content": "The student life you showing in bollywood movie is not look like as you thought. Please, bollywood learn from Kota Factory Tv serial. They are real student of the year.",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Garbage - Why was this made",
            "content": "I feel terrible for Tiger for having associated such a pathetic movie\nThe girls had no understanding of anything called acting and yet there you go we have them here\nBollywood seriously needs some real talent coming And stop such utter nonsense films being made",
            "review_date": "2020-06-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of money and time.",
            "content": "You watch. Better to sleep at home. Worst movie presented in the worst possible way.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another abomination produced by bollywood",
            "content": "After KALANK another KALANK has been produced by bollywood. This talent of movie making can only comes from karan johar. Every thing is bad about this movie. If you wanna save yourself a torture please refrain from watching this abomination.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stop making stupid movies",
            "content": "Stop making stupid movies, it is a waste of time and your money. Stop using tiger Shroff's abs and athletism for movies",
            "review_date": "2019-06-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A bad Try to duplicate \"Jo jeeta wahi Sikandar\"",
            "content": "A very very very bad movie......... First bad script with no script, then bad casting, idiotic dialogue, no turns & twist, no entertaining Songs and last but not the least ........... Third class director and his direction.\nI remembered \"Jo jeeta wahi Sikandar\" while seeing this movie, and said to my self, if K.J would have made Remake of \"Jo jeeta *****\", then this movie could be interesting. But K.J appointmented a stupid script writer and more stupid director.\nNo humar, no entertainment........... Only stunts stunts and stunts.\nThere is No or very very less involvement of local crowd, parents and emotions............ This movie revolves around only hero, his two heroins and an opponent. Rest characters despite being strong actors were useless...........\nFilm makers have to understand, Tiger Shroff is not Salman or Shahrukh, for people will get mad. They should focus on a good story, then a good interesting script on that and a visionary director.\nSeriously very very disappointing to see movie like this.\nThank got I haven't seen Kalank yet and seen Student of the year 2 on my phone.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Stupid of the year 2",
            "content": "One of the worst production company in the World. Wasting money on unwanted films, there are highly talented directors and writers in India and still giving opportunity to brainless guys is Karan Johar alright. Karan Johar gives good talk at interviews but at last does the same stuff again and again. This company only knows to distribute good movies (Bahubali, 2.0).",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "As expected.",
            "content": "No script, not good story telling, and worst is acting by stars. Tiger Shroff done even better in flying Jatt. Only plus point was dancing and kabbadi.",
            "review_date": "2019-05-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste 145min on this film",
            "content": "It has no story, no direction and was only made to glorify tiger's martial arts!",
            "review_date": "2019-10-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Yet another dispirited, cliched and formulaic movie from KJO",
            "content": "I went prepared, with low expectations, but came out disappointed. The trick is to go in blank and marvel at the lighting, the decor, the clothes and all the progress technology has made possible.\nSOTY2 is a new generation movie, a potpourri of characters, glamour, hot bodies and some sizzling dance and song sequences, without the needless story, lyrics or chemistry. There is little if any work done on the latter.This movie is a grim reminder on the current spate in bollywood. When glamour, lineage and callousness prevails, substance and depth fall by the wayside.KJO revels in churning out movies as an industrial assembly line with little, if any changes. But this movie sticks out as a sore thumb, as the basic chemistry between characters appears missing.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Intermittently entertaining time waster",
            "content": "Rating4/10Part 2 in the SOTY series is an intermittently entertaining time waster. Script is absurd as expected. Shroff is athletic and agile but hardly shows any expressions. In fact the young cast mostly disappoints with the exception of Pandey in her debut feature.",
            "review_date": "2019-10-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Horrible",
            "content": "Another example of nepotism.\nWorst movie till date. Wtf kjo. No more. Movies",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Let's put an end to Bollywood's Nepotism",
            "content": "A solid waste of time with amateur actors. Please give a way for talents",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bakwaas!",
            "content": "Please stop producing films KJ. The film is awful, & worst. Pathetic and disgrace.Hail Nepotism 😪😪",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Taking Bollywood to new low",
            "content": "Bad as a whole. Pure nepotism. Anything above than 1*, we know money speaks 😅 abysmal script, abysmal performance, bloated props. It's all only possible in Karan Johar and these star kids schools. Total boo-hoo.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Couldn't watch",
            "content": "Figured out in the 1st 10 minutes that it's going to be a bore. Probably would have done well 20 years back when audience didn't have much choice ..\ncouldn't watch more than 1/2 hour .",
            "review_date": "2019-05-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Fantasy at its worst.",
            "content": "Can you believe that one of the actors actually compared this POS to avengers endgame. Lol. According to him this film should be treated as those epics like LOTR and any marvel spectacle. First off is this a superhero movie? No. Does it have pirates,unicorns,voldermort? No. All this movie does is screw with the youngster's views about college like look how awesome college is but your reality sucks .",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's not a movie, it's an advertisement for zandubalm..!",
            "content": "If you don't want to waste your time please don't watch it..!",
            "review_date": "2019-08-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Soty2 is not bad. It is just too boring.",
            "content": "The trailer was bad, but still went for the movie because Tiger. Bad decision. Went with least expectations, just hoping for some entertainment, but the movie has very few moments. You can give it a miss.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "KALANK",
            "content": "Dharma Productions is a KALANK on Indian Film Industry in terms of content.Giving such crap stories is a crime in itself!! Recalling one famous line from Salman Khan's movie: @Dharma Productions.. India pe ek ehsaan karna, ki ab koi movie bana ke india pe koi ehsaan na karna.",
            "review_date": "2021-04-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Torture!!!!",
            "content": "Dont know what i just witnessed. I went to watch this movie with my friends, and trust me this movie is just a crap, dialogue and storyline are unforgivably cringeworthy.\nDont waste your money,I have already waste mine. Go watch Endgame, if you haven't watched it yet or rather watch old classic Jo Jeeta Wahi Sikander if you want to watch college drama.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Paisa barbaaad bc",
            "content": "Watch it if you dont have grey matter. Utter disgrace and pathetic movie.",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Shame on Bollywood. Shameless Producers & Writers",
            "content": "This kind of movies is a shame on bollywood industry. Old type of drama and things just going on and on. They produce this type of film because we as a indian audience are bunch of stupid monkey's for them. We should stop watching films like this even for one time than these stupid writers and producers will understand the logic of writing and taste of the audience.",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I give one 1 because 0 not in option",
            "content": "Nepotism. (-10) for ananya pandey.nothing to say in this movie waste of time",
            "review_date": "2020-06-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "SOTY2 is Lucky that IMDb doesn't lets us rate zero or in negatives",
            "content": "Illogical movie where there is everything in the college except studies and the dresses in their college is of another level.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad acting of Ananya and tiger",
            "content": "Over acting flop story. Not interested at all. Nepotism kids with 0 intelligence.",
            "review_date": "2020-11-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst nothing more",
            "content": "It has nothing to watch\nI wasted my time\nPlz u don't waste yours\nBad acting music",
            "review_date": "2020-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Garbage",
            "content": "Tiger shroff should be a stunt man not an actor. And Aditya seal comparing this movie with Avengers endgame 🤣🤣",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Constipation of Bollywood's Nepotism : Biggest Mistakes to Avoid Student of the Year 2",
            "content": "Being Student of the Year 2 means your Student of the Year 2 movements are tough or happen less often than normal. Almost everyone goes through it at some point.Although it's not usually serious, you'll feel much better when your body is back on track.The normal length of time between Student of the Year 2 movements varies widely from person to person. Some people have them three times a day. Others have them just a few times a week.Going longer than 3 or more days without one, though, is usually too long. After 3 days, your Student of the Year 2 gets harder and more difficult to pass.\nWhat Are the Symptoms?You may have:Few Student of the Year 2 movements\nTrouble having a Student of the Year 2 movement (straining to go)\nHard or small stools\nA sense that everything didn't come out\nBelly bloating",
            "review_date": "2020-01-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Tomfoolery at its best.",
            "content": "Kuch nahin hai film me. There is nothing in this movie. There's no \"Student\" in the SOTY2. The first part had a bit of \"Studying\", this one is devoid of it.It's high time that Tiger Shroff does some acting.",
            "review_date": "2019-05-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Don't waste your money in this type of movie.. Wasted!!",
            "content": "Don't waste your money in this type of movie.. Wasted!!",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Full dabba gull",
            "content": "No need to say that this is a trash.\nGave 3 stars for some of tiger's fight sequences and styling of the movie.Actual rating-👎",
            "review_date": "2020-02-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst drama and romantic movie...",
            "content": "For the humanity please dont watch this movie you gonna hospital with brain problems.😂😂",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie",
            "content": "Worst movie .. why Bollywood is not able to make good content oriented movies.. god save Bollywood",
            "review_date": "2020-08-05",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A big tatti!",
            "content": "This film has all the cast who doesn't even know how to express. And on top of that the story was so good that even I won't act in such kind of films.. So please KJo stop showing your crazy finniky fantasy on the screen as a mean for entertainment..",
            "review_date": "2019-08-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst more than I thought",
            "content": "I thought to watching it thinking how worse it can be. This is perfect example of nepotism. No acting skills nothing. All casting is done on basis of how rich your dad is. Even in the movie neptoism is shown. Lol.",
            "review_date": "2020-09-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "If You Have Money To Waste Then Waste On It.",
            "content": "I Have Never Seen Kabadi Players Doing\nGymnastics.😂\nAfter Seeing The Movie I Still Don't Know Were\nThey Where School Students Or College\nStudents.😝",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The worst movie of the decade",
            "content": "Tiger shroff looks like a monkey jumping here and there. Two girls were kept to dance and skin show off. Do not waste your money on this.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please avoid this crap",
            "content": "Anyone planning to see this please avoid....I repeat please avoid.\nOne of the worst movie of the year.\nHas nothing which can pe appreciated.",
            "review_date": "2019-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pls trust all the critical reviews here!",
            "content": "Happy to meet the next generation , confused , all over the place, infedility and do every other extra curricular activity but be a student and study 😀! KJO this is your best in the worst category ! And yes no one needed to act, such a faltoo movie , everything seem to have come naturally. C'mon yaar, do well and spend money and time in producing quality and value to this world.",
            "review_date": "2019-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Didn't see the movie, rating this because it exists.",
            "content": "Didn't see the movie, rating this because it exists.\nThanks.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst",
            "content": "Nothing can be worst than this..\nKaran johar you are really dumb ..\nWe hate you",
            "review_date": "2020-08-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Really bad direction",
            "content": "Very far from reality.Waste of time and money.Don't watch.",
            "review_date": "2021-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "#Worst & Nepotismfull",
            "content": "Plz don't waste your precious time & money for this flop,worst & nepotismfull movie😡",
            "review_date": "2020-06-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "KaranJo & Shirish are competing for making worst movie of decade",
            "content": "It is rated 1 and there is nothing good to talk about this movie except One song from Arijit Singh. 1 point is only for that song..\nMovie does not even deserve one star..",
            "review_date": "2020-12-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Entertaining new generation movie",
            "content": "Entertaining new generation movie, light and Tiger Shroff really acted well.Ananya Pandey was like a cool breeze. I hate KJo movies , but liked this movie. You need to watch this movie as a college goer mind, can't watch it expecting to be like \"Sacred Games\".",
            "review_date": "2019-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Karan Johar's College of Nepotism",
            "content": "Starkids are much pampered and appreciated in Bollywood but, outsiders don't get chance to perform in good films and that's why Bollywood don't win Oscar.~Tiger Shroff (Billa Show-off):-\nTiger must not be known to us if he were not the son of Jackie Shroff. His acting Skill is less than 0. He dances well, have 6-packs but don't know why he's considered as an 'Actor' while it contains the word \"act\" in it. Tiger lovers only see his body and dance moves but never notice the acting done by him😒~Ananya Panday (Annoying Panday):-\nI don't know why she's in Bollywood? Because of Karan Johar who launches the children of Celebrities whenever they born. Her acting can also be said as overacting 😒. She overacts very nicely.~Tara Sutaria (A real star/tara):-\nIf I could give this movie 0, I may have given 0. But the only 1 star that I given is for this real struggler, Tara. Her role was not good in the movie but her acting and expressions are really impressive. She acted in many serials and finally she got chance in Bollywood. She was also chosen for the role of Princess Jasmine 💙 in the movie Aladdin. But due to some reasons, the role was given to Naomi and for earning she has to do this disgusting movie.😩I'll highly recommend not to watch this movie🙏",
            "review_date": "2020-07-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "IMDB should provide with a 0 zero rating option also",
            "content": "If you want to sleep for 145 mins in a movie hall then this movie is the perfect option. My request to IMDB is that please provide with a zero rating option on your website",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "PLEASE STOP MAKING THESE MONUMENTALLY STUPID FILMS",
            "content": "Can you guys be any more stupid.\nWhat was the thought process while writing story, screenplay, acting, directing and editing?",
            "review_date": "2020-08-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Say No to Nepotism",
            "content": "A BIG NO. We are not interested in those unrealistic college competitions. Students face so many things in there life. You can add struggle, peer pressure, suicides done by them, reason behind suicide, bullying,etc... But Karan Johar will support nepotism.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Chutiya movie of the decade...",
            "content": "I can't give - 10 so I have to chose 1 rating..Senseless movie, no script, hilarious irritating to tolerate such direction..Grow up and apply your mind..",
            "review_date": "2019-09-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Trash",
            "content": "Even though i did not see the movie its trash. Dont watch it, every thing that has to do with karan johar & Tiger sharoff is trash.",
            "review_date": "2021-04-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Can cause blindness",
            "content": "I just can't articulate the level of blunder they did in this movie",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Unspeakable.......",
            "content": "One of karan johar worst films.This is also his 2nd time in a row to flop after kalank.The film contains bad songs,bad acting and maybe plot.[Me:After film,gets out of theatre and starts crying in the toilet of the money benig wasted.0",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Wait wat",
            "content": "Nvr seen movie but still its existence pains meWord's the only one who doesn't love a good time to get the latest flash player is required for video playback is unavailable right now because this video is not like",
            "review_date": "2019-06-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the year",
            "content": "The year isn't over yet but KJO is in the lead with Kalank and now SOTY 2 for award of the worst produced movies of the year.\nThere is no new content and the acting is diabolical. KJO is extremely formulaic and hoping to make a quick buck with these movies. He has no shame and is definitely a Kalank to his fathers name.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie",
            "content": "Karan johar should stop irritating people with stupid movies and tiger should work behind the scenes as a stuntman instead of lead actor",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please don't watch",
            "content": "Total waste of time. You will not even enjoy your free time if you decide to watch this movie. Beware!!!\nI would suggest if you see director's name as Karan Johar in any upcoming movie feel free to avoid that.",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad very bad",
            "content": "After listening to all negative comments from my friends I still went for it, I am disappointed. A complete waste of time. How many times the public needs to tell Bollywood that we are bored of such movies!",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie",
            "content": "Don't know why I watched this movie. First one was still better to watch and at least have some story or some kind of a logic.",
            "review_date": "2019-09-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Taati",
            "content": "1 star for only harsh beniwalin. Baki sab chutiye. No plot in the sense. Even no sense exist.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disgusting",
            "content": "Full time waste, completely disappointed, acting = 0, script= 0, story= 0",
            "review_date": "2020-06-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the decade",
            "content": "I created an imdb account just to rate this movie 1 star",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nobody asked for this",
            "content": "What this movie needs is a strong plot or more crazy action fight scenes. Ananya's funny and charming personality also couldn't save this film. This is probably a poor RIP off of the thousand past Bollywood movies that came into play. Tiger's stiff acting appeared quite bland to me. He acted and behaved more like a 28 year old and not really a college student. Aditya did his role right but the movie failed miserably in the second half.",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism",
            "content": "Nepotism on next level thanks God I have PUBG in my mobile then only I spend time in Hall There is no logic only promoting the Rich child",
            "review_date": "2019-06-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very bad movie.",
            "content": "I have watched this movie first day first show, as I am a big fan of tiger...but I have burnt my 250 rs...the worst ever movie of tiger...Ananya looks good...but movie is worst",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Everyone should be jailed (other than Will Smith)",
            "content": "The actual worst film I've ever seen and it begins in the first scene. The script and dialogues are both just as disturbing as each other. Additionally, the casting director should be fired as the two male leads both look as though they're on the wrong side of their 30s.",
            "review_date": "2019-12-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst of worst",
            "content": "No need to see this, the worst of worst movie, I don't watch till end, that much boring, waste a complete waste movie, why should they make this much bloody movie..",
            "review_date": "2019-08-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time & money",
            "content": "Story sucks , acting were even worst by all actors . So called big names tiger shroff failed again in acting & struggler ananya struggles a lot to deliver her acting",
            "review_date": "2020-08-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BEST MOVIE EVER!!",
            "content": "No words, amazing movie. Must watch with family and friends. If possible please buy Platinum tickets for DC Extended. Hater's gonna hate 11/10.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "waste of time",
            "content": "A complete illogical as expected. In the name of masala entertainment, this movie is a complete waste of time unless or until you have enough time to see tiger Shroff abs and dance moves.",
            "review_date": "2019-12-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "My friends forced me into it now I eat alone",
            "content": "Anyone with decent mind should avoid this iq degrading movie, the story lack.. Well everything, except Will Smith cameo which is as random as the chance of me watching this film again, I am not going to tell you the story because I don't want to spread the depression I felt after watching this dumb film and realizing I spent money on this crap insted of enjoying pizza In my bed while watching Netflix.",
            "review_date": "2019-08-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Jo Jeeta woh Sikandar inspired.",
            "content": "Yes the movie is better than part 1. In first edition everyone is rich, the poor are rich even and rich are super rich. But at least here they have shown a difference. Tiger shroff being from a middle class has not be shown wearing expensive stuff etc.\nBut the movie was too inspired from Jo Jeeta Woh Sikandar, competition style and all. But then again it was better than part 1.\nFrom the first edition stars like Alia Bhatt and Varun Dhawan were born (Sidharth Malhotra was / is not even close to be an actor) and from this part it's Ananya Panday, simply wonderful and beautiful. Tara Sutaria, disappointing, need to take acting class, place some expression on her face, one look through out the movie.\nTiger shroff being himself, Gul Panag should not been even place on the cast list.",
            "review_date": "2019-09-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "The way too good",
            "content": "My rating is for Entertainment and this movie entertain me very well, The romance, action, acting all are good only issue is with dramatic wins and ending. Tiger Shroff must minimized his stunts but his dance is fabulous. Totally connected movies and an entertainment fantasy.",
            "review_date": "2020-01-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Little India Directory Review: Student of the Year 2 (3 Stars)",
            "content": "There's a special type of courage so far unknown to the movie-going public that will be required to bear this imaginative piece of mega nonsense by Punit Malhotra who tries and succeeds to stray away from logic and realism in Student of the Year 2 that it will be impossible to go back to mindful comedies in this franchise. There's no going back from this.In an over-the-top setting where a bunch of high schools lock horns with each other for an inter-level sports competition pretentiously titled 'Dignity' where the best player from the winning school's team will be throned as the 'Student of the Year', director Malhotra's characters are the unabashed, self-proclaimed stars. He has Tiger Shroff as the typical boy next door with a lower middle-class background and a dream to fulfill the dream of his uptight and arrogant girlfriend (Tara Sutaria), all of which will give you a heartache. Another two of his dreams is to get that throne in the sports competition and get admitted to the college of every student's (reel + real) dream. A college where academics do not exist. And where instead exists people like the obviously arrogant incumbent Student of the Year (Aditya Seal) looking to hit a hatrick this time and an equally arrogant, daughter-of-the-trustee (Ananya Panday) who wears couture and who would barf at the idea of flying coach. While Seal's and Shroff's characters compete with their abs and looks, Panday's maverick presence makes up for unwanted idiocy. Each of these characters, along with a few essential supporting ones like Shroff's and Seal's on-screen friends, and faculty who never touch a book or a blackboard, throughout the 150-minute ecstasy-filled colouring competition further make this is a blunder of Himalayan proportions.There's so much colour in Student of the Year 2, I thought I was looking at a fashion show from the future. Shroff's character, currently just managing to make his ends meet, uses DIY techniques to style his threads but in the next sequence they are as good as to be used in walking the ramp. Every single character - including the extras - wear fashionable clothes that had me sitting in the theater wearing PJs and a loose tee, making me want to approach the style partner and say hello. Unfortunately, the film quickly scrambles to show you ads for Subway and a chips brand (Too Yumm!), which is slightly irrelevant considering they are pushing fashion textiles for the most parts. So I lost track.Shroff flexes, jumps, leaps, flies, and sometimes falls flat on his face in Student of the Year 2 and there ends his performance as this aspiring young man who does not look one bit his character. While Panday and Sutaria do qualify as kids, their performances are strained at best, failing to add the charm that was present in the lead actors of the 2012 prequel which had more panache, pizzazz, romance, and fun. Harsh Beniwal as the designated joker and Seal who puts up an attractive show as a villain at the age of 17 should have won the award if there is ever one that celebrates worthiness. The little humor and the hunger for passive vengeance that is brought out by these characters are the only saving grace in this otherwise slipshod treatment of exaggerated high school life that is 3-fold worse than anything you have seen of this type in Bollywood, including Farah Khan's Main Hoon Na! (2004). During the viewing, I did wonder why Malhotra and his chums did not take a look at international films. Maybe a scene at the detention center or a professor actually teaching a concept in the background would have made me hopeful instead of a frame showing students sitting in a packed class and other where two characters assemble at the principal's (Samir Soni in a 50% comic role) office so that they could add some family drama into the mix.But what poses as the biggest threat for this musical comedy drama's success is its waferthin and illogical plotline. The turns that it takes - with the women taking sides, blabbering to show they are cool, unbelievable sports performances with Kabaddi looking like a wrestling match - Student of the Year 2 goes overboard in everything that it tries to showcase. And it probably takes great pride while accepting that they are into exaggeration. Unfortunately for the audience, it does not work; neither in entertaining not making us aspire to be like these overzealous, fake characters. There's so much going on in student of the Year 2, it becomes difficult to keep track, with plot arcs often defying logic or continuity. It slowly turns into an unbearable piece of content that you would immediately want turned off. Since you chose to view it on the big screen, the only solution is to walk out.Whether it is the physique that Shroff has maintained or that Malhotra failed to digitally edit (like they did in Aanand L Rai's awful Zero (2018)) or that none of the songs inspire fun are some of the other factors that make this experience not worth your money or time. The film throws challenges at you one after another, treating you like a kindergarten kid who will clap and jump at everything glitzy and noisy. It is for that reason that I do not recommend Student of the Year 2. If you really like high school romance films, try the prequel and then forget about the genre in Bollywood unless someone more talented and experienced people than Malhotra come on board. But that's an ironic statement. Both Malhotra and writer Arshad Sayed (who surprisingly also gave us the fantastic Dasvidaniya (2008)) are to be blamed for taking this idea from Karan Johar and dismantling it, butchering it into a product that looks tasty and good, but is poisonous if you consume it. We need to stop promoting this cannibalization of the industry.Sometimes there has to be a little realism or logic or even a bit of genuine emotions in the proceedings to justify a fantasy so ridiculous as this, but I guess that is something you already knew. Student of the Year (2012) at least had a mention of academics. And 7 years later, even as education boards in India dole our 100/100 to their top students, a film comes with a tag of nepotism without a second of studies that should have been fittingly named \"Spoiled Brats of the Year\".Save for the 5-second performance of Will Smith that you may miss if you don't pay attention to the half a dozen opposite-of-glee songs in Student of the Year 2 and a few one-liner jokes by the breakout star Harsh Beniwal (whom I would like to see as the lead if they ever make Student of the Year 3), this one here will tickle your fantasies that are best left untickled. Do something better with you time if you don't want to go window cloth shopping. TN.Originally appeared in the Little India Directory (Singapore).",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I am crying (save money & time)",
            "content": "The rich as the evil ones - check.The middle class as guileless, largely good and at worst, misled by the rich - check.Loneliness in an upper-class family contrasted with warmth in middle-class family and community life - check.Glamorous, perfectly made up girls in tiny clothes - check.Enviably slim female waistlines and legs perennially on display - check.Boys with muscular, perfectly sculpted bodies - check.Male biceps and abs perennially on display - check.Boys who obligingly take off their shirts for our benefit - check.Boys and girls who look doll-like in their physical flawlessness - check.Soul - none.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Romantic",
            "content": "Actually what I loved the most in this movie is \"I still think Ananya Panday is Shreya\".\nShe has done a awesome acting.\nYou get totally connected to her role when you watch this film.\nElse I don't know but this movie is Romantic.",
            "review_date": "2019-06-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Is this a movie or a cartoon?",
            "content": "One of the worst movie i've ever seen in my life ! Waited for such a long time and I was totally disappointed.i was thinking while watching this movie and was asking my self why makers made this kind of tatti movie? Why tiger signed this movie? Movie was totally crap.there were no contain in the movie.and please don't compare this tatti movie with masterpiece avenger.tiger is a stuntman rather than student.karan Johan copied all the the stuff from the past movies including songs. Don't go for watch that kind worst movie better than halp poor peoples from that money.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Utterly boring",
            "content": "1 star as we can't rate 0.Watch it if you can tolerate zero acting, cheap dialogues and senseless narrative. Advised to not use your mind while watching!",
            "review_date": "2020-07-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ghatia movie",
            "content": "Worst movie ever..no acting ..only action and silly romance",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Flop.",
            "content": "Why do these morons make such stuff , they could invest in real talent .\nIdiots .",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie and worst actress ananya pandey",
            "content": "She has zero knowledge of acting she knows nothing and even she doesn't look good",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever !!!",
            "content": "KJO has lost it now.. I am not sure how he can get distributors for garbage movie like this and Kalank while no distributors for DRIVE !!! flag bearer of nepotism. Likes to promote star kids with no talent and polluting hindi cinema was worst movies !!",
            "review_date": "2020-08-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watch it on your own risk!",
            "content": "Don't watch it even for free. It's not a movie, it's mental trauma.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst",
            "content": "Don't watch this movies, Save your life. One of the Worst movie forever,",
            "review_date": "2021-05-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just like it",
            "content": "Han tou me ne tou I am not sure what to do with this one but I think it is a great place to work for and it is a great place to work for and it is a",
            "review_date": "2019-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One time watch",
            "content": "Nothing special in this one. Story is weak. Acting and music are average, Tiger does what he does best. The two new girls are there for only glamour. Overall, it's only one time watch. Go without any expectations. Maybe you'll like it.",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism rules!",
            "content": "Save your money people.This movie has non existent screenplay and direction. The plot and dialogues make no sense whatsoever. KJo mist think that the audience is dumb by making such pathetic movies. Tiger and Ananya's acting was cringeworthy and Tara's role was cut short to being an eye candy. Alia's item song cannot save this movie and reeks of desperation.Nepotism has ruined Bollywood.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "STUDENT OF THE YEAR 2 REVIEW",
            "content": "A small town boy Rohan Sehgal (Tiger Shroff), madly in love with his childhood sweetheart Mridula (Tara Sutaria), follows her to city's top college. But this new term brings friends, foes and cut-throat competition along with heartbreak. Will he bounce back and beat the odds to become the Student of the Year?\nPretty young things in designer wear, dapper dudes with rippling muscles, scorching hot-wheels and a colourful campus buzzing with all sorts of extra-curricular activities - Welcome to the class of 2019 at Dehradun's most upscale college Saint Teresa. It's a place where all things are pretty and glossed over. Film's leading man (Tiger Shroff) fits right into the scheme of things when he secures an admission with a sports quota. He comes from a lesser privileged college, where students don't have the luxury of fancy cars and fashionable clothes. But his many talents start becoming a cause of concern for the current poster boy of Saint Teresa, Manav Mehra (Aditya Seal). Add to that, Manav's sister Shreya (Ananya), the college brat, who thinks of herself as no less than a princess, is all set to take on Rohan and embarrass him at every given opportunity. This sets the stage for a testosterone led confrontation of one-upmanship that involves love, ladies and competitiveness. Much of the story revolves around the four main characters, who fall in and out of love without much ado. There's no heartbreak too deep that can shatter them, or a punch so strong that it can break them. The narrative stays sweet, simple and along predictable lines.Tiger Shroff pretty much carries the film on his well-toned shoulders, and his sweet boy charm works for the part. His strengths are showcased with skill and attention - whether he is dancing like a dream, running on the tracks (the camera accentuating his muscles and sinew in close-ups), playing kabaddi or flipping in the air and landing with a blow.While film's leading ladies Tara and Ananya are glammed up to the T and flaunt the best designer wear that money can buy, their roles aren't tailored to perfection. Especially, Tara's character doesn't seem well-etched out. While her screen presence is impressive, her performance is average. Thankfully, for Ananya, her character gets a definite curve and a convincing backstory that works in her favour. Her performance gradually grows on you, especially in some of her meet cute scenes with Tiger. Ditto, for the film's anti-hero Aditya Seal. He pulls off his part well, looking every bit the classy, rich spoilt brat.While there was far more scope for comedy, some of the best laugh-out-loud moments come from Tiger's gang of friends. Among them, Harsh Beniwal leaves a lasting impression with his wisecracks and comic timing.Director Punit Malhotra ensures that a lot of drama and action remain out of the classroom, with focus on sports, dance and romance, not that the new age campus kids will complain. However, the chemistry between Tiger and the two debutantes doesn't quite warm your heart. And while it comes seven years after SOTY, the writing doesn't seem to have come of age.\nMusic is quite average, unlike the previous SOTY, which had songs like Radha and the Disco song that could probably feature on your playlist, even today. The edit could have been crisper. With the story at hand, the film could have had a shorter runtime. While the first half is spent in setting the tone of the film, second half gets a tad more exciting when the drama and action unfold. The film does make you nostalgic about Mansoor Khan's 1992 hit Jo Jeeta Wohi Sikandar, of course, this one is a modern-day snazzier version.\nOverall, SOTY 2 doesn't have that Ishq wala love, but there is ample dosti, high school drama and cool stuff to keep you going. It's always fun rooting for the underdog and you'll find yourself doing that here, too. There's not much to fuss over, but for the young campus generation, it's a fun and breezy watch. With enough lessons in styling and fashion (out of syllabus, of course).",
            "review_date": "2019-05-23",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "CANCER. DON'T WATCH THIS. SAPRE YOURSELF SOME HEADACHE.",
            "content": "One word : PATHETIC. storyline, acting, songs..this movie manages to disappoint in all the quotas. Don't even consider watching this in theatre. Better yet, don't watch at all. Save yourself from 2:30 hours long disastrous attempt of a movie. Expression of tiger shoroff needs an altogether seperate mention. Yes. That's how bad it is. For the first time, i enjoyed the ads more than the actual movie. Staring at the wall would've been a better experience i suppose. I spent the whole first interval distinguishing the two main actresses. And if any of your friends forces you to go and watch this crap of a movie in theatres, you really should think about getting new friends. That'll be all. Thank you. Have a nice day.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Loved the girls.",
            "content": "I just saw the movie to see ananya. And I liked her so much in that movie. And yeah that movie was entertaining sometimes.",
            "review_date": "2019-09-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Potty of the year",
            "content": "Soty more like poty. Literally hag diya movie ne. Bollywood me babu maar rha hai.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Student",
            "content": "Tiger Shorf was Lit! Both the heroins were cute enough to keep you engaged throughout the film! The climax kabaddi scene could have been better! I personally liked the film",
            "review_date": "2019-08-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Best debut actress Award",
            "content": "Totally rigged award system. I mean how do they even think of giving an award for a movie like this. No wonder why Mr. Perfectionist boycotted these award ceremonies.",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Modern version of jo jeeta wohi sikandar",
            "content": "This movie is the modern version of jo jeeta wohi sikandar nothing else. Better watch jo jeeta wohi sikandar at home instead of wasting money.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bekar movie",
            "content": "Don't watch and waste time and money. PLEASE\nWorst Movie-Ever",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Rubbish movie",
            "content": "The movie has no plot. They just shot the movie, as if they didn't have a script. There is no role of the actresses. They are just cheerleaders fighting for a boy. The negative guy had a much better role than these two actresses. Tiger Shroff seemed in some kind of martial arts school rather than a normal college. Keep your brain at home if you are going to watch this movie.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BORING",
            "content": "No soul. All the characters makes film utterly boring. Story is also too shallow and with no sense.\nTiger is mocking audiences in the face. Very very bad\n1/10",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie",
            "content": "If you really need to know the story you can watch youtube series like tvf and many youtuber crewted",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Everything we need in movie",
            "content": "Nowadays everyone director make different classic movie and masala movies are now less in quantity . But it is great movie after all I like so much actiing of tiger and manav also shuti look bold. I watched it 4 times. I love tiger s acting",
            "review_date": "2019-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Its a HEADACHE !! MOHIT DHAWAN REVIEWS",
            "content": "I am tired of watching the same old story again and again.I think Karan Johar should spend more money on finding good script writers rather than focussing on item songs and sets. Hands down one of the Worst movies of 2019 along with KALANK.My Rating - 1/10 😢😢😢👎👎👎Regards\nMohit Dhawan Reviews",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Forgettable Campus Romance",
            "content": "Director Punit Malhotra ensures that a lot of drama and action remain out of the classroom, with focus on sports, dance and romance, not that the new age campus kids will complain. However, the chemistry between Tiger and the two debutantes doesn't quite warm your heart. And while it comes seven years after SOTY, the writing doesn't seem to have come of age.Tiger Shroff is good when it comes to dancing and action but a little less in terms of acting. Ananya does a good job as the rich and spoilt Shreya. Tara Sutaria who plays Rohan's girlfriend Mridula has a lukewarm personality, but Ananya , who is cast as mean girl Shreya, has an X factor that pushes its way past the layers of gloss in SOTY 2. Aditya Seal is great in the action department but has nothing much to contribute to the film.",
            "review_date": "2023-02-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One time watch",
            "content": "So I may be on the flip side here. But I'm not just gonna give a film low rating because everyone is giving it. Yes it's not a high concept movie but it's watchable. The film has some good comedy moments and the story well you know the story when u saw the trailer. You have to judge this movie from a different point of view. I've seen far worst films than this which has a good rating than this film ironically",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good",
            "content": "Movie is awesome\nLuv it\nAnanya Pandey. Tiger shroff acting superb",
            "review_date": "2019-06-07",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good movie 🍿",
            "content": "I was surprised to see all these negative comments. I watched the move over span of two days. I enjoyed the full package 📦.I believe all those comments were a negative campaign against KJR ( I am not a fan of K) but I can appreciate a decent entertainment.",
            "review_date": "2019-09-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad",
            "content": "Though I Haven't Watched This Movie, After watching the trailer itself I Decided Not to Watch.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "TIGER SHROFF PLAYED TIGER SHROFF",
            "content": "You will see tiger shroff jumping like u saw in all his movies....TARA SUTRIYA is good but ananya disappointed",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good for Ananya & Tiger",
            "content": "I donno why but I loved this film. Though the reviews are mostly negatives, I enjoyed the movie thoroughly.",
            "review_date": "2020-03-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "KACHRA",
            "content": "Hate to tiger but this movie sucks, his brilliant dancing and average acting skills could not save the horrible movie and unrealistic fairy tail.Tiger please do a role of a masked man with only purpose is to fight.\nGive us ur action but please stay away from trying to act in such movies",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nice and educational !!!",
            "content": "Tiger Shroff came back bigger and better this time, instead of being the superhero all the time, his character was cheated and suffered unrequited love...\nThis movie mirrors the impact of change in environment in a once blissful relationship...\nNice movie, splendid casts and well organized and relayed scenes",
            "review_date": "2020-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I got the entertainment value with this movie",
            "content": "Apart from not stop negative review here emotional one Star has invented this is just Dev Airtel that these are the nepo kids. Go and find out where is not nepotism in politics and profession like Dr engineer IAS civil services in business everywhere is nepotism you cannot deny if an actor baby or kid want to become an actor then where is the problem this is their profession so we should respect just because Tiger Shroff is son of Jackie Shroff and Ananya Panday is daughter of chunky Pandey you have right to hate them then you are not doing any justice I got hundred percent entertain value in this movie and I thoroughly enjoy the movie storyline is good situation is good directions Good. Have not seen American pie what kind of movie those are and you enjoyed a lot with your friends why you enjoy that also don't have anything in reality why you enjoy that is different Genre anyone make. In the same way KG Karan Johar make their movie with their test and I don't find anything wrong in that.",
            "review_date": "2022-09-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disaster",
            "content": "This movie is a complete disaster...this movie was this years kalank 2.. not expected such poor performance..",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst Movie- Do Not Watch This Crap",
            "content": "Karan should retire for good.🙄\nIt's a film written only to favor and launch Ananya and hence hers is the only character that has some layer, sorry but her acting is not on point and the rest of the cast is only for show.😡",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "A big no to this movie",
            "content": "So today I have watched this movie because of my sister and after seeing this art one thing came to my mind is 🖕 this movie.\nYou may say it is harsh and rude but this is reality.",
            "review_date": "2020-04-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Over acting",
            "content": "Unlimited over acting nothing else, waste of time and money.",
            "review_date": "2020-06-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad movie",
            "content": "Bad movie i don't like this movie all are nepotism.",
            "review_date": "2021-06-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good Movie, But for biased \"1\" star reviewers",
            "content": "Although movie misses some sparks like in the first instalment, Tiger Shroff is exceptionally brilliant and new age actor. The dancing , attitude and looks are stunning. Gone are the days for Khans, and they vent their frustrations by posting fake 1 star reviews.\nSallu cant even dance 1% that like Tiger, so his friends too and they wish to downgrade the hardwork .\nTara Sutaria is good in first half, doesn't get much to do in the later stages.\nStoryline and dialogues could have seen some improvement, but for Tiger, Good to watch movie.",
            "review_date": "2019-09-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste",
            "content": "After watching this movie, i felt guilty for watching this movie. total tatti performance by strugglers.",
            "review_date": "2020-10-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Karan johar should stop making moviea",
            "content": "There was no option for giving zero rating to this pathetic useless waste of time movie...",
            "review_date": "2020-07-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever",
            "content": "It is a very rear film in which students fly.tiger Shroff is literally jumping from one terrace to another terrace means are we morons completly no story nothing.\nTalking about acting tiger Shroff was average to him I will give 5/10\nTalking about ananya,omg I will kill myself her overacting literally sucks.i have an idea if any kid doesn't want to sleep then show them Ananya's acting even they will sleep quickly\nTo her I will give 0/10\nTalking about tara, she was fabulous her acting, dance, grace was just perfect she is our next superstar.\nTo her I will give 9/10 as there is always a scoop for improvement 😊😊If you have to watch the movie then watch it for tara sutaria or else stay away.",
            "review_date": "2020-08-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Underrated!",
            "content": "It's not that much bad movie. If you liked first part then trust me you can enjoy this movie for a time.",
            "review_date": "2019-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "garbage movie garbage actor",
            "content": "Even 1star is more for these movie worst movies ever.",
            "review_date": "2021-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Punit Malhotra should retire",
            "content": "Picture is awesome,only direction of Punit Malhotra is the worst. He ruined the whole picture.",
            "review_date": "2019-09-02",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "This movie is a mess",
            "content": "Everything about this movie is so pointless newcomers didn't get the time to learn acting skills from their godfather and the star tiger Shroff has ruined his career by choosing this movie",
            "review_date": "2020-11-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just waste of money",
            "content": "Very bad movie to watch.poor acting from actors they didn't use good concept inspire of watching this sh**.I would like to watch old episodes of tmkoc",
            "review_date": "2020-06-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time",
            "content": "Not better then the first one, but atleast it has a story. Bad acting, unrealistic situations in the story, full of first-world problems. Better go and sleep at home than to waste your time and money at theater.",
            "review_date": "2019-06-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worth to watch",
            "content": "It was fun and entertaining movie.Strong dances and beautiful locations.Overall time pass movie",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dumb",
            "content": "Dumbest movie ever...these indian movies have no standards",
            "review_date": "2019-05-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "STOP IT!! By far the most cringiest movie I have ever seen.",
            "content": "Tiger shroff acting 4.5\nTara Suraria acting 4.5\nAnanya Pandey acting 2.5\nSupporting cast acting 1.5Disgusted!!! Everything about this movie is so bad. This director should never be aloud to make another movie ever again. What was Karan Johar thinking producing this movie. The reason people relate him to nepotism is because of these situations. Supporting Tiger and Ananya because they are celebrities kids is what nepotism is about. Karan needs to start producing new actors/actresses who aren't already privileged. I've seen a lot of tiger shroff movies. He just doesn't have the lead actor persona. But becuase he is the son of Jackie shroff he gets and demands that respect which is also nepotism. In Hollywood you don't have that happening because actors are respected becuase of their talent. Tiger has given flop after flop and he's still doing lead roles because of this nepotism in Bollywood. It's not that Tiger doesn't have any talent. Tigers dancing and physique are amazing. He definitely worked hard on both and his talent as a dancer is one of the highest level in Bollywood. If he continues acting I think he should consider doing supporting roles. The casting was bad. But then again everything was bad.Not recommended!!!!!",
            "review_date": "2022-09-25",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Couldnt wait till interval",
            "content": "I couldnt wait for the interval because i wanted to get out of this cliche movie so bad.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Another terrible attack on box office",
            "content": "If possible l should have given it zero rating but IMDb does not provide this facility .",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Matlb kuch bhi",
            "content": "Don't watch this garbage.👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dont let Kangana keep you from plain old entertainment",
            "content": "Since the influx of Netflix and other streaming services from abroad, the wannabe Indian millennial thinks theyre way above Bollywood romcoms.Add to that Kangana's attack on the industry when she herself is in it because of nepotism. Pancholi is an insider and she not only \"befriended\" him she had an affair with him in his house in front of his wife. Shows character.Karan and other insiders don't badmouth her she does- which shows her classless personality. You may not believe Hrithik Roshan at all, but believe the pages of the passport put up by the authorities which did not have the Paris / Schengen visa where HR apparently proposed to psychopath.In today's day and age if someone was dating anyone a) there'd be pictures and kangy Didnt have any and b) at least one paparazzi picture would have been shot given they are stars.To think she's more talented than alia is such a joke but people relate to kangana more because the average Person is always blaming the richer and better looking person for their own failure.Nepotism isn't just rich insiders helping rich insiders its every common man who asks his or her friend to forward their CV or who sleep their way to the top. The quota system is the biggest government supported nepotistic drive which no one talks about. Merit is rare anywhere and we the common people suffer when we get bad service and I have suffered with the quota system at hospitals and in law courts.Abhishek Bachchan and Uday Chopra are the biggest failures so at the end of the day your name can only get you in the door but your success rides on the success of the movie and your acting. In real life jobs irrespective of your failure to deliver you can go on working way past your retirement if you're in the government or an old employee of a private company. Unlike 9-5 desk jobs , the movie industry is not a traditional job and it's a business so in any business the father will want their kid to try their hand out so what's wrong with that?\nOnly outsiders have thrived and become insiders - and think of any big movie personality now they were all outsiders.Ok gyaan session over -Like we have a diet that differs everyday - one day we want ghar ka khana, the next pizza and the day after, some complex dish- similarly my movie diet is varied. When I want Ghar ka khana I'll watch a Wednesday or a Sarfarosh because it comforts me that Bollywood can write scripts. When i want a complex Movie I'll watch an andhadhun or drishyam. But when I want pizza , when I want to hang out with my friends and enjoy teenage pop culture - I'll go for movies like SOTY 2.We can't compare the genres.When it comes to SOTY 2- it was better than SOTY 1.\nIn SOTY 1 I didn't even sit up and watch the actors. Alia was actually launched in Highway, Varun in Badlapur and Sid is always a nice screen presence.\nIn SOTY 2 I sat up and saw Ananya Pandey- she's funny and grounded off screen and really impressed me for her first movie which even my favourite Alia did not with SOTY 1.The movie is bubblegum on crack but very entertaining. I prefer modern students strutting around in sports bras that they chose to wear , than \"authentic\" directors adding item songs in their films to grab the audience by the balls.Ananya's character Shreya is my favourite. Once you see the whole film, you understand why she is the way she is. The dignity cup feels like Diet Olympics. The sets and design are a masterpiece. Especially the classroom set in the Jawaani song - loved the chalk scribbles backlit floor and walls and fluorescent post it notes. Also loved the Mondrian inspired white and yellow wall in one song.Loved the music in Ananya's solos - they were some English lyrics but they are not officially a part of the OST .Did not like the screenplay at all. It was very clunky.Tiger is a tiger as always but I prefer him in Action movies than in romcoms.The other actors were forgettable and Tara Sutaria is the bimbo combination of all the 3 young actors from Mohabattein. Expressionless and annoying AF.Karan too has evolved from casting only stars to casting newcomers and this movie had no big names. I think it should work in cities and if it crosses 85 crores and I don't see why it should not- it will be called a hit and I want a bonafide hit for him. Kangana hasn't delivered in anything except Gangster fashion and Queen and the script gave her national awards not her personality and definitely not her acting as she is very replaceable.Amitabh Bachchan and Jaya Bachchan, kiron kher- they are better actors than Kangy and AB has national awards too- he is humble and has worked with Karan and no one in the industry badmouths anyone. That may be fake but it is classy to stand together in unity - which is not something Indians understand. Definitely something Kangy understands. Give her a mic and she will go on a rampage and Indians will clap.There is a lot of emphasis on coming of age and team spirit in SOTY2. Loved that they made kabaddi the main sport instead of boring cricket. It was Nice to see some Indian sports getting recognition.The class divide is believable and I loved the DIY scenes where Tiger makes his own cool as hell wardrobe. Which is a big step from Sid's poor background in SOTY 2 as he enters school in Ray bans. It wasn't unrealistic to me even then because to fit in, in this EMI age, even the most basic person Splashes out. But here, tiger is shown as a commoner who is not insecure like his rich or poor classmates and does not want to fit in. He owns who he is and that is the strength of his character.The competition goes inter college between 8 colleges and the competition itself was very entertaining. There are 2 \"study\" scenes but I don't like to dissect everything- this isn't a Inception.Sure the movie has its flaws because romcoms inherently do. But there are days you want avengers end game quality(which India is Incapable of but The Krish series is amazing) and there are days you want to just get entertained and not in a sleazy double meaning kind of way- then SOTY 2 is the movie.Hated the OST but the camera work in all the songs was amazing. Costumes were amazing too. Movies are purely fictional so reviewers picking apart the not a hair out of place blowdries , the fancy cars the campus - they need a life. There are many girls who doll up for school and college. There are many rich kids who come in fancy cars but it's driven by drivers in India. And larger than small cities campuses prettier than Kjos campus, exist in the real world where Harvard and Oxford have their own cities inside the university towns they're in.When Harry Met Sejal is the worst movie to exist, but people went for it anyway. Why? Because it wasn't made by Karan Johar so Kangana wasn't after it. She hadnt brainwashed the scandal loving janta. If you count your pennies that it is such a waste of money etc to go for Bollywood movies then movie theatres aren't for you.stick to Netflix.This is a fun movie. Try to have fun people.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bollywood's most pathetic movie!!!!",
            "content": "If you want to waste your money and time then please watch this movie. The movie doesn't have script, romance, action, drama and masala. It is so boring that you will wait for the interval to come. This movie is not even worth of half star, but it seems there are some critics who are paid to rate this movie 2star or 3star. Last year we had movies like andhadhun, badhai ho and in the start of the year we had uri and kesari which were worth watching and then we have this super duper flop movie. Such directors and actors should be banned who are behind such pathetic movie. We should definatley boycot such movies and not motivate such movie, sometimes I feel kangana was right on nepotism.Please avoid this movie in any cause.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Request Not To Waste Your Money For This Garbage",
            "content": "If I could I would have given the rating in minus. Worst movie full of overacting and script writer wrote a crap. Go watch endgame again if you want to spend your money this weekend.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ye toh TATTI H",
            "content": "Plz don't watch it to waste your precious time instead watch doremon",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Weak predictable plot with noting in the movie",
            "content": "I showed this movie to my 2000 rupess note it is 1 rupee coin now. Beware: It's such a good movie that it has spoilers of Marvel-DC epic crossover.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bakwas movie",
            "content": "Dear producer, director, actors, writers, its my humble request to give money back, who watched this movie, its totally time wasteNothing in the movie I can see as per story line, infact no story at all, you can't make audience fool.Its humble request to all please don't ever try to watch this movie, otherwise you will have a serious headache pain for several days, and you will think Everytime why did you watch the movie?",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ananya Panday",
            "content": "Movie is not that good but really enjoyed watching Ananya Panday. That's she who made me watch whole movie without getting bored.",
            "review_date": "2019-06-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Support good cinema over this crap",
            "content": "Please don't waste your time watching this unrealistic crap of nepotism. Nothing looks logical or real in this fairytale of star kids.\nBetter watch Kota factory by TVF and support the real talent and quality work. That show actually shows the real problems of Indian students unlike this garbage.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Honestly, not that bad!",
            "content": "Feels like all the negative reviews have been influenced by the outburst towards nepotism in the film industry. To be very honest, Ananya Pandey and Tiger Shroff were pretty good in the movie; however, Tara Sutaria was mediocre (not a product of the industry). All in all, it's a typical no-brainer Bollywood drama. Not great but not that bad either.",
            "review_date": "2019-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "1 word , it is 💩💩💩💩",
            "content": "Don't watch. totally waste of time. save your money and time for watching another best movie kabir shing",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of money.",
            "content": "I would give ratings in minus if there's an option. So crap movie.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not too bad.",
            "content": "This movie isn't so bad to get these much hate...\nDirector should have picked another better hero instead of tiger shroff.",
            "review_date": "2020-07-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Forgettable movie dont watch",
            "content": "The movie has been made to launch some of the celebrity child of bollywood. They can not come out of the utopia zone. We read a story during our childhood in which there is a giant who took some kids in a garden. This garden is full of toffee, chocolate, eclairs and every bad habit which the child enjoys. Those child grows fat, lazy. This movie is for those child only. The producer of the movie i.e. Karan Johar is brilliant but i don't understand why he makes such stupid movies.",
            "review_date": "2020-09-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bollywood movies standard are going down",
            "content": "What Bollywood think if they hire beautiful actresses without good story thier movie will get hit.Student of the Year part 1 is far better than this",
            "review_date": "2019-08-28",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "nop!!!",
            "content": "Chi chi, paisa barbaad, waste of money tiger, you can do better than this",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the year",
            "content": "Time to stop supporting moving like this\nSouth Indian movies are far better with good script",
            "review_date": "2019-05-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good Mindless Entertainment",
            "content": "Pros -\nSongs\nBackground music\nTiger and Ananya\nSubtle comedy\nBlur boundaries of villainCons-\nStory and suspense during game could have been better.",
            "review_date": "2019-08-31",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie in the history of Mankind!",
            "content": "This movie is so bad, after half an hour I got up and left. There's half hour of my life I am never getting back. There is no acting, I don't know why would they even bother to make this kind of movies. I can't give this movie below 1 because there is no rating below 1.",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Dont watch this tatti",
            "content": "Nothing to see.Please donate for orissa relief fund,atleast that will give you a bit of satisfaction instead of wasting money on this stupid nepotism laden movie.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Qtiyapa of the year 2 (After Kalank)",
            "content": "On the most unrealistic movie ever made. Even the most worthless people wont dare watching this movie.\nPlease donate your ticket for noble cause , rather than wasting upon a nuisance . Shows the Regressive India filled with Nepotism.!",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Can I give zero stars?",
            "content": "IMDb- feature request. Please add an option to give zero stars or take off stars from a movie's rating. The only good thing was will smith and but was too brief for me to consider any more stars, I wish he was there longer. Only actor I liked a little bit was Manav(the name of the character for the guy who played ananya's brother). All other leads are Meh! And I thought Kalank was Karan Johar's lowest point (lol)",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "not that bad",
            "content": "It was meant to be a popcorn-have fun kind of movie and it was,just don't hate because it had starkids.Tara can't act at all,Ananya still makes you feel for her,Tiger is good at what he does,Beniwal was funny as usual.",
            "review_date": "2019-08-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good job hair stylist and dress designer",
            "content": "Very nice dresses, extremely short. I felt happy. Tiger tara and ananya. BEST IN WORLD. So much hotness that my AC stopped working. Movie was mind blowing. Script was even more mind blowing. It blew my mind so much that I wont be requiring a blow dryer. Ananya's shorts were smaller than desi people's mentality. That one Clíp of Alia made my heart beat faster than Tiger's run. Tara's dresses were shorter than my banyain and I loved every bit of it.",
            "review_date": "2019-06-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst",
            "content": "Worst,bad ,not good, waste if time and money\nBad acting worst direction,bad screenplay",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please come back to reality",
            "content": "1 star for all actors, 1 star for all other support staff.Barely 5% shown is reality, rest all is fake. Using money and fancy life, to lure people will continue gifting failure for such productions. I feel sorry for actors who participate in such films.",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Full of Entertainment and Masala",
            "content": "This is a fantastic movie, even better than part 1 and also a pleasant refresher of Jo Jeeta wohi sikander .Must watch for all age groups.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nepotism Products",
            "content": "If you want to live for hundreds of year then dont watch the this flim... After watching u may feel uneasy..very low level acting..... And if u wish to watch it then please consult a doctor and have medical checkup.. Might save your life..",
            "review_date": "2021-05-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Ouch!!!",
            "content": "Nothing but dharamatisation of the earlier dharmatised SOTY.\nThe earlier movie was bearable owing to its soundtrack and the actors performances with Alia doing every bit to absorb the roles, this part was especially missing in this one.\nVerdict : Don't spend your hard earned money!",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Entertaining movie.",
            "content": "Humor was good. Story was predictable but not boring. Overall a good entertaining movie.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of all time! Congratulations. You got it.",
            "content": "Wanna rate this movie 'a minus'. But that's not possible. IMDB please add this kind of options. I hate this movie. What a nonsense movie! Bollywood is junk and so this kinds of movies are. And also this kind of requirements in this review option. How can I describe this junk movie into six hundreds letters. It is enough a one word consists of four letter. And the word is 'junk'. I can also describe it as a waste product of Karan Johar. He is a... tut tut tut. I can't also describe it in words. And see what, after all these nonsense writings now it is left fifty lettes more. Thats quite impressive. Finally I can finish this review. 😁 Extraordinary me!",
            "review_date": "2023-01-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of money and time",
            "content": "Waste of money and time,.......\nTry to save money by simply avoiding to watch...\nKjo at his worst ....",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What was I thinking?",
            "content": "I had nothing to do on a weekend and decided to watch this movie. I will mourn the 2 hours I've lost for a long long time.",
            "review_date": "2019-09-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not even worth 1 🌟",
            "content": "It's completely garbage wrapped in marble paper. Absolutely waste of money and resources.... pathetic story, awful acting, people shouldn't be allowed to make such crap..",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst of the worst",
            "content": "In this movie you can see the level of stupidity of directors",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie",
            "content": "Such a shame for spreading nepotism with such bad movies.",
            "review_date": "2019-10-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever repeat the same story again...",
            "content": "Go and watch ..\nEndgame\nDetective pikachu\nBlank\nThese movies are far better den soty2",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cool concept (teen base)",
            "content": "I think ratings must be higher than current ratings ..",
            "review_date": "2019-09-03",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "THE WORST",
            "content": "Worst movie in the history of bollywood cinema. No story. No plot. No acting. Only fake glamour.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Very bad movie",
            "content": "Dont waste your time plz plz plz plzz dont watch this movie..",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "I am looking for a 00 RATING!",
            "content": "Dont waste your time and money on it.\nTypical love story with nepotism.",
            "review_date": "2019-08-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One of the worst movies ever made",
            "content": "Left the teatre after first half. This movie was a torture for my brain. Why cannot bollywood make good movies with actors that can actually act?",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Should stop making movies like these",
            "content": "Cringe and illogical. Doesn't make any sense. Worst script",
            "review_date": "2019-05-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "kachray ko bhi zyaaaada vote miely gay!!!!",
            "content": "Just one word for this movie = worst of the worst movie ever made\nDon't even try to watch it.",
            "review_date": "2019-06-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Covid-19 of bollywood",
            "content": "Tiger shroff is the worst thing that happened to bollywood. He is the covid virus. No acting skill, no talent only body and a golden spoon in mouth courtesy of his father.",
            "review_date": "2021-08-04",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Whole movie is completed in trailer.",
            "content": "Do not waste money to watch this movie. Bollywood becomes garbage due to these type of movies.",
            "review_date": "2019-05-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not that much bad as reviewed",
            "content": "Surely One time watch... Will not be bored... Enjoy",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Say no to nepotism",
            "content": "Ananya birla should stick with her underrated talent of touching nose by tounge.. tiger is excellent in the movie with his as usual cleavage show off. Tara who d f sutaria , no one gives a damn. Overall all hail to karan trans johar for creating this masterpiece and creating a record of 1.7 imdb by defeating the likes of avengers and avatar.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Its kalank on kalank itself",
            "content": "Pure nepotism and completely unreal story line, Tiger who should've been a stuntsman is an actor in this movie. His acting is absolute trash,zero expressions on his face, anyone can easily say that he isn't even fit to be called an actor.",
            "review_date": "2019-06-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Watch at your own risk",
            "content": "I think IMDB should come up with zero star rating. This movie does'nt even deserve one star.",
            "review_date": "2019-05-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not good as expected",
            "content": "Tiger and Tara are not students\nAnanya is looking good as student\nMovie script is really crap\nVarun and Abhi and shaneya were really looking like students somehowOverall :: not worth to watch it on cinema",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Better than SOTY 1",
            "content": "I dont know why there are so many bad reviews. i just saw this movie today.\ni Agree there was no deep story in here. story was about a guy(Rohan - Hero) who had a goal to get his girlfriend so he joined her collage but they kicked him out because the rich guy doesnt like defeat. and Hero was betrayed by the girlfriend. so he went back to his old school to show who can be the student of the year. Obviously thats the title \"Student of the year\" he did everything he can in every academic activity to show he is the student of the year...so i dont know what other story is everyone expecting from the title \"student of the year\"in my opinion, its not a bad movie, a good entertainer.\nLove for the girl he chose at the end - didnt show much chemistry between them on the screen.\nTIger - compared to all his movies he acted much much better. looking back from Heropanti to this movie and baagi 2.....He came long way. i dont think its fair for you to put down someone who came this far.\nBoth girls - did a fair acting.\ni dont think anyone did bad acting in this movie.,",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Just a movie to launch two new faces in bollywood by the flag bearer of nepotism karan johar",
            "content": "Same old story,just filled with songs and bad acting",
            "review_date": "2019-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Feeling sad for Will",
            "content": "Will Smith , yes the man himself appears in this movie. Why Will?\nHagu movie hai.",
            "review_date": "2019-09-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Osm movie there is fun action dance everything in this movie",
            "content": "Fun action comedy and dance everything is good in this movie",
            "review_date": "2019-06-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Absolutely bad",
            "content": "The movie is just filled with dancing. It probably has more dancing than ABCD.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Boggus",
            "content": "Third class movie qs well as third class acting...",
            "review_date": "2020-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Fantastic film",
            "content": "I watched this with friends expecting this to be terrible as all the reviews were bad and it had a low rating. After watching it, I was pleasantly surprised of how good the movie was. I enjoyed every second of it. The acting was really good, the visuals were stunning, the storyline was cliché but it was still good. The dancing was questionable at points but it doesn't take away from the overall effect this movie had. It gave off a good message to follow your own dreams rather than following someone else's and putting them first. Near the end, this realization made a huge difference as the outcome was magnificent. The action scenes were filled with thrill and action. The character Rohan had a very nice body and it was fun to stare at throughout the movie.",
            "review_date": "2021-02-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Sad",
            "content": "Sad try from Karan Johar for launching products of nepotism",
            "review_date": "2020-06-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Pure Tatti",
            "content": "This is the best example of delivering Tatti in the form of movies.",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "What were you expecting?",
            "content": "I am not sure about the flak this movie finds itself sorrounded with? What were you expecting? Ripped bodies, branded clothes, flashy cars are supposed to be the order of the day when you walk into a cinema theatre showing KJo's production. Yes, the plot was cliched but that has never been Kjo's unique selling point anyway. It has been and still is glamor. I found the movie entertaining because because of the glamorous visuals. Perhaps the audience needs to temper their expectations with respect to logic in the story. KJo has never indicated that the movie will be a scientific breakthrough!",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Didn't like the movie at all",
            "content": "Tiger Shroff is gud but script is poor. also new actresses Tara and ananya are poor. Punit Malhotra second film I watched after I hate luv story. And this is worse than that.",
            "review_date": "2019-06-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "AAh-MAiZING♥",
            "content": "I didnt see this movie because of all those movie reviewers. guys, why did you ruined this movie by saying its that bad? even good movie reviewers i trusted lied! o watched twice and still i loved it. this movie is so realistic, funny, romantic. its not at all a plastic world! i really thought none of those actress cant act because i saw one review! chankis daugher was a mindblowing dream girl. the other one was annoying and portrayed her charecter perfectly. tigers dance was necessary for this movie and he was to doe for! another guy and every other charecter was new and refreshin. how you hated this guys? music and dance and clothes were like, i was in it! girls, get yourself a Ronan if your into pure truelove. im glad they have worked so hard and i have got to see this in quarantine ♥",
            "review_date": "2020-05-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "waste of time",
            "content": "No acting .....no story.... only waste of money and time.",
            "review_date": "2019-07-09",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Utter nonsense",
            "content": "Made Soty 1 look like a good movie which was waqt hamaara hai reloaded .",
            "review_date": "2019-05-19",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Please define star kid",
            "content": "Frankly, except Tiger...there is no star kid in the movie. Miss Pandey is as \"Star Kid\" as Sooraj Pancholi. Seriously I get the idea of launching kids with Bollywood DNA....but be aware as much as lot of capabilities are inherited....and we know the capabilities of the so called star kids..Have patience and keep working on your skils.",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "don't believe on haters",
            "content": "I Don't know why people are hating this wonderful movie with a good story. If you are soty 1 lover you should go to watch this movie",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Students",
            "content": "I Liked the story !! Actually i loved these cuties girls ! Their beginning is good",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "TIGER SHROFF fans😎",
            "content": "Tiger shroff bro rocked with his dance and stunts as always he... I can't rate it even a bit lower as I am a die hard fan of Tiger shroff... But it worths for 5/10. Both Debut actress are poorest in acting... Don't criticize them as they are new to the industry... Do encourage the whole team, especially lovable and industrious Tiger shroff.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bollywood nepotism",
            "content": "Worst movie all time no acting and even worst story. The movie only has dance and action. Over all the movie is very very worst",
            "review_date": "2019-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Not as bad as the ratings are given",
            "content": "Enjoyed the movie . Not the best but not as bad as the ratings here . Aditya Seal and Ananya Pandey were strong performances in the movie . Tiger and Tara did well .",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Cringe source...",
            "content": "The story line was predictable and very cheesy. Tiger's dance was good and the general acting was okay, but Karan Johar has really done it this time. The songs were also not too good.",
            "review_date": "2019-05-20",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Disappointed",
            "content": "This movie will win the title of \"Worst movie of all time\" period !",
            "review_date": "2019-05-22",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It is an Okay Film, Nothing Great",
            "content": "Just watched this movie with my friends, It is not so great. When i watched the trailer itself i was not very satisfied. There were a lot of scenes cut of like the Indian Function, Ananya and Tiger on the roof of the College etc. You can expect a lot of fight scenes, Which is not really needed, I mean who has such brutal fights in collages and as usual Tiger Shroff was like a stuntman. Ananya and Tara acted really well. Their clothes were not something that students would wear to a college. The love story part of it was very confusing and the movie was focused way more on Tiger than anything else. There was a little reality in the movie. The songs are very catchy and nice tho, and there were some very funny scenes. It does portray more of friendship and gives a hint of rivalry, class, standard etc. The original SOTY was better than this. The movie made little sense and this movie is better for people 13 years and above. Overall i felt this movie was overrated. Kudos to Tara and Ananya.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Waste of time",
            "content": "Believe it or not they made it worst than the 1st one.\nLiterally none of them can act, the script makes no sense whatsoever, I'm angry that I spent precious time to watch this.",
            "review_date": "2020-07-08",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "DON'T MIND THE DUMB PEOPLE WHO ARE GIVING 1 STAR",
            "content": "Honestly this movie is what it should be. It's a student* movie for God's sake. I really don't know wtf others were thinking how this movie should be. THIS MOVIE IS A MUST WATCH. It gives you school/college vibes. I'll recommend you all to watch it unless you want some mature stuff. Kindly read the word *Student* in the movie name and then give your views. :)",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Give Honest Review!",
            "content": "I really need to know, Is This movie really bad or its the haters that are reviewing bad because they hate Tiger Shroff..?",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nice enjoyable movie",
            "content": "Not sure why all the hate .I found the movie very enjoyable .who cares if they are star kids or not ,they do as good a job as non star kids .anyway I liked the movie a lot .Ananya stole the show I think .",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Amazing",
            "content": "This movie was really great abd I have even rewatch it over 3 time",
            "review_date": "2021-01-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "MasterClaSS From TiGer",
            "content": "MayBe The Motive and scene of the story is same as Part 1 but I will Give 8 out 10 for the action,Drama and for the story of the movie ..Regret all the Negative Reviews ...and WatcH the Movie as it is loaded with full of fun ...",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "In my opinion",
            "content": "That's perfect 👌. It was so romantic,comedy with a good story\nThis film had Two beautiful girls and attractive Indian dance.",
            "review_date": "2019-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Really fun movie to watch with friends",
            "content": "So a couple of my friends had come over and we were at a loss of ideas to pass time and while searching on prime video came across this title.\nWe started watching the movie as a joke but eventually we all started enjoying it! We were obviously passing comments throughout the movie and really loved the way we could pass time. So seriously I wouldn't give it a low rating but a solid 8. Go for it if you also have friends who would add on to the movie flavour with hilarious comments XD",
            "review_date": "2019-10-21",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Entertaining one",
            "content": "I dont know why people are giving so much hate to the movie beacuse the movie is entertaining and good for one time watch it is not as bad as other ppeoples are saying about it ananya pande is very good in her role and tara also acts well tiger shroff is doing the same as he does in all her movie but good to watch on screen",
            "review_date": "2019-05-13",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Great movie",
            "content": "Movie made me feel motivated.\nAnd Love You ananya.",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Its entertaining!",
            "content": "Its really disheartening to see people revolt so much against this movie. Its actually entertaining, Tiger and Ananya have acted really well. Even Tara Sutaria has done a good job. But Ananya Pandey is going to be one big star very soon! Sone scenes with Tiger and his friend gang are so hilarious that the entire hall was in splits! The songs are amazing!",
            "review_date": "2019-06-01",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Movie is Awesome",
            "content": "I like this movie & I like Both Actresses Acting, also tiger sharoff acting I like",
            "review_date": "2019-11-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "PLEASE REFUND MY MONEY",
            "content": "No story No acting.. The only positive of the film was Ananya Pandey 🌠",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Loved the movie..full of fantasy",
            "content": "Fantasy is fun.\nReality we always see in real life.\nFor entertainment fantasy is the best thing to keep mind light.\nKJ keep making movies.",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "You will stop watching it after half hour",
            "content": "I just watched for 30 minutes and felt so depressed about the Bollywood industry and their repeated stories movies",
            "review_date": "2019-08-30",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Loved the film - Full Entertainment & Must watch",
            "content": "A complete different story and no connection to Part 1 of the student of the year.Full Paisa wasool and Entertainment just enjoyed this film.Everyone should watch this. It's awesome",
            "review_date": "2019-05-10",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good movie",
            "content": "Tiger Shroff is really good in the movie. Don't know why people are giving only one star. I had already booked tickets 3 days back. So I gone though the reviews and thought that it will be a disaster. In reality, movie is not bad at all and is really entertaining. I will recommend people to watch it once.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good movie",
            "content": "This movie was better then the First one but they could've made it better . I had fun time watching the movie . All the actors did a good job. I suggest you to watch the movie yourself I'm sure you will have a good time watching it",
            "review_date": "2019-05-14",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nice one movie of 2019 my hero is tiger shroff",
            "content": "Nice one movie of 2019 my hero is tiger shroff I am big fan of you",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Great CV for freshers in bollywood entry, but pathetic movie",
            "content": "Student of the year 2 review :This movie is nothing but the curriculum vitae of the freshers who are looking for a job in the film industry..Tiger Shroff is marvellous and he is doing actions or dance in most of the frames and he does his job pretty well.\nActresses have gotten dance sequences , romance sequences , emotional scenes , frowns, comedy .. basically they have shown they can pull of any scene.. and if you have seen Student of the year part 1, then you realise these girls are far better than Alia as a fresher..With absolutely no story.. scenes are made up just to show games or dance sequences.. the young generation won't be disappointed with the movie.. ( basically target audience)I enjoyed Tiger Shroff's part only. He is such a talent. I hope one day he gets his due in Bollywood.",
            "review_date": "2019-08-29",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Trash!",
            "content": "This movie is trash! Don't waste your time watching it!",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Good movie",
            "content": "I do not know why people dislike this movie. This is really a good movie to watch.",
            "review_date": "2019-05-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Nice Movie, don't compare with SOTY1",
            "content": "Superb sets nice music costumes , Tara Ananya Rock's, Tiger in fresh role, scrip story gud,",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Humble request",
            "content": "I Humbly request imdb to apply new rating syatem from -10 to 10 so that movies like this can have justified rating as 1star us not just enough -6 is its actual worth",
            "review_date": "2019-05-16",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Everyone in my home like it",
            "content": "It is an emotional movie for kids\nI like it because I have not seen student of the year",
            "review_date": "2020-05-06",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "BORING",
            "content": "TTER WASTE OF TIME . well what was I expecting, this movie had tiger sheroff in it so maybe some action but no ! waste of time and energy . had to fight with sleep so as to watch the whole movie.",
            "review_date": "2019-05-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Worst movie of the year 2",
            "content": "Please don't watch even if free...it's comedy scenes look like they are made for kids 10 year or less..I was searching who is the director to write some advice..and Karan Johar he is lost...",
            "review_date": "2019-08-26",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Bad Ending....Climax was wishy-washy.",
            "content": "Expected a better movie...But bad direction, acting, story made it a 1 rating.",
            "review_date": "2019-08-27",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Total Garbage",
            "content": "I only watched the kabbadi scene, that is enough for deciding the quality of the movie.",
            "review_date": "2019-09-17",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "One of the worst movies of this century.",
            "content": "Forgetting the 300 bucks I wasted to watch this piece of nonsense, I believe movies like this just should not be allowed to be played on theaters.In a country where most of the population are already dumb, pictures like this just tops it all.Deserves 0/10.",
            "review_date": "2019-10-11",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Brilliant acting, that Kabbadi game was just a treat to my eyes",
            "content": "Hmmm, my friend Govind is watching this movie in 1080p resolution he is loving it. He loved it. Such a great movie thank you for not wasting the time....",
            "review_date": "2020-06-24",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Still better than the first one",
            "content": "Average movie. Definitely deserves 4/5 stars at least. 2 new comers acted very well. From my personal view it is better than Student Of The Year (2012)",
            "review_date": "2019-05-18",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "It's not that bad.",
            "content": "It's not that bad actually. You can enjoy it.\nDoes this review contain spoilers?\nYes\nDoes this review contain spoilers?\nYesDoes this review contain spoilers?\nYes",
            "review_date": "2019-05-12",
            "source": "imdb",
            "lang": "en"
        },
        {
            "review_title": "Entertainment entertainment entertainment",
            "content": "Pure entertainer masala movie kjo style. I didn't get bored at any point in this movie except 2 songs otherwise it's a great fun.",
            "review_date": "2021-03-15",
            "source": "imdb",
            "lang": "en"
        },
        {
            "content": "In my opinion SOTY 2 is the best because if also the movie is not up to the mark for most of the viewers, it has produced two most gorgeous actresses I've ever seen till now... ❤️❤️ I really love Tara Sutaria! 💫💕 I'm a die hard fan of her talent 🎶👏🏽🙌🏽👌🏽👌🏽and Ananya Panday is also very cute and beautiful.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a comedy movie with nothing funny not a good humor, I don't laugh at any single scene, this is my life's worst experience if there is a rating of 0 stars then I should preferred that rating because this movie deserve this.",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a trash movie with no connection to reality. Movies like these make kids dumb these days.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only The Silly Tiger Shroff Fan's Can Watch This Torture..... It's A Complete Disappointment For All People.... The Worsted Movie I Ever Seen, No Sense, Complete Torture, We Can't Watch This Movie For Any Perpose, I Become Shocked If Any One Even Watch This Torture For Only One Minute Also, 0% Of Comedy Only A Sense Less Person Can Laugh At This Jokes, No Humour And Full Of Over Acting 🤬🤬🤬",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was great! My friends and I enjoyed watching it together. I 100% recommend it.",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this movie I want to take Suicide never experienced such type of terrible movie even this movie is not make any sense it's a total time waste movie we can't see this movie not for critically and also not for entertainment purposes.\nSpecial request to all movie maker never make such type of movies it's a huge request to all",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie should never been made since it's such a trash movie.",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impossible to finish. I applaud the brave people who sat through this tasteless work at the theatre",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from being a completely unnecessary sequel, \"Student of the Year 2\" is just a plain bad movie in many ways. The story feels completely uninspired and the movie is devoid of any real heart and soul the first movie had. The first movie is far from a great movie, but I still found some enjoyment in it because I liked the characters and was pretty entertained by the premise. This movie just didn't engage me because it lacked any real focus on what it wanted to be about. The characters are paper-thin, and not particularly likable. I will say the one good thing about the movie is that it unintentionally hilarious at times and it felt like something that was so bad it's good in certain moments. Overall, this movie is a poor representation of what Bollywood can be and is mostly a waste of time.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If this is your idea of what high school drama is, god can only help you. \nThis movie turned out to be an even bigger shitshow than I thought, and I had thought the worst. The only reason why anyone could've wanted to watch the movie is because of the immense amount of publication done by the Dharma Group. Tiger Shroff once again went in with the stunts he does everytime, while Ananya Panday and Tara Sutaria were 2 damsels in distress, both in the plot as well as in their acting. Hats off to the producers in making such a disastrous film. Loved it!",
            "review_date": "2020-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched the movie and I believe it's not that bad I guess it's like a college web series kinda thing added with some Karan Johar masala😂 but the still same old hero wala concept hai movie ka, I mean it's a good time pass movie kyunke at least the movie let you feel anticipated whether Tiger would go with Ananya or Tara😂😂\nPlus poori movie me study aur parhai k ilawa sub kuch hai toh fantasy waala sara scene and aisa lagta hai you are watching a dream rather than some real shit😂",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thanks for the beautiful movie :)",
            "review_date": "2019-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie was so good and quality was so fresh",
            "review_date": "2019-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was mildly entertaining as I watched it with a fast-forward button handy. Just wondering though, who saw Punit's past films and thought - someone give this man a bigger budget? With Tiger, the dancing was impressive and the flips same-old, same-old. Tara's character was just shitty, pretty girl gets a total raw deal. And Ananya has spunk, but what sad dancing for a character whose entire ambition in life is to dance.",
            "review_date": "2019-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movie that I ever seen it... Now I thinking that why I watched it why.... Please don't see this movie 🙏🙏🙏",
            "review_date": "2019-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure garbage and waste of time. what else can you expect from KARAN JOHAR, Shittiest director in Bollywood. ",
            "review_date": "2019-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies\n\n\n",
            "review_date": "2019-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything, but Tiger Shroff's dancing is so played out. Try harder dharma productions. Movies like these can make us lose faith in your productions",
            "review_date": "2019-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set a goal and achieve",
            "review_date": "2019-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has nothing new to offer. While the cast & visuals are enticing to the eyes, the movie falls short in story, acting, and a improper misuse of new comers such as Ananya Pandey or Tara Sutaria, who are unfortunately tied down to such characters that have less dialogue more dance numbers. Tiger Shroff excels in his art of gymnastics and dance, yet it's disappointing to see so much potential go towards a movie that does not do his stardom any justice. His acting skills have matured since Heropanti, but he still has a long way to go. Overall, I was not as invested in this one as the first installment of SOTY",
            "review_date": "2019-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth seeing for Tiger Shroff's pecs alone.",
            "review_date": "2019-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the only thing i would love in the movie would be tara but tbh ananya was the only thing among the lead actors which made me happy and the supporting cast which gave us some laughs!",
            "review_date": "2019-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too torturing to watch in theaters...probably the worst nightmare",
            "review_date": "2019-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These kind of movies degrade Bollywood",
            "review_date": "2019-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste ur money on this movie",
            "review_date": "2019-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rubbish movie. No movie plot.the actresses are useless.  The negative character has a much better role than the other two actresses. Useless movie.",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there is a student of the year 1 lol ",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best movie, energetic, young romance and game challenges. good entertainment. ",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bullshit movie..stop wasting your time",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very....good movie and im am also a great fan of tiger Shroff .songs and acting was very good ,I just want little bit of long ending only nothing else",
            "review_date": "2019-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the year",
            "review_date": "2019-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was a good movie. some of the acting was a little cheesy, but overall okay. the incorporation of kabbadi as an underlying theme behind the dancing struck a nice balance. the male lead roles exhibited much athleticism, albeit less than top-notch acting. the dynamics of shreya's character (ananya pandey) is the true heart of this movie.",
            "review_date": "2019-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining!! The songs are excellent. Tiger Shroff and Ananya Panday stand out. Don't expect too much, just relax and enjoy the movie.",
            "review_date": "2019-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garbage movie made by, one of the unrealistic and worst director of India Karan Johar. Actually the biggest garbage is he himself.",
            "review_date": "2019-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie ever just dance and nothing else",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Good romantic-action-drama.After watching the movie \"Baaghi\" i started to kinda like Bollywood movie, so i try some of them on Netflix.They are different , in a good way: with a mix of romance, actions, stunts and dance.\nEntertaining.Good romantic-action-drama.After watching the movie \"Baaghi\" i started to kinda like Bollywood movie, so i try some of them on Netflix.They are different , in a good way: with a mix of romance, actions, stunts and dance.Entertaining. Ananya and Tiger are both stunning and work well togheter",
            "review_date": "2021-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nIt's worst movie with no subject and acting. Only tiger's dancing skills is good.",
            "review_date": "2020-07-09",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "rt_rating": 1.9,
    "rt_summary": "A college student faces down school bullies while competing in track and field.",
    "meta_rating": 2.4,
    "meta_summary": "The biggest franchise of Bollywood returns with Student Of The Year 2 starring the incredible Tiger Shroff and introducing - Tara and Ananya. Friendship, sportsmanship, love, companionship - it's all in for the Student Of The Year."
}