{
    "title": "Togo",
    "rating": 7.9,
    "release_date": "2019-12-20",
    "num_reviews": 481,
    "genres": [
        "Adventure",
        "Biography",
        "Drama",
        "History",
        "Family"
    ],
    "summary": "The story of Togo, the sled dog who led the 1925 serum run despite being considered too small and weak to lead such an intense race.",
    "reviews": [
        {
            "review_title": "Amazing story!",
            "content": "What an amazing film/story of this remarkable dog named Togo. I watched this film with my 11 year old daughter and we were both struggling to keep the tears 😭 from falling. At the end my daughter was crying cause it was so touching. A REAL movie to watch!",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic! Absolutely fantastic!!",
            "content": "This is the first time that I think Walt Disney Picture did a great job on this amazing movie. A movie that deserves to be called \"Mission Impossible!\" Willem Dafoe and Julianne Nicholson both are great. The screenplay writer Tom Flynn gave us a straightforward plot, simple but amazing scenario that has made this movie so suspenseful, thrilling, at the same time, profound. Director Ericson Core also won my praise wholeheartedly. The special effects team did a wonder too, many scenes I just couldn't believe possible to make, but they just looked so real and so powerful. The crossing lake scenes are just ridiculously fascinating. The leading dog's performance is just beyond any word could describe, and the poppy that played Togo's younger age would allow you to understand what \"cute\" really means. Willem Dafoe, what a great actor! Julianne Nicholson, her natural talent completely shinning through the whole movie. Every part of this movie is a fulfilled perfection, it also owes to the great casting job, through the lens of the camera, offering you great cinematography, followed by a perfect editing job....The almost impossible mission, the dogs, the great couple and the great town people...all together, have made this movie THE VERY BEST MOVIE at the year end of 2019.Highly recommended!",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A historical correction for true heroes!",
            "content": "The wife and I watched this movie last night and were just blown away.\nThis is the true story of the sled dog team and it's owner who carried the medicine in Alaska to rescue Nome Alaska during he 1925 Diphtheria epidemic.\nIn much worse than normal blizzard conditions, the sled driver risked all to take a shortcut across a thawing body of water, thus saving 90 miles from his trip.\nThe movie reveals how the wrong dog, \"Balto\" was credited with the ordeal...and it is to the Disney studios for making the correction.\nIt reveals how even back then, the press was more eager to \"get the story\" than to \"get the facts\".The wife and I were blessed to have lived for sixteen years with a grey timber wolf...and we understand how an emotional attachment remains long after such a friendship can exist.\nThe acting and photography are perfect and if this film does not go to the Oscars under several categories, then the nominating panel may be as flawed as many are starting to think they are.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good to recognize Togo",
            "content": "...as I've always heard only about Balto, who was commemorated. This is an excellent, heartfelt film, revealing the heroism of the dogs, particularly Togo.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good and involving movie",
            "content": "Greetings from Lithuania.\"Togo\" (2019) was a very good, old school movie. By saying that i mean that it relaid on a story well told, and not special effects. There are good characters in this movie, but true star(s) of this film are dogs. They were amazing - and not CGI made! You do feel the difference.Overall, \"Togo\" was a really involving movie for all its running time. Its was sometimes funny, sometimes sad and always true and very good.",
            "review_date": "2020-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great",
            "content": "Willem Dafoe and a bunch of adorable sled dogs star in this heartwarming, action packed new movie based on a true story... The sequences involving Togo as a mischievous pup are pure magic.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good to go Togo",
            "content": "I admit it, I'm a sentimentalist. I cried like a baby at my own wedding while my wife looked on in bemusement. I weep at favourite songs or pieces of music and shed tears freely at emotionally charged movies. It was my wife's brother who recommended we watch this movie during lockdown and I really should have read the signs. First off it's a Disney movie, secondly it's about a brave dog ...and right from these two facts, I knew I was going to struggle to get through it dry-eyed.And so it proved. With films like this, for me anyway, critical faculties are suspended and you just want it all to end happily so that you don't have to hide your feelings anymore. I do know that Willem Dafoe and Julianne Nicholson were excellent in their parts as the slightly mismatched couple who set up home in the remote, frozen, northernmost part of America. He's the local \"mush-man\" responsible for trekking his team of husky dogs over unforgiving terrain for the benefit of the local community while she provides all the back-up back home he needs for them both to keep their operation going.Comes a catastrophic diphtheria outbreak to the town, especially targeting young children and the need to requisition urgent medical supplies from some 500 miles or so away, but with an impending spell of bad weather knocking out the possible use of aeroplane or rail transport, the only way to go get the job done is for Dafoe and his dog's to undertake a hazardous cross-country trek like no other to collect the vaccines and get them to the hospital to help save the kids' lives.With a storyline given added topicality and piquancy by the devastating Covid-19 virus outbreak, this was a thrilling and moving race against time, taking on the elements and indeed the odds, the effort spearheaded by crusty old Dafoe and his pack, especially Togo the pack-leading dog. Early on we're fed the back story of how Togo came into the couple's possession and how the dog's irrepressible desire to accompany Dafoe on his travels sees him twice unsuccessfully try to offload the dog to new owners, only for Togo to somehow find a way to break free and return back home from whence he came, Finally Dafoe is persuaded by the dog's errr... doggedness, to reluctantly road-test the apparently under-sized dog and eventually concede that its courage and stamina outweigh any physical disadvantages it may have.We see the pack endure unbelievable dangers in their epic mission, Togo literally pulling out all the stops to navigate the team over breaking ice-floes, slog up snow-bound foot-hills and even save the group from certain doom near the end, in a particularly amazing show of love, strength and fortitude by the dog.It's a Disney film so there's probably a fair bit of dramatic licence taken with the story but you'll have a good idea how it ends. The landscapes, making great use of drone shots on-high are frequently eye-catching and there's was a plaintive lonesome-violin soundtrack which further set the scene. I don't know how much of the cinematography was C-Gen assisted but the actions of the dogs and Togo in particular, looked natural to me.Anyway I got through to the end with some dust in my eyes and immediately afterwards felt the need to hug our own dog of over ten years in sympathy and appreciation for what I'd just seen.This one's for you, Flip.",
            "review_date": "2020-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As a person who dislikes dog related films, I loved this.",
            "content": "Togo is the first win for Disney+ (in terms of movies) Togo is a legitimately great film and such a surprise. It is filled with a lot of heart and backed up by a great performance from Dafoe.Willem Dafoe is really great here. Delivering one of his better movies. His relationship with the dogs is done in such a really nice and heartfelt way. That's what makes it better than most dog films. It's a really enjoyable film and by the end it is really touching. That's thanks to them using a brilliant music choice of \"in the nature of daylight\" as well as the bond and development you get between the Dafoe and Togo.I don't really have any major flaws with it. I think it's a great story especially for not being familiar with the true story. The visual effects aren't always top notch but that's understandable due to being a disney original and a not a cinema film.Overall it's a really solid film, and genuinely the best dog film, we might have ever had, it might not be overly sad but it has heart and thats more than I can ask for coming from a dog film.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "He is not a sled dog, he's the lead dog",
            "content": "So let me guess if you have ever been a pet owner, I'm sorry, a dog owner and watch this movie you will probably cry like in every 10 minutes, maybe five",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After thinking it over I can't find any flaws or things I would change - my highest rating ever",
            "content": "If you are a dog lover this is a must-see film! In fact, unless you hate dogs, this is one of the best animal films I've ever seen. That includes Call of the Wild.This may be the best performance of Willem Dafoe's career so it is also a must-see for any of his fans.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True appreciation of a dog's heroism",
            "content": "Unlike the false sentimentality of Balto or Hachiko, this film shows the true heroism of a historic dog with all the nitty gritty details. The eponymous character is brave, energetic and loyal - but he is also mischievous, chaotic and stubborn. The relationship with Seppala is one characterised by both love and rebellion, befitting the true nature of a dog. Credit must be given to the filmmakers for the realistic and harrowing portrayal of a dog's tough journey through the brutal Alaskan winter. The flashbacks imparted a great deal of context and personality to Togo, which goes a long way when he can't speak!",
            "review_date": "2021-08-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My dawg!",
            "content": "No really, this is an actual great film to watch. Which is getting harder and harder to say these days with films made within the past 5 years or so. This film does it right, tells a story and builds on it with good acting and all the other things you need to help keep eyeballs and brains caring about what is in the screen. I will not spoil it for you, just watch it.",
            "review_date": "2020-09-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Heart of a Survivor",
            "content": "At this point, I don't care if every dog movie involves the same themes, emotional beats, or endings, if the movie sucks me in emotionally it will get my approval. Togo is a film that I was almost completely unaware of until a few weeks ago when I saw the trailer. A tale of bravery, loyalty, and an underDOG that was unfairly forgotten about for decades, Togo is one of the best films of the year no one is talking about. An absolute win on every level as Willem DaFoe and company prove there is still plenty of room for a dog movie in a crowded marketplace every once and again. Check that, I'll take one once a week.9.5/10",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo tugs at the heart!",
            "content": "With all the blockbusters being constantly cranked out for our consumption, it's great to come across a heartwarming story so expertly told. Once you realize this is a true story, it's even more amazing as you really can't believe the events actually happened. William Dafoe does a great job at playing a tough guy with a warm heart. You'll find yourself in awe of this true hero story and if you're like me you'll be choking back the tears. Great movie for the family. Enjoy.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thought provoking",
            "content": "My wife and I just finished watching this movie on Disney plus streaming services and upon completion I researched facts based on the film for the next hour. The movie was entertaining, with some comedy and drama. Based on the 1925 Nome Alaska diphtheria outbreak. The movie is factually based and it amazes me how the world got the story wrong for close to 100 years. I would highly recommend this movie for any family",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disney all the way",
            "content": "It's 1925. Leonhard Seppala (Willem Dafoe) drives his dog sled home to Nome, Alaska and his wife Constance (Julianne Nicholson) ahead of an epic storm. The team is led by his beloved lead dog Togo. There is a diphtheria outbreak which threatens the town's children and there is only one man who can travel the distance to retrieve the needed serum. His dire quest becomes a media sensation.This is an old fashion Disney doggie movie in the best way. It is Based on a true story. It has its thrills. It is heart-warming. It's a simple adventure. Dafoe is great. The ice stuff is fantastic. The Balto bit is the cherry on top. This is Disney at its old fashion finest.",
            "review_date": "2020-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a film",
            "content": "Stunning, truly stunning.As I pressed play on 'Togo' and began watching the initial scenes unfold, I was expecting a rehash/retread on Disney's previous films on this sort - e.g. 'White Fang' or 'Iron Will'. Those are good in their own right, but this 2019 film - which is about a true story - takes things to another dimension.It tugs at the heartstrings profusely, from the first scene to the very last. It's superbly written, with there being a fair amount of surprises in terms of how the story unfolds. It's shot beautifully and put together, via the set design etc., excellently, while the score is magnificent.Then you have the dogs, who are insanely charming throughout - especially, of course, the star that is Togo (Diesel). There's many a moment with him that produce all the feelings, from joy to sorrow to everything in between. The dogs are great and incredibly adorable.Away from all of that, you have an outstanding performance from Willem Dafoe. Before seeing this, the most I remember of him is his role in 'Mr. Bean's Holiday'. This now takes over in those regards, it's a brilliant job done by Dafoe. Julianne Nicholson merits praise, also.What a film. Not what I was expecting whatsoever, in the nicest possible way. Glad to see it has also been highly rated online. A must-watch!",
            "review_date": "2020-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent Film",
            "content": "Good acting, good pace, more than a Dog film. Rare too from Disney these days as it has no propaganda. Warning its emotional but well worth it. If you loved this film it worth looking up the story after as some of it is even more amazing in reality.",
            "review_date": "2022-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why are my eyes leaking!??!",
            "content": "Just an incredible movie. I can't say enough about how enjoyable this was. After the movie I had to research all about Togo and the great run. One I must highly recommend to all.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An incredible true story, told perfectly.",
            "content": "Stunning landscapes, excellent cinematography, outstanding directing and a perfect performance by all cast, including the dogs. Willem Dafoe and Togo's bond felt genuine. The 113 min run-time felt a little long, maybe should've been shortened by 15-20 mins and/or the pacing picked up. Otherwise, an incredible true story, told perfectly. A must-see and a deserving 9/10 from me.",
            "review_date": "2020-02-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A story of Togo the brave presented by the timeless Willem Dafoe.",
            "content": "\"Togo, the most heroic animal of all time.\" - Time Magazine 2011 .I mean that title alone should just make you wanna watch the story instantly ..\nWillem Dafoe did an amazing job and the idea of this story being true is just beyond amazing.The setting and the cinematography were professionally done, and Ericson Core has done a commendable job on the directing.Watch it now.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A fantastic surprise. One of the best Disney film's in years!",
            "content": "Arriving without much fanfare or expectation to the recently made available Disney + streaming service, you'd not be the only one heading into Togo with zero to minimal hopes for a film that on paper seems like the perfect middle tier type production, but throwing those feelings out the window is a dog-centric true life tale that is some of the best original work The Mouse House has done in the last decade.Likely to join beloved recent canine filled film's like Hachiand Red Dog in the hearts of movie-goers across the globe, Togo tells the heartwarming and nigh on unbelievable true story of heroic Alaskan sled dog Togo, who alongside his owner and trainer Leonhard Seppala saved the lives of countless children in a secluded snow incased town in 1925.Known as the famed 'serum run', highlighted in animated film Balto and well known throughout the United States, the deeds of Togo and Seppala allows unassuming director Ericson Core, his lead performer Willem Dafoe (does this man know how to deliver a bad turn?) and his core team of four-legged stars too combine together to deliver one of the most enjoyable and powerful family adventures of recent times.Not at all feeling like the direct to streaming offering that it is, Togo feels grand and cinematic in all the right ways as we join Seppala and his sled team as they precariously venture out into the storm clad wilds of the unforgiving Alaskan surrounds, while Core's well-played out and downright enjoyable detours showcasing Togo and Seppala's early relationship is sure to appease even the most cold-hearted of viewers.In many ways Togo never messes with the true story Disney formula that has been a staple of the company for many a moon but there's a special something found in almost every aspect of this confidently made and respectful outing, that's clear affiliation for its subject and subject matters ensures that it's an engaging experience from start to emotionally powerful finish.It's a journey that will take viewers on a wild ride of varying emotions from laughter, tension and more than likely a few well-deserved tears (honestly damn you and your dastardly ways On The Nature of Daylight) as you can't help but fall head over heels for one very faithful and special pup and his commitment to his cause that has stood the test of time for almost 100 years, as one of the most exceptional examples of the bond between man and his best friend.Final Say -One of the most surprisingly outstanding releases of the last 12 months, Togo is a standout Disney + release and a likely candidate for one of the most beloved new Disney films of the modern era.4 1/2 barn escapes out of 5",
            "review_date": "2020-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a story...",
            "content": "\"Togo\" is a Biography - Adventure movie in which we watch the story of a sled dog and his owner, Leonhard Seppala, who traveled to receive and transfer a package of medicine to cure some cases of Diptheria. They have to travel through a strong storm and overcome many obstacles.I liked this movie very much firstly because it is based on true events and secondly due to its great direction, plot and interpretations by its cast. Despite that the story is simple, it has plenty of suspense and does not let you be calm through its whole duration, something that I found extraordinary. Willem Dafoe's interpretation as Leonhard Seppala helped on that since he was simply outstanding. The flashbacks were also very helpful for the character building and also helped us understand the bond between Togo and Leonhard Seppala, and how it was created. Some other interpretations that have to be mentioned were Julianne Nicholson's who played as Constance Seppala and Christopher Heyerdahl's who played as Mayor George Maynard. In conclusion, I have to say that \"Togo\" is an amazing movie and I highly recommend you to watch it because I am sure it will leave you speechless.",
            "review_date": "2021-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie",
            "content": "Great story and a true story to commemorate the real hero dog Togo. I wonder if they will change the statue in New York to reflect the dog that saved the day. Well worth watching",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you love Eight Below,you'll love this",
            "content": "Togo is a 2019 Disney movie based on true events about a man and his dog who sled through an Alaskan storm in 1925 and must keep at bay.The story is good, especially the acting from Willem Dafoe,(best known for Sam Rami's Spiderman franchise and The Fault In Our Stars as Van Howton), and the cinematography is really good.I'm surprised this never got a cinema release but I'm glad I saw it today on Disney +.",
            "review_date": "2020-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "EMOTIONAL!",
            "content": "The movie has it all. Great script, great action sequences, beautiful cinematography and most importantly, emotion. Loved how the film shined the light in Togo, who in reality did all the work, not Balto. You will find yourself in awe and full of emotion throughout the film and I highly recommend it.",
            "review_date": "2020-06-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "American ( A+ Movie) My Ratings 10/10",
            "content": "Togo is a heartbreaking movie based on a true story that's brimming with emotion.A very sad, historically-accurate, representational film of Togo, the dog who saved the inhabitants of Nome, Alaska by sledding the crates of sera hundreds of miles, with his team, back to Nome. This took place during the diphtheria epidemic, which was a tragic time when Alaskan children were having terrible coughs and illnesses.",
            "review_date": "2021-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A beautiful film handled with care and nuance with lots of heart and meaningful messages for children and families, without gratuitous emotional exploitation",
            "content": "Before you even watch this movie you see the reviews and you just know that the only way such a film is going to achieve such universal admiration is if there is a sentimental story about a dog that makes people smile and cry. And my eyes almost roll at how predictable its likely to be and because so often this type of film is just clever marketing trick to evoke audience emotion (eg Marley and Me) without nuance and when you step back you feel a bit duped even though you may have guiltily enjoyed the ride. However, Togo is one of those rare films that tows this line extra carefully and makes sure that the emotional rollercoaster is warranted and justified within the context of the story and is done in a meaningful and organic way. A big part of what helps it achieve this is knowing that this film is based on historical events, a real journey and a real dog, so you trust in the organicness and can invest in the characters without feeling you're being led to emotionally exploitation solely for a film studios purse. It is such a beautiful tale also with edge of your seat stuff action, but most importantly there is so much heart and depth and meaningful messages to be taken from it that is perfect for children and families. I'm sure this is an instant classic in many households and will endure for many years to come I am sure.",
            "review_date": "2022-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo or not to go.",
            "content": "'Togo (2019)' finds its charm whenever it focuses on a very well-trained puppy portraying an intolerably untrainable one, and it finds its excitement whenever it focuses on the stylistic feats of sled-dog mastery required to navigate its focal Alaskan storm. Its action is an odd mix of real-life animal work and CGI set-pieces. However, its overall formalistic effect isn't entirely unsuccessful. It never comes close to feeling realistic but it evokes the effect it's going for. Some of it's actually suspenseful. The story isn't the most compelling, though it does have a good set-up and proper stakes. It just doesn't grip you, exactly. It's well-written but generally dry. A lot of it is just characters talking about how good its eponymous dog is. The relationship between the dog and his owner is tangible, though. The movie is entertaining enough throughout. Its overdone ending isn't the best note to go out on, but the experience is fairly enjoyable nevertheless. 6/10",
            "review_date": "2020-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very well done",
            "content": "I absolutely hate Disney, but this film was very well done. I like how the production went out of its way to not only make the story as accurate to historical accounts, but even made sure the characters really do look like the original people/dog. Williem Dafoe was the perfect cast.I also very much enjoy how the story was written. Instead of simply a linear story telling, it went with various flashbacks to tell the story of Togo while keeping the suspense in the current time frame.Overall, very heartwarming and deeply moving story about a man who fell in love with this dog.",
            "review_date": "2022-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It reminded me of my own one from long ago",
            "content": "\"I always thought he lived for the sled when all along, what he lived for was me.\" Leonhard concludes about Togo at the end of the movie. If you have ever owned a dog and were really lucky, you know what that means. A dog like that dedicates his, in my case, her life to you. And before you could start to appreciate it, she's gone forever and leave you the great regrets for the rest of your life....",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great story- great movie- amazing dogs!",
            "content": "Watched it surrounded by six Siberian Huskies- but even without them - you really have to appreciate the beauty of this film and especially the dogs 💕",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "By far one the best movies of the year .",
            "content": "This movie was absolutely amazing from beginning to end . Dafoe delivers a stellar performance . Must watch .",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best dog movie ever!",
            "content": "It is best dog movie I ever seen! Megan Leavey is my second choice.\nThis movie touch my heart so much and its so awesome its a real story!",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About damn time!",
            "content": "I had never even heard of the name \"Togo\" before I watched this movie. I couldn't believe a dog (Balto) that lead the last 20 miles got all the credit and no one bothered to set the story straight for 94 years? Such a shame. But thanks to the film makers and Disney for setting the record straight. This movie should have been released on an IMAX. Great performance by Willem dafoe and Juliane Nicholson and the dog that played \"Togo\". It's a Beautiful true story masterfully told and must be watched by all ages.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Edge of your seat adventure about a friendship between a man and a dog.",
            "content": "(Togo 4 out of 5 stars).Togo is a good adventure true story about Togo a leader husky of a dog sled. Where they travel hundred of miles to get medicine for a small town in Alaska. Facing against the harsh weather and a race against time to save kids who are sick with an epidemic illness. Its a great story. Togo was a stubborn and frustrating pup when Leonhard (Willem Dafoe) and wife Constance (Julianne Nicholson) first had him. Leonhard was a strict dog owner. No dogs on bed. He has huskies trained for a sled. Togo was always eager to be part of the sled. He would escape the dog pen or barn to interfere when Leonhard was out with his sled. When an epidemic sickness is infecting all the kids. The nearest town with medicine is 600 miles away. They organize a relay sledding team to transport the medicine. Which Leonhard and his sled led by Togo travel hundreds of miles to get the medicine to bring it back.The direction and script kept the movie moving at a fast pace. Putting Leonhard right into action with his travels. Facing against storms. A frozen lake cap. And edgy mountain trails. While the film flashes 12 years earlier to focus on Togos earlier years as a troublemaking puppy. Which was also fun and cute. The film has a thrilling and edge of your seat adventure sequences. While giving the audience a break throughout with flashing back to the earlier years with Leonhard not happy with the troublemaking Togo.Willem Dafoe and Julianne Nicholson are great with their characters. I have to say this is probably one of the best dog movies ever. With great acting. Good story. Exciting thrills. The setting was spectacular on capturing the beautiful landscape of Alaska and the snowy mountains.Ericson Core direction was great. He did great in setting up the action. Literally having us gripping the seat when Leonhard is riding the sled up on the mountains. And barely keeping on the edge. Or racing against the frozen lakes that are breaking into pieces. That scene was spectacular. The music score by Mark Isham was also good as well. The film does show a bond and friendship between Togo and Leonhard. And it can be emotional at times.Overall, Togo is a good film. If your looking for an exciting adventure film about a guy racing against time on a dog sled. This is worth checking out.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An inspiring tale of the relationship between humans and canines through the most challenging of hardships",
            "content": "Togo is a drama film based on the true story of the important people and dogs involved in the 1925 Alaskan serum run. Starring Willem Dafoe in the lead role, it is an inspiring tale of the relationship between humans and canines through the most challenging of hardships.In 1925, an outbreak of diphtheria develops in the Alaskan town of Nome, causing several young children to become seriously ill. In response to this, the mayor of Nome tasks sled dog musher Leonhard Seppala (Willem Dafoe) with traversing through the state to collect a serum and race back as quickly as possible. In spite of the serious snowy conditions, Seppala and his team of Siberian Huskies, led by the energetic, high-spirited Togo, set forth on this dangerous mission, determined to make it back with the serum no matter what.With its great use of landscape and solid acting, Togo goes above and beyond the normal human and dog bonding story to become an exhilarating adventure decades in the making. Throughout the film, we are constantly reminded of the loyalty and resilience of the Siberian Husky known as Togo, who always defies the odds in spite of his physical limitations. It was just so touching to watch as Togo trudges on through the harsh snowstorms and dangerous terrain, proving himself a valuable sled dog to his master Leonhard. Dogs truly are man's best friend and films like this serve to further emphasise this to us all.Director Ericson Core frequently uses creative wide open cinematography to show off how expansive the Alaskan scenery actually is. This helps give the feeling of how much ground Leonhard, Togo, and the rest of the sled team must cover in order to complete their mission in time. In addition to this, certain scenes kept me on the edge of my seat. One in particular involved the team travelling over ice sheets, as the cracking thin ice felt like it could break apart at any moment, reminding us that there is no time for procrastination.As per usual, Willem Dafoe gives a reliably strong performance in the main human role as Leonhard Seppala. Dafoe depicts Seppala with a stern yet caring demeanor, which according to some sources, was how he genuinely was in real life. Of course, the real star is Diesel, the Siberian Husky who plays the title dog himself. Not only is he absolutely adorable when he wants to be, but the stunts he pulls off are wonderful to watch as well. These dog breeds are known for their loyalty and companionship and it was nice to see this shown off in such a loving fashion.Overall, if you love dogs just as much as I do, then this film is well worth your time. Even if you believe you have seen all movies involving heroic dogs, this one still may have enough surprises to keep you invested. As previously stated, dogs are man's best friend and it never hurts to be reminded of this.I rate it 8.5/10",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredible",
            "content": "Incredible in so many aspects: Story, acting, dialogue, music, cinematography... and a dog's courage. Can't believe it took this much time to hear Togo's story, but the wait was worth it. Could very well be my favorite dog movie.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Humans must be thankful to live with dogs",
            "content": "Dogs are animals, but they are best animals and friends you can hope for. This movie shows how loyal, brave and intelligent dogs can be. Last five minutes of this great movie tears just flow down your eyes. Movie has wonderful nature, dogs and message. If you are lonely person, get a dog. He will give his life for you, and live for you.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pleasantly surprised",
            "content": "REVIEW - TOGODifferent studios seem to release similar films at the same time, I don't know if you have noticed this but I certainly have and with the recent release of The Calll Of the Wild with Harrison Ford and the terrible scoop do animated dog there was another film released at the same time, TOGO.The difference between the 2 films, whilst set in the same area of the world is most striking in the stories, the dogs themselves but especially the acting, William Dafoe is simply amazing in this film where as Harrison Ford wasn't.Follow the inspired by true events, the story TOGO from being puppy to earning the respect from his owner and becoming the lead dog pulling his sled and one very dangerous but life saving journey.Bit confusing in places with the flashbacks but one very enjoyable film which actually pleasantly surprised me.Rating 8 out of 10",
            "review_date": "2020-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent! A little Masterpiece",
            "content": "Disney finally manages to create a film that stands alone. Full of emotions, seriousness and love. What Disney put on the screen here is a little masterpiece. The cast with Willem Dafoe and his dog Togo is excellent.It is reminiscent of Jack London's wolf blood, and it only needs animals and humans and the tension and emotions are there. To this day, the dog Balto, who ran the last stage, counts as the hero, who even got a statue in Central Park. But it was Togo that ran most of the way. In this film he is finally given honor. A hero.",
            "review_date": "2020-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely beautiful",
            "content": "It was a wonderful film full of heartwarming moments. I couldn't keep my eyes dry. Very nice to see the real story behind the Great Race of Mercy and give credits to the real heroic dog: Togo. Magnificent movie, I really recommend it!",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Doggy Tale",
            "content": "Togo was a Siberian Husky sled dog in 1925 who led a team through a storm in order to pick up a serum for children with diphtheria. It is a typically Disney feel good family film. I was captured from beginning to end. Willem Dafoe is great, as usual, but the star is the Husky who seems almost human. Togo belongs on every top ten list for 2019. The scenery is spectacular and every once in a while we are reminded of the potential of movie magic and Togo is a perfect example of it.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LOVE!!",
            "content": "It's been awhile since a movie has brought me to tears......and I am BAWLING!!! Such a good movie!! Highly recommend!",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I wish I could give this movie an 11",
            "content": "Have you ever loved a dog?\nI mean really loved one?If you have you will love this movie.It's a great story and well told.\nWe learn that Togo is the runt of the litter and early on has a determination that is not to be denied.This is a true story which makes the telling even better.It's interesting to know that Togo & Balto were trained by Sepp.\nBecause Balto runs the final lego of the Serum Race, he seems to have gotten all the notoriety. He ran 31 miles, while Togo ran 264 miles over some of the most treacherous terrain in Alaska.I've always liked Willem Defoe as an actor. Whenever I watch the Grand Budapest Hotel, his character just makes me laugh.In this film, he brings life to the character of Leohnard Seppala.\nIt is truly an inspirational story.\nAs I'm watching, I'm thinking of all the dogs that have been a part of my life.\nIf you have been a dog owner, you will understand.The best part, it's all true!The children live because they receive the drum in time.\nAll thanks to these brave dogs and their masters.Kudos to Disney for brining this story to the screen.I took my young Sons to Manhattan and Central park to see the statue of Balto. They should have one for Togo as well.",
            "review_date": "2021-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Would have enjoyed even more if I hadn't seen the rave reviews.",
            "content": "Don't get me wrong i still really enjoyed the film but given its average rating of 8.1 being higher than most Oscar winners or any film I've seen in a long time I was waiting for a masterpiece and a moment in which I'd feel blown away unfortunately I didn't get that. That being said it is still a very good film for all the family and keeps you interested throughout. Like I said I did really enjoy it but for me it isn't that exceptional standard of film to blow you away.",
            "review_date": "2020-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best film I've seen this year",
            "content": "Pretty sure I'm going to end up crying whenever I think of this movie for years to come.Togo completely exceeded my expectations. It was epic, heartwarming, gripping, funny, and emotional. It had a bit of everything and the fact it was based on a true story made it even better. Importantly, it corrects history in a really effective way.Has instantly become my favourite performance and role of Willem Dafoe. He was great. Julianne Nicholson was excellent as his gentle, kindhearted wife. Diesel's performance as Togo should also ensure he join the likes of Benji in the dog-acting hall of fame. The film really excels at making the viewer feel as if Togo was their own - while also reminding viewers of every loyal dog they've ever had in life.The cinematography and scenery was breathtaking - literally. Has been a while since a film made me feel so cold! It's both a beautiful (and sometimes brutal) film to watch. The ice scenes were a definite standout.Togo is the perfect film to watch with your dog. In 2011, Time Magazine listed Togo as the most heroic dog of all-time. That should be enough for anyone to watch this excellent Disney film. Hopefully this is a sign of good things to come for Disney Originals!",
            "review_date": "2020-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enjoyable in its honesty and simplicity.",
            "content": "Heartwarming and enjoyable narration of a true story of courage and love where the protagonist is a dog.\nThe plotline is simple and straightforward yet engaging and thrilling enough. The characters development is interesting and thoughtful and helps in delivering a satisfying finale. Overall a watchable movie especially recommended to the younger humans who might enjoy its simplicity, pacing and characters.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Now we all know the truth",
            "content": "Togo stars Willem Dafoe & Julianne Nicholson it tells the life story of a man named Leonhard Seppala and his sled dog Togo who in 1925 embarked on a dangerous sled run to receive serum vials for the Alaskan town of nome. A lot of people from the 90s know the story of balto through the animated movie from 1995, How revered as a hero for bringing the serum back. How he had statues dedicated to him in his honor. Togo reveals the truth of how the embark played out and how Togo played the biggest part in the journey we reaping none of the awards and praise. Willem Dafoe as Seppala gives a great performance and you really enjoy the bonding that him and Togo developed over the course of their lives. Togo is an emotional ride that has you fill for the characters the entire way knowing their story now it makes you happy to know that they finally get the recognization that they didn't receive back then.",
            "review_date": "2021-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a film!",
            "content": "What a beautiful film, funny, on the edge of ur seat, we cried so much, absolutely loved it! Still crying now whenever I think of it lol. Acting was superb and so gripping.",
            "review_date": "2022-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "from a pet movie wimp",
            "content": "I can't handle dog movies or anything with pets unless it's Beverly Hills chihuahua. But I stumbled upon an article about Togo on Wikipedia the other day and my mind was blown. I visited my favorite website for wimps like me ( does the dog die dot com) and verified it was a \"safe\" choice. Now since I knew the historical ending I felt confident, but this movie still was exhilarating and terrifying. The last scene was one of the most beautiful scenes. It happened to tear down all my walls and so I cried. Okay. I cried. Dang Disney. Making me feel things like emotions.",
            "review_date": "2022-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lots of Heart",
            "content": "No Spoilers:\nI had tears come to my eyes several times watching this heart-warming adventure across the beautiful Alaskan landscape of ice and snow. The soundtrack was quite moving. The two main actors' (NIcholson & Dafoe) performances were perfect. Luckly the dogs don't talk; you never know with Disney. So it stayed real and sincere. Best dog-sled movie I've ever seen. Lots of exciting moments of danger and hope. There's some rather smart dialogue too. I totally recommend this movie.",
            "review_date": "2019-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Heartwarming Story",
            "content": "Even though Disney has been releasing a few gems over the last few years, it's really no secret that they're having a blast making money on their classics. Whether it's continuing Toy Story or making tons of live-action versions of their animated films, audiences, although flocking our to see them, don't seem to be all that impressed. With the exception of their franchise in The Marvel Cinematic Universe, I really can't see a new franchise blossoming for them anytime soon, unless you count the fact that they now own Avatar. My point is that it's always nice to see them take on an original film and Togo is their latest live-action original to be released, but this time by their streaming service, Disney Plus. Is it worth watching? Absolutely.Without giving anything away for those who haven't heard the real story, Togo tells the opposing story to Disney's 1995 film Balto. Known as the 1925 serum run, Togo follows Leonhard Seppala (Willem Dafoe) and his sled dogs as they travel through impossible conditions to retrieve medicine for a hospital with dying children. This is the core premise of the movie, but it's also equally about the bond between owner and dog. This film will have fans of both animals and drama tearing up. I thoroughly enjoyed my experience with this movie.Although it doesn't do anything new for films like this, it adds a depth of emotion that most of them are devoid of. Willem Dafoe, although not giving an award-winning performance by any means, remains committed from beginning to end. I found myself attached to these dogs, due to the love that was very clearly coming off of him. On top of that, there are some great visuals for a film that wasn't released in theatres. Disney Plus is clearly trying to release some quality content on their streaming service.In the end, Togo is a great film to watch with families around the holidays, so I believe those who have subscribed to their service will be enjoying this one very much this year. For the classics, Star Wars and Marvel content, I can definitely recommend signing up for this service, but I believe purchasing a month of this service just for this movie will even make you happy. It's a great feel-good story, even though it does delve into some sad elements. There's not much else to say about this movie. It's very well-made and emotionally satisfying. I absolutely recommend checking it out.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Amazing! Thank you Togo!",
            "content": "Well me and my wife were selecting a movie from Disney+ to watch and she randomly told me to select this one since it had a Dog's picture on the poster, and she loved dogs. Little did we know we were watching such an incredible movie that is so touching.\nIf you are a dog lover, I bet you won't be able to finish it without shedding tears",
            "review_date": "2021-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very moving. I really enjoyed it!!!",
            "content": "I decided to watch this movie because of William Dafoe. I've always been a fan of his performances. This movie is very gripping from the beginning. For myself personally, I love a \"real life\" movie. I liked the pace and the story telling and how it would do flash backs and explain the characters. I never knew the true story of the 1925 Serum run to Nome Until watching this. I've heard of Balto before but never Togo. I was pleasantly surprised that this movie was almost 100% accurate to the real life events. Very enjoyable movie!",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tears of joy",
            "content": "Best film of 2019 for me. Togo was just a beautiful film and William Defoe is such a great actor. The closing narrative was beautiful because it was William Defoe telling the story of Togo last years which he fulfilled his destiny. I cried throughout the whole film because it was just wonderful. The cinematography in this film was amazing. You have to watch this film.",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good dogs!",
            "content": "Yes, 10/10. I guess it's because I'm so emotional.\nI really enjoyed this movie. No - it's not mind blowing, and yes, we know this is a Disney movie, so the ending I predictable.\nBut Willem Dafoe is a brilliant actor.\nIf you like hachiko, you'll probably like this movie too.\nBasically it's a story about the bond between a man and his dog.\nAnd yes, the dialogue is primary willem dafoe yelling \"good dogs\" \"come on puppies\", but that's okay, because they are good dogs.All in all - a cute movie. For me it was two hours well spent.",
            "review_date": "2019-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not just a dog story",
            "content": "Many dog stories been watched and most of the time is \"so cute\", \"adorable\" feeling. But this one is telling the life of a hero dog and showing its humanity side. Such movie should show in China, dog is not just man best friend but more than that. Stop eating dogs pls.",
            "review_date": "2020-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tear jerker",
            "content": "Someone told me if I watched it it would make me cry. So I didn't watch it",
            "review_date": "2020-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tears, laughter, love and friendship",
            "content": "Someone wrote a review and mentioned that Togo is the best dog movie ever, I agree with that! Gosh this movie moved my soul and every fiber in me. Be prepared to cry and laugh when seeing this movie. This movie is all about love, friendship, never giving up, helping others and dedication and more. A movie for all ages. There are such beautiful scenes in the movie and you will feel so much love watching Togo.\nI have never heard about this story, the story about Togo. Such a cool story and a brave dog. This movie made me love dogs even more.\nI will never forget this movie. One of the best movies I have seen in my life.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Experience",
            "content": "After watching the trailer, I'm excited to watch this movie. When the film was released, and I'm started to watch, I'm telling myself, \"Why this movie not released in the theatre?\" It was a fantastic experience to watch Togo.It's a heartwarming and thriller. Cinematographer Ericson Core has done his best job in this movie. Cinematography and CGI are the best part of the Disney+ Togo movie.The way the director Ericson Core wanted to connect the entire story with us and he was successful in it. You will also become a little emotional while watching this movie. Willem Dafoe has done his best performance in the role of Seppala.You have to watch a Togo movie for a new adventure, thriller, and inspirational experience.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This film has it all",
            "content": "Amazing true story, cute dogs, on-the-edge-of-your seat adventure, beautiful cinematography and a great cast - not the least of which is the amazing dog cast members. I swear our dog Lucy is part of the Togo line - a total demon dog with a heart of gold...... Viewers keep in mind there is little fabrication in this story - incredibly it represents the true events.....",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A wholesome, heartwarming and inspiring movie",
            "content": "I have developed a strong allergy towards Hollywood movies. They usually are soulless, depraved and filled with political messages.This one really stands out though. It's simply a beautiful, suspenseful, heartwarming story about a special dog and his master overcoming near impossible odds to save a town full of sick children from a deadly disease. Willem Defoe does a wonderful job. The lady who plays his wife as well, such a likeable character. And who doesn't love dogs?It's a rarity these days, a movie for the whole family. Enjoy it!",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic and moving",
            "content": "I absolutely loved this movie. How very moving, I cried some tears. What a fabulous story about that gorgeous dog Togo. And Willem Dafoe was as fantastic as always. I can highly recommend this gem of a movie.",
            "review_date": "2021-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificient movie",
            "content": "Like most reviews here this movie is absolutely amazing and will keep viewers entertained and on the edge of their seats all the time, so unfortunate this incredibly wonderful dog didnt get the recognition he deserved.Must watch movie!!10/10",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Robodogs to the Heart",
            "content": "I don't usually like animal movies. They are all the same. If you've seen one you've seen them all; and yet, somehow Togo grabbed me by the heart. The dogs seem artificial, but that doesn't matter, for Disney-Illuminati succeeds in grabbing you by the heart... As it did with me. Bravo.",
            "review_date": "2020-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo..",
            "content": "This simply was an amazing film, from start to finish, beautifully shot, acted, directed and produced.. I could not fault it in anyway..The sheer will and determination of these beautiful dogs goes beyond belief..Based on true events, It's unfortunate that Togo did not get the recognition he so rightly deserved but it was never about that.. the distance Togo and his team covered, of 264 miles, compared to an average of just 31 miles from the other teams, in those conditions was truly unbelievableI was heartbroken at the end, myself, a fully grown man was brought to tears by this film.. but I'm glad he got to live out his life happy and peacefully..I would recommend this film, for you just to see what they achieved is enough..",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good cinematography. One dimensional characters and little excitement.",
            "content": "Can't believe all the good scores. It makes no sense or they're false. Sure, the dogs were strong and full of passion but the writer completely left out the stories of the doctor, other racers, families who lost children and much more. I'm very familiar with this story and have read two books on this event. This is basically schlock and meant for the very young viewer, 6 - 10 year old. Adults will be incredibly bored. The writer started off by putting us in the middle of the epidemic and then did flashbacks to catch us up with the heroes. That's lazy writing in my opinion. I couldn't watch it. Turned it off.",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great dog sledding movie",
            "content": "The outdoor elements and effects were amazing and suspenseful. The cast - human and dogs - were fantastic. This is based on a true story and it's a tearjerker at times. Def. recommend for older kids and adults.",
            "review_date": "2021-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies of the year",
            "content": "Great for the whole family from start to finish. What CALL OF WILD should have been with real dogs. Outstanding!",
            "review_date": "2020-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo: Magnificent",
            "content": "I am at loss of words.\nI love stories like this, one where we can watch with kids and make them learn a thing or two about life.\nTogo is one in a million.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Epic Movie",
            "content": "Disney just epitomized it, that too all in epic proportions, with #Togo.\nWhat an incredible movie about the most spectacular, heroic animal of all time, who unfortunately didn't come under the limelight until the 21st century !!\nNevertheless, the base of the movie is of \"Herculean\" stature displaying the ardous, yet a life saving, \"feel-good\" journey that every sensible being will feel.\nDirection, performances(from both the human and the animal) are impressive, while its the cinematography that stand's out in this project. Beautiful scenic beauty captured and shown which added life to the characters and the journey and thanks to #Hollywood for building these kind of inspiring films for the audiences.\nLastly, huge accolades and love to the dogs(especially the Lead) for characterizing the originals and displayed with such ease and with pure animal instincts.P.S : These kind of movies should be witnessed in the BIG screens for the optimum satisfaction",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow beat my expectations.",
            "content": "I thought this film would be a kids PG nonsense from DISNEY true story or not. But oh boy was I wrong. This is a story of hardships and endeavors against the odds for everyone involved in it.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "togo",
            "content": "If you are lucky enough to have known a great one,they never really leave.They stay with you as long as you live,harnessed to your heart,giving their all.Always",
            "review_date": "2020-04-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I haven't been able to stop crying!",
            "content": "This incredible movie triggered in me a almost emotional breakdown.. i never thought i could could get so emotional over a film and it's very unnerving because I haven't been able to shake off the sadness and it's affected my health to the point where I got to be very careful or I'm I wind up going to ER.\nI believe that knowing it's a true story made it even more impactful. but I am so glad that that credit is given now where it's due.\nWillem Dafoe and Julianne Nicholson did a great job and especially the puppy who played the main part of Togo.\nI've always been a Willem Dafoe fan but with this film he's really cemented as one of my all-time favorites now.\nSo please folks be prepared for an emotional rollercoaster of a film but don't let that stop you from watching it it is one of the top 2019 films that I've seen and I highly recommend it",
            "review_date": "2020-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful",
            "content": "Visually fantastic. dog acting brilliant. Story great. Lump in the throat what more can you say . Loved it",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best animal movie of all time",
            "content": "Its so saddening to know that because of the ongoing lockdown allover the world,the movie did not do well in the theaters. The less number of reviews of this brilliant movie is a proof of that.But after watching this movie, I am sure this is going to be a cult animal movie in the days to come.The cinematography is breathtaking to say the least. The acting, direction, script everything is just superb. Willem Dafoe as always shines in the male protagonist's role. And the dog as Togo, the most heroic animal of all time is extraordinary. Take some tissues with you as you may not have dry eyes towards the end. In my opinion =, this is one of the finest movies of this year and perhaps the best animal movie alongside Hachi. Please do not miss this masterpiece.",
            "review_date": "2020-04-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I never thought I'd find a perfect movie...",
            "content": "Simply put, I wouldn't change a thing about this movie. From begging to end this movie is perfect.The way that it is told (with flashbacks to Togo's early days) is perfect - and that's considering that I initially found it strange that they started near the end of the dog's life.Somehow, not seeing Togo grow up from the get-go or living with him through his life's struggles just made the story that much more impact-full. I think it's because they said just enough about his past to leave the rest of his character to the imagination, making everyone's opinion the dog the correct opinion.I was desperate that they did not spoil the film with a poor ending but Disney hit a home run with this one. The ending is on point, beyond my mist wistful dreams!Great job, Disney!",
            "review_date": "2020-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ridiculous..",
            "content": "Does anyone actually believe that this happened the way they showed it? I hate when Hollywood exaggerates actual events. The scenes on the ice were just laughable.It just didn't live up to the hype as the emotional film between a man and his dog. I didn't buy any of the stuff Togo did as a pup. Wayyyyy too smart for what they showed. It was just poorly written. They could have focused on other things to make it stronger. Too many shots of the dogs running and the scenes became too repetitive. The acting didn't help either. I'm so tired of Hollywood actors forcing expressions and words to manipulate the audience should feel. Let the audience decide how we should feel by just showing the story. People in real life don't behave like that unless they are kids or liars trying to manipulate someone.Togo was more annoying than anything for them to have kept him. Besides they showed no reason why he would keep running back to them. Why?Too bad. In the right hands, it could have been right.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "JOB WELL DONE DISNEY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!11111",
            "content": "Togo is the untold true story of Sleddog legend Leonhard Seppala and his runt turn lead sled dog, Togo. In 1925, Sepp and Togo were apart of a serum run across central and northern Alaska and were never given credit for it. The film's storyline is well written the setting is perfect the theme music great. Cast staring Willem Dafoe (Sepp) and Julianne Nicholson (Constance Sepp), that chemistry was fluent. Diesel (Togo) was the perfect dog for this film, the resemblance is remarkable. It took ninety-five years for Togo to get his credit that due to him.",
            "review_date": "2020-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you love dogs, you'll love this movie. If you don't love dogs, you'll still love this movie.",
            "content": "My only gripe with Disney is that they decided this was not worthy of the big screen. It was the most heartwarming movie of 2019, and i enjoyed watching this more than any movie i watched this year in the cinemas. I really hope Disney would reconsider releasing this in cinemas. It is sweet, emotional & family-friendly. Watch it with your family at home.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant Dog",
            "content": "Mid way through this movie I had to call my dog over and hug him, this movie is shot brilliantly. The emotions you feel are raw and real and it was absolutely amazing. I have a couple complaints with this movie, mainly the movie has some pacing issues. The movie cuts between Togo being a puppy and Togo being an adult. Togo as a puppy is all \"fun and games\" and Togo as an adult is always high stakes. The movie feels like it is arranged weirdly. This movie is pretty darn good though. not quite an 8 out of ten for me, but a solid strong 7.5/10.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Abuatiful film about a beutiful dog.",
            "content": "Well written, beautifully shot and perfectly cast. This is time well spent.",
            "review_date": "2020-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Balto Schmalto. Togo is the true hero",
            "content": "What a magnificent story and a wonderful film. Thank you Disney for making this rare gem of a movie. This will be a movie that I will be happy to watch again and share with others.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not your typical dog movie",
            "content": "I'm surprised I liked this movie as much as I did. I'm typically a harsh critic when it comes to film, but I literally cannot realize any part of this film that I did not like. It was funny, sad, heartwarming, and intense. The acting was really spot on, and all of the visuals were stunning.It was a little funny/curious watching Dafoe take on a more serious role (since I've only ever watched him as the Green Goblin LOL).",
            "review_date": "2021-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Given the fact that I'm a dog person",
            "content": "Given the fact that I'm a dog person, it would be strange if I didn't like this movie. Why hide it, at the end there was a lump in my throat, although I didn't get to those waterfalls that flowed after watching \"Hachiko\" (both times, by the way). As a dedication to the amazing brotherhood of man and dog; as a tribute to an animal that lived all these years in the shadow of Balto, although it deserved much more honors; as a love letter to our four-legged friends and as a beautiful Disney adventure for the whole family, the film is an undeniable success. Therefore, only a certain amount of critical masochism compels me to write the second paragraph. For a story about the full danger of traveling through a blizzard to save the lives of dozens of children, \"Togo\" seemed surprisingly boring to me. Despite the entertaining shooting technique, the action scenes as such did not work out. The music of Mark Isham also failed, as if on purpose to dilute any tension as much as possible with life-affirming melodies. The script still couldn't start, interrupting the whole narrative at first with cute, but then frankly protracted flashbacks, and then suddenly it somehow took off and ended. There was no big finale, no turning point, no heroes frozen on the edge of the abyss, no last spurt to victory. The quest to save precious lives somehow smoothly slid into the drama that started it all, and I went to put the kettle on, realizing that there was still half an hour left before the end of the film. While Willem Dafoe gleefully displays all of his Oscar-nominated dramatic abilities, the film isn't named after him, after all.",
            "review_date": "2022-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Soulful and just wonderful",
            "content": "The best of Disney and what I grew up watching. I absolutely loved this movie. My son did too. This is what made Disney famous. I watched many Disney movies like this with my grandpa as a chil and teen and I'm great full I got to see such a flick with my boy. This is what America was built on... tough love and hard work but with love and compassion. Great jog Disney!!",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sublime ❤❤❤",
            "content": "Thank you to the team, thank you Mr Defoe, when the heart of a dog takes away that of a man, this movie is marvel, Togo the king of dogs ! Incredible story.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo touches your heart !",
            "content": "Waw, this is a must see movie in these times of Covid. So warm, touching your heart and emotions. Once you realize this is a true story, it's even more amazing as you really can't believe the events actually happened bginning of the 1900. Although Togo did a fantastic job, the scene on the ice was terrifying well done, he did not got the credit. It was Balto. But in our hearts, Togo stays the best dog: ever !\nUnbelievable performance of Willem Dafoe. Please, watch the movie with your kids. It is worthwhile your time",
            "review_date": "2021-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect for napping",
            "content": "Boring film, no depth, it's a film for children. Nice photography through.Note: Ratings in Disney movies are definitely cheated.",
            "review_date": "2020-03-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic!!!!!",
            "content": "What a movie. A must watch emotional journey. It shows the truth friendship between a human and a dog. The loyalty, the love the trust. As for William dafoe i have no words!!!!!! He is truly amazing for one more time!",
            "review_date": "2022-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best leaders are like this, with their own ideas and persistence.",
            "content": "A dog that is not looked upon, just because he refuses to be domesticated. However, the best leaders are like this, with their own ideas and persistence. Norton Bay where the sea ice burst is too exaggerated and unreal. This is the biggest failure of the whole film. The screen filter is very warm, imitating the image of the wild era in the 1925s. The heroes behind the scenes are really great. The lovely Norwegians and their reliable Alaskan Snow Dogs. I also want to find a Belgian beauty as a wife.",
            "review_date": "2021-05-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent work Disney",
            "content": "This is a Disney Live action Movie about a true story. This Story is set in 1925 in Alaska, there is an outbreak of Diphtheria that has the whole territory pinning there hopes on the cure arriving in time. The problem is that the serum is a 640 round trip from where they are. As the film begins you will see William Dafoe who plays the role of Leonhard Seppala, a MUSHER, and his dog team. The town pin their hopes on the fact that, Leonhard and his dogs will be able to not only overcome the length of the journey, but also the fact that the area is experiencing some of the worst storms on record. Leonhard's dogs are lead by Togo.As you see the team set of with the whole town out seeing them off and hoping that they can do a journey. Its a race against time. Can they make the Journey in time? Can they make it, there and back at all?During the journey the film takes you back 12 years to give you the background on how the team, well more Togo had developed. Here you will see Julianne Nicholson portray Constance Seppala (Leonhard's Wife). Now i'm not saying much except, he isn't like most of the dogs! you will seeExcellent work by Disney and a film i'm sure a lot of people will enjoy. Just to say the scenes on the lake are dramatic and well made",
            "review_date": "2020-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great FX & Exciting Story",
            "content": "I was very impressed with the scenes of peril - the FX was very, very good! The story is a true one and it's exciting, emotional, and inspiring. The dogs are adorable.",
            "review_date": "2021-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Amazing Journey!",
            "content": "This movie deserves 10 stars just because of its main star: the dog that played Togo. I mean, don't get me wrong; Dafoe delivered a compelling performance but I couldn't stop thinking how incredibly talented and emotive the dog actor was. Seriously. The dog actors and their trainers deserve so much credit for their roles in making this movie a successful one. I had an idea that the movie would end on a sad note and although it didn't really, I still wept. I don't know how much of the movie is CGI but the cinematography was beautiful; expansive and barren landscapes that made the snow dogs and its master look minuscule.",
            "review_date": "2020-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I dont know if I can describe what i felt...",
            "content": "This movie is amazing ! It is stunning. Willem Dafoe at his best!!! It is an unbelievably emotional and dramatic story based on a real story with a beautiful pack and its leader Togo. A survival emotional and motivational move that will touch your heart and WILL make you cry... Great narration through back and forth stories , pictures and directing is terrific! So beautiful. It will warm your heart and the speech inside is going to be memorable!",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely magnificent",
            "content": "I cannot find one single imperfection in this movie, one single thing I would have changed, it's perfect.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disney Plus Needs More Movies Like This!",
            "content": "Togo is about a guy who doesn't believe that this dog is a sled dog. He then try to have him be a sled dog and realizes how great he could be. Then he gets to thinking if his purpose is something else.This movie isn't advertised at all. The first thing I saw of it was a small little advertisement in the corner of the IMDb page. I think if they told more people it was coming, maybe some more people would have bought Disney plus. I bet many dog lovers would love this movie and from what I have seen, critics have also been saying it is pretty solid. I have to say I like it too. These are the type of movies Disney needs to put on their streaming channel. From what I remember they might too! I thought William Dafoe gave a pretty solid performance. I always thought people under looked him as an actor but I have been starting to realize that many people enjoy watching him in films. All of the other actor did a great job in this picture. In my mind, it was just William Dafoe with a bunch of dogs. For the whole runtime of the film I was always in aw while looking at the ice breaking, or the snow covered mountains, or even just a patch of trees. It looked really beautiful. It looked like someone went out into Alaska and took pictures of a bunch of mountains, ice, and trees. That is how great it looked. I thought the lighting wasn't the best. It was pretty dark and at some scenes hard to see. There were also some flashbacks that pretty much came out of nowhere. In my mind, those were small problems.Overall, I really enjoyed watching Togo. I would recommend it if you have Disney Plus at the moment.",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo",
            "content": "When I was little I watched the cartoon movie Balto, I felt bad when I watched Togo, because Togo was the real hero and he didn't get recognized... Better late than never...Loved the movie ❤",
            "review_date": "2020-06-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Get the tissues",
            "content": "Wow...what a fantastic beautiful film about the best very good boy who has ever lived.Just make sure you have some tissues handy.The last five minutes WILL GET TO YOU",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly Incredible!!!",
            "content": "This movie captured my attention from the very first 5 min! The cinematography was superb, the story line was moving and had so much depth throughout its entirety. I Strongly recommend this movie to everyone. Also William Defoe was magnificent as usual! I give this a 10/10 with much ease and no hesitations whatsoever.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Leading Dog",
            "content": "This was an interesting piece of history to watch. At first I thought this movie may blend right in with all the other sleds dog films, but the personality of Togo really brought a new life to this storyline. Though the story itself seemed a bit flat, and the characters were very shallow, Togo's focus kept my interest throughout the movie. I really thought the flashbacks were a nice touch throughout the film as it broke up the journey to tell the whole story inbetween. Despite what I said about the characters falling a little flat, I'm glad the main focus was on shaping Togo's character and personality, as he was the hero of the story.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This would be a better book than movie! Bored",
            "content": "The story is not for the cinema. The end was obvious since the beginning. Many cliches. You know how story will continue. I got bored most of the time knowing what's gonna happen next.\nIt doesn't deserve 8imdb point. I have two dogs and I love dogs and the story of this dog is very touching but this movie ? No! It's an average movie",
            "review_date": "2020-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such a terrific movie",
            "content": "This was such a touching movie. I'm so grateful to the authors of the screenplay bringing the true story of Togo to the theaters. It's great to see a correcting of historical accounts to ensure that credit goes where credit is due. Willem Dafoe does an amazing job and that dog is absolutely gorgeous. I'm somewhat biased as I own three Siberian Huskies myself and they are my joy. This movie created such a wonderful feeling of that bond between man and dog and combined it with an incredible story filled with action and heart. Just loved it.",
            "review_date": "2020-07-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thank you!",
            "content": "I rarely give a 10 but the acting, scenery and story (even though it's a simple one)came together in a beautiful and moving way. All animals are amazing, but dogs are a gift to the world.",
            "review_date": "2021-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great adventure film for adults and children",
            "content": "My wife and I both loved this film. Great adventure, glorious scenery and based on a true story. More movies like this please!Interestingly an end note explains that not Togo, but another dog Balto, got all the adulation, and a statue is dedicated to him in Central Park. Had me all upset that Togo did not get the praise he deserved but then I thought \"well, he's a dog so what does he care?\" I guess the fact that I cared so much goes to show how well the movie was made.",
            "review_date": "2020-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was alright",
            "content": "Not bad not great, but worth checking out. I really liked the cinematography. Wasn't a tear jerker like everyone is saying, but definitely a heart warming story.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another grabage disney flick",
            "content": "A movie about a misbehaving mutt of a work dog. You know what they do to misbehaving work dogs? This is just more Disney garbage trying to tug at heart strings. Same as The Art of Racing in the Rain. Designed to tug at the heartstrings of the ignorant.And once again, all the 10/10 reviews you see are coming from new users with only one review on their account...",
            "review_date": "2020-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A pleasant surprise.",
            "content": "Definitely give this one ago you will not regret it.\nAmazing acting, William Dafoe is perfectly cast and the story is brilliant.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Moving story of the most courageous!",
            "content": "Togo made me cry! This movie is a gem for a dog lover and if you don't love dogs, you will know why they are loved! Togo had the heart of a survivor and his love for his leader was unconditional. Truly a man's best friend!",
            "review_date": "2021-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo walked so Balto could run...",
            "content": "If you don't have Disney+, you should get it just to watch this movie. I loved everything about it. It had humorous moments, triumphant moments, and moving moments. All you could want in a feature film. If you're a lover of animals or history, this movie is a must!",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic Family Film",
            "content": "Why this is not in cinemas globally is a shock.\nThe film is absolutely brilliant ..emotions galore.. ticks all the boxes. Classic heroic tale storyline and fabulous acting...it has it all. In my top 5 of 2019 for sure.. highly recommended..a must watch.",
            "review_date": "2019-12-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A win for Disney!",
            "content": "This is this type of movie that keeps Disney on top! We all ready knew the story but were on the edge of our seats with nervous expectaions for the entire movie! We need more like this, not the Hollywood crap that we are constantly seeing on the big screen!",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "From a former musher, I adore this movie.",
            "content": "Let me start by saying my family and I used to race sled dogs in Maine. I have researched this story. I am so thankful that this movie is here. It really portrays the truth of the story not the coverup that everyone was made to believe.The cinematography is absolutely stunning. The story is so heartwarming and action packed too. This movie is incredibly accurate from a mushers perspective. It really shows you want sled dogs are truly capable of. The flashbacks were fantastic and added so much more life to the movie. This movie is a masterpiece. I am so glad that it depicts the true heroes of the serum run- Togo and Leonard Seppala.",
            "review_date": "2020-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb movie",
            "content": "One of the best movies I have ever seen. Based on a true story it's just brilliant.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A tribute to great dogs",
            "content": "A well made and well acted film, but the star is Togo.I found this film to be a tear jerker as it strongly reminded me of my father's dog, Tim. Tim was an Australian kelpie (a sheep dog) and his bond with Dad was like in the film. He was devoted to Dad.Dad had firm views on his dogs and would not let us treat them as pets (no patting of dogs), and like in the film (no dogs in the bedroom) Dad's dogs were never allowed into our house. They were cared for and trained but not pampered at all.At one time Dad had to have major surgery and was away from the farm for weeks and when he returned he was bedridden for months. During that time Tim fretted and eventually stopped eating entirely. Mum was concerned and tried to coax Tim into the house to see Dad but Tim wouldn't enter the house. So my elder brother picked him up and carried him into my parent's bedroom. Dad was able to put his hand out of the bed and reassure Tim with a pat on his head. Tim licked Dad's hand and wagged his tail and then went straight outside and ate his food. Dad eventually recovered.Some dogs are amazing. But their lifespans are short so it is always difficult when they die.",
            "review_date": "2021-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a beautiful film, great job Disney+",
            "content": "William Defoe does a great job, as well as the other cast, but the ones that really steal the show are the dogs, especially Togo, and this is his movie. The flashbacks work to make a coherent story and doesn't feel warned out, usually when a movie goes to the flashback or continues the story you sit there like UGH hurry so we can get back to the interesting stuff. But with this film they both hold big interest and has you glued to your screen. It takes a little for the movie to kick but once it does it really delivers. Hopefully Disney continues to make films as good as this if not better. Great movie!",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hatci the most loyal and Togo the fighter and the bravest ever",
            "content": "A masterpiece like Hatchi:a dog's story\nAnd it's even better\nGreat story and great actor\nGreat Directing\nFor me absolutely one of the best in 2019\nUnderrated movie",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's raining on my face",
            "content": "This movie was fantastic, from beginning to end. It was honest and powerful, with great performances from both the humans and the dogs. Dafoe in particular was excellent, as was Nicholson, as his wife. Epic performances for both. But the MVP award goes to the dogs who played Togo and his buddies. They were so sweet. Take down the statue in Central Park and PUT UP TOGO!!!",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not bad",
            "content": "I find the frequent extended flashbacks disruptive to the flow and momentum of the story. Though the journey is heroic, it does not touch me as much as I expected.",
            "review_date": "2020-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Story of a lead dog.",
            "content": "When i watched the trailer i thought that Togo was going going to be just a average movie but i was wrong. It's a great movie which i never expected it to be.\nTogo has a simple story but based on a true story of a incredibly brave dog (Togo) and his owner. The movies story runs around the Togo and it's owner played by Willem Dafoe who does proper justice to his role.\nMost of the aspects of the movie is good. Specially the location and the cinematography.\nOverall this movie is good. Far far more good than I thought.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Screw Balto",
            "content": "We Praise Togo, The lead sled dog that saved thousands of children in the 1925 Serum Run in Nome, Alaska and got all of the credit stolen by Balto. Disrespectful, I HIGHLY RECOMMEND THE MOVIE \"TOGO\" ON DISNEYPLUS.",
            "review_date": "2021-09-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo The best dog ever lived.",
            "content": "A beautiful relationship between the dog and human. What a brave dog. The Togo. My heart was pumping so fast the whole time. Love this movie.",
            "review_date": "2020-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you own pets, you will cry",
            "content": "Loved this film. All the lead characters are superbly cast, including the dogs.\nThe fact it is a true story just adds to the emotion of what must have been a harrowing journey for all them.\nA must watch",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Accurate and wonderful",
            "content": "Willem Dafoe is brilliant as always. This movie is not only accurate and sweet but it's still a movie you can watch with the kids.",
            "review_date": "2020-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful!",
            "content": "Made me want to get one!Perfect movie! Reminded me of the feeling I got when I watched the movie Sounder as a young child which was played in our school auditorium. Nice feeling!Perfect Christmas Movie!",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So Glad I Got Disney Plus For My Grandchildren...",
            "content": "Because Togo is definitely worth the channel! At my age, I grew up with Disney movies and parks. Togo is, absolutely, a throwback to the great movies made when Walt Disney was CEO of the studio. Willem Dafoe was a perfect choice to play the lead character and Julieanne Nicholson was absolutely wonderful as his wife. Togo is a movie based on a true story about the Diptheria outbreak in Nome, Alaska, in 1925 and the dog sled race to get medicine from another city 600 plus miles away back to Nome to save the children of this small town. This movie has so much heart and soul, it's a rare gem in the movie world today.In reality, it's about the love between a man and his dog that takes twelve years to discover. I loved everything about Togo. The acting, the humor, the scenery, the cinematography, the directing, the heart, and especially the dogs used to portray these sled dogs of the 1920s in Alaska were of the highest degree I have seen in a long time. Because of Togo's age (12) and the difficulties of the trip that ended up being almost 300 miles in the middle of one of the worst storms ever seen up to that time in the area they had to travel, the very last leg of the Journey was run by a dog named Balto, who was nationally hailed as the hero of the Journey. In reality, it was Togo who saved the children with his amazing strength and love of his man, but was too ill to make the final run to Nome.I have had and loved and lost many wonderful dogs in my lifetime, so I admit that I cried nonstop in the last 15 minutes of this movie. But be aware, the ending isn't as sad as I thought it would be. It was absolutely a perfect ending to a perfect story in a perfect movie. I would give this movie a 15 if it went that high. One of my top 20 favorite movies I have seen in my lifetime. To say I highly recommend it, is an understatement. You can now bundle Hulu and Disney Plus together and save $7 a month, which is what we did as a gift for my daughter's family for Christmas. However, I have already watched more of the movies and shows on Disney than they have at this point. Do yourselves a favor and watch this wonderful movie. There is nothing boring or whatever negative thing I read in a couple reviews here at all. If you have a heart, you will love this movie!!",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding",
            "content": "Absolutely brilliant heartfelt film, amazing acting the real star of the show is Togo, a must family see movie",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "So good!",
            "content": "Im so happy Togo got his own movie. Growing up watching Balto I never knew the story of Togo sadly. Im so glad to know of him now and I'll keep him and Seppala in my thoughts and prayers and remember their contributions to the world. The movie is fantastic please check it out!",
            "review_date": "2022-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfection!",
            "content": "This is the best movie for me in 2019. Nothing to say. It's perfection. Thankyou disney, thankyou Dafoe",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Harnessed to your Heart\"",
            "content": "\"Harnessed to your Heart\". Such a beautiful film with a wonderful performance by Willem Dafoe, who plays Leonhard Seppala, who raised Huskies in the Alaskan Wilderness. History tells us of the great serum run in 1925, but Balto was the dog honored on the last leg, the final 55 miles, and that's the one remembered. Within that run was a 264 mile round trip led by a dog considered too small and too old to do the job. But, Seppela knew otherwise, hence the basis for the film Togo about a forgotten dog that Time Magazine called the 'greatest animal hero of all time'(2011). Shot in a way to give us the loneliness of that era is the story of frustration with a mischievous puppy that turns into an incredible bond of love and loyalty. Dafoe is in his element here with a character that plays to both strengths and weaknesses. Add to that a subtle but haunting score from Mark Isham and guarantee you will be in tears by the time Seppala says the words \"harnessed to your heart\". A monumental achievement for Disney +.",
            "review_date": "2020-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thankful to my life to watch this",
            "content": "I've seen many dog-related movies in my life but I'm thankful that I got to see this one. And I also wish that the 'Bolto Statue' in the NYC park should be renamed after the true hero. I cried when Sepala recited his pups the 'inspiring verses' while crossing the river. There will be no other dog as loyal as Togo. He was not just a dog, he was more than a human.",
            "review_date": "2021-08-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "If you love dogs and true stories of surviving.. this is your movie",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm gonna throw my Balto movie away!",
            "content": "So this is based on the real story of The 1925 serum run to Nome. I loved the 1995 animation movie Balto but I'm going to take that out of my dvd collection! I was so upset to see Balto got all the credit for the amazing work Togo did!Great movie if you like animals and believe in great friendships between all living things watch this. The lives we take for granted. The strenght of companionship. You don't own animals, we live side by side with them. To grow a strong heart. I'm a cat person but I also love dogs.",
            "review_date": "2021-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautifully crafted",
            "content": "I loved the older live action Disney's films like Huck Finn, Iron Will, Rocketeer, and many others. I miss these types of films. I feel that lots of the live action Disney films today pay to much focus is on CG, animation, super hero's and princess films. Finding this film on Disney plus was truly a breath of fresh air. Togo is a film of the same caliber of days past when the focus of a story was heart, adventure and a feel of reality. I love that it is also an untold true story that needed to be told. I love that it was clean and worthy of family viewing without any awkward scenes that kids and parents uncomfortably glance at each other. Well done!",
            "review_date": "2020-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I think I have dust in my eyes",
            "content": "Truth be told, last month I had to put my furball down so this movie hit me a lot harder than it probably would have under normal circumstances. It's not the sadness of death because that is inevitable; but the sadness of missing THAT companionship. The companionship that many develop with their furry friend. The companionship that is shown in Togo. Even the guilt that Willem character feels when Togo looks like he might not make it brings back guilt felt afterwards.\nThis is a wonderfully shot film with beautiful shots of Alaska and the serenity and brutality of the Alaskan wilderness during the 1920's. There were times where it looked like it was a painted backdrop or the green screen CGI looked off. I don't know how much of this version of the story of Togo is true but if it did happen; there's a legitimate reason why this dog, companion, friend, was celebrated throughout Alaska and the sled dog world.\nA great movie for the family",
            "review_date": "2020-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good...",
            "content": "Marathoning all Disney films that are based on real events, sad for this synopsis, forcing a puppy to pull a sled as if it were a heroic act ... I withdraw what I said, it was not just sport, he saved the children from Diphtheria , some situations and facts have been altered and exaggerated, but since Disney is making cute films, we do the same...",
            "review_date": "2021-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Love Togo",
            "content": "Flawless CGI with a beautiful story based on real events. A nice couple with a persistent sled dog that got into an intense race (you can get immerse into the emotions) to safe a lot of kids. The movie played with my emotions and kept my full attention.",
            "review_date": "2020-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb in every sense.",
            "content": "Watched it with the 7 and 16yr olds and wow, as dog owners, this was an absolute treat in every way.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful story!",
            "content": "Very touching true story about Togo, an amazing, legendary hero. Much respect to Willem Dafoe who really put his heart into this role. This movie is not unlike the classic Disney movies of the 1960's (only better!). Highly recommend.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful story, too much like a Hollywood blockbuster",
            "content": "Very sad that as much as I am absolutely crazy about dogs, and had looked forward to watching an inspiring film, I just found that the seemingly endless sledding by Willem Dafoe just too far-fetched to be believable. All the constant cracking of the ice (hooray for CGI) as he and his dog team raced across the bay was so CGI-overladen that it positioned itself alongside the plethora of like films which over-use CGI to such an extent as to lose all sense of realness. Especially the scene where the lead dog Togo stop inches away from a huge precipice after an out-of-control rush down an implausibly steep mountainside, this was just so unreal(istic.\nOdd also that throughout the hour or so I watched of the film not once did Dafoe feed his dogs, which seems a huge error.\nThe obvious play of emotion using children likely to die of diphtheria was again so Hollywood, and let's face it there are few films out of Hollywood which approach anything like believable. FIlms of course are about imagination, creativity, adventure, etc, but instinct tells me before the words come into my head that a film is just not crafted well enough so as to persuade me and carry me along in its\nstory.\nSad that a great, inspirational story didn't attract the right director who could have honoured it by making an inspiring, believable film.",
            "review_date": "2020-03-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I am elated that this story is being told on the silver screen.",
            "content": "Togo deserves the recognition. From my research most of what is in the film is very factual and true to the real Togo. Please, watch it with the family.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You need to see",
            "content": "To follow Togo on his journey to get the medication for his village. How he led a team of dogs running the longest way and fighting the cold weather.Since I was a kid I have read and seen the movie Balto and had always believed it was him that did the long run, but according to this movie, he only finished the last 31 miles while Togo needed to rest as he was old and has run for 200+ miles. I loved this movie and I was hooked right away and could bit look away or pause the movie at all. I have watched it a few more times and I am still hooked as the first time.",
            "review_date": "2021-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Warm",
            "content": "Stunning visuals with exceptional performance from the cast and especially the dogs. The approach of inserting flashbacks were chosen which gave a strong case for character development but sacrificed strong direction and captivating story-telling. Missed opportunities for dramatic scenes that can get the audience further into the heroic moments of Togo. Nonetheless, a strong movie with emotional moments given by a remarkable performance from Diesel and Willem Dafoe.",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TOGO, Leader of the Pack",
            "content": "This was an absolutely amazing story of the serum race of 1925. Togo was an amazing dog and the life he had with his owner was a truly extraordinary bond between human and animal. Although someone else mistakenly got the credit for the serum delivery Togo remains the hero of this story now and forever. This movie is a must watch for animal lovers ÷specially for those of you that love dogs.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful story",
            "content": "What a great movie! excellent acting by William dafoe,great Alaska shots and just overall a very moving story!\nOur family loved it",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful!!!",
            "content": "If you love dogs like i do this movie won't dissapoint you. Gorgeous animals, breathtaking places, action and adventure...excellent acting and a very enchanting uplifting story that happens to be a true piece of history.A complete joyful time to share with family and friends.",
            "review_date": "2020-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just loved this.",
            "content": "What an incredible story. Hard to hold back tears when you imagine the bond some animals have with people. Fantastic acting from both humans and dogs alike. A must watch.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "DISNEY DOES IT RIGHT AGAIN",
            "content": "What a beautiful important story to tell and who better to do it. Learned so much. Amazing cinematography. Cried the last 15 minutes.",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent! Magnificent!",
            "content": "What a whirlwind of a movie with a great big heart. It is rare to find a movie about dogs where you care about the humans too. Willem Dafoe and Julianne Nicholson deliver great performance and you start to care about the couple for being such good caretakers of the dogs.All the stunts and performances by the dogs were convincing and great 12/10 good boys, deserve all the treats and tennis balls.If I had to nitpick it would be for the cgi during the ice sheet break scene. But apart from that, the score, music, sound design, costume, make up everything was so good. Every shot was beautiful Alaskan landscape captured masterfully plus the editing was tight.Highly recommend family movie.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Imma let you finish",
            "content": "Balto, imma let you finish, but Togo had the greatest sled run of all time! ¯\\_(**)_/¯Wilem Defoe is great. His wife in the movie was a little awkward. This movie started a little slow for me but picked up a lot of speed. Incredible story, and they definitely set the record straight.",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Made My Girlfriend Happy",
            "content": "My girlfriend loves dog movies so, naturally, she insisted we watch this. It was great to see her audibly coach the dogs through each perilous scene and giggle every time Togo was disobedient. The movie itself is okay. As with any movie, Willem Dafoe is the best part. It's cute and the intense emotional scenes work fine. It's a little bland looking. Everything is dark blues or faded oranges. Depth of field in the beginning scenes felt a bit strange as the borders of the frame were out of focus. Clearly an intentional choice, but it's not one I really liked.That's about it. Nothing else to see here. If your partner wants to watch a cute dog movie with you just do it. It'll make them happy.",
            "review_date": "2020-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fine cinema making right here!",
            "content": "We were promised movies like Frozen - 2, Star wars which were nothing short of disappointment. And then there are movies like these that never get that many promotional platforms but are the cream of the crop.The movie has every element to make you feel your money and time's worth. Scenes are breathtaking and thrilling at the same time. And you will absolutely fall in love with your pet all over again.Has to be one of the best movies of the year 2019. Do not miss it!",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best movies I've ever watched.",
            "content": "I very seldom watch a movie twice but Togo I did. I gave it a 10 the first time but I gave it a 10+ this time. This is one of the most heart warming movies I've ever seen. Some of the scenes were absolutely amazing. If you're not a dog lover, watch Togo and you will certainly be a dog lover by the end.",
            "review_date": "2021-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A 'Must See' Very Enjoyable Movie",
            "content": "I enjoyed this from start to finish. It isn't overly sentimental, which is the norm for this type of Hollywood Disney movie, and is all the better for it. The scenery is terrific and the special effects pretty good, and with Willem Dafoe in the cast you can't really go wrong. Definitely recommended.",
            "review_date": "2020-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Go Togo good dogs",
            "content": "Can't believe it took so long fir this story to be put straight\nBut yes it's was a special movieBest dog movie I ever seen tbh\nLoved it",
            "review_date": "2020-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful",
            "content": "This movie is absolutely perfect . Brilliant dogs, actors, direction, just beautiful family film.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "awesome",
            "content": "This is kind of movie I didn't want to come to an end. Mind-blowing background music",
            "review_date": "2021-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must see for any nature lover",
            "content": "A true masterpiece. Exceptional true story, magnificent landscapes. Amazing dogs and Willem Dafoe at his very best !",
            "review_date": "2020-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Animals are abused by human being",
            "content": "Human always thinks they are the better species and they deserve to use other species as tools or eat them as food. They are right, the strong ones always take control of the weaker ones. That's how did the world work, but what makes me sick is this film shows some scenes that the main character is abusing the dog. This is so sad because I have seen enough in real life, now I can't even have a break while watching the movie and trying to relax. Disney couldn't even make a dog film right and that's a big shame for them.",
            "review_date": "2020-02-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "poor CGI",
            "content": "Interesting story but the script is poor and the whole movie is a collection of unrealistic CGI...unrealistic scenes...ice lake ridiculous...the mountain climb looks like the final ascent on Everest. :)",
            "review_date": "2020-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TOGO over BALTO",
            "content": "I knew of the story in jest but not the true facts but after watching the movie with my better half we was just in awe...\nTremendous!Hits all the notes & don't over dramatise the actual events too where your on a roller coaster however to say the movie/story don't put you on an emotional ride is an understatement.Excellent Sunday afternoon watch",
            "review_date": "2020-11-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I cried... And I Loved",
            "content": "I was totally caught off guard by this movie!I can't specify what hit me, but I was in tears almost from beginning to the end. Both happy and sad tears.I have an aging dog myself. He's a 10 year old Ridgeback. And yes, he is my heart.I love my dog more than I can explain with words, and I make sure he knows it every day. That said, this masterpiece of a movie was like an emotional rollercoaster for 2 hours straight.There were so many things that touched me, but I couldn't specify what ir was... I constantly pictured my own dog in Togo, and that overwhelmed me.The movie makers have done a fantastic job showing how deep the love for an animal can be.My own dog has been limping a little the last few months. After weekly sessions with a chiropractor, physiotherapist and laser treatment, he is finally getting better.Seeing Togo limping at the end had the same effect as squeezing onion into my eyes.",
            "review_date": "2021-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great story, interesting movie",
            "content": "The only thing that affected negatively to the strength of this movie is the sequence of its events.\nExiting the present to the past (during critical situation) has distracted the attention from focusing on the difficulty of that tough journey, from and to Nome.",
            "review_date": "2020-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Heroic Story",
            "content": "One of the most telling stories I've seen recently ,\nBe sure to watch this movie ,\nWhen you find out it is based on a true story, it makes the movie worth more .",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Low Budget Disney",
            "content": "Shows a child-friendly, cute puppy story rather than the really tough survival drama. Therefore everyone in the audience will end up crying at the end.\nTerrible color filter to hide the cheap CGI paired with bad layering.",
            "review_date": "2020-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An outstanding tribute!",
            "content": "As someone who was a huge fan of the film \"Balto\" as a young child, I was thrilled when I heard about the impending release of this movie. For a long time I've wanted a live-action, historically accurate film about the events of the serum run, and this did not disappoint!The plot of this movie mainly focuses on the life of Togo (hence the title) and his career as a sled dog, as well as his unparalleled devotion to his owner, Leonard Seppala, who doubted his abilities as a working dog during his earlier years. Togo received little recognition for the major role he played in saving Nome from the diphtheria epidemic, and this film spared no expense in showing us what sacrifices were made by both him and his musher to save the lives of others. On top of the strong emotions this movie makes you feel, it also delivers a bit of comedy which was unexpected, but very amusing!I couldn't help but feel nostalgic from the various \"Balto\" references, which weren't surprising since this is the same story. I was very impressed with the nod to the original film when they recreated the scene where the sled team had slid down a steep mountain slope, stopping themselves just before falling over the edge of a cliff. Balto makes a few cameo appearances towards the end, but more so for the purpose of \"de-throaning\" him by pointing out that he, by a twist of fate, ended up taking the credit for saving Nome when it had been mainly Togo (and over 100 other dogs) who all played an important role. By the end of the film, I was nearly tearing up because of how touching the final scene was as a tribute to Togo's life, as well as the epilogue and photo before the end credits.This movie made me laugh, it made me cry. It was the long-awaited re-telling of this remarkable story of the serum run we've needed for almost 100 years. Togo is finally recognized for the hero that he is. It is one of the best and bravest things that humans and animals have ever done!",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the best films I have ever seen",
            "content": "Didn't know anything about it before watching; on the edge of my seat the entire time!!! It was funny, filled with love, adventure, and so much more. This is the best movie I have seen in a long, long time.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "William Defoe spouting \"good dogs\", and it's sure to melt your heart!",
            "content": "Togo is a character driven tale that focuses primarily on the central \"man and his dog\" tale rather than the wider race against time (and elements), and it's all the better for it. The film flits between present day and flashbacks, nicely building up the central bond between Seppala and Togo - recounting his mischievous puppy years in which the musher tried to give him away twice(!), to him finding his heroic place leading the pack. It's a beautiful bond that will undoubtedly melt the iciest of hearts; you know what they say about the purest love being between grumpy dads and the pets they said they didn't want!\nCore brings the impressive feat of dog and human endurance to life with gorgeously sweeping wide shots framing the beautiful, but often deadly, vistas of Northern Alaska. The action was suspenseful and tense, coupled with an overwhelming use of icy blues and an endless white that transported you into the rough terrain. The only downside to the film was the at times small-screen feel about it, particularly when scenes took place in the towns.",
            "review_date": "2019-12-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Is this finished?",
            "content": "The movie follows disney's depiction of the story about Leonhard Seppala and his Dog Togo.\nThe Story has a strong premise, but very little is told about the world behin it, so it falls apart over the action and emotion grabing story. An what is told has a romantic touch. there are some very staged scenes which stoped the plot ore took the viewer out of the film.\nI mostly liked the start and the end, but sadly i read after watching the movie that the end was also romanticly enhanced.\nIt's clearly seen that they had to manage the production around a smaler budget, they did a solid job with that. And also William Dafoe always looks good and gives the character deepnes.",
            "review_date": "2020-05-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mind blowing, touching, sincere, beautifully written, spectacular, great movie: TOGO",
            "content": "Absolutely amazing dog movie. This film will touch your heart deeply for the love of dogs, respect and great cast. Willem Defoe plays a very good role. Made me cry till the very end. Did not know the history of TOGO, now it's my favorite movie. Highly recommend.",
            "review_date": "2020-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the end was depressing",
            "content": "Disney did not end the movie on the facts of Togo's end. But the story was about Togo's heroic effort. It's probably said to be a sad ending because Seppala gave him to Elizabeth. So they were separated for a long time and only reunited just before Togo's death. This was never showed in the movie. Not really a sad story, but definitely wasted potential for the movie, considering the Top tier actor named Willem Dafoe they hired for the main role, the euthanasia scene would've been so well delivered. After the serum run, i was definitely READY to get hurt. The real story is amazing & inspiration but in the move a lot of details missing.",
            "review_date": "2020-05-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo Statue",
            "content": "You should all build Togo and other dogs a statue worthy of heroes.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "William Defoe is back..",
            "content": "The Wisconsinite showes why hes one of the greatest actors of our time..",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mixed emotions throughout",
            "content": "I was laughing, stressed, anxious & cried my eyes out at the end. The movie was brilliant, William Defoe did the character great justice. The dogs especially Togo were true heroes. I loved it.",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Low ratings??",
            "content": "I see people who give this movie 3 stars or even just 1.\nEverybody got his own opinion but 1 star for this movie is just redicuelous (excuse my english im from holland) i mean cmon the shots are great and also the story, You just cant give this movie 1 star , you make yourself look stupid. Ratings like this give a wrong image about a movie, i understand everybody is not the same and taste of movies can be different i know.\nBelieve me i have seen movies who deserves not even 1 star, but if you give this movie 1 star you just dont understand.",
            "review_date": "2020-02-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good atmosphere",
            "content": "I appreciate the story telling. It had a lot of atmosphere, great filming and a nice Christmas like grunchy effect on the borders to give it that somewhat dreamy Christmas old style look, yet I could still not get immersed in it. It felt all a bit too straightforward in characters and pasted on emotions. The scene with the ice breaking on the river was also completely overdone and ruined it for me as well. It's just an entertaining movie with that very clear Disney flavor in top of it. It lacked anything that gave a sense of realism. It was all about that Disney emotion. In my view you then didn't do justice to the real story. It makes me even wonder how much of it is real. Not bad, but nothing special either. Nice Christmas movie though. For kids om sure they love this. A hero dog, who wouldn't love it. Too bad they couldn't add more character to it.",
            "review_date": "2021-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply amazing",
            "content": "Great story,cast and effects. One of my favorites. Grab a popcorn and enjoy with your family.",
            "review_date": "2020-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie,",
            "content": "Beautyfull shots, Great story, they used a unique effect of a \"old\" movie wich is great.\nSaw this movie in dolby vision on a oled tv, that realy makes a big difference. But also without oled its a great story offcourse. its just shot so beautyfull that you need to see it in good quality.",
            "review_date": "2020-02-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful Magical and Emotional",
            "content": "Watched this movie on Christmas Day. An outstanding tale of courage and loyalty. The camera work is amazing. I urge you to watch this movie. Truly awesome!",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This one is for Togo",
            "content": "Thnx for making a movie about this Beautiful story. Try to hold your tears ... 😊",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great storytelling",
            "content": "The movie never fails to make you feel a part of the story. The story is undertold, and as one who loved Balto, feels this movie brings some much needed light to the original events that occurred. Perfectly cast, and paced well. Great film for all to enjoy!",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good boy Togo!!",
            "content": "This movie was incredible! Loved every minute of it....from the acting, to the incredible scenery, to the amazing dogs and a heartwarming true story! I was an absolute blubbering mess by the end of it 😭 This movie is a definite MUST see!!",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dafoe & Togo: A Perfect Partnership",
            "content": "For a Disney+ film I was anticipating something a lot more directed towards kids, and to be fair it's definitely one kids can enjoy. But Togo is definitely a film that can be enjoyed by anyone any age, a brilliant and accurate telling of the little-known story behind the more famous headlines. Willem Dafoe plays his part excellently, and is the perfect choice to chronical the changing emotions of this hard Norwegian. Aesthetically, the film is shot very well, and overall it delivers exactly what you may expect. An enticing, sentimental epic pulling at your heart strings right until the very end.",
            "review_date": "2020-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good, but uses an excessive amount of CGI",
            "content": "This movie uses more CGI than most action movies today.... there's seriously MINUTES of CGI used in the movie, and it's not good CGI either, it's very easy to see that it's CGI (and that's when you know that it's bad CGI). So I think the film could certainly have benefited from cutting WAY back on the CGI. It also would have made it so that MUCH of the $40million budget wasn't wasted on needless CGI... and perhaps that money could then have been spent on making the film slightly longer (which I think it would have really benefited from since the film actually ends very abruptly after the serum run is completed).But otherwise, it's a very good true-story movie and captures a pretty important historical moment during the diphtheria outbreak in 1925 Alaska. Willem Dafoe delivers some great acting throughout.Overall, it's a great true-story movie and certainly worth a watch. 8/10.",
            "review_date": "2021-08-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A gem",
            "content": "A great movie that opens up your eyes to one of the historic moment in Alaska's history and shines how dependent and reliable dogs have been in that icy cold terrain. This is a story of great bond between man and dog. Very beautifully depicted with very real effects. Your respect for sled dogs will increase by great extent .",
            "review_date": "2020-05-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Edge of the Seat Movie",
            "content": "I watched this movie over 5 times & while watching it with my 10 year nephews they were standing almost the whole time totally absorbed in the suspenseful movie. It had me cheering at the tv and gasping at other moments. What an awesome movie. A must to see!Don't cut yourself short. Just wish it would come out on dvd!!",
            "review_date": "2021-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding",
            "content": "This movie brought tears to my eyes. The whole movie is just amazing",
            "review_date": "2020-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Terrific true story to set the record straight",
            "content": "True story of the incredible dogsled team lead by musher Leonhard Seppala and his lead dog Togo. Many dogsled teams participated in the 600+ mile relay to deliver serum to halt the Diphtheria epidemic of Nome Alaska in 1925, but only one of those teams traveled over 260 miles in sub-zero and often blizzard conditions. The most famous team was the one that actually delivered the serum, lead by Fox and Balto, the latter dog Balto of course receiving all the fame. This movie is a reminder that it was Seppala's team led by the incredible Togo that vastly outdistanced all of them.The film begins with the outbreak of the Nome epidemic with Togo an established and senior dog of 12 years old and uses flashbacks to recount his early years and all the trouble they had with this unruly, smallish but lightning fast and amazingly intelligent puppy. His destiny was to lead the sled team and lead it he did. Can anyone possibly imagine the heart the dog must have had at that age to guide a sled team in such conditions and for such a distance. It's incredible when you realize it actually happened.A thoroughly enjoyable family film depicting the real story of courage and heart. As a dog lover, this is a keeper for my dog story shelf and one I will return periodically for sure.Run Togo Run !!",
            "review_date": "2020-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A heartbreaking movie",
            "content": "This movie is definitely worth a watch, such a heartbreaking movie! If you are a dog owner this movie will touch you for sure..",
            "review_date": "2021-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful, truthful film",
            "content": "I have always had a great interest in the Northern wilderness, particularly Alaska and sled dogs. I had read various accounts of the great serum run from online sources as well as the book, \"The Cruelest Miles,\" many of which hail Balto, although an important and tenacious dog, as the hero of the story. However, when you dig a bit more and read accounts from diaries of mushers and families whose children lived (and thus generations of families) because of Seppala and Togo's heroism, you see the real truth. Without those two, their speed and tenacity, the serum simply would not have made it to Nome. This film, tells the truth in a way that is utterly heartwarming without being syrupy and \"Disney-ish.\" I've always admired Dafoe, but he gives a wonderfully understated performance that draws you into the story as if you were there watching it all in person. A beautiful, triumphant film that reminds you that the will of a spirit and heart can truly make miracles happen. As an aside, puppy Togo is about the most adorable creature I've ever seen!!",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo is a Must see",
            "content": "My BF and I loved the Movie it was very Funny when Togo figures out how to get out of the Barn and goes back to he's Owner . The water Scene where they are Mushing though the Somewhat Frozen Ice water not once but Twice has us on edge of bed . But that's all will say about the Movie",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo, The True Hero.",
            "content": "My family and I loved the story of Balto and even took photos with his statue in Central Park. Finding out that Togo was the true hero of the diphtheria vaccine relay is a story that was long overdue in coming out. Intense scenes mixed with flashback puppy scenes make for an interesting story. I highly recommend this movie if you are a dog lover.",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic True story movie!!",
            "content": "This is one of the best most touching movies we have seen. Well acted well directed, good special effects, well scripted and well worth watching.",
            "review_date": "2020-02-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you trust someone like Togo. It'll never let you down",
            "content": "Visually stunning, brilliantly crafted and unexpectedly surprising things I have witnessed. I don't know why people are not checking out this one. Willem Dafoe is good as usual. But again graphics feel so better on screen specially the depth shots of alaska are really engaging.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Damn this dust in my eyes 😭",
            "content": "What a beautiful movie! The bond between a dog and a human is not understood by all. If you are a dog owner, you will most likely cry after watching this. I would rate it in the top 5 movies of the year. 10/10 - storytelling, production, cast, everything is on point.\nIf this was a superhero movie, everyone would know about it, shame it's not marketed heavily. Highly recommend watching this.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "where is the credit for the dogs that played togo",
            "content": "I loved this great film, but where is the credit for the dogs that played Togo, considering that he is the main star and titled lead, how come they dont give him even a mention let alone that it should be top billing",
            "review_date": "2020-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good film",
            "content": "If you want a very pleasant family film without any modern politics, this film is exactly what you're looking for. It is a straightforward story that tugs at the heart strings. It also has realistic and meaningful characters. In particular, it has a wife who actually behaves like the wives I know and see.The acting is good. The scenery is excellent. The camera work is mostly very good. The dogs are loveable. I really enjoyed seeing Julianne Nicholson play the role of the wife. She worked with her husband (which is rare to see in films today). She complimented her husband well, although it would have been good if she had at least one fault. Willem Dafoe delivered his usual solid performance and he's a pleasure to watch. He plays strong and flawed well.I enjoyed watching this film. It is probably a little better suited to my children. Definitely worth a watch. Netflix is hit and miss. This is definitely on the hit side, although, not as risk taking (and politics free) as Klaus. Klaus stands as my Netflix goto kids film.",
            "review_date": "2020-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Underrated gem in Hollywood",
            "content": "One the best movie in terms of technicalities and acting that visuals was simply mind-blowing it took me to Alaska that dog was really awesome and bgm was good. But cinematography at its best. Overall a must watch movie.",
            "review_date": "2021-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lies after lies",
            "content": "Sure, it's a movie... it's a story... but first was Balto (now they say it was a fake story)... really? How come??? Spielberg is a LIAR????... so is Schindler's List???? WT????... you, morons from Hollywood... can you stop faking the news and stories just for a sheet load of money??? I'm glad I didn't pay for any of this... and, btw, ice melting and cracking at -60??? Right...",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic!!!",
            "content": "A modern, fun and moving classic, full of emotion, filmed well, good acting, beautiful locations and cinematography, good music, etc.",
            "review_date": "2020-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful story",
            "content": "The story of Togo is one that we all can love but only a true dog lover will understand. It a wonderful movie for all ages.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome act by Dog",
            "content": "The Dog TOGO is A real Champion Animal on the earth.\nThe act of the dog in the flim is awesome performance than man can act such a fantastic act by a dog.\nI loved this flim.....",
            "review_date": "2020-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Delightful",
            "content": "An utterly charming film based on a true, if simple, story. There are moments of humour, pathos and genuine peril. Willem Dafoe puts in his usual exemplary shift but the real stars of the movie are the dogs playing Togo and the stunning landscape, captured beautifully by some incredible photography.",
            "review_date": "2020-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Balto instead of Great togo That,s real life",
            "content": "I watched togo yesterday.I totally loved togo and the director who done a great job to mould a dog into togo its an incredable task.This year that dog must be nominated for best actor that much sensitive togo.wonderfull film massive survival experience with hearttouching emotion between togo and owner.i dont have dogs but this film makes us want a dog for everyone.in this world dog have more love towards his owner than human beings.",
            "review_date": "2020-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect casting choice for an almost perfect movie.",
            "content": "Wow. I don't know what I was expecting, but that movie was amazing. I never thought I'd enjoy a movie about a frigging dog-sled, but it was so damn good. I laughed, I cried, I gasped, I was on the edge of my seat during some parts and giggling away at others. Too slow-paced for kids, but definitely a good watch for adults. Also interesting because it's damn near spot on accurate to the real story (or so I read afterwards), and yet it's STILL exciting AF. Well worth the watch.Also, Willem Dafoe was the perfect casting choice for the lead. Google pictures of the guy, they could be brothers. Wow.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good boys. Good movie.",
            "content": "This is a good Disney+ original drama about the 1925 serum run to Nome, Alaska, the same subject as the 1995 animated cult classic, Balto, although Togo is much more accurate to the true story than that film was. This movie features some really solid performances, with Willem Dafoe being the standout, as is usually the case. If you like dogs, definitely watch this movie! It has cute dogs everywhere, and I think they are mostly real with minimal CGI. I'm always amazed at how expressive these animals can be and what they can be trained to do. The subject matter of the movie was very interesting, I feel like I learned something about history from watching it. It also features some really intense and thrilling action sequences that had me on the edge of my seat! I wasn't that into the structure of the film, it was told in a nonlinear way that kinda took me out of the experience sometimes. That, and I didn't think the cinematography or the editing were anything to write home about, but other than that this is a good movie that gives you a good old-fashioned triumphant feeling. It's worth a watch if you have Disney+.",
            "review_date": "2020-02-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top Notch film! But the mouse pulls the strings",
            "content": "I loved virtually everything about this film, action packed from start to finish, had good pacing, shot well, solid acting all had you feel for the charectors and cheering for Togo near the end. CGI was used but sparingly I felt, a few touching moments to help you feel invested, and a warm ending all add up to a great film. Enjoy that they chose not to voice over Togo (the sled dog) always find that tacky. Only real gripe with the film is it seems to contradict the story told in earlier Disney pretrails of the story in Balto.. without some serious reading it's hard to tell which story stays more true to the real events... Seems like typical Disney re writing history even its own to fit it's needs, but besides that a great watch, obviously family friendly but didn't feel forced, definitely be watching this again soon!",
            "review_date": "2020-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo",
            "content": "I will really gonna buy a dog, just that i can call him a Togo. Best story of the dog ever made, I am the runner, ant it was impresive miles per day for old and injuried dog in that kind of weather, heads down for this one.",
            "review_date": "2020-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It was heartbreaking getting to know the real story",
            "content": "It was heartbreaking getting to know the real story. And that Balto got all the credit when it was Togo and Seppala all along. This was actually the first time i got the right information about this event. And it's heartbreaking comparing the two statues of the dogs. Togo should also be in the park where Balto's statue is. Wow great movie about this event. Sad that it took so many years for people to get the story right. God bless you Seppala and Togo.",
            "review_date": "2020-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow",
            "content": "Wow, just wow. What an amazing film and an incredible story. I don't even know where to start. First off, I have no idea how they were able to train those dogs to act the way they did in that movie, that in my mind, was pretty incredible. Based on the film making and the movie as a whole, I would consider it a masterpiece. The storyline had a perfect blend between timelines that came together to tell the story of Togo in an amazing way. I was able to understand this dogs life and the life of the owners ever since he was a pup. The story from 1925 in general was incredible just to see. How 20 teams in this \"serum run\" ran the relay, where all of them ran 31 miles except for one of them running 264. I personally, love historic movies and this one came second to none. I'm not sure how accurate it was, but they made it seem that Balto, the dog that finished the \"serum run\" was the villain because the press praised him instead of Togo. Personally, that iritates me off a little, but I could care less because this movie was a 10/10. It's frustrating that this movie is only on Disney+, I would like to see it released in theaters and find out how other critics and just normal movie goers think of the movie. The conclusion and ending to this movie was nothing but excellent. The sound editing between the breathing of the dogs, running, thoughts from the owner (Willem Dafoe), who did such an incredible job in this one I personally think this is his best movie. The ending of the movie was so touching it was incredible. It's sometimes hard to explain how good this movie is, you'll just have to see it yourself to believe me. But, I guarantee, you do not want to pass up seeing this film.",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Been a long time since Disney made a good movie with a canine lead",
            "content": "There are tons of things this movie did right. The acting was superb (at least for the main characters), the Alaskan frontier looked spectacular and I found myself getting lost in the grandiose environments, the soundtrack was well done, and the story was surprisingly accurate to what happened in real life. I've been burned by Disney movies in the past that did not respect the source material of their stories (*COUGH COUGH* Johnny Tremain and Percy Jackson *COUGH*).Very good movie, in fact, one of the better family movies I've seen in a long time.And Balto is a fake and a fraud.",
            "review_date": "2020-10-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What Togo wanted !",
            "content": "Togo would definiely not want a statue nor to be famous. Sapp finally realized that Togo lived for him, not even the sled. So touching. I admitted I was a bit biased because I was once a dog dad. But it is a Good movie. Recommended.",
            "review_date": "2020-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely amazing movie!",
            "content": "Very beautiful scenery, Dafoe is so good as always, but the most important thing about this movie is that delivers us the recognition of this amazing dog, Togo! Heartbreaking and touching. One of the best movies of the year! I highly recommend it!!!!",
            "review_date": "2020-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Beautiful Movie",
            "content": "What makes a man sacrifice himself as well as his beloved dog, to save human life? He has made a decision to risk his life, but, in doing so, knows that he might also be demanding too much of his faithful companion. On top of everything else, their act of extreme heroism then goes unnoticed, with another getting all the credit. A remarkable story of an amazing canine, and a master who followed his lead. Don't miss this movie.",
            "review_date": "2020-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Story that can warm your heart",
            "content": "For the first time ever i cried for a film that really teach me all about brave, passion and about \"totally Live your life\"",
            "review_date": "2019-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Amazing.",
            "content": "Right from the start to end, the movie is extremely captivating. Action sequences were amazing. And the doggos were so cuteeeee <3",
            "review_date": "2020-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wow",
            "content": "Just amazing. the scenario, the actors, the writing and of course... the dogs. just amazing",
            "review_date": "2020-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Predictable",
            "content": "Not as tears drawing as I thought it would be reading the reviews. Sometimes funny, sometimes moving. Well done in the overall, but very predictable since the beginning.\nNice landscape pictures, but partially ruined by a disturbing constant filter/frame over the picture. Who had this stupid idea?!?",
            "review_date": "2020-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A masterpiece",
            "content": "One the best movie in 2019, you have to watch this one... For Togo..",
            "review_date": "2020-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Evokes Powerful Emotions Through Simple Narrative Devices.",
            "content": "As a constant, the most powerful stories told in Cinema aren't overly complex, always consisting of those basic human elements which resonate even among the sternest of watchers. Yet, simple stories are often the hardest to put to film, as undoubtedly the immediacy and banality of the medium make it difficult to retain the more profound nature of the written word.\"Togo\" tells the often-elusive simple story elegantly, without pretense, in the very fashion which auteurs strive for, almost as elegantly as Jonas Mekas nostalgic landscapes or Sokurov's poetic images.Dafoe's performance has immense power, in every crease and rugged line which speak more than words ever could, and manages to project the bond between man and beast effortlessly throughout, never needing to say more than a few words to speak straight to the heart.A lesson to those wishing to cross-pollinate between mediums perhaps, creating a confusing mish-mash of nothings; moving pictures are simple things, if only you can manage to capture the moment in the image whilst retaining its apparent simplicity, without needless hyperbole.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very boring",
            "content": "I stopped watching because it's very boring. Maybe it's meant for kids or for tear jerking movie lovers, but still... I stopped watching. What a snore fest",
            "review_date": "2020-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best dog movies ever made",
            "content": "Move over balto, move over hachiko.\nThis movie is fantastic, on the downside the only bad thing i can say about it is that i NEVER heard of it save for chris struckmann recommending this.\nYou WILL cry so be warned.\nAs usual William Dafoe is fantastic but is honestly outacted by the lead dogs, absolutely fantastic performances from all and a breakout surprise from the director of the point break reboot, who would have thought",
            "review_date": "2020-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A hero who made me cry. A true hero.",
            "content": "It's not fictional hero.It's a true hero.Who lived.. long time ago.And Disney decided to make a movie,\nwith help of today's tehnology,\nand with great team of actors,\nand they two did great!But, of course, we know who did great!One hero! And his pals!And it's impressive!It's not all CGI, which is one of the greatest I've ever seen.. it's real puppies! And what a acting they did!Why you didn't gave them Oscar !?And those behind parts which are CGI too ?But let me ask one more time for puppies, why they didn't ? Hm !? Ey, guees what! They don't need!They know they're special!Same as this true hero here, and his story!Story it's so beautiful,\nso inspiring,\nso touching!It's story, not only about one of the greatest heros in history, it's the story in which many people can find themselves in.. story about.. let's say, rejected one.Type, you're not worth! You'll be notinnn!The one, in who no one believed, or..\nBetter go and see for yourself!Maybe inspire you!Maybe change your views about life,\nabout yourself!Maybe you find something you need!It's one of the greatest story's I've had chance to see!And the way Disney made that.. that too!",
            "review_date": "2022-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo",
            "content": "Great movie, amazing scenery and great acting from the former Spiderman badguy.\nWatching someone bond that well with a dog or any animal for that matter, is very touching to the heart.\nOn top of that i also love their cozy fur jackets, God.. where can i order?!",
            "review_date": "2020-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loved this movie.",
            "content": "I loved the movie. A couple of the scenes were a little over the top and unrealistic, but they didn't need to be here. The movie would have been great without the cliffhanger action sequences. Other than those few missteps, a nice movie to just relax with and watch with family.",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must see for dog lovers",
            "content": "This is the best dog movie I have ever seen! The story is heartwarming, the acting is perfect, only little well made CGI effects.\nIt's sad that this movie didn't hit the cinemas...it deserves it!",
            "review_date": "2020-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Most Beautiful and Amazing movie in Recent Time",
            "content": "Most amazing movie in recent time.. beautifully directed and film in mountains of Alaska... and moreover it has corrected the history and the facts..it was Togo not Balto who did the heroic in 1925 savings number of kids in Alaska..Togo Rocks🙏🏻😎👊",
            "review_date": "2021-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent.",
            "content": "In 1925 a small town in Alaska had an outbreak of diphtheria. With a massive storm closing in there is no way other than man and sled dog to make the 650 mile trip through treacherous Alaskan country in a deadly blizzard. This is the story of Leonhard Seppala and his amazing sled dog named Togo and their journey to collect the serum to save a town of children from this deadly virus.\nThis is a remarkable story with great performances in particular by Willem Dafoe and the rest of the cast (including dogs of course). It definately tugs at the heart strings and show why the Seppala Siberian is an extremely valuable breed of working dog. A great movie for the fam. 1 of the best I've seen. 10 stars.",
            "review_date": "2020-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Balto? oh wait",
            "content": "I've watched Balto as a kid, and while watching this movie i was wondering why this looks so familiar, are the 2 stories connected. It turned out that This is the better half (or more like 70%) of the story of Balto.The movie itself is very good. It focuses on the interaction between the man and his dog/s more than the medicine they have to deliver. Yet another very good role of Defo, which was not surprising at all.Sound and camera work are superb, script and dialogues are very good too - simple, clean and without any useless thing to get extra minutes.It also shows how the media works - Balto gets all the credits while the real hero stays in the shadows unknown for over 50 years. Not that Balto and his owner are not heroes as well, don't get me wrong, i'm just paying my respect where it's due.",
            "review_date": "2022-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Family Film",
            "content": "Heartwarming film, kids and adults alike will love it.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie i ve seen in a while",
            "content": "Oscar worthy! This movie is very well done.The speech that Dafoe made to the dogs when the ice started braking got me some serious chills. Amazing performance.",
            "review_date": "2020-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Can't Stop Crying",
            "content": "This movie says a lot of things even If you haven't got any dogs in your entire life . I wish I have a dog maybe when everything is gonna be ok I will.",
            "review_date": "2020-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo 😘 he's hero",
            "content": "Amazing touching heart story . Beautiful lovely story",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cried like a baby!",
            "content": "OMG! What a fantastic story!My love for dogs is growing by the hour. Never in my life, I had the opportunity to own a dog. I would love to fulfill that one day!",
            "review_date": "2020-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "you'll fall in love with Togo",
            "content": "Watched it with hubby and daughter and we were all smitten by Togo's perseverance, endurance and selfless personality. He makes me want to reach out and cuddle him. He's absolutely amazing. Credit goes to the 4-legged actors too for capturing our undivided attention throughout the movie. Another winning tribute to the countless animals who sacrificed selflessly for mankind.",
            "review_date": "2020-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best pupper ever",
            "content": "Don't like the risks the trainer took. How dare he risk the puppers life over some children. Anyhoe doge is a hero",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "CGI Nonsense",
            "content": "Disney is simply printing movies for money at this point. An entertaining story, worth watching, I and love everything DaFoe does....but this is just CGI nonsense when compared to previous Disney classics like Never Cry Wolf.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "Best movie I have seen in a long time. I recommend this movie to anyone who has only heard of the dog Balto. I did not know who Togo was before the movie but I sure do now. Thank You Disney for correcting the historical inaccuracies that have been around for far too long.",
            "review_date": "2021-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great great great",
            "content": "Wonderful true story. I half expected to hear Rex Allen narrating, like he did Disney stories of old.",
            "review_date": "2019-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disney ... well, it was clean.",
            "content": "A shockingly good movie. The only 'bone of contention' was it's absence of cultural coloring. Alaska ... such great opportunities for enlightenment of the audience. Much more than just an 'end-note' over a dumb statue in Central Park NYC. The place where \"hooch\" was coined, the first place to allow women to vote, the famous dog breeding - like the Alaskan Malamute & Husky. Or the many Native tribes, some in the Nome area who would still have spoken Russian. There IS such a thing as TOO clean.",
            "review_date": "2020-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "FANTASTIC WATCH!!",
            "content": "It's nice that Togo finally gets the credit he deserves for what they went through. It was a gorgeous watch. And anyone saying it was a lie just needs to read the true story. They ran the majority of it and in horrific conditions. Such a great movie.",
            "review_date": "2020-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Such a beautiful movie",
            "content": "A beautiful movie, the filming was amazing and the actors were brilliant! Very moving!",
            "review_date": "2020-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good To Go Togo",
            "content": "I admit it, I'm a sentimentalist. I cried like a baby at my own wedding while my wife looked on in bemusement. I weep at favourite songs or pieces of music and shed tears freely at emotionally charged movies. It was my wife's brother who recommended we watch this movie during lockdown and I really should have read the signs. First off it's a Disney movie, secondly it's about a brave dog ...and right from these two facts, I knew I was going to struggle to get through it dry-eyed.And so it proved. With films like this, for me anyway, critical faculties are suspended and you just get caught up in the action and want it all to end happily, especially for the dogs. I do know that Willem Dafoe and Julianne Nicholson were excellent in their parts as the slightly mismatched couple who set up home in the remote, frozen, northernmost part of America. He's the local \"mush-man\" responsible for trekking his team of husky dogs over unforgiving terrain for the benefit of the local community while she provides all the back-up back home he needs for them both to keep their operation going.Comes a catastrophic diphtheria outbreak to the town, especially targeting young children and the need to requisition urgent medical supplies from some 500 miles or so away, but with an impending spell of bad weather knocking out the possible use of aeroplane or rail transport, the only way to go get the job done is for Dafoe and his dogs to undertake a hazardous cross-country trek like no other to collect the vaccines and get them back to the hospital to help save the kids' lives.With a storyline given added topicality and piquancy by the devastating Covid-19 virus outbreak, this was a thrilling and moving race against time, taking on the elements and indeed the odds, the effort spearheaded by crusty old Dafoe and his pack, especially Togo the pack-leading dog. Early on we're fed the back story of how Togo came into the couple's possession and how the dog's irrepressible desire to accompany Dafoe on his travels sees him twice unsuccessfully try to offload the dog to new owners, only for Togo to somehow find a way to break free and return back home from whence he came. Finally Dafoe is persuaded by the dog's errr... doggedness, to reluctantly road-test the apparently under-sized dog and eventually concede that its courage and stamina outweigh any physical disadvantages it may have.We see the pack endure unbelievable dangers in their epic mission, Togo literally pulling out all the stops to navigate the team over breaking ice-floes, slog up snow-bound foot-hills and even save the group from certain doom near the end, in a particularly amazing show of love, strength and fortitude by the dog.It's a Disney film so there's probably a fair bit of dramatic licence taken with the story but you'll have a good idea how it ends. The landscapes, making great use of drone shots on-high are frequently eye-catching and there's was a plaintive lonesome-violin soundtrack which further set the scene. I don't know how much of the cinematography was C-Gen assisted but the actions of the dogs and Togo in particular, looked natural to me.Anyway I got through to the end dry-eyed and dog-tired, to quote Elvis Costello, and immediately afterwards felt the need to hug our own dog of over ten years in sympathy and appreciation for what I'd just seen.This one's for you, Flip.",
            "review_date": "2020-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Set the Record Straight",
            "content": "For nearly 100 years the credit has been given to a different dog. This movie sets it all straight. Togo is so endearing and hilarious too. I believe people will giggle with delight and sit on the edge of their seat the next minute. Siberian Huskies are obnoxious dogs! I love the breed and I am so thankful that the movie will help to correct the error.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Dog film in years!",
            "content": "It's tough to find a good dog movie lately I watched A Dogs Way Home (2019) and the 2020 version of Call of the Wild. Both really flat stories - totally forgettable characters and the latter even used a $^%£$ fake CGI dog! Togo is a wonderfully high spirited dog who works hardest and Willem Dafoe is absolutely legend in this film. Put the phone down, make some popcorn, and have a great night.",
            "review_date": "2020-11-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Movie Ever Made",
            "content": "This might seriously be the best movie I have ever seen. It is inspiring, masterfully made, and heart wrenching at times. It's a story more people should know about. Things to love about this movie:\nThe story\nThe score\nThe acting\nThe dogs. Such beautiful animals\nThe scenery\nThe feeling that there is good in this worldOh my, just a marvelous movie.",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An untold story worth watching",
            "content": "This is a true story not many people know about. It focuses on the head sled dog Togo. This story is one that is highly recommended for dog lovers and Disney fans alike. The film is captivating thanks to the amazing performance by William Dafoe the great cinematography, beautiful visuals, and story. Please do not pass this film up, you will not be disappointed.",
            "review_date": "2020-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The strong connection between man and dog",
            "content": "The film prooves the strong connection between man and dog...\nAlso the scenery is out of this world..\nA nice and extraordinary film",
            "review_date": "2020-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant.",
            "content": "The best hero dog movie I have seen. Great scenery! They did an amazing job with snowy and cold weather conditions - it looks very realistic. Funny, warm, moving, thrilling... This will touch your heart. Have some tissues ready, dog people, because you WILL cry.",
            "review_date": "2020-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredibly INCREDIBLE!!!!",
            "content": "Sorry I can't type too much cause I can't hold my tears. I just saw the movie by chance and I can say that it won't be forgotten for a while Great screenplay ,great soundtrack ,nothing to say just amazing",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Exciting and Sweet family movie",
            "content": "Loved this movie. It told the real story of what happened that winter of 1925 in Alaska. I loved Balto as a little girl (the cartoon). I didn't know Togo was the real hero and the one who ran the majority of the sled run to get the serum. I cried the last 15 minutes of the movie because I just fell in love with Togo's character. Such an amazing dog.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great story!",
            "content": "Be prepared to cry like an 8 year old... Wonderful inspiring story.. Great direction, cinematography and acting.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "wow",
            "content": "Its a marvellous film...highly recommended....................",
            "review_date": "2020-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It touch my Heart🖤",
            "content": "I love this movi. Togo touch my hear. My eye was in tears in the last part of the movie💔\nTogo 🖤",
            "review_date": "2020-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's a Wonderful and amazing movie 😍😍😍",
            "content": "The move is cool i love it . Togo is so cute and the other dogs 😘😘😘😍😍😍😍",
            "review_date": "2020-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm In AWE",
            "content": "My 5yr daughter and I loved this movie so much that we watched it a second time in one day. It is a MUST SEE! So thankful for this beautiful movie that is soooooo good and great for the whole family. The music is captivating throughout. The scenery is stunning and the animals will capture your heart. Togo is magnificent!",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thrilling even if errors",
            "content": "The directing is not perfect, music sometimes does not fit and some comic scenes are a bit out of subject. But Defoe is good and dogs even better.\nI was not very touched by the film until the last part of it that really hit me. Tissues may be useful.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Togo'\" where no dog could before..Amazing!!",
            "content": "Beautiful, beautiful, beautiful..What a wonderful film. I cannot think of a better, more beautifully told and shot film. Defoe is fantastic and if you don't fall in love with this incredible husky and call your next dog Togo I'd be amazed. I rarely review but just had to for this film. My wife cried for 10 minutes at the end, so moved by the whole film. Fantastic if it were fiction, simply incredible because it was true.",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Exhilarating, Uplifting Adventure",
            "content": "Togo, the true story of a sled dog who led the 1925 serum run across treacherous Alaskan tundra is an exhilarating, uplifting adventure, capturing the powerful bond between man and dog.Dog lovers and cinephiles alike will love it! Willem Dafoe delivers a hauntingly beautiful performance. Dog, or in this case Togo, truly is man's best friend.Warning! You might cry.",
            "review_date": "2020-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful and Amazing",
            "content": "One of the beautiful movie 🎥 ever for me. A must watch. Indeed Togo is most herioc animal.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo is an endearing and well told story!",
            "content": "Bolstering great visuals and cinematography. Togo not only is a great technical achievement but a great story too. A film that soars! Highly recommended for everyone.",
            "review_date": "2021-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The product of a beautiful story plus a master actor.",
            "content": "This is a magnificent movie about a man and his dog. I pray that Mr. Defoe makes another dozen movies like this. He is one of the masters of our generation and this is a spectacular film.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo has heart!",
            "content": "What a great watch! Adventure, drama, comedy, thrills and cries. This pic had it all in a very well told story with fantastic flashbacks. And that great ending..\nWill be one of the best reviewed movies of the year. Good going on this one Disney!",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie was so bad",
            "content": "This movie was so bad I, I had to keep watching because my kids wanted me too. It had terrible acting and the plot was boring.",
            "review_date": "2021-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I always love dogs",
            "content": "His heart runs faster than his legs. There are many warm stories about dogs and humans, not just in the movies, but in real life as well. Dogs will always be man's best friend, a warm and intimate relationship with each other.",
            "review_date": "2020-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo is magnificent",
            "content": "The truth has finally been revealed. Togo and Seppala are heroes. I am so moved by the bond between them.",
            "review_date": "2020-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this movie filled with inaccurate historical information",
            "content": "This movie is not about a dog, is about an angle who save children during a run into a storm, passing 600 mile in a deadly roundtrip, saving his owner and the pack.I don't recommend watching this movie unless if you want to be reminded how much dogs (sorry I meant angles) are awesome, loving and loyal, Also, you gonna cry, you can't be with the present of an angle like Togo without tearing yourself apart.the acting is annoying because is outstanding, Mrs.Seppala she's really suck because she's full of love and compassion and wisdom, and Mr. Seppala is more annoying because he love his dogs so much.This movie just gonna remind you of the bad reality where human can't survive without our angles, and how they saved us over and over with unconditional love.finally it's so bad that I can't give this movie any raring above 10, that's unfairof course you know by now this movie is just one of the most amazing stories ever portrayed in the TV, and I'm just here to ask you why you haven't watch it already? what are you waiting for?",
            "review_date": "2020-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10/10",
            "content": "Spectacular film. Beautiful story with a amazing dog.",
            "review_date": "2019-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie of 2019 bar none!",
            "content": "Short and sweet. Great cinematography, real dogs, acting is superb, and really tugs at the heart. Brilliant!",
            "review_date": "2020-02-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A touching true story",
            "content": "This is a touching true story of the friendship between a dog and his master. They face some unimaginable challenges & overcome obstacles together. The dog also has a very special character, which is definitely not the easiest and simplest one. It all comes down to the situation where a lot needs to be put at risk for the greater good. Here the friendship and trust between the dog and the musher, as well as the character, skills, and determination of both are being seriously measured & put into a test of a lifetime.",
            "review_date": "2021-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Huge disappointment",
            "content": "The premise shows there should be breath-taking scenes but the stupid person incharge thought they should fill the entirety of the film with digital bluring with overstaurated chromatic aberration settings which just proves better technology does not make something better so Togo goes to the bottom of the pile well below the live action remakes and the made for TV movies that Disney as done which I didn't think would ever happen.",
            "review_date": "2020-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Alaska My Home",
            "content": "Absolutely love this movie. It's very inspiring and a movie you'll be thankful you watched. I grew up in the dog mushing capital of the world, Tok, Alaska. For decades until the 1970s Tok was home to the world sled dog championship, and I lived a quarter mile from the start. I grew up watching George Attla and Dr. Roland Lumbard compete with 8 and 7 world championships, respectively. Togo exaggerated the drama of the ice flow breaking up, but they always do in Hollywood. Willem Defoe carried the entire weight of the cast with his commanding charisma. The rest of the cast might as well have stayed home. All except Togo. Love this movie.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely magnificent",
            "content": "I rarely cry in movies but with this movie and this adorable story, I couldn't hold my tears, Good dogs.. HIKE!",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great film",
            "content": "A great film and well acted. Loved the dog and very emotional. A must watch for an evening",
            "review_date": "2020-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart Attack",
            "content": "I heard a thing. If you feel sad enough, you may have a heart attack. This film, this story prove that..",
            "review_date": "2020-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Should have gotten Academy Award nomination for 2019",
            "content": "We subscribed to Disney + and my 6 year old son loves dog movies, so I thought we would try it out, expecting it to be a campy Disney movie. It wasn't. The best movie I have seen in 2019. Should get best picture nomination IMHO. It is based on a true story, but of course the details are dramatized. The cinematography will take your breath away. Living in Nome Alaska in 1925 would be like living in hell for most of us, but it still shines with beauty - the mountains, the ice and oceans. The story was interesting and I learned much about the illnesses that struck then and dog sledding. The acting from the dogs was the best I've seen in a Disney film. And Dafoe fit the mold of a Norwegian immigrant to Alaska. No movie is perfect so I only give it a 9, as there are SOME boring parts I suppose.",
            "review_date": "2020-01-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dogs are the purest living souls on the planet.",
            "content": "Beautiful film about a mans relationship with his dog.",
            "review_date": "2020-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I've seen better films with worse reviews.",
            "content": "Maybe it's because I'm european but I don't know anything about this story whatsoever and this movie is my way of discovering it. That being said.. what's with all the praise?The Special FX and cinematography are bad, everything looks fake, I don't think I've seen a sky that wasn't added and/or created in a computer... And what's up with the weird blurry letterbox and digitally added pixel noise?? It's awful and just made the film unbearable to watch. The soundtrack is just an annoying violin playing the same 3 notes for the entire movie. And I haven't even started on the story...For me the story was painstakingly predictable and just boring, it felt like the entire film was the exact same scene with different dialogue options. Not a single character was actually interesting and the flashbacks are unnecessary. I didn't feel a connection with any of the characters and therefore the movie never really touched me.As the titel says... I've seen some great and fun films that don't get the praise this film does. And it feels like a lot of people are just biased because they liked the story before they even made it into a movie. It's certainly not a \"bad\" film but it's also not nearly worth the solid 8 it has at the time of writing this review.",
            "review_date": "2021-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "what can i say",
            "content": "I watched the movie with interest, a very beautiful and sad movie",
            "review_date": "2020-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie",
            "content": "Amazing, it really touched my heart, the bound between man and a wolf was unbelievable, they were more then friends! Extremely emotional, in the end the tears came.",
            "review_date": "2020-12-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "#Togo is the 2nd best after #Hachiko 😍",
            "content": "Another favorite Dogs movie & another dog deserves an Oscar..",
            "review_date": "2020-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie and finally Togo gets his recognition!",
            "content": "This is one of the best dogs movies you'll ever watch. Incredible true story, great filming and acting. Enjoy!",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect movie for #stay-at-home with your kids",
            "content": "Just watched this with my 3 kids during the COVID lockdown. What an amazing story, so beautifully told.I'm a 45-old cynical jerk, but my heart was literally _aching_ during the frozen bay crossing scene - are they gonna make it or not? Will they reach the shore or not? What if they drop the antitoxin?All my kids kept crying after the movie ended, so we actually had to go to Wikipedia to make sure that Togo had survived and actually lived happily years after the run. Only after doing all that the kids have agreed to go to sleep :-)PS. Kudos to Willem Defoe and Julianne Nicholson for perfect acting and huge thanks to the film makers for creating this.",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dogtastic",
            "content": "Watching in 2021.We are a cat family but after this my family want a dog. Great cinematography and use of greenscreen. The scenes across the ice were exhilarating with William Dafoe expelling dialogue like a shakesperean monologue as the ice fractured all around. A fantastic performance from the lead acting dog to such an extent I was in floods of tears with my 10 & 11 year olds! A Disney triumph! Ps ... I'm looking for a dog tomorrow!",
            "review_date": "2021-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A \"Hero-Movie\"",
            "content": "A strongly touching film. I didn't expect less from Disney. It's based on a true story and this makes it more interesting to watch. The Disney company gives life to a story that reminds us the animated movie of Balto. Heroic actions, adventure, love between man and dog and real life difficulties with William Dafoe on a pretty good act. I totally recommend it, especially for dog lovers. Huskies for the win!!!",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A mediocre movie about an outstanding story",
            "content": "Great Race of Mercy. One of the most beautiful and touching pages of the History of Humanity. Leonhard Seppala and Togo. Successful beginning of massive vaccine company in the whole USA. The birth of the modern Siberian Husky race, both working dog and home pet.I don't pretend the respect of all historical details. But at least the main points should be revealed. We are speaking about the risk for the life of at least TEN THOUSANDS of persons, leaving in the zone! In the movie seems that they are trying to save only a handful of children. No idea at all about the caliber of the possible catastrophe. No idea about at least 5 dogs that had lost their lives during the Race, no idea about the numerous frostbites of the mushers.It could be a really GREAT movie. Great and touching. I expected so much to see it... really disappointing. It was just flaccid. Flaccid and somewhere boring. What a pity. I advise everybody who liked this film - just try to read about the real story. Wherever you want. Also Wikipedia can be OK. It is much more moving, trust me!",
            "review_date": "2020-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A man and his dog",
            "content": "A true story about the misunderstanding that we humans have about the relationship with the amazing canine. As the movie unfurls with beautiful landscapes we learn of the heroic yet miraculous feats this lovely animal performs, while we believe that he is driven to his task.\nAs the musher later admits it was not the drive to achieve the duty it was a drive to be with and work for the human, my goodness they are amazing creatures.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loved it",
            "content": "Special effects were a bit OTT, certainly didn't expect a historically accurate documentary as some reviewers clearly wanted, as for the animal rights activists, pretty sure this wasn't considered a 'hobby' back in the 20's.As a film, thoroughly enjoyed it, serious story line with a touch of humour.",
            "review_date": "2020-06-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It brought out my man tears",
            "content": "I haven't cried in a real long time. Any movie that can do that to me gets a 10/10.",
            "review_date": "2020-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best of its kind",
            "content": "What an awesome story of courage & resilience. Togo has several valuable lessons to teach your young ones. A family friendly movie, perfect for any occasion.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant movie. One of the best dog movies I ever saw.",
            "content": "This movie is simply amazing. Actors were great. Willem Dafoe does a great job, no doubt (one of the best his performances, I dare to say), support characters are good too.The story itself is incredible. It helps you to make a different view about the 1925 serum run. Not to discredit the dogs, they were simply spectacular.By the way, it was one of the few movies that made me let out a tear or two. So, absolutely a must-watch.",
            "review_date": "2020-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant",
            "content": "Loved every minute of this movie. A family must, especially for all you dog lovers out there.",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo finally gets the credit he should have gotten decades ago!",
            "content": "Disney did true justice to a story that has been long overdue in telling. They also did a wonderful job in showing how stubborn the Siberian Husky breed can be, and how this breed has hearts of gold. Casting Willem Dafoe and Julianne Hough was a brilliant move, and it is probably my favorite of Dafoe's works. I think this movie would have done spectacular as an actual theater release, but thrilled with it all the same!",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I cried a few times, it was wonderful!",
            "content": "I loved it! It was such a touching story! I wish Disney would make more of these movies in stead of those bad remakes. It's a beautiful story and well directed and acted! It got me on the edge of my seat at some points. It also made me cry a few times! I think it's so wonderful, because it's a great and simple story, but with a lot of heart in it!",
            "review_date": "2020-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Forget Togo and open your eyes",
            "content": "Another Hollywood lie and cover of the actual truth behind sled dogs. Togo is one of the victims of another cruel hobby. He was a hero in the eyes of all the blind and just a majestic animal for the rest of us.\nA Hollywood movie with not such a glamorous behind the movie story.",
            "review_date": "2020-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Th best thing for me in 2020",
            "content": "Thankfully Disney+ coordinatd with hotstar due to which I was able to watch this. Watching this movie is the only best thing that has happened with me this year. I am completely moved! And I am So happy that I named my dog Togo.",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Sweet Family Movie to Watch With Your Dog",
            "content": "I don't know if it's the pregnancy hormones or if I just really loved this movie, but I'm practically tearing up writing this review. It was such an unexpected gem - and I learned something I never knew about. I just happened to turn it on one evening as I was sitting with my toddler who loves dogs and thought it would be something good to have going on in the background while we played and hung out. And then Willem Dafoe's face came up on the screen and I was like \"Okay, you had my interest, but now you have my attention.\" The film struck the right balance between moments of suspense, heartwarming scenes, funny moments where Togo is being a mischievous pup, and the few scenes that had me vigorously wiping away my tears before anyone could see. It wasn't too heavy handed in any of these areas, in my opinion, and I appreciated the history lesson that came with it. I also appreciated that it had an overall happy ending. I generally refuse to watch animal movies because they piss me off when something happens to the animal, but this ending had us walking away feeling happier and more connected to our own mischievous pups than before we started watching. Dogs truly are man's (and woman's!) best friend!",
            "review_date": "2023-03-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful film & story",
            "content": "Get your tissues ready before watching this film. It's a real tearjerker. We watched this as a family, aged from 9 upto 55 & we all thoroghly enjoyed the whole film.\nThe acting is fab but the stars of the show is most definiatly the dogs.\nPrivelleged to have learnt that it was a true story & have read into the real life story of Togo.\nA must watch, especially if you are a dog lover.",
            "review_date": "2019-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "How faithful are you Togo",
            "content": "That's the best movie ever. How can a weak creature proves himself to be the leader.",
            "review_date": "2021-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LOVE",
            "content": "Whether we are talking about the music, cinematography, casting, or storyline, I truly do love this movie.\nI learned so much and am glad Disney brought out the actual true story of Balto.",
            "review_date": "2020-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Real inspiring story the bond and trust between a man and his dog",
            "content": "Whether you love dogs or not, this story will inspire you. Defoe does an amazing job as the main character (does this guy ever age?) and really shows his love for the lead dog Togo. The Alaskan tundra acts as the third character and its majestic views are worth the 2 hours alone. Great movie for the family and not too sad (happy-ish ending). Bravo Disney!",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Must Watch.",
            "content": "If You Are A Dog Lover its a Master Piece For u No Doubt Dogs are the Most Loyal Creation on Earth Love You Togo.",
            "review_date": "2020-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Now I know the rest of the story",
            "content": "I knew about Balto and that it was a dangerous run, but as is often the case, the truth is more difficult to believe. It doesn't seem to embellish the already amazing story, which is why I really liked this movie.\nThe movie is also safe for younger children to watch.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Great Movie",
            "content": "Truly a great movie with a hero dog and a hero musher. They deserve all the praise and love. Togo is a brave dog. Being a avid dog lover, this movie will appeal to your hearts. The recognition is late but now we know the real heroes.",
            "review_date": "2020-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10 Stars isn't enough",
            "content": "This is a great inspiring movie. Movie making at it's finest. I've never seen a better film and I have seen many.",
            "review_date": "2021-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "What an amazing movie! 10 out of 10 stars! Based off a true story! The cast did an great job! You had to be rooting for Togo. Togo did great!",
            "review_date": "2020-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Remote and wild",
            "content": "Alaska is, and continues to be, one of the worlds last great frontiers. And the Iditarod, and the dogs and mushers who run it, commemorates perhaps the greatest story of this frontier. Lifting through the nearly 1000m high Rainey Pass, crossing the treacherous Norton Sound, across terrain so inhospitable that even to this day there are no roads there.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "LOVELY And BRAVE \"TOGO\"",
            "content": "It's an amazing movie with a lot of crying 😭\nAll the people who loves animals .. specially the dogs 🐕 🐶, for sure they will love this heroic dog \"TOGO\" with the amazing instinct And the brave heart and therefore they will love this movie !\nIt's from the movies that you want to see many times ! 🎥 🍿",
            "review_date": "2020-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A movie about a bunch of dogs?",
            "content": "Watch this movie. Watch it especially if you are an animal or dog fan. Couldn't believe that a movie that is basically based solely on a guy on a sled with a bunch of dogs would be so captivating.\nThis is an amazing family movie with just good clean entertainment.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Even my dog watched it. I am a proud dog(3s) mother and I loved it.",
            "content": "I wish I could upload the video with my dog watching the movie 🙃 Sopiler!!! You will definitely cry like a baby if you are a dog lover !!!",
            "review_date": "2020-04-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow!!",
            "content": "A beautifully shot, amazingly acted and fantastically told story. I can't recommend it enough.",
            "review_date": "2020-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must for every dog lover",
            "content": "Just go watch it!! It's a must if you love dogs!\nIt's so good to see that the movie just does what it's supposed to do and doesn't squander time on useless drama.",
            "review_date": "2020-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Movie",
            "content": "Just finished watching this movie and there aren't enough words to depict how highly I recommend it.\nAs a proud owner of a 1 year old Siberian Husky I can assure everyone reading this comment that they are, indeed, this smart.\nAs example, a bit shy of completing 14 months and the little rascal opens doors, gates, gets through every kind of barriers and even found a way to get over a 2 meter high protective net over the yard. Escape artist is the perfect term to describe it.\nThere is nothing you can throw at a Husky that will separate him from his owner and the movie Togo perfectly describes it and makes you fall in love with such a beautiful story, a beautiful dog and a beautiful breed.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply great.",
            "content": "A true, uncomplicated story, told effortlessly that brilliantly keeps you watching even if you think you know the true history of the 1925 Nome serum run and the dog sled race it led to.\nGreat for the whole family.... But dog loving adults beware if you don't want your kids to see you shed a tear or two.",
            "review_date": "2020-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding film",
            "content": "This movie will give you a true flavour of history. The cast, cinematography, adaptation, everything was perfect. I had a dog once, Togo kind of reminded me his reflections. Personally I prefer true stories adapted to film & this one will be one of the greatest of all time. Well done Disney for bringing this into screen.",
            "review_date": "2020-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful movie!",
            "content": "This is such a beautiful and emotional movie! The best movie I have seen in the last time...",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good film. Amazing dogs.",
            "content": "What a great story about tremendous dogs. Anyone who's loved a dog knows their loyalty to their master. Togo, whilst in extreme circumstances, is a story of just that.\nA great decision, on the part of Disney and the writers, not to make a sob story at the end with Togo's death but rather a happy end to a brilliant dog.",
            "review_date": "2020-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Right in the feels",
            "content": "I could only cry during the movie.. it's so touching",
            "review_date": "2020-07-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fall in love of Togo",
            "content": "Excellent movie and story selection. We always dont crave for glory, we work hard. so that in the last we are remembered. Togo remind me that.\nExcellent background music. in last half an hour the music was so charming credit sound also touch my heart.\nWelcome disnep in the world of net streaming.",
            "review_date": "2020-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding",
            "content": "Best dog movie ever in the cast are fantastic Willem Dafoe once again shines as he always does in whatever he does.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie",
            "content": "Amazing story one of the best dog movie ever. Togo is an amzing heroic dog.",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Better than Balto!",
            "content": "I've seen Togo a few times, and I love it. It's based entirely on the excellent story of Togo, a sled dog with intelligence, stamina, courage, and, most importantly, heart, and his crucial part in saving Nome, Alaska from a horrible diphtheria epidemic. Togo looks almost exactly like he did in real life, except for the eyes. Willem Dafoe is excellent in the role of Togo's musher, the famed Leonhard Seppala, and delivers so many funny lines (\"Next time I go the wrong way, you tell me to go to h***!\")! The story is very touching and amazing at the same time!!!! And most importantly, this movie delivers a heartwarming message that even when loyal dogs leave you, they'll stay harnessed to your heart until the day you leave this world behind! It also acknowledges that while the press gave the credit to the final team's lead dog, Balto, and his musher, Gunnar Kaasen (since they actually brought the medicine into Nome), and Balto even received his own statue in New York (which I visited), Togo will always be remembered as the true savior of Nome, since he lead Seppala and his team across the most dangerous bit of the serum run.Overall, Togo is a remarkable improvement over Amblimation's 1995 animated box office disappointment, Balto, which was far too mean-spirited and riddled with uncanny animation and historical lies, including violent and scary moments that never happened. I can't believe Steven Spielberg would subject kids to something like that!!!! Balto's only redeeming factor was probably its music (the late, great James Horner's thunderous score and Steve Winwood's gorgeous, inspirational blue-eyed soul ballad, \"Reach For The Light\"). Avoid Balto, but Togo is a compulsory viewing.",
            "review_date": "2021-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A authentic true story and a genuine tear-jerker",
            "content": "Togo hitting me in ways I was not prepared for. As a historian the events that it covers are completely remarkable. As and academic with a BFA in film production I appreciated all of the nuances that were so well done. This story gets you invested in the characters and the reality of not only their situation but their history. Best investment pays off in spades. I found myself crying uncontrollably. I realize that I am hypersensitive because of the pandemic. But that takes nothing away from an incredible story of human nature combined with animal nature combined to save a society with unfathomable obstacles in the way. This is a must-see film. I would watch it again tomorrow. Must see.",
            "review_date": "2020-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie that I have seen for a while",
            "content": "I love you Togo! Wish you lived longer. You will live forever with our hearts. The adorable and best dog, Togo . Truly dogs are man's bestfriend.",
            "review_date": "2020-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional and beautiful movie for doglovers",
            "content": "Never give a review avout a movie, but as a doglover this movie was very beautiful and emotional. Hugged my dogs so good after this movie.. Love your pets people don't ever hurt them no matter what they do, because they love you always!",
            "review_date": "2020-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just wow cinematography",
            "content": "Oh my god what a great movie and amazing cinematography.",
            "review_date": "2020-06-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo, the lead dog",
            "content": "It has been a while since I've watched a good movie.",
            "review_date": "2019-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fantastic",
            "content": "One off the best films if not best off the year.. Togo has everything pulls at heart strings ..makes you laugh ...plenty off action... just a really great enjoyable film for the whole family",
            "review_date": "2019-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Story Great Film",
            "content": "Had a right little sob on! Heart warming yet sad all at the same time. Outstanding scenary Strong acting, could have if possible read more into the lives of people of Nome. Really nice film.",
            "review_date": "2020-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo - the heart of a survivor and a hero for the ages",
            "content": "If anyone is looking for some inspiration for a film to watch, try Togo - available to stream on Disney+.Now, I wouldn't usually write a film review, but this one made such an impression on me, I feel I must do my part and spread the word.Firstly, this is a film about a 12yr old dog who pulls a sled 250+ miles in one of the worst Alaskan blizzards on record, to get a desperately needed diphtheria anti-toxin to the Alaskan town of Nome in 1925. The feat itself is truly incredible. There are no words, Togo is one of a kind. You may have heard of Balto? Well, this film is a historical correction of immense proportions. Turns out, Balto only ran 20 miles of the 640+ mile \"great serum run\" as it is known. This film is an emotional rollercoaster - it's fun, exciting, heartwarming and just what you need right now (trust me).Secondly, the acting, cinematography and cgi are amazing. Ok, this film is all about the dog, and what a powerful film it is, but I truly did not expect the visual feast that was scent (couldn't resist) my way. It's astounding what can be done these days.And of course, no film review would be complete without a mention of the soundtrack. It's good. Really good. And features some recognisable music (Arrival anyone?)It isn't very often that a film really moves me to want to tell the entire world about it. But I feel this film is such an underrated movie; I'd never heard of it before seeing it in the rolling promotion carousel on Disney+, and let's be honest, neither had you. And, like me, you'd probably never even heard the name Togo before. But you have now and all I can say is this film is full of heart and packs a powerful punch and is really deserving of a watch. And yes, it's very family friendly.So after you've watched it, if you're anything like me, when the credits start rolling, you might find yourself heading to Wikipedia to find out more (sorry it's the inner geek in me!) and believe me, you won't be disappointed.Watch it and thank me later.",
            "review_date": "2020-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The story could have been told in a much better way than this. Make your 10 year old children watch it.",
            "content": "I am not even giving 4/10 to make the ranking of the movie lower. I think it deserves 4, and I think people are giving 10/10 because it is based on a true story, and it is a dog movie.The worst part is there was no emotion in the movie. They figured out everything quickly. There was always a quick solution. I never felt like they could not have done it. I never felt the failure so they can come back with determination, passion and ambition. Everything was too quick yet the movies is really boring.He did not accept the dog at first since he was a bit too playful and moving. However, one day he accepts him suddenly.The script is too poor. I just watched the movie yet I dont even remember any quotes from the movie besides Dafoe saying \"Good dogs!\"The story could have been told from a different perspective, so it is not always \"Togo, Togo\"\nThe scenerio could have been much more emphatic, powerful, and uncertain. Therefore it is more gripping and shocking.I am a bit dissappointed in the imdb ranking. So I felt like I had to write a review. There are much more impressive movies than this to make your children to see.",
            "review_date": "2020-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hachiko lovers shouldn't miss this",
            "content": "Not just a movie , story of the brave dog which saved the lives of many people. TOGO is born with the heart of a survivor ! Inspiring to many !",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "These are heroes! This is courage!",
            "content": "All you see nowadays are people throwing around the words \"courage\" and \"heroic\" to describe any mundane event or unremarkable person.\nThose words should only be used to describe anyone like the two main characters of this film.\nThis is more than just a tale about a man and his dog. This is a beautiful story about bravery, determination and risking all because it's the right thing to do and not in an attempt at glory.\nI cried alot during the movie and now thinking of it I'm crying too. It's that touching and moving.\nTo think these two characters did what they did and aren't both immortalized with a statue or something is just inexplicable.\nThis film also taught me about a certain breed of dog that came into existence because of the real Togo.\nWillem Dafoe proves again he's the European definition of actor, a true artist.\nI was also relieved to see such a strong female character! Finally! I always admire these type of women that people often overlook or don't appreciate because she's a wife, a friend, a homemaker and a man's driving force.\nAnd many times throughout the film her husband talks about her in a way you can tell there's alot of respect and admiration for her even when he says she's stubborn it's a compliment trust me!\nWhat a beautiful marriage.\nThe wife is also fundamental to the story in different ways not just as the man's safe haven from the world. But I can't explain why without giving away the story.\nThat dog... one in a million. To be lucky enough to have had a dog like that must be extraordinary.\nI almost didn't watch this film because my mind was comparing this to 2 other movies \"snow dogs\" with Cuba Gooding Jr and that Paul Walker film \"Eight Below\". Thankfully I ignored my mind's comparisons. This film is more in tune with \"Eight below\" but it's in a very different tone. I liked \"Eight below\" alot and \"Togo\" too.\nThis film requires your full attention because it jumps from one time to another. One minute you're seeing Togo as a pup the next Togo is struggling for survival. It doesn't confuse you if you're paying attention and it's also an interesting way of telling the story.\nI didn't give it 10 stars because of a few scenes I don't agree with that have no relevance whatsoever to the story but were added for the reasons I don't agree with and I can't say what or this website will censor me and also other than that, this movie is a must.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful",
            "content": "Very emotional movie, a fantastic story about an outstanding dog and the unbreakable love between him and his owner.\nSiberian Huskies are such incredible dogs.\nOne of my all time favorites right here.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thank you, Disney for this masterpiece.",
            "content": "Justice was done to the true hero of 1925. Now we have a wonderful movie to remember Togo forever. Also Willem Dafoe deserves an Oscar. I can't explain it, but he managed to demonstrate a connection to Togo in a very emotional way. It is just amazing how you can see true emotions in his eyes.",
            "review_date": "2021-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly moving movie",
            "content": "A tale of determination, bravery and the special bond between dog and man. Disney, you never fail to disappoint.",
            "review_date": "2020-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie",
            "content": "A movie that not only touches your heart and soul, but gives you so many extraordinary visuals and landscapes that you forget you are watching it on your couch.What I loved the most though, is that the movie took its time to introduce each character and specifically togo. They could have just go on and say this dog is amazing, but they show his side of the story and why he is great compared to other dogs.The poems the visuals and man the ending brought tears to my eyes. What else do you want from a movie. It moves you inspires you and takes you on a memorable journeyA masterpiece in my humble opinion.",
            "review_date": "2022-09-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Disney movie in years",
            "content": "Perfectly paced story, an historic event and how a Norwegian migrant and his dogs saved a town in Alaska which was suffering from a terrible pandemic.It's the story of a couple who bred sled dogs, and one in particular who was the greatest hero and friend.The script is really good: the friendship between the protagonists, the sacrifice and the endurance... the performances are really good.Fans of history, family values, dogs and nature are not going to be disappointed watching this movie. And if you happen to have two Labrador retrievers as part of the family they will reward you for letting them watch the movie with you.",
            "review_date": "2020-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very emotional and lovely movie.",
            "content": "You are going to love dogs more and more after watching this movie",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the Best Movie Of the year 2019! Must Watch!",
            "content": "Great story! What is the definition of True Friend, Loyalty and Unconditional Love?\nYou will find out by watching this Movie.\nI would Highly Recommend to Watch it.",
            "review_date": "2020-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breathtaking",
            "content": "Must watch movie, for all of those, who need to know till what extent relationship of men and dogs are meant to be, why they called 'beastfriend of men'.",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Will be amazing apparently",
            "content": "Getting tears in my eyes before I watch it.. I'll report back. I doubt I cry during this movie. :)",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Highly enjoyable throwback to the classic age of Disney",
            "content": "If you were a kid in the 60s and 70s and you remember the Wonderful World of Disney on Sunday nights, this is the kind of movie that exemplifies that style. It's sentimental and comforting, But because it's the 21st century, there is the addition of special effects and CGI to evoke the world of mushing and dog sled teams. This won't win any awards but it's well made and highly enjoyable. Yes I shed a few tears.",
            "review_date": "2021-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a fantastic movie",
            "content": "We all know about Balto because he got all the media attention, little did we know about the rest of the story....amazing cinematography, stunning film locations and Willem Dafoe is excellent. We watched this the day after Christmas, and couldn't keep a dry eye. Even our dogs were watching the movie!",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heart touching Togo",
            "content": "Stumble on this movie and decided to give it a go after looking at it's reviews. Definitely worth my time. Absolutely loved the dogs, the actors were brilliant and also felt the sadness the movie tried to express. I Recommend",
            "review_date": "2020-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent!",
            "content": "Such a touching movie based on a true story definitely deserves to be told. Great acting and heartwarming story from beginning to end. Don't miss this movie, definitely well worth your time.",
            "review_date": "2020-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Missing the point",
            "content": "Togo depicts one of many acts of cruelty towards these beautiful creatures. Living conditions for these dogs are so bad, most die from disease and starvation. PASS",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Story",
            "content": "A heartwarming true story. Very well acted and very well made. Great job to all involved who made this film. We greatly enjoyed it.",
            "review_date": "2020-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely touching!",
            "content": "Wonderful story, great actors, exceptional director.",
            "review_date": "2020-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo The Magnificent",
            "content": "I recently adopted a dog, which is totally new for me. Though I get irritated with my dog, I still love him with all my heart. This movie is magnificent like Togo was. I am really thankful for the makers to bring us the story of Togo.Thank You",
            "review_date": "2020-01-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredible Story, Incredible Movie, Incredible TOGO",
            "content": "This is by far the best dog movie, I've ever seen, that's counting Hachiko. Its not a movie only about dog, but a hero and a leader. The human story is very deep to, and you feel urgency and importance of the task at hand.\nI watched this 2 month after my own dog passing, and couldnt stop crying my eyes out. Its touching for all the good readons.",
            "review_date": "2020-05-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "marvelous",
            "content": "How kind, loyal, beautiful, and loving a creature could be?\nI wish that all people learn faithfulness and kindness from TOGO",
            "review_date": "2020-03-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rose above my expectations",
            "content": "When I read the few lines about the movie, I thought it sounds like the old animation \"Balto\", which I loved as a kid. So I wanted to give this one a try. Similar to \"dog-movies\" this one is based on a true story and from what I could understand, shows the truth in a more clear light compared to the adaptation of Balto. And it is almost 100 years ago this took place.The purpose of the film was to portray a story and the connection between man and canine, and I believe it did so perfectly. The last 30 minutes of the film i was crying on and off.The camerawork is excellent, as is the acting. The whole film except for one particular part (that was added for excitement) feels genuine and believable.So in relation to what the purpose of this movie was, its deserves at least 9/10.\nEveryone that has ever owned a dog will love this movie. And people who didnt own a dog will want one!",
            "review_date": "2020-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "Great movie with one of the best actors.(Dafoe)\nDisney did it again!",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lump in my throat",
            "content": "Very good film, very heart warming, watched with my 11 year old daughter and we were both on verge of tears. The scenery was amazing and the story was brilliant, I understand Hollywood change stories for true story movies but im watching to be entertained and i certainly was if i wanted facts i would watch a documentary. Highly recommend this movie",
            "review_date": "2020-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the few movies that made me cry",
            "content": "Beautiful. Not flawless but definitely beautiful. It really keeps you on edge...",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie.",
            "content": "After watching this movie and great performance by Willem Dafoe I changed my mind about Balto, this heartbreaking movie is great and I recommend it to everyone.",
            "review_date": "2020-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best movie for my heart.",
            "content": "The best movie of all time for my heart. TOGO the ultimate dog with good human heart and great power.",
            "review_date": "2020-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Excellent and Inspiring Adventure with Togo",
            "content": "Togo based on True story, when I imagined it I have no words to speak about it. Togo speaks more about a pet's Loyality towards his owner and his risks on saving lives. I will assure that this movie will satisfies little special for pet lovers mainly Dog lovers.\nYes, the task for Togo and Seppela is to save the lives of many children in danger for that they should take a Tough journey.Between the journey we can see lots of Joy,Happy,Emotion, Inspiration,Care along with the Hardwork of this Togo sled team.\nVisuals are so good to watch as seems like us living inside the world of Togo. I liked the Screenplay more and its neat along with all Technical aspects.\nBut I have one big worry about the movie on its release. They not released it in theatres and Worldwide, making the movie not popular and unknown for most of them is Major Drawback. Since My request will not be received by any crew members of the team but I here say heartfully that, to kindly release the film Worldwide in Theatres and don't make the movie worthless\nVerdict : Must Watch Excellent movie\nBest scene : (1st time to present this column Togo made me to do it) When Seppela thought that Togo is Happy while Hiking as lead dog but later realizes Walking with him is important for Togo that's what makes him happy, where Loyalty lies on his Owner ( My eyes got Wet on that scene as well as Seppela had while seeing Togo sitting on a Ridge)",
            "review_date": "2020-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely fantastic and masterpiece",
            "content": "This movie is one emotional, heroic and beyond words.",
            "review_date": "2020-03-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just incredible",
            "content": "What an absolute beautiful movie. From the acting, cinematography, and just how quickly I fell in love with Togo.I was on the edge of my seat for basically the whole movie. It made me laugh. Smile. Cry. I felt anger. All emotions- it was a lot. The only reason that I didn't vote 10/10 is because I am actually exhausted from all the crying I did. 😂😂What a wonderful movie.If you're looking for a wholesome movie to watch, I strongly recommend Togo. Now to go do research to learn everything about Togo. What a hero. Animals really are just soo much better thank humans, in every single way. K bye.",
            "review_date": "2022-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Corrects The Historical Record",
            "content": "Since 1925, Balto has earned universal acclaim, legions of fans, and a commemorative bronze statue in New York City's Central Park. But Togo 2019 corrects the historical record in favor of an underdog. As it turns out, Balto was just one of more than 100 pups who made that lifesaving dogsled relay to Nome possible. Balto did lead the canine team over the final 55-mile stretch of the journey. But, the real hero dog, Togo, ran 264 miles and led it through some of the riskiest spots.",
            "review_date": "2020-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect movie and perfect actors",
            "content": "Perfect Perfect movie and perfect actors it has been time since I enjoyed a movie",
            "review_date": "2020-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "No 1",
            "content": "Everyone should watch this one. Respect Togo, animals are more human then us",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Best Dog Story Ever!!!",
            "content": "This is The Best Dog troy Ever I Have Ever Seen! It Shows the Loyalty And Love Of A Dog For It's Master. I Was Crying in The End The End Scene was Just So Touching And Amazing! You Should Never Miss Such A Movie!!!! 👍👍😍💖💖👍",
            "review_date": "2020-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Something that had to be told, and very well made movie",
            "content": "Probably one of the best Disney movies in a decade, well cast, well filmed, well played, and probably the best way I can imagine to bring the story back to life for the current generation.",
            "review_date": "2020-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing Movie!!",
            "content": "This is honestly one of the best movies I have seen in a long time. It was so nice to finally watch a heartwarming movie that has adventure, excitement and emotional highs and lows that completely absorb you into this movie. I was on the edge of my seat just enthralled with the storytelling and the emotional weight of this story and then for this to be based on a true story! I always had known about Balto but nothing about Togo. Togo and his owner deserve this movie to be out there and for us all to know the real heroes of that story of the relay race. Myself and family all loved it. I still have tears streaming down my face while I write this review! Everyone should watch this movie it is amazing.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent",
            "content": "With This movie i lerned this was the real true story...im really glad we saw it, this film overall its magnificent! Worth watching it!",
            "review_date": "2020-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Beautiful! Marvelous! A MUST watch film!",
            "content": "The film was truly great and showed the perfect courage and bonding between a man and a dog. Really an inspirational film.",
            "review_date": "2020-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Give credit to the dogs who rolled in the movie",
            "content": "Togo was a great dog with all the rest of the pack.. I bet that Sappela praised all of his sled dogs like the actor Willem did \"Good dog Togo, good dogs all of you\".\nSo i was thinking about the dogs in the movie, specially the dog who rolled as Togo.. So, give them some credit as well.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "After all this years a great movie",
            "content": "Thank you Disney! You did it again.\nI'm glad Togo it's getting recognized since he did the longest part of the trip, Balto just did the end although they both saved the children, they both heroes.",
            "review_date": "2019-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a delight!",
            "content": "This movie is incredible in every way. A true story about Togo, who is too adorable as a puppy and the performance of the adult is beyond words. Throughout the story you will laugh and cry, guaranteed. The chemistry and bond between the dogs, Willem Dafoe and Julianne Nicholson is amazing to see and you feel drawn in from the beginning to the end. What an incredible journey those two made, with scenes that are hard to comprehend and impossible to understand how they were filmed. I will definitely watch this film over and over again. I loved it. And above all, Togo gets the attention and praise he deserves.",
            "review_date": "2020-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A gem in the snow!",
            "content": "This is perhaps the best Man animal movie ever made. The direction,cinematic shots, editing and action sequences are all on point. Willem Dafoes performance lends to the emotional aspect as well as amps up the drama for the audience. But no doubt, credit goes to the dogs who portrayed the real heroes of the movie. I have never seen such clean action pieces performed by animals. I love this movie to bits! Togo deserves all the accolades it gets!!",
            "review_date": "2019-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant and emotional",
            "content": "Brilliantly written, directed and acted. A lot of lessons here too about giving the benefit of a doubt and heroism.",
            "review_date": "2020-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie I ever seen",
            "content": "The story line , simplicity ,way to represent ,the last emotional moments ,Togo is the best directed movie I ever seen in my life .Bond of Animal and human .",
            "review_date": "2020-02-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Former jr dog musher",
            "content": "I didn't want to watch this movie, but my wife convinced me to. I lived in Alaska, and had a dog sled and one sled dog: a Shepard husky mix named Winston. He too was a rascal that was an escape artist from the first night I got him as a puppy. This movie brought back a lot of memories of him, and it is spot on for those of us that got wiley dogs that turned out to be our best friend. Now I miss him again-d*** you Disney.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Hollywood\" doesn't mess up the \"real story.\"",
            "content": "There are the mildest of spoilers in the following review - for any who would prefer a completely unspoiled viewing experience I'll just say go watch the movie - quick!Like many, I swallowed the story of Balto being the hero of the Fairbanks to Nome desperation dog-sled Serum Run, and though I knew Balto didn't lead the only team on this heroic 600 mile journey, I had no idea that another team, lead by another dog and driven by another musher had gone 264 miles, including crossing a trecherous frozen sound - twice - while the other 19 teams averaged 31 miles. (The Balto team completed the final 55 miles, which was heroic enough, but as the team that arrived with the life-saving diptheria serum, Balto got to be the hero. Ironically, Leonhard Seppala was the owner of both Balto and Togo, but Seppala wanted the best dogs on the longest and most treacherous part of the journey and Balto didn't make the \"first team.\"As a story, it's exhilarating, but the acting and cinematography and other elements such as costuming and editing and music all add up to by far the best \"dog movie\" I've seen. Playing Leonhard and Constance Seppala are Willem Dafoe and Julianne Nicholson are excellent actors and they have real chemistry with each other and with the dogs. Drones and other innovative techniques are used to capture brilliant \"live\" footage with what I assume must have included some CGI shots for the harrowing journey across Norton Sound, which I don't doubt was breaking up in real life - I learned that the movie gets this part right: the ice had completely broken up and floated out to see the next morning.I'm a little curious: The real Seppala's had a daughter who was 8 and living with them in Nome. For some reason she is not shown or mentioned and there is even a scene where Constance is questioning Leonhard's motivation for making this death-defying run, during which Leonhard explains that they know several of these children and their parents. Since all three household members, but especially young Sigrid, were vulnerable in an isolated town in the midst of a raging diphtheria epidemic with no other cures available, I'm just a little curious why this wasn't depicted in the film.",
            "review_date": "2020-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brutal to watch",
            "content": "All this high reviews have to be bad, this movie was slow, bad acting just awful to watch. I love dogs but this was beyond bad.",
            "review_date": "2019-12-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "20 of 10 !!!!!",
            "content": "Amazing true story and finally a good film !!!\nMust watch.......",
            "review_date": "2020-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect in any conceivable way",
            "content": "As a dog lover and breeder I started watching this movie with the same expectations I usually have when watching dog movies. Did I cry as I usually do, regardless of the ending? I chocked on tears. Togo reminded me of my most special dobermann female that started as a mediocre puppy and developed into an amazing show and working bitch who wrote history for the breed. Togo should be an icon to every dog breeder out there who fails to give a less than perfect dog a chance.\nIn regards to the artistic side of the movie, there is not even one aspect I would think of changing. Immaculately perfect. Big congrats to the entire team, director and actors!",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Ever",
            "content": "This story is based on an epic creature in the world who really knows the meaning of LOVE. The emotions of even togo(Siberian Husky) were captured in the frame... Good effects which means both sound and video. Movie doesn't show much exaggerated version of anyone.. Have kept in a best way possible as it was just real..",
            "review_date": "2020-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow",
            "content": "This movie was perfect. It told an actual account of what happened. There were no boring parts. I can honestly say it definitely is worth the watch. Thanks Disney!",
            "review_date": "2020-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely Beautiful & definitely worth watching!",
            "content": "Miraculous interwoven bond between dog & human is very well shown in this movie.At some scenes, I had to squeeze my heart because it felt like it is tearing into pieces! I felt the pain and the hope at the same time.Dogs are lovely and I think this movie has been successful in depicting some characteristics of dogs such as bravery, perseverance, loyalty and intelligence when it unites with the human sentiments and logic and create something just beautiful.",
            "review_date": "2020-04-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enduring and Heartwarming!",
            "content": "Togo is an energetic, heartwarming, and often touching film, which we should come to expect; considering It's story and stars; fluffy and manly alike.",
            "review_date": "2020-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie ever...TOGO",
            "content": "I highly recommend the movie Togo, especially if you're keen on exciting action sequences and lovely, warm-hearted films. It will let you shed a few tears and makes you want to hug your furry friends. I can not stop my tears after watch this movie ....RIP Togo...your spirit and kindness still in our hearts",
            "review_date": "2020-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An amazing movie and a fantastic story !!",
            "content": "This story really touches your heart .. The worst thing of having an animal friend that you have to let HIM/HER go eventually !! ..",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A wonderful movie its amaizing",
            "content": "Togo was amazing, I loved it, especially when I realized it was completely based on\nI love Husky and I hope it will be animated in the future\nIts amaizing\nI love it.",
            "review_date": "2021-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo is the real hero not balto",
            "content": "Togo ia the real hero not balto....the story is very emotional and its heart breaking that humans are so selfish.",
            "review_date": "2020-04-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing",
            "content": "I'm not a big fan of animal's movies, as they usually abuse drama. But this film is amazing.",
            "review_date": "2020-04-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie, excellent acting...11/10",
            "content": "William Dafoe really does justice in this masterpiece, and even more so the dogs (puppy and adult) representing the legendary unsung hero (Togo) drop in with heartwarming Oscar worthy performances. Totally recommend 💯",
            "review_date": "2020-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A truly surpriseingly good movie.",
            "content": "I was expecting nothing, what kind of title is TOGO? I always liked William Dafoe since he played Silas in Platoon. The airial shot from the chopper as he's zigging and zaggong to avoid enemy fire.\nDoes he have an Oscar yet? Look up all the movies he's done, from Clear and Present Danger, he was great to John Wick, loyalty.Enjoy the movie, I watched it on Disney app on my TV.",
            "review_date": "2020-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True dog movie",
            "content": "Now that's what I call a dog movie. Not only is it entertaining, the cinematography, scenery was spectacular and incredible dog sequences well trained. Leaves movie's like 'call of the wild' for dead. Bring on the live action.",
            "review_date": "2021-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Just boring...",
            "content": "First 10 minutes in and already bored and looking for another title.\nI came here to see movie score, but I dont get how this thing gets more than 6...B O R I N G",
            "review_date": "2019-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartwarming movie",
            "content": "Beautiful movie and to top it it's an True story.. Amazing acting by both William n the Dog. These are some movies which come without much limelight but makes us stick to watching wonderful movies.",
            "review_date": "2020-02-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely loved TOGO",
            "content": "I'm a pet owner myself and this movie is just too good\nA must watch movie for dog lovers, a yes I was emotional in the end.",
            "review_date": "2020-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The heart of a survivor",
            "content": "Heartwarming movie without being too clinchy. Great story!",
            "review_date": "2020-12-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Can't stop tears",
            "content": "I made IMDB account just to give review. Couldn't stop myself.\nThis is hands down best storytelling and an epitome of cinematography. No doubt this true story was portrayed in it's full glory but the mood throughout this entire film keeps soaring high and really makes audiences feel more connected.\nNo doubt this is best movie that came just by end of year. A must watch film with whole family. Get ready for ride on emotional rollercoaster.Merry christmas and new year as well to everyone(at time of posting)",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Defoe delivers",
            "content": "A strong story with a strong performance. The bond between man and dog is highlighted here and a true story is well told that will pull on the heart strings.",
            "review_date": "2020-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch this amazingly true story!! You will be drawn into the deeply affecting story of an amazing and exceptional smart sled dog and his daring and very experienced musher.",
            "content": "This movie hits so many notes throughout the film, very funny when Togo was a puppy and his intent desire to become a part of his owners dog sled team. The story is very interesting and amusing as Togo works his way up the sled dog team to leader. Then, the film gets into the heart of the story---the desperate race undertake by multiple sled dog teams to attempt to get a vaccine to Nome, AK to attempt to save children and indeed all of the residents of that town from a deadly diphtheria outbreak. Togo was a born leader---even with all initial evidence to the contrary. Togo's master was an exceptional musher. All this lends itself to an exciting, treacherous journey which puts all dogs and musters lives at risk.",
            "review_date": "2023-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is a great movie",
            "content": "This is a great movie about courage, loyalty, dog-human bond. It is just magnificent!",
            "review_date": "2020-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's not just a dog..it's a human with great heart",
            "content": "I have literally cried..Togo I am in love with u ..he is not just a dog ..it's a human too...great story in decade ...Togo is a real hero with a great heart..emotional,fun nd epic movie..everyone should watch this at least once in life..you won't regret it I swear.",
            "review_date": "2022-07-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Masterpiece - a Beautiful Story Told Touchingly!",
            "content": "Togo is a symphony of the heart.\nI watched this movie 7 times.\nEverson Core's cinematography is magnificent. The dog sledding scenes, of course, but also how he uses window panes to frame a scene. The lighting of the indoor scenes make you feel like you are there.\nWillem Defoe portraying Leonhard Seppala feels genuine and real, especially how he bonds with Togo. You know this is one of Defoe's best acting performances ever,\nbecause it does not feel like he is acting.\nJulianne Nicholson is perfect as Seppala's wife and her facial expressions make you feel what she is feeling.\nThe writing by Tom Flynn is just wonderful. For instance, when Seppala declares, \"He's (Togo) not a sled dog, he's a lead dog!\"\nThe music by Mark Isham arouses your emotions. And will make you cry. Isham is gifted.\nThere are many others who contributed to this movie to make it a Masterpiece!\nI wish I could shake the hand of all those involved.",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo Movie",
            "content": "This movie is AWESOME!!! One of the best. It keeps you on the edge of your seat but it is also a tearjeaker! I probably cried for 10 minutes after the movie was over. It's DEFINITELY a MUST SEE!!!",
            "review_date": "2020-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Trying to figure out a song!",
            "content": "A song that is played toward the end of the movie (starts around 1:35). The scene is Dafoe leaves Togo behind, but Togo opens the door to chase after Dafoe. In what other movie is this song played?",
            "review_date": "2020-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dog lover",
            "content": "My dog just loved this movie! Seriously... My kids and I loved it too. Very touching, suspenseful and entertaining throughout. Great plot and acting all around. I don't know how they got the dogs to do it.",
            "review_date": "2020-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "Good movie I love it . The doog is very clever i love the stars and the music",
            "review_date": "2020-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "I love dogs and this movie got me so emotional, I loved the emotional part of the movie",
            "review_date": "2020-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a great film.",
            "content": "What a great movie. To me, flawless in any way. The amazing cinematography, soundtrack and acting are beautifully crafted to tell you a story about sheer will, courage and a bonding friendship.\nDefinitely a movie worth watching",
            "review_date": "2020-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "IT WILL MAKE YOU CRY",
            "content": "This is by far one of the best movies I have seen so far! Willed Dafoe brings light into a forgotten character in history and in addition to Togo, a beautiful story about a snow dog who is strong, fill event and relentless. He makes me love my dog 10000000000000x more!\nIt is great movie for the family or just yourself.\nBut I would have to advise you on something, have tissues for the end of the movie! (Happy tears)",
            "review_date": "2020-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I love Togo",
            "content": "This movie has it all, Its got great actors, a great script, great action scenes, beautiful cinematography and visuals, and touching characters that leave a deep impression on your soul. Its a standout Disney film that may become a classic, its definitely one of the best dog and human relationship based films that I have ever seen (if not the best), especially if your a dog owner/lover. It had me on the edge of my seat with my heart filled with emotion during the action scenes, and tears welling",
            "review_date": "2020-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a historical hero!",
            "content": "I've always heard about Balto, the dog who brought the cure, the dog who save the town's children, but this movie showed the real events of the true hero Togo in Alaska 1925. This movie was emotional and heartwarming. This movie reminds me so much of Mission Impossible and A Dog's Purpose. This movie shows how loyal, intelligent, brave a dog can be. The last few moments touched my heart and my tears couldn't stop from pouring down like a waterfall. 9/10",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb! Suspense! Emotional! Fantastic cast and dogs!!!",
            "content": "Loved the film and it brought me to uncontrollable tears. Great film! After watching Togo I realized that Disney's animated film Balto did not do justice to Togo. I love Balto film and always will, however, if you have watched Balto you will notice that Togo was portrayed as the \"bad guy\", . I am glad Disney redeemed itself and gave Togo the credit it deserved.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "Very good movie for who likes dogs and a family film about hard working . It's a film that you have to watch it at least once.",
            "review_date": "2021-08-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The True Story, BALTO is a farse. TOGO is the real deal.",
            "content": "This movie was emotional, suspenseful, heart warming and tear jerking at the same time. William Dafoe had an excellent performance as Norwegian immigrant who moves to Nome Alaska in search of gold. He never finds gold, but he finds his obvious calling to be a dog sled musher and driver. He raises pups and trains them to race and deliver. Then comes Togo, Togo barely survives in beginning, he's the runt of the litter. He is called weak and small but you can never underestimate the heart of a survivor and champion. Togo causes problems for his owner in the beginning and tries to get rid of togo. His owner doesn't believe in him but Togo continues to show his worth and finally he is made lead sled dog and in doing so, creates a ripple effect throughout history. Togo is a true hero and this story tells you why Balto received the credit instead of Togo. A new line of dogs is bred from Togo. Such a moving and touching story of man's best friend and how important they can be in your life and others. If you love animals or dogs in general, you will love this movie. 10/10 for humanity",
            "review_date": "2020-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "You'd smile, you'd still be teary!",
            "content": "No heart in world can contain the amount of love this movie has shown between a man and his dog. a story so sweet and full of courage, you'd find a few alike!Disney just shot itself upright high beyond the stars with this tale with a man and his pups. For the soul this movie has, only a man with concreted-heart would rate this less than perfect. There, I said it. Go, watch and relish!Take a bow, cast and crew!",
            "review_date": "2020-09-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best of the best",
            "content": "This is by far the most heart toching movie i have ever watched. This deserves to be at the very top.",
            "review_date": "2020-01-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "I watched this movie by myself. I laughed out loud, cried and found myself cheering them on out loud. Such a beautiful story, just sorry it took so long to tell the truth of the real heroes!",
            "review_date": "2020-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "gripping",
            "content": "Great film and a very loveable dog. reminds me of my own pups early years. Good to k ow some recognition was given",
            "review_date": "2020-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Strongly recommend",
            "content": "Everything is good and masterpiece,you gonna love it, make you watch again",
            "review_date": "2019-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Movie!!",
            "content": "Togo is a great movie. Definitely is one of the best movies of 2019.",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing and touching story.",
            "content": "I love dogs and this film had the best and lovely dogs especially Togo so playful and loyal. In the middle of the movie I found myself praying for Togo to live like forever after doing quite an amazing job to save life's of children.",
            "review_date": "2020-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best movie! Togo you are the real hero.",
            "content": "One word, Brilliant movie!. Couldn't gold my tears in the end.",
            "review_date": "2020-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb ! Must watch !",
            "content": "Excellent movie ! Brilliant performances ! Loved it ! Loved the togo ! A big big thumps up !",
            "review_date": "2020-05-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good to go Togo",
            "content": "I admit it, I'm a sentimentalist. I cried like a baby at my own wedding while my wife looked on in bemusement. I weep at favourite songs or pieces of music and shed tears freely at emotionally charged movies. It was my wife's brother who recommended we watch this movie during lockdown and I really should have read the signs. First off it's a Disney movie, secondly it's about a brave dog ...and right from these two facts, I knew I was going to struggle to get through it dry-eyed.And so it proved. With films like this, for me anyway, critical faculties are suspended and you just get caught up in the action and want it all to end happily, especially for the dogs. I do know that Willem Dafoe and Julianne Nicholson were excellent in their parts as the slightly mismatched couple who set up home in the remote, frozen, northernmost part of America. He's the local \"mush-man\" responsible for trekking his team of husky dogs over unforgiving terrain for the benefit of the local community while she provides all the back-up back home he needs for them both to keep their operation going.Comes a catastrophic diphtheria outbreak to the town, especially targeting young children and the need to requisition urgent medical supplies from some 500 miles or so away, but with an impending spell of bad weather knocking out the possible use of aeroplane or rail transport, the only way to go get the job done is for Dafoe and his dogs to undertake a hazardous cross-country trek like no other to collect the vaccines and get them back to the hospital to help save the kids' lives.This was a thrilling and moving race against time, taking on the elements and indeed the odds, the effort spearheaded by crusty old Dafoe and his pack, especially Togo the pack-leading dog. Early on we're fed the back story of how Togo came into the couple's possession and how the dog's irrepressible desire to accompany Dafoe on his travels sees him twice unsuccessfully try to offload the dog to new owners, only for Togo to somehow find a way to break free and return back home from whence he came. Finally Dafoe is persuaded by the dog's errr... doggedness, to reluctantly road-test the apparently under-sized dog and eventually concede that its courage and stamina outweigh any physical disadvantages it may have.We see the pack endure unbelievable dangers in their epic mission, Togo literally pulling out all the stops to navigate the team over breaking ice-floes, slog up snow-bound foot-hills and even save the group from certain doom near the end, in a particularly amazing show of love, strength and fortitude by the dog.It's a Disney film so there's probably a fair bit of dramatic licence taken with the story but you'll have a good idea how it ends. The landscapes, making great use of drone shots on-high are frequently eye-catching and there's was a plaintive lonesome-violin soundtrack which further set the scene. I don't know how much of the cinematography was C-Gen assisted but the actions of the dogs and Togo in particular, looked natural to me.Anyway I got through to the end dry-eyed and dog-tired, to quote Elvis Costello, and immediately afterwards felt the need to hug our own dog of over ten years in sympathy and appreciation for what I'd just seen.",
            "review_date": "2020-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "\"Background score and Cinematography\"... Hats off!",
            "content": "I watched this movie lately. Trust me its a true story and a story of a different world remain untouched. The cinematography level is awesome and the background music is too adventurous and impeccable. Its a must watch for all movie lovers and technical teams.",
            "review_date": "2020-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The BEST!!",
            "content": "If this movie doesn't make you cry.... Then I don't know what will, maybe only onions? None the less.... This movie is a masterpiece with the best actors and the best DOGS I should say.. really a nice movie and immensely happy because finnaly \"TOGO\" and \"SEPPALA\" got the credit that they deserved.",
            "review_date": "2020-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "fantastic",
            "content": "I love it.\nthe nature, the dogs, the acting is perfect",
            "review_date": "2020-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Above the Exceptional Level",
            "content": "Great movie that based on true story. cannot imagine that dog had, that much Courage.",
            "review_date": "2020-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Animals have always taught us to be human",
            "content": "One of the highest actions is to risk your life for others, how do animals do that .. They teach us love, courage and kindness.\nThese things are starting to fade, Watch with your heart.",
            "review_date": "2020-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo",
            "content": "A must watch movie..I hear that the case for removal of balto statue is on due..My opion is to carve a massive statue of Togo behind balto to praise his glory..(Just like in Baahubali)",
            "review_date": "2020-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "best movie dog ever",
            "content": "So emotional. the dog was too cool to be truth. the story so gewddd",
            "review_date": "2020-04-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great",
            "content": "What a masterpiece . Great work on every field of movie 👍",
            "review_date": "2020-04-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great movie",
            "content": "Magnificent Togo, nice-to-watch movie and that too from Alaska. Missed it in theatre.",
            "review_date": "2020-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rip off of Balto",
            "content": "From the start I knew this was a Chinese made pear phone. Balto is better in so many ways. Also Universal should do something.",
            "review_date": "2019-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good movie.",
            "content": "Very good movie, Intense,Exciting,and touching.Not sure how can anyone give less then 10 starrs.",
            "review_date": "2020-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Overall a great movie!",
            "content": "I recently watched the movie Togo on Disney +. I wasn't into it at first because it is based on a true story. Movies about true stories usually leave me crying. So my hopes for this movie were definitely not high. Then the movie began and I was immediately intrigued. The movie follows the journey of an older man named Leonhard Seppala, and his trusty 12 year old Husky Togo. Seppala leads his sled dog team, with Togo leading, across Alaska. The movie has noteworthy action scenes and a truly heartwarming backstory/plot. If you want to watch a fairly new movie that pulls at your heartstring, and feels you with a zest for life. Then Togo is the movie for you. It hits all the key points that a superb movie needs: charming characters, an extraordinary backstory, and adventure! In this 1 hour and 54 minute movie you become attached and almost connected with the characters. Overall I thought the movie Togo was a breathtaking film. That was able to accurately depict the true story of Togo and Leinhard Seppala.",
            "review_date": "2020-10-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Great Movie",
            "content": "This is the first time I leave a review ever! I just felt the need to it. The amount of emotions in this movie is incredible ! Togo had me in tears . MUST WATCH",
            "review_date": "2020-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hike hike",
            "content": "Whoa what a movie. Wonder what took so long to create a movie in this. What a story.",
            "review_date": "2020-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great family movie, great just everything movie",
            "content": "This was a spectacular movie. Spectacular scenery. The shots of the storm coming in, the dangerous trek over the ice -- it was spellbinding. We couldn't look away. How did they get those shots/effects?The acting was masterfully understated, with heroic, yet believable, characters. They really portrayed the time and place well. As someone of Norwegian descent who grew up in Alaska, I found nothing jarring as is far too often the case when someone tries to depict Alaska.And the dogs were amazing. Particularly Togo, who is supposed to be played by one of his actual descendants. Add in the cute puppy and any animal lover, young or old, will be enthralled.Not wanting it to end, both my husband and I went to the internet to find our more about this heroic dog. The true story of Togo is reportedly even more amazing, but I thought Disney did a great job of turning this into an exciting, edge of your seat type of movie.Haven't enjoyed a movie this much in a very long time.",
            "review_date": "2022-10-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not as good as Iron Will (1994)",
            "content": "It's not bad at all, but not nearly as good as Disney's Iron Will (1994).",
            "review_date": "2020-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Togo - warroir",
            "content": "I dare you not to cry while watching last 20 mins , he is a true warrior and thanks to disney",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Loved the Movie but...",
            "content": "I was very disappointing with the cinematography/post-processing. Almost every seen in the entire movie is blurred around the edges but the very edge is plagued with repeating artifacts (seen on Disney plus), a side from this glaring issue I would recommend this film to all dog lovers.",
            "review_date": "2022-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie",
            "content": "Very emotional movie. Watched it twice. Thanks to all who participated in this great work.",
            "review_date": "2020-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The only film on Disney+ that enticed me in",
            "content": "I've never done a film review on here, but this film deserves it 100%Told my partner we've got 7 days to watch 1 film. What I thought would be \"worth a watch\" on a Sunday afternoon 'cos dogs & Willem but...That was quite possibly thee best dog film & Willem Dafoe film I've ever seen. Literally had me in tears for the last 10 minutes, why Disney didn't put this on the big screen I do not know & I sincerely hope they release it on DVD!Dafoe was excellent at the hard exterior, soft heart persona, oscar worthy! and TOGO, jesus christ TOGO alone deserves 12 oscars just for tugging on my heartstrings & being amazing. This film had the ultimate feels, I did not expect that kind of quality from a *film when we sat down to watch it, boy were we sadly but pleasantly surprised with the result!*A Disney film in the last 5 years that wasn't animated, a musical, or a live-action remake that NOBODY EVER ASKS FOR! EVER!Thank you for making TOGO, please release on DVD & stop doing live-action remakes this was an amazing film. More like this please and thank yous",
            "review_date": "2020-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A tearful, dramatic story 😭",
            "content": "I love such exciting stories and I recommend watching.",
            "review_date": "2021-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Heartwarming and heartbreaking",
            "content": "As a Siberian Husky owner for the last 14 years, this film NAILED the tenacious, stubborn, and often downright naughty nature of these stunning creatures. It also nailed their absolute desire to RUN. This breed live for it, and it really is evident here, I hope this shuts the naysayers up. As someone who volunteers for a Husky Rescue, I also hope this film DOESN'T encourage people to get one of these dogs without making a 100% commitment for life. They have personality in spades and are very different to most other breeds who will obey instantly.\nWilliam Dafoe was the perfect choice for Seppela. He is a dead ringer for the man himself.\nIt was hard to hold the tears in throughout this movie, and even knowing how it ends, I was on the edge of my seat in some scenes. The last few minutes had my husband and I downright SOBBING.",
            "review_date": "2020-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this is really good story about dog",
            "content": "This is an story about sled dog and it's really good story about that.",
            "review_date": "2020-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie!",
            "content": "I think Disney have done the best movie yet! This is a movie I'm going to watch many times. Finally the right heroic dogs story is here and Disney made a perfekt movie of the story. So good and I have been crying 20 minutes after the movie. I really, really love this movie!",
            "review_date": "2020-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Best, Most Realistic, Disney Movie Ever",
            "content": "The story of 12 year old Seppala Husky named Togo that was a true hero.",
            "review_date": "2020-10-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": null,
            "content": "(Mauro Lanari)\"Vanitas vanitatum et omnia vanitas\": \"the man who would have defeated death?\" Shakespeare's \"Henry V\" as a banner of epicness and not of tragicalness? Nice that the statue was made to the wrong dog, nice that in non-Disneyan(Mauro Lanari)\"Vanitas vanitatum et omnia vanitas\": \"the man who would have defeated death?\" Shakespeare's \"Henry V\" as a banner of epicness and not of tragicalness? Nice that the statue was made to the wrong dog, nice that in non-Disneyan reality Togo was first sold and then killed with euthanasia. A similar fate is desirable for all those children \"saved\" from diphtheria.",
            "review_date": "2020-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "After watching the trailer, I’m excited to watch this movie. When the film was released, and I’m started to watch, I’m telling myself, “Why this movie not released in the theatre?” It was a fantastic experience to watch Togo.It’s aAfter watching the trailer, I’m excited to watch this movie. When the film was released, and I’m started to watch, I’m telling myself, “Why this movie not released in the theatre?” It was a fantastic experience to watch Togo.It’s a heartwarming and thriller. Cinematographer Ericson Core has done his best job in this movie. Cinematography and CGI are the best part of the Disney+ Togo movie. The way the director Ericson Core wanted to connect the entire story with us and he was successful in it. You will also become a little emotional while watching this movie. Willem Dafoe has done his best performance in the role of Seppala.You have to watch a Togo movie for a new adventure, thriller, and inspirational experience.",
            "review_date": "2019-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absolute travesty that it only has a 71%. How have critics become so out of touch? This is a beautiful, heartwarming story that is bound to stay with you. A real tearjerker. The cinematography is incredible and Dafoe is brilliant.",
            "review_date": "2019-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Disney does this one really well no sjw nonsense or bad acting Togo is a must see great dog movie love dogs!",
            "review_date": "2020-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a good Disney+ original drama about the 1925 serum run to Nome, Alaska, the same subject as the 1995 animated cult classic, Balto, although Togo is much more accurate to the true story than that film was. This movie features someThis is a good Disney+ original drama about the 1925 serum run to Nome, Alaska, the same subject as the 1995 animated cult classic, Balto, although Togo is much more accurate to the true story than that film was. This movie features some really solid performances, with Willem Dafoe being the standout, as is usually the case. If you like dogs, definitely watch this movie! It has cute dogs everywhere, and I think they are mostly real with minimal CGI. I’m always amazed at how expressive these animals can be and what they can be trained to do. The subject matter of the movie was very interesting, I feel like I learned something about history from watching it. It also features some really intense and thrilling action sequences that had me on the edge of my seat! I wasn’t that into the structure of the film, it was told in a nonlinear way that kinda took me out of the experience sometimes. That, and I didn’t think the cinematography or the editing were anything to write home about, but other than that this is a good movie that gives you a good old-fashioned triumphant feeling. It’s worth a watch if you have Disney+.",
            "review_date": "2020-02-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing movie. Deserves more attention. Great acting and very exiting story",
            "review_date": "2019-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Togo\" is a sincere, intense and truly moving story. Dafoe's incredible and his bond with Togo felt real and genuine. All in all, this was a heartfelt and truly unforgettable film about an unsung hero deserving of more recognition.",
            "review_date": "2021-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ok,it is not a perfect movie. But how to be better inside this theme? We have a great story, direction, photography. Perhaps some exeeding picture time, but what great movie doesnt have? Definitely it should deserve more attention!!",
            "review_date": "2020-04-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Modest but really well done. To tell you the truth I was quite surprised.Of the three original films that Disney + has released so far this is definitely the best.",
            "review_date": "2020-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a nice story with some pretty great cinematography, a good cast and of course adorable dogs. I would recommend it, yes, especially for the beautiful northern lights type sunsets shown in landscape shots. Its a pleasant and enjoyableThis is a nice story with some pretty great cinematography, a good cast and of course adorable dogs. I would recommend it, yes, especially for the beautiful northern lights type sunsets shown in landscape shots. Its a pleasant and enjoyable watch and its based on a true story, which always appeals to me.",
            "review_date": "2022-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great action packed movie about dogs. What more can you want than see a bunch of good boys and girls saving the sick children?",
            "review_date": "2019-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great film about a great story.  The frozen sound monologue is awesome!  Well worth the watch",
            "review_date": "2019-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dogs are an amazing and incredible animals that will do so much for their owner and this movie proves it! What a heroic dog Togo!",
            "review_date": "2020-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "By far one of my new favorite movies. Loved it so much I told every all my family and friends. Great learning about the history of what really happened.",
            "review_date": "2020-04-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A sled dogs movie that uses real dogs and pups (except in perilous situations) with Willem Dafoe 100% into his performance, as usual. This film also sets the record straight about Balto. Lauren was shocked. My only gripe is the blurry-edgedA sled dogs movie that uses real dogs and pups (except in perilous situations) with Willem Dafoe 100% into his performance, as usual. This film also sets the record straight about Balto. Lauren was shocked. My only gripe is the blurry-edged border applied to the whole film. Other than that, loved every bit of this heartwarming and adorable movie.",
            "review_date": "2020-04-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis is one the amazing stories I have watched and great work by the producers to respect a life of the champion dog whom saved hundreds of lives back in the day.I felt truelly honored to live with such a great soul even through a movie!",
            "review_date": "2020-04-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watch this guys. Worth to watch. The best dog movie for me ♥️ animation was great. Story was amazing. Everything in this movie was perfect.",
            "review_date": "2020-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Togo is without a doubt a surprise hit, in my opinion. When it comes to dog centric films, I tend to not watch them because let’s just be honest - most of them are sad. Beautiful, but sad. Togo may look like just another Disney dog movie, butTogo is without a doubt a surprise hit, in my opinion. When it comes to dog centric films, I tend to not watch them because let’s just be honest - most of them are sad. Beautiful, but sad. Togo may look like just another Disney dog movie, but it is so much more. This film blew me away from start to finish. And one really interesting fact about this film is it IS based on a true story. I even fact checked the movie after and was floored to find how truly faithful this movie is to the real events.If you grew up with the animated film Balto, I can’t recommend the watch more, it takes the story of a dog mushing adventure that we loved as kids but made for the whole family - and especially us adults.  Willem Dafoe again proves his worth as an actor, giving a beautiful performance and Julianne Nicholson was a brilliant cast to back his character up. Give it a watch - you don’t be disappointed.",
            "review_date": "2021-08-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's okay but Willem Dafoe's performance is great. Music is also really good.",
            "review_date": "2022-11-22",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "meta_rating": 8.2,
    "meta_summary": "Togo is the untold true story set in the winter of 1925 that takes you across the treacherous terrain of the Alaskan tundra for an exhilarating and uplifting adventure that will test the strength, courage and determination of one man, Leonhard Seppala, and his lead sled dog, Togo.",
    "vibes": [
        "inspirational",
        "fluent",
        "dependent",
        "unnoticed",
        "keen",
        "miraculous",
        "impossible",
        "enchanting",
        "joyful",
        "cultural",
        "dumb",
        "native",
        "average",
        "ready",
        "adventurous",
        "impeccable",
        "heartbroken",
        "unforgettable",
        "risky",
        "countless",
        "laughable",
        "repetitive",
        "believable",
        "helpful",
        "speechless",
        "bedridden",
        "eld",
        "thoughtful",
        "watchable",
        "facial",
        "indoor",
        "unreal",
        "hilarious",
        "obnoxious",
        "dreamy",
        "overdone",
        "harsh",
        "optimum",
        "scenic",
        "sensible",
        "bland",
        "disobedient",
        "intentional",
        "forgettable",
        "smart",
        "reliable",
        "legged",
        "heavy",
        "general",
        "technical"
    ]
}