{
    "rating": 9.0,
    "release_date": "2021-12-02",
    "num_reviews": 154,
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "summary": "A man diagnosed with Alzheimer's decides to punish criminals.",
    "reviews": [
        {
            "review_title": "I think this series is top of among the Turkish series.",
            "content": "After Fi, I started with a low expectation and continued with admiration. Hakan Günday and Azra Kohen are not comparable to each other. There is no need to look for flaws in Sahsiyet. Thanks to Puhu TV, quality in the Turkish series sector has risen so much. Sahsiyet's story is a bit like Breaking Bad, a bit of a Dexter mix, much more different and much more intimate.Sahsiyet's greatest trump card; Behind the screen are two successful names such as Hakan Gunday and Onur Saylak. Hakan Gunday, one of the greatest writers that Turkish literature has recently released, writes the screenplay of Sahsiyet. The scenarios in each section are overly pleasing. Those who know their books, I am sure they felt this.The second biggest trump card in the series is the Haluk Bilginer factor. As for the Cansu Dere... Everyone has a prejudice against her. But I do not think it's bad. I did not see an exaggeration. Exceptionally lean, understated, with a moderate performance on display, without too much trouble. Only the character Nevra, a little too American. The Turkish police is like a Behzat Ç. Police office looks like the American Police Department in Sahsiyet. It's a very successful mini-series. I wish it was a few seasons. 10/10",
            "review_date": "2018-03-26"
        },
        {
            "review_title": "Not unique, but definitely different",
            "content": "Frankly, it took for me like ages to get past the first episode. But then, I increased pace and completed the entire season in 2 days; 2 days because i needed some sleep so as to grasp and catch hold of the sequences.Sahsiyet gets my applause. It has well deserved cinematography, appeal, timing, and pace. It is slow at times, and yet thoughtful and decisive. Bravo its creators, director, and actors.The main lead, Agah, is impressive and quirky. Really, his timings at times made me into thinking like he was really suffering with Alzihmers. How well executed. The other actors also did a great job.Above all, the last two episodes had a dreadful atmosphere, and i think, that was something which sums up to all the reasons the firsts ten episodes left an impression on me; and definitely the other audiences who watched this show. Unsettling, nervebreaking and tear jerkers. Maybe through a fictional way, the creators wanted to showcase the brutal reality of our \"world\".Don't miss this if you love mystery, thrill, and an impeccable creativity.",
            "review_date": "2021-04-18"
        },
        {
            "review_title": "One of the best",
            "content": "One of the best crime series that ever been made. You need full focus, no riddles just go with the flow.",
            "review_date": "2019-02-16"
        },
        {
            "review_title": "NIce job...",
            "content": "How I was wrong about Turkish production. Its just because my wife consume some bunch of stupid soap stories from Turkey.\nPersona is heavy story about what is place and role of women in Tukrish society, even today, in 21st century and clearing conscience.\nStory is very good, plot is heavy, directing beutifuly, music nice, dialogs in some moments fantastic and with heavy social messages.\nIt could be shorter for one or two episode but in overall its ok.",
            "review_date": "2019-08-04"
        },
        {
            "review_title": "Amazing !!!",
            "content": "I have not watched a Turkish serial in this quality for a long time. I watched while I stick to computer screen. Agah Beyoglu's attitude of \"not even hurting the ant\" learns that his life is going to change, on the contrary it is just a summary of human being's evolution. Nevertheless, she never gave up on her characteristic of valuing women because the people she killed were from people who had been violent to women. Is it really a single diagnosis of Alzheimer's causing murder? Why do we like Agah even though he is a serial killer?",
            "review_date": "2018-04-06"
        },
        {
            "review_title": "This job could be a revolution in turkish TV shows",
            "content": "I don't know why have I delayed this show to watch. A wonderful story, great cinematography, and a flow that does not get you bored. Some how, it keeps you awake. highly unpredictable.\nBeside this, the show focuses on some huge problems in turkish society, shamefull incedents and knowing them by a community that act like it is not happening. The show throws this up to us to face this mass so rigorously.",
            "review_date": "2019-03-13"
        },
        {
            "review_title": "Great tv show especially not-Turkish people should watch it",
            "content": "Master Haluk Bilginer and co-stars Cansu Dere and Metin Akguler and the others (especially young actors and actress did great job). Great cast, unique story and script. For me if you wanna watch fluent tv show dont stop just start to first episode you can find it on puhutv.com",
            "review_date": "2018-05-27"
        },
        {
            "review_title": "One of The Best Turkish Series",
            "content": "The story line of the series was beautifully directed. At least, this series tells us a meaningful and affective story besides other Turkish series.The last episode could be directed in three episodes separately. But the director tried to conclude everything in one episode. And also I didn't like the scene where Ates was killed by a bomb. This scene could be more touching and persuasive. These are the only negative critiques that I can say. Except these critiques, every part was totally flawless. I have finished this series in 3 days, it was so fast-moving. I definitely suggest everyone to watch it.",
            "review_date": "2019-01-29"
        },
        {
            "review_title": "excellent",
            "content": "This is an excellent serie. \nThis is rare to see Turkish TV series competing with foreign ones.\nI can say this is as good as famous american crime TV series.\nWithout spoilers I can just say suprise connections were great.\nthe only dissapointing thing for me was Zuhal and Deva. Their story was a bit weak.\nAnyway I highly recommend to watch this show; even for not Turkish people.",
            "review_date": "2018-06-21"
        },
        {
            "review_title": "It's truly a masterpiece, -1 star for some boring events in first couple of eps",
            "content": "As serial killer stories go - there's a psycho, presumably, on a killing spree with seemingly unrelated victims making local police station look like a circus. Pretty much everything is revealed to us viewers except how will they catch him and more importantly- why is he doing this. The \"why\" will keep you glued to your seat, make you assume and connect these men in your head. And once you think you've got the hangs of it the story turns upside down and leaves you speechless. Seriously, I did not expect *that* at all\nThe finale is easily 11/10 but it takes a while to get thereAround first 5 or 6 episodes I found everyone who is not Agah very boring, almost a snooze fest which I have to go trough in order to understand what's going on. Especially Nevra, who seemed like your typical idealistic protagonist with added struggle of a woman in man's world. Agah carries that first half of the series, he's pretty funny guy actually. Follow him on his quest of revisiting old friends while Nevra slowly takes bigger and bigger role and very sharply becomes the focus of the story. Wait and see what all of those 53 similar looking men did to deserve the sticker on the forehead. You won't be dissappointed. I mean, you will detest them even if they're fictional but it makes a great story\nAvoid the spoilers like a plague and take the story as It goes. Warning -it's a lot. It's heavy, it's scary, it leaves a knot somewhere inside that hard to untangle. Because it is very much real. It certainly happened in the past,\nAnd it might as well be happening right now. And although this series ends on a positive note, justice isn't that common in the real world sadly.",
            "review_date": "2021-10-07"
        },
        {
            "review_title": "I was expecting more",
            "content": "After seeing the 9.1 ranking of this series, I decided to watch it, and I like to watch it, very good main character and plot. The end is really great, but the majority of episodes until there needed more tension and breathtaking scenes, sometimes it gets boring, lacking emotional depth and touching strong subjects in a soft way. Overall it's worth watching but i get the feeling that the show had potential for way more.",
            "review_date": "2019-11-22"
        },
        {
            "review_title": "oh. my. fking. god!!!",
            "content": "I created an account here just to leave this comment! i would never expect series (especially turkish ones) to be SO great!\neverything is good! acting, shooting, TWIST PLOTS!\ni just applaud and bow to the whole crew! producers, directors, actors, everyone! thank you a lot to everyone who had created this!\nwow. wow! i am so amazed, guys!\nWOW!",
            "review_date": "2020-12-17"
        },
        {
            "review_title": "Really Outstanding",
            "content": "An absolute treat and fully deserving of the praise heaped upon it in other reviews. A wonderful cast with Haluk Bilginer giving a performance for the ages as the lead, but with many other terrific performances throughout the cast.\nA well-directed and nicely shot series with some very deep themes about Turkish society. It is a highly original and inventive story, which builds to a deeply affecting conclusion. This is ten hours well spent of anyone's time. Thoroughly recommended.",
            "review_date": "2019-12-20"
        },
        {
            "review_title": "I MET A GIRL YESTERDAY. HER NAME WAS NEVRA ELMAS.",
            "content": "This is an excellent series. This is the first Turkish series I've ever watched and this is just awesome. From the very first episode till the last, it is one gripping series with the excellent writing. The writing in the series is phenomenal... one perfect crime drama with brilliant story, great screenplay, great direction, amazing cinematography, class soundtrack and top-notch acting by all the cast members. The framing, cuts end edits, the music, colours; all of them complement and support the setting beautifully. The performance from the whole cast is just flawless.In the whole series, I loved the character 'Nevra Elmas' perfectly portrayed by \"Cansu Dere\". She is one good person and a good cop; She's dedicated, intelligent, vulnerable and most importantly, a proper badass. Obviously, 'Agâh Beyoglu' portrayed by \"Haluk Bilginer\" is phenomenal. He is impeccable in his role. The regular cat and mouse chase is made really captivating with is brilliant writing. Sahsiyet is fresh and original. The motive of the series is just superb. The storytelling is brilliant and I really loved how the series unfolds the mystery that has been maintaining from the first episode. And the last episode does justice for the whole series. It is a highly original and inventive story, which builds to a deeply affecting conclusion.The series is filled with emotions and a fascinating storytelling from Hakan Günday directed by Onur Saylak. The character development is great, and very good reflection of the society. It has well deserved cinematography, appeal, timing, and pace. It is slow at times, and yet thoughtful and decisive. Above all, the last two episodes had a dreadful atmosphere, and i think, that was something which sums up to all the reasons the firsts ten episodes left an impression on me.9.5/10.",
            "review_date": "2021-07-08"
        },
        {
            "review_title": "Best turkish series ever",
            "content": "\"Sahsiyet\" is the best Turkish series I've ever watched; it's awesome, exciting and very very different. I'm so excited to watch the next episodes.",
            "review_date": "2018-04-24"
        },
        {
            "review_title": "Masterpiece",
            "content": "With unique story and character (Agah) one of the greatest TV show of Turkish television. \nHaluk Bilginer proved again he is one and only.",
            "review_date": "2018-05-10"
        },
        {
            "review_title": "Excellent!!",
            "content": "Excellent show!! Especially Haluk Bilginer is phenomenal!!!",
            "review_date": "2019-08-26"
        },
        {
            "review_title": "A very good surprise from Turkey",
            "content": "This show was completely unexpected for me because I had never seen a single movie or show from Turkey. So, I was a little bit sceptical about IMDB rating. Now, after viewing it, I can say this show is very good. The story is very well crafted with its very own pace while keeping the grip on viewers. And above all Haluk Bilginer is a great actor.",
            "review_date": "2020-06-11"
        },
        {
            "review_title": "Masterpiece",
            "content": "Another masterpiece from Haluk Bilginer and the full cast. Together they made one of the best TV series of Turkey. It is highly possible that this series become legend. I hope they continue like this.",
            "review_date": "2018-04-15"
        },
        {
            "review_title": "A creative and compelling Turkish crime drama",
            "content": "In Sahsiyet, an elderly ex-court official newly diagnosed with Alzheimer's resolves to act as judge, jury and executioner before he completely loses his memory. The story also follows a female police investigator who must confront her own troubled past to uncover the dark secrets that drive the criminal's motivations and actions.The show adroitly handles and presents topics like the difference between law and justice, repression of past trauma, discrimination against foreigners, and the inequality of the sexes. The script too deserves praise for effectively weaving together poignant emotional moments, subtly humorous conversations as well as thought-provoking soliloquies. The cast's acting is wonderful with Haluk Bilginer's portrayal of the troubled and conflicted lead protagonist deserving special mention. Moreover, the setting is very realistically constructed be that in the layout of the sets or the music chosen for the scenes, increasing the intensity of the depiction.Insofar as criticisms go, a lot of them could stem from my unfamiliarity with Turkish culture; after all, Sahsiyet is the first Turkish television show I have watched. Perhaps this is why many of the subplots and secondary storylines tended not to engross me - none of Zulal's insecurities, Deva's rebelliousness, or even Neyra's fumbling progress captivated me as much as Agah's morally questionable enactment of justice. Considering the premise and plot, the show also felt drawn out in parts and may have benefitted from a tighter half dozen episodes and a more satisfying conclusion. Furthermore, some suspension of disbelief was necessary to explain away aspects like the utter incompetence of the authorities, the lack of public knowledge of a secret shared by almost an entire town, and the neat wrapping up of all loose ends. Finally, the Alzheimer's disease condition was disappointingly used more for characterization instead of playing an integral role in the events of the narrative itself.To sum up, I consider Sahsiyet an intriguing drama highlighting the promise and potential of Turkish television. The mystery is suspenseful, the themes are mature, the acting is excellent and the setting is vivid. While the show does not quite deliver on its premise and has some forgettable B-plots, it still makes for an entertaining and gripping watch that can be appreciated by an international audience.",
            "review_date": "2022-04-19"
        },
        {
            "review_title": "What I have been craved for a long time; Quality!",
            "content": "Just we were about to jump a level up with another series, Fi, Sahsiyet made all of us go multiple levels higher. For a quite a long time Turkish TV series have lacked good substance, good acting, music and originality. Until this one. Very very very congratulations for all who made this show for us. This is a show that gets our hopes up and proves we can do fantastic shows.",
            "review_date": "2018-12-24"
        },
        {
            "review_title": "very proud of saying that Sahsiyet is very very fascinating Turkish TV serie!",
            "content": "Thanks to PuHu TV for the quality in the Turkish Series! It's getting a lot better.\nNot only actors and actresses but also director and soundtracks are very very successful. \nI am very proud of saying that Sahsiyet is a very very exciting and fascinating Turkish TV series, and I am looking forward to see next episodes..",
            "review_date": "2018-06-11"
        },
        {
            "review_title": "Good but definitely not a '10'",
            "content": "This series is overrated in my opinion. Most of the 12 lonnggg episodes are just not that interesting. The premise is more interesting than the execution. This would have been improved by fitting the story into far fewer episodes. I was pretty tired of it by episode 6 or so.",
            "review_date": "2022-02-22"
        },
        {
            "review_title": "The absolute best",
            "content": "In my opinion this is the best Turkish serie you can watch, forget about those nonsense 2 hour long tv drama series. Although it could have a better ending, they nailed the characters, places and the beautiful views from Istanbul and ofcourse i can't forget about Haluk Bilginer a.k.a. Best Actor of Turkey",
            "review_date": "2019-08-19"
        },
        {
            "review_title": "A venerable uprising against harassment directed towards women all over the world.",
            "content": "I won't say it is one of the best Turkish TV series I have watched simply because it is one of the best TV series I have watched regardless of the country of origin; even better than most revered American TV serials, in my honest opinion. Seriously, I am not saying it just because I am Turkish, even though I am proud that this masterpiece is a Turkish product, I must admit . Casting, acting, the script, screenplay, the atmosphere and its social messages are all so great. It is a venerable uprising against harassment, violence, sexual abuse directed towards women all over the world.I just finished the last episode and i am literally shaking right now. I remember, the last time I felt this way was after watching Guillermo del Toro's El laberinto del Fauno (Pan's Labyrinth)Bravo!",
            "review_date": "2019-12-09"
        },
        {
            "review_title": "Fresh and original!",
            "content": "Not much of this subject has been done on turkish tv, generaly it is a lovestory between a rich boy and a poor girl and their impossible \"love story\". But a serial killer on the loose with alzheimer - well that is something brand new ! But Onur Saylak did it!! What a great show with great visuals and sound. The intro by it self is already something never done - and to add the brilliant acting and story, you got an istant HIT. Let's hope that every episode keeps this line steps up and does not fall back on typical turkish tv shows.Haluk bilginer sir, you already proven that you are a great actor. But boy o boy do you keep getting greater and better.From the first episode in I give this show a 9/10",
            "review_date": "2018-03-26"
        },
        {
            "review_title": "It's a relief in the absence of Breaking Bad",
            "content": "It simply falls in the same niche genre... and executed brilliantly. Well OK perhaps i shouldn't keep the bar that high but it's really good..!",
            "review_date": "2020-10-27"
        },
        {
            "review_title": "One word \"Goosebumps\"",
            "content": "In the beginning it takes some getting used to the first 3 a 4 episodes. But later it will only get better and better. You can no longer stop watching and want to watch them all! I can advise you not to do that. Save it for later and watch it with a fresh head, then its been better.",
            "review_date": "2018-06-19"
        },
        {
            "review_title": "Perfection",
            "content": "This series is in my top 3 series of all time and I think it is the best Turkish tv show. Haluk Bilginer was perfect. I can't even find words to say.",
            "review_date": "2021-08-28"
        },
        {
            "review_title": "With one word : Fascinating",
            "content": "It is not only a tv series but also a documantery which shows sociology of Turkish society with an amazing story. Sad but true...",
            "review_date": "2018-06-24"
        },
        {
            "review_title": "Amazing",
            "content": "This is one of the best things to come out of Turkey since Gheorghe Hagi.If you can somehow find a way to watch it, make sure you do, as the ratings do not lie.Its equal parts comedy and tragedy, with the fumbling, bumbling, hitman acted to perfection.",
            "review_date": "2019-06-17"
        },
        {
            "review_title": "Good for Turkey, otherwise average",
            "content": "If you're looking for a ZeroZeroZero, Sopranos, True Detective or Breaking bad... this ain't it.I come from Turkey and understand why it's gotten a lot of praise. Turkish series tend to be more like telenovelas and filled with cheesy drama. This one has more flair and it is darker in the style of above mentioned series.So it's the first \"serious\" attempt of making something other than a \"Turkish days of our lives\".The high score is a bit inflated, much like Indian movies tend to have higher scores than they should..\nJust my opinion.It's filled with many cliches and cringy moments. It's unable to shake off typical Turkish entertainment stereotypes, the poorly acted small town drunk or the unnecessary love interest and some parts of the series where you go \" okaaaay... they should've just cut that out.. thats just pure ridiculousness\"Kudos; To the cinematography and visuals. Everything production wise are for the most part top notch and..\nthe lead role by Haluk Bilginer is amazing and a joy to watch. He basically carries the whole series. Absolutely charismatic. Actually that's an understatement.. He is fantastic!It's tough writing a review without spoiling and ruining it for everybody else. Just keep your expectations low and you might enjoy it.",
            "review_date": "2020-10-11"
        },
        {
            "review_title": "Good build up wated in the end.",
            "content": "Hi all, this is coming from a non-Turkish speaker.\nTo start, the series had a very good build up, the characters, their development, cinematography and music. The music was one factor that I was instantly glued to the series.\nThe main character Agah was played exceptionally well by Haluk Bilginer. The rest of the cast with their brilliant acting also lifted up the series.\nBut all in all, as a high powered serial killer drama, the show lost its essence after the 7-8 episodes. You can actually tell the episodes being stretched and the plot getting mixed up, story losing its ground. With the suspense opening in the last episodes, everything started to get mediocre except the dialogues which were the one constant good thing throughout the series.\nI would say it couldn't do the justice to the plot that was so beautifully woven. It started on such a realistic note and ended on a fantasy one.\nThe story is still good and greatly watchable, but the major last episodes failed to deliver on the direction and will let you down a bit.\nActing 9/10\nStory 8/10\nCinematography 9/10\nmusic 10/10\nSatisfaction at the end : 7/10",
            "review_date": "2020-07-18"
        },
        {
            "review_title": "And the oscar goes to...",
            "content": "Best Director: Onur SAYLAKAn exemplary performance by Onur Saylak. I don't even know his face or his other works but what I realize when I watched the series was out of this world. Someone can criticise everything but him in this masterpiece. Haluk Bilginer is the top of actors in Turkey as always and shines in every second of the series.",
            "review_date": "2018-12-31"
        },
        {
            "review_title": "A fascinating storytelling from persona",
            "content": "There are many crime series around the world but this version of storytelling makes audience feel all the emotions. Short but proper and effective.",
            "review_date": "2018-06-30"
        },
        {
            "review_title": "Really worth your time",
            "content": "One word excellent. Excellent storyline, brilliant execution, masterly done cinematography. Though length of the series could have been reduced. Still giving it 10/10",
            "review_date": "2020-04-01"
        },
        {
            "review_title": "Lovely",
            "content": "Brilliant acting and beatiful scenes from Istanbul. The storyline is quite interesting and I think it's the first serial killer series that has been made in Turkey.",
            "review_date": "2018-06-21"
        },
        {
            "review_title": "Real Surprise",
            "content": "It was brilliant and deeply touching. I am not Turk and I hate satellite's turkish series considering them as total disasters regarding script, acting and directing but Persona was totally different. Very complicated and affective crime story with highly smart engineering for each part of the whole, real thrilling moments, nice sense of humor, well paced and beyond them all fantastic acting by who played main character. Unbelievable! I got surprised with his really great performance. One of the best series and even movies I have watched ever and for your information I have watched much more than a lot because I am a film critic and film maker. Dont miss this gem. Wow.",
            "review_date": "2021-04-01"
        },
        {
            "review_title": "One of the best series I have ever seen",
            "content": "With the incredible, acting, great story, amazing colours this show is a must see on all conditions, You should really give it a chance.",
            "review_date": "2018-12-29"
        },
        {
            "review_title": "The best Turkish crime series",
            "content": "\"Sahsiyet\" is the best Turkish crime series of recent times. This series doesn't. It doesn't extend topics. Every episode makes you astonished. It is a series of crime that must be followed.",
            "review_date": "2018-12-10"
        },
        {
            "review_title": "A Masterpiece",
            "content": "One of the best Turkish series, fresh and promising.Each episode is like its own elegant chapter of a book containing fantastic cinematography, elements of comedy, poetry, music etcHighly recommended...",
            "review_date": "2020-05-26"
        },
        {
            "review_title": "The Best Ever",
            "content": "The best ever series I have watched including all the series I have seen all over the world. Thrilling, amazing scenario! Even the story is a fiction it is not unlikely to have happened considering the current circumstances of the man dominant societies all over the world. I have very much appreciated Agah Beyoglu character. I ended up in a feminist nature as a man since having watched this masterpiece. I think it must have been a ground breaking series for many people!",
            "review_date": "2018-10-03"
        },
        {
            "review_title": "It wouldn't be wrong to say the best Turkish series.",
            "content": "Haluk Bilginer, one of the best Turkish actors, performed again great. Even though the series is short, it leaves you feeling great when you're done.",
            "review_date": "2019-06-15"
        },
        {
            "review_title": "Perfection!",
            "content": "A series that exceeded all expectations. Extremely smart, multi-layered story. Perfect acting, screenplay, music, photography and beautiful Istanbul. Excellent description of the state of women in today's, not only Turkish, society. Haluk Bilginer deserves all the applause, as well as the rest of the cast! Thanks to everyone who created this masterpiece!",
            "review_date": "2020-12-17"
        },
        {
            "review_title": "Great music, Great Panaromic View, Scnerio and cast",
            "content": "I watch the whole series in a week. Haluk Bilginer is an extremely successful artist. Music is great, Istanbul is great, Story is heartbreaking and little philosophical.\nThe best, highest quality Turkish Series I have ever seen.",
            "review_date": "2018-07-30"
        },
        {
            "review_title": "Best turkish series.",
            "content": "The best turkish-made series you've ever seen. fiction made very well. the director of photography has done a wonderful job with blue and red colors. they chose the songs very well. Thanks to everyone who contributed to this series.",
            "review_date": "2019-01-12"
        },
        {
            "review_title": "Excellent",
            "content": "It's one of the best Turkish series. Thanks to producer and actors for making such a great series, good scenario, story, dialogs etc.",
            "review_date": "2019-09-27"
        },
        {
            "review_title": "Far too long, but great 'elements' and an impressive finale make this intriguing Turkish crime drama worth the struggle",
            "content": "I wouldn't want to get carried away with 'Sahsiyet'. Its 12 hour-long episodes make it quite heavy-going. There's actually a great storyline which becomes clear at the end, but I think it could have been dealt with much more quickly (6 long or 12 short episodes, would surely be enough?). I also found the characters quite difficult to get along with, even the more sympathetic ones like the woman police detective and her journalist boyfriend. In short, I was bored by a lot of 'Sahsiyet'. I struggled on, partly because of the time I'd invested, and there was just about enough to pique my interest. The central idea is intriguing, a man going on a killing spree as he loses his memory through Alzheimer's. Meantime, a strong cast of actors try to make things work (not their fault the writing often wasn't good enough), there are high-end production values which 'wow' occasionally, and Istanbul, of course, always interesting. Did anyone else notice how good the soundtrack was? There's clearly something about Turks and music, film makers who understand how to use it in drama. The series didn't really hang together for me, despite all these great 'elements'. The tempo is just too slow, not enough editing and cutting to sharpen the focus and heighten tension as events take place.Anyway, I'm glad I stuck with 'Sahsiyet' because it came good at the end. Look out for the amazing aquarium scene, a visual 'feast' and very surreal, typifying the best parts of this series. Just a long time getting there.",
            "review_date": "2020-06-17"
        },
        {
            "review_title": "Low-ish production values and effort drag down this strange but charismatic series",
            "content": "If I had to say something positive about this series, the first thing that comes to mind is the intro, which is incredibly atmospheric and visually stunning, although it hardly fits the series. Another positive thing is the music - it is varied but broadly speaking great, much of it being synth-based and reminiscent of something like \"Half-Life\"; however that cyberpunkishness, like the intro, doesn't feel like it quite belongs.This is a crime drama about a serial killer, where the murderer is the protagonist and the cops hunting him down are the secondary protagonists. However, even though the killer is with whom we spend the most time, the audience remains in the dark as for his motives and reasons until - literally - the last two episodes. Sure, we get some breadcrumbs in the meantime, but the logic of the narrative feels a bit disjointed, where we have no idea what Agah, the murderer, is after, and the cops follow up on leads quite arbitrarily. The whole plot is honestly a bit arbitrary, and a few plotlines just end without resolution or explanation. Others end with some explanation, but quite unsatisfactorily.The production values are quite cheap at times, and continuity is dreadfully overlooked: in the worst case, a character might warp from one side of the room to another from shot to shot, all within the same conversation. The at times just awful camerawork makes it even more confusing (seriously, almost half of the shots don't seem to have any particular reason behind them, as if the camera was placed on whatever spot a fly happened to land in the room). The series also suffers a bit from a certain prudishness, where they want to tease the audience with erotic shots of attractive female characters the way them western series do sometimes, but the most they can show is a bra, if that. Finally, the acting is hit or miss - while it's difficult to judge while watching with subtitles, quite a few scenes left me with a raised eyebrow or a felling of cringe instead of the desired emotion (ex. Agah's breakdown about the phonecall at the automechanic's).With all that said, the actors are generally charismatic and enjoyable to watch, and as a person quite distant from Turkish culture, getting a slice of life from Turkey and learning/unexpectedly recognising some Turkish words is an interesting thing by itself.(I've watched this series in Turkish with English subtitles)",
            "review_date": "2020-06-05"
        },
        {
            "review_title": "Breathtaking",
            "content": "I'm delighted to see so many 10/10 reviews here, since as you see that's what I gave it. I never, ever give up on a series once I've started it. I'm stubborn that way. The 1st episode (because we were getting to know everybody) was a little slow, and with 12 eps I thought I'd made a mistake. That didn't last long, as the series kept drawing me further and further into it. Great writing, above all. Dark, dark humor. Exceptional acting by the entire cast. Creative cinematography and effects. Continually surprising twists that are nevertheless plausible. I cannot recommend it highly enough.",
            "review_date": "2022-04-14"
        },
        {
            "review_title": "One of the finest thriller! 10++",
            "content": "After seeing so many mini series from different countries, I got hold of this. And what a discovery this has been, I am from India and I don't know the turkish language, so subtitles were the only rescue. But that did not hamper the spirit.Overall summary - awesome, keeps you hooked till last episode's last frameHighlights- other than top-notch acting from the stars, background music and cenemetography too is awesome.",
            "review_date": "2020-07-19"
        },
        {
            "review_title": "Stars for the Star",
            "content": "Only thing saves the production is the performance of Haluk Bilginer as the lead role. Beside him; plot is predictable, main characters are cartoonish and cheesy (police chief is a joke for example). Entire serie is a wannabe US crime-drama. The main subject is a reality in Turkey thats for sure but it looks like they made an mediocre US crime serie (with all aspects like characters and dialogues) sets in Turkish background. Also for the first time i witness that some extras had better performance than the actual actors.",
            "review_date": "2020-02-29"
        },
        {
            "review_title": "It's ok",
            "content": "As usual the German dub is awful. The story is quite good and feels fresh and new, but there are too many things not making sense and make it feel forced. I'm only at episode 4,but slightly loosing interest. The main actor is great and I feel every actor/actress around feels hyperficial - again from the German dubbing, which seems to ruin the whole show - no surprise here.. Might give the OV a chance when the visit to the parents is over. The camera works well, but a lot of scenes feel forced with artificial light and sometimes the colorgrading doesn't feel natural.Now I need 600 Charakter so finish this review.",
            "review_date": "2022-09-10"
        },
        {
            "review_title": "Amazing",
            "content": "This show is so good, Cansu and Haluk are amazing actors. The music the colors, photography all. I loved this show",
            "review_date": "2018-11-20"
        },
        {
            "review_title": "Definitely false rating",
            "content": "When you compare the show with the existing Turkish TV shows, yeah it does deserve some rating around 9. But when you compare it with the popular shows around the world, it just deserves up to 5 of rating. Looks like Turkish people compare this with the other Turkish TV shows or they are just supporting it just because the show is from our own nation. If that second thing is happening, thats not right thing to do. Because, you will lose more than whatever you earn by deceiving others.",
            "review_date": "2020-03-31"
        },
        {
            "review_title": "Great story but average directing",
            "content": "The story is really good but directing could be more touching and affective. Missed opportunity.",
            "review_date": "2020-06-30"
        },
        {
            "review_title": "Best turkish series ever and in the quality of foreign tv series",
            "content": "I am reviewing this series after I finish the whole serie which makes me review it generally, as a whole. After the first 6 episodes the serie gets more exciting and the main idea on the pressure of bigot, typical turkish peoples society comes forward. The idea of imperious, traditionalist peoples influence on women (very common in turkey) is covered in this serie perfectly that I couldn't find another better way to show this truth about turkey to turkish people. Hakan Günday is one of the best writers in modern turkish literature and Onur Saylak directed many powerful literary movies in the Turkish movie history. The acting was also good as well as the soundtrack which reminded me american series. The scenario was very original and the finale was not disappointing. Throughout the serie, there were many catchwords and I felt like I was reading a literary book . Sahsiyet, broke the rules of typical turkish series full of cliches and long glances with a boring background music.",
            "review_date": "2018-06-17"
        },
        {
            "review_title": "Great show",
            "content": "I never was fan of turkish series, but this one is the third one I watch after 50M2 and Bir Baskadir.I was enchanted by the actors especially by Haluk Bilginer who plays Agah and Humeyra who plays Feza.I was amazed by the storyline, and loved the metaphors used in the dialogue between the characters.Even if the story is not new, nor original, this series treated it in a different and unforgettable way.",
            "review_date": "2022-01-15"
        },
        {
            "review_title": "Baffling how highly its rated.",
            "content": "I watch lots of tv. Period. I have watched nordic noir, British thrillers & American whodunits. But rarely does one come across a plotless, senseless, half comic half tragic tv show as this one. I started watching it with high hopes, but even after trying for 3 episodes couldn't find anything to keep me interested. There is no plot. An old man developed Alzheimers & started killing people. Is this a plot? The pace is tedious, comic moments fill the episodes. I really wonder have people who rated this show a 10 star, ever watched forbrydelsen, bron broen, the fall and many more. Really disappointing show, and one I couldn't even bear to finish.",
            "review_date": "2020-02-21"
        },
        {
            "review_title": "Outstanding",
            "content": "A criminal circle which created by people who forget their conscuence in small town.. Connection is extraordinary and every episode suprised me while learning a lesson from every stories ehich they told us. Haluk Bilginer's acting skills are remarkable..",
            "review_date": "2018-12-08"
        },
        {
            "review_title": "One of the Best Turkish Series",
            "content": "When you finish the show you will never be the same.. i guarantee that:)",
            "review_date": "2019-11-26"
        },
        {
            "review_title": "Mr. Bilginer's and Mrs. Humeyra's great acting Are only positive points.",
            "content": "The screenplay is very messy and clumsy. Directing and Acting very amateurish unless Mr. Haluk Bilginer and Mrs. Humeyra's great performances saves this unrhytmic and often boring tv serie.",
            "review_date": "2020-01-04"
        },
        {
            "review_title": "Never seen anything like this come ot of Turkey",
            "content": "When I heard the premise, I thought it sounds like Breaking Bad, and I loved that and Better Call Saul, so I gave Sahsiyet a go. Yes it's a crime drama, but it's much more emotional and psychological.The cinematography is top notch. The framing, cuts end edits, the music, colors... all of them complement and support the setting beautifully. The story is very captivating, and the pacing is near perfect. If I'm not zoning off and trying to imagine a better situation for a show, that show deserves a good score in my opinion.",
            "review_date": "2020-04-29"
        },
        {
            "review_title": "Really something fresh and new",
            "content": "When I first saw the cast and Onur Saylak as the director, I really had high expectations, but this series was far beyond anything I expected. This show is totally Turkish in the sense that it is based on a more complex view of Tirkish culture, moving beyond stereotypes.\nWhen one thinks of Turkish tv series, there are so many stereotypes that come to viewers' minds: family drama, intrigue, romance, tears, patriarchal marriage/household settings (Ottoman harem, traditional/modern big house located somewhere in Anatolia or Istanbul) that more or less openly promote male polygamy and female chastity, tears, guns, mafia, more romance, more intrigue, more guns, changed siblings, more tears and so forth. Yes, a standard episode lasts for about 100 minutes. And there is this longing for/hopelessness about seeing Turkish productions made in any of the Western (by Western, here I mean largely Hollywood) genres varying from action to crime, fantasy, science-fiction, horror, mystery, suspense and so on. Longing for: understandable given the situation. Although there have been many successful offbeat shows over the years (Behzat Ç and Leyla ile Mecnun, to give two most popular examples), well, they largely remain marginal digressions. And then, there is this disappointment -and a mostly well-grounded one- that many Turkish viewers express on seeing the few attempts to produce Western/Hollywood style shows: we just can't do it, it looks really odd and pretentious when we take on those genres or themes. Nothing original. Doesn't suit our culture well. Then what suits our culture? Surely, it's not guns and polygamy dressed as marriage or intrigue? People sitting in big and fancy houses thinking all day nothing but pulling the ground off under their enemies' feet? Or shouldn't we perhaps leave those Hollywood dreams, which are more often than not full of stock elements and clichés of their own, and start looking for something different?\nThis is where this show really strikes the viewer with its freshness. It reflects the complexity of contemporary Turkish society with characters who have psycho-social depth and variety (going again beyond eastern-western which too quickly turn into modern-traditional or secular-conservative binarisms) The values of chaotic cosmopolitan life are depicted with as much intricacy as those of the closed small town community. Universal themes like injustice, oppression and violence, core family dynamics and trauma are dealth with care, avoiding clichés and never without humour too. Great acting, great scenes and great screen writing.",
            "review_date": "2019-01-07"
        },
        {
            "review_title": "Terrific",
            "content": "Visually stunning, character driven story is compelling, score of the movie is eurhythmical to thrilling twist. Persona is definitely worth your time.The main problem of the Turkish series based demographically on culture. People do not know much about modern Turkey. Their language does not come from any other umbrella term, it is original. Their religion once was shamanism. They are basically Asian nomads. But with the advent of settled life, Turks have changed and built empires. Ottoman Empire was one of the mightiest. You can even find traces in the Shakespeare's plays (e.g. Merchant of Venice), especially military power of Ottoman Empire is often praised. During 17. Century that empire was, most probably, the strongest of the world. Either way, age of empires is long gone, but descendants of the empire thought the world still revolves around them. Nonetheless, modern Turkey's population is only world's %1. People of Turkey do not seem to realize this now. Therefore, this misconception of \"us against the world\", find reflections in their works as well.Considering all these, Turkish shows commonly remain local. However, Persona is an exception. Rather than Haluk Bilginer's marvelous performance, the script has something universal this time. I think, this universality of the show is the most important aspect of it. Because, that's what distinguishes it from the common Turkish drama. In Persona, you can discover and experience death in a unique way, from a perspective of fading mind. So, if you think about it, are not our memories what make us; and thus, dying is not knowing anymore. This notion is both metaphorically (sickness) and physically (murders) embroidered. I definitely loved this concept.The second most significant value of the show is on the other hand, comparatively local. Even though, we see the modern face of Istanbul, there is a serious \"man-spreading\" issue going on. Despite all arrogant men's behaviors, we witness a young, independent woman's fight against them. This is not a first world country's problem anymore. Nevertheless, superficiality is. Young woman's struggle is supported by the colleagues of her, the media and men. However, do they really support her? Of course not.If you want to see a dark side of Istanbul, making an eerie voyage to walled city accompanied by a beautifully delivered picture with a compelling script, just watch this mini series and finish it at a weekend.",
            "review_date": "2022-06-01"
        },
        {
            "review_title": "Best tv series",
            "content": "Crime ++\nActor haluk Bilginer +++\nSubject+++The best Turkish series in recent times. He performance of the players is really good.",
            "review_date": "2019-09-10"
        },
        {
            "review_title": "An amazing production",
            "content": "Everyone knows that Sahsiyet is a milestone for the Turkish cinema. Especially, Haluk Bilginer, Necip Memili and Huseyin Avni Danyal appeared as great actors here. Good story, good concept and good technic.",
            "review_date": "2019-09-07"
        },
        {
            "review_title": "Fascinating Turkish crime series",
            "content": "Hakan Günday and Onur Saylak created such a successful mini-series casting great actors like Haluk Bilginer that it is one of the best Turkish crime series with a heavy story and strong social messages. It breaks down all the prejudices against Turkish TV series. A must-see production to witness an exemplary social oppression case with its results along with justice system and the role of women.",
            "review_date": "2020-12-13"
        },
        {
            "review_title": "Excellent job but missed the chance to be the best ever",
            "content": "If you look for something different, something gripping, something with a good message you should definitely watch this series! I've watched 12 episodes in just 3 days. The story itself is so captivating. It is about a 65 years old retired man who was diagnosed by his doctor as Alzheimer and knew that he would start to forget everything slowly. He decides to do the thing that he has always wanted to do but couldn't do because of his lack of courage! Killing guilty people... The story maybe comes to you familiar because we've seen some movies with the story similar to this one. In the beginning, I also thought like that but the handling of the story is really different and so convincing. I couldn't see any hero, extraordinary character in the story. The killer has a lot of weaknesses contrary to classical killer movies in which there is a killer who think every detail and a police (detective) who solves everything. The police reactions were totally the Turkish police reactions. When they experience a this kind of situation the Turkish police would give this reactions. In the movie, it is also emphasized that serial killer murder is an unexpected situation in Turkey. Every reactions that police and media gave is so natural. I felt as if I was in the film! Additionaly, the main message of the series is also very strong and you can not clearly see what is the point of all this murders until the end of the series. It has a very surprising ending.But I have some negative points about the film for example female main character Nevra (Cansu Dere). Her role is really important in the series. She is not only the main police who is trying to catch the killer but also the one who is in the center of the killing story. Maybe, this character is more important than Agah (Haluk Bilginer) for the story and the message of the film. Basically, while Agah was the brain of the story Nevra should have been the soul of the story. Nevertheless, I couldn't get this strong emotion from Nevra character although her story was perfectly written by scriptwriter. She should have been able to make us to drop our tears for her in the final scene. It was a very strong scene. If we had seen the remarkable performance by Cansu Dere like Haluk Bilginer's this series could have been one of the best in its category.But overall I advice you to watch this series if you haven't. You won't be regret.",
            "review_date": "2020-12-24"
        },
        {
            "review_title": "Turkish serials have great potential",
            "content": "I think Turkish serials and actors have great potential. They are very good at their work\nI apeeciate all the crew.Some of the great serials I can recommendEzel\nKursun\nFerhat ile sirin\nAnd of course Sahsiyet",
            "review_date": "2019-11-27"
        },
        {
            "review_title": "Best actor",
            "content": "Haluk Bilginer is the best actor in his country. He is excellent in this serial.",
            "review_date": "2019-11-20"
        },
        {
            "review_title": "Awesome Scrip Awesome Acting!",
            "content": "Haluk Bilginer is like a master and he knows how to act and how to impress the audience. Do you know why Sahsiyet is so special? This is because, it conteins reality this kind of situations (no spoiler) happens in everywhere not just Turkey and this script writer Onur Saylak knows how to hear his voice about these things... I'm so proud of with these people who gives effort to this....",
            "review_date": "2018-11-20"
        },
        {
            "review_title": "Truly phenomenal! Utterly perfect story development",
            "content": "Deserved to be on the top tier besides crime mysteries like True Detective, Fargo etc. Story development throughout the series from the beginning to the end is spectacular. Then there's the acting, especially of the lead actor who reminds me of Hannibal Lector from The Silence of the Lambs.",
            "review_date": "2022-08-14"
        },
        {
            "review_title": "The Best TV series Ever created",
            "content": "I have watched this series Three times. Frankly, Its the best series i have ever seen. Totally different and min blowing series. A must watch precious piece in TV series.",
            "review_date": "2021-10-22"
        },
        {
            "review_title": "Amazing! Refers to justice and cover up.",
            "content": "Especially i like refers to justice and law system.These were very impressive.And i loved Haluk Bilginer's acting performanse.He earned the Emmy award.Probably the best Turkish tv series.",
            "review_date": "2020-01-20"
        },
        {
            "review_title": "Amazing",
            "content": "Great acting great cinematography grear scenario must watch",
            "review_date": "2018-11-20"
        },
        {
            "review_title": "Promising",
            "content": "This is a series that can compete with European series like Borgen. The acting of Haluk Bilginer is amazing. Also Recep Usta did a very good work as well besides Sebnem Bozoklu, Ibrahim Selim, and Firat Topkorur. I only could not get a lot into the story of Nevra, Ates, and Tolga (I did not like the acting but they also were not bad but I just could not internalize them). But I understand those type of stories make the series sell to different audience also.\nThe names of characters all mean something, they are not given randomly. This makes the story more epic.\nThey show Agah representing conscious, somewhat snob, wise Istanbul gentlemen as one generation. They show Nevra, Firuz, Sebnem, Vural, Sefa as confused, somewhat lazy to fight for life and good, irresponsible (always accusing something on problems in life) as another generation (people in their 30s May think and can understand, maybe this is another thing that comes with age and this generation as late puberty).\nAnd there is the new generation with Deva, Suveyda and the girl at the park which has a totally different look into life, somewhat senseless, with loss for fear and pity coming with loss of respect to people ( as oldies say), values, culture.\nSo I found this series recommendable to anyone who likes thinking but not only after reset of their mind and spend only time.\nUnfortunately this is why such stories do not sell in TV but cheap and shallow series sell.\nI also congratulate Onur Saylak as a director unfortunately I could not stand any of the series he acted in (not because of his acting but the shallowness I mentioned in the series). I hope he does that kind of job again.",
            "review_date": "2018-11-06"
        },
        {
            "review_title": "I don't have the patience to wait for a miracle",
            "content": "This is my second time trying to watch it. First time couldn't go beyond the 1st episode, this time left in the middle of the 3rd. It is just boring. Apart from Haluk Bilginer, acting is almost amateur. Story; well, just not interested. I might go back to it again some time to understand all the hype about it, but today I'll just turn it off for the peace of mind.",
            "review_date": "2020-04-08"
        },
        {
            "review_title": "Great show!",
            "content": "Great story, great camerawork, music, locations..it all syncs perfectly together. but what really catches my eye is the performance. All the compliments to all actors within the show. And especially an extra big applause for Haluk Bilginer! What a hero!",
            "review_date": "2020-12-18"
        },
        {
            "review_title": "Haluk Bilginer is the winner of International Emmy's 2019.",
            "content": "2019 Best Performance by an Actor Winner, Haluk Bilginer presented by Tamara Tunie at the 47th International Emmy® Awards, November 25, 2019 in New York City.",
            "review_date": "2019-11-27"
        },
        {
            "review_title": "Some Good Points, but....",
            "content": "The over-the-too music interludes, the female millennial up-talkers, the millennial depressed dude slow talkers, it was too distracting for me to get invested in the information.\nI have the patience to read a book, or watch an adult documentary.... why all the gimmickry? Is that what's needed for younger viewers?\nIf you're a mature, \"grown up\" person, a little annoyed by reality TV, you might want to skip this. I could only get halfway through.I'd love to see this topic taken on by adult filmmakers.",
            "review_date": "2021-03-10"
        },
        {
            "review_title": "A contemporary portrait of the Turkish society",
            "content": "This series builds on multiple realities that co-exist in Turkish society in such a way that sometimes it seems surrealistic, which is exactly the feeling one gets observing Turkey. Even the absurdity of turkish realities is so successfully reflected. Each character is a real character and each story is a true story. The only fiction is the main - serial killer story, which is also highly probable, even though \"in Turkey one doesn't become serial killer, he runs amok\".\nThere are some aspects to criticize: Zuhal character could be improved. The teenage group's story could be better handled. There could have been even more dialogue btw female characters.\nBut overall, it is a great work in every aspect; script, acting, soundtrack, costumes, decors, mise en scene, cinematography, ... just watch it!",
            "review_date": "2019-12-28"
        },
        {
            "review_title": "Best serial killer serie ever seen",
            "content": "What a wonderful serie ever watched wow wow and wow. Totally a work of art definitely worth watching. Highly recommended. Full of plot twist, photography, art and story. ,,9.9/10.",
            "review_date": "2022-06-07"
        },
        {
            "review_title": "Masterpiece",
            "content": "This is the best show I've ever watched.I hope one day people realize that this show is equal to or better than Breaking Bad. And obviously Im proud of the with this show as a Turk. Especially lead role Haluk Bilginer great actor and he played his role perfect.Social amnesia is the main idea. Watch and no regrets.",
            "review_date": "2021-11-25"
        },
        {
            "review_title": "Turned out that I was wrong...",
            "content": "I usually do not watch Turkish TV-Series cause they always depend on love and misery. My co-workers were watching this series , and I was like .. yeah I'm gonna give it a shot. Watched all the episodes on Puhu TV , it was really above my expectations. I wouldn't ever think that this would be this much beautiful. This is a real progression on the definition of Turkish TV Series.Haluk Bilginer is the best of the cast. I mean, he literally lived the character. Years of his experience of acting , he showed all his talents in this series I think.And I want to thank Cansu Dere and the other actors who played roles in the series , giving us this enormous pleasure",
            "review_date": "2019-01-08"
        },
        {
            "review_title": "this is ...really good",
            "content": "Scenario is amazing and each episodes increasing dram and tension....",
            "review_date": "2019-01-13"
        },
        {
            "review_title": "amazing lead character, OK screenplay",
            "content": "It was fun to watch all episodes. However there are ridiculous scenes which makes no sense at all. The lead actor is one of the most famous from Turkey and he is my favourite actor of all times. The other supporting characters all do a good job. It is mostly the lead actors grandson and his friends that ruin the whole series. All the actions they do through out those series are complete nonsense and totally unbelievable.\nThe rest of the series are all good tough",
            "review_date": "2018-11-21"
        },
        {
            "review_title": "A hidden gem",
            "content": "I stumbled upon this series by accident, and boy I was glad that I did. I decided to put this on my TODO list because of the high rating and also because the plot seemed riveting. Best decision I made in a while :-)The story is unique and keeps you on the edge of the seat, the execution is flawless and masterful and you actually care about the characters, even the shady ones. And the ending definitely pays off and sticks with you, hats off to the whole team. The less you know about this the better the payoff so stop reading reviews and go watch this thing already.",
            "review_date": "2020-06-12"
        },
        {
            "review_title": "Haluk Bilginer's performance was flawless as usual",
            "content": "All of the things about this TV show is beyond reproach... Hakan Günday's such a perfect writer and when he's with with well-experienced actors/actresses he performs miracles like this. Very good workkk",
            "review_date": "2020-05-27"
        },
        {
            "review_title": "Best Turkish Series",
            "content": "The best Turkish series ever made. The story, acting and visual theme is a great job. It was a production that I have been waiting for all the episodes one by one since the trailer was published (Episodes came out in two, that's different...). Apart from that, the casting choices were also very suitable for the roles. The only problem was that the show had low PR. Until Haluk Bilginer received the Cannes award, almost no one knew about it or had heard about it and hadn't watched it. Definitely a must watch series.",
            "review_date": "2021-11-02"
        },
        {
            "review_title": "On the whole, an excellent series",
            "content": "The story is rich, the characters are properly assembled, the directing and Cinematography were amazing.",
            "review_date": "2020-12-20"
        },
        {
            "review_title": "Amazing",
            "content": "Finally a masterpiece it is amazing time flies between start and finish times of the show thanks to you for making this wonderful show thanks for everything i hope in future we will see more masterpieces like this.",
            "review_date": "2022-02-05"
        },
        {
            "review_title": "Nice job",
            "content": "Interesting and funny😄 one of the funniest Turkish serials I think. Beautiful girl Duygy😍",
            "review_date": "2021-07-10"
        },
        {
            "review_title": "not good",
            "content": "Its rly bad! quit after 15 minutes.\ni dont understand why the rating is that high.",
            "review_date": "2020-12-28"
        },
        {
            "review_title": "One of the best sample of Turkish casts",
            "content": "In Turkish there is a term \"gazini almak\" which means taking revenge from someone or something after a bad event. Mr. Agah Beyoglu shows us how a vengeance should be.",
            "review_date": "2020-02-22"
        },
        {
            "review_title": "Short, concise and meaningful",
            "content": "You'll forget everything you know. Do you think such a terrible situation could be a gift? To your watchlist of this series add. Don't forget..",
            "review_date": "2019-12-17"
        },
        {
            "review_title": "Very nice series except for Cansu Dere and little things.",
            "content": "Why would a successful and professional actor like Halil Levent work with an extremely bad actor like Cansu Dere in this series? Cansu Dere keeps saying that this is a TV series you're watching. You just get into it, his scene comes and it's disgraceful. Cansu Dere is very unsuccessful and very bad.",
            "review_date": "2022-01-14"
        },
        {
            "review_title": "Impeccable in every aspect!",
            "content": "When we watch films we tend to follow the actors and the plots but the credit here must be given to Hakan Gunay the writer of Kinyas and Kayra. Well written, easy to follow and gives little by little clues in every episode for the context of the movie. Also bringing actors at this quality together is part of the big success but not the major.",
            "review_date": "2019-12-08"
        },
        {
            "review_title": "A phenomenal poduction",
            "content": "This is what Turkish audience had been looking for! Turkish series have deserved a bad reputation because most of the series are produced for TV. Sahsiyet is the living proof of what can be done with a dedicated group of people who committed to make a masterpiece.",
            "review_date": "2019-12-20"
        },
        {
            "review_title": "Would like to compete with calibers like True Detective or Fargo",
            "content": "Update: in hindsight, it's the main protagonist who carries the whole thing.The English subtitles are, finally, good enough for transporting at least some of the tune and sound that comes with Turkish on that level of film-making. By that I mean, it can be foul, filthy, in this case without some rural accent and still very sophisticated - being able to translate such content into English obviously wasn't easy for non-English speakers.. that seems to have changed.The Dialogues are well written and executed, with an ideal pace and pausing and sometimes very funny, too.The acting of the main character is absolutely fantastic! The others didn't have any chance and gave their best nevertheless. In some scenes, I could not shake off the feeling that the casting maybe could have been better - but since I am not in this industry - who am I to judge.. still.. the grandson would have had more potential and also the main female part could not express all that she was supposed to. But to be fair, in the final episode, she took her chances given and did not waste them.Not much I can complain about the plot - it is well written and executed, finally there are people who know how things are done.There was one change in pace in the 7th and 8th episode and I think it was intentional in order to pick and wrap up all open questions and twists happening towards the great finale.Watchable.",
            "review_date": "2019-12-27"
        },
        {
            "review_title": "Good, but not quite...",
            "content": "It started off on a very slow note, I almost stopped watching mid episode. Haluk bilginer's amazing performance is the reason I proceeded. The idea of an Alzheimer patient killing criminals to maintain poetic justice is intriguing, but in this show it is not well executed. The female police officer's character is weak and not well developed. You can easily see the American Thriller's influence on the effects and style which is probably why the series is receiving much praise than it actually deserves.I have seen a Turkish series called \"20 Dakika\" dealing with the same theme \" Revenging a rape crime\" and it was better; directing-wise and writing-wise.",
            "review_date": "2020-08-08"
        },
        {
            "review_title": "Amazing show",
            "content": "One of the reviewers says it was as good as American crime shows, which made me laugh. Apart from Breaking Bad it's the best crime series I've ever seen. The premise got me hooked from the beginning, and the ending is exceptional and completely unexpected, though it was sad to see Agah finally succumb to his illness.",
            "review_date": "2020-09-01"
        },
        {
            "review_title": "Original and innovative",
            "content": "Let's broadcast the series series of the famous actress Onur Saylak, whose script was written by Hakan Gunday and whose directorial debut More was more. The series, which touches one of the bleeding wounds of our country, was appreciated with its original and innovative style and reached high viewing rates.Agah Beyoglu (Bilginer), who is in his 60s, is diagnosed with Alzheimer's. As everybody knows, patients who progress with gradually increasing forgetfulness do not remember what they are doing in the advanced stage of the disease and do not even know their closest relatives. When Agah Beyoglu realizes that his situation is inevitable, he begins to commit murder, trusting that he will forget. Nevra (Cansu Dere), on the other hand, can be struggled with prejudices and humiliations related to a pre-breed, and works for the murders that are required by the killer personally.Personality does not count as a serial killer story if Agah Bey is taken to use psychopathic personality traits that killed his victims with a rational aim. Agah Bey is a very original and well-written character, from colorful socks to his cold attitude towards his daughter and his measured kindness towards the opposite sex. Even the highlighter, rebellious explanation Hakan Gunday occasionally feeds into the scenario becomes paternal, natural and lovable from Bilginer's mouth, but does not lose them either. Undoubtedly, Haluk Bilginer.Unfortunately, there are some serious inconsistencies in the story of Agah Bey. The way that judicial records and evidence were obtained, the murder and the corpse transported inside the apartment, the unnecessary effort to get the fingerprint right next to it, the forgotten car, the encountered victim are the first ones that come to my mind. Moreover, Alzheimer's disease does not forget much until the last two episodes where you are Agah Bey.The story flows through the commissioner Nevra, where he is rechargeable. The details of being the only female police officer at the murder table are extremely well captured, but the scenes that tell Nevra about the torments made are as if a bit exaggerated. Just like Agah Bey's side, there are disruptions in the sense of plot and the disorganization in which there are many characters in detective cases. Necip Memili was a step up with his competent acting, despite his short time in these parts, which portrayed Commander-in-Chief Tolga. Cansu Dere is in my decision for some criticized evaluation because he is behind the rechargeable experienced cast. Nevra, as she interpreted, is an indecisive, insecure, tired of escaping, dull character. As for the side stories, the story of Ates (Metin Akdülger), who has a lot to say on the idealism of journalism and can be convincing to start shortly in romantic terms, finds the goal.Agah Bey's daughter Zuhal (Sebnem Bozoklu) and her granddaughter Deva (Recep Usta) used to hide herself, Nükhet Hanim (Senay Gürler)It emphasizes Agah Bey's mentality, coolness and sociopathic quality. Although Black Mirrorvari has good scenes with his move, the series is a bit up in the air because it doesn't have time to focus on this story. When we look at the general, although all of them are played by master actors, the series, which contains many characters, has difficulty focusing while keeping a lot of time with these side views and stories, and the solution of the event necessarily leaves the last two sections. You change the great reason of the development of Hümeyra's great Flemish, that Müjde Arin, Sebnem Bozoklu, Senay Gürler, Selim Ileri and Hüseyin Avni Danyal are acting with their acting.The personality is very original, detailed, and very creative in color use and works extremely well on the eyes. It is not as effective as cinematography in fiction. In my opinion, the scenes that briefly describe two independent events and that you choose one after another are necessary, not dynamic, but tiring. The original generics of the series that will bring stones to the foreign series, where it is very attentive, deserves praise.With his strong pen, Hakan Günday signs his country's distorted point of view, neighborhood pressure, choose justice, immediately using his share, hypocrisy, favoritism and corruption, honesty, a bag of honesty, how the arm of the hand of justice is tied. However, some scenes scrutinize the muse of experienced actors and impress you, some scenes are just for advancing stories. The script contains realist to expect him to catch the same momentum on stage in the series, but this difference between the scenes of the Personality is perhaps a bit more pronounced as some episodes raise the bar a lot.The story we read in the newspapers, which is linked to a very sensitive subject that is branded, examines but ends with a questionable final. Personality says: Justice and law are different things. What do you call justice? Self-defense. Revenge is a late self-defense ...In fact, I think that the personality's point of view and affirmation on the son of the series is quite problematic, in particular, to use the choice of a solution for his son, his rightful criticism, his very good determination, not the individual justice, but the ability to run the system correctly.Despite everything Figures just extraordinary Haluk Bilginer revive protagonist is fun and it creates bile difference with image management, a very different vision, not exactly the sequence in Turkey heralds can say with complacency. It is highly recommended for those who want to face and catch a crime story that tells about the first serial participant in our TV series history.",
            "review_date": "2020-01-27"
        },
        {
            "review_title": "MASTERPIECE",
            "content": "This was the first time I watch a turkish serie and it was breathtaking . I never thought they gone so far .\nFrankly a masterpiece .",
            "review_date": "2020-04-14"
        },
        {
            "review_title": "Director wasted it all..",
            "content": "Hakan Gunday's work is totally wasted by terrible direction and editing. Onur Saylak should go back to acting.",
            "review_date": "2018-04-22"
        },
        {
            "review_title": "A good one",
            "content": "This is a one of the watchable series, a bit slow paced at times with unnecessary and quite nonsense and unreal dialogue, especially those include Nevra, who is the weakest point in the plot. Series still enjoyable though.",
            "review_date": "2019-10-21"
        },
        {
            "review_title": "Outstanding, a big win for Turkish serials",
            "content": "So unlike Turkish series I've watch in the past. But with highly regulated environment its rare to see such themes dealt with. And no impossible unrealistic love stories with so many plot twists that I get dizzy in the midst of two to two and half hour episodes. Haluk Bilgindar was phenomenal as the lead and definitely deserved his international Emmy. Impressive performances from Cansu Dere and the supporting cast. Solid script,music and directing. A well told story in 12 episodes of a little over one hour. Hopefully we can see more Turkish shows of this caliber.",
            "review_date": "2020-07-31"
        },
        {
            "review_title": "Not perfect but an important step for Turkish TV series",
            "content": "Sahsiyet was definitely the most successful Turkish TV series I've watched. It had an above average directing and cinematography. The story line was also well built but had mediocre story telling. Most of the major characters were created in detail and deeply while most of the side characters were not that convincing unfortunately. Overall Sahsiyet is definitely a great step for Turkish TV series to reach global standards and especially its own potential, but we still have a long road to take.",
            "review_date": "2020-01-15"
        },
        {
            "review_title": "Awesome",
            "content": "It is amazing, I am in love with this tv series! If you did not watch this movie you need to see this.",
            "review_date": "2019-01-15"
        },
        {
            "review_title": "Reflections of society",
            "content": "This tv series perfectly refletcs some social problems in Turkey such as violence against Turkey. Also the content of the movie goes perfectly fast.",
            "review_date": "2018-11-21"
        },
        {
            "review_title": "Shocking",
            "content": "Amazing and very dark show\nI loved the story very much, solid story unlike what we used to from turkish television.\nSpecially the finale episode OUTSTANDING\nwhich I may consider one of the best episodes of TV historyAnyway, I didn't like the soundtracks, doesn't fit and uncomfortable.\nThe directing is good but could have been much better by selecting one style of shooting only. -Wide shot I would prefer-",
            "review_date": "2020-01-19"
        },
        {
            "review_title": "Thank you for making this..",
            "content": "As a Turkish person i am so proud of this series. It is such a true reflection of what is going on behind the scenes that we don't even realize. Great acting and meaningful story.",
            "review_date": "2020-03-18"
        },
        {
            "review_title": "Exceptional performance from Haluk Bilginer",
            "content": "Exceptional performance from Haluk Bilginer playing the main character. Also good acting performances from Sebnem Bozoklu and Hümeyra, especially. Visual side, cinematography and the overall production is also good. The story is interesting, but the details and the scenario couldn't surpass the Turkish drama clichés. Some characters, events and situations are not realistic at all. That will be more apparent of course for those audience who know how things work in Turkey, especially in Istanbul. Unnecessary social messages, baseless philosophical remarks can be found throughout the story. It was entertaining nevertheless. It would not be so for me without Haluk Bilginer's performance though.",
            "review_date": "2022-06-21"
        },
        {
            "review_title": "This is more than masterpeace",
            "content": "Story, acting, colors, music, drama, reasons... everything's just wonderful.If you like drama and crime series, it is a little difficult to find a better one. Don skip any second when you watching. And it's free to watch from puhu tv.",
            "review_date": "2020-02-24"
        },
        {
            "review_title": "The best Turkish series ever!",
            "content": "The best Turkish series ever made.. all the acting, all the motion, all the story everything is really perfect. Story is so real that can happen in every corner of Turkey unfortunately.. wish it has more seasons.",
            "review_date": "2021-01-10"
        },
        {
            "review_title": "The best Turkish miniseries and script.",
            "content": "As you keep watching, you feel how beautiful the scenarios and acting are. Especially in the final, lightning strikes in your head. Congratulations to those who contributed, thank you.",
            "review_date": "2020-02-07"
        },
        {
            "review_title": "A Surprising Masterpiece",
            "content": "Intelligent; genius at times. Innovative; uhformulaic. Polished cinematographic aesthetics. Almost flawless acting; perfect casting. Scenic and ambitious. Humorous, poignant and penetrating.I deduct one point because I feel it would have been perfect if it were about 3-4 hours shorter.An on another note, as much as I admire the great Turkish works which have come to my attention; the creative class therein seem to vilify the Turkish countryside, in many of these pieces, which I find to be typical of city people looking down upon the country-folk; a phenomena that I cannot admire.Regardless, however, this work was at times, one of the best, if not the best, crime story I have ever seen, and this not even being a genre which I generally enjoy, but this works proves my inclinations wrong.",
            "review_date": "2022-04-05"
        },
        {
            "review_title": "Unique Scenario",
            "content": "Scenario is very good. It is original and unique.\nYou are beginning to be impressed with the intro. The links are well constructed. Characters has been chosen carefully. It is naturally successful.",
            "review_date": "2020-05-01"
        },
        {
            "review_title": "Revenge movie",
            "content": "Well-acted but a typical revenge motivated movie. Very few redeeming characters or plot",
            "review_date": "2020-12-17"
        },
        {
            "review_title": "Spectacular",
            "content": "This serie is a complete mixture of modern detective movies and turkish traditions. But also it pushes you to watch more to learn everything that happened in the \"Kambura\" step by step. Because the senario is so deep that you can not resist to yourself about the story. Especially one of the most known artist of turkey Haluk Bilginer is in the leading part of this serie. He won Emmy Award with his acting skills. There is not much to say. Watch and enjoy",
            "review_date": "2020-01-22"
        },
        {
            "review_title": "Never seen a better show ever!!!",
            "content": "I m a tight series watcher. And in my life i have ever never seen suh a perfect show before !!! Haluk Bilginer rocks forever ! And the script belongs to the one of the best writers Hakan Gunday. He has perfect books.",
            "review_date": "2020-02-04"
        },
        {
            "review_title": "Would have been a masterpiece if 6 episodes instead of 12",
            "content": "Excellent plot with plenty of twists and it all made sense in the end. A fascinating (and rather unflattering) insight into Turkish culture. Well made, produced, acted and directed. But so full of soliloquy and profound conversations, as well as peripheral story arcs that really did not add to the main theme. The entire show would have been a masterpiece if it was half the time.",
            "review_date": "2021-04-23"
        },
        {
            "review_title": "One of the best crime stories! (the best in Turkey)",
            "content": "Even when you read the topic that can fit into one sentence, you wonder, \"How can someone with a diagnosis of Alzheimer's hunt down criminals?\". If you are someone who cares about realism like me, you may have a concern and say \"I hope they won't turn someone who should be demented into a superhero.\"\nNow the spoiler part: They didn't. It was very well explained, all events took place logically and the mystery of the incident remained hidden until the last moment. They did a really good job! The plot did not disappoint me at all.I was unhopeful of the possibility of things like; the way the killer is murdering being stupid and unoriginal, the-where it came from is unclear-clues, the speed of the detectives solving the incident, the killer being too obvious, the killer being too irresistible, the killer's motive being absurd, and maybe the plot crumbling towards the end. Yet, none of them happened and it was really the opposite...\nI just don't like the fact that all the female characters in the series were wounded, broken and vulnerable. I expected a strong and self-complete woman mentor. For example Nevra's mother Nesrin was poor in character and acting of it was worse (even if Müjde Ar is one of the oldest actresses in Turkey).So the acting was almost perfect, Haluk Bilginer (Agah) and Cansu Dere (Nevra) were brilliant! I did not like Metin Akdülger (Ates), Müjde Ar (Nesrin), and Sebnem Bozoklu (Zuhal) at all, their characters seemed unnecessary and unexplained to me. For example Ates's death was realistic, but unnecessarily traumatic.I like the locations and shots and scenes from Istanbul, it was on point and not tourist compeller. I like the costumes, Agah and Feza's are my favorites. Dialogs and monologues are intelligently written, I like them so much.The ending was good. I don't understand why Nevra had a son, who was the father, if it was Ates then it could be more apparent. Also some questions remained; \"what happened to the fans of murderer, did his daughter find out about it, what happened to his daughter after returning to her abusive husband...\"Still, congratulations to Onur Saylak and rest of the team for making the best Turkish crime story ever.",
            "review_date": "2021-03-17"
        },
        {
            "review_title": "waiting for better episodes",
            "content": "To be honest I was waiting to be very greater show, I am a bit disappointed there are too much scenes that doesn't make sense. We should first know the characters much more, incidents are getting very fast.\nBest part of the show is the style of recording and effects. \nIf you compare to other turkish series this is definitely something new and much better.\nI can't get enough acting of Haluk Bilginer. He is the reason to continue to watch the show.",
            "review_date": "2018-03-23"
        },
        {
            "review_title": "Everything is beautiful about this",
            "content": "The acting, directing, dialogues, STORY, even the intro... Everything is beautiful about this show.If you want to see a quality Turkish show other than Turkish soap operas, go with this.",
            "review_date": "2020-05-31"
        },
        {
            "review_title": "Incredible",
            "content": "You should watch this serie, it was amazing, the history, actors everything is perfect We all want a new season",
            "review_date": "2021-01-25"
        },
        {
            "review_title": "Best Artist Ever",
            "content": "I would not give Emmy to this man, nor Oscar, because the award to this artist is not yet available in the universe today.",
            "review_date": "2020-03-28"
        },
        {
            "review_title": "completely overrated",
            "content": "Are the top reviews paid off? It's very standard tv series, i've watched it based on ratings and reviews and it was very mediocre and boring with no added value to modern filmmaking.",
            "review_date": "2020-01-05"
        },
        {
            "review_title": "good nuances between a stubborn old man and his visitations old friends",
            "content": "I kinda like the idea of having an alzheimer patient as a serial killer for a purpose because the Agah character is showing some funny side of an old man behaving as if everything is ok when he is punishing the victims according to his judgment.It reminded me the both Gustavo and Walter White together.Just to be clear,i didn't like the flow of the events and transmissions, they could have been faster and more complicated.Maybe just the scriptwriters are taking it slow for now ,and they will adjust this deadlock and adrenalin balance later in last episodes.However ,i must confess the main reason i've been watching this TV series is definitely Haluk Bilginer, one of the greatest actors of the world. He is amazing on all his acts .And i cannot help myself to stop saying how much lack of act the Nevra character has,why so?It is not enough to create a perception for just the main character,the rest of the cast need more details ,too.What's more,description of the place related to all events happening for should be more detailed instead of being a symbol.Generally i liked this tv series and it gives remarkable hope for Turkish productions,it is worth to watch because it is more than just a serial killer movie,it is more like a psychonarration.",
            "review_date": "2018-05-23"
        },
        {
            "review_title": "Awesome",
            "content": "I think the series is awesome. Topic is appropriate to Turkey. Haluk bilginer is fantastic artist. I love this series.",
            "review_date": "2020-05-04"
        },
        {
            "review_title": "Perfect....",
            "content": "It is the best Turkish series.... Haluk Bilginer is perfect...",
            "review_date": "2021-02-14"
        },
        {
            "review_title": "This is Historical performance from Mr.Haluk",
            "content": "One of the best crime, mystery series\ni have ever seen\nwith Historical performance from Mr.Haluk",
            "review_date": "2020-04-14"
        },
        {
            "review_title": "If you watch first time you forget and watch repeat",
            "content": "I think is this movie entered best turkish movie list",
            "review_date": "2020-05-04"
        },
        {
            "review_title": "Congrats",
            "content": "Thanks to all actors of sahsiyet.story was so excited and Haluk bilginer act so good",
            "review_date": "2019-12-31"
        },
        {
            "review_title": "wooow",
            "content": "I have never felt amazed like this before while watching any other Turkish production. such a brilliant work done by Onur Saylak. i have enjoy the every second of the series and i have been waiting more of it from Onur Saylak. i hope some other can achieve this brilliant level and make me happier. no need to mention about acting Haluk Bilginer is one of the best Turkish actor has ever came on stage but this could be his masterpiece.",
            "review_date": "2020-02-21"
        },
        {
            "review_title": "BEST TURKISH SERIES!",
            "content": "First off all, i was never interested to watch turkish series exept a few comedies and good ones even i am turkish, because 90% of turkish series are soap and dont have original story\nBut i heard a lot about sahsiyet and started to watch and after a couple episode i could not take myself off watching it the story is pure original musics,were fantastic social messages and dialogues are not ordinary.\nIf i could tell a few negative comments would be i think it should last 2 episode less and Zuhal and Deva are not needed in this master piece\nBeyond all off it, Haluk Bilginer's performance is extraordinary!",
            "review_date": "2020-04-17"
        },
        {
            "review_title": "Excellent",
            "content": "Firstly thanks to Onur Saylak for these series. Also I want to say;Especially Haluk Bilginer is a great actor. I am very proud of his performance.",
            "review_date": "2020-04-25"
        },
        {
            "review_title": "best turkish series ever.",
            "content": "Amazing. just watch and not forget. learn something.",
            "review_date": "2020-05-24"
        },
        {
            "review_title": "Mutis",
            "content": "The best turkish serie ever!!! You have to watch this.",
            "review_date": "2020-01-27"
        },
        {
            "review_title": "The best Serie I have ever watched",
            "content": "So sad that the Serie ended\nSo perfect so cinematic perfect art emotional and more title that I can't identify\nBest Serie absolute perfection\nI cried when I realized the titles the killer left on the body\nSo dramatically show us the purposes of the murders",
            "review_date": "2020-09-02"
        },
        {
            "review_title": "We proud of them. We miss original series in Turkey.",
            "content": "I watched it with my mom. She is 41 years old. She said Sahsiyet in her top 3 list. We had high expectations because of Haluk Bilginer (we love him voice). Magnificent actors and actress, genius scenes, bare Turkish facts and more. As a women in Turkey, I can say that it is not just series. This is realty and we live in this realty. Thanks to Puhu TV. Sorry for my english, have a nice day <3+ SPOILER +My mom and I shocked when we saw cat scene, I am not talking about cat, I mean the man who ate cat food. :)",
            "review_date": "2021-08-06"
        },
        {
            "review_title": "Best Turkish TV Series",
            "content": "As a movie buff, I've watched lots of movie, series. I can frankly said that this production incredible qualitified. You can never forecats what will coming, scenario is always continiuning with mystery. Final episode is just a thrilling. Musics are deeping inside you.Main theme is just a Turkish realities, There are many implicit references in the scenario. Before the watching, you should search a couple thing, especially murdering journalists. In addition, burning house, raping based on true story, what a pitty!when Haluk Bilginer taking the Emmy awards, he said that \" Sahsiyet is about amnesia and justice. But not amnesia when individual but more dangerously and harmfully amnesia is the society. Therefore please make sure the society live in does not suffer amnesia!\"",
            "review_date": "2020-05-11"
        },
        {
            "review_title": "Streaming",
            "content": "In INDIA which platform is streaming this series.,..,..",
            "review_date": "2021-08-30"
        },
        {
            "review_title": "Best series I've ever watched",
            "content": "If you enjoy crime mystery drama just watch it..",
            "review_date": "2021-08-09"
        },
        {
            "review_title": "Masterpiece",
            "content": "They did not kill the pimp and sent it to the audience. I congratulate on behalf of Turkey for such a movie.",
            "review_date": "2020-01-16"
        },
        {
            "review_title": "An Immersive Series From Start To Finish",
            "content": "An amazing series that prints its name in Turkish letters with golden letters. Immersive from start to finish. a terrifying story. The director's experience of some scenes in the mind brings the audience a little closer to the series. player performances especially Haluk Bilginer are really extraordinary. The social messages of the series have a lot of meaning. Thanks for bringing such a masterpiece to everyone who contributed to the series.",
            "review_date": "2020-02-15"
        },
        {
            "review_title": "Best TV series & must watch for everyone.",
            "content": "Never thought anything like this from any Turkish film industry. 1st of all it needs more platform for to be seen for international audience. Everything thing is perfect the storyline, direction, editing, story buildup, suspense & most of all acting. I am in love with this season. Even recomend all my friends and family too.\nHope to see more seasons like this in future..\nGreat job guy..",
            "review_date": "2020-05-20"
        },
        {
            "review_title": "Excellent Story",
            "content": "The best tv-serie i've ever seen in turkish channels. Explain and support (solving problem) a major problem in the society. Everything was great. Casting, directing, script. Thanks for such a great thing.",
            "review_date": "2020-05-25"
        },
        {
            "review_title": "One the greatest mystery series of all time!!! Decades later this would be a classic.",
            "content": "There are thrillers and then there are nerve wrenching series like sahsiyet. I rank this very high amongst series like True detective, big little lies, twin peaks, sharp objects and unbelievable. Whats common between all these? Crime against women, done in a place where the people are too ignorant or partners in crime but hardly innocent, the sheer time it takes for justice to prevail and the way the mystery unfolds.Writers have done a nice job of evenly pacing the series in 12 episodes all equally vital and engaging. Awesome script without any loopholes. There are not many cliffhangers but still one cannot stop without finishing all episodes and still wanting more. There are actually many unanswered questions. May be there will be another season or may be we have to guess our own answers.It goes without saying that the acting was of top-notch quality. I have watched a few Turkish movies but this is my first series. Turkish people must be proud of such incredible work of art.",
            "review_date": "2021-04-04"
        },
        {
            "review_title": "Amazing = Haluk Bilginer",
            "content": "Breaking bad has nothing on this! By far one of the best TV series I have seen. I loved it and watched everything in three days.",
            "review_date": "2020-07-10"
        }
    ]
}