{
    "title": "Head-On",
    "rating": 7.9,
    "release_date": "2004-03-11",
    "num_reviews": 263,
    "genres": [
        "Drama",
        "Romance"
    ],
    "summary": null,
    "reviews": [
        {
            "review_title": "Bitter, Sad, Heavy, Unpleasant \u0096 But Also Original and Realistic Non-Hollywoodian Love Story",
            "content": "In St. Pauli, Hamburg, the alcoholic, drugged and hopeless German with Turkish roots Cahit Tomruk (Birol Ünen) lives like a pig in a small dirty apartment and survives collecting empty bottles in the night-club \"Der Fabrik\". One night, he gives up living, and hits his car against a wall. However, he survives the crash and is sent to a clinic, where he meets Sibel Güner (Sibel Kekilli), a younger German Turk, with suicidal tendencies. Sibel is the younger daughter of a conservative Turkish family, and proposes a fake marriage to Cahit, in order to permit her to leave her family; in return, she would share the rent of the flat, and she would cook and clean the place, and they could have independent lives. Cahit accepts, but while living with Sibel, he falls in love for her, until a tragedy happens.I saw \"Gegen die Wand\" yesterday and I am still very impressive with this powerful German movie. It is bitter, sad, heavy, unpleasant \u0096 but also an original and very realistic non-Hollywoodian love story. The location in St. Pauli, close to the famous Reeperban Street, could not be more perfect as the environment for such depressive story of losers. The precise direction of Faith Akin (obs: IMDb dictionary does not allow to write correctly the name of the director) is stunning, and the performance of Birol Ünen and Sibel Kekilli are outstanding and deserved nominations to the Oscar. When the character Sibel reaches the bottom of the well in Istanbul, Sibel Kekilli shines with a mesmerizing performance. Unfortunately we will never see Hollywood shooting this type of story, which is recommended for very special audiences. My vote is eight.Title (Brazil): \"Contra a Parede\" (\"Against the Wall\")",
            "review_date": "2006-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Splashy chronicle of a generation in revolt against tradition (worth watching)",
            "content": "Head On (Gegen die Wand), winner of the top prize \"Golden Bear\" at the 2004 Berlin Festival, is occasionally interrupted by a panoramic shot of a singer performing in front of a small Turkish orchestra on the banks of the Bosphorus across from Istanbul. It's a simple, at first incomprehensible, little device that provides punctuation and clarity amid the chaos and melodrama that otherwise dominate this story of a Turkish man in his forties and a twenty-year-old Turkish woman who meet in a psychiatric facility in Germany when both have attempted suicide -- he by crashing his car into a wall (\"head on\"), she by slitting her wrists. Cahit Tomruk (the sublimely attitudinizing Birol Ünel) is a purposeless rock 'n' roll loving boozer with a dead-end job collecting bottles at a club, and Sibel Güner (the wiry, intense Sibel Kikulli) is a young woman with conservative Turkish parents who wants to escape family pressures.Both are total drama queens and both are German-born Turks. Cahit is more assimilated; his Turkish isn't even good. Sibel figures if he'll agree to marry her that'll get her away from her family. This is the irony of their situation: she must capitulate to the conventions of their culture in order to gain some freedom from it, and he must capitulate to society in order to get some sense of purpose. So they do get married -- he somehow passes muster with the stuffy family, baulking all the way -- and they eventually even fall in love. Her joie de vivre is exactly what he needs, and she's essentially just as wild in her way as he is in his -- but his nihilism and violence continue unabated and so does her promiscuity, and his brutal attack on one of her one night stands leads to jail and scandal, which in turn forces her to go to Istanbul. While he's incarcerated she writes him sustaining letters from Turkey -- their relationship, like the staid orchestra on the Bosphorus, is a stable element amid the surrounding chaos -- and after jail he goes to Turkey to find her.To say this turbulent, brightly colored, lurid story is a \"realistic picture of Turks in Germany\" would be a total distortion of the truth. But somehow the situation of Cahit and Sibel reflects the unstable moods this half assimilated, half alien population experiences, and however melodramatic and unresolved the saga is, the two main characters are very well realized. The actors are strong, especially Birol Ünel, whose charismatic brooding and ravaged good looks make him irresistibly watchable. Both feel real to us -- he sardonic and gloomy, she dangerously spirited and full of life-- despite her dramatic suicide attempts, of which there's more than one. The story, as much as the images through which it's told, is both dark and vibrant.We need the Brechtian, Greek-chorus device of those orchestral interludes on the Bosphorus, though: without an occasional break the drama and darkness would be too much. We also need to go with the flow of this movie, and not expect it to be more polished or more organized, or even better looking, than it is. It looks unlike most films we're seeing now, but that doesn't mean the cinematographer hasn't done the best possible job. What it has is life, tumultuous with incident, strong personalities, and a milieu we've not seen before. There's also a loud, authentic-feeling rock-pop soundtrack and a cunning contrast between Cahit's punk-rock sensibility and Sibel's love of good grooming and dance. Arguably the movie is too long, but that length gives it the feel of a saga, which it must have, because that's what it is, the confused, tawdry epic of a generation. Like all first films by a whole subculture, it has a lot to talk about. When Sibel and Cahit discover they still love each other, after everything, it's the Turkish Germans discovering that they have self-worth. The last scenes are open-ended: this generation's future is anybody's guess.Seen in Paris 17 September 2004. Opening in the US in January 2005. First German film to win a Golden Bear in Berlin in eighteen years.",
            "review_date": "2005-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Thrilling Roller Coaster Ride of Love and Loss",
            "content": "\"Head On (Gegen die Wand)\" is a completely original love story and shames conventional Hollywood romantic comedies with its fresh take on love and loss as rich as Rhett and Scarlett.The closest I can think of a dysfunctional couple meeting so oddly cute and playing out an unusual relationship is in Christopher Fry's \"The Lady's Not for Burning\" which shares self-destructive lovers. The German literal title of \"Against the Wall\" is more resonant of how they feel, but the American distributors probably thought that had too much political implication.The completely self-involved he and she here are innately off-kilter because writer/director Faith Akin sets them within a diverse Turkish immigrant community of Germany, so that their personalities are circumscribed by cultural expectations and restrictions, she chafing against binds on women and he lost in the nihilistic punk rock underground.The rocky journey of how they find their own individuality within their sexual and emotional needs and ethnic identity and what each means to the other is an unpredictable thrill ride as each unexpected action leads to tears, laughter, poignancy and regret of bad timing. This is a baldly brash and frank exploration of the meaning of love and marriage, as individuals and within a web of family, friends and culture.Craggy-faced Birol Ünel is riveting as the older, burned-out case whose past we only glimpse. Sibel Kekilli at first seems like just another pretty young thing, but brings spunk and sympathy on her maturing roller coaster ride. Evidently, deleted scenes that are available on the European DVD help to expand on the hints as to what her closing motivations are.Dependant on the English subtitles, I'm sure I lost some significances as I wasn't sure when characters were speaking Turkish or German, let alone able to discern their fluency in either, with the added fillip of recognition of globalization with a sudden concluding discussion in Istanbul in English of their future.The chapter introductions by an ethnic band playing a traditional sad love song adds to the timeliness of the tale that is reminiscent of old folk ballads of tragic love stories. In between, the punk rock and contemporary world fusion selections are terrific, including the moving closing song.",
            "review_date": "2005-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Harsh, Gritty, Tough...Very Moving Film!",
            "content": "'Gegen die Wand' in German, 'Duvara karsi' in Turkish, or 'HEAD-ON' in English is an explosive drama written and directed by Faith Akin, a movie that may be tough to watch, but a movie that has enormous impact. While other films have successfully addressed the particular problems that the immigrant Turkish community in Germany face, few have come as close to examining all sides of the on-going issues of displacement and the effects of familial dispersal in the face of a new culture.Cahit (Birol Ünel) is a thirty-something lost soul, drinking and snorting himself into oblivion over the loss of his beloved wife. He lives in a slum, spends all his time in sleazy bars getting beaten up for inappropriate behavior until one night he drunkenly drives into a wall (?suicidal?) and ends up in a hospital where he 'meets' Sibel (Sibel Kekilli), a young woman who has again attempted suicide as an escape from her strict family's prevention of her having a life. Hearing Cahit is Turkish, Sibel nonchalantly suggests they 'marry': Sibel's only way to escape her family would be to find a Turkish husband. Though grossly mismatched, the two agree to an 'open marriage', they satisfy Sibel's family, and move in together. Sibel cooks and cleans Cahit's hovel, and then goes out and sleeps around. This arrangement eventually causes problems for each of them and Sibel moves to Istanbul to escape the horrors of the life she has chosen. Once alone, Cahit is confronted with the reality that Sibel is the only path to salvation for his tragic life and the story proceeds - or rather speed drives - its way to a heartrending finish.The characters in the film are generally unlikable sorts, especially Cahit, but each actor does so well allowing us to observe the dreary world that faces immigrants in a fractured society that we end up having an amazing amount of compassion for their character creations. Director Akin makes this two-hour plus drama speed by with such solid purpose that it seems a short film. There is considerable nudity and the sexual encounters may be a problem for some viewers, but Akin's cinematographer Rainer Klausmann makes everything work toward the ultimate message of the film. An interesting touch is Akin's choice of weaving a chamber music group of a female vocalist with Turkish instrumentalists as a chorus to comment on the action and keep us mindful that, though the film for the most part is set in Germany, this is a very Turkish story! Grady Harp",
            "review_date": "2006-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "among the best movies I've ever seen",
            "content": "I haven't watched such a great movie for a long time and it is really  great to see that this is a Turkish movie. After Nuri Bilge Ceylan's  success with Uzak in Cannes Film Festival, Fatih Akin made a very  successful move in contributing to Turkish cinema.   First of all, the movie explains the life of the Turkish immigrants in  Germany in a perfect way. We see how they cannot be neither German nor  Turkish anymore. They are stuck in between and they act as punks. For  instance, it is really true that most of the young Turkish people in  Germany cannot speak Turkish, like Cahit. We also see the ridiculous  pressure of Sibel's family: For instance, while her married brother  threatens&beats her whenever she has a boyfriend, he and his friends  can comfortably speak about how they sleep with prostitutes!  Also the cast is very good, especially Sibel Kekilli and Birol Unel. I  loved the scene where we can see the smile in Sibel's eyes in the  amusement park: she is so much in love...   In addition, there are so many things to say about the movie.. The  story is a very striking one itself. The hopelessness of the characters  in a world without love and moral values are explained so well-without  making it dramatic. Also, Sibel's life in Istanbul, her cousin's  life-like many of us: still single and waiting to be promoted!- are  also judgements beside the main genre. The music is also very nice,  with Depeche Mode and also traditional Turkish music.  Faith Akin has really made a good job.. The script is excellent and the  scenes are all pieces of artwork. I wish the best for him and all the  cast and I hope to see movies perfect like this in the future too...",
            "review_date": "2004-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Human Story Crashing the Walls ; Truly Amazing ,",
            "content": "Turkey premier of the movie has been held here just a few days ago but even before that all the attention was taken on the pornographic past of the lead actress neither on the golden bear nor on the success it has gained internationally  (Which I hated the way media approached) ... I have seen it recently and should say its a must see movie. A classic story of the 3rd generation of Turks in Germany outlined very well around a love story. Lead actor Birol and Sibel Kekilli have done a good job . The basic story takes you in and makes you feel all the sadness, craziness, happiness, joy and deep depressions of the characters. The bitterness of the reality spread all over the movie and kind of depressing. The story is also politically and socially a very good point expressing maybe thousands of peoples true lives stucked between two cultures. I would love to watch it once again.  This was Sibel's first movie and I believe she will be a very good actress and wishing her luck;I admire her posture towards all the criticism so much .",
            "review_date": "2004-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Another solid film from Faith Akin",
            "content": "As a Turkish-American, my praise for \"Head-On/Gegen die Wand/ Duvarlarla Karsi\" is perhaps predictable and it does admittedly contain a degree of subjectivity. But, one must realize that Akin has succeeded where other talented Turkish-German directors have not. There was a genuine, noble effort called \"Yara\" (an earlier Turkish-German film) which demonstrates how hard it is to make a cross-cultural film which is universally accepted- one which is not isolated to either one country of origin (in this case Turkey or Germany) or the other. \"Yara\" had many great performances, and moving moments with wonderful cinematography, character acting, and an amazing film score, but it still did not meet its overall creative objective. \"Head On\" does just that though. Birol Unel and Sibel Kekili are profoundly amazing, as is Meltem Cumbul and the rest of the supporting cast. The film is also well-edited and it sticks to its complicated theme throughout. We really feel for everyone involved, even many (but, certainly not all)of the antagonists, and care about them. The film is brutal and harsh in its depiction of both Germany's cultural isolation towards immigrants and in backwards social mentalities in conservative Turkish circles which both oppress those who fervently oppose them and prevents those who challenge the mentality from getting past the discrimination which results from the darkest aspect of Anatolian life (which alas does not change with immigration). A tough film which should stand the test of time. But, it is not quite as profound as the Turkish film \"Uzak/Distant\" which was released here in the USA last year. Nor, did I enjoy it as much as another current German film \"Downfall,\" which I (it alas seems to be a minority view) found absolutely riveting. But, along with \"In July,\" there can be no dispute of Akin's talents which will be challenged by the high expectations many of us in the world Turkish community have for him. But, he has clearly earned that.",
            "review_date": "2006-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I was riding in that car with Cahit",
            "content": "This is one of the best love films ever made. Actually I'd call it 'the best' but some would accuse me of exaggerating but trust me it is much better than artificial and unrealistic examples of Spanish, French and Italian romance cinema. This film has a heart inside that pumps blood to every sequence of it. I think Faith Akin did a great job keeping this film organic and earthly.There is despair, hope, love then despair and hope once again. I could easily relate to the characters. Speaking of characters, Birol Ünel is the most charismatic actor I've seen lately, he dominates the screen along with Sibel Kekilli. Sibel Kekilli is an angel, pure acting, it is unfortunate what she had to go through in real life but she is stronger than most people and she had to prove it many times. In supporting roles there is Güven Kirac, who is one of my favorite actors in Turkish cinema and Meltem Cumbul who provides good acting.By the way despite of all the tragedy there is also ethnic humor in this film which goes hand-in-hand with the story. Especially the scenes with Birol Ünel and Guven Kirac are quite amusing, especially if you know Turkish.Anyway, all I have to say is \"I feel you, your sun it shines, I feel you within my mind, You take me there, You take me where the kingdom comes, You take me to and lead me through Babylon\" ... I was riding in that car with Cahit.Tebrikler Faith Akin, WE WANT MORE OF THESE!",
            "review_date": "2005-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Birol Ünel is a first-class actor",
            "content": "Gegen die Wand (2004) answers,corresponds in the highest degree to my expectations from a movie.This is how art,stripped of ballast and of concessions,can look.It is encouraging that movies so accomplished are made nowadays.Gegen die Wand (2004) has a chorus that frames the action's peaks.What is the director's rapport with the Turkish music that he uses?If it is not a naive use,it is not an ironical one,either.I would say that it is an affectionate rapport,a recourse to a simple,cherished and effective artistic shape;I think this is how Faith Akin uses the Turkish folk music:as a shape of the heart,a shape refined by time;so,his approach is cultured and affectionate and on a highly refined level.It is a great creator's approach of the great culture that he belongs to.Cahit is a Turkish guy and German citizen that earns his living by picking garbage;he was born in Turkey,but works in Germany,as a German citizen,and is not very interested in his Turkish compatriots,on the contrary,he resents all the ethnic stuff;as he tries to end his life,Cahit meets in the clinic a beautiful and very young Turkish girl that asks his hand.What follows is one of the most thrilling love stories.Faith Akin seizes the richness and the infinity of the life's poetry.He reaches the level of a perennial realism and of an astounding concreteness,within the parameters of a highly differentiated style.The photography is of a lavish beauty.There are sex and violence.Birol Ünel is one of the most interesting actors of today.He has the intelligence and charm and that note of cool that Rourke had in the '80s;his range as an actor is very wide,and he constantly offers an intensity of acting seldom seen in the movies.This joy of acting,this keen intelligence,this incisive force are what Birol Ünel brings in Faith Akin's film.There are few movies that I swallow with such an appetite.Perennial realism,the huge fascination of life,exceptional actors (Birol Ünel, Sibel Kekilli,Catrin Striebeck,Meltem Cumbul).The content is so abundant and overwhelming.A first-class example of artistic dignity and integrity.",
            "review_date": "2006-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very unique, profound, and touching",
            "content": "Gegen Die Wand is a major success of Turkish cinema, or rather Turkish and German cinema together. Yet another masterpiece created by Turkish-German synergy after the outstanding Lola + Bilidikid. Of course that one is more \"subculture specific\", but in the end the two deal with the lives of German Turks who are both German and Turkish, or more like neither German nor Turkish. So it seems like Turks and Germans can create great things together when they give up the Gastarbeiter vs. local attitude ;-)Faith Akýn must be congratulated for his cast selection! Nobody could play Sibel better than Sibel Kekilli. Apparently, she doesn't only act, she adds something from her actual life. One way or another, she deserves an Oscar with her performance! The others are nowhere behind her, especially Birol Ünel makes you feel for his character. The \"German Turks subculture\" depiction is brutally realistic too. I don't think anyone shall have a single bad thing to say about this movie, that would be plainly ridiculous.A love story, a profound depiction of social issues regarding the \"German Turks\", a virtual cultural journey. Everything, and everything good, exists in this flick! Thanks to Faith Akýn and the entire crew for bringing such a delight to life! 9/10",
            "review_date": "2004-09-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "haunting and poignant",
            "content": "This movie surprised me, because although I had read that it was good, it exceeded my expectations. The characters felt authentic and possessed believable strengths and weaknesses. The actors turned in powerful performances and I find myself, the day after I saw the film, still thinking about the plot but mostly remembering the expressions on the actors' faces.The movie did seem a little too long, but in trying to think of scenes to cut, I realized that nothing in particular felt superfluous or irrelevant to the storyline or character development.Finally, I didn't like the end! But that's probably because I've been ruined by Hollywood with its sappy happy endings. This film ended as it should, and probably as it had to.",
            "review_date": "2006-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Everybody needs somebody...",
            "content": "He's a kamikaze, he's Turkish and German (or from nowhere), he's lost the love of his life and now anything makes any sense... One night, after having too much beer and cocaine he decides to crash his car into a concrete wall. She's a young and beautiful woman that's dying to live freely, \"I want to 'youknowwhat'!!\", she says; she wants to enjoy life, to enjoy her city (Hamburg), but she belongs to a strict and chauvinist Turkish family, their stupid traditions are driving her mad, so she decides to cut her wrists... Two lost souls will find in each other just what they need: some fresh air to breathe.\"Gegen die wand\" has a modern touch, very \"european\", despite the Turkish origin of most of the crew and the cast. It's rather bittersweet but with some room for optimism. The characters have been perfectly made, and they do transmit the need of love and of be loved, of having an illusion in our lives. It's a hard movie, no doubt about it, but catharsis ain't possible without some pain.PS: for those dark-rock addicts, in the soundtrack you'll find songs from Nick Cave's Birthday Party, Depeche Mode, or Sisters Of Mercy...*My rate: 8/10",
            "review_date": "2006-03-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "just brilliant",
            "content": "I saw this movie last Saturday and have been thinking about it a lot over the last few days. It is truly a brilliant film. I loved the raw power and violent emotions that the characters experience and which hit the viewer like a ton of bricks.the two leads who play Cahit and Sibel are just amazing, Birol Unel especially manages to convey the despair, self loathing and loneliness of his character with a physicality that's just striking. it is to his credit that we, the viewers, can never despise him despite his violent and frequently obnoxious behaviour. In the beginning of the movie, Cahit is a wreck and although it would be simplistic to say that love \"saves\" him, it is certain that the collision of his life with Sibel's is cataclysmic.the movie's real power lies with the fact that the characters are truly multidimensional and complex, they experience conflicting emotions and desires and ultimately it is their incapacity to understand what is happening to them which leads to their downfall. They are so used to suffering and struggling and to using people and being used that when suddenly they fall in love, they can't even recognise what is happening to them until it is too late.I don't think you need to be Turkish, or an immigrant, to feel deep empathy with Sibel and Cahit. Their story is not just the story of two people \"lost in translation\" and suspended between different cultures. they are just a man and a woman who don't really know who they are or what they want and are looking for a slice of happiness in all the wrong places, until they happen to stumble upon each other. And even then, their love cannot save them from falling back through the cracks.In summary, a magnificent achievement and a truly brilliant film. I look forward to seeing more from Faith Akin, Birol Unel, and Sibel Kekilli.",
            "review_date": "2005-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Brilliant, Emotional and Visceral Film",
            "content": "I saw this film yesterday for the second time (I originally saw it last year) and loved it as much as I did the first time. This is probably my favourite film in the last 12 months so hence the need to say my bit. There is a wonderful, powerful, visceral quality to this film which is extremely rare in any art-form (lets be honest), so credit needs to be placed where credit is due - and it is due in huge amounts here. 'Head On' takes you on an emotional journey to the edges of the human experience, tempered by an nihilism and a soul-searching despair that feels all too real. These are not so much characters but real people with real dilemma's, and their life experiences oozes from every visible pore. The two central performances are bloody amazing and a reminder of what real acting (and characterisation) is all about. The direction is profound, not to mention the wonderful soundtrack (the Birthday Party track much appreciated!!). I can't say anything but complimentary things about this film and in my humble opinion is a modern-day masterpiece. On the small off-chance that the actors/producers/ director or anyone connected to this film reads this, congratulations on a fantastic piece of film-making!",
            "review_date": "2005-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the most SINCERE movies I ever seen.",
            "content": "As I mentioned in the subject if you ask me to describe this movie only in one word, this word would be SINCERITY, or may be HONESTY.Turkish people as a conservative society mostly do not get used to approaches towards Turkish culture in this movie by Fatih Akin. He successfully describes the boundaries formed around Sibel originated by her culture in an opposite-culture dominated country Germany. Fatih Akin has a free approach towards the life of Sibel surrounded by the WALLs built by her Turkish origin.I believe the reason of the free & brave approach in Fatih Akin lies in his free social and cinematographical development as a later generation Turk at Germany. In Turkey, we have no chance to get that approach he has, from our local directors because of legal, social and market dominated factors in local Turkish cinema.Besides movie tells a love story happened in an environment between, behind, among and surrounded by the WALLs. Sibel marries with an alienated looser man Cahit to break down the WALLs. But she forgot to plan about love. Love damages both of their lives in an unfortunate realistic way.As a result, Gegen die Wand - Head-on - Duvara Karþý is a must see SINCERE movie by a Turkish director from German cinema.",
            "review_date": "2004-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is the best foreign movie I've seen",
            "content": "Some people think this movie is about a culture immigrants (German, Turkish) But that is not the emphasis, the emphasis is about how low one can go, where does one hit the bottom, and a love intertwined in such a spiral. A magnificent tragedy, but it doesn't make you feel depressed, it makes you take a big deep breath in and damn and appreciate life at the same time. The actor and actress are magnificent so was the supporting actors. The director doesn't treat the audience as dumb nor as people who have to really think hard to get it. The sequence of events, the transition from scenes are magnificent.The movie swept every possible film award in Europe and is sweeping rewards in North America and rest of the world. This this is the best foreign movie I've seen. PERIOD (.)",
            "review_date": "2006-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An original, realistic, depressing, modern love-story.",
            "content": "\"Gegen die wand\" is a daring and original modern romantic movie, with not a joyful feeling all over it like you would expect from a genre movie but instead an heavy but also realistic and serious feeling all over it. It's European movie-making at its very best.But \"Gegen die wand\" is so much more than just a 'love-story'. It above all is a real character movie. The movie mainly focuses on the two main characters, who both basically hit the bottom of life. They meet and decide to get married, for different reasons than love. They are two completely different personalities, who bluntly drink, do drugs and have sex with basically everyone that wants to. The more time they spent together, the better they begin to know each other. They begin to see through the other person's eyes that their lives is not what it is supposed to be and they slowly begin to see their shortcomings, which they at first simply did not care about. They ultimately begin to feel more and more drawn toward each other which eventually leads to the two falling in love with each other. But of course things become more and more complex as they fall in love. The people in this movie are real people, which makes it easier to identify with them. It also helps to make the events in the movie feel believable and real.The story is told in a slow and realistic way. It takes its time to fully develop the characters, which helps of making them very realistic. Nothing in the movie feels really forced, which makes the drama feel real and powerful.The actors and dialog also help to make all of it work. The dialog is realistic and very straight-forward. All of the actors suit their roles very well. Especially Sibel Kekilli is a real young new discovery.The movie also shows some controversial and uneasy subjects, mainly regarding Turkish immigrants who are living in Europe. The portrayal of the conservative Turkish family is one of the many elements I'm talking about but also the whole Turkish customs and society in particular. The movie subtly shows some critique but without ever going too far of offending anyone.The movie is just mainly above all a very realistic one. It's not afraid to show the dark, depressing, imperfect side of men. It's unlike any other film you've seen before. The storytelling is wonderful and makes this movie so much more than just a romantic movie, which in the end it really is. The drama/romance is mixed in an heavy way and it makes \"Gegen die wand\" not always an easy one to watch but certainly an experience that you'll not easily forget.9/10http://bobafett1138.blogspot.com/",
            "review_date": "2006-07-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the greatest Love Stories this century",
            "content": "Really. It is. Absolutely brilliant. One of the greatest love stories I've ever seen in film. Still processing it really. Devastatingly real.",
            "review_date": "2018-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "fine on every level",
            "content": "\"Head-On\" is an intriguing film about two Turkish immigrants trying to forge a strange sort of life together in Hamburg, Germany. Cahit and Sibel meet in a mental hospital where they are both receiving treatment for failed suicide attempts. Sibel is so desperate to get out from under her oppressive, tradition-bound family that she pleads with Cahit - whom she barely knows and who is nearly twenty years her senior - to enter into a sham marriage with her. Reluctantly, he agrees, much to the consternation of her family who, while consenting to the marriage, make it clear to Sibel that she could do much better. After the two move in together, Cahit is at first happy to keep Sibel at arm's length while the girl sleeps around with various younger guys in the neighborhood. Gradually, however, Cahit's indifference turns to obsession as he realizes that he himself is falling in love with Sibel. From thereon in the relationship becomes ever more complicated until, finally, events spin so far out of control that the two wind up going along paths they never could have imagined when they started.This German/Turkish co-production sets its tale of an impossible love against the backdrop of two clashing cultures. Though they are certainly both products of Eastern society, Cahit and Sibel have clearly adopted many of the ways of the democratized West. Cahit often scoffs at his Turkish upbringing and Sibel does just about everything she can to not be a model daughter and sister for her stultified family. The relationship between Cahit and Sibel is an amazingly complex and volatile one; on the one hand, they seem to be genuinely drawn to one another out of a sense of love and commitment, while, on the other, they are co-dependent in ways that wind up bringing harm to them both as individuals and as a couple. Yet, for all their problems together, we do sense that Sibel really does bring meaning to Cahit's existence (as he claims), and that he may well serve the same function for her, as what starts out as a relationship of convenience turns into so much more. Writer/director Faith Akin does not provide us with easy reference points for how to deal with these characters, and it is that very complexity and ambiguity that makes their story fascinating.Birol Unel is excellent as Cahit, the man who has hit such a low place at the beginning of the film that anything is bound to look like up from there. But it is Sibel Kekilli, as Sibel, who really shines in the film. Stunningly beautiful throughout, she radiates an astonishing chemistry from the screen that catches our eye like a laser beam and never lets go. She alone is worth the price of admission.",
            "review_date": "2006-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very atmospheric and touching love story",
            "content": "\"Gegen die Wand\" is not the kind of movie I'm usually very interested in, but when I got around to watching it, it came as a pleasant surprise. It tells the story of a middle-aged down-on-his luck Turkish immigrant in Germany (Birol Ünel). Hiss life is such a mess that one day he drives his car headlong into a brick wall (\"Gegen die Wand\"). Reluctantly, he engages in a marriage with Sibel, a girl half his age who he met in the rehabilitation clinic. At first, she just wants to marry him so she can get away from her overprotective father and fully engage in western hedonistic society, but after a while the inevitable happens and they actually fall in love. From there, things go downhill again.In terms of story, \"Gegen die Wand\" offers a solid, yet fairly predictable narrative. From the get-go, it's pretty clear where everything is going. What really lift \"GdW\" apart, though, is the execution of the story. The acting is excellent, and all actors turn in believable performances and come across as real human beings you can relate to and care about. Special mention goes to Sibel Kekilli, who is simply enchanting. It's also refreshingly free of false sentiments, overdone music and other flaws that can turn a beautiful movie into a manipulative tearjerker.What \"Gegen die Wand\" also does very well is the depiction of the clash of cultures between liberal, hedonistic Germans and conservative Turkish immigrants. Like many girls, Sibil just wants to have a good time (which translates roughly to the traditional \"sex, drugs and rock & roll\", but she is completely misunderstood by her traditional father, who values family honor above everything: after Sibil attempts suicide, her family is angry with her instead of concerned, and later she is even thrown completely out of the family for something she didn't even control. Things become even more dramatic when Sibel ends up in Turkey, where women aren't nearly as free as in Germany, and Sibel's liberal lifestyle gets her into serious trouble.Also, cinematographically this is a very beautiful movie. It's beautifully shot, and the combination of western and Turkish music fits the images very well and adds tremendously to the atmosphere. There are even some interludes of a Turkish orchestra, playing on the shores of the Bosporus with the Aya Sofia mosque in the background. It's all very beautiful and very atmospheric.That being said, this movie probably isn't for everyone. The fairly slow pace will likely put some people off, and like I said the story is a bit on the predictable side. But those are very minor complaints about an otherwise well-made, well-acted and profound movie.**** out of *****",
            "review_date": "2005-11-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gegen Die Wand/Duvara Karsi is a masterpiece.",
            "content": "Hello,I would just like to say a few things about this film. I went to see this a few days ago and all I can say is, it is just fantastic. I am a citizen of both Turkey and England and I know exactly how it feels to be torn between two cultures and how difficult it is for people like us to fit in and express ourselves. There is just no middle ground between two completely different worlds, and as a result so many youths go to such extremes whilst they are in a state of complete confusion.In my opinion the film is not about a nymphomaniac as some people seem to think so. It is about a young, confused lady who wants to find her identity. All she wants is a bit of affection and someone to look after her. Her family do none of these things and as a result lead her to attempt suicide.This highlights a very important truth about some Turkish families who try to 'protect' their children so much that they end up suffocating them and driving the children into hating their lives.Faith Akin puts this across beautifully in his film. The performance of the actors, especially that of his lead stars; Sibel Kekilli and Birol Unel is brilliant. It has been a while since I have seen such a well made film, and the fact that the director is a young Turkish person is fantastic.The film is one of love, hope and disasters. At times it has you crying, whilst at other times you can't help but smile.This film won many awards, and in my opinion it deserves every single one. The fact that Sibel Kekilli has a history in porn films caused a massive fuss (especially amongst the Turkish viewers), but can I just say that her past is of no concern to us. The only thing we should be worried about whilst watching the film is her acting. Everyone that has seen it will agree that she is a fantastic actress, which is the only thing that matters. Those who have not yet seen it should definitely do so.Congratulations to Akin for presenting us with such a great film.",
            "review_date": "2005-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A simply great film",
            "content": "One of my favorite movies of recent years. Amazingly moving, bleak, sexy, funny, punky. Great acting, wonderful, simple photography, cool editing choices, and terrific music. An alcoholic, self-destructive Turk living in Germany agrees to marry young, borderline crazy, free spirited Turkish girl looking to get away from her grasping, tradition bound family. This simple plot leads to a relationship of amazing complexity, and a love story of joy, humor, and heartbreak. That's partly because filmmaker Akin approaches familiar situations with such a unique, playful and fresh eye, and partly because, along with his two lead actors he has created two unforgettable characters - rich in contradictions and confusion, like all of us. Nothing in their obvious personal experience is anything like mine. I've never been an immigrant, an alcoholic, or lost and self-destructive. Yet, with amazing ease I felt let into this world, and found the human connections underneath, the things we all share. Suddenly the differences in the human experience seemed much less important than the similarities. And, to me, this is the real genius Akin has shown in his last few films. By being so specific and real about a world, he, paradoxically makes it universal and accessible. My favorite film, by one of our very best working filmmakers.",
            "review_date": "2010-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not bad, but...",
            "content": "A good film, but nothing special, I expected much more having already seen Faith Akin's newest film \"Auf Der Anderen Seite\" which is excellent!Sometimes the movie looks and feels like a diluted Kusturica movie, it has at times also a feel that it was artificially constructed to please and that takes away from what could have been a much better film. The acting is generally very good, the story is interesting and the characterization also, but there is something missing, something that would bind it all together into a coherent whole. Like this, the film is merely a collection of good (and not so good) scenes that do not always seem to be connected to each other and do not always make very much sense, especially in the second half of the movie. Again, not bad, but certainly nothing to write home about.",
            "review_date": "2009-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "rock and roll, death and love",
            "content": "What a thrilling ride and what a powerful one. Lead actor looks like a brutish mixture of Jagger as Ned Kelly, Morrison, Iggy Pop and Nick Cave ,and acts like a monster. Two desperate people meet each with little to lose. The chaotic, rootless life they share brings them closer as they start to realize they have only each other. You can't take your eyes off male lead Birol Unel who drinks with utter abandon. This guy has turned a passion for living into a passion for dying. The suicidal Sibel who he meets is also charming in her willingness to push every boundary in search of a life she can live that makes sense to her. She is hemmed in by traditional Turkish mores and we are shown how wives end up in that culture--honored in gesture, completely devalued in practice.Unel in his moody majestic splendor is reminiscent of the great Klaus Kinski in Aguirre, Wrath of God. We watch him cop out over and over from facing anything like commitment to life or people. But his relationship with Sibel, born in nihilism and total scorn for convention, prods to life whatever remaining feelings he still possesses.What I love about this film is that it has real solid characters who are people that you care a lot about; it has education about the Turkish community in Germany and by implication about Muslims in Europe; it always shows and does not tell; it has wit and provocation and is multidimensional and makes you realize there are some things worth fighting for.My friend commented after seeing it that a quick comparison of this film with most Hollywood product shows just what pap we are accepting from LA. Yay for rage, guts, blood, love and meaning. Thanks to the creators for a film that ranks with Last Tango in its rawness and power.",
            "review_date": "2006-07-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Basic, row emotions, very little rational thought, loss of self – enjoy!",
            "content": "The title actually better translated as \"Against the wall\" and, seems to me, expresses feelings of the director Faith Akin regarding fate of his Turkish compatriots transplanted from Turkey to Germany, very much dissimilar countries divided by culture, traditions and way of life. Cahit (Birol Unel) deeply assimilated Turk in German society, who lost someone dear to him and on the self-destruction mission. Sibel (Sibel Kekilli) is a young Turkish girl, feeling trapped in the stifling confines of her traditional family, not being able to escape, trying to commit series of unsuccessful suicides. I hope you are getting the picture, and this is not a pretty one! Both of them are driven by basic instincts to which they give themselves fully. Loveless sex, drugs, bar scenes – the works. They are both \"walled in\" by their individual worlds from which there is no escape. Cahit is unpleasant, nasty, egoistic, dirty and ugly personality. Sibel is passionate, self indulgent, immediate-gratification type. Both of them do not exhibit any trace of intellectual life what-so-ever. They as well could be a pig and a cow. Food, sex, drugs – not the drive to improve themselves, use what god's given, learn to see beauty in the nature, develop and use your mind instead of systematically destroying it.Oh well, you will say, but they are in special circumstances. Human condition, you will say. What can you do? They are trying and trying but somehow can never quite kill themselves. Perhaps because their level of wretchedness can never exceed their hope for another round of sex, drugs, or any other such bodily pleasure. They hurt other people, who feel responsible for them, abuse them. And what about human condition of the rest of us, who are trying to bring meaning to our lives? Do we have rights? Do we deserve respect, even if we do not hurt others, working, trying to make life pleasant to others, do not ask and expect handouts? But they are mentally ill, you will say. Don't we have responsibility to care for sick? Are we to abandon them? Dump our daughters and friends when they are sick? Perhaps we can save them? Hopefully, the \"Head On\" will chip off a piece of the wall that isolates main characters and permit better their social integration into German-Turkish-Human society.Faith Akin produced credible and potent work of art which will endure. The film can (and should be) viewed more than once and deserves the acclaim it had gotten. It is nuanced and rich in promises of more and better things to come from this director.",
            "review_date": "2009-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great movie about what it means to live, and what freedom really means..",
            "content": "This movie is by far one of the best movies I have ever seen. Gegen die Wand takes you through the lives of two individuals living in Germany. Both are of Turkish decent but have arrived at their place in life by different means. Cahit is a older man, probably in his thirties, that has lost all reason to live. His wife has died and he picks up trash at a night club owned by a friend. He crashes his car and must visit a psychologist where he meets Sibel. Sibel is a twenty something woman who lives under what she sees as an oppressive father. She seeks to wed Cahit in order to truly \"live\". From there the movie shows the audience how Sibel and Cahit come to grips with their lives and understand the proper way of living. This movie holds nothing back. This movie makes anything Hollywood produce look like a child's movie.",
            "review_date": "2006-05-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding love story",
            "content": "I cannot remember the last time I saw a German movie. It had to be Das Boot many years ago. I am definitely interested in seeing more after watching this one this morning.I found this love story to be gritty and sensuous and stark and real. It was not like anything else I could call a real love story.Cahit (Birol Ünel)and Sibel (Sibel Kekilli), both in an institution for attempting suicide. I really could not figure whether Cahit was just a slacker who got tired of it all or was pining for a lost love. Sibel is like so many women who are tied to customs of a land she doesn't know and just wants to be free. She sees a ticket out in Cahit and, for reasons I cannot fathom, he agrees to marry her. This gives her the freedom to do drugs and hook up with whomever strikes her fancy.Things go well until both realize that they may be in love with each other. You saw that coming, didn't you? Unfortunately, before they can consummate their love and marriage, tragedy strikes and they are separated - one in jail and the other on the lam from her family.But Chait gets out of jail and heads to Turkey to find Sibel, whom we last saw beaten and bloody in an alley after a final act of degradation and, oh, with a knife wound to the belly. What can we expect? That his uncle or Sibel's cousin in Turkey will give him the bad news? Ah, that is the real beauty of this film. The twists and turns and love and death and degradation and passion. You never know what to expect.Just expect that this will be one of the very best films you see this year. Thank you Sundance Channel.",
            "review_date": "2007-03-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Too diffuse to be really effective",
            "content": "Unel is living in Bukowski-like squalor and despair in Germany; he tries to kill himself and runs into Kekelli at the hospital, who's also tried to kill herself, for somewhat different reasons. Kekelli convinces Unel to marry her so that she can escape her restrictive family environs: he does so, and soon finds he's falling in love with her. And then a bunch of stuff happens.This is a movie that works fairly well moment to moment: when you step back afterwards, though, the whole thing seems rather diffuse and pointless. Ultimately director Akin doesn't seem to want to impose any kind of narrative structure on the events he's filming: what ends up happening, though, is that his characters end up buffeted about by the demands of the movie-moment, and never really become anything more than pawns in Akin's vision.There is much to admire. Unel and Kekelli are both playing clichéd sorts of characters, The Immigrant Who Longs To Break Free and Live Life and The Drunken Bum Who's Really A Despairing Beautiful Soul, but they both throw themselves into their roles fearlessly, and manage at points to really bring them to life. The multi-cultural world is clever presented throughout, especially as a setting -- Turks drink German Beer and listen to Austrailian Goth while living like an American bum.Unfortunately Akin wants to embody this as an actual cinematic theme, and it doesn't really work. Having Unel play Mickey Rourke play Bukowski without a hint of a smile is odd, frankly. Little things like the Turkish musical interludes or the sudden break into English sound better in words than they actually play out on the screen -- it feels like a forced metaphor.Worst of all, this unwillingness to embody a genre, to instead go hop-skipping about among several possible \"stories\" is a real gross intellectual conceit. It has the perverse effect of robbing these characters of their dignity: almost anything seems to be able to happen to them, and that of course means none of it becomes very interesting. It also breaks tone, and that's always distracting to the viewer. Particularly because,despite some critics, there's nothing at all realistic about any of this. These characters embody a fantasy \"edgy\" world, it's a very artificial realm. I would argue that genre constraints allow for a greater realism, ultimately, in part because the auteur's hand is not so apparent.I will check out the next movie by Akin, I think he's got real talent. But this is too self-consciously unfocused to be effective, although isolated scenes are often well done.",
            "review_date": "2005-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow!",
            "content": "I heard about this movie when it came out and finally got a chance to see it on DVD. All I can say is...wow! I didn't have any particular expectations, but I was compelled to watch it a few more times. Wonderful soundtrack - a great mix of punk and Turkish music. Loved the Turkish band acting as Greek chorus. Wonderful acting, wonderful directing. I thought I knew where the story was going, and then it went somewhere else completely. I was on the edge of my seat for the last 30 minutes or so wondering what would happen. I am definitely going to keep an eye on this director and the actors.The movie certainly starts with a jolt - the first thing you see is a Turkish band in a picturesque setting singing a song of unrequited love. Then you see Birol Unel, and my first thought was - \"This guy's Turkish?\" - because he could easily pass for an ethnic German.I think far too much has been made of the Turkish aspect of the story. They were outsiders in society, but not because of their Turkish background. Reviews that suggest that this movie is some statement on the state of Turkish \"guest workers\" in Germany are far off the mark. Every society has its outcasts - punk rockers, etc.One major issue is that I wish they could have somehow indicated when they were speaking German and when they were speaking Turkish, because this is actually an important issue (I watched it with English subtitles). To me the languages don't sound different enough to tell them apart, though I could occasionally tell when they were speaking German when I recognized some German words.",
            "review_date": "2007-03-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "punk is not dead!",
            "content": "just wanted to add my voice to the chorus of hallelujahs...i love this movie for all the above reasons.I was drawn to this because of my long-standing love affair with the city of Hamburg. And the city is so proudly represented here - the wonderful seedy world of the bars and clubs and all-night Turkish food joints of Altona and St. Pauli, the poetry of crushed beer cans.Watching this film is like listening to a great Tom Waits album...it has all the gleeful lewd humor and bitter tears and truth.And yes, Birol Unel's performance is as moving as acting gets.There is no way to overstate how good this film is.",
            "review_date": "2008-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A great movie about life and immigrant problems.",
            "content": "Gegen die Wand \"Head-On\" By Malte006 I was really overwhelmed be this movie. I had read some articles about it \u0096 saying that this one was a great little gem from Germany. I starts out in a great pace and continues to hold this pace throughout the rest of the movie until the end, where it slows down \u0096 I bit much to down after my opinion.The story is about two persons Sibel and Cahit. Cahit is an immigrant from Turkey at the age at 40 and is living as a bum \u0096 starting and ending his day with a box of beer. Sibel is a second-generation immigrant likewise from Turkey; a really nice-looking girl, who's passion of to become free from her religious parents and life her life with parties, sex and alcohol \u0096 like an ordinary teenager. But she has to get married to get away from her parents. So, she and Cahit make a pro forma marriage and officially they're now married happily with each other. Unofficially they continue their lives almost separately from each other. But then their emotions for each other suddenly evolve and a drama with many conflicts starts.I really enjoyed this movie which includes great acting performances, a great script and a fantastic direction by Faith Akin.9/10",
            "review_date": "2005-03-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent, touching drama",
            "content": "It uses the old fake wedding plot line, but it works well because of the depth of the two protagonists and the actors who play them. Cahit (Birol Ünel) and Sibel (Sibel Kekilli) are Turkish immigrants living in Hamburg. They meet at a clinic for suicidals and Sibel cooks up the fake marriage plan so she can get away from her overbearing, traditional parents. All she wants is to be free to screw around and get plastered whenever she wants. Cahit really doesn't give a damn either way, but when she moves in with him, he starts to fall for her. The plot, at least at first, doesn't offer much in the way of surprises. It is believable, though. It develops very naturalistically. The two leads are beyond excellent. Sibel Kekilli is a former porn actress. I've seen numerous porn stars try to try their hand at real acting, and she's the only one who deserved to graduate.",
            "review_date": "2007-06-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life, love, passion and death",
            "content": "Is life worth living under any circumstances? The movie has two central characters who seem to think not ... at least at the beginning. If that doesn't sound like a match made in ... hell, what does? And would that be a good thing? It depends on how you see things and if you are able to empathize. Which at least at the beginning may be quite difficult .. but the actors in this will sway you over.And while the male protagonist was known for his acting chops, the female counterpart was quite surprising. At least for the viewers that is. And not just the ones that might have seen her other ... output/work in the adult business, but anyone who hadn't heard from her either. The demand of her other movies was quite high when this came out (I worked at a video store at the time - though I've never seen any of her \"other\" work or this movie until the other day, when I finally came around to watch this ... quite late I know).Sibel Kekilli who some may have seen in the Game of Thrones series too, delivers a quite mesmerizing performance to say the least. You feel her innocence, her vulnaribility ... and yet her very fragile psyche too. You may drawn to her, like a moth to a flame - even though you know better. Or maybe you are just fascinated by how well she plays her role.Head on is not just literally but also metaphorically ... will this relationship work and last ... and what will it do to the ones involved? Directly and indirectly! The movie can be fun at times, but is also very tragic in a larger sense ... not an easy watch at all ... but so well done and played ...",
            "review_date": "2020-11-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "moving love story for a general audience",
            "content": "When I think of movies with characters stuck between two (seemingly) incompatible cultures I am a little put off because they are usually only understandable to people with the same problem (e.g. \"Dilwale Dulhania Le Jayenge (1995)\"). With \"Gegen die Wand\" it's very different. The movie tells an universal love drama from a refreshingly modern point of view. I think, the intercultural aspect is a mere accessory part to add some exotic value to the story. This film is catching, sexy, honest and funny. And even though I might not agree with the attitudes of the director or some of the actors (as they put them forward in interviews) the movie is just plain good and a contribution to life itself! ...and the actresses are very pretty ;-)",
            "review_date": "2004-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My Favorite Movie",
            "content": "Since this is my first IMDb review, I am starting it with Head On. It is the only movie that I watched once through and when the credits rolled I just sat there, numbed, and decided to watch it again, and hit play and watched it a second time. I don't think that I even got up to go to the bathroom. I couldn't move. I didn't want to move. I just wanted to watch this again.There is just 'something' about this film. The crazy intro, the lead actor that you wonder the whole time if he's just some alcoholic that they pulled off the street to play the part, the eclectic combination of Turkish and German mashed as one, the genuine love, the genuine hate, the love of life, the desire of death, the humanness of it all. With out a doubt, this is a movie to watch. Again.",
            "review_date": "2016-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect combination of romance, suspense and humor",
            "content": "Homegrown Turkish directors still continue to suffer the lack of genuine characters in their movies. Therefore I have not seen many movies in which ordinary Turks would identify with one single character in a specific film. 'Gegen die Wand' is different. Here all characters are genuine and alive, no single personality is 'exaggerated' in order to render him/her more interesting. Despite this lack of artificial manipulation each character attracts attention through his/her natural appearance, gestures, and dialogs. I believe that Faith Akin will continue to direct amazing movies like this in the coming years, and keep on exciting the viewers with fresh ideas and stories",
            "review_date": "2004-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Faith AKIN, The Conqueror",
            "content": "At first I must say that, we -who watched this film- discovered a real energy what Turkey needs in cinema sector. The director, Faith AKIN, is a great story teller and knows how to reflect the intersections of the people's personal seeking in the life. I think he tries to prove that the degeneration of the cultures can not be stopped and he always makes us to ask ourselves if the life of the characters suits on us or if they are doing the right things... Sibel Kekilli is acting good but Birol Unel is driving the movie. He shows what a lover man have to do with his own style and he deserves all the good words with his successful act. A very dramatic story on a long long bridge which connects two hearts and two countries... Do yourself a favor and rent this movie.",
            "review_date": "2007-04-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "beautiful combination of tragic romance and immigrants story",
            "content": "I have previously seen only one film by director Faith Akin 'Crossing the Bridge: The Sound of Istanbul' - a documentary full of love for the city of Istanbul and its music, which had made me wish to visit this place where I have never been. 'Gegen die Wand' is a fiction movie, and a very different strong and ambitious one. It's the story of two Turkish immigrants in Germany, a man over 40 and a girl half his age entering a marriage of convenience so that the girl can escape the pressure of the family to enter into a convenience marriage and can live a 'normal' 'free' life. When the pretended marriage develops their love will play both the role of savior and destruction. They will be saved as love gives sense to their destinies marked by disorientation and suicidal tendencies, they risk to be destroyed as in a very melodramatic but but still believable twist of fate they will never be able to fulfill their feelings into common fate. They will be save but pursue of happiness needs to happen on separate paths.I liked the film, and I believe that its charm resides in the fact that the director does not refuse but instead adopts the ways, sounds and eventually images (the first half of the film happens in Germany, the second one in Turkey) of the Turkish cinema. Story telling takes what it needs from the oriental melodrama and combines it with modern cut and discrete acting. We do have musical prologues, intermezzo and finale, all filmed in a conventional touristic like manner on the shores of the Bosporus, just underlining the drama of the music and of the text in an operatic manner. We are being taken into the Turkish enclave in Hamburg, and in the fascinating combination of old, new, sea and colors so well known for everybody who visited and loved the cities around the Mediterranean. Birol Ünel and Sibel Kekilli give strong performances and the overall film atmosphere gives a feeling of authenticity and sincerity. The social commentary is sharp and not forgiving when it comes to the conflicts between the traditional and the modern societies. This was my first experience with a Turkish fiction film and a very positive one.",
            "review_date": "2008-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unbelievable",
            "content": "I haven't watched such a great movie for a long time and it is really great to see that this is a Turkish movie. After Nuri Bilge Ceylan's success with Uzak in Cannes Film Festival, Faith Akin made a very successful move in contributing to Turkish cinema. First of all, the movie explains the life of the Turkish immigrants in Germany in a perfect way. We see how they cannot be neither German nor Turkish anymore. They are stuck in between and they act as punks. For instance, it is really true that most of the young Turkish people in Germany cannot speak Turkish, like Cahit. We also see the ridiculous pressure of Sibel's family: For instance, while her married brother threatens&beats her whenever she has a boyfriend, he and his friends can comfortably speak about how they sleep with prostitutes! Also the cast is very good, especially Sibel Kekilli and Birol Unel. I loved the scene where we can see the smile in Sibel's eyes in the amusement park: she is so much in love... In addition, there are so many things to say about the movie.. The story is a very striking one itself. The hopelessness of the characters in a world without love and moral values are explained so well-without making it dramatic. Also, Sibel's life in Istanbul, her cousin's life-like many of us: still single and waiting to be promoted!- are also judgements beside the main genre. The music is also very nice, with Depeche Mode and also traditional Turkish music. Faith Akin has really made a good job.. The script is excellent and the scenes are all pieces of artwork. I wish the best for him and all the cast and I hope to see movies perfect like this in the future too...",
            "review_date": "2012-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "star-crossed lovers",
            "content": "Ever fallen in love with someone you shouldn't have fallen in love with? asked The Buzzcocks. A song filled with verve and energy, it could easily have played over the end credits here.Sibel is so oppressed by the demands of her traditional Turkish family that she is suicidal. Recovering from a failed attempt on her own life in the mental ward, she meets Cahit, a drunken, disillusioned Turkish immigrant losing his heritage identity to a German one he neither understands nor aspires to. Sibel proposes marriage, seeing in Cahit a chance to live freely while presenting a veneer of conformity to her family. What Cahit sees in Sibel is one of the questions the narrative strives to answer. When Sibel's brother asks Cahit if he loves Sibel, the answer he gives dooms him.Birol Ünel is the hang-dog Cahit, a man who expects nothing and gives as much in return. In Germany he is a Turk, but back in Turkey he finds common ground only with a taxi driver in their shared German experience. Sibel is Juliet and Lady Macbeth rolled into one, or perhaps just another young woman looking to get her jollies before settling down to domestic mediocrity. The oppression she seeks to flee is genuine enough - an honour killing is threatened and then botched.The films strengths are the performances from the leads, strangely vital and life-affirming in a tragedy, and the visual storytelling and economy, especially in the end. Years are compressed and the choices that Sibel has made, that ultimately seal her fate, are relayed through mise-en-scene and not dialogue. Happiness, the ending suggests, would be too much to bestow on this pair, but a sense that each is better for meeting the other provides sufficient succor. Violent and vicious in places, and fraught with self-loathing, Head-On is in its essence a great love story about the redemptive power of wanting to live for another.",
            "review_date": "2011-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tough love. I mean really tough love. But love nonetheless.",
            "content": "Head-on is a movie about love, hate, obsession, loss, pain, alcoholism, drug addiction and the confusion that results from this meaty broth being eaten too fast and in too great a quantity. It was a much better film than I expected. I was quite smitten with the lead actress who is the flawed, fractured essence at the center of this story, Sibel. Equally powerful and at once both compelling and repulsive is the husband, Cahit. These mismatched people are doomed to break apart from the beginning, but first they must come together. That, in effect, is what this movie is about. The growth of the spirit, the growth of love and compassion, and the growth of the awareness that life requires more from us than anger and bitterness regardless of how we may feel justified in these emotions. It's not a film for the faint of heart. There are scenes of brutality and violence that may disturb some viewers. The last scene is a bit of a cliché having been used in movies for at least sixty years. But I was still hoping that, after some time, things would change and the two people at the center would arrive at different, more satisfying conclusions. In effect, I imagined the movie continuing on and decided to end it my own way. A good rental.",
            "review_date": "2006-07-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Film",
            "content": "I caught this on the Sundance Channel last night. This is a great film. Proof, yet again, that there is an abundance of great film talent internationally (writing, directing, acting, photography, editing... all of it).The acting is nothing short of remarkable, anchored by the exceptional performance of Birol Unel. Reminiscent of Mickey Rourke in Barfly or Gary Oldman in State of Grace, the intensity and tragedy of the character was evidenced in every look, word and gesture. It's refreshing to see this type of character in film... we don't see it much these days in American cinema. This was a truly authentic performance.Sibel Kekilli also turned in a great performance of a girl who is equal parts willful, vulnerable, naive and resilient.The writer/director, Faith Akin, clearly knows what he's doing. Just about every element of this film was compelling. I look forward to seeing his other films.Check it out.",
            "review_date": "2007-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Raw emotions",
            "content": "Gegen die Wand / Head-On is music driven on almost all fronts: In storytelling itself, in reflections on the story (traditional ensemble in Instanbul) and as background (clubs, cafés, music in homes). In all Turkish cinema that matters you can nowadays see two main streams: Slow, reflective movies like Uzak and movies that are strongly driven by emotions and are very intense like this (although made in Germany). This movie is influenced by Lynch, especially some scenes of Lost Highway and Wild at Heart.The story is about two second-generations Turkish immigrants struggling with their place in German society, more hindered than helped by their Turkish traditional roots. Suicidal for different reasons they arrange a fake-marriage to help the girl out of her strangling family relationship. True love sets in of course, but in the end traditional values overcome this. It has a bleak and dark tone. Although it may not sound too original, it is daring in its portrayal and surprising. One of the sisters is more successful in a modern looking Turkey for example as a business woman. Turkey often looks here like paradise in contrast to the depressing German immigrant slums.Faith Akin is a linear and straightforward filmmaker. But here he makes intuitively all the right choices.(If you liked this check out the recent Turkish movie Anlat Istanbul, a combination of Fellini's Roma with a Pulp Fiction-like structure.)",
            "review_date": "2005-07-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dreck",
            "content": "In Hollywood movies the troubled romantic couple is brightly and cheerily filmed in nice surroundings. In this German film the couple is ugly and the surroundings squalid. Does that mean it's art? No, it just means it thinks making one-dimensional characters ugly makes them real. They're still just clichés, only now they're pretentious clichés.This is the kind of film that forgets what it had the characters do five minutes before. The drunken bum is a widower. He says his wife's name and looks at her pictures. And then all of the other characters forget about it, he forgets about it, and we forget about it. It didn't really matter - it was just a formula.This is garbage unrelieved by any style (unless you think jump cuts are innovative), layered with loud but uninteresting music, and devoid of any point. The acting is impossible to judge, since the characters are so badly drawn, it's static in all the worst ways, and it's ugly to boot. Want to see a film about a strange romance of strangers in German society? See \"Ali: Fear Eats the Soul\" instead. It's got soul, and heart, and intelligence. This just has hype.",
            "review_date": "2005-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gegen die wand describes the life styles of people who are held by two cultures",
            "content": "One more interesting Faith Akin film: Gegen die Wand. This film is totally a good example which describes the life styles of people who are held by two cultures. Most people don't know that Turks are the most crowded foreigner population in Germany. Of course both German and Turkish people have troubles because of some reasons. One of the reasons is that German's wishes about Turks related to adaptation to life style of Germans. A Turkish girl, Sibel wants to live like German people want and her family doesn't accept such kind of a life. So Sibel is sent to the psychiatrist by her family to prevent suicide. She meets Cihat who is a Turkish and has a rotten life. She suggests him to get married with her and Cihat accepts this proposal. But as Cihat knew, Sibel has an aim to escape from family pressure with marriage. So the film explains the things in this process.I consider this film very important because it reflects the conflicts between Turkish people in Germany and German life style. Sibel Kekilli does a great job in the role of Sibel who wants to break her chains. Faith Akin is like always and shows his amazing ability. The songs that are singed by Istanbul Bosphorus lets you know about Turkish lyrics and the culture. Of course I especially note that Drama and Romance could be mixed in the best shape as it was like in it. Meltem Cumbullu and Birol Unel fits in with their roles perfectly but I didn't say same things about Sibel's family.Lastly, One more interesting Faith Akin film that starts in Germany and finishes in Turkey...23 wins & 11 nominations already shows the success of it. Just watch it.",
            "review_date": "2007-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "very good",
            "content": "'Gegen die Wand' (= 'against the wall' in German) excellently reflects a problem touching Western European society nowadays. It's about Europeans importing their labor-force from Turkey, Algeria and Morocco. Just like the Americans do from Mexico.This movie deals with Turkish labor-immigrants in the big German harbor-town of Hamburg. Strongly rooted in their age-old, highly religious traditions, these people have trouble adapting themselves to the economic-dictated rules of western society. For instance, eating pig-meat is a deadly sin to them. For this reason they don't let their children play with German children, fearing they'll be wrongly fed by a well-meaning German mother. Isolation is there.As clearly woven into this movie's plot, these immigrant's children adapt themselves much better than their parents do. By now every West European law court can testify, how big tensions on this can be within the Turkish community.The great value of 'Gegen die Wand' lies in the honest exposure of this problem. Presented from a Turkish point of view, which is rare, and free of any prejudice. Understanding is eased here by showing a band playing/singing Turkish songs. The same goes for the shots from Istanbul, a pretty 'western-orientated' Turkish town.The acting in 'Gegen die Wand' is excellent. Female lead Sibel Kekilli clearly shows she understands the workings of German society. By appearing naked for instance, an unheard-of sin in the tradition of her Turkish home-country.",
            "review_date": "2004-10-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "straight to your heart (might contain spoilers!)",
            "content": "Despite his Turkish origin, we, Turkish audience in Turkey, met with Fatih Akin quite late. However, that didn't change the fact that he is now one of the most loved directors also in Turkey . Head On is a film that touches your heart. I don't know, if me being Turkish is a reason to love this film. But love, fear, hatred, passion, desperation and hope are universal feelings, right? There are a lot of things that break your heart in this film. To see Cahit so desperate and at the edge of the life, to see his buddy in struggle of saving her friend, to see Sibel while she follows her instinct to live the life she dreams...These were really touching but there are two scenes in the film that really crushed me. The look on Cahit's face in two different scene, first when Sibel cooked while Cahit was watching her; then when Sibel enters the bar right after Cahit killed one of her one night stands. I hope everyone manages to see the real story in the film. This film is not about a Turkish girl, who is trying to escape her conservative family. This is even not the sub-plot. This is a dark love story that invites us in a world with people who live on the edge. People, who find love but cannot, live it as they want it. Real people with real lives. Now it is confirmed Fatih Akin is one of the most talented guys in the film world. One of the best films that come to your theatre in years. Don't miss it and praise Fatih Akin, he definitely deserves it.",
            "review_date": "2004-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of a kind love story",
            "content": "Here is a rare story that explores the darker aspects of Love. It can save you from self destruction, it can redeem for certain misgivings, it can provide a sense of comfort and closure but it can also lead to a path of jealousy, anger and self destruction. We learn this through our protagonists who are disinterested, disillusioned, narcissistic and suicidal. In a way made for each other and we explore their journey.In St. Pauli, Hamburg, the alcoholic, drugged and hopeless German with Turkish roots Cahit Tomruk (Birol Ünen) lives like a pig in a small dirty apartment and survives collecting empty bottles in the night-club \"Der Fabrik\". One night, he gives up living, and hits his car against a wall. However, he survives the crash and is sent to a clinic, where he meets Sibel Güner (Sibel Kekilli), a younger German Turk, with suicidal tendencies. Sibel is the younger daughter of a conservative Turkish family, and proposes a fake marriage to Cahit, in order to permit her to leave her family; in return, she would share the rent of the flat, and she would cook and clean the place, and they could have independent lives. Cahit accepts, but while living with Sibel, he falls in love for her until something unforeseen happens.The movie is based on Turkish immigrants in Germany with their rather orthodox cultural background colliding with the liberal German society. However, this disconnect that Sibel feel is more peripheral to the main love story. There are some magnificently shot sequences. The car crash with \"I feel you\" by Depeche Mode playing in the background is one of the best I have seen. Never has the impact seem so real, never has the \"moment\" of madness so beautifully captured. Faith Akin has a lot to offer to this medium.A unique love story that is truthful and breaks every possible cliché.",
            "review_date": "2009-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Culture Crisis",
            "content": "I found this movie to be very interesting as I believe it could've happened anywhere, at any culture. You should notice that the main characters almost know nothing about their original Turkish cultures. They have the Turkish names without knowing the meaning (in most Asia and Africa, your name HAS a meaning, and it represents THE you), they know the their native language, but couldn't speak fluently. Even though they can, the dialect is different. Their religion (which is Islam in the movie) is only a name and they didn't do any rituals. They don't use ethnic clothes during their wedding ceremony. Oh, but they do eat Turkish foods and listen to Turkish music.In short, they're losing their origin identity.This could've happened anywhere, at any culture. Knowing our culture is very important, since it is who you are. If you lost your culture, then who are you?",
            "review_date": "2004-12-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Immigrant drama looks like Turkish remake of Sid and Nancy",
            "content": "This fierce drama about the doomed love of two Turkish immigrants in Germany looks like an Ottoman remake of Sid and Nancy. Punctuated by the songs of a female singer and her band in Istanbul, it tells the story of Cahit (Birol Unel) a middle aged drunk and widower who has just attempted suicide by crashing his car into a wall head on (hence the title). In a hospital ward in Hamburg he meets the twenty one years old Sibel (nicely performed by porn actress Sibel Kekilli), and they soon agree to a fake, sexless marriage in order that she can escape her conservative family. While they both initially agree that this will be a marriage of convenience, hot tempered Cahit will eventually be unable to stand the jealousy caused by Sibel's promiscuous life. A violent tragedy will soon ensue. Another great film about the difficulties and alienation faced by immigrants in Europe.",
            "review_date": "2008-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Avoid!",
            "content": "My class and I watched HEAD-ON, truly expecting some illumination of the Turkish subculture co-existence with the German community. Other than Germans mixing it up at clubs, little interaction remained. Indeed, after the promising opening, things started downhill at the hospital where the main characters met. This film was not upsetting in a heartfelt nor philosophical way, but was crude and tedious. Some students of many years left our cinema society never to return! I'm writing this because I felt absolutely duped by the positive reviews I encountered before putting this film on the semester syllabus. In terms of my teaching role, this was the most embarrassing selection I ever picked.",
            "review_date": "2012-06-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Interesting...",
            "content": "A good observation of cultural exchange, and people who struggle between. A story of building lives from the ashes, that is left from this cultural \"war\". The setting of this story is a city in Germany, where Turkish people make almost the half of the population.Gegen die Wand is not the best movie I've seen, but it's a definite must see, even though I would agree the picture and sound quality is not perfect. It depicts what we often refuse to see, \"the change\". Would you fit into the new world, or would you stay in the old one? Would you bring forth your desires, or rules of the old world? When you turn back and look to be happy or to be sad? The movie does not question good and bad, and it takes a complete objective view to the events.Warning: Do not be fooled by some ratings, IMO, this is a definite 18+, or R in MPAA terms. There are many \"love\" scenes, yet I believe, they are necessary to tell the story right.",
            "review_date": "2004-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "short opinion",
            "content": "When I saw \"Gegen die Wand\" I wonder if it looks like those films from a mixture of Wenders (german style) & Kusturica, single that much more crude. This enchants to me. The film is nearest to present life. This makes that it's seems a less idyllic world, the personages are already mixed in multiple personalities, looking for the own ones.From the Turkish director Faith Akin, I know \"Crossing the bridge The sounds of Istambul\". It's a great documentary for a great city. I'm discovering him. It's my first message in this great Web. Since I've discovered, it saves enough headaches to me.One sound of freedom and love.",
            "review_date": "2007-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nothing deep in this story",
            "content": "This was definitely a bad movie.I saw that rating and the plot seemed good, and I had some expectations.The beginning was just stupid and unrealistic...a girl asking to a stranger that never talked to to marry her. Is not such a bad thing for a not to be realistic,but this was supposed to reflect reality.Birol Ünel was just great,he played so good his role but Siebl...I was expecting her to be a nice girl that felt in love with the older man that faced so much problems and help him but she turned to be just a superficial little girl,a slut that become a junkie too. So what can I say. Wasn't even a good story,cause she did not love him,she just used him.The scriptwriter just made her look a little jealous in some scenes,but that was all. A good love story should be deep,but this movie really did not touched me.The end could have saved the movie a little,but it did not...was just dry.Not any movie that treats a problem like addiction and is spiced with a bit of love deserves such a good rating.I would only give a 10 to Birol Ünel but the movie definitely deserves no more than a 5.",
            "review_date": "2011-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cultures Collide in \"Head On\"",
            "content": "\"Head On,\" which won the Golden Bear at the Berlin Film Festival, is heady, provocative material.Cahit Tomruk (Birol Ünel) is a forty-something punk rocker who lives in a haze of alcohol and drugs. He earns his living picking up post-concert beer bottles in a Hamburg club.Sibel Güner (Sibel Kekilli) is a twenty-one year old high school dropout whose attitude toward life is best summed up by the Cyndi Lauper hit, \"Girls Just Want to Have Fun.\" Never mind that Sibel tries to kill herself; what she wants is \"to live.\" Both Cahit and Sibel are Germans of Turkish descent who meet in the psych ward after separate failed suicide attempts. Not necessarily the ingredients for your standard love story, but \"Head On,\" which takes its title in part from the way these two dive into their baser desires, is surprisingly romantic. The premise that drives the plot is the sham of a marriage that Sibel coaxes Cahit to agree to in order to garner her freedom from the oppressive restrictions of her traditional Muslim family. They will be \"like roommates,\" she promises Cahit. In return for his vows, she will stay out of his way and keep his apartment clean. Cahit consents. Introductions are made, Cahit is approved by Sibel's family, and the union, however questionable, is given their blessings. The wedding comes off well enough, with both Cahit and Sibel seeming to revel in the culture that fundamentally binds them. No matter that neither one of them wants to honor those roots. It's no surprise, but things immediately begin to disintegrate. Cahit continues to see Maren (Catrin Striebeck), the hairstylist he occasionally beds, as Sibel engages in casual sex with a series of men whose only value to her is the experience she can obtain from them. It's painfully obvious that these two deceivers cannot live up to the pretense, but they are woefully unaware that their actions have consequences. The stage is set for a collision of life-shattering proportions as their individual and bound lives careen further and more hopelessly out of control. The suspense is not in wondering if an accident is waiting to happen, but rather when, and how. In this regard, \"Head On,\" with its Greek-like chorus that periodically reminds us that a tragedy of epic proportions is unfolding, does not disappoint. Writer/director Faith Akin (\"Im Juli,\" \"Solino\") has crafted a film that is not unlike a freeway disaster: despite the wreckage, it's impossible to turn away. The compelling nature of the film is made more so by its two key performers. As Cahit, Ünel possesses a Mick Jagger-like presence, if a somewhat more dissipated version of that rock legend. He is an aging man who refuses to acknowledge his maturity, a child who does not recognize boundaries and who is given to violent public temper tantrums. Kekilli's Sibel is at once refreshing and repellent, a wild child of insatiable lusts in a sensuous woman's body. The actress's history as a porn star is not wasted here. This is a physical role, and Kekilli is clearly comfortable in her body, whether clothed or disrobed. Together, they create a tension that, given their characters' circumstances, hits all the beats. Despite the sense that these two troubled people are riding a runaway train to destruction, there are moments of tenderness between them, as when Sibel prepares a Turkish meal, or cuts Cahit's hair. Such moments hint at the possibility of domestication that leave us wanting more, even though they are woven into a tapestry of tangled events. \"Head On\" (more literally, \"Against the Wall\") presents these events against a background of complexities that include the difficulties immigrants face in retaining their culture in a foreign country. In this case, it's the Turkish people who have come to Germany for work who are at issue. Akin, who is a German of Turkish descent, fleshes out the story line with subtle references to these social problems. He lets you know they exist, but he doesn't push your face in them.Instead, he focuses on Cahit and Sibel, on whether or not they can change their world instead of changing the world, as a psychiatrist in an early scene suggests. As the final refrain of the chorus tells us, \"Over there on the mountain a beacon is burning.\" It is a beacon of love, even for misfits.",
            "review_date": "2006-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awful characters",
            "content": "The two main characters are detestable. The guy, Cahit, has absolutely no regard for other people or property, is constantly rude and self-destructive, and does nothing with his life, but wallow in self-pity for the loss of his first wife. The girl, Sibel, works hard to marry Cahit, then once she has, proceeds to go to bed with every guy who catches her eye. She too is self-destructive. Together they aren't even redeemed by the merest scrap of humor in response to their miserable lives. Some of the secondary characters are interesting, but they can't elevate this film from an indulgence of repulsive behavior. A waste of your time unless you enjoy watching awful people.",
            "review_date": "2006-06-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The ballad of Cahit and Sibel",
            "content": "\"Gegen die Wand\" is a German/Turkish 2-hour film from over 10 years ago. It was not the breakthrough movie for writer and director Faith Akin, but it is probably his most famous work so far, and his most successful. It won big at the German Film Awards, European Film Awards and several other awards bodies, even if it was not chosen to represent Germany in the Foreign Language Oscar race. That's not a problem though as I don't believe this is a movie the Academy would go for. It was a bit of a breakthrough film for lead actor Birol Ünel and a definite breakthrough for Sibel Kekilli, who you may have seen not too long ago in \"Game of Thrones\". Lets talk a bit about the characters they play. Ünel plays a Turkish man who has basically fully adapted to life in Germany, without culture or religion. Without his name, you could think he is actually German. He also does not look really Turkish. But he is. And that is crucial as Kekilli's character wants to marry him in order to find peace with his traditional family. However, in reality and spirit, she is very much alike to her fake husband. She wants to have fun, sleep around, party etc., just live the life.Both main characters have a talent for being self-destructive. The male has severe anger management issues that result in a moment which changes everything. The female has a drug problem, but is also too free-spirited for her own good, which may cost her everything on several occasions. Both lead actors play their parts very well and are the heart and soul of the film. The perception that Ünel is the only real lead becomes flawed when the actions starts focusing almost entirely on Kekilli's character two thirds into the movie. There are some very tense scenes in here and this may not be a good watch for younger audiences.I wrote earlier that this is probably Akin's most known film. He has worked on several films that combine German (locations) with foreign (for example Greek and Italian) culture. Here we get his take on his very own roots as you can easily see by his name. It is probably also his most serious film. Many of his works have a fair share of humour and comedy attached to them. \"Gegen die Wand\" does not and that is perfectly fine, even if it's not the best choice to represent Akin's generally lighter body of work. I think it would not have fit the tone at all. This is a really good dramatic character study and I also liked that he does not go for a forced happy ending by any means. It also fits the description of my review. The movie deals almost exclusively only with the time in the two protagonists' lives, during which they know each other and deal with one another. At the end, he is her way into her past, into a world, in which she may be free, but is it worth sacrificing her present for this new life? It's a question you will have to answer for yourself just like Sibel did. A pretty good film and I recommend the watch. Quite tense from start to finish.",
            "review_date": "2016-01-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Head-On",
            "content": "As with many foreign films I probably would never have heard of this German-Turkish film if it wasn't featured in the book 1001 Movies You Must See Before You Die, so that was for me the best reason to try it. Basically forty something Turkish German man Cahit Tomruk (Birol Ünel) has given up on life after his wife died and takes cocaine and drinks alcohol to get through everyday, and one night he attempts suicide driving his car head-on into a wall, but he barely survives the crash. He is taken to a psychiatric clinic where he meets another Turkish German, also suicidal Sibel Güner (Sibel Kekilli), and she asks him to carry out the most bizarre plan, she wants him to marry her, with no questions asked, so that she can break away from her strict conservative family, he is outraged by the idea. Eventually though Cahit agrees to the plan she explains she prefers a sex life independently, the have separate private lives but share a place as roommates, but as time goes by they do fall in love, but he kills a former lover of her's in anger and goes to prison. While he is locked away Sibel gets away from her family travelling to Istanbul to stay with Selma (Meltem Cumbul), her divorced hotel manager cousin, she accepts a job in the hotel, but finds her new life restrictive like prison, so she goes to live in the apartment of a bartender who gives her drugs and alcohol. The bartender rapes her and throws her out, and wandering the streets following this she antagonises three men to beat her up severely, continuing to urge them on to the point when one pulls a knife, and they run and leave her for dead. Several years pass, Cahit has been released and goes to Istanbul to find his wife, Selma initially refuses to tell him where she is, but she tells him she is in a long-term relationship and with a daughter, we do not see how she recovered from the rape and beating. Cahit waits for Sibel to call him, and they meet and make love, he wants her to run away with him to which she agrees, but packing she hears her husband and is delighted to see her daughter, so she never returns to Cahit, he travels on a bus somewhere, possibly to his birth city Mersin. Also starring Catrin Striebeck as Maren, Stefan Gebelhoff as Nico and Hermann Lause as Dr. Schiller. It is a recognisable story of a non romantic encounter with an odd circumstance, in this case a non- relationship based wedding, and slowly falling in love over time, but also there are distinctive moments that stand out, for me especially the very violent beating of the leading woman, and also drug taking and alcoholism, it is a most watchable romantic drama. Very good!",
            "review_date": "2013-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Raw Film of Emotions and Necessity",
            "content": "Cahit Tomruk (Birol Unel) and Sibel Guner (Sibel Kekilli) are immigrant Germans who live and work in the port town of Hamburg. In a bid to help Sibel break free of her family (which strictly adheres to Turkish customs, religious and otherwise), the couple decides to marry. But straitlaced families are just part of the problem; Cahit and Sibel must also counterbalance ancestral roots with their new life in a western democracy.The film starts with a very surreal opening with a band performing a song about unrequited love on the beach in a foreign land. This band returns a couple times throughout the movie. Why? Perhaps to remind us of the foreign nature of Turkey, or simply to maintain the surrealism.This is a Turkish-German hybrid, with a forced marriage to boot. We might be familiar with American stories of people marrying to become citizens. But here, for Americans, we have a double foreign atmosphere -- Germany, with Turkish immigrants. A foreign culture for most of us, with an even more foreign culture mixed in. The story is a universal, timeless one, but in a whole new setting.Some social topics such as sexual intimacy and fidelity are brought up, that I think bear discussion. The wife insists on sexual promiscuity, but refuses to sleep with her husband. The husband, on the other hand, sees the marriage as real and does not pursue other women, though he receives no affection at home. Ironically, the person from the more strict culture has a permissive moral code, and the liberal partner is strict.I enjoyed seeing the game of Rummikub show up, but have nothing further to say about it. (Rummikub was invented by Ephraim Hertzano, a Romanian-born Jew, who immigrated to Mandate Palestine in the early 1930s. Does this have anything to do with the story? Probably not.)Things get worse around the middle of the film, and this is where the original title (\"Into the Wall\") begins to make sense. I will not get into it for fear of ruining the plot, but this is when the film goes from good to great. I think the third act is somewhat weaker, but seeing the two adapt to married life (with their own unique versions) is a visual treat.",
            "review_date": "2011-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Now tell me, what's with the chanteuse?",
            "content": "I've learnt many things from this movie.(Spoilers ahead)One thing I've learnt from this movie; Men are greedy. They have this almost childish obsession for women whom they cannot/ have not slept with? The lucky scruffy dude had a hair-dresser \"MILF\" who's more womanly sultry than that silly junkie girl. And less PMS too. What's with that? Its hence excruciating watching a walking richard this irredeemably stupid. Another thing I've learnt from this movie; 3 Istanbul men are not enough to take out a waifish loud mouthed woman (yes, I can hardly tolerate that suicidal troublemaker). No number of harsh dropkicks and violent stabbings will do either. I can only think of two possible causal factors for the woman's miraculous survival - either the drugs she inhaled were elixir-like good or this movie's sense of reality is watery s***-like bad.One last thing I've learnt from this movie. Decent, kind hearted fat men have the short end of the stick. Their sole purpose of existence is to be supportive \"laugh\" interests, in a movie celebrating the vacuous meanderings of love. And caring, hardworking cousins live by an even shorter leash. They alone must bear the wilful ridicules for being mature and sensible (by senselessly immature losers no less). Though mere peripheral characters, the Istanbul cousin and the Fat balding \"Uncle\" lit up an otherwise dark and wrongfully sympathetic movie. They are the ones who truly deserve happiness in this movie. Hence, whatever inferred empathies and screen time lavished on the losers were in my opinion, offensively misplaced. I can't stand films showering love and understanding on people who don't love themselves. Self-destructive behaviour is only cute up to a certain point. After which, an apocalyptic rain of frogs should pelt on these sleepwalkers to friggin' wake them up!! Better still, the male lead should have been stabbed and raped in prison and suicide girl should have been raped and stabbed while in Istanbul (ok, 1 out of 2). And guess what? They die. End of story. That would have been my idea of a perfect ending.",
            "review_date": "2004-11-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "losing straightforwardness",
            "content": "(Watch the spoilers)This film is too long. I like suicide characters and I like them the most when they perform sad sex-scenes, but here it was really a bit too much. Although I enjoyed very much the subject and how it was developed throughout the movie, I felt it was losing fire minute after minute. Around the third attempt of suicide of Sibel I started feeling like an end there should be a most graceful closing, but apparently the director hadn't finished his speech because the film would go on and on just like to reach the standard lenght of a standard movie... It is important to recognize when something is good: beautifully explained, adequate use of music and very convincing characters are alright, but it is no less important to know where to end something good. Too many endings confuse the watcher and leave him unsatisfied. My advice: leave the theater right after the bath scene when she cuts her veins (like for the third or fourth time, by the way). Otherwise you'll have to watch some very humiliating rape shots that are really not worth it, (unless you are a freak of The Rules of Atraccion) and a very improbable self-killing murder (how can she survive? mysteries of life). Very good. Very long.",
            "review_date": "2004-12-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Unrealistic Story With A Racist Subtext",
            "content": "\"Gegen die Wand\" translated as \"Against The Wall\" is a movie made by one of the Turkish immigrants in Germany. First of all, these must be said: The first Turkish immigrants went to Germany in 1960s and they were just \"cheap workers\" wanted by European firms, just like today's Asian workers (especially Syrians and Afghans). According to native Germans, Turkish workers in Germany were \"poor\", \"below middle-class\". But they were \"rich\" according to the native Turks who earned less money in Turkey. Turkey's economy has never become powerful since 16th century which is the beginning of Ottoman Empire's fall. As a result, many Turkish people thought that \"going to Germany as a worker was a salvation\". They created \"mini-Istanbuls\" in the cities of Germany, they lived in their \"ghetto-like\" world. In other words, they lived in Germany as if they were living in Turkey. But when they went back to Turkey in holidays, they felt theirselves as \"strangers\". The native-Turkish society in Anatolia saw them as \"strangers\", too. When they returned to Germany to work again, they continued to be \"strangers\" in the eyes of native Germans. As another \"stranger\", Fatih Akin does not know the facts about German culture and Turkish culture. As a result, he just creates \"extreme\" characters with lots of cocain, drugs, sex, suicide, mental illness, etc... Here we see, sex & drugs-addicted, Sibel and Cahit are both on the edge of suicide. Cahit lost his wife, but how did he come to that suicide mood? There is no answer in the film. Because Fatih Akin does not deal with it, he just wants to get use of it with R-rated scenes. We don't know anything about his past, except \"he had a German wife\". There is no character development here. Let's add the point: Losing your partner does not so easily make you want to die as soon as possible. \"Being upset\" is different, \"willing to die a.s.a.p.\" is different. Sibel also wants to die, just because her family wants her to marry immediately, with a Turkish guy living in Germany. Sibel sees Cahit as the best candidate, Cahit refuses, Sibel starts to threaten him: If Cahit won't accept to marry her, she will cut her arms. Is Cahit the only Turkish guy living in Germany? Sibel and her family can easily find another Turkish guy, but Sibel immediately becomes obsessed with Cahit. That's really non-sense. Cahit cannot resist, he doesn't want to see Sibel dead, so they get married. It is a \"fake\" marriage, Sibel wants to live \"free\", instead of living \"as a slave\" with her parents at home. Fatih Akin tries to show us that Sibel is a victim of the Turkish \"conservative & primitive & patriarchal\" culture. But he fails. If Sibel was really under a heavy pressure, her family would not have let her marry her with a mysterious guy who she met only a short time ago. Also, a real patriarchal family does not allow their daughters with whom she wants. Father decides, daughter marries. That's all. Daughters do not even have a free-will as Sibel has in this movie. Fatih Akin fails to reflect the reality. Sibel's brother, played by Fatih Akin's real brother, is another character of \"unreality\". He thinks that Cahit is a factory manager. When he finds out that Cahit is a punk, all his reaction is to ask \"Do you love her?\". When Cahit says \"Yes\", that \"conservative & primitive & patriarchal\" big brother is like \"OK, no problem\". If something like that happens in a real Turkish patriarchal family, Cahit could get shot. That's the worst and the highest possibility, \"Hey man, if you love her, then no problem about your lies\" is the lowest possibility. You cannot understand how Cahit and Sibel fall in love. Under that \"fake\" marriage, Sibel sleeps with other men, with whom she wants. From the beginning Cahit knows that this will be a \"fake\" marriage and he does not love Sibel already. But all of a sudden, Cahit gets jealous, kills one of those men and goes to jail. Then, Fatih Akin focuses on Sibel character, who wants us to believe that she is a \"victim\" of a \"primitive culture\". Sibel goes to Istanbul, finds a job by the help of her cousin, earns money, stands up on her feet. Then what? Sibel, \"our victim\", declares war to her cousin who helped her. A woman's \"declaration of independence\" shouldn't be told like that. Sibel has the right to be free but \"being free\" doesn't mean \"I can attack everyone, even my lovely cousin who helped me\". Sibel quits job, enters Beyoglu nightlife which is \"the dark side of Istanbul\", to find \"freedom\". It is a pity that some \"visionary\" directors always tell us that \"Freedom is doing everything without any thinking, lots of drugs, alcohol and sex addiction, multi-partnership, etc\". In that part, Fatih Akin uses another \"opportunity\" to make us believe that \"Sibel is a victim of patriarchal culture\". She gets raped in a bar, she gets attacked on a desolate street. A taxi driver finds her heavily-wounded on the street and they get married. Here, Fatih Akin tells that marriage in \"primitive\" cultures is actually \"rescuing women\". Every Turkish people shown in the movie, get married without the sense of love, just \"to rescue some women\". Another non-sense point is that: We see that Sibel makes peace with her cousin after her second marriage in Istanbul. She becomes a \"house-wife\", she quits nightlife, she has a daughter beloved, etc. Why did Sibel need to marry that taxi driver? If that was just for money, we saw before that Sibel can earn money like everyone, she does not need a husband just for that. Why didn't her cousin help her again to find another job? No answers in the movie. After several years, Cahit is released from jail and he still loves Sibel. In prison, people can change, people can develop new ideas, can begin to love new things and new people, but now Cahit is obsessed with Sibel just as she was obsessed with him at the beginning. He comes to Istanbul, finds Sibel, they make sex again and they promise to go to Mersin together. Sibel cheats her husband here. But the same Sibel changes her mind rapidly, just because of her daughter. That was a salute to Atif Yilmaz's acclaimed movie \"The Girl with the Red Scarf\" (1977) in which the main woman character (Asya) is forced into making a choice, Asya chooses the man who takes care of her child, not the man who she loves. The message of that choice is \"Love is labor\". That was great in Atif Yilmaz's story-line, but here it looks like a meaningless cheap-copy. Characters are completely different. Sibel is a lost, anti-hero character, Asya is not. The definition of labor, love and freedom in these two movies are completely different too. In the end, Cahit returns to his homeland, Mersin, alone. Sibel stays in Istanbul with her family. So, what's the message as a whole? \"You Turks, you are all trouble. Return to your homeland, Germany could be great without you\". I believe that sub-message explains the awards Mr. Akin won. Fatih Akin always says that he admired Yilmaz Guney - one of the filmmakers who criticised Turkish patriarchal culture in his films. Please have a look at \"The Herd\"(1978, directed by Zeki Okten, written by Yilmaz Guney) if you want to see a real and great criticisation of Turkish-Kurdish patriarchal culture. The main difference between Akin and Guney is, Guney did not try to give that cliche message \"Europe-West is so great, Turkey-East is so bad\". That's a kind of racism Fatih Akin should give up. Usage of all-kind-music is great but the film has a weak, unrealistic story.",
            "review_date": "2022-05-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Yet another home run from Germany!",
            "content": "With this impressively acted drama German director Fatih Akin has definitely delivered his own personal masterpiece which follows in line with other recent international successes like `Good bye, Lenin', `Das Experiment' and `Nirgendwo in Afrika'. Especially the two magnificent leads, Birol Ünel and newcomer Sibel Kekilli, shine in the portrayal of a slowly developing romance between a fortysomething alcoholic and a free-spirited 20-year-old woman who engage in a fake marriage in order to help her escape from her Turkish family and live a `German' life (Meaning: Being able to go out whenever she wants, having sex with different men, doing drugs,.). Can't wait to see more of those three talents!A little note for the squeamish (minor spoiler): Despite its relatively low rating in Germany (`ab 12') this movie contains a fair amount of sexuality / nudity and violence. Especially the scene where Sibel gets beaten up by three guys may be hard to swallow for some. However, don't let this (or the disgusting newspaper articles after its victory at the Berlinale) prevent you from seeing `Gegen die Wand'.or do you actually want to miss what is without any doubt one of the very best movies of the year?!10/10",
            "review_date": "2004-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A very sincere and charming work that doesn't need any complex plot!",
            "content": "Sibel Guner really tries to be happy! Through her struggle we all see how near and far happiness is! Her sexual life that seems to be without sentimentalism is a key for us to receive the deep inside her heart. After her one night stand affair,she smiles walking down the street,she restarts life with her hopes in heart everyday again and again. We watch her walking in the slow motion,this is also a very useful technical detail to show what a beautiful smile she has that reflects her soul! And thank you Faith Akin,this is a very sincere and charming work that doesn't need any complex plot! It is hard to define something as perfect,but 'Gegen Die Wand' is a must see movie!Mukaddes Yasar/TURKEY",
            "review_date": "2006-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Moving and inspiring movie with a accurate view on modern multicultural society",
            "content": "You have those movies that immediately have all your attention from the start. This movie is one of them. A really great opening that set high expectation that gets delivered! It is a modern love story in a sad and difficult part of the European society. It's really special that it doesn't get sentimental during this (nicely) long story. Perfect performance by Birol Ünel and Sibel Kikulli who turn the good script into a moving movie. The music combines very well and underlines the right emotions. Very encouraging to see this quality from the German film industry, I am really looking forward to the next movie of Faith Akin.",
            "review_date": "2005-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sex and the City (Turkish-German Version)",
            "content": "Don't drink and drive. If you do the crime, you'll do the time. Resist picking a fight with hopped up young toughs on a deserted city street late at night. Marriage is serious business. Work hard. Stay in school. You can't always get what you want.These are some of the salutary, middle-class lessons about Turkish society, and Turks living in Hamburg, that I learned from Head-On, an independent film rich in local color, sex, and violence. Surprised? I guess that's the point: Don't let the minarets fool you; under the patina of different customs, music, and family traditions, secular Turks are no different from anyone else. Once you have found her, never let her go.The book and direction are by Fateh Akin, a talented young Hamburg film-maker of Turkish ethnicity. His pacing and cinematography are excellent. Birol Unel is appropriately dissolute and menacing as the reluctant husband. Sibel Kekilli is beautiful, damaged, and lost as the eager wife. The minor characters are well played by engaging actors, often of Turkish descent. There is enough conflict here for an action picture, enough twists and turns to elude every ultimate cliché of romance stories. We care about these characters, and that alone merits viewing and the awards this picture won.",
            "review_date": "2008-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "raw and pure",
            "content": "In 10 lines: Imagine getting on the Concorde entering a bizarre, mind-blowing situation without a parachute....there is no way back. Enjoy the ride! Imagine getting on the Concorde entering a bizarre, mind-blowing situation without a parachute....there is no way back. Enjoy the ride! Imagine getting on the Concorde entering a bizarre, mind-blowing situation without a parachute....there is no way back. Enjoy the ride! Imagine getting on the Concorde entering a bizarre, mind-blowing situation without a parachute....there is no way back. Enjoy the ride! Imagine getting on the Concorde entering a bizarre, mind-blowing situation without a parachute....there is no way back. Enjoy the ride!",
            "review_date": "2006-11-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I loved this movie................",
            "content": "and was pleasantly surprised with the soundtrack,I love Depeche Mode. This movie was a refreshing change for me,and gave me a real insight into the way Turkish people and their descendants live in Germany. One thing I would like to ask and I do not mean to be offensive,I was quite disturbed at the portrayal of Turkish men in particular,is their behavior typical of what is in this film? I don't know any Turkish people and was curious about this aspect in the film.The two leading actors were excellent and you could really sympathise with them at times.The rape scene was unexpected but tastefully shot and you really were quite horrified with Sibels treatment at the hands of these men.",
            "review_date": "2007-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "New page for the German movies",
            "content": "First of all I must confess ,I didn't want to watch this film. But my friend cheated me(I must thank him indeed).This movie is the best movie I've ever watched since \"Das Experiment\" ,in German movies. Cast is very good and suits the film perfectly. Birol Ünel (Cahit), and Sibel Kekilli(Sibel) shows a big perform also Güven Kirac acting naturally. Director shows perfectly the German-Turk un-cultured / mix cultured persons life style and what 3rd generation Turkish youth looks like in Germany. Why hate begins, and what lies under the \"roots\" imagination of the fake nationalism.And it's a love story. :)This movie shows \"very much\" of the \"less culture\". \"If someone looses his/her own roots , he can only dance with the death\" Marlo Morgan (I think word almost like that). One must watch.",
            "review_date": "2004-03-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This moves against all walls",
            "content": "I have seen the movie just recently, and it made me feel bad that I haven't seen it when it faced the cinema frame. The film moves against walls like our culture, their culture, the system of Selma (the power and money worshipper), the dogma of three guys stabbing Sibel (the undead patriarchy), the fumey life of Cahit, and many alike. Fatih Akýn's movie moves into the things \"Head-On\": No swerving, no change of directions to avoid a reality or another. If that is what it is in life well it is in this film, and it goes beyond the screen to drive into the audience. Going beyond a wall with whatever one has: Be it love, music, a life, a scar, a body or two, and the cultures they are loaded with. This a piece of cage, without bars or a piece of cake in it.",
            "review_date": "2004-06-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Misfit Melodrama",
            "content": "I believe that a romance film is as good as the couple and I surely remember this pair of outcasts. This kind of films, though, get seriously good when the subtle nuances of romance are told without saying, when the relationship can be further analyzed as to why it happened in the first place or what made it develop this or that particular way. I´m not gonna give any spoiler but this one can be discussed for a while. Then we get the awesome soundtrack to seal the deal.",
            "review_date": "2018-01-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Hamlet' s doubt of Sibel:bride or unmarried",
            "content": "Sibel is characterized by her Hamlet' s doubt: bride or unmarried?\nThis is the the veiled base of the powerful dramaturgical engine. She wants to get married right away with the first Turkish man that meets in the psychiatric hospital.Both have survived death and she wants to get married conventionaly to escape from the repression of her family.\nShe takes cure of Cahit, an addict of alcol and drug that likes punk.\n\"Punk is alive\" says Cahit as he is alive thanks Sibel' attentions that turn on the light in him.\nWhen this is becoming love, in a wonderful close- up,Cahit is happy and calm but Sibel is afraid and desperate. Sibel stop him and tell him: \" If we do it, I become your bride and you become my husband\".\nSo she doesn' t want a real marriage with love although she loves him. A song of the minstrels that play sometimes in the inserts says: \"To those love and have lost love, it happens to go out of your mind\".",
            "review_date": "2019-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "extremely good",
            "content": "this is the first faith akin movie i've ever seen but the force of the characters and the script make me believe that there's a lot we can expect from this director in the future. there is a little bit of Almodovar's eclectic style in the way the story oscillates from comedy to drama, all music genres in the score + very solid main characters. this film is a must-see, one of the few must-see this year( such a pity it took a whole year to get it to U.S.). There is so much passion in this movie, probably because the director, a German-Turkish himself, understands and loves his characters through the scripts's words and the multiple close-ups. Two thumbs up also for Birol Unel whose character is more forcefully played than Sibel's.",
            "review_date": "2005-01-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Head On is an undiscovered treasure.",
            "content": "Head On is a performance for Turks to be proud of as it has won 22 awards, including the Golden Berlin Bear Award. The main characters, Sibel and Cahit, remind me of characters in two other movies: Sibel reminds me of the movie Casino- the part Sharon Stone played. Cahit reminds me of Leaving Las Vegas- the character portrayed by Nicholas Cage. The story is depressing, especially in the first half, but it peaks in the morale department at the end, which is well worth the wait. Throughout the film, I was hoping that Sibel gets scared straight with some kind of huge misfortune, and she inevitably does, a few times actually. At times where she is being abused, it's hard to deny feeling as if she had it coming, that she asked for it and deserves it. Cahit on the other hand, is the character you wish would come out of his shell, shake off his misery and triumph once and for all, which he also inevitably does, sort of. What's the movie really about? I think that at the end of the film, Turks will feel a certain satisfaction, which will reveal what I'm thinking. It seems that some Turks become miserable G-d less heathens when they stray from their homeland, but they strengthen and overcome all odds if and when they return, because Turkey will nurse and heal all of the wounds of her lost children, that is, all of those who return to her bosom. This is what redeems the movie in the end and it's a sad but perfect ending.",
            "review_date": "2006-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Drama up our nose",
            "content": "As a Turk what I loved about the movie is its portrayal of the ever generic Turkish lover. It describes in amazing accuracy all the insane acts, the alcohol consumption to help the excessive pain, the quest for drama of Turkish lovers. This is a very accurate movie. The soundtrack ranging from rock to classic Turkish to the beautiful Fanfare Ciocarlia is worth buying.What I didn't like about the movie was the sound. I would love to see this movie with a fine dolby surround sound especially as he was dancing, or should I say \"hora\" ing, -covered in blood- to Fanfare Ciocarlia in the club. That is a scene I can relate myself to.",
            "review_date": "2005-04-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "First prison I've ever seen with wall-to-wall carpeting.\n\nHead-On is an example of a particularly well-trodden Hollywood premise (a mismatched couple in a marriage of convenience legitimately falling in love) and making it a legitimate drama - contemporary social conflicts, humor and barbs in equal measure, and protagonists with flaws that highlight a sense of realism without sacrificing their likability. What makes the film work most of all is the time dedicated to allowing the characters to grow as a direct result of their exposure to one another, transitioning from a slapdash engagement to a genuinely complementary dynamic that sees the two fluttering between longing, perplexity, affection, and melancholy. There's a degree of legitimate suffering in the film that makes the audience actually invested in the fate of the two characters without feeling exploitative; when the pair are left in a hotel room conversing in short, pained sentences, writer-director Fatih Akin earns that moment. Really solid performances from Birol Ünel as Cahit and Sibel Kekilli as Sibel. \n\nObligatory \"HEAD-ON: APPLY DIRECTLY TO THE FOREHEAD.\" (3.5/5)",
            "review_date": "2022-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, that was quite a movie. I'm not sure what to say so I'll give a quick rundown. The cinematography is awesome, so is the acting. The storytelling on the other hand, can be a little difficult to follow, though its not so bad as to ruin the movie, and in a way gels with the chaos of the characters lives. \n90/100",
            "review_date": "2021-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters are so self destructive that it's hard to watch at times, but it's rewarding. The kind of movie that sits with you a while.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two despicably selfish characters, yet it is their selfishness that reminds us so often of ourselves...",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely characters in despair, lives full of contrasts. Pace changing from frenetic to slow, just like the incredible music, in order to give you an even better idea of the clash between cultures.",
            "review_date": "2016-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest film of all time. Not for everyone.",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very raw and emotional love story.",
            "review_date": "2016-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "someones misery depicted at it's best form and one of the best non-English movies ever ?",
            "review_date": "2015-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Head-on\" (Gegen die Wand), is one of those films that you won't probably find in your local cinemas. This film made by Fatih Akin, German citizen from Turkish inheritance, made the perfect mix of tradition and culture in this story. Two self-destructive people, that made a convenience marriage by her requirement to escape from her parents' home breaking the tradition, to live a more occidental style of life. The story has an end that is far different from the typical Hollywood romantic drama. Is very original the music group that play during the film around every 15 minutes of footage, linking with the story.",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this film by mistake, as I messed up with the program of my favorite cine club. Never a mistake was so welcomed.",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a cinematic rush from the first frame to the last one... True film experience - see it! :-)",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaw dropping movie from a young German-Turk director!!!!!!!!!!!!",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and intense movie about two people who meet, love, and live on.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The power of Akin's film, which is considerably aided by the two lead performances ... comes from the spectacle of people developing feelings for each other even through numbing layers of mutual narcissism, self-loathing and raging terror of intimacy.\"",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe this film was too raw and edgy for me to truly like it but I will acknowledge that it is a very interesting film with some extraordinary commentary about immigrants and cultural identity. Here two misfits fall eventually fall in love through extenuating circumstances despite being stuck in the in between space between Turkish and German cultures. Certainly not for the faint of heart.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is overrated. First problem: the main character is ridiculously underdeveloped. Very few detail of his past is revealed to the audience. Second problem: the relationship between the two characters is underdeveloped also. Yes, every guy can understand jealousy when it comes to your partner's relationship/sex with others. But how did he fall madly in love with this woman? because she fixed up his apartment and made him a couple of nice meals!? And then, the lead woman character turns from a wild character to a normal woman. that transformation itself is believable given what happened to her, but, again, no detail is revealed to the audience as to the process of transformation. The movie certainly has very dramatic moments. But i got the feeling that they were there just for the sake of having dramatic moments. But they didn't tie together or to a larger story. But hey, maybe that's life. A lot of stuff happens without ever making a huge sense or impact on your life. The music is used effectively to double the drama of the moment. Camera work is awesome. But at the end of the day, I think this movie is overrated. and to be honest, I think a reason for that may be that it has lots of nudity/soft porn. It's worth a watch.",
            "review_date": "2013-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting with a fantastic script.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was a lil _ initially thinking it was \"just another love story\". but this german-turkish offering was more than that;  liked that it didn't attempt to tie everything up nice and pretty. \nthat sibel kekilli chick is ridiculously attractive , and why does she look so darn familiar too?",
            "review_date": "2013-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "we can say it's complicated.",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akin's stylish drama that fearlessly mixes sexuality and suicide is set in the Turk community of Germany and is about two young Turks getting married for convenience so he can get a young and cute housecleaner and she can move out of her oppressing traditionalist Muslim household. There are contrasting cultures and themes in this film which create drama but do not sacrifice a poingant dose of black humour, as well as compelling and crude visuals of violence and sex.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can I tear my eyes out now?",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head-On really isn't afraid to go to places most films about love wouldn't touch, thus making it fresh, and thought provoking",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ozil will cry while watching this ...",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I suppose I just don't get it. Suspension of disbelief is just impossible in this case. I dig the message this movie is trying to convey and all...",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "are you thirsty\nyes pal,\nthen y r u drinking beer,drink water\ni'm not an animal.....!",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Winner of the Golden Bear at the 2004 Berlin Film Festival, This is not just another typical immigrant drama, Impressive with good  perfs",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fictitious movie, about self destructive Turks in Germany, I did not get it, didn't believe plot, Turkish girls wants to have have sex with strangers, but family too conservative, so she gets married to a stranger with an agreement that she will just screw around? Hmmm, who would take a deal like that? They fall in love guy gets jealous and kills someone goes to jail....They lost my interest in the plot. Lotta nudity, sex, drunken, drugged out darkness, I swear I saw the ghost of Ayn Rand in it...her philosophies and influence all over this movie..",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those, How did this get in my Netflix queue movies.  It's a strange movie that often feels like two different movies. The first half feels like a black romantic comedy and then the second half goes totally dark.. I didn't love it, but especially the first half kept my attention.",
            "review_date": "2012-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "T.T when that \"'ll wait for you\" fails.",
            "review_date": "2012-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(*** 1/2): [img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]\r\n\r\nIntriguing and well-acted.",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This overrated and overestimated movie disappointed me a little: too many sex scenes, too little of turkish culture, but the annoying choir in the movie, flagging a change in time and space. I though Sibel was at first a sort of lunatic, but at the end she makes the right choices, and my sympathy went to her. I found Cahit a little too influenced by Mickey Rourke life, something the director maybe didnt even think about.",
            "review_date": "2012-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "have a sense of an ending. Sad",
            "review_date": "2012-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harsh yet soothing tale of two self-loathing narcissists who find a way to cope with themselves.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "PLEASE SEE THIS FILM! You have those movies that immediately have all your attention from the start. This movie is one of them. A really great opening that set high expectation that gets delivered! It is a modern love story in a sad and difficult part of the European society. It's really special that it doesn't get sentimental during this (nicely) long story. Perfect performance by Birol Ãnel and Sibel Kikulli who turn the good script into a moving movie. The music combines very well and underlines the right emotions.",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Germany and Turkey, two countries, one with no identity and the other one with a strong one. Two quiet different cultures with different traditions and rules. There's four million Turks living in Germany, and one of them is Fatih Akin who made this film called Head-On which is a film about the strong Turkish identity and how it's affecting them in a country that is far from their native mother land, and how it don't prevent them from following the religious dogmas and rules about family honor from their country.\n\nCahit Tomruk (Birol Ünel), an alcoholic homosexual Turkish immigrant has just ended up in a hospital after a failed suicide attempt where he drove a car right into a wall. On the hospital he meets a young Turkish girl in her early twenties, Sibel (Sibel Kekilli). She's also there because of a suicide attempt, in order to escape her extremely traditional parents. She then ask Cahit to marry her so that she can get her parents of her back. Cahit is against it at first, but agree's on the condition that they both can live their separate lives. But after all Cahit begins to develops real feelings for her, and she does the same, but one day Cahit hits Sibel's former lover with a bottle out of anger, and he ends up in jail, while Sibel who is now a dishonor to her family is in danger of being killed by her own brother. She then escape to Istanbul to live with her cousin Selma, but her longing for Cahit makes her want to ease the pain by using narcotics. How will it end? Is there any light in the end of the tunnel?\n\nHead-On is a heavy lightning down to earth dark film about individuals who have given up on life and have sunken as low as possible. It sort of reminds me of a Rainer Werner Fassbinder film in that way that we follow the lowest creature in the Hierarchy, pretty much like in Fox and His Friend where a young hustler who finds himself in company with a bigger elite, and is out of touch with this community and don't fit in. It's the same in Head-On, only this time it's all about Cahit's Turkish identity that is the question when he's involved with a family of Turks, while Cahit's Turkish is kind of rusty. He is out of touch with his own Turkish Identity, basically he doesn't belong anywhere.\n\nSibel is like Cahit, a rebel. But she doesn't have the same background, plus she's also more pubertal, because she's grown up in a more liberal society than her parent's. She wants to brake free from her family traditions, or as she herself put it \"I want to live, I want to dance, I want to fuck... and not only with one guy\". But she also get to see for herself what to much harm freedom can do to a person.\n\nWhat's so special about Turkish/German films is that their Motherland is always in their mind and is sort of like a place for escapism. Head-On is a strong film about this Turkish identity and how it effects people's lives. It show us how low a person can sink because they want to deny who they really are. Head-On clearly shows this in a brutal way by drug abuse and adultery. It's a strong film, well crafted by a great screenplay and some marvelous realistic acting, specially by the two leads Birol Ünel and Sibel Kekilli who have such a great chemistry that every actors should have. A big thumbs up from me.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love can redeem a wasted life, even if it doesn't last.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film in every means possible ... but left me with a negative impression ... not because of a certain thing that bothered me ... but simply I wasn't fascinated by the film",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film in every means possible ... but left me with a negative impression ... not because of a certain thing that bothered me ... but simply I wasn't fascinated by the film",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A convincing immigrant story that provides an elegantly portrayed reflection on the parent culture - Turkish - and how this is also reflected in Germany. Beautifully, sensitively made story that can only end unhappily.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film. The story revolving around the relationship between two marginal Turkish migrants in Germany is heartbreaking and uplifting at the same time. I found the characters' struggle with their own personal demons and the new challenges placed before them by their unfolding relationship very captivating. Should be required viewing.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Turkish-German cinema has reached a great turning-point. Gone are the days when the films produced by Gastarbeiter directors pointed a huge, dirty finger of blame at Germany for the troubles of the Turkish community. Gegen Die Wand takes the original approach of blaming the problems of the inability of Turkish people to come to terms with their own identities. Thus, despite being a German film, set in Germany, with much German being spoken, this film is essentially Turkish in spirit. It's about two Turkish Germans who live very different, but similarly restricted lives. Sibel is restricted by her ultra conservative and traditional family, whereas Cahit is restricted only by himself and his addiction to drugs and alcohol. Sibel, desperate to break away from her patriarchal family, begs Cahit to marry her. Eventually, he does and so begins a vicious tale of star-crossed lovers. I don't want to reveal too much about the film's plot, but it's excellent and engrossing.\n\nThe acting in Gegen Die Wand is exceptional. Birol Unel is tremendously effective as Cahit. He speaks German like a German would and speaks Turkish with a heavy accent, perfect for his role of a Turk who has lost all sense of Turkish identity. His is a tough, grotesque role, but he plays it really well and is definitely one of the memorable parts of the film. Sibel Kekilli also gives a stellar performance in the film. She plays a character who switches between her German and Turkish identities as it suits her and this ever-changing attitude is reflected well by Kekilli's acting. The supporting cast is less effective but that's only because their role in the film is quite a bit smaller than those of Cahit and Sibel.\n\nAkin, as a director, is undoubtedly excellent and his direction in this film is first rate. He delves right into this controversial subject matter and is not afraid to make deep, influential statements about anything he has an opinion on. In the \"Movie Info\", it states that Akin is a \"German-born Turkish filmmaker\". Well, no, he's actually a German filmmaker with Turkish roots. He said himself about this film that it is \"a German film with a Turkish soul\". These words describe it better than anybody else could do.",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "âHead-Onâ\u009d or âGegen die Wand,â\u009d the 2004 Turkish-German film, is a sad recounting of self-destructive behavior, deception, and gratuitous violence in a relationship among Turkish-Germans that ultimately leads nowhere.  Its receipt of European film awards merely tells how differently some of the folks over there must view the world.",
            "review_date": "2011-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most original and complex love stories put to film in the last ten years (alongside Eternal Sunshine of the Spotless Mind and Y Tu Mama Tambiem). Head-On is by turns brutal yet blackly humorous, blatant yet ambiguous, minamalist, yet epic, and tragic but ultimately life-affirming. Those that have a Netflix account are well advised to catch this while it's still streaming.",
            "review_date": "2011-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong, sad, funny. You got it all in this movie.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most realistic & powerful love story. A near perfect movie.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What happens  when two destructive personality joins together in a bizarre relationship ??! One day this simple yet powerful psycho analytically socio drama yet a powerful but simple one will be considered as a landmark of movies new arena, mark my words. In love with 'Fatih Akin', a wildly talented gift to us in this recent brainless time ! one of my top favrts..",
            "review_date": "2011-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad, I just didn't always sympathize, I guess.",
            "review_date": "2011-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"If you want to end your life, end it. You don't have to kill yourself to do that.\"\nI didn't expect it to be as intense as it was. This is easily Akin's most graphic film yet still one of his best.\nPlot: Cahit and Sibel are Turkish immigrants living in Hamburg. Cahit is an alcoholic drug addict and Sibel comes from a family that strictly follow Turkish customs and are extremely religious. Both have tried to commit suicide before. To break free of her family, Sibel and Cahit marry. At first they don't love each other but as time goes on their love for one another begins to grow, but so do their problems.\nDirected by Fatih Akin( The Edge of Heaven, In July, Soul Kitchen), Head-On is one of those intense dramas that sticks with you. With subject matter dealing with attempted suicide, sex, and jealousy, there are a few disturbing and very intense scenes. But despite it's graphic content, this is still a film that shouldn't be missed. The characters are solid and evolve greatly over the course of the story. The problem now a days is that by the end of the movie the character is the same person as he or she was at the beginning. This is not the case in this. This is just a very original film, have none of the Drama/Romance clichÃ (C)s. There is something about all of Akin's films that make them so interesting to watch. This is supposed to be Akin's best work, but I found In July to be better. Total score: 9.2/10",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic German drama about two troubled Turkish people who meet in psychiatric out-patients and get married mighty quick to escape their lives.  Both leads are magnificent, compelling despite their flaws, and the story packs a punch thats hard to forget.\r\n\r\nOne star deduction as I'm still hoping for a drama with a strong sexually-independant female lead who DOESN'T get raped somewhere along the line.",
            "review_date": "2011-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding love story!",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever watched. Who said foreign movies suck?",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first Fatih Akin film and I am already struck by the unique & powerful style.The chaotic cultural flavor dominates the movie and is aided by Akin's eclectic choice of background score and slapdash camera work and when two tempestuous characters doomed for destruction are thrown in the mix, you have in your hand a roller coaster ride of love and tragedy.",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow, amazing movie. all the praise for the director Fatih akin.",
            "review_date": "2011-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hats down to Fatih Akin!",
            "review_date": "2011-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sure thing about this movie is that it is really intense.Comments about the direction of Fatih Akin are needless and the way that he composed the movie was beautiful.You can see how many social stereotypes still exists and were the pressure from home can lead.Love in his roughest form prevailed.A simply wonderful movie.",
            "review_date": "2011-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully illustrates the principle 'Self-destruction might be the answer' from Fight Club. Great story and acting paired with an absolutely symbiotic soundtrack.",
            "review_date": "2011-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Part of me wishes to rate \"Gegen die Wand\" higher, because the first half is quite memorable and contains great character interactions, but the second half feels so disconnected from the first and takes so long to build up to events that we know will occur anyway that I can't.",
            "review_date": "2011-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't really take itself seriously enough.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fantastic film by Fatih Akin. Conflicts between cultures, languages and countries. Superb acting and intense emotions.",
            "review_date": "2011-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head On collision between raw emotions and harsh reality. Incredible!\n\n\"I feel you, your sun it shines,\nI feel you within my mind,\nYou take me there,\nYou take me where the kingdom comes,\nYou take me to and lead me through Babylon\"",
            "review_date": "2011-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have no recollection of how this wound up in my Netflix queue, but I'm happy it did",
            "review_date": "2011-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words. Watch it. -.-",
            "review_date": "2011-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie the most from Akin, no wonder about getting the golden bear. A nice love story built around imperfection, convenience and dead bodies in people,s hidden basement.",
            "review_date": "2011-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How two suicidal can make an awesome love story? Wanna know the answer.. WATCH THIS FILM! \nPersonally I am biased when it comes to love stories.. I say love stories cause, here you won't find romance, so nothing romantic about it. \nYou will be amazed as to how writer and director has covered multiple elements in this beautiful film. \nWhen one loses hope and is thrown to a corner by life, s/he can find someone as alienated as him/herself there.",
            "review_date": "2011-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "impressive modern-cinema movie, perfect casting, great acting",
            "review_date": "2011-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sprightly and stylish...superbly acted",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating story, masterfully told. I was totally blown away by this movie. Fatih Akin is now one of my favorite directors.",
            "review_date": "2010-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'd never heard of this until tonight when a customer recommended it. glad he did! pretty powerful stuff.",
            "review_date": "2010-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that didn't fall into the \"Genre\" trap. At parts comedy, at parts erotic, at parts violent, & at parts tragic. This \"Folk Song\" film is engaging and marvelously performed.",
            "review_date": "2010-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a pretty film, but rather a blatantly harsh portrait of two suicidal maniacs that cross paths with thundering consequences. Sibel and Birol are ferocious together.",
            "review_date": "2010-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dysfunctional romance with a number of unconventional twists and turns, and a surprising amount of violence (used to good effect). Well worth a look.",
            "review_date": "2010-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ã\u009cnel did an amazing job in this film, as did Kekilli, but the characters were so raw and messed up that, at times, it was hard to actually like this film.  An interesting take on the Turkish immigrant experience in Germany.",
            "review_date": "2010-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 3.6/5. Very good direction by Fatih Akin. Performances are good also by Birol Ã\u009cnel and Sibel Kekilli. It is very raw, straight to the point. I loved the Turkish music pieces in between certain scenes relating to the mood of the film. Watch it!",
            "review_date": "2010-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love changes everything.",
            "review_date": "2010-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has some very intense performances by Birol Ã\u009cnel and Sibel Kekilli whose characters are debauched, self-destructive Turkish-Germans who decide to marry out of convenience (so Kekilli can get away from her conservative parents) but end up falling in love. The film, I think, portrays German youth hedonism AND Turkish immigrant traditionalism as both fairly empty and stultifying, equally inimical to self-realization.  It is a very compelling film; two main performers make it work and make the  viewer invested in their plight.",
            "review_date": "2010-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jun 2010 - (with Hadi & Bahar) This is an excellent depiction of the turkish immigrants in Germany. Different possibilities for them and how they all get intertwined in a complicated and novel like drama. I loved the musical breaks in the middle of the movie. The reality is boldly presented and the acting is fantastic. The plot is a bit cheesy but if that's the price of showing so much, I have no problem with that.",
            "review_date": "2010-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a bunch of morbid jerks.  I liked the breaks for the traditional Turkish love songs more than the annoyingly gritty grittiness and juvenile bursts of violence.",
            "review_date": "2010-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such touching story of how life can be so unpredictable and precious.  A classic IMO!",
            "review_date": "2010-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just don't see the Golden Bear in it...\r\nMaybe it's my fault that I saw 'The Edge of Heaven' first, because the latter is a million times better.\r\n\r\nWhat makes this movie worthwhile is the mild originality at some parts, though it felt like the theme suddenly split into 2, and I couldn't reflect the songs played by the Turkish band onto the events, maybe I've missed something, but the movie left out too many things towards the end, he tried so hard to be politically correct and not judge the characters, which made me feel so indifferent towards them, especially the girl.\r\n\r\nThere's nothing noteworthy technical-wise, just one scene I really loved when Cahit goes to Selma and talks to her about how he was dead when he met Sibel, it was really beautiful and I wish it had lasted longer.",
            "review_date": "2010-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akın doesn't mince matters. Frightening film about the 2nd generation of turkish guest workers in Germany. About how they try to find their identity or struggle in doing so.",
            "review_date": "2010-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly a film that has no boundaries. Excellent direction, superb performances and haunting story. Grade: A",
            "review_date": "2010-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw and in-your-face movie on how two people from Turkish heritage are bound together in their destructive character. About the immense gap between east and west and the people whose lives are influenced by it. Love Fatih Akin.",
            "review_date": "2010-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very crazy drama.. stunning.. astonishing relationship between a girl wanting to escape her hell life with her conservative hipocratic family and a man who survived an suicide..\r\n\r\nso, finally what happens???\r\n\r\nVery moving",
            "review_date": "2010-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "essentially a film about an attention seeking depressive and her dopey victim. however it's well shot & has some random turkish music inserted every now & then in an effort to make it a bit different... so at least it's not totally boring!",
            "review_date": "2010-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is sad ,heavy but original!!!Perfect performance by Birol Ã\u009cnel and Sibel Kikulli who turn the good script into a  moving movie...",
            "review_date": "2010-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i watched this movie a week ago & i can`t get it out of my head! very good!  i really liked it!",
            "review_date": "2010-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edgy, gritty, real. A very, very good film and a nice change from all the trite, plastic Hollywood trash that is about.",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous. As strange a love story as they get.\nAkinÂ´s Germany is the most interesting slice of Turkey (no pun intended; really).\nWith Akin, you can never go wrong. Hard to pick a favorite, but this one is right up there.\nImpresionante. En Uruguay, videolandia.net y te la llevan a tu casa...",
            "review_date": "2010-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fatih Akin and another great movie",
            "review_date": "2010-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a small gem that really is thought provoking and touches the watcher's feelings.",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A shocking and touching story about desperation, self-destruction, friendship, hope, love, cultural pressure & family traditions.",
            "review_date": "2010-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only criticism I have about this is some of the dodgy editing. One of the best films I've seen in a long time.",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's \"one of those\" films.",
            "review_date": "2010-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just don't see the Golden Bear in it...\nMaybe it's my fault that I saw 'The Edge of Heaven' first, because the latter is a million times better.\n\nWhat makes this movie worthwhile is the mild originality at some parts, though it felt like the theme suddenly split into 2, and I couldn't reflect the songs played by the Turkish band onto the events, maybe I've missed something, but the movie left out too many things towards the end, he tried so hard to be politically correct and not judge the characters, which made me feel so indifferent towards them, especially the girl.\n\nThere's nothing noteworthy technical-wise, just one scene I really loved when Cahit goes to Selma and talks to her about how he was dead when he met Sibel, it was really beautiful and I wish it had lasted longer.",
            "review_date": "2010-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my most favourite films of all time..Fatih Akin is a master director. \nMy review is short and simple - Go watch the film..",
            "review_date": "2010-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking, yes.  Fatih Akin's \"Head-On\" blew me away.\r\n\r\nHead-On (2005) - 9.0/10\r\nDirector - Fatih Akin\r\nCast - Birol Unel, Sibel Kekilli, Catrin Striebeck, Given Kirac, Meltem Cumbul, Cem Akin, Aysel Iscan, Demir Gokgol\r\n\r\nI've watched some excellent films the past month but one film gets the \"wow treatment\", and that's Fatih Akin's \"Head-On\".  Wow, just wow!  I was just completely blown away by this shocking but truly absorbing film.\r\n\r\nSet in Hamburg, Germany \"Head-On\" the story follows two Turkish immigrants.  Cahit (Birol Unel) is a 40 year old boozer and loser who loves punk rock music.  After a drunken binge he crashes his car \"head-on\" into a wall.  At the psychiatric hospital he meets 20 year old Sibel (Sibel Kekilli).  Sibel had just slashed her wrist in a botched suicide attempt.  She just wants to get away from her very traditional, restrictive and conservative Turkish family.  She isn't really interested in Cahit as a husband in the truest sense but needs a Turkish man to marry so she can escape and lead a much more adventurous life.  Cahit, in need of change himself, eventually agrees.  What follows is anything but a traditional love story.  Sibel spends her evenings clubbing, sleeping with other men.  Cahit, when not in a drunken stupor, spends his time with a hairdresser.  Husband and wife don't sleep with each other.  But over the course of the film Sibel and Cahit begin to have genuine feelings for one another.  However the self-destructive nature of each threatens to destroy the one meaningful thing they have.\r\n\r\nWow,  Okay I said that already.  I just think this film is freaking amazing!  Ironic considering neither Cahit or Sibel appear to be likable characters.  And on the surface they are anything but likable.  Cahit is a boozing, grumpy loser.  Sibel is carefree and selfish.  They appear to mix like oil and water.  But beneath the rough exteriors lie two complex and very human characters.  You learn to like them despite all their warts.  And over the course of the film you understand why they need each other.  No this isn't your typical fluffy Hollywood romance.  It's deep, dirty and often downright disturbing.  It's also brilliant and daring filmmaking!  \r\n\r\nThis is my first experience with Turkish/German director Fatih Akin and there will be more soon.  It's as relentlessly honest as it is enertaining.  The film can be brutal and bloody at times, but just when Akin exhausts you emotionally he cuts to an orchestra playing traditional Turkish music by a river.  The music is cheery and hopeful and a welcomed contrast to much of the film.  Late eighties/early 90's music plays a key as well, with songs by Depeche Mode and the Sisters of Mercy used brilliantly.  The acting by the two leads is absolutely stellar.  Birol Unel and Sibel Kekilli are riveting and play off one another extremely well.  It's rare to get two performances this good in one film. \r\n\r\nAkin also does an excellent job of showing how Western culture impacts cultural mores by blending both attitudes and music with traditional Turkish music and morals.  Sibel feels suffocated by her tradition while Cahit has, over time, become so westernized that he struggles to speak his native language.  But over the course of the film Akin shows how important these Turkish roots really are.\r\n\r\nOverall I can't recommend this one enough.  It may be too brutal (and honest) for passive viewers but for those looking for a challenging relationship film \"Head-On\" is well worth a watch.",
            "review_date": "2010-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched 'The Edge Of Heaven' some time ago and could not wait to see another Fatih Akin film. Took me a long while to get there. Head On/Gegen Die Wand is so compelling I clapped spontaneously after it finished. Imagine doing that by yourself in your own living room. This is more than just a drama with sexually explicit scenes. It is a story about love and how it can also destroy you, change your life and take you on a journey where you have no idea what is coming around the corner. It is also a story about migration, cultural compulsions and behaviours and how displaced communities behave, how they connect back to their land of origin and what part that plays in your life. When I think of why Sibel behaves the way she does after Cahit goes to jail is because she is dead for her parents. No love, no support, no empathy-all to maintain family honour. This film took me through all kinds of emotions. From anger to sadness, laughter at the funny moments, exasperation and ultimately reflection.",
            "review_date": "2010-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too much violence and blood for my taste, but I guess this movie is actually all about passion, and so it all fits in it.",
            "review_date": "2010-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film whose queasy, kinetic euphoria gradually gives way to a different register that's harder to pin down. It's constantly surprising, and romantic in the purest sense of the wordâ\u0080¦ an accidentally perfect Valentine's Day watch.",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i stumbled upon this movie on tv, and just couldn't take my eyes off of it. beautifully done.",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Head-On is a moving drama about sex, class, culture, desperation, drugs, and many other things. Like most good films, you could probably make a list of over twenty items that could be argued as themes of the film. \r\nThe film is highly stylized, and each scene is very meticulously designed, propped, and colored to render the atmospheric underground world the characters inhabit. The camera work is very well done, focusing the viewer's attention to the realistic aspects of the story. I personally found the interludes of the Turkish music to be a nice touch, probably because I really enjoyed the music of the film. \r\nThe story is well-paced, rife with conflict, and undpredictable yet engaging enough to maintian the viewer's undivided attention throughout. The casting of Head-On is almost perfect. Each character looks, feels, and acts very naturally in their specific role. \r\nThe presence of Western lifestyle and Turkish culture almost become their own characters in the film. These two entities are at conflict with each other, and this clash serves to add depth and specificity to the context of the story.  \r\nHead-On is a fiercely involving drama that will no doubt leave a biting resonance in the viewer, even if they don't \"like\" the film. The level of graphic violence may be distasteful to some viewers, but I thought the violence was artistically rendered and relevant to the story. There were no wasted scenes in this film, unless you consider the Turkish musical interludes to be superflous. But like I said before, I thought the musical interludes made contributions to the film.",
            "review_date": "2010-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful film. I enjoyed this tremendously.",
            "review_date": "2010-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see a movie by Turkish director ( Fatih Akin) to show so frankly dark sides of traditional Muslim mentality, to reveal how young Turkish men in Germany manage to combine their traditional believes with dirt speeches about prostitutes. Remember Cahit's question, \"Why don't you guys f-ck your own wifes\" and their reaction? Next to Cahit I wonder how this false and dishonest survives together with tradition and believe. As almost any Russian-speaking man who encounter Chechen guys, I saw similar behavior there.\r\nBirol Unel (who plays Cahit Tomruk) is wonderful actor, Sibel Kekilli (plays Sibel Guner) is beautiful and talented too. They both strike by their frantic characters and their unstoppable will to freedom (Sibel!).\r\nAt the same time, Fatih Akin managed to keep this story very realistic and moral too. I really like this movie.",
            "review_date": "2010-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised to see a movie by Turkish director ( Fatih Akin) to show so frankly dark sides of traditional Muslim mentality, to reveal how young Turkish men in Germany manage to combine their traditional believes with dirt speeches about prostitutes. Remember Cahit's question, \"Why don't you guys f-ck your own wifes\" and their reaction? Next to Cahit I wonder how this false and dishonest survives together with tradition and believe. As almost any Russian-speaking man who encounter Chechen guys, I saw similar behavior there.\nBirol Unel (who plays Cahit Tomruk) is wonderful actor, Sibel Kekilli (plays Sibel Guner) is beautiful and talented too. They both strike by their frantic characters and their unstoppable will to freedom (Sibel!).\nAt the same time, Fatih Akin managed to keep this story very realistic and moral too. I really like this movie.",
            "review_date": "2010-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking here and there, but amazing acting, impressive movie!",
            "review_date": "2010-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another good movie by Fatih Akin.",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a complicated story about love btw 2 unlikely characters, jealousy, growing-up, self-discovery but worth hanging on til the end.",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh this movie blew me away...",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as good & emotional as akin's more well-known movie edge of heaven... probably more \"explosive\"... more rowdy... also more blood & violence... many recognizable features of akin's style",
            "review_date": "2010-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone interested in German cinema will not get past this work of genius. Absolutely essential.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every scene of Fatih Akin's Head-On contains something shocking, something funny, and/or something heartbreaking.  \r\n\r\nAt the risk of divulging too much of the brilliantly simple story and deceptively complex characters, the critic will note that Head-On is a well executed, serious tale of the appeal of self-destruction, the unfortunate gravitational pull of family and cultural mores, the hazards of emotional decision-making, the hazards of emotionless choices, the joy of hedonism, and the perils of hedonism.  \r\n\r\nCahit and Sibel simultaneously rise from the deepest emotional bottoms and proclaim, \"Punk rock is not dead!\"  Head-On is their punk rock love story, as evidenced by the image of the tuxedo-clad groom downing a tall boy before he saunters to his wedding.  He is a uniquely hesitant husband-to-be; neither he nor the open-minded viewer is prepared for the agonizing voyage to catharsis the marriage will facilitate.",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors in this movie is what makes this movie. I don't think it would be half as good if these roles were played by anyone else. Absolutely loved this film. Beautiful and romantic in such a dark way. I totally recommend this movie to everyone.",
            "review_date": "2009-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont like love stories, this was an exception a really good one infact, quite different and much better from what i had expected, the german pop culture to turk culture, excellent performances and direction",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow-paced but a well developed drama.  Great cast.  Aside from the musical interludes that annoyed me, there's really nothing to complain about this film.",
            "review_date": "2009-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most realistic picture of Turks in Germany. A generation belongs nowhere. They are neither a Turk in Turkey nor a German in Germany. And that causes a self-destructive personality. And with the characters of the movie, audience heads on to the wall of cultures conflict. Performances are awesome. Especially Birol Unel is spectacular. And Fatih Ak?n, a brave director really.",
            "review_date": "2009-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonder why people are sometimes so crazy.... But if it exits, it is reasonable. You should accept that. But I still feel that it is a drama..... cannot imagine that would happen in the real life.....",
            "review_date": "2009-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally well-made film! Fatih Akin brings to cinema his quirky, wild, rebellious side and gives us Head-On. \r\n\r\nAbsolutely stunning camerawork (esp coz most of the scenes were shot with available light), honest performances, interesting premise and brilliant score.\r\n\r\nThis movie defines \"cinematic masturbation\"",
            "review_date": "2009-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kind of love story two suicidals meet in a hospitol and they marry within days but this is no regular marriage Enjoy!",
            "review_date": "2009-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crazy, weird relationships. I love it.",
            "review_date": "2009-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that hits you in the face, just like the name. I intend to watch it on and off while doing something else, but I end up sitting down and watch the whole film. The ending does make you feel empty.",
            "review_date": "2009-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic performances; intense and definitely not for the mainstream-type audience.",
            "review_date": "2009-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Punk meets Turkish culture. a violent, sexy, and mature movie that shocks the viewer, but overall one of the most original romantic movies in the past years. Provocative and visually fantastic, this is a movie not to be missed.",
            "review_date": "2009-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching and vibrating!",
            "review_date": "2009-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This being the third of German/Turkish auteur Fatih Akin's films i've had the pleasure of watching, i must say, he has cemented himself in my mind as an exceptionally gifted story-teller. Head-On explores grief, anguish and recovery by exposing us to the sordid life of Cahit who spends his days soaking in alcohol and illicit drugs, only to be met (and suddenly betrothed) by Sibel, a young German/Turk woman who is eager to truly live her life, free of the persecution of her culture. \n\nAkin directs this couple beautifully throughout the film, with no emotion or nuance lost on the audience, leading us down a path of ever growing affection, tainted with jealousy, but grounded in the genuine surprise of new beginnings. The turn of events was saddening, but if there's one thing i can depend on Akin for, it's the realism that Hollywood lacks!",
            "review_date": "2009-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Turkish German director Fatih Akin's fourth feature. Someone recommended his films to me. This one is very \"contemporary\" and very \"European\" film. It's contemporary not only in terms of something visible like the style of cinematography, editing, and the way of portrait of drug and sex, but also in terms of its theme and the director's viewpoint on things like love and culture. The period in which country meant identity of film (\"French\"/\"German\"/\"Italian\"/etc.) in Europe ends, and European Films are getting more and more diverse, and Akin, considering his identity, is probably one of the symbolic figures of it. I feel very good about his stance of telling a story, because he rather makes characters first and lets them move and make a story than makes a story first and puts characters into it as if they are men of chess. I, however, couldn't assimilate myself with characters well, probably because they are people in the world I am not too familiar with... What the film deals with, something universal, does move me, but I could not get into the world of the film much at this first time of watching it. Also, I felt when it gets closer to ending, it seems to be in hurry developing the story, especially episodes of the heroin after she gets to Istanbul are little bit too jumpy. Someday, after I will have visited Turky and Germany, I'd like to watch this again.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you say boring in Turkish? Dull and pointless in German? Seems to me the first job of any movie, or any other story, is to make you care about the main character. But who can stand this obnoxious alcoholic? I\u0092ve seen enough self-centered, self-serving, self-dramatizing drunks in real life. I don\u0092t want to see one on the screen, unless the story is amazing. This one is not. What is the idea behind this movie? We\u0092ll show an obnoxious loser who feels sorry for himself and that\u0092ll grab the audience?",
            "review_date": "2009-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beauty of being on the edge",
            "review_date": "2009-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for me one of the best german movies ever",
            "review_date": "2009-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best film i've ever seen",
            "review_date": "2009-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Misleadingly promoted (at least on the UK DVD) as arthouse sexploitation, this is actually a sweet, elliptical, love story set within Germany's 2nd generation Turkish community.  Performances are excellent all round (not just the leads,  the supporting cast too) and the direction is stylish without being obtrusive.  If you like European cinema with a thoughtful bent, this is well worth a look.",
            "review_date": "2009-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i saw Edge of heaven like few weeks ago N this movie was in my mind...i got chance to watch it last week N i shud tell u this dat its an amazing movie....Faith Atkin is definitely one of the best in the world....now I'm waiting eagerly for his new movie(New i love you)...well M nt sure if M gonn like it after watching the original french version( paris i love).....",
            "review_date": "2009-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great soundtrack. Everything about this film and it's characters was rebellious (even the tradition vs contemporary attitudes, music, life), yet not over done. The compassion I felt toward the characters grew, as did my respect for them. It was a very moving and sad love story - I liked that it didn't give me what I expected. I'm not sure if \"Two Lovers\" was trying to tell a similar story, but they ended in a similar way.",
            "review_date": "2009-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad effort by Fatih Akin, considering the low-budget video production available. However, this film pales in comparison to Akin's masterpiece \"The Edge of Heaven\", one of the best films ever made. \"Head On\" gains an extra half star for it's sobering ending and a cast of characters that are masters of their game.",
            "review_date": "2009-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intensity. That's the word to describe Gegen die wand. A story about self-destruction, a weird tale about discovering your soul mate, the importance of the \"moment in which someone is and the paths we follow to discover who we are. Passion, violence, the weight of tradition, the yearning for a freedom that is impossible to define but it is far from when you supposedly came from, redemption and love. Rough, edgy, powerful to the extreme and provocative. Astonishing acting and filmaking. Really recommendable.",
            "review_date": "2009-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting plot with great characters. It's about love, hope and changes. The story is touching and pretty brutal and the same adjectives can be used to describe the main characters. The drift of it is great and it gets better and better until the very good ending.",
            "review_date": "2009-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great Fatih Akin movie. Quite brutal though.",
            "review_date": "2009-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Graphic, Graphic movie",
            "review_date": "2009-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense love story which starts off wrongly and goes downhill from there. Sible Kekilli somehow overshadows the strong performance of Birol Ã\u009cnel, both purposelessly searching for aimless love. Someone please give Fatih Akin an Oscar!",
            "review_date": "2009-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full-on! A culture clashing violent mix of sex, drugs and rock 'n' roll with love desperately attempting to put an end to the self-destruction.",
            "review_date": "2009-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautifully thought and played",
            "review_date": "2009-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RAW - done well. Hence the five stars. It kept my attention throughout - RARE. There were some parts I felt unneccessary, slightly pointless - but most scenes, poignant.",
            "review_date": "2009-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a hard film to watch - it's way too melodramatic for my taste.  But there are some interesting ideas here, however, the story tries to do way too much and loses its potency.  My favorite thing about the movie was the musical interludes.  The cinematography was also fantastic.  All in all though I was very disappointed because \"The Edge of Heaven\" by Akin was an absolutely brilliant film and I expected more from this film.",
            "review_date": "2009-06-09",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 9.3,
    "rt_summary": "Cahit (Birol Ünel) stumbles from bar to bar in Hamburg, Germany, lost in an alcoholic haze. The boozy Turkish immigrant crashes his car into a wall, which lands him in a mental institution. There he meets the suicidal Sibel (Sibel Kekilli). She convinces him to marry her, because otherwise her family will arrange her marriage to a Turkish man of their choosing. She proposes a deal to Cahit: She will cook and clean for him and they can see other people. Thus begins their strange romance."
}