{
    "rating": 9.2,
    "release_date": "2000-09-15",
    "num_reviews": 390,
    "genres": [
        "Comedy",
        "Drama",
        "Music"
    ],
    "summary": "Set in 1973, it chronicles the funny and often poignant coming of age of 15-year-old William, an unabashed music fan who is inspired by the seminal bands of the time. When his love of music lands him an assignment from Rolling Stone magazine to interview the up-and-coming band Stillwater -- fronted by lead guitar Russell Hammond and lead singer Jeff Bebe William embarks on an eye-opening journey with the band's tour, despite the objections of his protective mother.",
    "reviews": [
        {
            "content": "A glimpse of what it is like working in the rock n roll music scene that makes you crave to be part of the experience, even if it is a turbulent bumpy ride. Rock on!",
            "review_date": "2023-03-07",
            "source": "rt"
        },
        {
            "content": "This film is pretty good, it feels light-hearted and fun to watch. There is some funny moments and the music is good. Patrick Fugit is decent for the most part but he doesn't pull off the emotional moments well enough, the rest of the cast is excellent. If you're a fan of rock music from the 70's or just like a good comedy-drama movie then you'll enjoy this.",
            "review_date": "2023-03-05",
            "source": "rt"
        },
        {
            "content": "The movie implements the innocent perspective of a young teen to show the wild rock and roll world. However, the movie is not so much about the music as it is about adolescence and the pursuit of an adventure. The intention seems to be to demonstrate the importance of a push and pull between mentorship, orderly rules, and chaos in character development thereby providing a familiar but nonetheless interesting interpretation of what it means to grow up and become an \"interesting\" person. Very similar feeling to The Girls Next Door and Risky Business.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "This, based on the true life of Cameron Crowe, who is also the writer and Director, is a very good look at the emergence of Rock n Rolla and Rolling Stone Magazine.  The movie takes a look at a brighter than average American boy who comes of age in the era of the 60's and 70's.  Patrick Fugit is great as Crowe.   The cast, including Philip Seymour Hoffman, Billy Crudup, Kate Hudson, Frances McDormand and so many more is really good.  It is a great look at the coming of age of America at this time as well as Rock N Roll.  The script, Direction, and cinematography is well done.  of course, the music is a terrific accompaniment for this one.   Very funny footnote- the opening segment of Marc Maron's WTF Podcast comes from his role in this movie.",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "I think I fell in love with this movie because of the time it captured in history. I had a much older sister who loved music and she instilled that love of music in me. It was a time in my life that I think was truly the best of times--that sweet spot between the hippies of the 60's and before disco reared it's ugly head. So many great bands and artists from that time in my life that made it both the best of times and the worst of times. While I hadn't wanted to be a \"Band-Aid\" I listened to music studiously and my friends and I would sit in the family room of some kid's house, listening to Zepplin or The Doobie Brothers, debated about the lyrics-what inspired them or what they were really trying to say between the lines. We would wax poetic about who was the best guitarist or drummer while sneaking beer, smoking Marlboros (or other things). Almost Famous captures that time perfectly. Whenever I find myself needing to walk down memory lane, that's the movie I want to watch because it takes me there. I'm back sitting in a dingy room in a bean bag chair on some really ugly orange shag carpet-and I'm a teenager again.",
            "review_date": "2023-01-17",
            "source": "rt"
        },
        {
            "content": "Amazing Characters, Amazing Story and great soundtrack.",
            "review_date": "2023-01-06",
            "source": "rt"
        },
        {
            "content": "This movie was absolutley beautifully shot. I loved the costumes and the music. The storyline was okay, a bit confusing at times. I just felt like it was missing something.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "Really great movie. Fun and worth the watch",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "This is in my top 5 movies of all time. If you love music you are gonna love this. I had seen this movie 100 times before i ever knew this movie losely based on the Allman Brothers. The acting is great. So many great actors in this. Please take the time to watch this!!!",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "The best movie screenplay ever written! With the best movie song ever adapted: Tiny Dancer! And the best movie title sequence ever made!",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "My all time favourite movie. The music, acting, nostalgia. All so amazing. Kate Hudson & Patrick Fugit are great, my ultimate feel good movie!",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "It's not high art, but it is good.  A story about a family with a protective mother, a daughter and a son.  The kids each have ways of dealing with their mother's controlling nature.  The son is the center of the story.  He comes under the tutelage of a local rock music critic in San Diego and writes pieces of his own that catch the attention of Rolling Stone.  Sight unseen, Rolling Stone commissions him to follow a band on the road and write a 3,000 word story on them.  That tour is the centerpiece of the movie.  Relationships, honesty, dishonesty, illusions, and once in a while reality set the markers for the story.  Emotions are the backbone of this film, and with any luck, you'll feel them.",
            "review_date": "2022-11-20",
            "source": "rt"
        },
        {
            "content": " Great music, performances and the movie is just charming and heart warming.",
            "review_date": "2022-11-07",
            "source": "rt"
        },
        {
            "content": "Can't remember why but I liked it.",
            "review_date": "2022-10-28",
            "source": "rt"
        },
        {
            "content": "This movie came out when I was a junior in high school. I was 16 years old and had no idea what to expect going in. After my first viewing, I loved two things. The first, Kate Hudson. I had/still have a huge crush on her. The second, my love of rock n' roll. After this movie came out I started collecting vinyl records, wearing only Led Zeppelin, Black Sabbath, Pink Floyd, Lynyrd Skynyrd t-shirts along with my jean jacket and Chuck Taylors. I ended up seeing this movie 3 times at the movie theater. I own the DVD, the soundtrack, and the poster. One of my favorite scenes ever is when they sing Elton John - \"Tiny Dancer\" in the bus. This is my favorite movie.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a 2000 American comedy-drama film written and directed by Cameron Crowe 🎤 \n\nMeh, it passed the time. \nJust. 😐\n👍🏼👎🏼\n\nEXPERIENCE IT. \nENJOY IT. \nJUST DON'T FALL FOR IT.\nIn 1973, 15-year-old William Miller's unabashed love of music and aspiration to become a rock journalist lands him an assignment from Rolling Stone magazine to interview and tour with the up-and-coming band, Stillwater.",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "Stupid, boring, and promotes loose morals. A complete waste of two hours of my life do yourself a favor and do something, anything else! Even if it's staring at paint dry on the wall.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "i wish being a penny lane on real life was as magical as they portraid it. \n goddamn.",
            "review_date": "2022-08-28",
            "source": "rt"
        },
        {
            "content": "9 years ago-The main thing going for this movie is the pure amount of passion behind it. The love for the period is obvious from writer/director Cameron Crowe. The acting is all top notch and the airplane scene is extremely memorable.",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Worst thing about this movie is Kate Hudson - though she somehow managed to get entitlement down to a tee. But the rest is fabulous.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "Very well shot, good story line. I certainly understand the appeal and it was a enjoyable watch, just wasn't my favorite movie. I would certainly watch it again.",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "Must watch movie, entertaining from beginning to end",
            "review_date": "2022-08-01",
            "source": "rt"
        },
        {
            "content": "As a fan of rock music in general, I can feel the emotions passed in the movie of being a fan and ride with the band you love. The soundtrack is amazing, show the pure roots of rock. Anyway, It's 70's, isn't it? The script is good. There isn't too much going on in the background, like a complete love story, but, anyway, I guess the idea of the script was really to depict a guy who just wanted to live his dream of accompany a big rock band that he was a big fan of, and his discoveries as an adolescent. I see people commenting that they were expecting a big story behind the movie, but it's simplicity is what made me love it the most. It's a reality of a band, the day by day, the backstage, a simple love story behind it as a background, and good music. And that is what rock is about, the feelings, the simplicity. Couldn't be better. Long live to rock and roll!",
            "review_date": "2022-06-27",
            "source": "rt"
        },
        {
            "content": "FRANCES McDORMAND is such a powerhouse performer, Kate Hudson is great, Incredible performances throughout the film, Cameron Crow's best work.",
            "review_date": "2022-05-19",
            "source": "rt"
        },
        {
            "content": "Don't recommend. Phony movie by phonies for phonies.",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "One of the best movies about American Culture ever to grace the Big Screen.  The writing , acting and screenplay are exceptional and truly a piece of American Art brought to Life.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "What a fantastic story with a great soundtrack. The story of becoming an adult while touring with adults who are clinging to their youth.",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's \"Almost Famous\" is an ambitious, nostalgic and sprawling coming-of-age drama suggesting filmmakers deserve recounting their famous stories without vanity. With biographical drama, Crowe drew from his childhood memories to crafting a nostalgia portrait of rock-and-roll era defined by timeless aurra. Using spellbinding cinematography, Crowe draws viewers into an adolescent's almost famous journey of self-discovery in Rock-and-Roll music industry. Emulating Bradley Cooper's \"A Star is Born\", Crowe effectively uses lens flare lighting to foreshadow doomed fate awaiting a rock band unaware of being spyed on by journalists. Crowe showcases extraordinary control over production design, editing and music, creating euphoric cinematic experience. Crowe's script is also sensational, expertly employing voice-over narration to immerse viewers into a teenage journalists' mindset. It's hard to not appreciate astonishing performances. Patrick Fugit delivers career-defining child performance as Will. With mesmerizing expressions, he conveys angst, desperation and regrets of teen hit the jackpot with opportunity to interview his favorite rock-stars. Kate Hudson is equally excellent in the role of a seductive rock-star that takes impressionable youth under her wing. In one of her finest roles, Hudson imbues sympathy into a heiress. Lastly, Billy Crudup  merits recognition. As aging rockstar, he brings immense swagger to the movie. Although \"Almost Famous'\" undeniably unforgettable period piece, ultimately it isn't flawless. At nearly three hours, it suffers from lengthy running-time testing viewer's patience. Moreover, it unintentionally glamorizes drug lifestyle encouraging youth to engage in substance abuse without showing its consequences. Nevertheless, fans of biopics will definitely enjoy \"Almost Famous\" and so will movie-goers looking for enlightening entertainment. Nearly 20 years after it shot to Almost Famous fame in Hollywood, it remains a prime example of the therapeutic value in tracing Boyhood memories across centuries studied by Breakfast Club societies despite teenagers on the Edge of Seventeen arguing that filmmaking is a strictly business rather than personal profession scarcely lending itself towards capturing Dazed and Confused uncertainty faced by Boy in Striped Pajamas confined in concentration camps ruled by police reminding inmates Life is Beautiful only for Nazis that aren't Scarfaced by refugees.",
            "review_date": "2022-02-21",
            "source": "rt"
        },
        {
            "content": "I love this movie. It is one of my favorites of all time. It's beautiful, artistic and happy. I can watch it over and over and over again.",
            "review_date": "2021-12-07",
            "source": "rt"
        },
        {
            "content": "Great ensemble cast brings you into an era and makes it relatable.  It is funny and touching in many different ways.  The screenplay gives each character their reasons making everyone charming and compelling.  The 1970s is an era that found its purpose without having a purpose.",
            "review_date": "2021-12-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies growing up.",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "I'm fascinated that a movie that condones statutory rape and drug use in such a passive manner is never addressed in any reviews. I understand the media always loved a movie about itself but seriously. A film about a band that never performs a full song; a coming of age story of a child that is as wise as the prophets depending  on the given scene. Meandering with a lot of weak performances. McDormand is wasted.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "The film Almost Famous, directed by Cameron Crowe, does a fascinating job at depicting and illustrating the innocence and excitement that main character William Miller experiences as he dives into the real world of onset \"Rock and Roll.\" With this, Miller begins to understand the drama, beauty and love that comes with being a part of a famous band and sharing what you understand to love and what others praise the band for; their music. The film's soundtrack is the main theme that I would like to praise and bring to attention, and is the main reason why this film is so able to accurately portray and depict these scenes into real life emotions and make viewers like myself feel so connected to each and every clip. One scene that really grabbed my attention and helped put into play how this Films uses its music to illustrate and illuminate the emotion in every clip was Penny's overdose in the hotel room, with the song \"My Cherie Amour\" by Stevie Wonder playing over the scene. In this scene, William Miller has already announced his love for Penny as he holds her limp body up as she is severely intoxicated; She falls to the ground from all the drugs in her system, and as a precaution and fear of overdosing, William has already called the hotel paramedics to get a doctor for Penny. The doctors barge in as she falls, and help her to the sink area so they can blow up her stomach and induce vomit. This is when My Cherie Amour begins to play, which is a rather sweet and beautiful song. Dramatic irony is shown in this scene as generally a director would choose a more sad and dramatic song for a scene with someone throwing up and overdosing. But Crowes choice of music gives you chills as you watch Penny suffer and throw up, but at the same time look so beautiful as her legs and feet begin to curl up and her clothing falls off and her skin becomes more exposed; and at the end of the song and scene, the cameras go back to William who is smiling lightly and is showing emotions of true love, whilst staring at Penny and her beauty. William is so in love blinded by her beauty that even in a situation of death, all he can focus on is her. Without the director's choice of this beautiful upbeat love song, viewers would not have been able to grasp any of this disposition or chemical romance that is displayed in this scene, and it would've been depicted as a more tragic and sad scene, rather than one filled with bliss and romance, which is what the director intended to do. Each and every scene in this movie is followed by an amazing song that is specifically picked to help illustrate what emotion viewers are supposed to be grabbing from each scene, which truly makes this film such a masterpiece.",
            "review_date": "2021-10-20",
            "source": "rt"
        },
        {
            "content": "It's a masterpiece of a movie with hard-hitting realism driving it along with rare humbleness which comes when we realize road to success is full of tripping obstacles to overcome.",
            "review_date": "2021-09-29",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a nice movie that doesn't take itself too seriously but has some serious moments.",
            "review_date": "2021-09-12",
            "source": "rt"
        },
        {
            "content": "It feels overly stuffed, but Almost Famous still has a brilliantly original cinematic presence.",
            "review_date": "2021-09-02",
            "source": "rt"
        },
        {
            "content": "Loved the camera work, performances and soundtrack. Lots of funny moments with a well paced and flowing story. Its a potent, powerful and well rounded film. Only thing I disliked was Penny Lane's character.",
            "review_date": "2021-08-29",
            "source": "rt"
        },
        {
            "content": "I loved this movie. I loved the soundtrack, Elton John, Lynyard Skynyrd, Led Zeppelin, The Who, etc. I love vinyl and the entire premise of this movie is right up my alley. I loved the characters especially William Miller. I thought this movie was fantastic. I had a great time and the performances were great. I loved every single second of this movie and it is an instant classic in my book. I loved Almost Famous so much. It was phenomenal, I loved it.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "84%. Great story about rock n roll and love. Awesome soundtrack. Fun and easy watch. Worth a retwatch",
            "review_date": "2021-06-29",
            "source": "rt"
        },
        {
            "content": "Talk about the perfect mix of a film. A great coming of age story mixed with the perfect amount of comedy. Being William's character seems like it would be so fun, going around to places following a band and doing what you love! I would totally do that if I were more into music than film. Back to the movie, everything was on point. The acting was phenomenal (except Patrick Fugits) and it might have been one of the best screenplays I have ever seen. A movie about living a life that is your choice, I love   it! Films about making your own decisions and going the way you want to go in love hit close to home, making me love almost every single one that plays with the subject correctly!",
            "review_date": "2021-06-21",
            "source": "rt"
        },
        {
            "content": "I reckon this is the best movie I've ever seen. It just gives you that feeling at the end where know it's gonna change your life forever. So amazing.",
            "review_date": "2021-06-18",
            "source": "rt"
        },
        {
            "content": "Of my the best movies ever!! This one meant so much to me as a teenager - the music is chosen to perfection. I didn't realize until recently that Stillwater is based on the Allman Brothers",
            "review_date": "2021-06-16",
            "source": "rt"
        },
        {
            "content": "\"Why do you need new bands? Everyone knows rock attained perfection in 1974. It's a scientific fact.\"",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "No it's not good. It was implausible and a hassle to care about some drug addled musician, rock star was twice the movie as almost famous",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "Intoxicating like the fame it portrays, Almost Famous is a tightly-scripted and excellently-acted piece of work.",
            "review_date": "2021-05-29",
            "source": "rt"
        },
        {
            "content": "A wonderful, realistic take on the world of rock and roll. The film features a supurb cast, great directing and a nice soundtrack as well.",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "I can't believe I didn't take the time to see this until today.  Excellent drama!!!",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Is this Crowe's best movie? Maybe. More than anything, it makes me miss these kinds of movies with no prior ip.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "watched this at the theater back in 2000. i wasn't familiar with billy crudup, patrick fugit, zooey deschanel, noah taylor, and not too much with kate hudson. at the time i thought it was the best movie i'd ever watched. certainly don't think so today, but still enjoyed tonight's viewing very much.",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "Love this movie! A fantastic, heart-felt coming of age story with a great ensemble cast; and it's legit hilarious. Kate Hudson deserved her Oscar nomination for her electric performance as the free-spirited Penny Lane (who is impossible not to fall in love with).",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. Does anybody remember laughter?",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "maybe the best coming of age film ever",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Overrated. I expected this to be life-changing. It is a nice movie.",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "Pas mal mais un peu underwhelming. Surtout la fin.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a movie with an earnest heart. It's a film about a boy pining for adventure and seeking to bare his thoughts and passions in print. This is also a film that attempts to capture the essence of the 70s and rock and roll all while balancing a love story and coming of age story. There's a lot going on here. While there is serious attention paid to the pitfalls of fame and success, the glare of the media, and balancing journalistic and personal relationships there's also plenty of screen time dedicated to teenage love and angst. At certain times it feels that the examination of the former is lacking because of the latter. Really, at the end of the day this is more a vehicle for a coming of age story rather than a story about the music. Yet the film would be lesser with one and not the other, or else it would become an entirely different creature to say the least. The band on the run plot trods well into familiar territory and spins the same wheels that other films such as Spinal Tap have done better.",
            "review_date": "2021-03-05",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's Almost Famous, inspired by Crowe's experiences as a teenage journalist for Rolling Stone magazine in the 70s, is a captivating and endlessly entertaining coming of age story.  Bolstered by a great cast, stellar performances across the board, and a fantastic soundtrack filled with the music that defined the time period, the movie is a must see for all who grew up during the era.  William Miller (Patrick Fugit) escapes the grasp of an overly protective mother (Frances McDormand) and embarks on a journey of self-discovery, eventually realizing that he is, in some way, shaped by everyone who touches his life.  The film has a picaresque feel to it and is filled with memorably episodic scenes.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "This movie was way better than expected. Great story that has humor, drama and good music.",
            "review_date": "2021-02-12",
            "source": "rt"
        },
        {
            "content": "Crazy how star studded this movie is, and yet still kinda slow, but with several great moments. Jimmy Fallon is almost unrecognizable, and hence... acted well? Phillip Seymour Hoffman was great",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Some in the music crowd might get more emotionally attached to these characters and story than I did, but it was still an interesting story to follow through their tour",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "I'm not normally one for Coming of Age films - I mean, I really do appreciate them when a genuinely good one comes out, but none have had the effect on me that Almost Famous has had.  It is a complex and heartfelt Dramedy, complete with some very funny moments, some really hard-hitting emotional beats, and one of the most satisfying endings of any movie I can think of.  Each character is expertly performed and wonderfully written, and honestly if I discovered there was a 3 hour extended cut of this movie, I would gladly sit down to watch it.  The movie centers around William Miller, someone who any aspiring writer/philosopher/visionary can relate to, as he is a social outcast, has no luck with girls and struggles with the fact that nobody will take him seriously, even if they like him.  His tale is mostly about him going on the road with one of his favorite bands after they invite him with them after he approaches them for an Interview for Rolling Stone, and he is witness to the triumphs, the chaos, and most compelling, the immensely complicated group psychology of the band he is travelling with, and every one of these facets work to almost perfection.  Basically, imagine everything you can do right with a Road movie, combine it with a Rock and Roll movie, and top that off with a very effective and powerful Bittersweet Love Story, and you have Almost Famous.  I'm generally not one to ever say that you should judge a person on their opinion of a movie you love or hate, but this is such a tender and thoughtful film that if you know someone who has seen it and genuinely hated it, then there's a solid chance they just might be a bad person.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "It took me 21 years to finally watch this movie.  What the heck was I waiting for, someone to get Russell Hammond to do bong hits with me (38 years since that lol).  A great coming of age film about a mythical band and a fake writer for \"Rolling Stone\" (there was a real Stillwater from the South, have an album).  Just a great all around movie: acting, dialogue etc.  zZoey Daschenal was a kid so was Hudson. McDormand was great as the neurotic overbearing over achieving original helicopter mom who drives away Zoey on her 18th B-Day & has William 3 years ahead of himself than lies that he is older.    The jailbait these groupies are.  (Surprised more rock dudes aren't in for statutory but $ talks and AL, NV, HI, and a few others states & Canada & Europe age of consent is 16.)",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "\"It's all happening!\" Or. . .something's happening. Kate Hudson carries this movie, but for those mature enough to be familiar with the tropes of rock n' roll stardom, 70's sleaze, and youthful regret, it's just same old, same old.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "There's a lot to like here. The story was good, there was great acting from top to bottom, and there was more heart than you'd probably expect. I can't believe it took me so long to watch this.",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "Its watchable, but whats the point? I don't really understand the high ratings. \nThe story is not that interesting.\nGood music though.",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "One of best 70s era music type movies.",
            "review_date": "2020-11-04",
            "source": "rt"
        },
        {
            "content": "Asombrosa película por las actuaciones, estilo visual y una comedia practica y que a la ves se siente realista, ojala fuera mas conocida esta joya",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "'Almost Famous' is one of those films that you can turn to over and over without getting bored. The characters feel like real people, as the actors' onscreen chemistry is incomparably sweet. Smart writing offers a wonderful look at Cameron Crowe's true-to-life antics in the 1970's backstage world. It's full of so much heart and soul; I fall in love with this movie again and again!",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "Loved the soundtrack of course. Fun watch, some acting could be better I felt.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "Great music, one of my favorites. Puts you right unit that place and time.",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "My favourite rock movie. Great characters, soundtrack and sets",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Three quarters of the way to being famously great. In the final quarter it turned to mush. Almost eh. The film crashes and burns like the plane really should have to save itself from the juvenile simplicity of the ending. Shame. Was so strong for most the film with Kate Hudson the absolute stand out star. Her talent shines through. Good film in the round but eurgh could've been great.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "One of the most overrated movies of all time.  Perhaps if the bar had not been set so high my expectations would have been met.  A perfectly OK movie, watchable, fine for a rainy day.  I saw it in the theater when it first came out. I would not watch any portion again if it caught my eye channel surfing.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "I thought it was cheesy.\nBut if you like this kind of movie you could enjoy it.",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "In a long life of great films (and TV) this might be Cameron Crowe best work.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Great movie, great soundtrack!! Cameron Crowe does the semi-autobiography right. Lots of behind the music stories hidden under fiction in this master piece",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "Absolutely love this show… Nostalgia, soundtrack, and storyline. I've watched it over and over three years. Almost famous Stands The test of time!",
            "review_date": "2020-06-20",
            "source": "rt"
        },
        {
            "content": "There is a lot that is just very plain likable in \"Almost Famous.\" This movie does a good job creating the rock scene in the 1970s with well-realized characters. I think my favorite parts about this movie are when the characters had quieter and sweet exchanges with each other. I personally liked the characters and dialogue more than the overall story, but the story is still pretty solid and engaging. Ultimately, this movie has an enjoyable vibe and feel to it and is mostly memorable because of the fully realized characters that feel alive and real.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a masterpiece",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "Easily Cameron Crowe's best work. Expertly written with great acting. I can't believe it took a film class for me to finally watch it.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "It's one of my all time favorite movies. Firstly it's in the 70s which is the year of rock and roll. Kate Hudson in this movie is so raw and tragically cool. We all wish that we didn't care sometimes and how we shove our emotions down so we don't have to deal with them.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "An almost perfect ode to music, friendship and true feelings. A new all-time favourite, for sure!\n\n(9.5/10)",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "Fabulous heart warming.  I grew up with Rock and Roll.....from Chuck Berry.....onward.\nI had every record the big sister gave to her little brother !",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite films. A love letter to rock n roll filled with nostalgia, charm, and the best performances of Philip Seymour Hoffman's and Kate Hudson's careers.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "Almost Famous is the ultimate rock and roll movie. The film is based on the true story of it's writer/director Cameron Crowe,  who became a rock journalist while still a teenager. Billy Crudup, Kate Hudson, Frances  McDormand and Patrick Fugit give superb performances.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Cuts through the romanticized portrayal of the Rock n Roll era to provide a candid look at trust, greed, and success in a coming-of-age format, sewn together with an engaging soundtrack and emotional performances. (4/5)",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "As time moves us deeper into manufactured pop and further away from the glorious, stadium-sized excesses of '70s rock stardom, \"Almost Famous\" reminds us to dig in our fingernails as we refuse to let go of what felt so pure.\n\nThis is an unapologetically nostalgia-driven rock and roll love letter, and arguably never has it been more vital than now. Cameron Crowe's semi-autobiographical tale of a fledgling teenage music journalist's immersion in the world of rock anthems, groupies, and shifting band dynamics delivers rock's exalting highs and humbling lows in a way that lovingly honors the decadence and immersive mythology our biggest guitar-driven bands once manifested.\n\nGroupies, band ethos, and a carefully curated soundtrack sold this film, and it's those same reverent depictions that have earned \"Almost Famous\" its own wing in the Pantheon of all-time music films. - (WATCHED THIS? THEN WATCHLIST: \"High Fidelity,\" \"Stadium Anthems,\" \"This Is Spinal Tap.\")",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "An autobiographical flawed diamond that deftly covers a lot of topics in a thoughtful and funny way with a pleasant saccharine centre. It's dang cool, but it doesn't duck out of the way of some raw topics of that time. The blu ray may be unmastered, and no one's crying out for this, but while the image is ugly as heck, the soundtrack is absolute learning material, and the dialogue is crisp and lyrical and does the era and the tone justice. The director's \"Untitled\" cut is sublime, rich and personal, it's like a double album, Cameron Crowe here still the master of creating compelling characters and blisteringly engaging and complex scenes amalgamated from his life. Patrick Fugit's lead character is delightful from start to finish, pure adolescence, his perfect part, he's sweet, odd, and real. And his evolution is natural and heartbreaking and beautiful. \nIt started slow but it ended up every bit as good as I remember it. I'm surprised this film isn't remembered as fondly or as frequently as it should be. It's an odyssey with superb casting and a pitch perfect ending.",
            "review_date": "2020-02-12",
            "source": "rt"
        },
        {
            "content": "Almost Famous started off the century with a great start.Arguably the best film of the year,It has great original script,phenomenal performances,killer queen soundtrack and beautiful direction.It was so snubbed for Best Picture and Kate Hudson should have won Best Supporting Actress for her breakthrough and finest performance of her career. The moral message is that never give up on your dream and I would recommend to all ages......with parental guidance, it has a little sexual content so your parents have to cover your eyes for that.",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "This movie is a great depiction of being young and naive. This film will mesmerize you from beginning to end, so sit back and enjoy.",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's best film is a beautifully made, funny and charming coming of age story with a tremendous ensemble cast.  It perfectly encapsulates its era both visually and thematically.  While it's a must see for fans of classic rock, or anyone with a hint of nostalgia for its time period, Almost Famous transcends itself with a timeless, relatable story.  Above all, this movie is just pure entertainment.",
            "review_date": "2020-01-25",
            "source": "rt"
        },
        {
            "content": "Almost Famous certainly isn't perfectly flawless, but it's the closest to it I've seen in a damn long while.",
            "review_date": "2020-01-18",
            "source": "rt"
        },
        {
            "content": "I was going to give this movie 3 stars or more but I went with 2 1/2 stars. This is a good movie i have seen it so many times a go to movie. Based in the 70's with a great soundtrack a boy who is a music writer that falls in love with a band groupie. I'd watch this movie again interesting movie.",
            "review_date": "2020-01-01",
            "source": "rt"
        },
        {
            "content": "Amazing coming of age film with a strong cast.",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Cool movie A good look inside the time that big bands were on the rise.",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Where did Cameron Crowe's career go? He produced several classic films in the late 1980s and 1990s but with the release of middling We Bought a Zoo (2011) and the awful Elizabethtown (2005) he appears to be on a downward trajectory. It is nice to remember what made him such an acclaimed filmmaker as he does represent the coming of age of sensitive young men with sweetness and specificity and captures the look and feel of the 1970s expertly. The film is funny without betraying the pains that the characters in the film experience and the struggle of becoming a man in an era that allowed for such great freedom.\n\nTeenage prodigy William Miller, Patrick Fugit, grows up in the 1970s as a music lover restricted by his conservative mother Elaine, Frances McDormand, and suburban life. He escapes from this world by writing articles for publications that cover music and is eventually hired by Ben Fong-Torres to cover the ascendant band Stillwater while they are on tour. He befriends groupie Penny Lane, Kate Hudson, who is having an affair with the band's lead guitarist Russell Hammond, Billy Crudup. Miller attempts to cover the band objectively but realizes that their actions may be immoral as Hammond treats Lane poorly and tensions erupt within the band over who is acknowledged as the lead singer. He ends up writing a highly critical article about the band which is well received by his employers but refuted by an angered Hammond. He returns home after this event and ruminates on his time with the band and his experiences with Lane who has stopped being a groupie in the face of Hammond's mistreatment. Lane facilitates a reconciliation between Miller and Hammond that allows for the article to be published and for both men to continue pursuing their career ambitions.\n\nThe character of Penny Lane has become famous as she is allegedly based on notable real life figures such as Bebe Buell but this is probably because the film is able to tap into the deep insecurity and sadness that comes with being used for sex. She angrily protests that she is a \"Band Aid\" and is there for the music and not simply to sleep with famous men but this is clearly not how Hammond, already in a serious relationship, views her. She tries her hardest to keep up the façade of a breezy, happy girl willing to go along with anything but when she is carelessly gambled away by the man she has come to love she cannot keep it together anymore. We see her through the eyes of a young man who adores her because she is beautiful and seems like such a free spirit but even he begins to notice that she is vulnerable and her relationship with Hammond is toxic. At the end of the film we know that Miller now understands that women are more than just their physical appearances and feel things just as deeply as men even if they appear to have not a care in the world.\n\nThe film also has a beautiful rhythm to it as it moves slowly and without urgency as Miller absorbs the environment around him and the romantic side of the music world during this time period is explored. We will stop briefly for the band and all of their entourage to sing Elton John's \"Tiny Dancer\" together or for Lane to perform an impromptu dance. There would not be room for these moments in a different film but Crowe gets the relaxed attitude that most of this strange crew of people would have had during this tour and the culture that allowed for some of the worst actions that the band took. Crowe is willing to spend time with these characters when they are not at the high points of drama and are simply going through the motions of everyday life and that is what makes him so special as a writer-director.\n\nYou also feel as though Crowe really does identify with his main character, this is a semi-autobiographical film, so even when he makes mistakes or miscalculates situations he is sympathetic and this means that the film is more lovable than some of the more cynical deconstructions of rock bands from this era.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "Blobbo sucker for happy ending.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "Lester Bangs says, \"The only true currency in this bankrupt world is what you share with someone else when you're uncool.\" That's what Cameron does great here, all these moments when we thought we were cool but really we weren't.  The illusions of fame and money and respect from strangers, \"The 99% of what passes as rock'n'roll these days; silence is more compelling.\"  But I guess I'm not here to write a sanctimony on the genius Cameron, I just wanna let you know, who ever is reading this, Almost Famous makes me wish I grew up in a decade like the 1970's.",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "Amazing. Filled with so much heart.",
            "review_date": "2019-11-19",
            "source": "rt"
        },
        {
            "content": "Simply the best movie ever made when it comes to music, specially rock. You will fall in love with Penny Lane, who wouldnt?",
            "review_date": "2019-11-14",
            "source": "rt"
        },
        {
            "content": "This is just one of my favorite movies of all time.  Its a story I wish I lived and creates a sense of nostalgia that's amazing",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe is an underrated director. Whilst many lines and scenes from Jerry Mcguire are fondly remembered Almost Famous is another feather in the crown of the director. Almost Famous will be hard to top for its sheer exuberance. The film's ecstatic atmosphere is only briefly interrupted by the sense of longing that is associated with first love and the pain that accompanies the inevitable separation between a child and a parent. Crowe's fourth feature represents another unqualified success for the director, who has yet to have a bad outing. The movie has a great classic rock soundtrack (including some new songs by Peter Frampton) and strong production values that enhance the illusion that Crowe has turned back the clock by a quarter of a century. Almost Famous takes things to the next level, allowing us to believe that the motion picture is transpiring during the era when it is supposed to be taking place.",
            "review_date": "2019-10-17",
            "source": "rt"
        },
        {
            "content": "On its surface, Almost Famous is a film about a child journalist touring with a rock band, however if you look deeper it is really a film about what it means to be \"cool\". I love this film. It is fun, vibrant, exciting and tells its story with such perfection that its hard not to have a good time. The 70s aesthetic is something that automatically appeals to me but this film is so much more than what it looks like on the surface. I am struggling to find words to describe how wonderful this film is and I feel as though my words will not do it justice. The performances are fantastic, Phillip Seymour Hoffman's final scene will never fail to make me cry. This film is incredible and is a must see.  ",
            "review_date": "2019-10-10",
            "source": "rt"
        },
        {
            "content": "Great performances by multiple actors. The story is really well put together. It has a good mixture of drama and comedy, in a more mature tone. The pacing is well done for a movie that is 2 hours long. Overall worth a watch.",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "Packed with relevant themes and some deeply compelling performances, Almost famous is a raw and unique coming-of-age tale that through the glorious highs and devastating lows of the rock-and-roll era —-  and the harsh truths of chasing stardom.\nIroh's grade: B-",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "With an amazing mood and look, a great screenplay and even greater performances, this is truly a near-perfect film.",
            "review_date": "2019-08-22",
            "source": "rt"
        },
        {
            "content": "one of my fav movies",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "Best movie of the 2000s",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "Suuper..!\n\nMovies by words/articles and any words will ruin its beauty, vastness.\n\nGo watch your self.",
            "review_date": "2019-06-21",
            "source": "rt"
        },
        {
            "content": "Absolute classic, pure rock n roll",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": " its a great story with a fantastic soundtrack what more could you want? ",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "I was turned on to this movie by a friend of mine and I'm glad I was. This could be described as phenomenal journey of a young kid in a world he may not be ready for. The acting is great and the whole environment does really well painting the time period it attempts to paint. The relationship between William and Russell is interesting and goes through much struggle only to succeed at the end. Penny's relationship with William is even more deeply thought out and somehow develops as not a romantic relationship but instead and almost familial type. My one issue that I have would be that the movie is too long; Luckily the movie even as it is too long, features several large scale events that keep the plot moving and the audience engaged.",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Honestly, I couldn't even get to the one hour mark. I'm definitely NOT in this movie's target audience.",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a beautifully original coming of age story that has a little bit of something for everyone. The performances are truly mesmerizing and I often found myself forgetting that I was watching a movie at all.\nDespite a few unrealistic moments throughout the film, Almost Famous is a highly recommended experience that I think music lovers and film lovers alike will deeply enjoy.",
            "review_date": "2019-02-18",
            "source": "rt"
        },
        {
            "content": "This is the thinking person's Forest Gump, the story of music and the 70s captured by its creative beating heart that you just had to be there to understand, unless you watch the movie!",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "Very nostalgic for this 70's girl.who was from San Diego and went to a few rock concerts at the San Diego Sports arena. Favorite seen is Tiny Dancer! Even though the Eagles weren't portrayed in the movie, it was based on them and I was a big fan, saw them in SD!",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "A phenomenal movie. Keeps you smiling.",
            "review_date": "2018-10-06",
            "source": "rt"
        },
        {
            "content": "A must see for movie goes and music lovers alike.",
            "review_date": "2018-09-24",
            "source": "rt"
        },
        {
            "content": "taps to the beat..\n\nAlmost Famous\n\nAlmost Famous is a character driven drama about an interviewer going on a run with a band to write an article on the Rolling Stone magazine. As much as unique the concept is, it equally is simple and sensible that breeds valuable opinions from each three dimensional characters of it. \n\nCrowe's world in here believes to live in present and enjoy each tiny moments which offers the audience an adequate soothing closure in each frame; it's just a \"good\" story is what it is. Even the weaving of the structure that occurs in front of the audience in its initial stages, is breathtaking with monologues, debates and \"teenage fun\" bits that makes it slick. \n\nThe songs are uplifting, the backyard score is decently scored, the cinematography is mesmerizing with fine editing and stunning camera work and visuals with live locations that foliates it into the anticipated musical cinematic experience. Hudson is surprisingly good with Crudup and Lane going head to head offering the appropriate crisp to their track and McDormand as always offering the gravitas and keeps this fairy tale grounded. \n\nCrowe's narration is far better than we usually get in such band musicals and the primary reason to that is that it is perfectly balanced, it never is too light nor dark, he is well aware of his audience and he can filter them out with maturity itself. His execution is definitely worth the script he wrote, in fact if anything it celebrates it with an extravaganza for life where each emotional conflict is respected equally with a subtle tone. The behind the stage preparations and conversations that a star goes through, the originality and innocence of the concept and Crowe oozing his presence behind all of it are the high points of the feature. \n\nAlmost Famous is pure art that both lyrically rhymes and taps to the beat and eventually make you too.",
            "review_date": "2018-09-17",
            "source": "rt"
        },
        {
            "content": "My absolute favourite music movie",
            "review_date": "2018-08-07",
            "source": "rt"
        },
        {
            "content": "This movie works because its not about cameron crowe but about those times and all the great music.",
            "review_date": "2018-07-19",
            "source": "rt"
        },
        {
            "content": "A truly precious story of growing up, fitting in, and finding yourself. Every aspect of this film really perfects it.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "Almost Famous just doesn't quite hit the familiar coming of age comfort accomplished by comparable movies.",
            "review_date": "2018-06-29",
            "source": "rt"
        },
        {
            "content": "There is a sense of coming home whenever I watch this movie. It has a great message, a great soundtrack, and a cast that makes you believe each character was wrote with them in mind.",
            "review_date": "2018-06-01",
            "source": "rt"
        },
        {
            "content": "Interesting perspective, but not well told. Kate Hudson can't act, sad but true.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the greatest films of the 2000'S and Cameron Crowe at his best telling a story that is partly his own experiences as a teenager. This story captures perfectly captures the decade as well as the coming age story of its subject with heartwarming yet genuine sentiment. You also can't talk about this film without its stellar cast especially Kate Hudson's heartbreaking portrayal Penny Lane and Frances McDormand's portrayal of the conflicted Elaine Miller. In fact, in regards to the mom I felt the mom perfectly capture the complicated relationships mothers have with their children that made me think of my own mom with my older sister and I. Finally, I have to commend the film on its hilarious quotability along with its production design and costumes that perfectly emulate the era. Overall, an absolutely phenomenal film that is shining example of when a writer-director has so much of an emotional connection to the film that he pours his entire heart and soul into its perfection.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "First things first, I accidentally watched the Director's Cut of the film which is 162 minutes long (40 minutes longer than the released film, which I haven't seen).  I'm not certain whether the extra time benefits the film or reduces its quality.  There were a few places where things felt long or indulgent.  But, of course, the whole premise is pretty indulgent - this is the story of Cameron Crowe's experience as a teen journalist for Rolling Stone touring with The Allman Brothers (here replaced by a fictional band, Stillwater, starring Billy Crudup and Jason Lee).  Crowe wrote and directed the film and gives himself a pretty glorified part.  Moreover, taking place in the early 1970s, the action onscreen is also indulgent, in that there is lots of drinking and drug use (although this is mostly implied because the film seems somehow to be aiming for family friendly, despite the debauchery).  Which brings me to the question of whether this film feels \"right\" in the era of #MeToo.  In fact, it doesn't.  Kate Hudson is the groupie with the heart of gold and, although the film acknowledges that she is treated badly by the band, it doesn't really make any effort to condemn that treatment, at least not strenuously.  Instead, it is nostalgic good times all the way and the rockin' soundtrack doesn't hurt that sentiment one bit.  Crowe spends his time trying to depict the emotional journey of the hero (himself, played wide-eyed by Patrick Fugit) and he does manage to capture wistful naivete pretty well (a la your typical coming-of-age story), including a delayed coda that makes it all right.  A few scenes do suggest that the film could have verged into Spinal Tap territory, but it doesn't (too bad).  However, this may be the only fiction film to ever have someone play Lester Bangs (Philip Seymour Hoffman) and that's worth the price of admission on its own.",
            "review_date": "2018-03-23",
            "source": "rt"
        },
        {
            "content": "coming-of-age + rock = un-dislikable",
            "review_date": "2018-03-21",
            "source": "rt"
        },
        {
            "content": "Great movie, and great soundtrack! One of my all time favorites.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time.  No idea why, but I love it!  Saw it when I was like 15 and never forgot it.  Love how they made their own songs just for the movie, but pretend like they're real.  A classic!  Cast is incredible, especially Hoffman and Hudson, but the rest just as much.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "Crowe took on \"That Thing You Do\" into a rising wonder towards stardom from a young journalist/fan's viewpoint and supportive efforts with pretty much the same charms from \"Jerry Maguire\" being set in the setting period as a meaningful glimpse to the past's musical subject while putting a relevant argument for today's journalists. (B+)\n\n(Full review TBD)",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "Full of great music and situations.",
            "review_date": "2017-11-24",
            "source": "rt"
        },
        {
            "content": "Majestic in storytelling and musicality, Almost Famous displays the brilliance of Cameron Crowe as well as breakthrough performances from Kate Hudson and Frances McDormand. The film's sleek humor and originality is a highlight that puts this above Crowe's achievements as well as listings for the year. 4/5",
            "review_date": "2017-11-06",
            "source": "rt"
        },
        {
            "content": "Almost Famous (2000)  ??? 1/2  /  ????\n\nRolling Stone Magazine hires young music fan to write about up-and-coming rock band as he travels with them on their concert tour. His trip into their world is a revelation to him (and us): not scummy or unpleasant, instead a warm journey with a lot of dynamic humor. Writer-director Cameron Crowe drowns his creative story with colorful, three-dimensional characters (the same way he did JERRY MAGUIRE) and gives them plenty of space to develop. The entire movie is constantly original, surprisingly, and as pure moviemaking, it's superb; extremely entertaining. This irresistible film also made a super-star out of Kate Hudson. A must-watch.",
            "review_date": "2017-10-09",
            "source": "rt"
        },
        {
            "content": "A wonderfully interesting movie about music and touring and the emotional side of all of it.",
            "review_date": "2017-10-02",
            "source": "rt"
        },
        {
            "content": "one of my all time favorites",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "Story about a teenager who fools Rolling Stone magazine into believing he's a journalist and they pay him to have him travel the road with a major rock band. One of the best movies about rock stars. A truly great behind the scenes look at what their life is like. Really makes you jealous of them. One of my favorite movies.",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "Oh my god!!!! I love this movie so much.",
            "review_date": "2017-07-06",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. The characters, the music, the scenery really captures your full attention and keeps you enthralled throughout. Sadly I wasn't alive for the 70s or the age of rock and roll but I feel that this movie is a great representation of that time.",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "\"I'm the lead singer.  You're the guitarist with mystique.\"  Love that intend to sum up the inter-band stress.  The kid had just the right mix of sweetness and intelligence.  Frances McDormand - terrific.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "Grade - A\nFunny, heartfelt, but most of all realistic, 'Almost Famous' marks a career best for Cameron Crowe, who gives us an emotionally resonant story about love, friendship, and music.",
            "review_date": "2017-03-17",
            "source": "rt"
        },
        {
            "content": "A coming-of-age movie that takes you back to when music was more than just music, it was a lifestyle & for some groups practically a way of life. It's well before my time but is still pretty engrossing with some stellar acting from a relatively young cast (Kate Hudson looks barely 18!). Funny & heartfelt, it's an old-school road trip worth taking.",
            "review_date": "2017-03-16",
            "source": "rt"
        },
        {
            "content": "One of the great movies about those with real (vs. peripheral ) love for music.",
            "review_date": "2017-03-13",
            "source": "rt"
        },
        {
            "content": "Kate Hudson is sublime as the teen 'Band Aid' used and discarded by a middling rock guitarist on his way up the charts. Everyone else is meh, as the entire picture seems a TV-safe, romantic depiction of the drug & sex-addled \"last grope of rock n roll\".\n\nOh, and Jason Lee looks SO MUCH like Ryan Reynolds, it's freaking distracting.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time.  Patrick Fugit is powerful and draws in sensitivity & empathy as William.  You begin to care about & for him & his ensuing journalism career.  Furthermore, Billy Crudup & Jason London are beautiful & each deliver strong performances!",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "Wonderful coming-of-age movie about a San Diego boy landing his dream job as a music journalist with Rolling Stone.",
            "review_date": "2016-10-30",
            "source": "rt"
        },
        {
            "content": "It's hard to say why this movie works.  Not only does it have strong and incredibly memorable performances from everyone in it, but the story just has that \"IT\"  that you just can't put into words.  It's a rock and roll coming of age on the road story with a killer soundtrack that works on every level and finds a way to somehow relate to everyone seeing it.  I love this movie and watch it regularly. Stillwater has to be one of the coolest \"made for movie\" bands ever.",
            "review_date": "2016-10-24",
            "source": "rt"
        },
        {
            "content": "Full of life and soul, not to mention funny; \"Almost Famous\" is a coming-of-age story that tells us the values of friendship and love. The characters were perfectly casted and the writing was superb and well-thought out. It's funny and relatable. We're literally stepping into the shoes of a writer as he travel across the country with a couple of rock stars. Enjoy the ride!",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "Fun tribute to classic rock",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "A simply wonderful movie! Who could have imagined that a relatively unknown Kate Hudson would carry this film? Her \"Penny Lane\" is the heart of  the breathless love story trying desperately - albeit unsuccessfully -  to emerge from the crazy reality of a rock band on the road. Simply a great movie that pushes all of your emotional buttons.",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "Excellent movie, with fab music, and an engaging storyline in this semi-autobiographical film from the director himself.",
            "review_date": "2016-09-26",
            "source": "rt"
        },
        {
            "content": "I can't believe it took my so long to see this gem all the way through. I feel like just about anyone can relate to someone in this movie.",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "A refreshing take on a film about rock and roll that doesn't make you want to smash up a guitar by the end. Almost Famous makes you think, laugh and cry. Its a excellent portrayal of real life rock and roll bands in the early 70s. A must watch for any movie fan.",
            "review_date": "2016-08-21",
            "source": "rt"
        },
        {
            "content": "A lovely film with a wonderful ensemble cast.  A love story that had me in tears by the end yet smiling at the same time.  I was engaged so much I wanted to read the \"Rolling Stone\" article at the end.\n\nWasn't entirely in love with the 3rd act, but writer-director Cameron Crowe manages to make it work.",
            "review_date": "2016-08-16",
            "source": "rt"
        },
        {
            "content": "Too long, didn't really get anything out of it.",
            "review_date": "2016-08-11",
            "source": "rt"
        },
        {
            "content": "Honestly i had no idea what this movie was going to be when i sat down and watched it. Needless to say i was blown away by a sentimental and extremely well made movie. If you are a fan of the whole vibe of 70's rock and roll i couldnt recommend this enough.",
            "review_date": "2016-08-09",
            "source": "rt"
        },
        {
            "content": "Earning Cameron Crowe an Academy Award for his screenplay and featuring an array of critically acclaimed performances, Almost Famous had all the acclaim of a necessary viewing pleasure.\n\nTaking audiences back to the glory of a superior age in music history, Almost Famous' story occurs deep within the rock n' roll scene of the 1970's. While providing viewers with a nostalgic time period as the central backdrop, Almost Famous simultaneously functions as a compelling coming-of-age story and a glorious spectacle of rock n' roll. Audiences are given an insight into a protagonist learning what it is to become a man and his discovery of what lies inside the music scene.\nThere are a lot of characters in Almost Famous, but it always comes back to the two main figures. This is William Miller and Penny Lane, a couple who share a really confusing relationship. There is no telling what direction it is developing towards in or what the implications of their interactions infers, taking audiences on an unpredictable ride. The confusion the audience feels does not come from a convoluted narrative; it comes from a story which is written and directed with such finesse that the viewer is able to see it all through the eyes of the protagonist. The confusion audiences get in attempting to understand or predict where things are going gives them a perspective on what it is to fall in love. William Miller goes through his own coming of age experience over the course of the narrative which is a supporting theme in the story, and the confusing emotions he has to face as he grows closer to adulthood make him a really compelling character. The fact that Cameron Crower's screenplay hits this note with such perfection just goes to show how much of a personal piece the film is for him. Almost Famous is a deeply insightful and moving film which is extremely rich in characterization, and this stretches beyond the main characters.\nRather than simply pumping the narrative with sex and drugs, Almost Famous uses these as an afterthought in a story which really humanizes its music stars. We don't just see the party; we see the people who are partying. Almost Famous shows the inner machinations of the fictional band Stillwater and examines the brotherhood and conflict of them. We learn of their relationships with each other and what it is to be a rock star through a story which directly asks them. There are a lot of characters to keep up with and even with the slow pace of the film and extensive running time it still remains a challenge to track it all, but with such vibrant energy in the dialogue the film proves worthy of its weight. \nAnd in capturing the glitz and glam of its time setting, Almost Famous utilizes a very effective visual style. The cinematography maintains a mix of elements from a 70's film and a music video which supports the timeframe and themes of the narrative. The scenery is appealing and the colour scheme captures a somewhat hypnotic mood at times, but the real stylish glory can be credited to the soundtrack. I didn't know what to expect from Almost Famous as a whole, but the fact that this precise subject matter snagged me at a time when I was getting deep into the 70's is just perfect. Given that my contemporary obsession rests on the song \"Simple Man\" by Lynyrd Skynyrd which was featured on the soundtrack to Almost Famous, there is clearly no better time for me to be viewing such a film. The entire soundtrack to Almost Famous is a remarkable testament to a pinnacle era in music history which uses many classics without playing the overused ones, mixing it up with a strong collection of great bands and musicians contributing to create an awesome atmosphere.\nAnd with such powerful backing, the cast in Almost Famous contribute some strong performances.\nPatrick Fugit makes a perfect lead in Almost Famous. Portraying William Miller who is intentionally based on writer-director Cameron Crowe himself, Patrick Fugit captures the perfect state of mind for his character. Balancing his determination to prove journalistic brilliance with his confusion that comes with growing up and saying farewell to his childhood innocence, Patrick Fugit captures an ambitious young character who audiences can easily sympathise with. His is often stoic as he watches the world around him change, and the subtlest developments in his facial expressions say everything that the character needs to without him having to actually say the words. The young boy interacts with a colourful collection of characters and always does it in such a sophisticated manner that it does many favours for the development of his character, keeping him an enticing central subject for the film. Patrick Fugit's constant sense of curiosity provides audiences with someone to join in their plight to discover the world of rock n' roll, and the way he develops as his character grows up over the course of the story is steadily paced and entertaining. Patrick Fugit provides a perfect portrait of the ambitious youth that Cameron Crowe once was. \nBillie Crudup makes for a perfect fit as Russell Hammond. His characterization of the rock star stands out not for his party nature, but for his chemistry with Patrick Fugit. While William Miller is a man with a lot to learn, Russell Hammond is a man with a lot to say which he does with a real genuine feeling to him. His interactions with Kate Hudson constantly feel like a real emotional conflict, but the scenes where William Miller attempts to look inside the man are the real finest moments. He constantly has a barrier up, yet at the same time he is able to speak insightful wisdom which says so much while still hiding so much. Billie Crudup makes Russell Hammond a character audiences really want to discover the secrets of, and his genuine passion is very strong.\nKate Hudson also brings in a fine supporting performance. With rich confidence and a constant sense of mystery about her, Kate Hudson makes a commanding presence which is executed with hypnotic subtlety. She seduces audiences into falling in love with her elusive nature in the same way she does for the protagonist, and it is done through capturing a really spaced-out state of mind which makes her seem as if she is on another planet. Kate Hudson has a constantly sly nature about her and is never predictable, successfully emphasising that Penny Lane is a legend of sorts. There are select moments in the film where she displays a greater variety of emotion for brief periods, and these keep audiences enticed through reminding them of the human that lies beneath. Kate Hudson is a mysterious presence in Almost Famous, and her dedication to the role is nothing short of tenacious.\nFrances McDormand lends some hilarious support. Long a talented performer in the art of comedy, Frances McDormand's portrayal of the overbearing square mother to William Miller is perfect at every time. Being the single-handed representation of the generation gap in the story, Frances McDormand plays the role with such genuine passion to find drama in it that the result is effectively hilarious. Her performance is largely a dramatic one yet the context of the story makes her a source of comic relief, and she displays an effective talent at doing it. Frances McDormand's clever transcendence of a character that constantly has risk of becoming an archetype makes her far more than a simple side character even though her relevance to the overall narrative is rather minuscule. \nJason Lee brings a passionate supporting performance in, and both Fairuza Balk and Phillip Seymour Hoffman make a stamp with their manic energy. Rainn Wilson is also a nostalgic presence when considering his later success on The Office (2005-2013). \n\nAlmost Famous has a lot of ambition which stretches out over a long running time, but the brilliant dialogue ensures that the pacing supports the actors in delivering some brilliant performances that make this coming of age throwback to the 1970's a truly groovy film.",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "beautiful movie! a love letter to the golden age of the Rock and roll, it is so well directed and so well written that makes you want to live in that age and create a band with your friends! it is also super funny, I laughed a lot of times, but also has some powerful and touching moments. all the cast is amazing (especially Hudson and Hammond).\ndefinitely is a must see in every way",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "Good movie. Well acted. Lots of  story.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made for people who want something intelligent yet pop, dramatic yet comedic, effortless yet heartfelt. Extremely easy to watch, yet still exceptionally well written and literate. A must watch.",
            "review_date": "2016-07-03",
            "source": "rt"
        },
        {
            "content": "One of the best \"music movies\" ever made and one of my favorite movies of all time. It must've been pretty easy for Cameron Crowe to write this film as it is loosely based on his experiences as a young writer on the road with the Allman Brothers Band in the 1960s-1970s. Film has arguably one of the best assembled soundtracks of all time.  Billy Crudup is amazing as guitarist Russell Hammond and Jason Lee, who is known more for comedic roles, turns in an excellent dramatic performance as well.  This movie is a must see even if you aren't a huge music fan as it is also an excellent coming-of-age film as well.",
            "review_date": "2016-06-22",
            "source": "rt"
        },
        {
            "content": "Almost Famous is everything. An enjoyable ride, a fun story, a tribute to 70s - 80s bands, a tribute to rock and roll, a movie about music journalism, a movie about a growing up and being cool. It makes you think, laugh, it's unexpected and it leaves you with a good taste of mouth. I didn't particularly like Kate Hudson's character, but not because I think she should be different, but in the sense she acted really annoying like she was supposed to and thus was very successful.",
            "review_date": "2016-06-19",
            "source": "rt"
        },
        {
            "content": "May 28, 2016\n\nNikki's house\n\nNikki Oberholtzer",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "Watched this movie again.  I had forgotten what a great movie this was and enjoyed Cameron Crowe's adventures as a teenage rock journalist.  Sometimes its fun to look at the older movies again (2000).",
            "review_date": "2016-05-20",
            "source": "rt"
        },
        {
            "content": "A captivating coming of age drama about growing up, finding yourself, and chasing your dreams. Paints a great picture of the culture and lifestyle of rock and rollers of the late 60s and early 70s.",
            "review_date": "2016-05-18",
            "source": "rt"
        },
        {
            "content": "It is everything we love about music.",
            "review_date": "2016-05-07",
            "source": "rt"
        },
        {
            "content": "A suberb cast, strong script, and warm-heart allow 'Almost Famous' to live up its (quite substantial) level of hype. \n\nA classic rock n' roll film mixed with a complex teen drama/romance- 'Almost Famous' hits all of the right spots and never wastes a minute of its 2 hour runtime. It feels legitimate, both aesthetically, as well as emotionally and it works perfectly well as a coming-of-age flick and a drama. Further, it has some laughs to keep you going and, overall, it just manages to be a sweet film without being sickening. There's a nostalgia that surrounds this whole movie, so much so that I doubt I'll ever forget when I watched it. I look forward to watching it ten years from now and being nostalgic of  when I first saw it. \n\nIt may bore those who aren't particularly passionate about the music industry, but it still has enough interesting and complex characters to be worth anyone's time.",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "Heartwarming with great music and fantastic performances.",
            "review_date": "2016-04-07",
            "source": "rt"
        },
        {
            "content": "Truly sincere and lovingly made. You can feel how personal this movie was to Crowe.",
            "review_date": "2016-02-21",
            "source": "rt"
        },
        {
            "content": "Back to 70's, olipas hyvä ja sympaattinen bändileffa! <3 (y) (Suom. Melkein julkkis)",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "The film is light and not dense. It is very well directed, but a little slow if you don't like music type films.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "\"Man, we're just not cool. But do you think any of the greats got their by being cool?\"\n\nThis movie coming of age film about a teen who got to go on a tour with a band, AND get too write about them for Rolling Stones Magazine was phenomenal.\nIt contains amazing performances from the leads, excellent dialogue, and an amazing soundtrack that fits in perfectly. By far my favorite movie. Bravo Cameron Crowe, bravo.",
            "review_date": "2016-02-07",
            "source": "rt"
        },
        {
            "content": "This movie is a strange mixed bag of heart-warming drama, comedy masterpiece, and frustrating look behind the scenes of life with a rock-and-roll band. I really love the background we see on the character of William, and how he gets hooked in with Stillwater. He is our surrogate in the story, and I like how it eases us into this world of sex, drugs, and rock-and-roll. Kate Hudson is also charming as the girl who swears she's not a groupie, that grows too attached to one guy. I have heard that this is loosely based on some real events that Cameron Crowe went through himself, which makes sense because everything feels so genuine, and you can also sense the passion he has for the music that is sprinkled throughout the film. I think where I have difficulty connecting the dots in movies like this is when they make it clear that William is forming an emotional attachment to the band. It doesn't feel like there is any basis for his affection for these guys as they continue to distrust and mistreat him. Yet his character qualities of extreme loyalty and trustworthiness make him a standout anyways. I thought the cast was easily the highlight of the film, because they all fit perfectly, and sold the story. The biggest highlights were Frances McDormand and Philip Seymour Hoffman who served as different kinds of advisers/protectors to William. I can easily see why this film is greatly admired by so many people. I think it lacks a little something to fully engage my personal interest (possibly because I'm not a big fan of rock-and-roll) but that doesn't mean it isn't well-made and entertaining throughout.",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "There's always time for this one!",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "What do I like about \"Almost Famous\"? To start with, everything. From the warmly-nostalgic look into the golden age or rock-and-roll to the charming cast to the endearing coming-of-age story to the soundtrack that captures the era. There was a smile on my face during the whole 2 hour runtime and it didn't break once. This may be a bold statement, but I think \"Almost Famous\" is the best film about rock music since \"This Is Spinal Tap\" and Cameron Crowe's best film to date.",
            "review_date": "2015-12-24",
            "source": "rt"
        },
        {
            "content": "A great film with an amazing direction and a extremely well done script. Recommended ",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "when you can't give less than 5/5",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "As someone who grew up in the 70s loving the same type of music this show portrays, I can tell you I was having flashbacks.  \"Stillwater\" the band in the film reminded me of every concert I went to during that era.  The clothes, the music, the partying, the fanatical devotion to music, the record stores, all there.  I found the characters extremely appealing, even some of the nastier ones - once again, it reminded me of my lost youth.  Maybe not the best recommondation for a movie, but if you want to experience the early 70's, this should suffice.",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "Good Movie...Where is the actor Brian Vaughn IV? He only has a small part but he is no where to be found.",
            "review_date": "2015-11-10",
            "source": "rt"
        },
        {
            "content": "A sign of a good film is one that makes you feel nostalgic for a generation you weren't a part of.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "I have so much love for this movie.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "I have no nostalgia for nor fascination with the music or culture of the 70s... not the way it's presented in this movie, anyway. So watching this bored me in the same way Boogie Nights did, which I don't think is a coincidence.\n\nIt's not that it was \"bad\". I just didn't care. Which may be an even more egregious offense.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "This movie was a blast from the past for me. I was in my seventeens when it came out and was not the movie fanatic I am now, so I have to admit that I kind of missed it at the time. I had the opportunity to watch it lately and I was really really amazed.\n\nA really long movie for my taste but one that did not slug or drag even for a minute. Loved the story behind the \"band-aids\" and the acting by Kate Hudson and Billy Crudup. Patrick Fugit was also amazing in his acting, and being at his age more or less at the time, I am thankful that I didn't watch it back then cause I would have ended up some kind of reporter myself...! \n\nPhilip Seymour Hoffman was iconic for one more time, leveling up the entire movie just with some short scenes after his lengthy appearance in the beginning. The movie depicts all the backstage stories of rock bands in the best way possible being soooo close to the real situation that it's amazing. \n\nIt's a movie that does not hesitate to describe things as they happen and it gives the average person a really accurate view of how the industry of show business used to work at the time (or still does). The Jimmy Fallon appearance was also something that I was unaware about and I was thunderstruck by his amazing haircut! This was to die for! \n\nOverall, this is more than a decent movie that should be watched by anyone that considers themselves a rock fan and a movie buff!",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "Interesting view of what life would be like on the road.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "Fun coming of age movie for a music fan.",
            "review_date": "2015-09-28",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe wrote, produced and directed this story based partially on his own personal experiences. Like Crowe, the main character is a bright child who skips grades leading to him graduating at a young age in the 70s. Following Crowe's path, the sixteen-year-old high-school graduate lands a dream job of writing for Rolling Stone where he interviews and tours with the rock bands he loves. The band and many of the characters are fictitious, but it still maintains a deeply personal authenticity few movies have. It shows you that the often-idealized life of a rock star is not so attractive. The more we know about our heroes the more disillusioned we become. Even though the story is not truly remarkable, but the fulfilling characters make it completely worthwhile. The cast has depth and quality. Great acting performances from a young Patrick Fugit, Billy Crudup, and Frances McDormand make the story shine. This may be the best performance to date from Kate Hudson and Zooey Deschanel. Even small support roles have quality performers like Jason Lee, Philip Seymour Hoffman, Rainn Wilson, and Jimmy Fallon. The story is not necessarily happy or inspiring, but it has heart, passion for music and journalism and most rewardingly family love.",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "This one was on my \"need to watch\" list for a while. I finally got around to it, and to be quite honest... there are a lot of music movies out there. But Almost Famous gives you the life, the music, the touring, and the escalation of a band in the world of Rock and Roll! Along with a young kid who plays journalist follows the band on tour and gets a taste of just about everything a band can face in the rise for success. Awesome performances and a really good soundtrack that I probably will want to buy now. Almost Famous... if you are a musician, or just like plain Rock you must check this movie now!",
            "review_date": "2015-09-09",
            "source": "rt"
        },
        {
            "content": "i thought it was a decent movie",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "With good intentions and a strong start, Almost Famous is one of those movies that tries too hard to be inspirational and heartwarming, to the point where it becomes pretentious. Throughout the film, the tone is seen as, \"Look at us, we're the 70's, we're quirky and rebellious\". It didn't bother me at first, but the tone got VERY old near the end. Particularly with the soft-spoken guitar music playing CONSTANTLY in the background for just about 80% of the movie. \n\nScenes come and go, somewhat connecting to the plot. It feels like the same 70's nostalgia-fest scenes played over and over with the main character looking disturbed, but with a slighlty different situation each time.\n\nThere isn't really a reason to get invested in the characters, due to how poor the character development can be. Especially the love interest, who is just irritating on how cute and bubbly she acts, passing it off as \"hardcore\" or \"rebellious\".  Along with forcing a half-baked love triangle out of nowhere, that takes a large role near the end of the movie.\n\nThe film doesn't invite you into the 1970's, it forces the decade down your throat.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "Aranyos film a rock and rollról a 70-es évek Amerikájában, ami egy centivel sem megy túl a jó ízlés határán, amikor a színpad mögötti dekadens világot ábrázolja. Remek zenék szólnak, miközben követhetjük egy szétes? csonka család tehetséges és ifjú sarjának zenekritikusi szárnypróbálgatásait. A f?szerepl? gyerek túltolt bénázásán meg keménykedésén még ront az er?tlen szinkron, de alapvet?en fogyasztható hétköznap esti tévéfilm.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "The best depiction of the 1970's! Cameron Crowe has directed a movie for the ages! Frances McDormand is incredible as the strict single parent, who allows her son to go out and tour with the rock and roll band Still Water for Rolling Stone magazine. I will say too, that Kate Hudson, is really wonderful too in this movie as the rock and roll bands groupie, who Patrick Fugit, who plays the 15 year old boy William Miller, falls in love with while on tour with the rock band. This whole movie is really a classic depiction of life in a rock and roll band from the 1970's as many will argue that \"Dazed and Confused\" is the best depiction of the 1970's, and they would be right, but the fact that Cameron Crowe allows us to go on this wonderful with a rock and roll group from the 1970's and to see how fame can bring together, and destroy a rock group. It's a fascinating depiction of life in the 1970's at that time and why their will never be a time when the 60's and 70's will ever happen again in America, and why the 1970's was really the last great era of rock and roll.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's unvarnished look at what Rock 'n' Roll had become after The Beatles and Woodstock and before fragmenting into subgenres is epic. Unfortunately, it leaves a sour aftertaste, like waking up with a hangover and cottonmouth. The all-star ensemble cast delivers great performances. The parts are better than the whole, though.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Even more touching than Cameron Crowe's earlier instant classic, \"Jerry Maguire,\" \"Almost Famous\" is a poetic, funny, and moving film about chasing your dreams.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "My favorite film of all time.",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "Feel-good, honest about the music industry and everything around it, and emotionally resonant awhile being about fame, journalism, adolesence and ofcourse music. A bit melancolic at the ending but bringing that happy 70's wibe anyway which works perfectly. Well acted and overall well done. Nothing much more to say because the most of this film can be described by my personal preferences.",
            "review_date": "2015-06-18",
            "source": "rt"
        },
        {
            "content": "Quite possibly a perfect film.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "\"To truly love some silly little piece of music, or some band, so much that it hurts.\" -Sapphire.\r\rugh, i really love this movie!!",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "Honest and unmerciful. Almost Famous is a semi-autobiograpy about director Cameron Crowe re-imagine himself as a 15-year-old writing prodigy traveled around the US as a rock-n-roll journalist for Rolling Stone. The film captured the essence and life on the road as the young journalist followed the fictional band, Stillwater on tour. Triumph with adult content, 70s rock-n-roll and most importantly, it is about a sweet coming-of-age story that is so clever and endearing.",
            "review_date": "2015-06-04",
            "source": "rt"
        },
        {
            "content": "The smile I was wearing barely left my face all throughout this movie....Crowe's best movie and one of the years best.",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "A coming-of-age story about a teen who was made to grow up before his time but it took going out on his own touring with the fictional band Stillwater as a writer for Rolling Stone. The behind the scenes look at rock and roll is eye-opening to those who haven't experienced it. \n\n5/25/15",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "se preporacuva za site rokerishta! :) muzika od Hendrix do Zeppelin...super! super! super! zosto duri sega doznav za filmov?",
            "review_date": "2015-05-04",
            "source": "rt"
        },
        {
            "content": "Great. 8.7/10. A-.\n\n\nAlthough it takes a minute to get engaged, the fantastic script of Almost Famous provides an insight into journalism, fame, and the idea of art, while having much to say about each.",
            "review_date": "2015-04-26",
            "source": "rt"
        },
        {
            "content": "You would have never thought that a movie staring Crudup, Hudson, and Patrick Fugit? would have be this unforgettable. Forget great, Almost Famous is bounds and beyond Hudson's best film thus far and most likely will be her greatest role when the curtain calls. Crowe's experiences as a young rock journalist have clearly shined through, showing the realism combined with the classic music, have surely produced an incredible picture. Along with Cast Away, Requiem, Memento, Battle Royale, and a few others, Almost Famous is sure to go down as one of the best films of 2000.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "What really inspired me to watch Almost Famous was the soundtrack at first, which includes the likes of the Jimi Hendrix Experience, David Bowie, The Who and Led Zeppelin. After watching the film, I looked over it as a really solid and strangely comforting film. Every time you watch Almost Famous, its like returning to your family at Christmas, comforting yet quixotic and constantly entertaining, especially if you're a fan of rock music and/or grew up in the era. The film features good performances and the emotional integrity of the characters is so raw that the film is almost autobiographical of our favourote celebrities and the people we had posters of on our walls as children, immortal and total. \"It's all happening...\"",
            "review_date": "2015-04-06",
            "source": "rt"
        },
        {
            "content": "Para volverla a ver.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "If you like rock music and wandered what is was like for American bands post Woodstock, this is your movie. Fun and yet it has a warmness about it. Can't help but to not like the characters.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "Honestly, I'm kinda having a hard time putting my feelings for this movie into words. The main character was extremely likeable because he reminded me a lot like myself. I'm not too sure why. Maybe the way he acts in certain situations is similar to me. Who knows. Basically a story about a boy getting to go on a road trip with a rock band. Along the way he goes to parties, concerts, and gets tangled up in a love triangle between the main guitarist and a super fan played by Kate Hudson. I saw this film once about a year ago and just liked it. Seeing it again, I really enjoyed it. I had a smile on my face the whole way through. I used to think Kate Hudson's role wasn't realistic, but after a whole new year of living and experiences, I can say that I've met this type of person before. Living life without anything taken seriously and always living your dreams. Sometimes I wish I was like that. Drop everything and move to another part of the world. Someday maybe, who knows. Overall, see this movie. I don't think you'll regret it at all!",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Just watched it again for the first time in years ... an awesome movie, great music, good acting and a fantastic story. It doesn't reveal all the secrets of life but definitely two hours well spent.",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "It is difficult to pinpoint exactly why this movie works so well, an excellent blend of drama, romance and crisp believable dialogue. The cast is deep and deliver strong performances. A captivating look into rock-and-roll circa 1970.  The film is not really about any one particular theme be it young love, discovery or friendship. It is really more of a trip, a road trip, discovering and probing all of these things and more. I like to think of it as a look into the nature of basic human relationships (in their many forms) tested by the turmoil of sex, drugs and rock-and-roll. Sometimes people do noble things, sometimes selfish thing, but always believable things. \n\nAll of these elements create a very warm film that is surprisingly human in its approach. The sound track is also very strong and paired well with each scene. One scene was particularly memorable: a simple sing-a-long on a bus against the back drop of a classic song. Most people have at least one strong memory of this simple true Americana pleasure from their childhood, and this scene taps into that emotion. \n\nThis was, in my humble opinion, Cameron Crowe's last really strong movie after a number of hits (including Fast Times at Ridgemont High, Say Anything and Singles). These movies all share a common bond in that they were crafted with care, attention and a sharp eye for detail creating engrossing time capsules of these time periods (or places) and the social relationships of the characters. \n\nMy small critique of this film, and most of Crowe's work, is that he can be heavy handed with the sitcom one-liners. While some of these lines pay off really well, others are a bit jarring.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "I really liked this one.  It gave me that same vibe I got from Dazed and Confused.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "Long live Rock and Roll!",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "An innocent, sweet deja vu of the bygone era. May be too fantastical but that's not bad in a movie that does not want to carry any social messages. The idiosyncratic characters are well defined and equally well acted. They derive normalcy from an even more a-normal backdrop. Their chemistry with each other is endearing. The movie simply sways towards nothing in a likeable way.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "\"Rock stars have kidnapped my son!\"",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "Just love love this movie",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's epic narrative may occasionally bite off more than it can chew, but the emotion of this experience is never lost over the years. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "I've never been a big fan of Cameron Crowe but this one may have swayed me.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Everything about this film is good. Apart from the quaaludes. Probably good they were eventually outlawed.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "easily one of the best movies I have ever seen..def top 10 for me maybe even top 5..its a must see",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "I caught the last fifteen minutes of it on VH1 Classic, so I found a copy and watched it from the beginning to get the full effect. I had only seen the first half, before I turned it off. The first half hour seemed to drag on, and I felt it was kind of pretentious. I felt like it wanted a \"Dazed & Confused\" vibe, that followed multiple perspectives in a coming-of-age drama set in the 1970's. But unlike that movie where the characters got to have fun and be themselves, \"Almost Famous\" was followed a main character who was watching other people have fun. It wanted to have this \"message\" about who we are and what rock and roll means to us. \n\nRemember \"Rock & Roll High School\" where it ends with Joey Ramone blowing up the school? That movie didn't need a message. Sure it wasn't an overly complex plot that bordered on cartoony, but it didn't try to be. It was still funny, engaging and a had an overall theme of teenage rebellion that any generation can relate to. \n\nI may finish the movie another time. It wasn't terrible, but it just couldn't keep my interest.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "There are a few movies made to be eternal, touch our souls and amuse our ears.. this is definitely one of them! great job",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "Can this be my life? Lol",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "I agree with the critics on this one - I give it a 88%,,,of course, any movie with PSH in it automatically make it a must-see.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "A superb love letter to rock n' roll.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Stunningly, I couldn't relate to a bunch of rockstars and groupies",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "the directors taste is way off... kate's tear drop with \"what beer was the only plus there",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "Almost Famous... or as I call it \"Almost Favorite movie\" \n\nWhat's that? That doesn't count as a review? Also, don't take this the wrong way, but I smell like rum and Old Spice? Fair enough. In regards to the former, this is one of my favorite *stories* ever told. It's a loveletter to my favorite type of music, but is also a heartwarming coming-of-age story, brilliantly quotable, and impressively acted. This is without a doubt one of my five favorite movies of all time.\n\nIn regards to the latter, I'll have you know I did not spend all of last night drinking Rum, playing strip poker with hobos, for a twelve pack of old spice! We were drinking Vodka, so there!",
            "review_date": "2014-12-22",
            "source": "rt"
        },
        {
            "content": "It certainly has its moments and packs a great playlist, but Almost Famous is \"almost\" a great film. It falls short in a lot of ways but most clearly some poor acting and drawn out melodramatic dialogue scenes which add little if nothing to the story. Acting is very hit or miss throughout, especially from the lead role. Several awkward moments and poorly written scenes hold this movie back from what it could have been. It's worth a viewing but falls along the same lines as Forrest Gump as far as being nostalgic academy award bait.",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "A funny and warm, well written era-film about a sheltered boy who faces the realities of the rock n' roll lifestyle he so admires.",
            "review_date": "2014-12-14",
            "source": "rt"
        },
        {
            "content": "The music, the girls, the lifestyle; Rock isn't just a genre. Almost Famous is a very entertaining walk-through of the 70's scene for rock n'roll.",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "This coming-of-age tale was probably a lot more impactful when it actually hit cinemas, but time has really watered down its message, politics, and entertainment value.",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's quasi-autobiographical dramedy is often amusing and is graced by a talented ensemble of performers, but would have benefited from a less restrained reflection, illuminating the darker sides more clearly and giving it the edge and excitement it needs.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "The overly saccharine ending diminishes it, greatly. A lot of quotable lines and good acting.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "An all-time favorite of mine, and purely because of how remarkable it is. The story it tells makes you feel like you're living an amazing dream. You are practically touring with the band, singing their songs, being with all the girls and loving every minute of it. Almost Famous is a time machine to the 70's. From the styles to the mentality. But the real shining star is the great, great music. Believe me, if you aren't a fan of classic rock now, you will be. The characters are very genuine here, especially the bright-eyed dreamer William, and the sad but groovy Penny Lane. This is a Cameron Crowe movie unlike any he's ever done before and ever since. This movie is less Jerry Maguire, and more Nashville. It's proof of the power of movies.",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "Almost Famous is the ultimate feel-good movie, benefiting from it's top notch cast, affectionate and hysterical screenplay, and a rockin soundtrack. It is sure to bring out the rock star in all of us.",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "You can say it's a great movie, even I didn't quite liked it. Recreating an epoch with all the ingredients but no real real facts can be seen as an astonishing originality of the authors, but it's still disturbing as artistic process.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Almost Famous is an often times hilarious, occasionally moving coming of age tale that features some great performances and an excellent script. Though my favorite aspect is without a doubt the on point interaction between Elaine and her children, which successfully encapsulates the dynamics between a loving protective mother and her resistant though not quite rebellious children.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "I expected this to be a regular coming of age movie that falls flat, albeit being overly dramatic. But this was so much more. It was very real, insightful and engrossing. Worth seeing.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "Really great inside view off the rock'n'roll circus of the 70's.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nI knew that eventually I'll find a Cameron Crowe film that I would like. Almost Famous is that film. Cameron Crowe may not be much of an auteur as compared to his peers, particularly if you judge the film on its surface, but if one pushes themselves beyond the veneer that Crowe has created then one would find the genuine truth in his films. Jerry Maguire may not be a reflection of the director's own personal life but one can sense the emotions of some of the key characters within that film are inspired from his own life. Almost Famous takes it one step further by providing a semi-biographical retelling of his experience when he worked for Rolling Stone magazine. Crowe has provided us a glimpse of his past, the people he has met, and the experiences that he went through.\n\nThe film's premise is certainly an interesting one, about a 15 year old boy traveling with a band and covering a story on them during their days on tour. Cameron Crowe, who not only directed the film but also wrote the screenplay, has provided the audience with a protagonist, William Miller that does not constantly prove his value to the people around him; there are very few instances that demonstrate the intelligence of the character, especially in regards to music. The film explores aspects of the character that we wouldn't expect from an individual like him; through this not only do we get under the skin of William but also Crowe. Though I personally feel the film is not crawling deep enough on exploring William Miller; there were many portions throughout the film, where Miller's concerns were secondary to the band he was following. I think also due to the fact that William is a slightly tweaked manifestation of Crowe himself, it made him reluctant to have the film place judgement on the character; there were simply not enough moments of the character showing his deeper colors.\n\nI did however enjoy Crowe's ability to draw his audiences in to the world of music that very few know, documenting the hardships and beauty of both the protagonist and the band he follows, Stillwater. Though it takes on an objective, journalistic perspective, it could also be translated to a fan's perspective; showing us the situations, emotions and connection they go through and make during in their commitment to follow them. The film may not get inside the head of Penny Lane's character, which is the band's true fan, but Crowe was able to compensate with the character's relationship with William, which allowed the audience to connect with the character at a deeper level.\n\nThe film could have taken a very easy route and dramatize the hell out of its subjects and used that as a sort plot driver for an impacting third act or conclusion, but instead Crowe sets the film in such a way that is unpredictable; he does not set an emotional goal for its characters and lets the audience sit back and just take in new experiences, similar to what William is going through in the film.\n\nCrowe paces the film effectively with sharing focus on multiple subjects, while also never reaching to a point of complete bias. This allowed the film to feel brisk and smooth, flying by its two hours and 42 minutes without a bump or a hiccup. I would not have minded if Crowe would ever decide to add more scenes in its already lengthy running time, as it would have allowed Almost Famous to be as close to Crowe's own personal experience as possible.\n\nCameron Crowe rallies up a fantastic ensemble cast that provides performances that are of equal praise. Patrick Fugit as William Miller and Billy Crudup as Russell Hammond provided outstanding performances; they were responsible for the film's emotions and were delivered in such a way that never at all felt forced or overly sentimental. Crowe directs them with such precision and emotional charge that it would be difficult to believe that we are watching fictional individuals. Kate Hudson's Penny Lane fuels the film's sense of ambiguity, relying more on her physical rather than her verbal performance; therefore it is required by us, as the audience, to gain our own interpretation of who she really is and the meaning behind her personal relationships. Frances McDormand as the mother of William was also strong, even if her presence is not as prominent as the other three members of the cast. She could have easily played the role with antagonistic drive, but she was able to make her sympathetic, which if the hands of another actress may not be possible, or would be as effective.\n\nAlmost Famous is a wonderful film that draws out genuine emotions and interesting stories of an era in music that many may have forgotten or that could only be found in the minds of the people that lived through it; Crowe takes these emotions and experiences and places it on screen for us to also take in. The film could have been executed much better, particularly in the handling of its characters, but that isn't enough from letting me love this film and revisit it in the future. Almost Famous is an almost perfect film.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nI knew that eventually I'll find a Cameron Crowe film that I would like. Almost Famous is that film. Cameron Crowe may not be much of an auteur as compared to his peers, particularly if you judge the film on its surface, but if one pushes themselves beyond the veneer that Crowe has created then one would find the genuine truth in his films. Jerry Maguire may not be a reflection of the director's own personal life but one can sense the emotions of some of the key characters within that film are inspired from his own life. Almost Famous takes it one step further by providing a semi-biographical retelling of his experience when he worked for Rolling Stone magazine. Crowe has provided us a glimpse of his past, the people he has met, and the experiences that he went through.\n\nThe film's premise is certainly an interesting one, about a 15 year old boy traveling with a band and covering a story on them during their days on tour. Cameron Crowe, who not only directed the film but also wrote the screenplay, has provided the audience with a protagonist, William Miller that does not constantly prove his value to the people around him; there are very few instances that demonstrate the intelligence of the character, especially in regards to music. The film explores aspects of the character that we wouldn't expect from an individual like him; through this not only do we get under the skin of William but also Crowe. Though I personally feel the film is not crawling deep enough on exploring William Miller; there were many portions throughout the film, where Miller's concerns were secondary to the band he was following. I think also due to the fact that William is a slightly tweaked manifestation of Crowe himself, it made him reluctant to have the film place judgement on the character; there were simply not enough moments of the character showing his deeper colors.\n\nI did however enjoy Crowe's ability to draw his audiences in to the world of music that very few know, documenting the hardships and beauty of both the protagonist and the band he follows, Stillwater. Though it takes on an objective, journalistic perspective, it could also be translated to a fan's perspective; showing us the situations, emotions and connection they go through and make during in their commitment to follow them. The film may not get inside the head of Penny Lane's character, which is the band's true fan, but Crowe was able to compensate with the character's relationship with William, which allowed the audience to connect with the character at a deeper level.\n\nThe film could have taken a very easy route and dramatize the hell out of its subjects and used that as a sort plot driver for an impacting third act or conclusion, but instead Crowe sets the film in such a way that is unpredictable; he does not set an emotional goal for its characters and lets the audience sit back and just take in new experiences, similar to what William is going through in the film.\n\nCrowe paces the film effectively with sharing focus on multiple subjects, while also never reaching to a point of complete bias. This allowed the film to feel brisk and smooth, flying by its two hours and 42 minutes without a bump or a hiccup. I would not have minded if Crowe would ever decide to add more scenes in its already lengthy running time, as it would have allowed Almost Famous to be as close to Crowe's own personal experience as possible.\n\nCameron Crowe rallies up a fantastic ensemble cast that provides performances that are of equal praise. Patrick Fugit as William Miller and Billy Crudup as Russell Hammond provided outstanding performances; they were responsible for the film's emotions and were delivered in such a way that never at all felt forced or overly sentimental. Crowe directs them with such precision and emotional charge that it would be difficult to believe that we are watching fictional individuals. Kate Hudson's Penny Lane fuels the film's sense of ambiguity, relying more on her physical rather than her verbal performance; therefore it is required by us, as the audience, to gain our own interpretation of who she really is and the meaning behind her personal relationships. Frances McDormand as the mother of William was also strong, even if her presence is not as prominent as the other three members of the cast. She could have easily played the role with antagonistic drive, but she was able to make her sympathetic, which if the hands of another actress may not be possible, or would be as effective.\n\nAlmost Famous is a wonderful film that draws out genuine emotions and interesting stories of an era in music that many may have forgotten or that could only be found in the minds of the people that lived through it; Crowe takes these emotions and experiences and places it on screen for us to also take in. The film could have been executed much better, particularly in the handling of its characters, but that isn't enough from letting me love this film and revisit it in the future. Almost Famous is an almost perfect film.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "Almost Famous is an unforgettable film that will tug at your strings. I love this movie.",
            "review_date": "2014-10-08",
            "source": "rt"
        },
        {
            "content": "I think at one point or another we all want to be famous. Whether it's being an actor, singer, or an athlete we all tend to want to live the life of a famous person. Almost Famous gives us a breathtaking view of the music industry and one kid just trying to write an article for Rolling Stone on the band Stillwater. When you get past the fact that a 15 year old being allowed to travel with a band, and even getting an article published by Rolling Stone, it's a masterpiece of a film. It takes a little while before each actor settles into their role. I wasn't too keen on the newcomer Patrick Fugit for the first hour but he really stepped it up in the second half.\n\nBilly Crudup gives his best performance that I have seen so far and Kate Hudson is great in her career defining role of Penny Lane. The family dynamic to begin the film was a bit boring and Zooey Deschanel was forgettable but once William leaves with the band everything about this movie becomes great. Frances McDormand was an increasingly sympathetic character and Crudup had a great character arc. Fugit was as good as any child/teen has been in film in a long time and shared many memorable scenes with Crudup and Hudson in which he basically out-shined two Oscar caliber actors.\n\nIt's very hard to make a great film based on or around the music industry. Almost Famous is one of the few films that take you into the world and time frame but also make you want to go listen to that particular band or genre immediately after. I can't stress how much I enjoyed this film and in particular the last 45 minutes. It was emotionally captivating and renewed my love for film once again. It didn't go too far in exploiting the music industry but it also didn't glorify the life in any way either. It's near perfect filmmaking and filled with career best performances.\n\n(edited 9/15/14) After thinking about this movie for a day, I have realized it's a 10/10 not a 9.7. It really shows us how music can actually change people and how it's such a beautiful way to connect with people. A job well done Crowe.\n\n+Fugit out-shined the entire cast \n\n+Hudson and Crudup give career defining performances \n\n+Music based film that works \n\n+Last 45 minutes are emotionally captivating \n\n+Relatable coming of age story about something not usually relatable \n\n-Slow start \n\n10/10",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "\"Almost Famous\" es una encantadora cinta que funciona como un homenaje a todos aquellos perdedores en el Rock y como una tierna y evocadora historia acerca del doloroso paso de la infancia a la adultez.  Patrick Fugit, Billy Crudup, Phillip Seymor Hoffman y Kate Hudson, actúan de lo mejor.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "During Almost Famous, I was confused. Where is this movie going? What is happenning? However, something kept my eyes glued to the screen, and I don't know if it was the sexy music, the quirky dialogue or the excellent era representation but it was riveting. And then, when the credits roll, I was at the border of an emotional breakdown. I realized. Almost Famous is Cameron Crowe magic.\nIf you are a fan of 70's rock then you are in for a treat. Let me first advise you that the Stillwater in the movie is not THE \"Stillwater\" rock band you all know, and that the film is not based on them. It is based on a rock band in the stairway to fame, and tells the coming-of-age story of William Miller (Patrick Fugit), a young Rolling Stone journalist that goes on tour with them, and discovers about humanity like never before.\nI was always a sucker for coming-of-age stories so maybe that helped. The music helped too. The dialogue, everything. The script is so witty, and delivers some heart-warming moments. Fugit is a very good lead, but the star is Kate Hudson as the mesmerizing trainwreck Penny Lane, who steals every scene with her seductive beauty. Also, I have to mention Frances McDormand as Elaine Miller, the mother of William. It's McDormand. You know she is going to be amazing.\nThis film is on the road to become a cult classic. And even though it's difficult to get on the first viewing, you can't wait to see it again, as Crowe's terrific dramedy storytelling is superb in this movie. Almost Famous is a nostalgia ride that is full of heart and good intentions. It keeps you in the edge of your seat without offering much than conversations between complex people that are very difficult to understand. And if you like Elton John's \"Tiny Dancer\", there is this scene on a bus where you will find yourself chanting along with the cast.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time!!",
            "review_date": "2014-09-16",
            "source": "rt"
        },
        {
            "content": "This was my favorite film for years after I saw it.  It is pure magic.  It is insufficient to call it an all-time coming of age, adventure or rock movie.  It is a wondrous evocation of an extended moment, a living reflection of a dream (if you will) seen through starry eyes.  It is an imagining and depiction of the beautiful futility of finding and holding on to a moment and its afterglow, the sustain after the guitar solo, or if you will, the empty auditorium.  And finally, the clarity to let it be a wrinkle in time.\n\nCameron Crowe did something here no one else could do or will do.  More than any other respected filmmaker, he fearlessly dances with sentimentality, striving for poignance, even if it ends up as schmaltz.  This has yielded uneven results in his prior catalogue, but In Almost Famous, it is always the former and never the latter.  He dares to find innocent love, of more than one variety, at the peak of 70's rock and roll greatness, before all that was left was druggy burnout.  He dares to make the most easily caricatured fixture, the groupie (err....bandaid),  a stunning embodiment of vulnerability, confusion, curiosity and sparkle.  Penny Lane, brought to incandescent life by Kate Hudson, is one of the all-time great characters in cinema, because she is everything she appears to be yet so much more.  That is the secret to the indelible characters in this movie.  They seem like flesh and blood visions of the mythical haze of early 70's rock culture, which they are, but they're also earthy and recognizable, in their hopes and vulnerabilities.   \n\nThis movie is a lovely paean to the pop-American experience, a snapshot of the collective trip of 70's rock culture as a vision of the American Dream, mythical yet frozen in memory, yearned for and felt if never entirely realized.",
            "review_date": "2014-09-12",
            "source": "rt"
        },
        {
            "content": "Really enjoyable film with a host of quality performances. Kate Hudson is sensational.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "A little over rated in my opinion",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Awesome one for music fans!",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Anyone who is a fan of 70's rock n' roll and \"coming of age\" movies will immediately fall in love with Almost Famous. The movie is funny, heart warming, and emotional, it has great performances, great writing, great direction, a great soundtrack, and even in the 164 minute directors cut the movie doesn't drag on for a second.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Another movie that makes you yearn to experience life on the road with a rock band how it was meant to be experienced, in the 70's.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "As warm and deep as cold and shallow could be!",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "A back stage view of a Rock 'n Roll band from a young journalists eyes.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "Almost Famous is great, fantastic, entertaining, and wonderful! Director Cameron Crowe (Jerry Maguire) has done it again! The film is magnificent and awesome! \n\nThe story takes place in the early 1970s, where a young man named William Miller (a breakthrough performance by Patrick Fugit), wants to become a journalist and gets his first assignment by Rolling Stone critic Lester Bangs (a fantastic Phillip Seymour Hoffman), where William has to find a band to criticize and to write about for Rolling Stone magazine. On his way he meets Penny Lane, (a beautiful Kate Hudson in her magnificent Oscar-nominated role), a teenage girl who was part of a old band, and William also meets the band Stillwater, where their main star is Russell (a great Billy Crudup), the guitarist of the band and one of the main stars of Stillwater. Penny Lane and Stillwater then take William in a huge tour around the country and William gets complaints and freaks out when his mother, (a wonderful Frances McDormand, Fargo), who was scared about his journalism journey, freaks out and gets worried about William in one of the greatest movies of 2000! \n\nAlmost Famous will blow you away! Kate Hudson and Frances McDormand both give wonderful  and magnificent supporting performances! Cameron Crowe wrote, produced, and directed a movie with great music, a wonderful screenplay, and an awesome cast! Almost Famous is a music movie masterpiece!",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "I think it's safe to refer to this movie as a \"classic\" by now. Just watched the extended \"Bootleg Edition\" cut that comes in at 2 hours and 40 minutes.  Def nice to see so much additional content added to a movie near and dear to my heart and some of it actually adds value. This movie is just so good for so many reasons. Definitely makes me wish I was around in the early '70s as I think I would have fit in perfectly.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "Liked it. Good story.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "My favourite film. always makes me happy.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "I loved this film when it was first released but now I'm so familiar with the director's cut it seems wrong to watch the original theatrical version.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Every time I watch this film I am lulled into a state of 70's nostalgia...despite only being born in 1992.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "A subtle delivery leads to a just plain good film.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Problematic and a bit slow at some parts but Almost Famous' smartly written screenplay and witty direction with a stellar ensemble cast, mostly Hudson and McDormand, makes it up wholly for its stylish themes.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Almost Famous' flaws are swept deftly under the rug as a delightful cast weaves through a 123 minutes of good old fashioned fun.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "Great music, great cast, and a lot of heart. This story hit all the right notes.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "loooooooooooooooooved.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Okay, let's begin by saying that there was honestly very little chance that I wasn't going to like this film. Almost Famous is set in the 1970s, a time that (although I never lived in it) I am extremely nostalgic for. Everything about this film, from its humor, its culture, its characters, and its soundtrack are expertly woven together in a film perfectly concocted to work its way into my heart. Seriously... there is a girl named Penny Lane in this movie. Was there the slightest chance that I wasn't going to enjoy myself? If that wasn't good enough, listen to this: Almost Famous stars Patrick Fugit as William, a teenager who adores rock and roll and dreams of one day becoming a music critic. Okay, really? Coming of age story? Rock and roll? WRITING AND CRITIQUING THINGS? Cameron Crowe, stop trying to weave everything I love into movies. It's freaking me out. Honestly though, this movie hits home constantly in a big way for me, so pay my opinion on it no mind. I was pretty easily manipulated by it, so if you want to call it \"corny\" or \"sentimental,\" be my guest. Although it will always have a special place in my heart due to its subject matter and its great cast.\r\n\r\nAfter meeting his hero (Philip Seymour Hoffman), William gets serious about writing pieces on bands and albums. One such piece is picked up by Hoffman and published, leading to a gig for William at Rolling Stone-they want him to follow the band Stillwater on tour and write a piece on them. On the trip, William encounters sexually liberated groupies who call themselves the \"Band-Aids,\" an egotistical musician who refers to himself as a golden God, and a whole lotta weed. Sounds generic? Not really. This is one of those films that, in synopsis, sounds simplistic, yet once you actually watch it you start to wonder how and why nobody did anything like this before. This film is not just a love letter to the culture of the 70s. It is funny, intelligent, irreverent, and extremely witty.\r\n\r\nAt times, it seems as though Almost Famous owes more to This Is Spinal Tap than other genre classics such as Dazed and Confused-and it's a good thing too, because if this film had been too openly nostalgic even I would have balked at it. But it skewers the mentality and culture of every aspect of the era it takes place in almost as often as it reflects on them wistfully. There's a whole range of lifestyles caught up here, from the rebellious daughter to the overprotective mother to the disgruntled band member who gets left in the shadows. The exchanges between the members of Stillwater (which, I might remind you, is a very real band) is consistently funny, and reveals everything about rock bands that you always assumed was true. \"I work just as hard or harder than anybody on that stage. You know what I do? I connect. I get people off. I look for the guy who isn't getting off, and I make him get off.\" What does that even mean? Who knows? Who cares? The whole film is such a glorious acid trip that I'm certain the audience won't by the time it's over.\r\n\r\nThe soundtrack, of course, is consistently good, featuring everything from A to Zeppelin. But although this movie is certainly about music, it's the people who make it great. Often, people will say that a film is only as good as its villain. Well, Almost Famous has no villain-at least in the traditional sense. What makes this film all the more powerful is the looming knowledge in the backs of these character's minds that someday, all of this will have to end through either death or the slow crushing of their dreams. Hell, Hoffman's character prophesies the end of rock and roll within the film's first ten minutes. So perhaps this movie is about the battle against a far more elusive enemy-the slow yet inevitable passage of time. Or, even better, the ever-raging war between the cool and the decidedly uncool. And what's cool about this film is that it KNOWS how cool it is.\r\n\r\nFinal Score for Almost Famous: 8/10 stars. Yeah, I know... sentimental pick, right? Well, don't chalk it all up to that, because this is a legitimately good movie. I never thought that the dork who directed Jerry Maguire would make a film that I enjoy this much, but it has amazingly happened. And in spectacular fashion, no less. This movie is funny as hell, but it's never forced-it's just hilarious in an easygoing, peaceful, serene way. There's something to be said for a film that you can just sit back, relax, and enjoy, and finish off feeling calm, cool, and collected. And this movie certainly fits that bill.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "Very good movie great cast amazing music and the acting was on all cylinders",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "I don't know if it was the hype or my expectation of an entirely different film, but this movie fell flat for me (only to be redeemed a bit in the third act)",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "Almost famous is a fun and exciting gem of a film. It's research into 70's rock and roll music and culture is quite incredible. It blends a good mix of good characterisation and humour perfectly. The films story isn't that original however who cares? Just enjoy the ride.",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "Man, what a movie. Every character is a delight. Every connection fantastic. I haven't seen this in a long time and I was surprised by some of the people in this. Jimmy Fallon, Zoey Deschanel and a few others.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "Love this one, although it may be a little bit late.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "Laid back but captivating in one. My wife and I have differing tastes but both enjoyed it. And the soundtrack rocks.",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Why did I wait so long to watch this? Almost Famous is a phenomenal dramedy and love letter to rock music and the 1970's. Much like the music it explores, it's a free-spirited, crazy whirlwind about life and every moment of this film reflects the very nature of such subjects, while also having a variety of poignant moments and themes. It's a smart film, and also a very funny and heartfelt one. If you love rock music and have a fascination with the 70's, let me try to explain why you should watch Almost Famous, though my words will never do the film justice.\n\nThe story begins in 1969, with an awkward 11-year-old boy named William who lives with eccentric college professor mother, and his older, rebellious sister, Anita. The family dynamic is strange as it is, since their mother strongly disapproves of a number of things, including rock music, or celebrating Christmas in September to avoid commercialism of the holiday.\n\nAfter a heated argument, Anita moves out of the house with her boyfriend to become a stewardess, but she leaves behind her rock records for her brother so according to her, \"They will set you free.\" Sure enough, once he begins exploring the temptations of rock and roll, William's worldview suddenly changes along with his whole life.\n\nShoot forward to 1973, and now William is 15 and still very awkward, but he now has an intense passion for rock music - even sending in articles he had written about rock music to a Creem Magazine, which critiques rock music. He even meets critic, Lester Bangs, who is impressed by William's articles, even though he says that William is too late and that rock music is dying.\n\nStill, he decides to give William a chance to make a name for himself by writing an article for the magazine critiquing a Black Sabbath concert. William is excited about the project, though he encounters trouble trying to get backstage since he is \"not on the list\" of people who can go backstage.\n\nWhile failing repeatedly to get backstage, he meets a group of girls who refer to themselves as \"Band Aids\" who are sort of like groupies, but without having as much sex and are more like huge fans hanging around the bands. However, even they can't get him backstage, despite promises from an attractive, curly-haired blonde girl known later on as Penny Lane.\n\nAfter another failed attempt, he has an encounter with a band called Stillwater, which is playing the opening act as they arrive late and try to make their way backstage. William tries to get an interview with them, but they first tell him to fuck off because he's a reporter for Creem Magazine, which trashed them in past reviews. However, he praises their newest work, and the band reconsiders an interview and get him backstage with them and the Band Aid girls. From this concert, he develops a new friendship with the band and the girls.\n\nHis articles soon catch the attention of Rolling Stone Magazine, which commissions him to write an article as he follows the band, Stillwater, sending him on a wild ride of band drama, sex, drugs, partying, and of course, rock music, all while he tries to get proper interviews from the band members. He also begins to fall in love with mysterious Penny Lane and tries to learn more about her as well.\n\nThe story is excellent as it manages to successfully blend drama with comedy effortlessly. Never do these genres clash with one another. The story is also further bolstered by the eccentric cast of characters, which is to be expected from a film about rock music and the 1970's, and these characters are fascinating to explore. I was also surprised by the sheer number of topics and themes the story managed to explore like covering all the torrid drama that occurs among bands, falling in love, the effects of success, drugs, sex, partying, family, friendship, and more. Some have complained that the story has a very \"been there, done that\" sort of feel, but it explores these familiar ideas expertly and makes them feel fresh again, without ever pounding the viewer with schmaltz.\n\nThe acting across the board is stellar, but there were three in particular that stood out among a cast of greats. Billy Crudup as the lead singer, Russell Hammond, provides the right amounts of crazy and egocentric, but also manages to fuse his character with heart and compassion. Patrick Fugit as the awkward William Miller was a dead-on casting choice since he perfectly conveyed the awkward teenage character, but also handled dramatic scenes very well. And the performance by Kate Hudson as the enigmatic Penny Lane was fantastic, and it's a shame to see that she doesn't do good films anymore (Oh, dear God...Bride Wars. The horror...the absolute horror. WHY?).\n\nAs far as entertainment goes, it will prove to be a blast for anyone who loves rock music, 1970's-centric films, lovers of good dramas, and anyone who has taste for a good comedy. It's a wild, hilarious, exhilarating, and heartfelt 2 hours of very breezy entertainment that is over in the blink of an eye because it is so damn entertaining from start to finish. There is never a moment of boredom to be had, to say the least.\n\nAlmost Famous is a superb dramedy. With great direction, great acting, a wonderful soundtrack, superb storytelling, hilarious humor, and heartfelt moments, it should appeal to a wide variety of moviegoers because there's a lot of good stuff to be found. It's definitely one of the best films of the 21st century and it deserved every bit of acclaim thrown at it. I highly recommend it.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "A very interesting film",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "Crowe should get rewarded for Almost Famous, as it has wit, charm and feel-good overtones. The message and themes shine bright, and every character is there for a reason. Some scenes drag a little bit too long and are overplayed a little bit, which is the sole reason for my 8 and not 10 rating. But, still overall a great film and I definitely recommend it. I especially liked Eric Stonestreet as Sheldon the desk clerk, after seeing him in Modern Family.",
            "review_date": "2014-03-05",
            "source": "rt"
        },
        {
            "content": "This movie just made me feel so good! All the actors in it are so good and I found myself liking all of them. I wasn't around in the 80s, but if I was I think the world would have been something like this",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "A supremely watchable piece of work, Almost Famous is funny, dramatic, and original. Some of the pieces don't quite fit perfectly, such as a few lulls in the plot which are unable to stay on par with the exquisite soundtrack at points and some questionable acting, making this a very good but not quite great movie. It will be hard to forget a story so unique yet so cliche to rock n' roll. 4/5 stars",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Kinda rocked, I guess. Had rock in it. Maybe it's accurate or something because of Crowe's former experiences. Does accuracy make a movie?",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "A beautifully nostalgic ode to adolescence; never sentimental, just affectionate. Terrific performances all round.",
            "review_date": "2014-02-12",
            "source": "rt"
        },
        {
            "content": "It's CRAZY... How different freedom was before the cellphone revolution.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "Brilliantly funny semi-autobiography by Cameron Crowe who combines humor with the real life feeling of being a teen following a rock band. Kate Upton and Frances McDormand act wonderfully in the movie, and great role of the senior advisor figure for William, the main character by the late great Phillip Seymour Hoffman. Incredibly enjoyable and well written",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "Organizations\nOrganization \tAward category \tRecipients and nominees \tResult\nAcademy Awards \tBest Actress in a Supporting Role \tKate Hudson \tNominated\nFrances McDormand \tNominated\nBest Editing \tJoe Hutshing and Saar Klein \tNominated\nBest Screenplay - Original \tCameron Crowe \tWon\nBritish Academy Film Awards \tBest Actress in a Leading Role \tKate Hudson \tNominated\nBest Actress in a Supporting Role \tFrances McDormand \tNominated\nBest Film \tIan Bryce and Cameron Crowe \tNominated\nBest Film Music \tNancy Wilson \tNominated\nBest Screenplay - Original \tCameron Crowe \tWon\nBest Sound \tDoug Hemphill, Rick Kline, Paul Massey, Michael Wilhoit and Jeff Wexler \tWon\nGolden Globe Awards \tBest Actress in a Supporting Role \tKate Hudson \tWon\nFrances McDormand \tNominated\nBest Film - Musical or Comedy \tWon\nBest Screenplay \tCameron Crowe \tNominated\nGrammy Awards \tBest Compilation Soundtrack Album - Film, Television or other Visual Media \tDanny Bramson and Cameron Crowe \tWon\nSatellite Awards \tBest Actor in a Supporting Role - Musical or Comedy \tPhilip Seymour Hoffman \tNominated\nBest Actress in a Supporting Role - Musical or Comedy \tKate Hudson \tWon\nFrances McDormand \tNominated\nBest Director \tCameron Crowe \tNominated\nBest Film - Musical or Comedy \tNominated\nBest Screenplay - Original \tCameron Crowe \tNominated\nGuilds\nGuild \tAward category \tRecipients and nominees \tResult\nAmerican Cinema Editors \tBest Edited Film - Musical or Comedy \tJoe Hutshing and Saar Klein \tWon\nArt Directors Guild \tExcellence in Production Design - Contemporary Film \tClay Griffith, Clayton Hartley, Virginia Randolph and Eric Rosenberg \tNominated\nCostume Designers Guild \tExcellence in Costume Design - Fantasy or Period Film \tBetsy Heimann \tNominated\nDirectors Guild of America \tOutstanding Directing - Motion Pictures \tCameron Crowe \tNominated\nMotion Picture Sound Editors \tBest Sound Editing - Musical Film (Domestic and Foreign) \tCarlton Kaller \tWon\nBest Sound Editing - Dialogue & ADR, Domestic Film \tLaura Graham, Laura Harris, Kimaree Long, Kelly Oxford and Michael Wilhoit \tNominated\nProducers Guild of America \tMotion Picture Producer of the Year \tNominated\nScreen Actors Guild \tOutstanding Actress in a Supporting Role \tKate Hudson \tNominated\nFrances McDormand \tNominated\nOutstanding Cast \tNominated\nWriters Guild of America \tBest Screenplay - Original \tCameron Crowe \tNominated\nCritics groups\nGroup \tAward category \tRecipients and nominees \tResult\nDallas-Fort Worth Film Critics \tBest Actress in a Supporting Role \tKate Hudson \tWon\nFlorida Film Critics \tBest Actress in a Supporting Role \tFrances McDormand (also for Wonder Boys) \tWon\nNewcomer of the Year \tKate Hudson \tWon\nKansas City Film Critics \tBest Actress in a Supporting Role \tKate Hudson \tWon\nLondon Film Critics Circle \tActor of the Year \tPhilip Seymour Hoffman (also for Flawless) \tNominated\nScreenwriter of the Year \tCameron Crowe \tNominated\nLos Angeles Film Critics \tBest Actress in a Supporting Role \tFrances McDormand (also for Wonder Boys) \tWon\nSan Diego Film Critics \tBest Actress in a Supporting Role \tFrances McDormand \tWon\nBest Director \tCameron Crowe \tWon\nBest Film \tWon\nBest Screenplay - Original \tCameron Crowe \tWon\nSoutheastern Film Critics \tBest Actress in a Supporting Role \tFrances McDormand \tWon\nBest Film \tWon\nBest Screenplay - Original \tCameron Crowe \tWon",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Why did I wait so long to watch!? Almost Famous might be the best film about music that I've seen. It's a coming of age story that is so different from the rest. I connected with so many characters in this movie, and that rarely happens. Typically, I'll connect with maybe one or two; but that's not the case here. And I think that was mainly due to the outstanding acting from the entire cast. The music! Oh the music was absolutely fantastic!\n\nI tried to think of something negative to say about this movie, even if it was the smallest thing. And I literally can't think of anything. This movie was amazing. The Tiny Dancer scene was just way too good, dang that was awesome. Also, the fact that Russell is Dr. Manhattan is Watchmen is just epic.\n\nDon't forget: DON'T DO DRUGS!",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "It's a movie about a highschool student that wants to be a journalist.  So he ends up being given an assignment to interview BLACK SABBATH but ends up going on tour with a band called STILLWATER.  Great story about this kid who gets an education about the music business you would never forget .  Definitely a keeper if your a collector like me.",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "One of my fave feel good films ever, an amazing soundtrack, plus Kate Hudson, beautiful and beguiling, making you wonder why she was never this good or lovable again. Warm, fuzzy, wonderful and  the best film about rock and roll outside of This Is Spinal Tap.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "It transports you into its time and it means well, but Almost Famous is in the end a pretty forgettable film with a very boring and too heavily detailed on music first half and it is not as resonant as one could wish.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Great movie.  Not only a cool depiction of seventies rock but also has really interesting exploration of relationships. Also has hilarious scenes.  I recommend it.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "Really is a genuine warm fuzzy feeling factor film. Fugit's suppressed teen leads the viewer in perfect style through a great story which is backed by the quintessential 70's soundtrack. I was hooked from the moment the film eased me into his over-protective mother's grasp right until the credits let me go. Awesome.",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "clever, almost perfect script, lines and plot.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "A film to watch over and over again.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "\"I am a golden God!\" An interesting look at rock journalism during the early seventies with an awesome soundtrack, stellar performances,  and memorable lines. I liked this film a lot.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "What a great coming of age film of a smart 15-year old wanting to become a music journalist and some rock stars needing a little dose of \"uncool\" maturity.  Great performances all around.  One unforgettable line in the movie that I just had to write down, which speaks to the raw authenticity that can come from dropping the celebrity mask: \"The only true currency in this bankrupt world is what you share with someone else when you're uncool.\"",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Absolutely fantastic. Beautifully directed and shot as well.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "One of the few movies I would sit down to watch again and again. Cameron Crowe won an Oscar for his screenplay which is based on his life where one summer he was on tour with Led Zeppelin o write a story for Rolling Stone. BTW, He was 15 at the time.",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "STAND ALONE REVIEW: I love music, and i love film.  This movie shows the passion the director has for both.  You can tell that this was fun shooting, all the cast have great chemistry with each other.  Great, Great movie\n\nWATCHING WITH YOUR BOYS: I dont know, mushy movie with boys....sure why not\n\nWATCHING WITH A CHICK AT NIGHT: This movie is plain adorable so she'll be with it",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "It might seem cliche but it is the little things that make the film wonderful. From the frequent saying \"It's all happening\" to  emotionless glare of William Miller, the film captures a perfect coming of age story which every one should watch. Cameron Crowe did an amazing job putting this witty and clever script and fun story together. The film is based on his life as it captures a 15 year old gifted writer who goes along with rising rock band. Along that journey, he deals with the ideas of loving rock music not endorsing the system, love, temptations, and what makes life life. Each character you grow to love and what makes the film good is the vulnerability of the young mind of William Miller. You can feel for him as he grasps the reality of the world of rock stars and the media's dilemma. Characters like Penny Lane, Russell Hammond and Jeff Bebe made the film colorful and you would end up falling in love with them as they go on their tour across America. Small stuff like having Lester Bangs and Ben Fong-Torres just seals the deal. Even though the word is overused in my ratings but this film makes you feel warm and questions yourself whether you're living the life you want or the life that is made for you. I love those type of films. In the end, I LOVE this film and recommend this to everyone. It's the perfect coming of age story and it'll make you appreciate music as it is... especially when we have Tiny Dancer in our head.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "This movie just gets better every time I watch it",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's somewhat biographical tale of growing up, adult challenges and the 70's rock and roll boom is funny, sad, sweet, good-natured to the bone, and perfectly acted, especially Kate Hudson, who gives the best work of her career here. Easily my favorite Cameron Crowe film after \"Say Anything\".",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "This is a great Rock N Roll Movie. If you haven't seen this movie yet, go watch it tonight!",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "I picked this up at the Library on their \"most popular\" shelf. I can see why it is rated so highly on Rotten Tomatoes. It was a delightful movie. It was a coming of age movie for the young man. It was a movie of forgiveness and growth between mother and her children. It was a fun movie, filled with some \"rockstar\" stereotypes, but all and all it was  original and well worth my time. I will admit I am a bit biased because I start off liking any movie with Kate Hudson, and she was no disappointment. My wife and I both enjoyed our Friday Night DVD.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "I don't think I \"get\" this movie.  I like rock and roll as much as the next Band Aid, but very little is actually spent on the music.  Russell Hammond's last interview answer about what he loves about music is somewhat of an easy trick, \"To begin with...everything.\"  This is Cameron Crowe's problem in \"Elizabethtown\" too, only with shoes and failure.  He doesn't and can't seem to articulate what it is he loves or knows about music.  Now, I know writing about music is like dancing about architecture, but because that articulation of music seems so central to William's journalistic aspirations, the movie needs to be more than just a coming-of-age road trip with surface treatment of the sexdrugsrockandroll trifecta.\n\nKate Hudson's woodsy, backlit scene of her laughingly asking, \"What kind of beer [was I sold for]?\" with those smooth, limpid tears rolling down is indeed a notable performance.  However, what really is the difference between Groupies and Band Aids in the end?  How do they afford such an extravagant, nomadic lifestyle?  What about Penny Lane does William really fall in love with that's so different from the innocent yet sophisticated beauty every other band member sees?\n\nThe best part of the movie is probably Lester Bangs's brash but sympathetic caveats about fame and coolness.",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "Ok to start this movie has an amazing sound track. A coming of age fantasy we all wish we could live. With some true strong characters like a single mother with 'eyes in the back of her head' a first love that is a roadie and 70's band that shows their human   nature. Hard to explain all that happens in this movie-its just see it!",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "A very good movie with great acting. It seems really authentic, the rock scene and etc, and feels 70s (even though I wasn't alive back then). It had an excellent story and plot, that's all very original and great, until the last five minutes, in which it becomes very gooey and with a tacked on happy ending. At the end, you're like \"really?\". But, until then, it is clearly great and definitely a five-star movie. Very well-drawn characters, and an authentic, heartwarming story.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "So good on so many levels. It takes you to the depths of the teenage heart, and leaves you with a renewed youthful perspective on how to see and embrace the broken world around you. Great performance from the ensemble, gets overshadowed the presence of Hudson.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "this was a funny and Entertaining movie, but it got a little serous at the end.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "A eulogy rock and roll could only wish for. Watching director's cut was totally worth it!",
            "review_date": "2013-11-09",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a wonderful coming of age movie. It's gives a nice perception of what the times were like back in the 70's. Such a well written and beautiful story about a young a boy with an over bearing mother who takes to the road with an up and coming band struggling with their ever rising fame and popularity. A great cast with each character played out so well, especially Frances McDormand playing the role of the mother. Makes me wish I could have been a teenager during this era. Very likeable film, easy to watch more than once.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "This movie will make you hug and love yourself while you're watching it, even if you hate yourself.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "been a while since I have a seen but do remember it was a very entertaining movie",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "Very interesting take on a teenager named William Miller (Patrick Fujit) who is in desperation to live his controlling mother (Frances McDormand) to pursue a career as a writer for Rolling Stone Magazine. His love for rock music was inspired by his older sister (Zooey Deschanel), who left four years earlier, and he ventures off onto a tour with this aspiring famous group called Stillwater (never existed, just fictional for the film's purpose). William ends up touring with the group (which includes actors Jason Lee and Billy Crudup) and several groupies that often hook up with them. One of them (Kate Hudson) initiates a very close relationship with William. Surprisingly effective and funny movie that manages to integrate well-known rock music at the time (like \"The Who\" and \"The Guess Who\") into the movie's soundtrack. Usually when these films use songs as their primary score, that gets annoying pretty fast, but this one didn't because that's what \"Almost Famous\" was all about and it used the music in moderation. Performances are fine in all regards, as everyone is essential and very contributable to story's success. Quite compelling and as I had watched the director's cut as oppose to the theatrical lease, I cannot imagine what important segments during the shortened version were eliminated. It is not overlong by any means at 160 minutes. It works for that length. Finally a film worth watching from the year 2000 (which has not delivered a lot of good films).",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Very good chronicle about a kid reporter who lies about his age and goes on tour with an up and coming rock and roll band and their groupies. Crudiup and McDormand and Hudson get all the attention, but it's the kid, played by Patrick Fugit who's the centrepiece here. Not really my favorite movie that I can watch over and over again, but it's nice to see it again.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "Watch this movie once a year",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "one of my favorites.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "great flick,great music Zeppelins tangerine and private dancer Awesome",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Indeed, the ending is enlightening enough to make you ponder over how your present life is and establish your goals in life as soon as possible, but if you are not a diehard fan of rock music or don't care about knowing more about it, you are very likely to get bored just like me, and wonder, and even curse why these adolescents can be that nonsense. The music industry is just as hypocrite as other entertainment industries, and I think everyone should have known pretty well that they are no more than businesses pretty well, aren't we? Kate Hudson and Philip Seymour Hoffman are great here, and I think everyone would find it pitiful that Kate Hudson now makes nothing more than inferior comedies after seeing her talents here.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "A Polaroid-like Portrait of the Music in the seventies, half true Story half-fiction. Just a tiny bit too long",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie....EVER. A MUST SEE!",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "This journey of a young boy becoming a journalist became man.  He stayed true to his heart",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Cameron Crowe's highly entertaining portrait of stardom, youth, and rock and roll is incredibly satisfying due to well-defined characters, a genuine emotional core, and a fantastic cast.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "A bit dull and dragging but a great story and film",
            "review_date": "2013-07-13",
            "source": "rt"
        },
        {
            "content": "Great rock film ever made!  One of my all time favorites!",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Beautiful, funny, and occasionally thrilling, Almost Famous is wonderfully filmed and well written, and ultimately, an extremely likable and memorable cinematic experience that demands to be seen again and again.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "I've seen this movie so many times late at night on VH1 and watch the whole thing everytime. So good.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "i liked it but kate hudson's character just pissed me off.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "The thing that made Almost Famous particularly enjoyable was focusing on more than just one perspective in the world of rock and roll.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "This movie is perfect.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "Crowe's direction and expertise combined with the perfect cast gives birth to a truly rock 'n' rolling tale.",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "Fun coming of age film, light with some funny moments. Great cast, remains Kate Hudson's best movie.",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "Great friggin' flick!",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "When I experience a movie like Almost Famous for the first time, I remember why I appreciate film as much as I do.  This is a flawless coming-of-age tale that is perfect in every sense of the word.  \n\n15-year-old William Miller (Patrick Fugit) has a passion for rock & roll.  Although his strict mother Elaine (Frances McDormand) doesn't approve of his interest, William spends his time writing album reviews for a local paper.  When his work attracts the attention of Ben Fong-Torres (Terry Chen), editor for Rolling Stone, William is offered an assignment of a 3,000 word cover-story on up-and-coming rock band Stillwater.  William hits the road with Stillwater, where he becomes friends with guitarist Russell Hammond (Billy Crudup) and singer Jeff Bebe (Jason Lee).  William also becomes infatuated with Penny Lane (Kate Hudson), a groupie traveling with the band.  As he works on his story, William experiences life in the road with a rock band.  \n\nNow I must say, I'm not a huge fan of the classic rock genre, but that doesn't matter.  This movie goes so much deeper than that.  The cast here is outstanding, highlighted by Patrick Fugit, Russell Hammond, and of course the gorgeous Kate Hudson.  You also have fantastic supporting roles from the likes of Frances McDormand and Philip Seymour Hoffman, among many others.  The acting is so genuine, each role is perfectly embraced.  \n\nI watched the nearly-three hour Director's Cut, which I wasn't sure about due to it's length.  When the movie wrapped up, it didn't even feel like that much time had gone by.  The story and characters are just so engrossing that the run-time wasn't even an issue.  I'm a sucker for coming-of-age films, and this is easily one of the best I have seen.  Watching this young kid being thrown into the world of rock & roll is truly fascinating, as well as seeing the relationship he forms with a troubled groupie who doesn't know any better.  Almost Famous is a beautiful film, a true masterpiece.  5 stars.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "A great soundtrack helps move the story along.  Kate Hudson is probably the standout, with her honest dishonest portrayal and ease of going from one emotion to the next.  It's an enchanting adventure that does draw you in, even if the main protagonist isn't the most captivating.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Loved it, exceptional acting, felt like I was in the movie",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "A brilliant film. This movie displays the truth about humans. Shows how humans have everything to hide and want everything hidden from the world because they can't face it. It is a wonderful film with great music and a smart story. A kid journalist trying to make it big in critiquing rock and roll finds himself in a perfect opportunity but hits many road bumps along the way. This movie proves that life can be fake. That people can be fake. Penny Lane can be anyone. Overall, all the performances were great. A must see film of the 2000's.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "best. I love this movie.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "Um trabalho expecional de Crowe, tanto em direção, como roteiro. Atuações fabulosas e uma trilha sonora inesquecível.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "A hot chick and rock & roll! Heck, what's not to love about this film. Seems like a fun movie however it goes deeper than that. The movie glorifies the world of fame and fortune yet in its subtext it shows the misery that comes with it.  Dreams against life's realities, masterfully executed in this movie.  A perfect film for puberty! I just hope teens would understand everything it has to it. LOL",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "As an aspiring journalist, a quiet lover of music from a generation gone, and a hopeless romantic at heart, \"Almost Famous\" is one of the few movies that brings me to tears every single time I see it. I can't think of a more beautifully simplistic and simply beautiful movie than this, which is truly a love letter to the craft of writing and the art of music. It's the epitome of dramedy done right.",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "The film is so cleverly scripted and acted out that you almost feel disappointed with the clear-cut, non-controversial closures at the end.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "Unbearably nostalgic, its cast bringing their truest performances. Though it's fictional, it's a classic rockstar-themed movie.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "Finally got around to watching this film. Loved it!",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "An enjoyable story with a unique plot make this great movie. Kate Hudson makes this movie great with a role fabricated for her. Frances McDormand is amazing at being a concerned mother, and Zooey Deschanel is perfect as a rebellious daughter. Perfection at casting and great acting.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "The reality check of everything that the music business was and is. The controvert, the success, the downfall, and the evil record company's.... and the groupys. A teenage boy goes on tour to interview an up and coming rock band just for 1 interview, but learns more then he ever wanted to. Falls in live with a groupy and gets his girl stolen by a member of the band (The Singer of course). All while his mom is waiting at home for him. And did I mention his \"Mentor\" is a washed out music critic? Personally my favorite movie ever. I could watch it over and over.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Down to earth, get real, get real, get real. Do not get high. We are uncool, let us face it. There is some honesty and warmness here. And I should go to sleep now.",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "This movie is a small jewel : funny, witty, entertaining, touching...A must for music lovers.Kate Hudson's performance is unforgettable.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "frances McDormand and Zooey Deschanel are great in this, but I didn't think that Kate Hudson was all that great. The script and soundtrack are great and Philip Seymour Hoffman is great as William's \"advisor\".  \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nFrances McDormand was brilliant in it but I didn't think Kate Hudson deserved an oscar nomination. Sstill brilliant though. Billy Crudup is so cute.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Almost Famous. I honestly do not know how to describe this movie. It was simply indescribable. \n\nLet's start off with Cameron Crowe, the director and writer of the movie. This was believed to be semi-autobiographical based on his personal experiences as a teen reporter for Rolling Stone magazine. Now with real life experiences, everything in the movie just felt so real, so congratulations Cameron Crowe, with this film, you just proved to the world you are one of the best directors of today.\n\nNext, Patrick Fugit. This guy he's a newcomer, he also has a funny last name. But God was he brilliant! He can properly express all his feelings, love, emotions, anger, interest, he was a genius this guy. He should be a top actor today, he really should be making lots of money and getting all the fame. This guy is talented actor everyone!\n\nNow, Kate Hudson. Hmm.. She plays as Penny Lane, which was such a brilliant name to pick first of all. Ya, of course. She was brilliant in this film; playing the rebellious, drug-addict, beautiful girl - Penny Lane. I actually really liked her performance in this movie, she was amazing in the movie, but not in other movies. This is the only good Kate Hudson film everyone.\n\nThe star of the film is none other than Billy Crudup, who plays as Russell Hammond, a man based on Glenn Frey who reminds me a little bit of John Bonham and George Harrison. He was a rock star, drug user, loves groupies, say and do all kinds of crazy stuff. Billy Crudup did a marvelous job with the role of Russell Hammond, I liked his performance. In fact, I think I might have as well been a Stillwater fan from this movie because of Crudup's performance.\n\nIn conclusion, I think Almost Famous is a heartfelt, warm, lovely, sweet and also a rebellious, coming-of-age, crazy film that depicts the life of the 1970s.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Love the sound track to this movie.",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "A great movie about fame and the dark side of it. The movie never got boring, it's a must-see movie! LOVE IT!",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Thanks to a perfect cast, great direction, and outstanding writing, Almost Famous may lack some depth, but it's so well made it's impossible not to admire",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "A charming comedy-drama that benefits from a splendid ensemble cast and a equally brilliant nostalgic story. Almost Famous is almost perfect.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "One of my all-time favs, and one of the most upbeat and hear-warming films I've seen. The moment when Penny, sweeping away her tears, heart-brokenly smiled and walked away from the bitter truth (that Willam flapped to her face) will always be \"a moment to remember\" of 2000s cinema.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "The word \"Almost\" is like the secret keystone here, in that the film is almost achingly sweet, almost hyper-cool, almost working on every level, and is almost as much fun as Spinal Tap.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Almost Famous is a purely good-hearted, frequently comical film that draws you into the era of the 1970's with memorable songs and the overall visuality. It also succeeds with a smart, meaningful story; scripted and directed with great depth and realism by Cameron Crowe and an excellent ensemble of actors who I believe have all given some of the best performances in their careers thus far. 5/5 stars.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Outstanding Coming of Age Film, a Home Run By Cameron Crowe",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "One of My Personal Favorites. Kate Hudson was great as Penny Lane. It has Anna Paquin as Polexia Aphrodisia. She also played Rogue on Xmen.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "lots of rock n roll. the struggles of a rock band. very enjoyable.",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "if u can see the extended director's cut much better awesome dramady",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "The love that was put into the making of this film practically bursts from it.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "\"Almost Famous\" is just such a charming little movie that grabs onto you and never lets go. Plus, the rock-and-roll soundtrack is phenomenal.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Atmospheric and thoroughly interesting, I didn't want it to end. A wonderful film by Cameron Crow. \n\n(Director's cut)",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "You know this has potential to be a 5 starer but at the end, beginning, and middle of the day I just don't buy the band being popular or catchy based on the weak songs that they had. They were modeled after Zeppelin and great classic rock bands so what happened in the translation from page to screen? Aside from not even buying that Stillwater would have a one hit wonder akin to even Green Eyed Lady, it's not a bad movie. I think it's just a tad bit average. This might really mean something to Cameron Crowe but there were too many hammy scenes that took me out of sentimentality.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "A coming of age story that includes a final act of redemption that will leave you warm on the inside.   This is one movie that no matter how many times I've seen it, I never cease to be moved at multiple points throughout.  Great music, great story, great characters.  Thanks Cameron Crowe.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "One of the great rock-and-roll movies, and a delightful coming-of-age story rolled into one. Cameron Crowe's almost-biographical script is so funny and sweet. I miss the Kate Hudson who appears here; so funny, so sweet, so vulnerable. Plus Patrick Fugit and Frances McDormand and Billy Crudup and Phillip Seymour Hoffman. All perfect. Oh, and the soundtrack is like the best thing ever. \"Almost Famous\" just makes my heart all warm.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "A wonderful, endearing coming of age movie with a terrific soundtrack.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "...\"To truly love some silly little piece of music, or some band, so much that it hurts.\"",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Very interesting and unique movie.  Amazing performances all around.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "a great in- depth look into making it big in rock 'n' roll and an exciting look into being a roadie and following in the footsteps of there here's. an amazing piece of film.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "After watching this movie I just feel happy.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "A nice touching story about music, journalism, and life itself.  I'll add that I watched the extended edition which pushes the movie near 3 hours. This extended version makes the film a little slow but still enjoyable overall.  Another quality performance by Billy Crudup and Jason Lee.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "Sweet coming of age movie that is highly re-watchable.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Crowe's semi-autobiographical feature goes in depth to the day and nightlife of music. The film is amusing, genuine, and Almost perfect.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Story about friendship, rock n roll through the eye of a young journalist.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "A fun, retrospective, feel good movie. Not my cup of tea but I enjoyed it all the same.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Still one of my favorite Moves of all time, set mostly in my High School years of the early 70's, great music, even better story of coming of age story of a young idealistic young man journalist. Great Cameos of PSA and Eastern Airlines. I watch it over adn over when it comes up on Cable.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "I would recommend for people who love this movie enough to buy it on blu-ray. It's about 30 minutes long then the original theatrical cut. Doesn't make the movie any better or worse, it just makes it feel more complete.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "There are no words for the greatness of this movie!",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Where has this film been in my life? A late night viewing on TV of Cameron Crowe's magnificent coming of age film was a treat to behold. The film follows 15 year old William Miller, a journalist who, by chance, ends up writing for Rolling Stone magazine and follows up and coming rock band Stillwater on their US tour in the early 1970s. The film is funny and heartwarming,  with terrific performances and a killer soundtrack. If you are a fan of rock music and/or films with great characters and dialogue, this one is not to be missed.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Solid movie. Nothing bad to say.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "I thought this was a REALLY good movie. Great performances, and an awesome soundtrack. It's really one of the best films about music.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Great cast, great acting, great story, but what i really thought shined the most in this movie was the writing it was full of wit and very heartfelt. As a whole the movie was just as great it was touching and well acted as well as comedic. I loved the hell out of this movie and for every right reason.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "softcore historical porn",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "An aggresively real age-flick. Almost Famous may provide a conflict crowded enough to forget its focus, but Crowe's \"lavish-but-honest\" nostalgia produces a rather enjoyable, quotable and realistic ride about overcoming for all its universe. And thus: a remarkably delivered, music-packed film!",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Great rock n roll story. Cute movie.",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "Almost Famous is almost classic about the rock n' roll era. Humor and intelligent acting in the intriguing story about a teen boy's difficult journalism assignment on a band strung out on drugs and fornication.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "Its strong cast and plot make for a well-made, endearing film with an effective feel of time and place.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "'I'm glad you were home.' 'I'm always home. I'm uncool.' \r\n\r\nIt's love!",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "The Rock and Roll movie of all-time.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "I like movies where they do drugs in it",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "A great movie about writing and music (two of my favorite things). A must see.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "What you see on the screen is perfectly embraced by the music that accompanies it.",
            "review_date": "2013-01-22",
            "source": "rt"
        }
    ]
}