{
    "rating": 9.6,
    "release_date": "1998-10-30",
    "num_reviews": 670,
    "genres": [
        "Drama"
    ],
    "summary": "Living a life marked by violence and racism, neo-Nazi Derek Vinyard (Edward Norton) finally goes to prison after killing two black youths who tried to steal his car. Upon his release, Derek vows to change his ways; he hopes to prevent his younger brother, Danny (Edward Furlong), who idolizes Derek, from following in his footsteps. As he struggles with his own deeply ingrained prejudices and watches their mother grow sicker, Derek wonders if his family can overcome a lifetime of hate.",
    "reviews": [
        {
            "content": "The greatest 01 hour: and 58 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "A top ten film of the 1990’s and one of the most important and powerful films ever made.",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "American History X is a thought-provoking and powerful film that tackles themes of racism, hate, and redemption. Directed by Tony Kaye and starring Edward Norton in a career-defining role, this film is a must-watch for anyone interested in exploring the complex issues of racial tension and violence in America.\n\nThe film tells the story of Derek Vinyard, a former neo-Nazi skinhead who is released from prison after serving time for a racially motivated murder. As Derek tries to rebuild his life and repair his relationship with his family, he must confront the hate and bigotry that once consumed him.\n\nThe performances in American History X are simply outstanding, with Norton delivering a stunning portrayal of a man struggling to confront the demons of his past. The supporting cast, including Edward Furlong, Beverly D'Angelo, and Stacy Keach, are all excellent as well, bringing a depth and complexity to their characters that makes them feel real and relatable.\n\nBut what really sets American History X apart is its unflinching and uncompromising examination of racism and hate. The film doesn't shy away from the ugliness of these issues, but instead confronts them head-on, challenging viewers to examine their own beliefs and prejudices.\n\nThe film's cinematography and score are also noteworthy, with the use of black-and-white and color sequences adding to the film's emotional impact, and the haunting score by Anne Dudley perfectly capturing the film's somber tone.\n\nIn conclusion, American History X is a must-watch film that tackles important and timely issues in a powerful and thought-provoking way. With its outstanding performances, uncompromising examination of racism and hate, and haunting cinematography and score, it's a film that will stay with you long after the credits roll.",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "Again, Norton with a stunning performance. There's violence, but necessary for the story. \nEdward Norton is one of those actors who gives you 100%. Will watch any movie with Norton",
            "review_date": "2023-03-29",
            "source": "rt"
        },
        {
            "content": "Great way to expose & empathize with problems, a movie that gives you hope on people that can change.",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "It's a very good motion picture, American History X, American History X, directed by an English, Tony Kaye...and this is his debut...with writer, David McKenna...\n\nEdward Norton and Edward Furlong portray well done...",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "The Edwards did phenomenal (furlong and Norton)\nEdward Norton really did this role well ... The whole tone of the movie was phenomenal .. I felt like this is a movie where a characters actions effected others.. even when he came out of prison and tried to do better.. that he couldn't escape his past \n\nAlso the cinematography was phenomenal.. I loved how when they did flashbacks it was black and white.. and in the present it wasn't.. a metaphor for how he saw the world vs how he sees it after getting out of prison..\n\nThis is probably one of my favorite movies",
            "review_date": "2023-02-17",
            "source": "rt"
        },
        {
            "content": "Dumb voyeurism meets idiot racism\n\nThis movie surrounds itself with racism and expects everyone to look at it as edgy. Although some scenes are interesting, other ones are boring and dull and just drowning with racism and the problems of modern America. Edward Norton who is often very dull as an actor plays the lead character who is abusive and angry, as well as violent and an overall bad person. The writers were pumped to get him to kill black actors during the script, but the story is bland because it's about ignorant white Americans who fill up the movie with their dumb subplots and side stories. Rather than juxtapose it with anything of value, it allows itself to rest on the idiocy of the masses to find it to be an audacious source of film-watching.",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "American History X (1998) is a powerful and brilliant drama film with great visuals, editing, story, and performances by a great cast.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "There's really no point to the movie. Just a lot of violence. That's pretty much it.",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "This is a great movie. - Strong 8/10",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "A very important and powerful film for all to see. Guy Torry and Edward Norton make an amazing duo and both of them act magnificently.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "Really enjoyable film and help defines an ugly part of America's past. Norton kills it, does exactly what he was hired to do. Not a perfect movie, sometimes too much edge with no point but generally hits the ball where it needs to land.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Reluctancy and cautious approach hesitates what this picture is made of by its nature, wondering as you dive in you'll be witnessing whilst surrounded by realistic players as representational aspects. Admittedly, underestimation's generally inevitable, but it becomes a rewarding realization once you watch the film to feel its true power that mostly justifies its acclaimed stature in ranking adjacence to similarly artistically mature films within the decade. Although fueled irrationally but proven as timely relevant as the sadly realized truth on how far a mind can sink pretentiously over inhumane beliefs, therefore hindering the overall American dream as the country's violent, mindless stains unreasonably holding grudging prejudices that are frustratingly lingering today still. A sympathetic direction with analyzed pity and understandable roots as insight where their nonsensical argument originates, with demonstrative performances boldly embodying those beliefs with replicated convictions over realism that certified this as a mature educational value whereas its entertainment lies between narrative energy and aesthetics. Its front does present a notorious nature like a passerby judgement but layered with depth makes it enthralling despite the pitifully nasty, discomforting vibe slurred through negative dialogue nicely deflected. (B+)",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "This is a sad and disturbing story, I wouldn't watch again. Norton's performance is excellent. Watched in 2022, this is 25 years old film, and feels like nothing has really changed since then. (or even worse)",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "When I started this movie I had no clue what to expect besides Edward Norton as a nazi. What I ended up seeing was a blunt yet at points beautiful artistic triumph. It definitely took time to adjust to the half of the movie which was shown with a large emphasis on portraying the story subjectively through the nazi's perspective (showing the childhood nostalgia through scenes that mimicked the style and substance of Triumph of the Will) and I can understand how some might have stopped the movie halfway through seeing it as racist drivel, but when paired with the documentary-style color segments the meaning becomes incredibly clear. I definitely enjoyed how all of the imagery and stylistic devices were used in such a clear and pretty straightforward way all pointing in the direction of one sole vision. This movie is incredibly cohesive in that way, with each choice having a specific purpose leading into the overall meaning, becoming incredibly clear by the time you reach the finale. The only problem I could bring up with the movie is at times its bluntness and lack of subtlety with how it handled its overall message did come off a tad preachy, but on the other hand, with the number of nazis who somehow watched this movie and saw it on their saw side, I guess it could be argued it wasn't blunt enough. Overall, a pretty fantastic movie whose politics still feel just as important today. Highly recommend it, although it definitely could be a tough watch for some.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Phenomenal film that is still relevant today.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "Don't let it make you bite the curb.",
            "review_date": "2022-08-09",
            "source": "rt"
        },
        {
            "content": "What more can be said about this movie? Edward Norton's performance alone is worth the watch but the movie also deals with complex subject matter's including racism, neo-Nazism, murder and rape. The story focuses on an individual and his family, who experiences these events and transforms into a different person in lieu of what has happened in his life. The ending will bring a tear to your eye. This is a must watch.",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Edward furlong and Edward Norton great movie, great storie great acting, furlong by far best movie, I no I no T2 but still this one is outstanding, a storie no one wants to know, but the truth for some, fantastic and should be seen,",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "This movie will become a classic. Excellent acting. Excellent cast. Excellent movie.",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "a must see. really a masterpiece",
            "review_date": "2022-07-10",
            "source": "rt"
        },
        {
            "content": "Rewatched this movie last night, hadn't seen it since in 20+ years. I was amazed at how well it holds up after 2+ decades - try and find another movie from the late 90's that holds up this well in 2022, it's an impossible task. \n\nAn absolutely monster performance by Edward Norton here. The rest of the cast turn in solid performances as well, but watching Norton reminded me how damn good he was in the late 90's & early 00's, and really made me miss the days where he was a frequent headlining actor.",
            "review_date": "2022-06-16",
            "source": "rt"
        },
        {
            "content": "Very powerful and emotional movie. Very good but heartbreaking and heartwarming at different times.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "lovley movie! it has its heavy moments and is allround good. even the calm flashbacks is something were many movies become boring but not this one. \n\ntotally watch it!",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "Attempting to tackle America's long-lasting legacy of racism and hate, American History X tells the story of Derek Vinyard (Edward Norton), a former neo-Nazi who, after serving a stint in prison for the killing of two black men, tries to reform his impressionable younger brother Danny (Edward Furlong).  While it lacks any sense of subtlety and is often overtly pedantic, it conveys an important message and is saved by some stark imagery and a powerful performance by Norton, who fully commits to his role as the conflicted protagonist. Once you forgive its considerable shortcomings, it's an impactful viewing experience.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "Seen this movie several times, at least five. But at this point in my life I truly recognize it as a masterpiece, the gravity that comes from the major moments in the film is very heavy. The ending really topped everything and put things in to perspective…",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "Great Performance by Edward Norton in a pretty good movie. Edward Furlong and Stacy Keach are both good in their supporting roles.  It has a great message and is still very relevant today.",
            "review_date": "2022-02-06",
            "source": "rt"
        },
        {
            "content": "I love Notrton, great movie",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "Irkçılığı iyi anlatan bir film. Çekilme tarzını (sinematografi, görüntü yönetmenliği.) pek sevmesem de gayet orijinal ve bol şiddetli bir yapım eğer edward norton abimizi seviyorsanız kesinlikle izlemeniz gerek. Oyunculukların bazıları iyi bazıları kötü o yüzden biraz dengesizdi ama filmi seviyorum. (çok şiddet olan bir kaç sahne var o yüzden kendinizi hazırlayarak izleyin bence)",
            "review_date": "2022-02-04",
            "source": "rt"
        },
        {
            "content": "I thought Ed Norton gave a performance different than any other. He, to me, brought home the message of of how fear, rage and racism can so easily be cultivated, but when rational thinking and trauma hits home; the original higher ideals of the thinking man with ideologies that extend chaos and bias begin to bloom once again and what can be looks greater than what is.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "Hands down one of the best movies ever produced.  A gripping and unsettling storyline, character progression that you'll rarely see on screen, acting incredible and most importantly, sublime messaging.  I feel like this is a culturally important watch.  I would encourage everyone to watch this movie once, regardless of how difficult it can be to get through certain scenes.  Norton's performance is one of the most memorable I've seen and the supporting cast are equally brilliant.  American History X tugs on all of your emotional strings and leaves you feeling numb as the story wraps up.  Incredible.",
            "review_date": "2022-01-06",
            "source": "rt"
        },
        {
            "content": "I think this is one of the top films in the independent cinema of the 90's. The rawness here is even less than the rawness of there outside. 7/10",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "The emotional gut-punches and thought-provoking material are softened by the film's use of flashbacks and sensationalism.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "A strong film with a strong performance by Ed Norton. \nThe message of the movie is that of anti-racism, anti-hate, but unfortunately, some people have interpreted the opposite message, that might be because of the portrayal of the neonazis as tough and dangerous; that is an image the neonazis and white supremacists themselves are happy to embrace (when in reality they are just giant babies whining about what society owes them), a tactical mistake on the filmmakers' behalf. But I do think it does a really good job depicting how hate grows, especially in kids and teenagers. Recommended film if you aren't distraught by violence.",
            "review_date": "2021-11-25",
            "source": "rt"
        },
        {
            "content": "I hate this movie. I wish it could be unwritten.",
            "review_date": "2021-11-22",
            "source": "rt"
        },
        {
            "content": "This movie was ahead of it's time and very good.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "A deep dive into the cesspit of generational racism and extremism, this is a well made film about a very unpleasant subject.  It doesn't flinch or look away.  Worth watching but hard to watch often.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "I always said Edward Norton is a tremendous actor and he proved it once again. He is sensational and this film is too. I can't believe it was the first movie of someone. I mean you need to start somewhere but the start is often not really good but that start is magnificent. I cried over that film. It is powerful, well-filmed and as I just said the actors are great. I have nothing else to add except the fact that I recommend it.",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "I watched this as a teenager and loved it but I rewatched it a few days ago and found it very inauthentic, silly and cheesy",
            "review_date": "2021-09-10",
            "source": "rt"
        },
        {
            "content": "Saw this in the theater when it came out. For whatever the reason, Its never on tv. My friend happen to have it on dvd and let me borrow it. Just as powerful as I remember it. The ending lines by Danny Vinyard says it best - (Hate is baggage. Life's too short to be pissed off all the time.) Words we can all live by.",
            "review_date": "2021-08-27",
            "source": "rt"
        },
        {
            "content": "Excelemte drama! Atuação impecável de Edward Norton.",
            "review_date": "2021-08-04",
            "source": "rt"
        },
        {
            "content": "Despite addressing a sensitive topic, the film deals with the subject in depth. Definitely, a must see.",
            "review_date": "2021-07-30",
            "source": "rt"
        },
        {
            "content": "Such a great movie. It was done so well and had a great message. Not one I can watch every day due to the content, but all around amazing.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "Guy Torry and Edward Norton, along with his brother played by Edward Furlong KILL it in this movie with their acting. While very brutal in a violent and vulgar way, it sends a good poetic message. A politically and socially powerful movie!",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "As racist and offensive as it can be, it is a very incredible, powerful, and important film that sets a great example of why you should not be racist. Edward Norton was fantastic and Edward Furlong was amazing, and had a simplistic story to it to where it is one of the greatest films of all time.",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "Great performances and a poignant message, but also lacking in subtlety. Overall it's a solid film that's perhaps essential viewing in this day and age.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "The film is very gripping. The characters and their motives are very intriguing, but I feel the ending was a touch rushed. I wanted more. Edward Norton's performance is one of the best we have seen, he totally deserved to win the Academy Award, but lost to Roberto Benigni",
            "review_date": "2021-06-17",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen. Edward Norton is a brilliant actor.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "This movie is just great. I love movies with deeper meanings, and it's a movie where you could learn something. Although, it's a violent film, it just shows how violent the new-nazis are. This movie is about redemption, more than it is about violence and hate. Some people don't want to look past the violence of the film, but I can. I can see through the blood, I you know what I see. I see one of the best films ever to be put on screen. American History X is a MUST SEE!",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "The best neo nazi movie I have seen so far.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "8.75/10. A compelling, difficult story that rings relevant and true - for better or worse - 20 years later. Norton was wonderful - he plays the transformation of his character perfectly. Very good script, dinner table scenes being high points. Gut-wrenching but vital film.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "A textbook example of a perfect balance between tremendous storytelling and disturbing scenes of violence. With creative editing and a tremendous performance by Edward Norton, this is a movie you will not soon forget.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant a must watch film. Edward Norton once again proves why he's one of the best actors of all time.",
            "review_date": "2021-03-26",
            "source": "rt"
        },
        {
            "content": "A film that convincingly shows the meaninglessness of racism and gives the important message of not carrying hate.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "The movie is a great , raw, bold piece of storytelling. No doubt about it. However, im highly sensitive and get absorbed into worlds and things much more deeply than most and so I found this movie to damage my soul a little. You can try to shield yourself from the raw violent scenes but edward norton is such an amazing actor that you get twisted along with him and then when you continue on his journey to a different path, your still left feeling the scars that nortons character has surpassed. Ive only ever watched this movie once a long time ago. I remember most of it vividly and half of it not at all. Guess which parts I vividly remember.....yeah. Thats why I only watched it once. Its just a little powerful and too effective at what they do here. Thats not a negative. Its an amazing positive. I just could only absorb this once. Be warned, this isnt your snowflake directors social justice message. Its about telling a story about one mans journey from one side to the other. I love how directors were able to tell storys in this fashion without stepping on the viewers personal beliefs. If you really want to get through to people, study this formula. They dont, because they dont have the stomach and the testicles  to make something this raw and good.",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "A very powerful movie about love and hate.",
            "review_date": "2021-02-17",
            "source": "rt"
        },
        {
            "content": "A very powerful film led by an excellent performance from Edward Norton.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "This film is beautiful and very entertaining, it is also very violent and deals with a very heavy subject in a very raw way. In general I would only complain about the ending that although beautiful and unexpected in my opinion is a bit too hasty",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "A dark reality brilliantly played out on screen.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "gosh; i very much understand the praise that this film gets. it deserves it. but it's a hard watch; which only helps prove the points it's attempting to make... i don't care to watch it again.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "A hard-hitting film that leaves you with lot's to think about upon its conclusion. The topics of race, violence and anger are conveyed throughout this well written drama that is combined with stand out performances, especially from Edward Norton. May be too violent for some but sends out an important message. Highly recommend.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "Must watch movie👍👍",
            "review_date": "2021-01-08",
            "source": "rt"
        },
        {
            "content": "\"I kept asking myself all the time, how did I buy into this shit? It was because I was pissed off, and nothing I ever did ever took that feeling away. I killed two guys, Danny, I killed them. And it didn't make me feel any different. It just got me more lost and I'm tired of being pissed off, Danny. I'm just tired of it.\" ~ Derek Vineyard\n\nSo it was too tough of a choice that i picked two of my favorite quotes from American History X as they both tie into each other so perfectly. The message being that blaming everything and everyone for your problems won't ever end the way you want it to. Theres no light at the end of the tunnel on that path. \nDerek Vineyard has recently been paroled after a 3 year sentence after he committed a brutal double murder after two black men attempted to break into his truck after a disagreement on the basketball court. Through the narration of his little brother Danny we learn the real roots of his brothers anger and brutality, he once was a bright young man until the death of their father which deeply affected him. Derek grew into a neo-nazi skinhead and the number 2 of a violent white supremacist gang that gained some notoriety in L.A. for the heinous racially motivated crimes they committed. Once locked away Derek finally gains some perspective befriending another black inmate and listening for once. Three years in prison can change a lot in a man, Derek has an earth shattering moment in prison that changed him forever and he was never quite the same again. Now reformed he is in a race against time to sever ties from his following, reconcile with his mother and sister, and prevent his little brother Danny from succumbing to the same grim fate. This film has no happy ending, as in life every action has positive and negative repercussions, you can't escape fate.",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "This movie has the rare ability to force you to look both at yourself and at the world around you with new eyes.",
            "review_date": "2020-12-11",
            "source": "rt"
        },
        {
            "content": "MUST WATCH - Classic. Ed Norton in this is fantastic.",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "This film teaches a very important lesson, \"hate is baggage\". A superb performance from Edward Norton and tremendous story telling creates a masterpiece out of this controversial topic.",
            "review_date": "2020-12-02",
            "source": "rt"
        },
        {
            "content": "When you speak of a story within a story, it better involve idolism, realism, racism, realization and in a way, repentance. One of Edward Norton's iconic performances and certainly Edward Furlong's best performance. In the end it provokes the thought of good and evil and the consequences of our actions.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "The social criticism portrayed in American History X is incredibly strong and powerful. It has a raw message, mized with a super-dark tone, and reality elements. Norton's performance was amazing, as well. A piece of art that stands out as an incredible film.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "Not an exploration of the racial divide for the modern era; there is far too much prominently displayed nazi paraphernalia, and far too many white people yelling the n-word for an explicitly stated thesis of \"hate is bad.\"  It's hard to take Edward Norton's Derek Vinyard seriously as we move back and forth between his portrayals of a bright-eyed high-schooler, a murderous skin-head, and a hardened ex-con.  The core narrative is simple, but the film is over-ambitious in its execution.  The characters mostly fall flat, which makes it difficult to take their grappling with extremism seriously.  The use of black and white is far too on the nose, and embodies the simplemindedness with which this complex subject matter is handled.",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Although the beginning wasn't that great, the story ended strong about redemption and forgiveness. Beautiful film.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "6 bags, and not a lot of jokes for this one at all. It's a serious movie, and maybe one of the best we've watched so far in the year of the Cove. It was also still very relevant and especially relevant today. They don't make 'em like this no more. Furlong doesn't make movies anymore. But they probably got Norton to dot he Hulk because they saw how intense and angry and muscular he was here. It was really cool how it went from the flash backs to flash forwards, and this is just a movie that pulls you in and no part of it (except for HBO's playback issues, which occurred no less than like 3 times, fuck you HBO) will take you out of the movie. It was very intense, and automatic entry into Top 10 list. The gf from the Waterboy is in here, and she's still hot despite lacking morals as this character, and looking like a dude somewhat.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "Great movie starring Edward Norton about neo Nazis in America. I don't know what to say about this movie except it's crazy good.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies, I have ever watched. It was such a nice and different experience. Edward Norton's acting was masterful such that you can understand every little pain he felt and caused. His smile and manner switching before and after was so distinguishing. Movie's cinematography was also amazing; both black and white phase were amazing. The film ran smoothly and hands off to the director for making this movie such a gem along with shocking and unexpected ending. At last, I can say that you can watch this movie anytime.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "American History X does a great job of illustrating the consequences of hate and the way it infiltrates and poisons the mind. On top of this, the movie adequately pairs this life lesson with great storytelling as well as suspension in a way that is very engaging for the viewer.",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "American History X is pretty much about this lad called Derek (Edward Norton) who's served three years in prison for a hate crime.\n\nSince he's got out of prison, he wants to try and change the thoughts on which his brother Danny (Edward Furlong) is having. \n\nThe reason for this is so, that his brother Danny, doesn't follow the same path on what he did and what it did to him.\n\nThe movie's got some outstandingly good acting from all of the cast especially from Edward Norton, this might be his best performance yet.\n\nThere's lots of dark and racist moments which end up happening throughout this movie and it shows what racism can be really like around the world.\n\nAlso, the moral which this movie's got is honestly well shown and it's about how bad racism really is and how violence begets violence and how it can effect someone.\n\nThe flashback which Derek has in prison shows us what he experienced and how he had great character development when he came out of prison.\n\nOverall, American History X is a great movie. The movie's got a brilliant story, some brilliant acting, some very strong and graphic scenes, a great moral and it shows a lot about racism.",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "A very powerful crime drama with a riveting performance by Norton.",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "Phenomenal movie! All-the-more scary and concerning when you consider the rhetoric and actions of today in comparison with when it was filmed. THAT scene puts a lot of people off watching more than once, and I get that, but it's well worth pushing for a second, third and fourth view if you can",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "An outstanding and well-thought-out story of a perspective of one's suffering by its acknowledged ideology. The acting and directing are finest bringing the film an absolute classic. The emotions are well intact throughout the whole movie generating a realistic impression. I swear this film will strike you with feels and other senses depending on your notions.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "It is not an easy watch, but perhaps a necessary one.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "we just finished the nationwide riots here in 2020 USA.  This film nails it back in 1998 and also now.  Very good oppurtunity to think clearly on what really matters in life, it teaches the lessons of Not Blaming others for our own circumstances and that life is unfair and we need to Adjust, not run, gang up or hide in our anger.   This film is a masterpiec, my boys ages 14 and 16 totally understand our times now and I had some changes in heart as well.  One of the most important films I have ever seen.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "That curb stomping will always stay with you.",
            "review_date": "2020-06-27",
            "source": "rt"
        },
        {
            "content": "This crime drama was pretty good. Edward Norton, Edward Furlong, Fairuza Balk, and the rest of the cast did a great job in this movie. The plot to the movie was intense, depressing, and melodramatic. Not everyone will enjoy this movie because it's a dark movie. If you haven't seen this movie yet and decide to, you may or may not like depending on what you think. That's my opinion.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "\"American History X\" is an extremely tough film to watch, but an even harder one to forget. This is an exceptionally complex and thought-provoking movie that is designed to be a conversation starter. Edward Norton has always been a great actor in my eyes, and this movie has one of his most committed performances I have ever seen. This movie challenges the viewer with ideas involving the origins of hate and racism within a person and shows how certain experiences can change people. It's a riveting movie that had my interest throughout. Every second of this movie kept me watching, despite some of the more brutal content. I don't think it a casual movie by any means, but I do feel it is one of the truly powerful movies that everyone should experience at least once.",
            "review_date": "2020-05-25",
            "source": "rt"
        },
        {
            "content": "This is a masterpiece of film making. The true mark of great art is the ability to capture emotions and it's hard to think of another film that does this so brilliantly. It's so thought provoking. The film actually has something to say. The final scene when Derek stands in front of the mirror and puts his hand over his tattoo and thinks about everything he's lost because of anger and hatred gives me the chills to this day. A absolute must see movie",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "This is a great movie with a powerful message on the destructive power of hate. Still applicable today, this movie will touch your heart.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "A perspective we hardly ever see\n(although it was a little too graphic),  it was a very powerful film.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "A really solid movie, but there's a great movie in here somewhere. Some of the chronology and editing choices serve the story well, and some are out of place.\n\nI would have like a little more deep dive into the psyche of the Derek character and what inspires his change of heart. And really the climactic ending falls short by the moving ending completely without the audience knowing what Derek's reaction would have been, Did he really change? Would anger have overcome his new mentality?\n\nStill solid performances and an interesting dive into the psychology of racism.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "Brilliant movie led by an incredible performance by Edward Norton and an unforgettable and daring ending.",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "good acting, but ultimately another patronizing, liberal, hollywood movie that makes the protagonist's beliefs cartoonish and uses the boogeyman of the left, the white supremacist\", to its advantage. I've been everywhere in this nation, over 40 states. White supremacists are extremely hard to find, if you can find any. they are the least of our problems. America is one of the least racist places in the world. A huge, wonderful, beautiful, melting pot. Don't buy into this leftist narrative. The tv reporter represents the typical liberal viewpoint. Making excuses for his father's murderers. the portrayal of their friends, for example, the big guy, is ridiculous. \n\nThis is fear mongering by hollywood liberal elite. A false depiction of what these people are like and why.",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "This movie proves being racist doesn't get you anywhere in life.",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "this movie was beautiful, the plot was incredible and the ending was so fitting but so hurtful.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Wow! What a thought-provoking movie. More relevant today then ever",
            "review_date": "2020-02-15",
            "source": "rt"
        },
        {
            "content": "One of the more controversial films of 1998 this is a film that I find to be a rather glib examination of what drives a man to be a white supremacist and how he could be converted. Fortunately at the center of the film there is a very strong performance from the talented Edward Norton that makes the film worth watching. It is not that I don't think that films should explore this issue as it is important to trace what places these dangerous ideas in the minds of impressionable youths and to show that there is a way to change the views of the most corrosive members of society but sadly this film does not do so adequately.\n\nDerek Vinyard, Edward Norton, became a white supremacist as a result of his father's racist views and eventual death as a result of African-American drug dealers shooting him. He rises up through the ranks quickly in the white supremacist organization Disciples of Christ and influences his impressionable younger brother Danny, Edward Furlong, into adopting his views. He is imprisoned after murdering an African-American and while in prison his prejudices are successfully challenged by African-American inmate Lamont, Guy Torry. He changes his beliefs and is raped by other white supremacists in the prison as a result. When he is released he makes a desperate attempt to convert his younger brother, who is deeply entrenched in the organization, into a non-racist while disassociating himself from his former friends. Danny has been forced to write an essay discussing his brother after provoking his Jewish history teacher Mr. Murray, Elliott Gould, by writing about Mein Kampf. The two bond and after having a serious discussion about race relations Danny is converted and breaks free from the bonds of racism but tragedy befalls him.\n\nThe idea that a child would take on the views of their parent is certainly believable as at age ten I took on almost all of the beliefs that my father held, fortunately they were mostly about films. This film did not do enough however to establish Vinyard taking in his father's dangerous ideology as one scene in which his views on \"Native Son\" are challenged seemed too little to convince. We have previously seen Vinyard's racist rant on television and his angry attack on his teacher at a family lunch but there is more that should be there to support his transition from innocent kid to aggressive racist. There are similar issues in the film's depiction of his loss of his racist views. There is a sort of a \"Magical negro\" character who is kind to this man who hates him for no reason other than the color of his skin and seems to exist purely to educate him. One particularly laughable scene displays Norton reading a book about African-American history and nodding his head as though in acknowledgement of the fact that the author makes some good points. This is the sort of scene that makes his conversion seem like such a construct and the brevity with which it is seen is disappointing considering the fact that it is what the film turns on.\n\nThere are also issues with the way the film in some ways glamorizes white supremacy with a shot of Norton arms outstretched to the sound of gospel music in the background as he is being arrested for murdering a black man truly making him appear like a sympathetic, godlike figure. The wrong person could latch on to this film and see the supremacists as cool and alternative instead of the disgusting, prejudiced people they are. Kaye would have done better not to present Vinyard as a hagiographic figure but to film him during this period of the film as a small, detestable figure who holds no real power and deserves to be looked down upon.\n\nWhat anchors the film is Norton's impressive performance as he totally commits being utterly terrifying as the horrifying racist and surprisingly convincing as the weak young man susceptible to his father's views. Despite the poor screenplay that cuts corners where it shouldn't have he brings an intensity to the role that is necessary and he does make the story on some level believable.",
            "review_date": "2020-01-05",
            "source": "rt"
        },
        {
            "content": "Powerful message. Great acting. What more could you ask for?",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "A dark look into the 1990s rise of neo nazis in California. Which interestingly actually happened.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "A socially relevant masterpiece, needed for our times. ",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "This is a cinematic masterpiece in my opinion! It tackles a very intense topic and leaves the viewer with more questions than answers. One of Edward Norton's strongest and best performances in my opinion. A must see for lovers of cinema",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "The ending was not good based on how the story was going",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "American History X is a character study that examines what makes an American Nazi and how to overcome such thinking.\n\nThe film also examines the secondary effects that racism and racist ideology can have on others around you. We see not just the redemption of Derek Vinyard (Edward Norton) but also what his way of thinking has cost him.\n\nThe casting, pacing of the plot, and cinematography are all top-notch. Topics covered in this film are not easy to discuss and this movie will be hard to watch for some. Yet, its examination of the flaws of white supremacy and the people involved is worth the watch.\n\n4.5/5. A powerful performance by Edward Norton. One of Tony Kaye's best films.",
            "review_date": "2019-12-11",
            "source": "rt"
        },
        {
            "content": "Despite some false information about conservatives and racists, American History X is a well directed, well acted character study of a racist man.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "This is a must see 👍 👍 great movie no matter how many times you have seen it...... Classic Cult",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "8.75/10. A compelling, difficult story that rings relevant and true - for better or worse - 20 years later. Norton was wonderful - he plays the transformation of his character perfectly. Very good script, dinner table scenes being high points. Gut-wrenching but vital film.",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "This powerful film about a neo-Nazi whose life changes after serving time in prison for murder earned Edward Norton an Academy Award nomination for his performance and focuses on race relations in America.",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "Ed Norton's entire career is underrated.",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "If there ever was a movie to describe as ‘poignant', this is it. I think every white teenager should have to watch this movie (to cut off the ignorant ones at the get-go). Every time I start watching this I get hooked. Not only is it a really good watch, it's just so important. My 18 year old daughter watched it and felt the same as I did. It holds up and still delivers the exact same punch. An amazing film.",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "A simply incredible film with a STRONG performance by Edward Norton. It isn't for the weak-minded, and offers an interesting look at fractured male identity, family, and of course, racism in America.",
            "review_date": "2019-11-23",
            "source": "rt"
        },
        {
            "content": "Bit of an emotional roller coaster. Gritty piece with great acting by Edward Norton.",
            "review_date": "2019-11-20",
            "source": "rt"
        },
        {
            "content": "The fact Edward Norton didn't win the academy award for best actor for this movie still blows my mind 20yrs later",
            "review_date": "2019-11-20",
            "source": "rt"
        },
        {
            "content": "Tries to tackle racism head-on & in a raw, brutal way. But ends up treating the audience like juvenile idiots. Cheesy operatic music (screams: look at me, I'm a cool art house movie! This is meant to be a dramatic scene!) & pointless usage of slow-mo shots. Characters are caricatures. Derek Vinyard's sweeping shift from hardcore skinhead to reformed man is unrealistic & almost comical.",
            "review_date": "2019-11-19",
            "source": "rt"
        },
        {
            "content": "It helps if you have the time and patience, but it's as the critics say about it in favor.",
            "review_date": "2019-11-17",
            "source": "rt"
        },
        {
            "content": "An unnecessarily dark but incredible film carried by an absolutely flawless performance from Edward Norton.",
            "review_date": "2019-11-17",
            "source": "rt"
        },
        {
            "content": "American history x is a crime drama film that exposes the talk and looks of racism and white supremacist but along with a compelling story and superb acting from Edward Norton and the rest of the cast ",
            "review_date": "2019-11-14",
            "source": "rt"
        },
        {
            "content": "A classic that only grows more powerful with time given our current political woes. Just watched it for the first time in 5 years and each time I watch it it is more powerful and meaningful. If we all could just try to see both sides. Great film",
            "review_date": "2019-11-13",
            "source": "rt"
        },
        {
            "content": "It may not be an easy watch but American History X is a disturbing and provocative look into a dark side of America all led by a powerful yet heartbreaking performance from Edward Norton.",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "A truly beautiful film disguised as a disgusting and gut wrenching drama.  Edward Norton is a true treat to cinema",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "I like the journey of Ed Norton's character to become a better man in this.  There were many moments in this film that had me cringing because of the horrible treatment of others, the violence, and the language.  I kept wanting to ask Ed Norton's character if he gets tired of constantly hating, and it was interesting how the answer came through the story.  Some of the moments are so absurdly harsh that they were making me question if people could really be so one dimensionally discriminatory in their thinking and treatment of others, but I know some can.  I've been told that I'm racist for the silliest superficial reasons by some who really have no idea what it even means.  They've cheapened the phrase to mean absolutely nothing.  Am I perfect?  Of course not, but I know in my heart that I fundamentally like people.  This movie has some cheesy moments, and it feels a little bit dated, but I am still really glad that I watched it.  I don't think I'll ever watch it again on purpose, but I certainly think it should be appreciated as good film making.  There were many great performances in this.  Well worth my time.",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "Norton is dynamic in this film. He is ripped in the opening scenes. The movie shows a balance of racial perspectives that gives a sense of reality. It doesn't push a \"side\". It isn't heavy-handed in pushing an agenda but leading the audience to the protagonist 's quest .",
            "review_date": "2019-11-01",
            "source": "rt"
        },
        {
            "content": "What I admire about this movie is that it is one hundred percent intimate and realistic. You are always conflicting yourself when it comes to classification of the characters. Who is bad and who is good etc. Also I've read that Kaye wanted to end the film with Derek shaving his head but due to Norton's objection they passed on it, which I believe made the film better.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Fantastic movie! Great acting by Edward Norton! ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Edward Norton does a great job in performance. It is definitely very dark in its tone. They were not afraid to have as much racism and violence as possible.",
            "review_date": "2019-09-30",
            "source": "rt"
        },
        {
            "content": "A film about race and hate, that left me in self-reflection. Beautifully and stylishly delivered by the director. Possibly the greatest feats of acting I have ever seen, delivered by Edward Norton. ",
            "review_date": "2019-09-27",
            "source": "rt"
        },
        {
            "content": "As important today as ever.  A must-see film.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "This movie makes me wish Edward Norton didn't become a total d bag.",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "\" You come near my family again, I'll feed you your fucking heart\" Grim story of racism in L.A told through the eyes of Danny ( a superb Furlong) charting the rise & fall of his nazi skinhead older brother Derek ( an outstanding Oscar worthy Norton) who changes his ways after being sent to prison for murder.",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "Edward Norton is incredible. Best performance of his career. 5 star movie!",
            "review_date": "2019-08-26",
            "source": "rt"
        },
        {
            "content": "One of the best movies of 1998. Edward Norton is at his best, and leaves us with a positive message despite its disturbing scenes.",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "American History X is Hollywood foreshadowing their plan to drain the fun, satisfaction, fun dialogue, and innocence out of the movies. One title at a time. ",
            "review_date": "2019-08-01",
            "source": "rt"
        },
        {
            "content": "Just sit on your butt and watch this movie. One of the best movies of the 90's, competing with Terminator 2 and The Matrix.",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "Edward Norton does a great performance! A great cult film with great, gritty acting.",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "classic, not for children",
            "review_date": "2019-06-16",
            "source": "rt"
        },
        {
            "content": "I was totally enthralled by Norton's acting.  At one point, he's a a ranting racist, but in the flashbacks, he's totally believable as an impressionable bright young man influenced by his racist father, his friends, and the environment in which is raised.",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Kick ass movie one of the best!!",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "Ed Norton is incredible. Very good movie ",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "Edward Norton plays a skinhead who following a hate crime goes to prison. His interactions force him to reevaluate his world view. Meanwhile, his younger brother tries to emulate his Nazi ways on the outside. A thought provoking and aggressive film about race relations, prejudice, and redemption. Phenomenal performance by edward norton that is both ugly and sympathetic.",
            "review_date": "2019-04-03",
            "source": "rt"
        },
        {
            "content": "This is one of the bravest and emotionally gripping films ever made. I don't think people knew what to expect of it when it was released, which is why it wasn't a box office success. It didn't even make $7 million dollars. However, it is one of the most important films ever made with its messages of the the cycle of racism, hate, and the very difficult road to redemption. Also, make sure not to ignore Avery Brooks' sublime performance.",
            "review_date": "2019-04-01",
            "source": "rt"
        },
        {
            "content": "What a showcase to the fact that hatred does nothing but destroy. There are so many things to love about this movie: the insistence that they put blinders on and not learn about their \"enemy\" because only Protestant whites matter (considering that Christ said to love your enemies and do good to those that hate you....), the total and utter hypocrisy of Neo-Nazis and all other hate groups (which includes race-based gangs), how your actions leave a crater in the lives of your loved ones, and how blaming any race, even white people, for your circumstances just leads to victimhood and selfishness. This felt very independent politically, which was really refreshing considering the subject matter. You can't help but feel sorry for the main character and his family, despite the wrong things that he's done, but at the same time, it's important to teach that just because you decide a new path for your life does not mean life is going to get easier. In fact, it often gets harder. The price of honesty and a good conscience is hard work, and even then your past can haunt you. Amazing cinematography throughout the film, and the score was brilliant.",
            "review_date": "2019-02-18",
            "source": "rt"
        },
        {
            "content": "The best inspiring movie ever made!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "With a powerful message about racism and hate, American History X manages to create a deep emotional story that, in the midst of hope and suffering, shows the terrible reality represented by the neo-Nazi groups in the United States, becoming a complex film that leaves the viewer with a bittersweet taste for prejudice and anger.  In addition, the incredible performance of Edward Norton and his co-stars, along with the cinematography, make this film a masterpiece and a cult classic.",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "Edward Norton is great and it has a powerful opening and ending.",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "First, this is nothing more than liberal propaganda.\n\nThat said, it's a well made movie and touched me a couple of times. When the main character was exiting prison and had a conversation with his co-worker, it was touching to see his change in attitude toward those of other races and that harmony can exist between the races. I was reminded of Revelation 5:9 and how God has redeemed his children \"out of every kindred, and tongue, and people, and nation\".\n\nThe other moment was in the cafe, near the end, where the main character is placed in a position to make a decision of whether to try and better society or to take the easy route. We've all been there, and it's easy to relate to this tough spot.\n\nOtherwise, this movie was mostly misleading propaganda. They paint in an unflattering light anyone who views affirmative action as wrong, or any other programs designed to divide the races instead of unite them. For the unsuspecting and feebleminded, they'll buy into the notion that to dislike such programs is to be equivalent to a Nazi.\n\nAnother logical flaw is the conclusion of the film making the point that hate is bad. Certainly, bitterness and unwarranted hate is not good and can eat away at our souls. However, hate in and of itself is not bad. How can it be, when God himself hates (\"The Lord trieth the righteous: but the wicked and him that loveth violence his soul hateth.\" - Psalm 11:5, and others)? Hating wickedness is a good thing.\n\nHere, we have run into the primary problem with this and other Hollywood presentations...a lack of integration with biblical ideals. When we leave out the Lord's truth and wisdom, the result will be a skewed perspective which leads to more and more confusion.\n\nSociety's ills like racism, murder, affirmative action, or whatever it may be, will only be solved by the Lord Jesus Christ and his ways. This film presents problems and shows the main character attempting to walk away from the Nazi lifestyle. But leaving one evil may only mean we head for another evil. Let us do what the film never addresses...walk toward holiness and righteousness through the one who is the very definition of righteousness.",
            "review_date": "2018-12-13",
            "source": "rt"
        },
        {
            "content": "amazing movie it has a really good moral to the story and it's just amazing",
            "review_date": "2018-12-07",
            "source": "rt"
        },
        {
            "content": "A great and powerfully acted Oscar-worthy tearjerker that ends up being really more about regret and redemption than it is about racism. Edward Norton was fantastic in this film and Edward Furlong was great in it too. The acting in this film is phenomenal. I cried at the end of the film. The movie is about two brothers, one being an adult and the younger one being a teenager. The older brother, Derek, was a racist white supremacist. The younger brother, Danny, is a white teenager who looks up to his older brother who is beloved and worshiped by a ton of other racist white people. Derek grew up hating black people and Danny hops on the racist train. One night, he murders three black men invading their property outside of their house by shooting them with a pistol and kills the last one by stomping on his head when he had his mouth on the curb in the street. He gets arrested for murder and stays in prison for like six years. While he is in prison, he eventually befriends a black prisoner. When he's finally released from prison he becomes a changed man forever. He becomes subtle and tolerant towards people of all races and religions, but his younger brother is still a bigot and still sees him as he was before his arrest and looks up to him. Danny gets in trouble at school and gets sent to the principal's office for doing a history report on Mein Kempf. The report was supposed to be on someone he looks up to as a hero, but he chose Adolf Hitler as his hero in his history report. The principal (who is black) punishes him by making him redo his report on his brother instead. So Danny goes home and his brother Derek (whom he lives with) gets a phone call from the principal and hears everything about what Danny did at school.  Derek gets invited to a white supremacist party and tells Danny to stay home and do his report and not to come to the party with him. At the party, Derek eventually opens up to everyone there who worships him and looks up to him like he's some kind of god that he doesn't believe in white supremacy and white superiority anymore and that he doesn't  believe in all that racist bullshit anymore, which soon causes everyone at the party including his close friend and girlfriend disappointed in and pissed at him. Danny sneaked in the party and is even disappointed and upset about the whole tirade about Derek being tolerant of blacks and other minorities. Derek escorts Danny out of the party and explains to him everything about his time in prison and what made him change completely. After his long story ends, Danny hates it at first, but then soon changes too. Derek and Danny both go home and they get rid of all the Nazi and racist propaganda and stuff in his room. Then Danny finished typing in and printing out his report. The next day at school, Danny gets shot dead by one of the black teenagers who was related to one of the black men who was murdered by his brother. Derek comes in and discovers Danny's bloody body in the bathroom and cries and morns for his brother while feeling guilt. One of the most emotional endings in film history.\n\nRating: 8.9/10",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "This film was great!",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "\"American History X\" is a crime and coming of age film, produced by Tony Kaye. Tony Kaye has only produced five movies his entire life, all rated over a six out of ten. \"American History X\" was his very first movie, made in 1998 in Los Angeles, California. Not only did he direct it he also did the cinematography. In the film, it presents a glimpse of what white supremacist looked like around the 90's. Showing a transition between black and white for the past and color for the present. Main characters Derek Vinyard (Edward Norton) and his younger brother Danny Vinyard (Edward Furlong) not only played great roles but staying in character was their best part. Derek started a neo-nazi skinhead group, violating and discriminating any other race that came in their way, then follows the incarceration of Derek from an incident involving two African American males. The transition following his imprisonment included ironically befriending an African American male. Finally realizing he doesn't want to be a part of that lifestyle any longer, he finds himself trying to save his brother from becoming what he once was. He struggles daily with his past decisions, hoping to bring his family out of it. During the foreseeable yet tragic ending, with only a few minutes left of the film, Kaye ended it with heartfelt instrumental music and the view of a sunset on California's beach. I feel it should have ended differently, but where it stands shocks everyone. Giving it a sad, yet comforting mood. Creating a satisfying, and heartbreaking film, rating this movie an eight out of ten.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "Historia americana X es uno de las mejores actuaciones de Edwar norton y una de las mejores puestas en escena del director Tony Kaye ,que logra crear este magnifico film de culto , como carta de amor al cine.",
            "review_date": "2018-10-24",
            "source": "rt"
        },
        {
            "content": "A most provocative and devastating film that's seared into my memory.",
            "review_date": "2018-10-09",
            "source": "rt"
        },
        {
            "content": "Ed Norton is great in compelling drama.",
            "review_date": "2018-09-24",
            "source": "rt"
        },
        {
            "content": "This movie, for me, highlights just how versatile and convincing Edward Norton can be. To quote a critic of this movie \"Though well-intentioned, turns out to be a simplistic and unconvincing look at a serious problem.\". I would not have used the word \"unconvincing\" there.  Yes this is a simplistic look on what seems an ageless problem, but that's just it; this movie captures one very narrow angle of a huge and complex problem. This it does extremely well.",
            "review_date": "2018-09-20",
            "source": "rt"
        },
        {
            "content": "American History X is at its best when it's following the protagonist's change in those highly effective prison sequences with his friendship with a black man being the highlight. It's also terrific in its brotherly relationship, important in its story and very well paced and shot throughout. But Edward Norton was never believable to me as a neo-Nazi skinhead. He becomes better and very good in the second half, but in the first half he evidently struggled. The film is also never as sophisticated in its dialogue as the script demanded leading to a very good film that unfortunately never reaches greatness.",
            "review_date": "2018-08-24",
            "source": "rt"
        },
        {
            "content": "American History X has one of the most compelling stories I've seen in movies in a while. It's a gut-wrenching, and heartbreaking story. But Tony Kaye's powerful and challenging direction is what made the movie so provocative.\n\nThe movie also proves that Edward Norton has a huge talent that, unfortunately, has been wasted. Norton delivered the performance of his career in this movie. A performance that elevated the entire movie. While Derek Vinyard, Norton's character, has the most powerful lines in the movie, they wouldn't have been as powerful as they are without Edward Norton's staggering delivering.\n\nAlso, Edward Norton's performance may be the only thing that remained sharp and solid throughout the whole movie. Because aside from Norton's riveting and smart monologues, the dialogue in this movie, especially at the first two acts, is so weak and often cheesy! The things got better at the last act but at that time I was wondering why the dialogue wasn't that good most of the movie. It's really baffling because the movie needed badly to have a decent and strong dialogue from its beginning, considering its subject matter. The dialogue often was too on the nose and preachy while it should have served its already gripping story. That also made some scenes in the movie feel so awkward and heavy-handed.\n\nThe dialogue isn't the only, or the biggest issue I've with American History X. As I think that everything related to the Neo Nazi gang is completely underdeveloped. All the characters of the members of this gang are one-dimensional characters. They are totally undeveloped and bland, and almost have no depth. Which is a shame because they play a pivotal part in the story. They are part of the main plot, so to speak.\n\nBesides that balancing between two contradictory aspects of the story, Tony Kaye with his mixture of black & white history contrasting with colorful reality is magic to absorb and shows this film up to be what it is. Smoothly moving camera in the scenes in Black and White that are set in the past to convey an unsettling feeling, and bleak and restrained colored scenes to match the dystopian-like present.\n\nAmerican History X also has one of the most shocking endings ever. But its ambiguity is what makes it more dreadful. It's an ending that can make you question the protagonist's fate, and that's more than horrifying!\n\n(8/10)",
            "review_date": "2018-08-24",
            "source": "rt"
        },
        {
            "content": "Edward Norton gives a great performance.\nGreat. Just great...",
            "review_date": "2018-08-12",
            "source": "rt"
        },
        {
            "content": "Only major flaw is in the shower scene after he's done the guys got a floppy wiener non realistic however good film anyways",
            "review_date": "2018-08-11",
            "source": "rt"
        },
        {
            "content": "simply astonishing....",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "This movie is a grusome and violent tale about hatred, confusion, consequences and redemption. Edward Norton in what is considerd by me as one of the best individual performences of all time created this voilent, scary but also somewhat charismatic and humam character is a big factor of why this movie is so powerful.",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "Hunting and movieng tale about how hatered can change a person. Performance of Edward Norton should be enought to keep you in front of the screen as you witness change of his character.",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "A movie that is insightful of how racism is created, but it also shows the descent that racism can cause. A well acted movie that has a very strong message.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "A must watch. Edward Norton kills it!",
            "review_date": "2018-07-04",
            "source": "rt"
        },
        {
            "content": "6 stars. This should be 100%.the only thing holding it back is the subject matter,which is a challenging thing to overcome. This movie is brilliant. Holds up to time. Mane over thing wrong with it.",
            "review_date": "2018-06-24",
            "source": "rt"
        },
        {
            "content": "Great movie starring Edward Norton about neo Nazis in America. I don't know what to say about this movie except it's crazy good.",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "These films should be watched in all schools.",
            "review_date": "2018-05-19",
            "source": "rt"
        },
        {
            "content": "Excellent!!!   Edward Norton shows his true acting skills in this movie!",
            "review_date": "2018-05-04",
            "source": "rt"
        },
        {
            "content": "American History X had to walk a fine line. It’s telling a story where it would be easy to make despicable people appear sympathetic. It focuses in on a neo-Nazi and tells how the events in his life filled him with hate, and how his hate has affected his family and friends. The big relationship in the film is between this man and his younger brother who idolizes him and wants to follow in his footsteps. I thought they did an admirable job of making it clear that the ideals these boys were fighting for are awful, but they themselves are not pure evil and might have some good in them. I didn’t like how they setup this plot point, though. The weird writing assignment that started the whole story was kind of odd and felt forced. I just didn’t think it fit with the structure of the film. Edward Norton was superb as he always tends to be when he commits to a role. There are at least 3 or 4 different stages in the journey of this character that he has to portray and I think he nails them all. From the beginning when he’s pure rage, to the flashbacks where he’s somewhat innocent, and then the later scenes where he’s repentant, you can track that journey without it being an open topic of discussion. He makes it all clear through his behavior. Edward Furlong is also amazing as the younger brother. He hits that perfect balance of presenting himself as an adult who has his mind made up and is in control of everything, but also betraying an underlying innocence that shows he’s only following others down a path and hasn’t truly decided for himself. The artistic choice of using black-and-white for flashbacks and color for the present day scenes worked for me also. It spoke to the changing mindset of Norton’s character, and also made those flashbacks feel grittier. I found this movie engaging and authentic, but also hard to watch. It goes on the list of films that I respect, but I can’t imagine sitting through it again. It’s not that the story is structured poorly or that it was boring, nothing that would typically keep me away from re-watching a movie. In this case it’s just the fact that many of the events are depressing and the ideals we see espoused are hard to swallow. American History X is a solid film, and I think the point it makes is one we all need to hear. But I’ve heard it once now, and I don’t need to go through that again.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "After neo-Nazi Derek is imprisoned for killing two black men who were trying to steal his car he releases what a monster he one was and tries to stop his younger brother going down the same path.\nThe acting in this film is excellent across the board and it's easy to see why Edward Norton was nominated for an Oscar in this role. He puts in an amazingly convincing performance as Derek, this vile, hateful white supremacist. Then when the character is broken down and tries to become a better person, he shows layer upon layer of damage and vulnerability that lies underneath. Edward Furlong puts in a good performance as Danny, Derek's impressionable, younger brother who idolises Derek but is also manipulated by Cameron Alexander, played by Stacy Keach, into doing his dirty work. Beverly D'Angelo is also excellent as Doris, Derek's mother and the progression of her character from flash back to present day is well played.\nThis is a very brutal and sometimes difficult to watch film that explores the cycle of hatred and how racism can be spread and passed down through generations. However because it doesn't mince its words the film's message is that much more potent and impactful on the audience. The cinematography is also excellent and the use of black and white in the flash backs adds another dimension to an issue that is most certainly grey. \n\nI would certainly recommend this film as the issues it tackles are still very relevant to this day.",
            "review_date": "2018-04-25",
            "source": "rt"
        },
        {
            "content": "An absolutely fascinating movie, in the vein of La Haine.\n\nThese two feel like twin movies to me, tackling these fascinating and difficult subjects in some of the most interesting ways I've seen.\n\nI loved the structure of the story, the way it was built and peeled back layer by layer. I was hooked instantly. It could've been so much plainer if we had followed Derek's story from its conception, but having it turned into this life analysis from Danny's point of view was a very smart decision. It helped keep the movie's pace going, helped me as a viewer stay at attention. I wanted to get down to Derek's core.\n\nEdward Norton reminded me in this performance why I love him so much as an actor. Beautiful act, very raw and honest. A lot of moments of brilliance. The only slightly awkward part for me was when he was holding Danny's dead body and bawling his eyes out. His grimace kind of looked like laughter but with the sound switched to crying. Maybe that's just how his crying face looks like, but it felt a little awkward to me. Not a big point.\n\nEverybody else fit their role well. The mother's Jewish boyfriend acted in a surprisingly subdued way, considering the role. Sweeney's actor was fantastic. The laundry guy, Lamont, stole the show during his scenes. He did great.\n\nMovie was shot in a pretty decent way for the most part, with some amazing moments of brilliance. The editing was a standout, the music was alright, although a bit too in your face at times. Could've been a little subtler.\n\nIt was a brilliant look into this painful twisted world, it felt honest and very human. Felt intelligent in its depiction of every side of the story.\n\nThe standout moment for me was the part where Derek walks Danny in the morning to his school. The entire sequence is just amazingly orchestrated. Tension builds and builds, you scan the background behind them to spot incoming danger, and then the camera starts narrowing down and zooming onto the faces of Derek and Danny while you're on the edge, unable to see if there's any danger. It's obvious that something will happen, but the time leading up to it is an amazing ride. I thought to myself that I wish it didn't happen, but then it wouldn't be as good of a story. So well done.\n\nAmazing movie, highly recommended.",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "i watched this again and i realized that its a really good story. i loved the ending",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "While scrolling through IMDb, I stumbled across American History X. Intrigued by the plot summary, I decided to watch the movie with high expectations. Those high expectations were shattered with the incredible acting, heart wrenching, and soul churning scenes that unfold. This movie is extraordinary in every aspect. I enjoyed every aspect of the movie and would watch it again. The ending takes a stab into the viewers emotions, showing us the untimely death of our would-be protagonist. The scene only worsens when Derek rushes to the school and finds his younger brother lying dead in the urinal. The screams, shrieks, and cries from Derek nearly brought me to tears. The journey he had undergone, though revolutionary, was not enough to save his younger brother from the fate that was already sealed from following in his path of being a Neo-Nazi.\n\nThe journey that is shown throughout the movie, switching from black and white to color, beautifully shows the outlook on life which Derek abides by, separating those who are not White Protestants from anyone else. The color change is extraordinary to convey his character transformation.\n\nThe ending, as stated before, is one of the best scenes in the movie, pulling at the heart strings of the reader. Danny's fate is sealed once he blows the puff of smoke into the face of the African American student. This fate was carried out by Danny by worshiping the actions and ideology in which his older brother, Derek, dominated.\n\nThe opening scene of the car robbery set the mood for the rest of the movie, not pulling back any punches when it came to brutality. The opening scene, however, also showed the contempt that Danny has for the final actions of Derek. Derek's murder of two African American men attempting to break into his car changed Danny forever. This change, however, is suppressed by Danny in order to be more like his brother. When Danny discovers the massive change in Derek, his frustration is let out by pushing him against a garage many times. This anger seems to be coming from the confusion Danny now faces on whether to follow his brother again or stick to what he made himself believe.\n\nAll in all, this is an amazing movie and I would recommend this to any friend.",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "Intense, but worth it ",
            "review_date": "2018-03-08",
            "source": "rt"
        },
        {
            "content": "Such an incredible sad movie. One of the best movies of all time. I highly recommend it. Great movie!",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "A dark comedy that tries to convey the message that racism is evil and yet does everything in it's power to make its audience a racist.",
            "review_date": "2018-02-16",
            "source": "rt"
        },
        {
            "content": "With great screenplay, American History X is one of the most serious and hair-raising films of the 90's. There are very few films, if any, that address the topic of racism in such a way. A definite must-see for anyone regardless of race.",
            "review_date": "2018-02-14",
            "source": "rt"
        },
        {
            "content": "American History X: With an impressive preformance from Edward Nortan and sharp political allegory that's as strong and relevant as it is today, American History X is an uncomfortable, coming of age masterpeice.",
            "review_date": "2018-02-07",
            "source": "rt"
        },
        {
            "content": "A touching and brutal look into the Neo-Nazi mindset.\n\nEdward Norton and Edward Furlong are fantastic as Neo-Nazis. Norton gives off such raw emotion whether he is dictating an enraged Nazi propaganda speech to skinheads, telling his family his racial ideologies, or speaking to his brother about what he's learned. Norton clearly wants to ask you: \"Can Neo-Nazis reform? Can they change?\" At least, he shows you how they can come into being Nazis.\n\nAmerican History X is so powerful. It really speaks to the troubles we face even today. American History X paints a picture of how family, income, and one's outlook can depict and nurture or twist and warp someone into a hateful being. You get the background, the formation of a hate group, the people influencing them, the people that are trying to help these Nazis, and the few that may sincerely change and wake up from their hateful slumber.\n\nThe film itself is beautifully shot, switching from black and white sequences of the past that depict how this family fell apart. Then in color and gorgeous cinematography, how Edward Norton must take his family back and try to cut ties off of the white supremacist Neo-Nazis. It's all intense and suspenseful throughout, while also has brutal depictions of a very harsh life. Check American History X out for insights into our current era of hate and racially tense times. You might just learn something about yourself or at least see how others think.",
            "review_date": "2018-01-31",
            "source": "rt"
        },
        {
            "content": "A film you really think about all day after seeing it. ",
            "review_date": "2018-01-26",
            "source": "rt"
        },
        {
            "content": "American History X (1998) ???\nFrighteningly believable performance by Norton anchors (and single-handedly carries) this compelling drama about furious, hateful ex-prisoner now eager to keep younger brother from terrible life style he went through.  A slideshow of innovative technical achievements, startling insights on lives in California, bravura acting by Edward; only flaw is eventually winding up a bit too \"neat and tidy\".  Still a powerful and commanding presentation.",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "American History X is an amazing and brilliant film with a beautiful message. This is also easily Ed Norton's best performance thus far, which raises the question, why hasn't he won any Oscar yet?",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "American History X: With an impressive preformance from Edward Nortan and sharp political allegory that's as strong and relevant as it is today, American History X is an uncomfortable, coming of age masterpeice.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "Such a great movie with such an impact and the strongest acting, American History X has scenes you wont forget about and a great ending. \nAmerican History X masterfully shows the life of Derek Vinyard as a neo nazi and a changed person, through black and white. The performance that Edward Furlong gives is almost as memorable as John Connor.\nOverall, this movie is a 5 star.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "Structured around the two central leads, all thoughts and idea are being absorbed from them, a lot are awfully wrong but others have some real purpose behind them. They reinforce the characters plenty to get a more impactful dialogue. It all just had to lead up to that fateful finale that involves an unforeseen and yet almost far-fetched scenario. It leaves you to wonder why it really happened.",
            "review_date": "2017-10-21",
            "source": "rt"
        },
        {
            "content": "Gripping and brutal led by an unbelievably realistic portrayal by Edward norton",
            "review_date": "2017-08-16",
            "source": "rt"
        },
        {
            "content": "Didn't rewatch so fudging the rating, donated the VHS",
            "review_date": "2017-08-02",
            "source": "rt"
        },
        {
            "content": "Great performance by Norton. Despite being made 18 years ago, subject matter remains very relevant now.",
            "review_date": "2017-07-24",
            "source": "rt"
        },
        {
            "content": "Awsome movie... one of edward nortons bests imo",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "An intelligent and well-constructed piece of drama.",
            "review_date": "2017-07-13",
            "source": "rt"
        },
        {
            "content": "American History x of beginning already cemeça with one of the best scenes already seen in black and white (spectacular), for me the whole movie would be like that, it was spectacular in this way, the soundtrack, although not remarkable, does an exceptional job, Delivery what is being proposed in the environment, fear and tension are examples; The script is able to deliver a great story, as the name already says: American History, in the simplest form is a film of American society, but in the way that some do not accept diversity, equality. Edward Norton is in one of the best jobs of his career (if not the best); The film at the beginning proposes an idea, but from a certain point it shows that it is there for something else, a beautiful work of a script well written, I have to praise the script and much; What a story, I swear that in the end it surprised me; Because although I already expected that I did not expect it that way, although there are colorful scenes that stand out even in black and white, I have already praised it once and I will continue to praise the way the black and white scenes became sensational, if The whole movie was in this way would only improve this great work that deserves to be recognized. At the end of it all that guy who people did not believe that would change changed and everything because he saw the other side of the coin, saw that all are equal and despite everything some day we can depend on that person we do not like, we hate and among them we One can see the trust and other things that we do not see in those we treat equally just because they are of the same color; American History x is a work of art and undoubtedly one of the best movies I have ever seen!",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "Ripe with powerful performances, a frontal approach to racism, and an overall strong execution of cinematic techniques (simple ideas used effectively) make American History X essential viewing for contemporary film.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "Edward is hot. 6 stars.",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "Part of the most provocative movie I've ever seen, American Hisroty X is a powerful, very moving and captivating film, Tony Kaye has done a fantastic job, although it wouldn't be the great film we all know if it wasn't for Edward Norton. It's really balls-to-the-walls film, not one that you everyday, but that's what makes it one of the best pics ever in cinema history. Recommended !!",
            "review_date": "2017-03-16",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "Easily one of the most powerful movies of all time. You don't have to be a critic to see that.",
            "review_date": "2017-01-26",
            "source": "rt"
        },
        {
            "content": "One of best movies that is have ever seen",
            "review_date": "2017-01-23",
            "source": "rt"
        },
        {
            "content": "I felt as if Derek's process of moving away from hate was oversimplified and could have been developed more. That being said, this is an insanely engaging and brutally honest take on race relations -- the most 2016 movie of the 20th century.",
            "review_date": "2017-01-18",
            "source": "rt"
        },
        {
            "content": "A very overrated tear jerker. The movie is very preachy and his and his brother's change is way too quick.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "American History X Provides insight of racism, propaganda, and has Edward Norton in his greatest performance with Edward Furlong in the running. The film has also been relevant to this day",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "In 2016, I repeatedly watched legions of Americans, mostly whites, embrace and/or ignore Donald Trump's inflammatory rhetoric that dehumanized everyone who was not a white heterosexual man, and we rewarded him with the title of President of the United States. This tragedy reinforces the idea that Americans, and frankly humans, continue to fear what they do not understand, therefore cultivating unnecessarily harmful tension that frequently leads to conflict. This conflict makes us no different than our primitive descendants, and it undermines our potential to make the world a better place. I firmly believe American History X is a beacon of hope America needs to eventually overcome its racial divide, despite a President who will always fly the \"woe is the white race\" flag. \n\nThe film's backbone is unquestionably Edward Norton's performance as Derek Vinyard, a despicable and morally repugnant neo-Nazi who undergoes a believably human transformation. His unflinching and versatile performance gives credence to every line of dialogue and every action in every scene, which elevates all the performances in the film's supporting cast. As a result, I bought Vinyard's history and every interaction he has with his family, particularly his relationship with his younger brother.  I firmly believe Norton's performance is so outstanding that it is among  the five greatest performances of all-time. \n\nHowever, Norton's performance would not have been nearly as impactful if Tony Kaye's storytelling felt like a structured narrative. Though it is not nearly as experiential as Moonlight, I became emotionally attached to the characters because I concurrently bought them as people and the complicated world they all inhabited. Whomever accuses the film of being preachy or heavy-handed is simply not recognizing that its message organically arises vicariously through its characters during their transformations, particularly the Vinyard brothers. Last, but not least, I absolutely love that there is a particular line of dialogue that suggest Derek has not gone completely to the other side of the moral spectrum, which highlights the time and understanding it takes to ultimately get there. \n\nLast, but not least, I love that Tony Kaye chose to tint the flashback sequences black-and-white and the present sequences in color. The gimmick works tremendously because not only does it clearly illustrate what happens in the past and present, but it also illustrates how all the characters look at racism in those moments in time. Contrary to popular belief, race is unquestionably the most complicated issue that has plagued human history, yet we, especially Americans, continually try to categorically break it down into good and bad and/or right and wrong.  \n\nAs much as I love this film, I have a few quibbles with it. First, there are a couple scenes that have unnecessary exposition, both dialogue and voiceover. Second, there are a few times when Kaye uses a medium close-up instead of a regular close-up to show a character's reaction, though I understand why he chose to do so. Last, there is one scene where the rhetoric could have been toned down to dramatically play up the rhetoric's impact on a certain character.   \n\nOverall, this is an emotionally riveting film that tactfully dissects race and explores how hatred undermines and eventually destroys understanding on an interpersonal, a familial and a societal level. Most importantly, it demonstrates how anyone, no matter how racially insensitive, can redeem themselves from those harmful beliefs by simply exposing themselves to different people in different cultures in an open-minded effort to understand those people and their cultural backgrounds. \n\nThis film reminded me to not give up on Donald Trump and his ardent supporters because if we give up on them, then they will have no desire to change, which will only make the world a harsher and more violent place to live.",
            "review_date": "2017-01-02",
            "source": "rt"
        },
        {
            "content": "You will never meet anyone who didn't like this movie.",
            "review_date": "2016-12-27",
            "source": "rt"
        },
        {
            "content": "Often disturbing and downright grim at times but absolutely brilliant because of it. Edward Norton is absolutely superb and gives an believable turn as a  white supremacist.   Let down only slightly by occasionally heavy handed cinematography (why all those shots of the sea?) and a cliché heavy script.  I was going to call it utterly predictable as well but that misconception was proven very wrong.",
            "review_date": "2016-12-22",
            "source": "rt"
        },
        {
            "content": "Se me despertó la sensibilidad cuando narran su tiempo en prisión, pasada la primera hora. La evolución de su trato con el negro de las sábanas es mágica. Norton es genial hasta justo antes del final en el baño. 4/10",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "Una película bastante bien llevada con una cierta crítica a la sociedad estadounidense.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time, a must see!",
            "review_date": "2016-12-14",
            "source": "rt"
        },
        {
            "content": "Truly an eye-opening experience, and I emphasize the word experience. This film makes you work to get to the ending. It harms your eyes with disturbing grit of the harsh reality that is America. White supremacy: the side of the country we do not want to see and should leave behind unfortunately it is still here and eating us from the inside out and what does it do for us? Nothing. That's the kind of message this film delivers to those who can make it through it. Marked by excellent, career making performances by Ed Norton and Edward Furlong \"American History X\" stands alone as a modern masterpiece in film.",
            "review_date": "2016-12-12",
            "source": "rt"
        },
        {
            "content": "Everyone should see this movie, again or for the first time, in this new Trump-Nazi world we live in now. Beautiful movie!",
            "review_date": "2016-11-23",
            "source": "rt"
        },
        {
            "content": "American History X is an American crime dram film, about a former neo-nazi skinhead, who tries to prevent his brother from going down the same wrong path he did. It's lead by an intense and electrifying performance by Edward Norton, competent direction, and a competent screenplay. It's has issues but they're not so major that they hold back the film. The direction is good, but it's nothing specIal, and the film is neither great nor bad to look at. The screenplay is good, and it has it's moments. It has great dialogue, and four standout scenes, but the rest of it falls short and/or flat, and some character development for Norton's character was missing. There were some pacing problems, and there were some narration scenes. Edward Norton's narration was good, but the narration by Edward Furlong (His younger brother) felt boring. An aspect I liked a lot was the black and white used during flashback sequences, and the color used in present day scenes. I think it emphasized well Norton's change and development as a character. Overall this film is good, and while it does have issues, I think it's worth watching and its worth your time.",
            "review_date": "2016-11-14",
            "source": "rt"
        },
        {
            "content": "Emotional and real, you owe it to yourself to see this movie, because it represents many issues with this country and how a man can change himself",
            "review_date": "2016-11-10",
            "source": "rt"
        },
        {
            "content": "Edward Norton sears the screen in this compelling drama showing a rarely dude if the coin with white supremacist groups, and that is humanizing them in a sense. It's a very fine line to walk, but the film does an excellent job of exposing the deep flaws in these organizations while giving us characters that are strangely relatable and likable. The very touchy subject matter is handled very professionally, it gives believable reasons why one would join a group like this, and then turn away from it so quickly after building an entire lifestyle around it. The ending truly shocked me, and I found myself feeling much more for these characters than I expected to. My main issues is that the film does take its time, and that it is filled with a ton of exposition, which works really well, but does make me wish it would return to the present time. I also wish there was a little more focus on the African American groups in the film than there was",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "\"American History X\" can be simply defined as it's own. It delivers multiple and intertwining messages about as powerful as I've ever seen a film. It opens your eyes to the subject of racism and how violent humans can be at times. However, it is unclear of what the main purpose of the film is because there is so many. Is it racism? Is it the use of violence to make inhuman points? Is it the bond between two brothers? When we want a film to express certain themes, they need to do it in a balanced and organized fashion. American History X is distinguished by it's incredible performances, but fails to give a clear message of why we are really watching it.",
            "review_date": "2016-10-20",
            "source": "rt"
        },
        {
            "content": "\"American Hystory X\" has a message to us through, and for me, this message is passed by the best possible manner, the shock, seen here redemption of Derek, a neo-Nazi who has his ideology put to the test when it is forced to live with the differences, but do not expect here a cute little redemption movie with flowers and fragrant, to where one side is wrong and the other is good, no, here they all are at the mercy of anger at the opposite, not even understand why, Tony Kayne, director of very few movies, tries to show the danger of an ideology, a thought, is white Latinos and blacks hating without any justification or blacks who always have to behave like bandits, is a basquetes game or reckoning, the film criticizes, criticizes and beat up, he is extremely violent, but hardly has blood in it, because its violence is far beyond just the physical. In terms of technical aspects Kayne's great to show the Flashbacks of our protagonist in black and white, and highlight the timeline, he wants to make us remember World War II, meaning that all such discrimination is a thing of the past, and narrative off of Danny and the family unit is great, because if we saw the film without these two aspects we do not apegaríamos Derek, on the contrary, we'd hate, and hate is the opposite of what the film wants to preach, we we can not agree with Derek, but if we hate, we are not very different, the soundtrack is accurate, the picture is beautiful, especially in black and white times, the script is extremely intelligent, but leave some loose ends, and the performances are all great, especially Edward Norton, who is a great actor, but unlike the majority of his other films where he has a submissive and apathetic performance, not here, he is threatening, you really afraid, and yet he can pass the dramatic side, this is certainly one of the greatest performances of his career. Finally, the film is much more than a story of racism, the film deals with the human being, but outside the film's message, its technical aspects are amazing, it is a film that everyone should see.",
            "review_date": "2016-10-15",
            "source": "rt"
        },
        {
            "content": "I first watched this in my philosophy class at school & I was shocked by how good it was! Racism is such an important topic & was used extremely well in the film! I thought the black & white sequences were brilliant & Edward Norton did an outstanding job as the lead!",
            "review_date": "2016-09-30",
            "source": "rt"
        },
        {
            "content": "One of the best performances from Edward Norton leads this thought-provoking and engaging story that digs into the processes that bring men to become racists, as well as into those that defeat racism.",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "Great thought provoking movie",
            "review_date": "2016-09-13",
            "source": "rt"
        },
        {
            "content": "A shitty-ass movie made amazing by virtue of Ed Norton's delivering one of the best performances of the decade.",
            "review_date": "2016-09-03",
            "source": "rt"
        },
        {
            "content": "Can we talk about the two Edwards that I think carried the entire film? Of course the whole cast was amazing and wonderful and extremely talented but the lead, Edward Norton played Derek in the best way possible. I'm really shocked by the turns this movie took, but I'm really glad I got to watch this now as I think it is really close to the current situation in the world. I'm sad, shocked, disgusted, tired and I really want some change, a change I think will never come in our lifetime. It's something in the human nature I think, this thirst of power and I can only hope it will die down a bit. Till then, keep an open mind and don't let yourself drown in hate. Hate, as the movie depicted, is to blaim for everything. A really amazing movie that I chose to watch the perfect time.",
            "review_date": "2016-08-27",
            "source": "rt"
        },
        {
            "content": "'American History X' may be Edward Norton's best work as he conveys the poison of hatred so well.",
            "review_date": "2016-08-20",
            "source": "rt"
        },
        {
            "content": "The years Edward Norton was on fire.",
            "review_date": "2016-08-13",
            "source": "rt"
        },
        {
            "content": "This is best drama.. you get in the emotional... so intense... people can change if you getting better",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "Edward Norton is outstanding in this film. This film will go down as one of the greatest in history because of how powerful the message in this movie is. I have never met someone that did not like this film. Everyone should go and watch because it is truly emmontional and heartbreaking. Also very important that everybody watch this so that everyone can accept other people's opinion and not get called a rasict or a bigot just for supporting a certain presidential candidate. Hate is a viscous cycle and we can not continue to give into it.",
            "review_date": "2016-07-26",
            "source": "rt"
        },
        {
            "content": "Backed by Edward Norton's incredible performance, the film's message is both powerful and not preachy.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "One of the greatest films ever made",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "Great story with fantastic characters",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "THIS IS A CLASSIC AND A MUST SEE MOVIE. It's smart and has a great story I loved this movie it has no flaws it's so good I recommend it go watch it on Netflix",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "Amazing. The performances in this movie... Amazing!",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "Required viewing for every person who is a human.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "Despite the very extreme content and message, this controversial movie will leave you thinking about your own feelings and actions at the end of the film. The film depicts a former neo-nazi skinhead in southern California trying to prevent his younger brother from going down the same wrong path he did. Edward Norton gives arguably the best performance of his career in this film. No matter how many times you see this film it seems to leave you in a state of shock and self reflection. The director filmed all flashback scenes in black & white and does an amazing job stylistically in this film. An absolute must see.",
            "review_date": "2016-06-22",
            "source": "rt"
        },
        {
            "content": "For the most part I quite enjoyed this film. But there is a genuinely contrived angle to the story and characters that just doesn't ring true. I watched it for the second time tonight, the first being at the cinema upon its initial release. And the thing that really stuck with me is what a great movie this would be for young teenagers who would most likely fall under its spell. Well intentioned and certainly not bad, but by no means a classic",
            "review_date": "2016-06-07",
            "source": "rt"
        },
        {
            "content": "One of the most gripping and best movies you'll ever see. Ed Norton's performance is incredibly powerful.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "This is my #1 movie of all times.  I actually watched an off chronological version of this movie when I rented many years ago from a $1.00 VHS store.  I thought the chronological version (rather than jumping from present into past and back) version was much more powerful than the theatrical version; however, I could never find that chronological version for a purchase.  It is a very powerful and emotional movie.  I am always interested in how little things or life events define who we are, and this is a movie about that...  To me, this is one of the best movies every made.",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "American History X is directed by Tony Kaye, and it stars Edward Norton and Edward Furlong in a drama film about 2 brothers where one is already a neo-Nazi who got out of prison, and another who is turning into one and is walking in his brother's footsteps. I honestly didn't get to see the original version as I got the edited one in high school, so I'm not gonna see about how brutal it was. Even so for what I watch of it, American History X is a fantastic film that really did a good job of making me feel sorry for a neo-Nazi. Edward Norton give a fantastic performance that I'm glad that he got nominated, even though I wished that he was the winner. Edward Furlong does a great job too as a kid actor, and I like the characters, even if they are complete jerks in this. The writing by David McKenna is well written, and even if it was edited, there are some brutal moments in this still that are a bit hard to watch. I did like that it's about two brothers as I got to know a lot about them two, especially with their conversations as they have good chemistry as brothers. If I get to watch it American History X again but the original version this time, I'll definitely watch it again.",
            "review_date": "2016-05-12",
            "source": "rt"
        },
        {
            "content": "A brutal story and sublime performance from Ed Norton power this great film.",
            "review_date": "2016-05-12",
            "source": "rt"
        },
        {
            "content": "A true masterpiece of storytelling",
            "review_date": "2016-05-05",
            "source": "rt"
        },
        {
            "content": "An Incredible story, following the journey of a Neo Natzi, inside the american Los Angeles culture. Edwards transformation across the film is not only artistically stunning but it leaves you bitting your fingernails to nubs. The following ensemble support this brilliant piece in showing off a true cultural epiphany. A film that you must see!",
            "review_date": "2016-04-21",
            "source": "rt"
        },
        {
            "content": "Any film that engages with issues as sensitive as neo-Nazism and racism\nhave to either go hard or go home. American History X definitely goes\nhard. It is absolutely relentless in its depictions of violence. It\nforces the viewer to confront the harsh realities of experiencing\nracial abuse as a black person. There's no hiding from it in this film.\n\nEdward Norton was great in the lead role. Whilst his character is\ninitially a disgusting man, his transformation and story arc were\nbelievable. That being said, I don't think that Edward Furlong was\nanything special.\n\nRead my full review here: http://goo.gl/6AJGpx",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "This controversial movie boasts one of Edward Norton best ever performances and symbolises change for the better, showing that anyone can change. Some of the viewing is uncomfortable to watch but it is 100% necessary as we watch the lead character go on a mental and physical journey for criminal to hero.",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "Interesting movie, manipulative ending. Shame they took the director's movie away from him in the 11th hour.",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "Awesome performance by Ed Norton. This movie will have you thinking about it for days after seeing. Compelling in showing how Hate breeds more Hate. Shows how our prejudices and hate are learned behaviors and in the end makes no one feel better about their lives.",
            "review_date": "2016-03-19",
            "source": "rt"
        },
        {
            "content": "\"Hate is baggage. Life's too short to be pissed off all the time. It's just not worth it\"\nPowerful movie.",
            "review_date": "2016-03-03",
            "source": "rt"
        },
        {
            "content": "A very emotional and brave movie! A must watch!",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "A superb performance by Edward Norton in a quite provocative movie on the never ending subject of racism in USA.",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "There is no doubt, the film is in for a powerful message which is much more relevant to America than to me but it's not all that \"Great\" which I was led to believe prior to the viewing. The jail sequences (the transition period) were by far the best and most powerful in the whole movie. Other than that it was a mixed bag with more good apples than bad ones.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "Best movie made about racism!",
            "review_date": "2016-02-10",
            "source": "rt"
        },
        {
            "content": "the best movie ever, Norton is an amazing actor, is my favorite",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "A very powerful film that shows a lot of emotion and energy.  Edward Norton is brilliant in this film.  This is a must watch for anyone.",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "Indeed, one of the best. This is a story about racial hate, the typical white vs black scenario. The film entirely revolves around the story of the two brothers, encased in hate towards other race. The pace of the story doesn't feel rushed at all; you can follow through every line and understand it very easily. As I say, it's a smooth sail from beginning to end. The acting was also great; you can see and feel their emotions at the same time, especially the two brothers. From the feeling of rage and confusion to the road of enlightenment, I can say it was perfect. The black and white scene of the past on cinematography is also beautiful. For me, it's not just a black and white color theme of the past; it is a view of what they actually see, how dark it is. It's just like you see, my past is grim, it's not that colorful unlike others, but it continue to hunt me and live within me every day. I can't throw it away easily and through time, it molded me. That's what I feel when watching it, the moment I feel myself to the characters, that's the moment I can say that this is an excellent movie. I will not make this long, to sum it up, overall, this is a great movie and you should watch it. That's all, Badum Tss!",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "Like the academy-award winning film, 'Crash', this film deals with the racial hate in america. But unlike 'Crash', 'American History X' showcases the inner struggle of a racist man and how humans can become racist in the first place and most importantly, how humans can change for the better. Edward Norton gives an amazing performance and somehow makes us empathize with him even though he is an extremely racist gang leader with a large Nazi symbol over his heart. If I had to say something bad about this movie, the music can be a little cheesy at points, especially with all the slow-motion, and that the cinematography was a bit annoying to watch at points. Whether is be axis jumps, awkward close-ups or just weird choices, it's hard to explain but, I don't know... But if the characters are interesting and the plot is solid and gripping you in, it doesn't matter how you shoot it. You'd still have a great movie, like 'American History X'.",
            "review_date": "2016-01-20",
            "source": "rt"
        },
        {
            "content": "Very disappointing ending, tbh. The rest of the film was pretty good. Story never got me bored. Ending felt incomplete.",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "I first watched this in my philosophy class at school & I was shocked by how good it was! Racism is such an important topic & was used extremely well in the film! I thought the black & white sequences were brilliant & Edward Norton did an outstanding job as the lead!",
            "review_date": "2016-01-11",
            "source": "rt"
        },
        {
            "content": "Thought Provoking. Brutal.",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "A very visually moving movie about learning the hard way. One of Ed Nortons best roles by a long shot.",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "American History X\nWatch Now => http://bit.ly/1ZUDl6m\nDownload Now => http://bit.ly/1ZUDl6m",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "Striking drama with excellent performances.",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "Brutal and visceral in parts (he infamous curb scene). High on rhetoric and emotion. The movie does a great job of showing that goodness and badness of people is independent of their skin color. It wants to highlight the futility of violence and, in my view, is where it goofs up badly.\nSpoilers.\nAn apt ending would be to have had Dan shot by Der's previous \"friends\" - not some other issue. And worse, the guy who shoots is one who has cheated in the exam and was bullying another who told Sweeney about this. Dan's behavior there isn't exemplary but not racist, either. But, on the whole a beautiful movie, but for that one slip (in my view).\nMust watch.",
            "review_date": "2015-12-27",
            "source": "rt"
        },
        {
            "content": "One of the most compelling treatments of race in America in recent cinema, American History X will enthrall the viewer with its straightforward treatment of American Neo Nazism and the cycle of violence, deception and hatred that perpetuates racial conflict.  The tale of a redeemed older brother's attempt to keep his younger brother out of the neo nazi movement, American History X serves as metaphor about the effect that stable institutions like responsible governance and the family can have on our youth, and how its our responsibility to provide a society in which nobody grows disillusioned and desperate enough to be preyed on by thugs preaching hatred and scapegoating of our most vulnerable.  A measured and powerful performance by Edward Norton anchors the film, and the direction weaves between the past and present with narrative heft and technical skill, mastering the art of the provocative symbol or image.  But ultimately, this is a tale about redemption and what it means to be an authority figure and an adult.",
            "review_date": "2015-12-22",
            "source": "rt"
        },
        {
            "content": "Very thought provoking and sadly as relevant today as it was in 1998.",
            "review_date": "2015-12-22",
            "source": "rt"
        },
        {
            "content": "One of the most affecting and realized explorations of race in America of recent years.",
            "review_date": "2015-12-22",
            "source": "rt"
        },
        {
            "content": "Exceptional acting accompanies this film with a powerful, thoughtful message still relevant today. It kept me on edge throughout and every character was multi layered.",
            "review_date": "2015-12-18",
            "source": "rt"
        },
        {
            "content": "Being pissed off is bad.",
            "review_date": "2015-12-12",
            "source": "rt"
        },
        {
            "content": "Hate isn't something we're born with, unless you're Damien from \"The Omen\" or are fresh out of Rosemary's womb.  It is a feature of one's personality distinctly inspired by others - the kids of the Westboro Baptist Church didn't come into the world with the understanding that the right thing to do is to be homophobic and anti-Semitic.  They were taught these diseases.  Most of the population is able to cope by ignoring them, living bigot-free lives in the meantime - but knowing that groups believing that another race, religion, sexuality, etc., is so wrong that they would not oppose violence to oppress it is a terrifying, unsettling thing. \n\t\"American History X\" shines a light on to the scarring truths of neo-Nazism in the United States, informing us that groups committed to their hate, committed to viewing Adolf Hitler as a sort of misunderstood Jesus, is a very real, very scary reality.  Rationalism plays no part in their antics; it is rage that they disguise as social justice.  The film is frightening, upsetting, and visceral.  It is more relevant than ever, with Donald Trump's candidacy bringing out tucked away racism embedded in the worst individuals of the U.S.  \n\tSurprisingly, \"American History X\" is still, nevertheless, moving.  While it gives us a taste of the brutalities of neo-Nazism, it doesn't waste away potential by basking in a senselessly angry rhetoric.  There's a twist: what if one of the biggest doers of violence against minorities went to jail, realized his evils, and was reborn? The answer isn't as easy as we would like it to be.  But it's a captivating one.\n\tThe film opens with a distressful sequence that details a carjacking gone wrong - would-be thieves make the mistake of targeting the home of Derek Vinyard (Edward Norton), a merciless neo-Nazi.  Being mostly black, they are murdered in methods ranging from vicious to grotesque.  Derek is sent to prison for three years, his younger brother, the impressionable, teenaged Danny (Edward Furlong), imitating his hateful tactics as he ages.\n\tThe present of the film is set during the window of the first few weeks of Derek's release.  Danny has just written a paper praising Mein Kampf, and the skinhead movement is growing.  But something in Derek has changed.  Gone is the evil that nested in his eyes before; his body language suggests someone no longer compelled to always be in attack mode.  \n\tFlashbacks, photographed in grimy black-and-white, reveal his metamorphosis, and we unromantically witness everything from Derek's sordid days as a sadistic \"leader\" to his eye-opening incarnation, where he forms such a strong bond with a fellow inmate (who happens to be black) that it causes him to rethink his hateful ways.\n\tSo the film is intent on acting as voyeur to Derek's desperate attempts to inspire Danny to reconsider his life, reconsider his beliefs and wonder aloud if over-the-top prejudice is a path worth traveling down.  \"American History X\" doesn't paint Derek as a saint (we very graphically see the atrocities of his past), making the film gripping because it analyzes what a shallow thing hate is in a thoughtful, nuanced way.\n\tTony Kaye's direction, unflinching and unbiased, presents the situation as is, letting the emotional undertones of the film hit us naturally, and, in some ways, guttingly.  His instincts complement David McKenna's brilliant screenplay with fluidity; McKenna, so easily able to go back and forth tonally (authentically characterizing a skinhead crime spree only to suddenly transition into Derek's regretful present), gives the film its magnetically flawed interior.  Kaye provides it with its instinctual exterior.  We are never less than transfixed.  It is even entertaining, despite its frequent dives into jerking uncomfortability.\n\tThe ensemble is just as monumentally stunning, if not more so.  Norton gives the performance of his career, embodying Derek with such commitment that to go from despising him to sympathizing with him does not feel like a cinematic manipulation; his portrayal is multifaceted in ways few actors can imitate.  We can feel his pain, his sorrow, his regret.  Though I wish more time was spent following Derek's descent from all-American teenagerisms to neo-Nazi masochism, it doesn't corrupt the power of Norton's characterization.\n\tFurlong is heartbreaking as Derek's vulnerable younger brother who will do anything to be accepted; in a climactic dinner scene that shows the moment during which their father passes his bigoted baton to Derek, Furlong is only a background figure.  But look at the way his eyes change, the way they see that hate equals acceptance, love.  Furlong's subtle facial idiosyncrasies and unconfident body language gives Danny a dimension that suggests that his hate is a result of social pressure, not of genuine disdain.\n\tEven the supporting players, whose good work could be overlooked when behind the ground-shattering performances of Norton and Furlong, enrapture us.  Beverly D'Angelo, the film's source of hope, is heartfelt as a mother disgusted by the sins of her sons that still manages to radiate with unwavering love; conversely, Fairuza Balk, as Derek's pre-prison girlfriend, disturbs with her inability to see past the fury that clouds her judgment.\n\tSociety will continue to contain pockets of narrow-minded individuals reactionary and caustic, but \"American History X\" uncovers the reality that racism and its fellow prejudices are something unfortunately characterized by the culture that surrounds them - hate, in truth, has no foundation besides a bottomless crevasse where misanthropy immortally lives.  The only way out is to open one's eyes; \"American History X\" is unmistakably hopeful and unmistakably timeless.",
            "review_date": "2015-12-10",
            "source": "rt"
        },
        {
            "content": "Wild and reckless, American History X is a wonderful audacious film starring a very talented Edward Norton.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "It is not too often that after a movie you walk away and just say \"Whoah\"  American History X is a punch to the gut.  One of the more powerful movies out there.  The premise of this film could have taken a different path.  It could have been a preachy movie about race relations in America and how minorities are held down etc... But in my eyes, it is not that at all.  This movie is about the pure hate that simmers deep down inside some people.  And how this hatred that is deep inside them effects their actions and effects the people who are around them.  And as we see in this movie, extreme actions have extreme consequences.  We do get a backstory on why Dereck Vinyard is so filled with this hatred.  Edward Norton gives the performance of a lifetime in American History X.  Not only the physical transformation from a scrawny little nerdy guy, into an absolute monster.  At some point during the film you forget that it is an actor playing a role, and that to me is what makes a great performance.  American History X does not have to choose sides and display who the good guys and the bad guys are, because any normal human being will know who the bad guys are in this movie.  No spoilers in my reviews, but it also has one of the most emotional powerful endings to any movie I have ever seen.  American History X is not for everyone, but if you can watch the evening news and comment on social issues, then you can watch this movie, and I suggest you do.",
            "review_date": "2015-11-25",
            "source": "rt"
        },
        {
            "content": "It is not too often that after a movie you walk away and just say \"Whoah\" American History X is a punch to the gut. One of the more powerful movies out there. The premise of this film could have taken a different path. It could have been a preachy movie about race relations in America and how minorities are held down etc... But in my eyes, it is not that at all. This movie is about the pure hate that simmers deep down inside some people. And how this hatred that is deep inside them effects their actions and effects the people who are around them. And as we see in this movie, extreme actions have extreme consequences. We do get a backstory on why Dereck Vinyard is so filled with this hatred. Edward Norton gives the performance of a lifetime in American History X. Not only the physical transformation from a scrawny little nerdy guy, into an absolute monster. At some point during the film you forget that it is an actor playing a role, and that to me is what makes a great performance. American History X does not have to choose sides and display who the good guys and the bad guys are, because any normal human being will know who the bad guys are in this movie. No spoilers in my reviews, but it also has one of the most emotional powerful endings to any movie I have ever seen. American History X is not for everyone, but if you can watch the evening news and comment on social issues, then you can watch this movie, and I suggest you do.",
            "review_date": "2015-11-24",
            "source": "rt"
        },
        {
            "content": "As controversial as it is, Edward Norton's performance is very convincing, the realistic environment tells how much hate can get you into a lot of trouble and the consequences for one's action, redemption, and leading the right road",
            "review_date": "2015-11-23",
            "source": "rt"
        },
        {
            "content": "I found this movie very hard to watch, and very hard to keep my eyes on the screen during the violent scenes - which is why this movie is so important to me. Racial Bigotry is a very serious and very real problem in America today, and has guided many white youth into a path of Neo-Nazism and racial intolerance and hatred. I've seen so much violence and hatred towards \"minorities\" from people my age, and to have a film like this renews my hopes that even in the darkest of beliefs, a person can be redeemed. From the cinematography to the narration of Danny's essay, this movie is all around fantastic. An absolute work of cinematic art.",
            "review_date": "2015-11-19",
            "source": "rt"
        },
        {
            "content": "One of the best performances from Edward Norton leads this thought-provoking and engaging story that digs into the processes that bring men to become racists, as well as into those that defeat racism.",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "Don't watch this if you are hungover",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "Overall, American History X is a compelling and well made film despite it's one or two main flaws",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "Prepare for some major heartache when watching this...",
            "review_date": "2015-10-07",
            "source": "rt"
        },
        {
            "content": "Powerful movie! Edward Norton's performance should of got an Oscar.",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "This is my second favorite movie of all time , the first one being The Departed . Before sawing it , I've heard it from the internet , saying that it's excellent . I saw it had Edward Norton , which is one of my favorite actors of all time , but I didn't want to pirate it and watch it . So I came across it on TV and I watched it .... I'll never regret  that experience :)",
            "review_date": "2015-09-22",
            "source": "rt"
        },
        {
            "content": "American History X is a very difficult, emotional movie to watch, but its honesty, realism, and truly important message make it a movie that simply can't be missed.",
            "review_date": "2015-09-04",
            "source": "rt"
        },
        {
            "content": "You can expect the movie to rebuke the white supremacist views of its characters, but what you won't anticipate is its bluntly raw story and heavy conclusion.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "Great story , acting , drama...and a bit a timeless issue . A classic ! SOMDVD",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "American History X is an ultraviolent melodrama. Edward Norton's performance is stunning, but I can't say the same for his co-star.  The film successfully tackles the topic of racism, but not without way too many slow motion scenes that take you out of the movie. The movie's script is near perfect but the directing is questionable.",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Acting better than writing & directing.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "It's always nice to see a movie about racism where there are no good guys...  Can't get much more real than that.  But it's also nice to see some of these characters change, and see that \"hate is baggage.  Life's too short to be pissed off all the time.\"  The hate and the anger are powerful.  \n\nEdward Norton is simply remarkable here, and I'd raise his performance up against any single actor's performance in any film that I've seen.  It's really that good.  And sometimes, films only have that one iconic performance that holds together the movie.  While it's true that without Edward Norton, the film would have probably been average, awesome supporting roles including Edward Furlong, Beverly D'Angelo, Fairuza Balk, and Ethan Suplee raises it to another level.  Norton's character, Derek Vinyard, goes through every gamut of emotion from love, to hate, to self doubt, respect, tolerance, and total despair.  It's a performance for the ages.\n\nI think what's most telling is the view of racism by the film's director, Tony Kaye, and writer, David McKenna.  Nobody wins.  Derek and Danny reform, yet tragedy strikes.  Seth and Cameron become more hateful than ever, and they get burned.  Black guys go for revenge, they either die or go to jail.  Nobody wins.  And it's something the world should be paying attention to.\n\nI think this is a very important film in the annals of Hollywood, from High School on up.  It's nearly required viewing, along with another film with a similar subject matter, called Higher Learning.  But Higher Learning didn't have Edward Norton.  Higher Learning didn't have quite the profound message.  All the performances were tour-de-force, and this film gets my highest recommendation.  Be aware of graphic violence, nudity, rape, and a lot of heavy language, from cursing, to racial slurs.  Some people put the film down saying that none of it was necessary, but, I say to that, in order to paint a quasi-realistic picture of the dark subject matter, there are no limitations.  Hate and anger get you nowhere.  Again, highest recommendation, and a part of my top 100.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "A very thought provoking film that unfortunately a lot of people misinterpret.",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Gritty and powerful, American History X explores the ignorance and violence in racial hatred in America today. One of Edward Norton's finest performances, American History X is a compelling drama that will keep you enthralled throughout.",
            "review_date": "2015-08-01",
            "source": "rt"
        },
        {
            "content": "83%\nSaw this on 30/7/15\nAmerican History X is good, but I only wish that the film were as good as it's first 40 minutes. At times History X is peripheral and preachy, but it surely is one among the best films about racial wars in America. The film's cinematography is splendid and it's direction is commendable. I did not approve of Norton's performance, he was good as the racist Derek, but I did not find his acting emotional enough in the climax.",
            "review_date": "2015-07-31",
            "source": "rt"
        },
        {
            "content": "This is a compelling performance by Norton, and the film attempts to address a serious and relevant problem. Derek Vineyard (Norton) is a hateful young man and that comes through clearly. What we don;t see enough of, though, is where Derek develops this hatred, aside from a brief flashback scene with his father at the dinner table. His mentor, Cameron (Stacy Keach) is a bit cardboard and cliche s well. That said, it's a move that's as difficult to watch as it is to stop watching. I would not call the movie \"inspiring,\" though, since the conclusion is so bleak.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "Definitely a well done film, especially from the scary good performance of Edward Norton. Though his recovery was quick and underdeveloped, it still will be a film discussed for a while",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "não sei o que dizer.......... apenas sentir........",
            "review_date": "2015-06-26",
            "source": "rt"
        },
        {
            "content": "Edward Norton and Edward Furlong provide an amazing performance, accompanied by a gripping narrative that tackles some very deep sociological troubles. Kaye manages to show a very objective view of multiple sides to the same story without a biased preference. The film did not feel like there was any part missing, nor was there anything unnecessarily excessive.",
            "review_date": "2015-06-14",
            "source": "rt"
        },
        {
            "content": "\"Hate is baggage. Life's too short to be pissed off all the time. It's just not worth it.\" Una película muy gráfica e impactante pero da justo en el punto que quiere tocar. Una película contra el racismo y el odio en general. Si no la han visto, veánla.",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "At the beginning if AHX, I hated the main characters, but the movie does such a good job at developing them I couldn't help but feel for them by the end. This is a movie that shows how terrible racism is, and that senseless violence doesn't solve anything, all while being backed by  strong political undervalue rent. It does a good job at displaying the racist argument so we understand why they think this way, and then showing us how that state of minpulls you into a deeper hole.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "This was a fantastic and touching movie about someone who learns how to change who they are for the better.",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "American History X has glimpses of greatness but falters more often then not by riding on ideas rather then substance. \nGrade: B-",
            "review_date": "2015-05-12",
            "source": "rt"
        },
        {
            "content": "Norton is fantastic in this. The movie is a little heavy-handed, but his performance really makes you invested.",
            "review_date": "2015-05-02",
            "source": "rt"
        },
        {
            "content": "Very moving movie and performances.",
            "review_date": "2015-04-29",
            "source": "rt"
        },
        {
            "content": "While it's definitely not innocent of being preachy, American History X is still a compelling piece of cinematic drama that's carried by an amazing performance from Edward Norton, and gives us an unflinchingly honest look at some major societal issues.",
            "review_date": "2015-04-29",
            "source": "rt"
        },
        {
            "content": "This movie will change your life.  The most powerful movie I have ever seen.",
            "review_date": "2015-04-24",
            "source": "rt"
        },
        {
            "content": "One of the, if not the most, emotively-powerful movies I have ever seen.",
            "review_date": "2015-04-17",
            "source": "rt"
        },
        {
            "content": "This is one of the most important films ever made. The social stigma that is racism and other kinds of prejudice and how stupid they are is exposed in an immensely compelling way. Hate is universal and this story demonstrates how hatred knows no boundaries.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "Poética y cruda al mismo tiempo, es una desgarradora disección de la xenofobía, el radicalismo conservador, y el racismo en EU, ofreciendo la mejor actuación de Edward Norton en su filmografía.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "\"Has anything you've done made your life better? \". Thanks for this meaningful quote. I will remember it all time, as i remember this powerful movie all time.",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "One of the toughest movies I've ever seen.",
            "review_date": "2015-04-06",
            "source": "rt"
        },
        {
            "content": "Fantastic. Norton does an amazing job and the story is spellbinding and gritty. This one takes you on a relentless ride.",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Everyone should watch this.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Great. 8.3/10. B+.\n\n\nThe script understands its characters so well that an emotional undercurrent is easily sustained, but the unfocused nature of the narrative brings it down.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "?????????????????????????????????????????????????????????????????????????????????????????????????????????????????????\"Hate is baggage. Life's too short to be pissed off all the time. It's just not worth it.\"??????????????????????????????????",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "has a strong message",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "American History X is a very compelling and great movie. But truth be told it's not as good as it could have been. That's not to say that American History X is bad, but it's not as good as another similar movie that actually came out about four years after this one. It's called \"The Believer\". If you want go check it out it's probably still on Netflix. But I felt as though for some reason this was not as good as the believer for the following reason: I felt as though Edward Nortons character was not as explored as I would have liked him to be. I mean they explored a lot about him, but it wasn't enough if you ask me. I think that this was more because the story was just a bunch of flashbacks that occurred over the course of a day and a night. And I guess for some reason the movie felt way too short for that reason. Other than that I quite enjoyed this movie. This movie has a lot of great moments to it and the movie did it's main job: get me to hate the crappy version of the nazis that we have here in america. I felt almost as if this movie was trying to get me to hate those people. And I hated them for a lot of the movie because of the reasons that the nazis in this movie hated everyone. And they hated for unreasonable, mis-informed and just stupid reasons. And that's the reason that most people hate nazis. But then I realized as the movie was over that maybe I'm not supposed to hate these people. Because hatred is a manifestation of anger. And that hatred lead to people being killed. And not just people who had done bad things, but also the people who wanted to make themselves better. If you're into stories of American Neo-Nazis then don't hesitate to watch this. I out it off for far too long. Even though it's not the best it turned out great in the end. And both Edwards were fantastic.",
            "review_date": "2015-03-14",
            "source": "rt"
        },
        {
            "content": "Devastating movie. Really too rough for my tastes, but amazingly well done. Love Norton, as always. Not a great movie to start at 11 p.m. on  a Sunday night.",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "This is a powerful and condemning portrayal of the consequences of racism in a contemporary American family without resorting to overt melodrama or sentimentality to communicate. It's also lead along by an awe-inspiring lead performance by Edward Norton.\n\nRoger Ebert complained that film plays like a series of powerful and compelling vignettes without any kind of organizing principle. I must disagree in that the film's themes and narrative purpose are the string that hold it all together, and it holds it together beautifully.\n\nTony Kaye may be a slightly strange gentleman, but he's an incredibly talented artist, and this may very well be one my favorite film ever to tackle racism, as well as one of my favorite films of all time in general.",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "Dark and gritty, does well with the racial subject matter it covers, but skimps on the reality that transformation and changing minds takes a lot of time and isn't easy.",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "Somewhat tame and inaccurate to anyone who actually knows about the White Supremacy Movement and their paramilitary organizations, but a solid tale of misguided passion, regret, redemption, and alas well, I won't ruin it. Overall, I did like the moral of the story. It provided superb acting skills from everyone involved and will no doubt go down as an instant classic.",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "Loved it. What a dramatic development of a complex character.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "I love edward norton in this film he is fantastic. I really am not a fan of the directing though, I thought it was poor",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Brutal and thrilling. Edward Nortons best performance.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "The film has a powerful message albeit very direct with little subtlety.",
            "review_date": "2015-01-26",
            "source": "rt"
        },
        {
            "content": "Great movie with some powerful and intense acting by Edward Norton. The message at the end is probably one of the best ones I've seen on a movie.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "If you think about the great films that came out in 1998, the one that most people think about first is \"Saving Private Ryan\" but I always remember three great/amazing films of said year that touch the fascism subject, each with its own approach: \"La vita è bella\", \"Private Ryan\" and \"American History X\". \nDerek Vinyard is the leader of a Neo-Nazi group in Venice, California. His dangerous and controversial lifestyle destroys his family and influences his young brother Danny. Eventually, Derek goes to prison for a three year sentence but inside that environment he finds redemption but once he finally gets out he realize that Danny has grown up to become like him thus making Derek´s objective to redeem his brother and assure his family´s security.\nWith a pretty dark premise and an incredibly good reputation, you enter this film with high expectations and \"American History X\" does not disappoint at all. \"American History X\" counts with an amazing and ambitious character driven story about the effects of hate on an individual and the terrible influence he may be to the young generation, solid/outstanding performances with the best being, obviously, Edward Norton providing the strongest acting of his entire career to date as a man filled with hatred who´s looking for redemption; strong /deep character with their own story arcs, a phenomenally made atmosphere, strong visuals, graphic and even hard to watch scenes that have point in the narrative, a perfectly told antiracism message, deep and relatable themes, memorable cinematography, well use of non chronological storytelling, and it will definitely get some sentiment out of you. Despite all those phenomenal elements, I found two problems with \"American History X\": 1) Tony Kaye direction is often heavy-handed thus taking some of the characters internal struggles complexity away. 2) The film´s runtime limited the potential that Danny´s story could had achieved by just providing one scene where his arc is completed, I believe that if he not only listened to his brother but also saw the flaws and dangers of his Neo-Nazi lifestyle by himself, it would provided more power to the film´s appropriate conclusion. \n\"American History X\" is one of the greatest character driven story that I ever seen, while it often is heavy-handed it's still a powerful story that will depress and/or shock people but it will provide an uplifting message at the end.",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Brutal, emotional, and thought provoking.",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Provides a realistic and well executed look at a too often ignored issue within American society.",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "Has a film represented the racial tensions found in parts of the US during the 90's better? I'm not too sure.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Tai istorija apie asmenybes ir jo vertybiniu nuostatu kaita. Rasizmas, brutalumas ir neapykanta - tai tik peizazas, uzsklanda, kuri padeda isreiksti tikraja esme.",
            "review_date": "2015-01-16",
            "source": "rt"
        },
        {
            "content": "A very powerful film led by an excellent performance from Edward Norton.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "Edward Norton was in his prime here...please come back! The look in his eye while being arrested can't be matched by too many actors.",
            "review_date": "2015-01-01",
            "source": "rt"
        },
        {
            "content": "Violent et une belle leçon",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "I will watch this over and over again",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Edward Norton gigante, em uma de suas melhores atuações da carreira, lidera um roteiro extremamente seco e pessimista, ainda que um ótimo retrato da sociedade norte-americana (e não só). Dá até pra perdoar as câmeras-lentas excessivas.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Movies rarely tell the Nazis point of view at any time, and this movie about modern day Nazis living in America is one of a kind.  It's a rather dark movie, full of language, racism, and fighting both on the streets and within ther family.  It's a really interesting movie, both in topic and in cinematography.  The cinematography is good, and skips between the before, the prison (which is filmed in black and white) and the after.  The acting is really good as is the sqript, and really makes the events believeable.  The characters are to be hated for their actions, but given that the movie focuses on them it makes them feel human and in the end we see the good in them.  It's a good movie, with an ending that couldn't have been seen coming, and that could have brought the characters back to the same place they were at at the begining.  It's a great movie, dark and not for everyone, but should be seen to better understand these people and their horrible beliefs.",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "Great movie great performance by Ed",
            "review_date": "2014-12-21",
            "source": "rt"
        },
        {
            "content": "This is an incredible movie with a powerful message.",
            "review_date": "2014-12-14",
            "source": "rt"
        },
        {
            "content": "A gripping story, powerful acting, a must see!!",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "A tragic movie. Edward Norton should have one an academy award for this.",
            "review_date": "2014-12-10",
            "source": "rt"
        },
        {
            "content": "A brilliant, but at most times insanely hard to watch, analysis of the Neo-Nazi and White Supremacist movement. Edward Norton gives a brilliant performance that carries the viewer through the horrible sights of this movie. It was life changing, and amazing.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Powerful!!! Raw but powerful!",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant film,a compelling and thought provoking film about Derek Vinyard (Edward Norton) who starts out as a neo-nazi but changes his ways in jail. On top of this he is also trying to get his brother Danny (Edward Furlong) to follow suit having followed Derek's path in life. A fine performance from Edward Norton and clever directing that keeps the watcher's attention intently.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "Just wow. Not sure how I managed to only stumble upon this film now, but it was phenomenal.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "A Riveting And Brutally Honest Redemption Story!",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "This would be among the top of my favorites films, hard subject matter but Gritty, Super Powerful Film, film direction and style so reflects its subject matter.and although this show hatred at its worst and it's sad consequences..there is also redemption and how karma can bite in the ass.",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "I respect this movie but I am not too entertained.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "This film is important portrait of hatred which is always connected with some kind of loop. Racism is just one of the examples of this because this mechanism works in plenty of social disasters. It shows that every stereotype attack could only cause a revenge. We could also see how some \"dark' organisation works and realize why we have to fight against it. Sometimes i feel this movie was a little simplistic but you can not include all faces of the problem in two hours. Additional amazing acting of Edward Norton and we receive a really good film.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "This movie shows the effects of racism on family and on a person's life with a compelling story and an amazing performance from Edward Norton. The change in Daniel's perspective was too quick and not as meaningful as Derek's.",
            "review_date": "2014-10-17",
            "source": "rt"
        },
        {
            "content": "American History X was made in 1998, yet it does not feel outdated in today's society. It feels like the action in this movie could happen somewhere in the streets today. Sure we have made strides in racism, but just because we have a black president doesn't make it all go away. \n\nThis film and Fight Club, released in the same year, made Edward Norton a mega movie star. To me, his is in the top 5 of male actors. His range is unbelievable and his acting superb. And in this movie, it could never be more evident. \n\nThis is a violent look into race and gang warfare in America. The reason the movie is still relevant is because gang violence isn't going away anytime soon. The crazy thing that has changed is now there is even more fighting among same race gangs.\n\nThe movie starts out with a bang, and another, and several more, followed by one of the more graphic, repulsive, violent deaths in cinema history.  It shows how hatred can turn people to gangs, and how it rips families apart. Norton plays Derek Vinyard, a skin head loving Nazi that goes down as the local gang's hero after a series of killings and jail time.\n\nBut in jail, Vinyard gets is comeupings and then some. He has to worry about rival gangs and just trying to stay alive. After prison life, things are very different yet still complicated for Vinyard and his brother Danny, played by Edward Furlong. You can see the range of Norton's acting through this part of the movie.\n\nThe film is raw and passionate at the same time. You see Derek Vinyard's trail into dissention through many flashbacks throughout the movie. You see what changed him into a neo-Nazi, and then what changed him in prison. He is an anti-hero; you feel sorry for him and want his life to get better. It shows you how life is not black and white, but shades of grey in-between. \n\nThis is a hard hitting movie. It deals with an issue rarely talked about. It is a must see movie, put it in your bucket list if you haven't. And if I was a teacher or parent who lives in a bad neighborhood where gangs run rampant, I would show it to my kids, despite its R rating. Honestly I think it's a must see for any kid once they hit their teens. This movie can be that impactful. I'm sure hope it has detoured some from gang life.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "Another thing that makes this movie great is the sheer entertainment value, it gives the audience the warped point of view of Neo-Nazis most people never get to experience. With a great script and one of the most turbulent and intense performances of Norton's career that draws viewers to the screen like moths to a lightbulb. American History X boasts a perfect balance of horror and humanity, making it one of my favorite movies of the late 90's.\n\nFull Review: http://www.movie-blogger.com/movie-review/intriguing-and-painfully-real",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "Pese a los innumerables problemas de pre y post producción que derivaron en el director Tony Kaye dándole la espalda a su obra, de alguna manera esta cinta salió triunfante y con todos los honores del caso.  Edward Norton nos entrega su mejor actuación hasta la fecha encarnando a un \"Skinhead\" en busca de la redención. ESta es  una película fuerte, dirigida magistralmente y que no teme en sentar su posición.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Wonderful! The story of a man who got his head messed up and was once the leader of all the racist people in his area but with time it made him realise that he could lose everything even the most valuable thing: his family.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Heavy going, Edward plays it out well.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "A very disturbing look in to how racism can both bring people together and at the same time tear them apart and whole communities apart.  I don't think that people really realize even today how much hate is born and acted out because of a persons skin colour, religious beliefs or sexual orientation.  You would think that after all we've seen we don't realize we all bleed red and all too often over race.  This movie really hits that out of the park.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "While it's dark and twisted, it's realistic and genuinely honest. It's a character study and an era piece lead brilliantly by the arresting performance of Edward Norton. You will not walk away from this film unaltered for it is so brutal and cruel but at the same time resistant to ignorance.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Great! Totally different from most edward norton roles.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "A very powerful story with very powerful characters.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "Provocative story with an excellent lead performance by Norton.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "A powerfull and thought film, leaded by an fantastic performance from Edward Norton. And still every bit as revelant as back in 1998.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "Very involving story about a pretty brutal topic. The performances as well as the characters are fantastic! Go watch it!",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "Not a perfect film, and perhaps at a hands of a better director it would have been much better, but it's hard to overlook Edward Norton's performance and the captivating subject matter.",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "\"Has anything you've done made your life better?\"\n\nAmerican History X is a powerhouse piece of movie art that is as provocative and thought-provoking as it is entertaining.  Edward Norton is boss ass nigga.",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "One of the great movie from Edward Norton. This movie is not \"another violently racist\" movie. American History X has great storytelling of one man who has the wrong point of view and trying to fix it. Great storytelling and screenplay, also it has stunning the cinematography",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "Todo lo que busco en una película. Un increíble guión que te atrapa con esa escena de violencia en el minuto uno, notables actuaciones que demuestran que Norton debe ser el mejor de su generación, y una historia humana que se desenvuelve sorpresivamente.  Un clásico de los tiempos modernos.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "I was in quite a vulnerable and puppy dog wounded mode when I finally opened up my eyes and sensitive soul to this unusually effective dramatic film starring the always amazing Edward Norton and Edward Furlong. \nBeing somewhat of a victim of schoolyard bullying and xenophobic racist attacks from all types of peers, Derek Vineyard (Edward Norton) stood with me from his beyond cruel actions towards an African American actor his heartbreaking experience while serving time. \nHis heart being in the right place, Derek goes out of harm's way and most of the film to help get his younger brother avoid the very dark and dangerous path he took for a very foolish opinion. \nReview by Nair Haile \nLos Angeles, California",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "Thought provoking and poignant with some good performances.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "Wow. Edward Norton's performance is unreal.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Very powerful movie regarding social issues that makes you think a lot regarding many topics",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Very powerful movie led by a great performance from Edward Norton. Be ready because this movie hits hard and doesn't hesitate when it comes to dealing with race issues and violence. Very up front and blunt with it. The film has a great message and I overall loved the story.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "it's an astonishing movie. Great history and a good director",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "...a compelling portrait of the destructive nature of racism with some provocative thoughts!",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "So brutal and great. Maybe a little over-simple in how quickly Derek gets over his prejudices, but compensates for that simplicity with violence and brutality so the movie doesn't over-redeem him. Amazing acting from Ed and great directing.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Too bad this movie was so reworked and lost in its development. Interesting premise, poor creative process.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "one of the best movies ever made",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "When I first viewed this particular film I knew I was in for a very powerful and moving cinematic experience. \nI have only seen American History X three times, and it really just psychologically drains and uplifts me all throughout one Hollywood's best film dramas of all time.\nThe entire cast were awesome and the always flawless Edward Norton was just brilliant.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "This might be one of the most important movies on racism I have ever seen.  Not for the faint of heart.  It also cements Ed Norton's place among my top list of actors.  I haven't seen him fumble anything.  Grade A.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Edward Norton is the metaphorical fulcrum that holds American History X in the balance. His raw, electrifying performance creates the center of attention for this brutally riveting character study of a man who is attempting to revive his family's life from a horrifying past. Edward Furlong more than holds his own and delivers a great performance as the young delinquent. American History X explores the nature and consequences that racism can have on a family and a community, and makes us question our everyday moral obligations towards society. David McKenna's script if full of terrific dialogue and memorable quotes that will certainly connect with various members of the audience. Tony Kaye's smart, intuitive direction fully depicts the background of America's culturally dignified but diverse society. Along with it's thought-provoking themes, American History X cements itself as an unforgettable, unconventional masterpiece.",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "A character study of two brothers, American History X is one of the most powerful movies I've ever seen and a perfect ending that adds to the already strong message.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Noton is terrific in this redemptive tale of violence and the past sometimes running you down.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have seen. The message at the end is very powerful.",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "Though the two stories seemed to be fighting for air time, the movie hit you where it hurt repeatedly until you found higher moral ground",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Excellent. La preuve que la stupiditÃ© n'a pas de couleur, mais est bien humaine.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "A very powerful movie and can be at times hard to watch, but is driven by an amazing performance by Edward Norton.",
            "review_date": "2014-07-12",
            "source": "rt"
        },
        {
            "content": "Not one for the faint hearted. Worth a watch though just to educate yourself on idiots who actually live like this in America.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "American History X is truly a masterpiece.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Good story, makes you think.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "Okay. I haven't wrote a review in a while. So here we go. This one was intense. I've been meaning to see this. It was nothing short of brilliant, there were certain things that I wish there was more of a focus on but it was so well put together. It really sends a message out unbiasedly showing the incredible acts of racism that exists in all races and still very much exists today, but in a much more subliminal form. \n\nThis is a 1998 film that nearly 16 years later still paints a picture and tells a message that is ever so ringing. The film can be easily relatable, and is honestly a film that everyone should watch. It's not that violent and gets its message across with black and white flashbacks, everything about the film was amazing. I think it could have went over two hours, but maybe length wasn't the point.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "'American History X' felt like kind of a letdown. Don't get me wrong, it wasn't BAD, but seemed like it was trying to tackle a subject that it was either unable or unwilling to fully commit to tackling. While it had it's fair share of interesting characters and technical aspects, the film didn't dive far enough into the morality of equality as it could or should have. It felt like it was saying \"Black people are just as good as white people. And anyone who disagrees is a bad person and bad things happen to bad people who think that equality isn't good\" when it could have been a much more profound and thought provoking film.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "This searing and powerful film dares to portray neo-Nazi's in a sympathetic manner. Most controversial of all, we actually kinda admire Edward Norton's character at first. He's bad-ass, cares about his family and is actually smart. He even has a point (regarding illegal immigrants stealing jobs from American citizens). This is the trick, to get the ignorant racist people to side with the film. Then it begins to show how fucked up he his. It's a fascinating choice to have it be told from his little brother's point of view (both actors give incredible performances), especially since he's writing a paper for school. Smart concept. The back and forth in time also works well (especially the black and white imagery). That said, the film is flawed because it comes across a little bit preachy at times (the director desperately wanted his name taken off the film for this reason) and the musical score is way too dramatic at times, making the film very melodramatic. Still, it's a brave movie and its heart is in the right place. Showing the consequences of prejudice, the realistic aftermath of rape, and most importantly showing that HATE only makes one's life worse.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "Despite its fair share of heavy-handed and hokey moments, American History X works very well as a character piece, and as a showcase for Edward Norton's best performance",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Great movie. Great performances. must see",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Amazing movie. Top 5 greatest movies ever!",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "One chaotic powerhouse and one of Edward Norton's best work.",
            "review_date": "2014-06-19",
            "source": "rt"
        },
        {
            "content": "With Edward Norton, and a decent supporting cast at its helm, Tony Kaye's American History X is a thematically rich, concise critique on post-modern America, and serves as an enlightening piece on the effects of hate in society, be it in a small community or at a global scale.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Very overrated.\nLet's start with the style. This guy, Tony Kaye, has no idea how to direct anything with any sort of action in it. Insanely dramatic music in a basketball match? Seriously? And yes, slow motion is lovely, but do you really have to use it so goddamn much? It's like he's a child who's just discovered a new magic trick. Maybe if the whole film consisted of a bunch of people sitting around and talking it would be a lot better, because there are some decent scenes like that, but the way he styled the film just made it seem like a cheap American tv show. \nLets move on... Am I really expected to feel sorry for some murdering racist and his racist brother? Yeah maybe they've changed their ways or whatever, but he killed two people... I felt like that was totally ignored in a lot of the film, simply because we were meant to feel sad at the end. Some of the other character were absolutely awful and irrational as well, which just made me dislike the film even more. \nSo come on guys, yes racism is bad, yes the film dealt with some important subjects, quite successfully at points too, with a really good performance from Norton, but this is quite frankly not a good film. But we're supposed to like it, because after all if you don't like American History X, then you must like racism...",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Wow, a movie that's so meaningful that all I want to say is wow.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Saw this at school today :) Felt really nice to see an actually good movie again. would recommend!",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "A thought provoking movie centred around human prejudice.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "Outstanding acting by Edward Norton, one of the best I've ever seen. This movie is not for faint hearted ones. It shows the bitter reality of our world, you just can't change somethings.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Edward Norton's best performance",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "Edward Norton's best performance",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "I remember this movie being a lot better.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "Shot in both colour and in scary black and white flashbacks, two brothers in modern day America are attracted to Neo-Nazism in Tony Kaye's dramatic essay on the powerful allure of fringe groups. The power of redemption is as strong today as it was then as audiences were repulsed yet fascinated by the film's violent outbursts as older brother Edward Norton tries to steer his young brother (T2's Edward Furlong) from the path of extremist views. Provocative and sobering, the movie raises questions and thoughts about society that few films have dared to touch and is all the more admired by our readers for it.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "What hasn't been said about AH X that needs to be said? It's a great film.\n\n\nFull review soon.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "American History X is a jaw dropping drama. It provides a powerful take on racism and its effect on peoples lives, its violent through words and actions. There are moments of devastation and even some with disbelief. Its full of hatred and delivers a strong message. Edward Norton delivers by far the best performance of his career and was truly compelling to watch, you know that it must have been a difficult role to portray. The ending to this masterpiece is shocking, as if the audience isn't rocked enough. Superb.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "No me la imaginaba tan buena ! Excelente actuaciÃ³n de Norton.",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "Good direction, excellent photography, thought-compelling. And above all, Norton's legendary performance.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Next to Crash, this is the greatest film on the topic of racism ever made. It will stay with you for days. The acting is first rate.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Though it looks too simplistic, director Kaye and the engaged cast make this movie an obligatory exercise of reflection.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "An entertaining and unique film. Majority of the flashbacks are in black and white, while the rest in color. It's a good idea, but would have been nice if more balanced. The acting ranges from bad to amazing. The filmmakers made some really great decisions, which aides to the enjoyment.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "amazing what hate can make people do\nit's not just a movie it's a life lesson and an experience, Ed Northon is a fabulous actor and was amazing in this role",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "A powerful movie with a story that made me think. My mom recommended it to me, I watched it and instantly fell in love with it. Not only does it have a great story...but it also features the best performance I have ever seen from Edward Norton (Who got Oscar nominated for it). I also think Edward Furlong was great in the movie. Every actor did a fantastic job and realyl impressed me. This movie also has one of the most heartbreaking endings I have ever seen. I love this movie a lot.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Powerful and gripping from beginning to end. American History X provides a great performance from Edward Norton and a graphic tale involving the influences of society in the household and relationships. Very explicit, destructive and compelling, the film makes a strong mark that's as challenging as its direction. 4.5/5",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "Love this film watch it over and over again.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "The film is a well-acted, fantastically directed, and moving reminder of a still present faction of society that sadly seems far from passing.",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "Edward Norton and Edward Furlong are terrific in this thought provoking drama.",
            "review_date": "2014-04-09",
            "source": "rt"
        },
        {
            "content": "Fantastic movie with a great message, \"Hate is baggage. Life's too short to be pissed off all the time. It's just not worth it.\" \n\nIt's a shame I waited so long to see this movie.",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "American History X suffers from a thinly written script, but Edward Norton's performance and the unflinching look at racism, anti-Semitism, and rape make for a very powerful experience.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "very well acted and directed film - 9/10",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "American History X, the film that everyone apparently thinks is one of the most important films of all time, falls into yet another slot on the ever-growing list of movies that I disagree with seemingly everyone on. No, this is not an intrinsically good film. I don't believe that a movie should be awarded points simply because it tackles tough subjects, and I don't think that the subject itself should have any serious weight in the overall opinion of it. If you're a religious person and you watch The Passion of the Christ, you can't say it's a good movie purely based on the fact that it's about something you believe in. The key to good filmmaking is the way the directors, actors, and writers go about portraying the subjects at hand; regardless of who or what the subjects are. And although race relations in America are tense at best, and deserve close examination, that alone does not constitute a good movie.\r\n\r\nAmerican History X is the story of a neo-nazi (Edward Norton) who, after a brief 3-year stint in a prison, becomes reformed and tries to turn his little brother on another path than his own. Okay, already I see problems here. Norton's character went to jail because he killed two black guys in the street. Yes, they were bashing up his truck. However, do we really believe that a known white supremacist could wound a guy, curb-stomp him to death, and then get only three years in jail? I mean, maybe in Florida, but not LA. I'm getting sidetracked. The point is, there are key elements of the plot that make no sense, especially what causes Norton to change (spoilers ahead). After seeing the drastic before and after comparisons between pre-jail and post-jail Norton, the audience is waiting for the one defining and incredible event that turned this hateful person around and onto the path of redemption.\r\n\r\nYeah, long story short, that never happens. Norton's story in jail is extremely disappointing. Firstly, he starts to fall out of favor with his fellow white supremacists when they do drug deals with the Mexicans in the prison. Okay... so he got mad at the white guys for doing business with the brown guys, so now he'll side with the brown guys? No, that doesn't make sense. Then the white supremacists rape him in the showers. So that one experience forever altered his world view and made him a kinder, more accepting, gentler human being? Ridiculous! And the last contributing factor is the fact that he makes friends with a black guy on the inside, leading to the black guys not killing him. Wow, there's so much wrong with this premise. I didn't believe for a second that this hateful, ignorant, and self-righteous piece of shit could go through such an incredible transformation in the span of three years. Spare me that \"people change\" bullshit-- the fact of the matter is that this could never have happened, EVER.\r\n\r\nThe one consistent high point is Norton, who is extremely convincing during the flashbacks to his hateful, bigoted past. There's a dinner table scene that is especially well-scripted and acted, where Norton bares a swastika on his chest to a Jewish dinner guest. Eep. Just gonna go out on a limb and say that those are bad table manners. In all seriousness though, it's difficult to play a character that is this reprehensible (Michael Fassbender knows it), but Norton pulls it off. The problem here is that we are then expected to feel sympathy for this character. Well, forgive me if I'm not so quick to forget the fact that this guy was a white supremacist three years ago. Then there's the dialogue between him and his little brother, which is so bad it sounds like it was ad-libbed right on the spot. It's repetitive, corny, forced, and wholly uninteresting. These are great characters, but they seriously deserved a better movie.\r\n\r\nFinal Score for American History X: 4/10 stars. I really wanted to like this film, but unfortunately it ultimately collapses under the weight of the subjects it's covering without actually providing any real substance. The story is questionable at best, the dialogue is laughable for the most part, and the acting, although good, isn't strong enough to hold up the entire movie. Adding to that is the Requiem For A Dream-style way that this film tells us something we already know: Here, instead of \"drugs are bad,\" it's \"racism is bad.\" It tries to have a new take on the subject by trying to make its main character sympathetic... but if the best you can do is try to make me become emotionally attached to a nazi, then I'll gladly take genericness instead.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "great movie heart touching",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "there was something magnetic about this movie, beneath few of its blatant cliches! i don't have to talk about Edward Norton seperately... so i won't! nice movie! Could have innovated the characters to exit the cliched tropes...",
            "review_date": "2014-03-16",
            "source": "rt"
        },
        {
            "content": "American History X is filmed in a compelling way, bosts gut-wrenching performances (particularly from Norton), and has a story with an important lesson: that human beings are capable of horrific, monstrous things, but underneath it all we are just broken souls trying to survive. Hatred kills, and love is what saves us.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "A masterpiece from almost every point of view you may see it from. Directing...storytelling...character development...social critique, everything. With a story so compelling and harsh as this one it is hard to think that it didnt get an oscar considering how its these types of movies that really move and inspire people in many ways, which is the reason why this one is one of y favorite films of all time, and I assure anyone who loves movies that by watching this, youll be doing yourself more than just a favor.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "Only Edward Norton could make me like him in a movie where he plays a Neo Nazi douche weasel. Seriously, his acting ability is ridiculous.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "Edward Norton is likable. Overall its a hard movie to watch, but not bad. Its just that its kind of easy to make a moving story about the troubles of society. It was perhaps too simplistic, and I hope to never see it again! But again, not bad.",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "[img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "This was one of the most powerful movies that I have ever seen. It was just really well done, and Edward Norton, and Edward Furlong did a great job in their roles. It is worth the watch, but is certainly not a light movie......",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "The dialogue in the first part of the movie felt cheap, too informative and forced in a way. Good character development and overall an interesting perspective of the matter.",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "Just re-watched this movie with the boys. Forgot just how disturbing it was. Really great performance by Ed Norton in this film.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "A hard to watch, no holds barred movie that isn't afraid to tell its story; \"American History X\" is a film that will shock some and become hated by others.  It shows so many themes snd messages that will literally explode right onto your face.  Edward Norton definitely stole the show with his electrifying performance.  It's a film that shouldn't be missed.",
            "review_date": "2014-02-12",
            "source": "rt"
        },
        {
            "content": "Great movie!  One of Edward Norton's best performances as an actor.  Great message to this movie by showing the brutal reality of what hate for different nationalities of people cause the hater the most harm.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "How have I not seen this til now? Sooo good",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "American History X is the greatest film since Romper Stomper to deal directly with the neo-Nazi movement, and in a similar manner it does it in the most powerful way: through depicting the savage brutality of the movement.\nAmerican History X is one of the most savagely brutal crime dramas to ever be so small scaled and devoted to its characters while understanding the wider world beyond him, as in how his beliefs and actions prove to impact on the people around him. And through a strong screenplay, intense direction, amazing acting and powerful visuals, American History X succeeds in every area.\nLike I said, American History X gets its brutal story dynamics up close and personal with the viewers by shocking them with it. And its all shot perfectly and stylishly so that the hauntingly intense atmosphere manages to thrill viewers with its feel and its look. All the dramatics are shot well with fine cinematography and edited perfectly, even getting a little more intense thanks to the touch of the musical score.\nThe musical score in American History X is immensely beautiful and helps the emotional drama of the story move along as it explores all the complicated territory that David McKenna writes into it.\nReally, American History X is a very complicated film which has a story that touches on dark territory but never crosses the line no matter how hard it pushes. And the screenplay treats the characters well because its so brutally honest with how they speak and think that the product is almost unbearable for viewers. But those who can bear and appreciate it will be amazed by the true quality of American History X. I know I was.\nAmerican History X is an unforgettable film as an intense visual experience and an emotional one, and thanks to the direction of Tony Kaye, it never falls short of its potential or downgrades its utter brutality.\nBut the standout quality is the acting which isn't just amazing, its immaculate.\nEdward Norton's performance is savagely unforgettable. After playing the simultaneously villainous and fragile Aaron Stampler in Primal Fear, he steps up into the almost impossibly intimidating role of violent and sadistic neo-Nazi Derek Vinyard in American History X and gives a performance so powerful and so intimidating that I would be lying if I said it didn't leave me physically shaking. The utter brutality Edward Norton puts into characterising Derek Vinyard's absolute hate for Asians, Blacks and Jews is incredibly poweruful and combined with his muscular stature and the stare in his eyes that pierce the screen as if they see straight into hell makes it the greatest performance of his career. Its easy to play a person that turns into a villain, but its much more difficult to play someone going the other way, particularly one that is covered in violent muscles and neo-Nazi tattoo's. And yet Edward Norton proves how to do it. While the film itself does assist the development by having an emotional atmosphere which is constantly changing, all the responsibility rests on Edward Norton's shoulders as he carries the story through all of its dramatic territory with an immensely powerful and unflinching dramatic lead role. Edward Norton truly is an incredible actor, and his name should be more popular today than many others. Even though he lost the Academy Award for Best Actor to Roberto Benigni for La Vita E Bella (Life is Beautiful) who gave what I deem to be the single greatest performance in cinematic history, he still gave an unforgettable performance packed to the brim with talent that cannot be taught and only comes from deep within the heart of a truly passionate actor.\n\nAnd teamed up with him is the talented young Edward Furlong, the actor famous for his dead-on performance as John Connor in Terminator 2: Judgement Day, the film has a real connection of brotherly chemistry to it to enhance its quality and give it a more powerful impact. And thanks to the efforts of Edward Furlong its successful in that area because he has a powerful confidence to him as an actor which he instils into the role of Danny Vinyard and gives the story a good supporting character to assist in characterising the main character Derek Vinyard. He constantly is a figure of interest and the performance of Edward Furlong is dead on in capturing the emotional drama of the role. His line delivery is fierce and the stare in his eye is damaging, but what is perfect is his physicality which enhances the idea that he is the brother of Derek Vinyard by giving him a sense of intimidation. His gritty physical shell and dramatic depth make him a great cast member in American History X and makes me wonder where his career has gone.\nBeverly D'Angelo gives the strongest dramatic performance of her career in American History X. While she's memorable for her comedic work in the National Lampoon's Vacation series of films, she makes more of an impact for her role in American History X. She shows what makes her a great actress. Its her talent for building a dramatic atmosphere in what she is saying gradually until in one big burst she lets it all out in an explosion of climactic drama. It's incredibly impressive that she, the woman who portrayed Ellen Griswold, is actually the woman playing the mother of a sadistic neo-Nazi and doing it so well with such a passion for the drama in the story. She really is a great actress in American History X, and up until now I've only seen her as a good actress.\nGuy Torry also manages to do a good job due to his consistency as an actor with strong line delivery.\n\nSo American History X is a brutal and overpoweringly incredible drama film which displays the greatest talents of actors Edward Norton and Beverly D'Angelo as well as handling its tricky and dark subject matter so well.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "The performances are solid and the story hits you hard.\nIt is incredibly hard to hate this powerfully emotional film.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "So underrated, seriously well made.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "The storyline is clumsy and often unbalanced. But that shouldn't distract from the fact that this is a shocking, unrelenting, and hugely powerful film.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "Its Norton and Furlong's chemistry that drives American History X. Their acting is incredible and they work so well of each other. The script flows as well, very tight film. Only complaint is that the director makes this film a little too dramatic at times, especially with the insanely over the top soundtrack.",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "Edward Norton is superb in a tragic & powerful film but the ending is terrible",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "This movie made me love Edward Norton",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Ed Norton's best performance! Amazing film on such a disturbing subject.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Very fascinating movie that focuses on social issues. And a great performance by Edward Norton. I just loved how the film uses black and white contrast to explain the past and how the film gave us a look at contemporary America",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "one of my favorite movies ever. depressing as hell but still  beautiful",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "Phenomenal and powerful movie starring the excellent Edward Norton as a white supremacist who is sent to jail after killing some thug who tries to steal his truck. Once he comes out he is a changed man and faces a big battle to save his younger brother from the same fate. Superb performance from Norton.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "One of the most powerful films that I have ever seen. Guaranteed to leave you speechless.",
            "review_date": "2014-01-15",
            "source": "rt"
        },
        {
            "content": "American History X is a hard-hitting, compelling drama that feels like the screenwriter is trying to preach audiences some ideas on race hatred and Neo-Nazism. However, Edward Norton's performance is terrific throughout.",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "A great movie with a melodramatic, illogical ending.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "Amazing movie. I remember we saw it twice during high school - it should be a movie that every person should see when growing up. It shows how racism can not only disturb the whole country, but also the heart of a family - and when one thinks that it has all been left in the past, the backslash comes. And the realisation of how empty of content racism really is... but nevertheless, the past chases you (and those who were affected by your past).",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "Pros:\nGr8 performance from Norton\nPowerful scenes \nGood score and cinematography \nImportant ideas and message, in a way\n\nCons:\nThe film had a lot of ideas, but I don't think it conveyed through as well as it should've. It didn't strike me.\nSome parts were way too slow and didn't fit.\nEnding was kinda Hmmmmmmmm\n\nRating: Probably a B",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Entertaining and dark movie.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Outstanding movie! Has a brilliant message, and it really provokes your mind about just how bad racism really is in our society, the black and white effects were just an incredible touch, and of course Edward norton completely steals the show in this tour de force",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "Powerful. Thought-Provoking but sometimes flawed.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "The Most memorable film i've ever seen. Ed Norton performance is just simply incredible. The message of the movie is one of my favorite ever , Thank you Tony Kaye .",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "WOW that's all I can say. Thank god for Edward Norton.",
            "review_date": "2013-12-23",
            "source": "rt"
        },
        {
            "content": "I remember pretty well when I watched this movie in 1998. I was shocked and intrigued by its deepness and profound message. Wonderfully written, greatly directed and tremendously acted!",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "Ineed ! a compelling , provocative and intense performance by Edward Norton in this crime dram based film . Not only that his Oscar nominated performance too , Making it one of my favorite films and as well as those actors whom I love a lot <3",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "This is not a movie for the faint of heart!",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "It is a low budget film; with a high budget feel with more then satisfying performances by the leads and an intriguing subject matter that is very affective. I liked it a lot.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Violent\nHarrowing\nBrilliant",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "powerful and thought provoking. Still one of the best movies ever made.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "American History X is a provocative, intense, and realistic film with Edward Norton's best performance!",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "Intense, riveting and heartbreaking tale of redemption and growth.",
            "review_date": "2013-12-12",
            "source": "rt"
        },
        {
            "content": "Edward Norton is a brilliant actor, and it can be seen. He is breathe taking in this extremely well done movie.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "The problem is rare today - narrative prowess expressed with technical  ineptitude; it's usually the other way around (i.e., Thor, The Hobbit, Hemlock Grove, countless romantic comedies, countless animated films, etc.)...\n\nOne technical ineptitude of which I speak is the omnipresent, unfitting underscore. The composer was a little to un-insightful. Another is the never-followed rule of thirds. I'm a lover of breaking rules for a purpose, but it just made me feel uneasy and not in the right way. It was awkward and hard to focus and ultimately annoying.\n\nThe famous rape scene was so effective; I felt, no joke, like I was being raped.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "We'll done drama that explores deep themes about racism and it's effect on familying life. Spearheaded by the always excellent, Edward Norton.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "American History X is an unforgettable and provocative debut from director Tony Kaye, featuring a powerhouse performance from Edward Norton.",
            "review_date": "2013-12-04",
            "source": "rt"
        },
        {
            "content": "A raw movie that doesn't cut corners.  Harsh realities and dense themes this makes for a great crime/cultural movie.  My only complaint is that it takes too much time to develop the story.",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "09/03/15 Edward Norton earned a best actor nod or his spellbinding portrayal of a violent neo-Nazi gang leader who ends up in prison for murder. the experience transforms him giving him a new purpose  to save his brother from talking the same destructive path",
            "review_date": "2013-11-30",
            "source": "rt"
        },
        {
            "content": "Not the kind of movie that usually moves me - just too serious issue with a serious approach - but the performance pulled off by Edward Norton is extraordinary.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "The acting could use some work, apart from Norton and Furlong, but American History X overcomes its flaws with an important and relevant message that delivers on a strong emotional front.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "a very violent drama that asks questions a lot and I even knew that but the skinheads are stupid here, you can see it clearly\nI have nothing against about  Edward Norton, but an Oscar nomination was to exaggerated for his role (everyone can act like a skinhead) \nunfortunately, is the message of the film past the people 9 out of 10 always talk about the \"curb stomping\" scene in the movie and that's sad\nthe deleted scenes of American History X on Youtube should let in the film\n\nPS \na classmate to me told once , we call him \"M\", I quote : yes! I found this super funnythe movie is for me a comedy.\n\nHey M you know what was the most fun?\nas Danny Vinyard is killed in the toilet\n\n\"M\" = stupid asshole",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "Feels over-the-top at times but still ends up as a powerful, moving film.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "A thought-provoking story about an ex-Neo-Nazi who tries to end our irrational cycle of hate by first approaching his brother.",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "Wow, talk about an extreme and powerful film! Outstanding performances from Edward Norton and Edward Furlong. One of the more powerful movies I've ever seen.",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "\"Has anything you've done made your life better? Great question from Mr Sweeney to Derek.\nGreat performance of Edward Norton as Derek that in the end can´t scape from his past.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "A provocative and interesting drama with a mesmerizing performance of Edward Norton.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "\"Fuck you!!!!!!!\" - Derek Vinyard",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "no doubt about it best movie ever",
            "review_date": "2013-11-05",
            "source": "rt"
        },
        {
            "content": "This tragic story is brilliantly acted and beautifully shot, but brutal, violent, and depressing. It seems to say that education can change an evil man into a good one, but educating one man at a time is a slow process and we may be running out of time.\n\nAfter the death of their father, brothers Derek (Edward Norton) and Danny (Edward Furlong) fall under the sway of a radical white supremacist. Derek becomes an obscenity-spewing leader of a white gang that trashes immigrant-run corner stores and chases black neighbours out of local parks. He eventually goes too far and ends up in prison for a vicious, brutal murder. While he is out of sight, his legend grows among the skinhead crowd and younger brother Danny goes along with the vitriol (although there are some indications that Danny doesn't totally buy into the Aryan ideology). Finally, Derek is released a changed man and does his best to save Danny from the cycle of hate and violence.\n\nThe movie is told through a combination of present-day scenes after Derek's release and flashbacks (filmed in crystal-clear black and white) of the murder and Derek's time in prison, where we see how he comes to recognize the white supremacists' preaching to be utterly false.\n\nThis is a difficult and disturbing film to watch. I watched it with a high-school teacher whose students repeatedly tell her how awesome it is. Clearly, some teenagers are completely missing the point, which is always a danger when presenting such hate-filled behaviour in a realistic way. The weak-minded will see it as glorifying a point of view that in fact it is showing as utterly abhorrent.\n\nThis film presents a view of a life that middle-class viewers like me have never experienced and I hope never will. I know these attitudes and actions exist, but I don't really know what purpose is served by putting them on the screen.",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "It definitely has its flaws, but they're comprehensively outweighed by its strengths. As for being \"simplistic\" and \"preachy\", I can't agree. The former is true only in as much as its necessary when telling a story like this in a movie rather than a book; the latter I can't see at all - I really appreciated characters not being clumsy stereotypes of either good or bad and, for that matter, that black and white are complex, believable people spread across the spectrum of decency regardless of colour.",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "This is an incredibly powerful film, led by a strong performance by Edward Norton.\n\nFocusing in on the psychology of a young man who turned to neo-Nazism, tracing his increased bigotry following the death of his father, to the slow redemption during a 3 year stint in prison. The film is quite often confrontational, but it is impressively shot, well-scripted, and as well as Norton features a strong performance from a young Edward Furlong.\n\nAn important film, a must-see for any movie lover.",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "WOW-O-WOW, WHAT A MOVIE! Wasn't sure what to expect, my aunty had raved about it but I would believe 100% in her opinion all the time, but on this occasion, she was spot on. This film was brutual, raw and at times a little too realistic. The curb stomp made my mother cringe, the shower scene made me. The acting was superb and overall this film was executed wonderfully.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time, though certainly not one I'd want to see repeatedly.  Ed Norton was incredible.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "Brilliant, sad, Intense. So Far Edward Norton's best film of his career.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "Powerfully disturbing but so incredibly good.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "What an excellent peice of film.  Carried strongly by Edward Norton as his role as a prominent skin head who has extreme hatred for anything outside of the white race.  When he goes to jail for killing a black gang member it changes his life.  I love how the scenes in black and white chronicle the past and his wicked ways as one of the lead skin heads...the scenes in color represent the present...almost as if he can see now...while the past scenes he only sees in black and white. ...a few scenes will grip you and have you wincing...the language in this movie is extremely graphic.  The ending is one that is almost impossible to bear.  Just a tough tough ending with an underlying message.   A must see...Edward Norton at his finest",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "This movie moved my soul, and\n\n\n made my heart ache. I couldn't look away!! Its very different from anything I've ever seen!! Excellent!!",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "one of the best movies I've ever seen. very powerful message.",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "It's ironic that this is a story about racism, because this movie refuses to explore the humanity of its many black characters, and instead uses them as superficial stepping stones to advance the story and moral development of Danny and Derek. I want to know more about the black characters, their lives and hopes and fears. I'm tired of stories about race revolving around how white people suffer as a result of being racist, instead of how black people suffer as a result of racism. \n\nThe story is ok, I'm just surprised it was so fundamentally focused on Derek's humanity, to the point where his murder of two black men doesn't seem as bad by the end because the viewers sympathize with him. Conversely, we know absolutely nothing about the boy who kills Danny. We don't know why he killed and the story doesn't even bother to complicate his life (ex:showing him taking care of his sick mother, or how he got to be in a gang). He therefore becomes dehumanized and villainous. I think every character in the story deserves more exploration and the fact that so many amazing stories are brushed over just makes the whole viewing experience frustrating",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "i'm glad that kid from terminator 2 is still getting work",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "Most people might be turned off because of some of the issues it deals with but get that thought out of your head, because you will see an outstanding film. Edward Norton does his finest work ever and the others follow through and give it their all. The writing is solid and tells a story that is easy to get into and stay interested until the end. Don't pass this one up if you see it you'll learn a lot from it and be thoroughly entertained.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Hard faced look at skinheads and their philosophy in the USA is filmed in black and white as well as color.  Actors show the brutality and family love within the script with confidence and passion.  This is one of the best screen plays that you will see due to the script, actors and general quality.  Nibbles: Black Forest Gateau.",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "This is a film that hasn't aged very well.  It certainly has it's virtues, including a very strong performance from Ed Norton, a really nice supporting one from Stacy Keach, and a fairly realistic depiction of skinhead culture in that time and place.  At the time it came out, the unexpected physical transformation and powerful performance from Ed Norton seemed to overshadow the film's weaker points, which include a bland, Afterschool Special plot and some terrible performances from the rest of the cast, particularly everyone in Norton's one dimensional family and Avery Brooks and Elliott Gould in roles that admittedly give them nothing to work with (although Faruiza Balk does a good job with her tiny little role).  It's really a slick melodrama that does a good job at describing an issue and then completely drops the ball at saying anything interesting about it.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "pola zvizdice vise zbog Nortona :/",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "Some may call American History X preachy, or just downright superficial. I, however, strongly disagree. Although as a Dane I cannot really relate to it as much as Americans can, it still leaves a huge impact upon each viewing.\n\nThe movie has an exceptional narrative, mixing in well placed flash-backs in black and white, while the present-bits are shown in normal colors. We follow a modern Nazi Derek Vonyard through his journey from modern nazi with a deep hatred towards all black people, to a man fighting for equality and redemption for himself. \n\nThe acting is absolutely brilliant in the film, with a powerhouse performance from Edward Norton. I still stand by my opinion that this is his undeniably finest performance of his career as of yet. Edward Furlong also does what many would consider his last good performance until the inevitable consequences of youth-stardom hit him hard.\n\nAlthough at first viewing one could easily say that the movie relies solely on its shock-value at the end to make it so great, but there is a deeper message. It tells us about how your actions may have consequences, not only for you, but for those around you as well. It also tells us how you simply cannot escape your past without cost. \n\nAmerican History X contains a lot of powerful scenes that actually makes Derek sound as a reasonable man with valid points to confirm his own prejudice. Even though we all know what he says is wrong, one cannot deny that he has a somewhat legitimate point. But like I said already, the consequences can and will be severe.\n\nAmerican History X is a surprisingly powerful movie about prejudice and how it may scar you and your loved ones for life, and how your former misdeeds can rub off on others.",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "Incredibly thought provoking. The events and conversations are cleverly sculpted to make the viewer question their ideology. Although that is the case, It would be fair to say time hasn't aged this movie well. The narrative is also a refreshing way to convey a story.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "ed norton was awesome",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "After Requiem for a Dream, this is the best movie I ever seen. It's shocking, it makes you think about what you do of your life.",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Fantastic film about the extremes white supremicists will go to, and is presented in an unflinching and deeply powerful manner. Edward Norton rarely gives anything less than an amazing performance and this is no exception where he completely transforms into the skin-head Derek, proudly brandishing a swastika tattoo on his chest. The movie isn't for the faint-hearted with some harsh violence, pervasive language, and an incredibly tragic ending, but it truly is a great film that also leaves you with something to think about!",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "Great performance but not that amazing plot.",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "Too dark, too depressing .. it made me feel that theres no hope in human kind we just don't seem to learn from others mistakes, or maybe we don't learn quick enough !!",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "Great performances with an interesting style of filmmaking that is half black and white and half in color to coincide with certain parts of the storyline.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "A brutal film with an inspired performance from Edward Norton. American History X is certainly not for the faint of heart but a must see for anyone that has the stomach for it",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "A shockingly powerful screed against racism that also manages to be so well performed and directed that it is entertaining as well.",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "Edward Norton is phenomenal.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Inspirational performance by Edward Norton.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "Top 20 movies of all time.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "Brutal It Leaves A Lasting Impression Thats All That Needs To Be Said",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Powerful, moving, violent, graphic, American history X is all those and more. This story about hate and race reaches an unexpected climax in the end which just succeeds in finally getting the whole movie's point across: In hate lies destruction.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "Salvo por los huecos argumentales, aparentar ser más de lo que en realidad es y el final, Tony Kaye se luce como director en esta poderosa película antirracista fortalecida por las sobresalientes actuaciones de Edward Norton y Edward Furlong.",
            "review_date": "2013-08-22",
            "source": "rt"
        },
        {
            "content": "American History X is about the idea that prejudice and bigotry will kill our children. The idea is that prejudice is a slippery slope. A father's offhanded racist remark over the dinner can lead to unintended consequences. The result, in the world of this movie, is children killing each other. The movie makes a pretty convincing argument that the consequences in our world would be just as dire, that there is no room for even a little bit of bigotry in our society if we are to survive without killing each other.\n\nAmerican History X goes about proving this idea with two main plots: the internal plot of Derek's redemption from being a skinhead Nazi to a tolerant individual actively helping the good cause and the external plot of Derek's attempt to save his younger brother Danny from the brainwashing that ruined him. Derek is successful in redeeming himself, but his attempt to save Danny fails when Danny is shot and killed. This suggests that even if we live with hate in a momentary weakness, that hate will have consequences far beyond the moment. The movie suggests that with hate, there is no such thing as true redemption. Therefore, we are all well-advised to avoid even a little bit of it.\n\nThe movie makes the idea fully believable because of the depths of hate and true redemption Derek goes through. He seemed to have finally won the battle to save both his family's soul when his past all of a sudden catches up to him and kills Danny. This twist at the end makes it impossible to finish the movie feeling good about ourselves that the hero has won his redemption through his trials by fire. It makes it impossible not to think and feel and believe that hate will eventually catch up to all of us if we let it in for even a little bit. Great idea and a great movie.\n\nMy Story Chart of the movie is at storycharts.ca.",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "Great movie! I love the story line and the message it is sending!",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Authentic, riveting, bold, and thought-provoking. This is the kind of movie that will change you as a person. Two thumbs way up.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "There's a difference between film and movies. \n\nThis is a film. \n\nI'm a 15 year old kid. \nAmerican History X is one of the most powerful movies I've seen. This piece of art has three disturbing scenes that make the film so incredible. \nThis movie is worth the watch and will stay with you for a long time.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Not much to say, but if you havent seen this movie you are an idiot! On my top 10 for best movie!",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Thought provoking. Incredible. Must be seen.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Meaningful and provocative, American History X is bolstered by an outstanding, amazing, and all-powerful performance by Edward Norton.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "A violently shocking movie wich shows how a thought that you think it's OK can hurt someone else, even your own family...Edward Norton's character, as his performance, it's precious, for me his best acting. This movie also shows how can that thought change or hurt not only your beloved ones, but your self. Brilliant film. 4/5",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Edward Norton's bloated bullshit hurts the movie. Tony Kaye clearly didn't have his hand in the editing, and it shows. The ending is perhaps the biggest miss of all. I've never seen something so built-up towards and just fall flat on it's face. It's so disappointing to see a movie that has genuine potential fail because of some rich actor's ego.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Really hard to watch but a great movie.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "American history X is a compelling movie with a good narrative and great performance from norton",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "The moment I saw Edward Norton in Fight Club, I knew this guy's a big shot. Anyway, this movie was pretty good itself, no, awesome. I must say.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Edward Norton fought for the ending it has and really pushed his acting ability and the overall story arc and character  development is amazing. check this movie out",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Superb film. It caught my attention from the beginning to the end. Excellent performance by Edward Norton.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "The definition of acting is Edward Norton's riveting performance in American History X. I'll admit at times it is hard to watch, but it is a must see when it's all said and done.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "incredible movie. couldn't take my eyes off the t.v. I highly recommend this movie to anyone.",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "As intense as its message is inspiring, American History X is a movie that gets into your brain and wont leave. Ed Norton gives a very powerful performance as the hate spewing  neo-nazi Derek Vinyard that goes through major changes when faced with doing three years in a jail cell. A film that is as shocking as it is outstanding. Once you watch American History X, it sticks with you. I highly recommend it.",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "A compelling edgy movie with strong social overtones",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Wow this movie is amazing",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "One of the most powerful films I have ever seen. Edward Norton puts on the best performance of his career as Derek Vinyard, a man who has allowed anger to rule his life and is now trying to right the wrongs of his past by ensuring that his younger brother Danny does not follow in his footsteps. Edward Furlong is great as Danny and the chemistry between him and Edward Norton is strong, and  puts on a fantastic supporting performance as Lamonte. American History X is a film about anger, hatred, rage, love, redemption and hope (it's also about anger vs. love). It is very disturbing and uncomfortable at times, but it is still a superb, moving film that is also quite tragic and sad. Highly recommended.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "A disturbing look at race relations in America. Well acted by the entire cast.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Edward Norton was fantastic in this role, and overall the movie was really engrossing. The only thing I would say is that I felt like the racism theme was treated a little too simplistically, perhaps for the sake of entertainment value. I'm willing to forgive that, though, in view of the wonderful performances.",
            "review_date": "2013-07-13",
            "source": "rt"
        },
        {
            "content": "Brilliant film. Strong messages & great acting.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "A powerful performance by Edward Norton makes this magnificently disturbing and intriguing picture even better.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Great performance and a really great story. The ending was ruined for me before I saw it though.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Tony Kaye delivers a masterful directorial debut with his film American History X which delves into dark territory. American History X, for me, was quite difficult to watch. In a world where race equality was always stressed in my surroundings, it truly hit me like a ton of bricks seeing the white supremacist Neo-Nazi movements in American History X. It takes a lot to get to me when it comes to dramatic films, and Kaye had me from the moment the opening credits rolled. The use of black and white cinematography to differentiate between past and present experiences was truly something unexpected for a film about Neo-Nazi movements. Nevertheless, Kaye's motif of black and white filming style showed how the world that he was showing was nothing short of black and white in the eyes of Derek Vinyard. Flashing to the present moments of the movie, after Derek was released from his three-year sentence in federal prison for voluntary manslaughter, we see the colored cinematography seeing that black and white have blended together as one and that a world of color has opened to Derek's eyes just through a simple change of color. A subtle, but brilliant direction choice from a novice director is something that is nice to see! Now, I must mention the sensational Academy Award nominated performance of the spine-chilling Edward Norton (Primal Fear, The Illusionist, Fight Club). Norton's raw performance is the natural highlight of the movie. The clash Norton shows between the reformed and the flawed Derek Vinyard just through his actions is nothing short of a masterful actor in his key environment. Be this as it may, I cannot overshadow the supporting performances of Edward Furlong and Beverley D'Angelo. Furlong's performance of Danny Vinyard shows the necessity to impress a brother through actions not words. Though this ultimately can be construed as Danny's tragic flaw, we see Furlong ace this part in spades. D'Angelo's raw performance as a flawed, ill mother attempting to break through to her two sons breaks your heart during a confrontational scene between Derek and his mother at Derek's prison. Exploring motifs of race, gangs, race riots, prison, rape, antisemitism, and Neo-Nazi movements, American History X delves into uncharted territory for a film from the late 1990's, and shines as an ideal history lesson to the negative sections that darken  American History.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "one of my favs all time. pushed the boudaries quite a bit and thats why i love it. quite possibly edward nortons best performance! if you dont see this movie... your crazy.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Edward Norton REALLY Steals the show in this film but I have to be honest this was a very hard film to watchl.",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "Wow... una película pesada pero con un mensaje muy importante para la vida. No al odio, ni a la discriminación.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "The most powerfully engaging film about racism in America that I've seen yet.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Norton is brilliant as Vineyard in this film.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Still amazing no matter how many times you watch it.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Honestly one of the better movies I've ever seen. It's damn good, and makes a powerful statement you won't soon forget. And that ending...",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "2 years since i watched this movie, and it is still fresh in my mind",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "absolutely one of my favorite movies of all time.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "Edward Norton is strikingly convincing as a neo-Nazi; his performance and character dialogue is enough to trigger a sense of repulse into the viewer but, at the same time, sympathy. The film is as real as Hollywood [rarely] gets...",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "It a movie about ignorant people, and how some people change for the better.",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "It's unfortunate that the dialogue can be so graphic that most teachers will not show it to their students. Understood, but unfortunate.",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "American History X is an incredible film about racism. It's realistic and empowering. Edward Norton's performance is a brilliant one that should be remembered throughout film history.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "I first saw this when I was a sophomore in high school, 16. It is filled with explicit language and racist hatred, and the violence is more disturbing than anything. Unless you are ignorant, you know that the brutality is not being glorified. At 16, the theme was crystal clear. Senseless hate has senseless consequences, despite being done with your past.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Powerful and thought-provoking if at times hard to stomach. American History X takes a hard look at hatred and bigotry and shows us the dark consequences they both have on the human soul.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "A very strong an well acted film",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "One of my library classics",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "Edward Norton and Randy <3",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "The end was really astonishing. I thought Derek is the one that will be killed !",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "Norton gives a memorable performance.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "When films dare to tackle racism it can fall into a trap of just being offensive itself. How much racism and discrimination can one put into a movie before its message becomes lost? I can't be sure on that, but American History X finds a silver lining while flawed gets across its positive message.\r\n\r\nAmerican History X is about a former neo-nazi skinhead trying to prevent his younger brother from going down the same wrong path that he did. The main character are white supremacists which limits the audiences in terms in how much we can relate to them. What is universally relatable is the protagonist idea of hate. While not on the same level as the protagonists we all have been hated or hated someone whether for petty or good reasoning behind it. The most powerful element of the plot is its protagonist. Seeing his transformation and development into a different person is powerfully symbolic. It feels natural, realistic, and even inspiring to have an entirely new perspective on race and life.\r\n\r\nA major complaint on the plot is the younger brother not being as developed. All we know is that he took influence from his older brother behavior and is having trouble at school. He felt secondary despite narrating the story and being a huge focused in the beginning of the film. As for the ending of the film it is shocking not for the right reason. It got acrossed its anti racist message boldly, but at the cost of any emotional resonate with that character.\r\n\r\nAlso in the film whenever a problem occurred when black people were present they would start trouble. The opening scene, a dispute in a basketball game, the scene where Danny Vinyard confronts Little Henry in the restroom, and the ending. It's seemed more than just coincidence, but given the nature of the characters one can't really call it discriminative. It is a major part of Norton and Furlong characters to be racist and these encounters better help illustrate the transformations. Not a major flaw, but one odd observation when viewing that difficult to look past.  \r\n\r\nOf course no review of this film would be complete without mentioning Edward Norton. He's simply at top form here. He is very well believable as a Neo-Nazi as well as the reformed person. It's almost like he's playing 2 different characters and he does that so extremely well. It not just balancing the range of his character, but the dimension of his life. Changing himself psychologically, socially, and politically in natural form to make the root of the film works. It is Edward Norton film and it's because his performance that the film works as great as it does.\r\n\r\nAmerican History X perfectly balances walking a thin line of tackling racism true to nature without ever becoming just a film piece to simply be offensive. It themes are universal, the performance by Edward Norton is easily his best, and overall a great movie with a positive to boost.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "I've seen them all: De Niro in Raging Bull, Hoffman in Rain Man, Brando in On The Waterfront, etc. I don't think any movie performance has topped Edward Norton in this.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites.  Shows how completely awesome Edward Norton is, and how many emotions he can play so wonderfully.  The movie is so intense, but so touching.  I'd reccomend it to anyone with an open mind.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Great cinematography, lots of slow tracking shots, and great use of black and white for the second time line. The acting is good, although Norton is somewhat unbelievable in parts. This would be an excellent character thriller and social commentary except unfortunately devolves into trite melodrama at the end, which is a disappointment. Also a number of aspects are quite unrealistic.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Thats U.S. When we gone Bad!",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "A. A powerful drama, that tell us about the nature of racism, the consequences of it, all propulsed by a great performances especially from Edward Norton.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "A really good movie. Tough subject matter, but a must see.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "A film that deals with racism on its own grounds and is coupled with a wicked performance from Norton, this is a modern classic and gets no less harder to watch no matter how many times you sit through it.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "It's a powerful but simplistic look at the social problem of racism. The main character's transformation is flawed and unconvincing, ultimately undermining the film's good intentions. Fortunately, Norton's performance alone is enough to carry the film.",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "Outstanding performance by Edward Norton his abiltity to make you feel his Hate and to See his passion to change the Effect he did to his family makes this film stand alone from others.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Another Fantastic Film!!!!!\nIf You Haven't Seen This!!!\nPlease Watch it",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Just simply phenomenal!!",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "Very difficult to watch.",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "It was like nothing I had ever seen.  It was beautiful and heart breaking to watch.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Just wow. Intense movie about racism, family, and how much of an impact one has on the other. Some very graphic scenes, do not watch with those under 18.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "Commercialised nonsense",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Another really good film....must see.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Could somebody tell me why Edward Norton didnt win best actor?",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "One of those films I didn't love but which has stuck in my mind. Especially the eating pavement scene.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "A provocative drama that always evokes interest and concern from the viewer. Edward Norton's performance is so vividly expressive, he carries this film.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Excellent thought provoking movie. \"Has anything you've done made your life better?\"",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Extremely good and intense!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Edward Norton at its best!",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "One of the most powerful films ever made, edward norton gives a tour de force performance as a smart suburban boy turned into a monster by the brainwashing of a neo nazi gang leader...the message is powerful and it just may be the best film ever about racial issues",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "All kids should be required to see this!",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "I just saw American History X  for the first time last night. One of the best films that I have seen in years. Edward Norton is superb, as is the entire cast. When I'm still thinking about a movie or book days after seeing it or finishing reading it -  the film maker or author has truly done their job! Only the chosen few manage to achieve this!",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "This is perhaps one of the best movies I have seen in my life, alongside Green Mile, Shawshank Redemption, A Beautiful Mind and Primal Fear. Edward Norton's Oscar-nominated role as the pissed-off-Nazi-loving-skinhead-turned-to-good-boy is simply amazing. I guess that is what made me like this fiilm very much. Change. And a hell lot of racist commentaries and conflicts and some hard-ass copulation (feeling obliged not to write the 'F' word here). It's basically a tale of how this one youth, Derek, affected by the death of his father who died in the hands of a Negro, turns into a Skinhead and becomes extremely racist. Soon his brother, Danny wishes to follow in his brother's footsteps just when Derek is sent to jail. It is from then on that Derek wishes for his brother to turn away from it all. It's quite a good morality story, I will have to say. \n\nOn the technical side, Anne Dudley has also provided a wonderful score for this movie as well. Honestly, I was half-expecting mostly heavy metal, punk, hard rock sort of soundtrack, something which I would usually hear from most skinhead movies, but instead, I got well-written orchestral music bursting from the speakers as the images played by. The cinematography is okay, using black & white mode to depict events from the past and colours for those in the present time. The screenplay is also well-done, inserting small bits of simple everyday humour effectively into the dialogues. The plot may have been quite predictable, but the film makes one fall in love with the characters so much (especially Edward Furlong's and Edward Norton's characters) so much so that, even if one were to have foreseen what was coming in the end, one would still feel emotionally affected by it. At least, I was. \n\nOverall, this is an excellent film which has a good story coupled with high production value. It will definitely be one of my top 5 favourite films of all time.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "Edward Norton in one of his best roles.",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "A very good story & culture study.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Wow! Bold statement about hatred  breeding hatred much!",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "Again Edward Norton so deserve an academy award this movie was very powerful and very well written.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "The character of American History X is what makes the film good, very good. It contains something I can't explain, you'll have to see it. It is a look at a serious problem but it's still a movie that follow an amazing story line. And what can I say about Edward Norton who simply carried all the show, he was out of control. Certified in my top 10 of all time.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "I kept thinking throughout the film that I was watching a Spike Lee film, I knew I wasn't, but I could see him doing something like this but then again, you look at Lee's '25th Hour', and of course it has no relation, but comically, it looks like everything has fallen into place. Regardless of that, 'American History X' is a powerful film with top-notch performances from a fantastic cast.\n\nGiven the way the story unfolds I would have expected this to be based on a book and the way the film opens effectively sets the mood really well and the film is gritty and real. I like the use of Black and White for the flashbacks and colour for the present day, even if I originally thought the film would be all in Black and White given that the only promotional images of the film I saw were in Black and White. I originally wanted more Black and White footage but it worked just using it for the flashbacks and the longer the film goes on the more flashbacks we see. While some might have a problem with the fact that film is told in this way, I liked the non-linear approach with the continued revealing of events that happened earlier in the film and to have more context is always good. It also uses slow-mo at times but it fits for where it is needed. It is a smart film and is executed perfectly; the title is smart as well. Like I said, the performances in this film are fantastic and everyone does an excellent job in a very well chosen cast. Edward Norton is such a fantastic actor and he did so much great work right from the beginning of his career, it's phenomenal, his range of emotions is fantastic and he received a very well earned Oscar nomination. It's crazy to see how long it was until he got another nomination, and even for this role he got snubbed quite a lot.\n\nI do think the script does have some issues though, I think Danny's transformation over the night seemed to happen unrealistically quickly. I know he was being told a very raw story by his brother but if you've been brought up to believe a certain thing your whole life, I don't think the transition would happen so suddenly like that. He might understand where his brother was coming from and I understand the message but the internal conflict would be huge. Perhaps it was because he didn't truly believe that lifestyle that it happened so quickly. I also thought every time that Danny was doing a voiceover he was writing more of his essay, but he wasn't, however, I did like how his story about writing the essay ended with him staying up the whole night. I know it was written into the plot that the skinheads in the prison were hypocrites but they just didn't make any sense, they tell Derek to stop preaching but then accuse of him of not being good to the cause and yeah, right, like he would sit with them after what happened in the shower, which was a very brutal scene. However, despite being hard criminals in jail, one of them still raises their finger when they drink. I also found the black jelly bean being amongst the white ones to be a bit silly, especially given the abundance of white ones, I know SVEN was a skinhead as well but come on and when he spat them out they were all different colours anyway. And would they really be filming a robbery? Maybe to look at and laugh later but imagine if that was found as evidence.\n\n'American History X' is an important, powerful and very memorable film and a very smart one too; it is lead by strong directing and performances and has a very poignant message. It certainly seems like something that would have gained more award attention but I guess it was too raw for them. And it is another film off of the list.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "A movie about redemption, a lesson about the negative impacts of racism, and the urge and necessity of gun control reforms.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "A violent film on a weighty topic. Frank and honest, its characters, actions, and ideas compelling the viewer to look further and become involved.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "This should be required in high schools, this is beyond exceptional!",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "It's flaws can be overlooked because of the sheer beauty of Edward Norton's acting and the thought-provoking script. Brutal, honest and very, very important to watch.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Really good movie but it's kinda generic",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Great story with a lesson that overreaches the racial barriers we create. One of my favorites",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "Edward norton was great in this!",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "this is a really good movie...kinda sad...but good....i loved edward norton in it!",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "one of my favorites no flaws to this movie",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "watched it once again today.. liked it as i watched it for the first time.. beautifully speaks about racism...",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "Every kid in High School should have to watch this and Boyz N the Hood.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "Edward Norton gives a mesmerizing performance in a merely decent film. The single-day (with flashbacks) story structure feels constricting, and the various story threads conclude in a manner that doesn't really gel with everything that came before. Derek's convenient prison buddy and the final bloody tragedy, in particular, both attempt to draw conclusions about the serious issues being explored, but none of it holds together. The film offers emotional solutions to intellectual problems. It all seems profound and powerful at first, but it completely falls apart after thinking about it for five minutes. It's a kind of false catharsis that makes the whole affair a bit hollow. \n\nBut seriously, Norton is incredible.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "Yet Norton's' brilliance would resonate fanatical minds think twice ?",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "Somewhat tame and inaccurate to anyone who has actually studied the White Supremacy Movement and their brutal organizations, but a solid tale of misguided passion, regret, redemption, and alas well, I won't ruin it. Overall, I did like the moral of the story. It provided superb acting skills from everyone involved and will no doubt go down as an instant classic.",
            "review_date": "2013-03-12",
            "source": "rt"
        },
        {
            "content": "Flawless movie with a powerful statement.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "This movie is great. A harsh story, but incredibly well done.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Edward Norton. Period.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "THE BEST MOVIE IN THE WORLD., TO TEACH YOU HOW TO LIVE YOUR LIFE AND WHERE & HOW TO GET EASER ON YOUR LIFE",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "I personally believe this is a movie which every single one of us must watch, the best lesson on why hate is a burden, and why life is too short for being pissed off all the time.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "A well made but equally rough and vulgar synopsis into our war with understanding race hatred.  Warning!  This movie contains one of the most disturbing violent scenes I have ever seen.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "The choice to go against the director's editing wishes to the point of his disowning the film was, in this rare case, a smart move: American History X represents everything that non-linear storytelling should be, as it seamlessly (and logically) develops characters without being distracting or confusing. Norton shines as his Neo Nazi arguments are almost convincing before he effectively harnesses the emotions to show he was wrong.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "An incredibly disturbing, yet poignant and compelling drama that confronts an important topic, even if its not really saying anything new.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Edward Norton. Intense movie. Win!",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Hate is baggage. Life's too short to be pissed off all the time. It's just not worth it.''",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "That's a film about misconception on crime in American social system. but did this pull its job correctly? well, here the work would be sensible by mentioning all those anti racist comments and successfully handles that, but the main problem is the unconvincing plot handling and poor or more  precisely pretentious direction and acting almost all over the film apart from trying harder to be a 'arty film'.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "This movie as amazing. Everyone needs to see it. Ed Norton was fantastic in this movie. Such an emotional ending.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "Loved Edward Norton's performance, one of his bests indeed. It's a dark, violent and provocative story of a Neo-Nazi's transformation from a cold hearted hater into a liberal and acceptable man.  It's compelling portrait of redemption and the destructive nature of racism. Loved it very much.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "Loved this movie. Edward Norton is amazing in this film.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "You may not want to pop it in very often, but that doesn't take away from how outstanding this film is.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "A true lesson in racial discrimination that still exists today. Great script and phenomenal acting by Norton",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "this movie gets to you, you can't ignore its message",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Good but not an easy watch.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "This is not a comedy. Moral of the story? Don't be a hater. P.S. I cried.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "I'm a big Edward Norton fan and he didn't disappoint me, but the movie was distrubing. The take-away moment was Sweeny's (Avery Brooks) question, \"What have you done to make things better?\"",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Awesome movie! One of the best I've seen.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Loved the movie,hated the ending with a passion...kind of makes the point of the god damn movie counter productive.It's like a vicious circle which i think is what they were going for,but some people just hated the people of the opposite race even more after the movie.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorites!",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Got to be one of my favourite movies of all time. Acting is superb, explores many different social and political issues, while still remaining an entertaining and moralistic film. Perfect on many levels, well worth a watch by anyone.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "What a film! A story told through present time & flash backs to a neo-nazi reforming his ways to save his brother. A predictable end but doesn't take anything away from the finish. Brilliant from start to finish.",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "Amazing and powerful.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "It's a cliche but this is a very powerful movie.  Certainly it does not shy away from it's overall topic.  The black and white portions (which is not an accident, but an identifier for Ed Norton's character's belief system) are beautifully shot. One of the best movies I've ever seen, and certainly expected nothing from it when I first saw it.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "This movie is kinda crazy, which makes me like it!!!",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "A convincing and challenging morality piece fueled by a tremendous performance by Edward Norton.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Drab as fuck. Not into it dude.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Great Superb movie Edward Norton is Fantastic if not great in this movie. I recommend if u haven't seen this movie! A Great Drama Movie 5 Stars!!!",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "should watch it if you haven't already...",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Captivating and powerful scenes.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "an amazing film! very dark and sad! a film that shows the consequences people go through because of others actions! love it!",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "As perfect as this film is, the character development is just irrational and the ending seems so contradicting to the movie's purpose. It's an incredible film, with incredible acting, and an equally incredible and moving plot. I just can't give this a perfect score because I think if every event in the first half of the film had taken place for real, the end results would not have been similar.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "Even though it's very Nazi, it'll have you questioning your beliefs. That's scarier than anything else.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "the only thing that I dislike about this film and its nothing to really to do with the film. if you (this might just be me) talk to anyone about this film the only thing they bang on about is the scene where Ed makes the bloke bite the curd arrrrgh its like the point and the rest of the film were completely missed.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Great use of slow motion.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "A genuinely brilliant film. Great acting and the worst scene involving a kerb in cinematic history",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "Edward Norton really shows us what he's capable of in terms of his acting talent.  Edward Furlong does a lot less.  This represents to me an extraordinarily honest depiction of life in the LA of the late 90's.  The ease with which an otherwise intelligent person can let himself slide into all the anger and frustration that racism provides a focused outlet for, the pain and torment of that person once he's realized how far he's ended up from where and who he wanted to be, and all of the horrific consequences involved are portrayed without any sugarcoating or wasted emotion.  This is just an excellent and painful film.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "It's powerful, unique, stylish, and features an incredible performance by Edward Norton.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "Well-acted and damagingly strong in its message, American History X showcases the talent of Edward Norton at the top of his game and doesn't hold back at all, but may be too tough for some to handle.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "Superb, but the kerb scene OUCHEEEEEE",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "One to have our children watch",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "An extremely relevant, and dangerous, topic tackled head on. Edward Norton delivers an historic performance as the redemption hero, Derek Vinyard. Complete with an armoury of  vulgarities, shocks, endearing and inspiring scenes American History  X will definitely be logged in my history books. Astounding.",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Interesting drama I guess.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "Very hard hitting story with some unwatchable scenes from start to finish! All praise Norton in one of the best roles he has ever done!",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "Norton's performance is tremendous, and a very interesting story to go with it.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Everyone's seen this, so why comment. It's just great.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Great actors and a great plot. This movie might be hard to sit through if you have problems with racism. The audience for this movie is a mixed bag, and if you have a problem with violence and discrimination, this movie is probably not the best for you. The ending is sad and somewhat compelling feeling. Overall a great movie if you're into these types.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Some areas of the movie seemed underdeveloped and a little rushed. For one, this neo-Nazi's conversion wasn't strongly convincing. He had 3-4 years to change in prison, we see that it was obviously a gradual process, and still I just felt there was something off, it didn't satisfy me. It might have also been that after watching this dude kill someone with a curb stomp and smile in satisfaction, I was expecting at least to see him rot in jail. But I know that wasn't the point, and I really, really liked this movie. It is flawed but well intentioned. Race hatred is a very sensitive subject to work with, and still the film manages to leave a thought-provoking impression on how racism is one of the most dangerous, destructive ideas out there. And on what an incredibly crucial factor nurture is. Edward Norton's performance was particularly powerful, mostly in the first half of the film: that skinhead nut was so unlike what seems to be his usually mellow self. He deserved the nomination. Stacy Keach and Guy Torry were also very good as the skinhead leader and Derek's prison inmate respectively.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Un film que nunca será olvidado, Eduard Norton, si­mplemente espectacular.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Powerful, that's all I really have to say about this film. I mean, you have to watch it--it's that deep.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Edward norton teaches the lesson of growing up and understanding society.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "I thought this film was very good and educational.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "This movie is so true to feelings and how your actions effect the family as a whole. This movie means so much to me. It's hard to watch",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "edward norton rules! great film, loved every minuite of it.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "EURGH, PERFECT AS ALWAYS.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Very few movies have been able to move me as much as this one. The performances are outstanding- how Edward Norton did not win an Oscar is beyond me- and the story is so real, so engaging that you really feel for the characters. You laugh with them, cry with them, even get sick to your stomach as they try to get by the best way they know how. It's an eye-opener, and it's a film you should not go into lightly.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "not a bad movie, but very violent",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "American History X is about a man named Derek Vinyard (Edward Norton) who (due to his fathers murder at the hands of black gang members), is the head of his family. He was the leader of a nio natzi skinhead gang, but was incarcerated for the murder of two gang members who were attempting to break into his car late at night. Vinyard serves a 3 year sentence, but during his time away, what he sees and experiences changes his view on life. Once he gets out of prison, he sees that his younger brother Danny ( Edward Furlong) has followed in his footsteps. Derek desperately try's to save his brother from facing the same fate he experienced. \n\nAmerican History X is an amazing movie. Edward Norton brings one of the best performances of all time as he plays the role of Derek Vinyard. The movie is extremely violent, and includes extreme racist ideas, but has a positive message none the less, as it battles hate and racism. The film has great writing, a great plot, and great acting as Norton won an academy award for his performance. A must see film, but no child should watch it.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "watch over and over hard hitting and entertaining",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "all time favorite!!!",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Excellent, moving movie.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "beautiful writing. Norton is amazing.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Wildly good movie, although its pretty violent and dark.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "ONE OF THE BEST FILMS A MUST SEE !!!!!!!!!!!!!!!!!",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "A true masterpiece film. It is so heartfelt. The history put into the story of this film was brilliant and really captured a life of someone who can change who they are. The stories of Derek's life in the past before he was sent to jail are done in black in white which made alot of the scenes more dramatic. Edward norton who plays the main character Derek really shows the true changes in a main, from being a total neo-nazi skinhead to a man who now sees the light and has changed his thought about people of different race. Jail changed his life when he meets an african american man. Edawrd Furlong who plays Danny, Derek's younger brother, gets taken into the world of 'white power' while his brother is gone away in jail. This film will change your life and really speak to you on a whole other level. It will move you and may even make you cry.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "A must see for everyone.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "such a great movie. probably one of the best films in both edwards' careers. not too hard for furlong tho eh?",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "Sünge film natsidest. noh, natsi wannabeedest. Väga jõhker ja põnev.",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "Um belo trabalho de Tony Kaye na direção, às vezes dando um tom quase documental ao filme, além de usar surpreendetemente bem o slow-motion. Tem um roteiro forte e um belo elenco. E é nesse último que reside a força do filme. Contando com um visceral Edward Norton, mostrando todo seu leque de nuances. É seu rosto jovem e inocente, indo ao assustador skinhead e passando pelo pânico e arrependimento que ficará por um bom tempo na lembrança do espectador.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "Not the kind of movie I like but well done ...",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen till date! And Edward Norton what bloody mindblowing acting, exceedingly better performance than his much acclaimed Fight Club. A change of character personalities is seen throughout the stretch of movie, showing us both sides of the same story and the idea has been perfectly portrayed by Norton!",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "Definitely in my list of top 10 fave movies!",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "Much better on second viewing",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "This movie had to grow on me. I didn't like it the first time I saw it because it's so graphic. But I like the  message that it has in the end. It's done really well and the actors are good.",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "Very touching movie. Outstanding performance by Edward Norton",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "I love this movie, despite having one of the most violent scenes in cinema history.",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "a good movie talking about an important case that america suffered from it and still suffering from it till now it's the \"racism\" i think not only america suffers from it but all the world suffers from it :/ edward norton was magnificent he.the message of the movie is that u must deal with the people with their personality not with their colour or their religion !!!! it doesn't even matter if they are jewish,muslim,christian,black,white or yellow !!! it's all about their personality and how good or bad they are, the end was realistic when danny died the movie wanted to tell us that \"what goes around comes around\" :/ ,at the first i thought that danny was not playing an important rule in this movie but after thinking he represented how the \"racism\" spreads through the society",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "A tough watch at times, but an excellent movie.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "A truly powerful and unforgettable movie. I have no words for the performances in this film being almost too real, Norton pulls you into the story along with Furlong in a way that makes this film perfect.",
            "review_date": "2012-12-15",
            "source": "rt"
        }
    ]
}