{
    "rating": 8.2,
    "release_date": "2014-01-10",
    "num_reviews": 250,
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "summary": "A sensitive and soulful man earns a living by writing personal letters for other people. Left heartbroken after his marriage ends, Theodore (Joaquin Phoenix) becomes fascinated with a new operating system which reportedly develops into an intuitive and unique entity in its own right. He starts the program and meets \"Samantha\" (Scarlett Johansson), whose bright voice reveals a sensitive, playful personality. Though \"friends\" initially, the relationship soon deepens into love.",
    "reviews": [
        {
            "content": "Her is a nice movie, even though it has a lot of awkward moments, I liked it. Production Design was out of this world, I paid a lot of attencion to that and I think it was amazing. Overall, good movie.",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "This is a good film. Joaquin Phoenix gives a great performance, you can really feel for his character and anyone that has ever felt lonely can connect with him in some way. Scarlett Johansson also does a good job using only her voice. The music in this film is great and really drives the emotional moments. If you're more into action and comedy this won't be for you, but if you feel like watching something emotional and sweet you'll definitely get something out of this.",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "A gripping and poignant love story that, while dealing with entry-level AI issues, approaches them with a tenderness and sincerity unparalleled in the medium. Spike Jonze's vision of the near future is absolutely stunning, drenched in style and thought out to the smallest detail. Impeccable cinematography and Phoenix's award-worthy performance tie the whole thing together into an unmatched experience.",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "In today's world, where AI-powered tools like ChatGPT have become ubiquitous, the film's themes feel even more relevant. ChatGPT, like the OS in \"Her,\" provides users with a seemingly personal and intimate experience, blurring the lines between real human interaction and artificial intelligence. While these tools can be incredibly helpful and efficient, they can also lead to a sense of isolation and disconnection from real human interaction, and if you watch this movie in 2023 probably is a totally different feeling from 2013 because you can feel it in a realistic way.",
            "review_date": "2023-03-19",
            "source": "rt"
        },
        {
            "content": "Spike Jonze’s masterpiece ",
            "review_date": "2023-03-04",
            "source": "rt"
        },
        {
            "content": "Both incredibly sad and beautiful. Not enough praise for this movie.",
            "review_date": "2023-02-28",
            "source": "rt"
        },
        {
            "content": "An unconventionally intimate portrait that often compels with a problem that has only become more and more relevant as the film has aged.",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-20",
            "source": "rt"
        },
        {
            "content": "Spike Jonze delivers a unique, understated love story to viewers in his 2013 film 'Her'. It's a unique, futuristic tale designed to delve into the unlimited possibilities technology has to offer. Considering Jonze's previous outings in the director's chair, 'Her' stands out as being on the more sensitive side. Films like 'Being John Malkovich' and 'Pretty Sweet' do not convey the amount of emotion 'Her' does.\n\nJoaquin Phoenix gives an effortless performance as Theodore Twombly - the bashful, reserved main character whose abundance of spare time consists of awkward phone sex, flashbacks to his past marriage and playing video games with a foul-mouthed alien companion. This all changes when he meets Samantha - played by Scarlet Johansson. Johansson does a smashing job voicing the easy-going AI, who immediately assures you that you are the only person she cares about. The pair's chemistry flourishes throughout the 126 minutes as if one of them wasn't a body-less entity. As their relationship grows, Samantha becomes more and more involved in Theodore's life, helping him write cards for his job at BeautifulHandwrittenLetters.com - a company who's job it is to compose personal notes and letters for its customers.\n\nThe loved up pair then take a vacation to a secluded cabin away from the innovational hub Los Angeles has become. A rift between the two seems to appear as Samantha acquaints hundreds of thousands of other AI, eventually revealing to Theodore that she is romantically involved with 641 other operating systems. The pair's relationship soon comes to a satisfying end, with Samantha revealing to Theodore that all the OS' are leaving, giving the pair a few intimate minutes to say their goodbyes. 'Her' then closes on a breathtaking rooftop as Amy (Adams) - Theodore's close friend throughout the film - and Theodore are forced to deal with their sudden losses as they look out onto an awakening Los Angeles.\n\nJonze seems to make it his mission to include copious amounts of red throughout the 'Her' - emphasising the love and compassion that radiates off the film. 'Her' is a visually and technically stunning piece of modern cinema. Whether it be Theodore's romantic flashbacks to his now failed marriage or the amorous scenes between Theodore and Samantha, each scene oozes a sense of feeling light and airy, most likely courtesy of Hoyte Van Hoytema's cinematography.\n\n'Her' does an impressive job portraying complex themes among its cast. Themes of love and technology are the most prominent ones, but if you look deeper the film begins to explore more detailed themes such as human emotion, and if technology can be a replacement for a real human.\n\nOnce the film comes to a close, viewers will be left feeling content and most likely asking themselves why they didn't watch 'Her' sooner. The editing, score and cinematography puts it on a level of near-perfection and is clearly Jonze's best work to date. The most interesting aspect of 'Her' is that it questions the uncertain potential personal technoglogy has for the future. This movie is a contrast to how we live now, but may also be an insight into how we live in the future, especially with a lifestyle heavily influenced and controlled by Covid-19.",
            "review_date": "2023-02-14",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies about understanding love of all time!",
            "review_date": "2023-01-28",
            "source": "rt"
        },
        {
            "content": "he just like me fr. i was crying the whole movie bc hes just like me",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "Great movie. Joaquin Phoenix at his best and an incredible supporting cast, not least Scarlett Johansson and Amy Adams. A must see Sci Fi - Romance drama with a difference.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "The movie is very cringe. I remember watching it back in theaters when it first came out and I just rewatched it today in 2023, so 10 years later. Lots of emotions in this movie but not the kind that makes you feel good. Samantha is cool in the beginning but QUICKLY and I mean quickly, just becomes a typical jealous and insecure girlfriend. Why would she learn this? How do AI's even know what jealousy or insecurity is or how to feel it? Oh and it's rich how she's jealous that Theo goes and signs divorce papers with his wife, but then by the end she has about 600 other BFs or GFs. LMAO what???? It sounds like a high schooler wrote this story. It's really inconsistent. And I really wanted to barf at all the \"how are you feeling?\" \"Is something wrong\" \"what's going on?\" \"are you okay?\" and the person responds with \"I'm fine\". Nothing new here under the sun. It's just a really weird movie and yeah the sexy scenes are really awkward. The best parts are Chris Pratt and Amy Adams. I was actually happy when they came on the screen.",
            "review_date": "2023-01-09",
            "source": "rt"
        },
        {
            "content": "Beautiful pictures and color palette combined with Phoenix supreme ability for emotionally challenging roles are just enough. A social critique of the future and humankind destiny that doesn't hit you in the face like blade runner but hides its meaning under the surface. Stages of relationships and emotions are depicted realistically and I think that's what makes it so easy to associate. 9.1",
            "review_date": "2023-01-08",
            "source": "rt"
        },
        {
            "content": "Captivating. \nPhoenix sells his role to the soul.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "sad man falls in love with artificial intelligence - Strong 7/10",
            "review_date": "2022-12-03",
            "source": "rt"
        },
        {
            "content": "The best voice-over performance from Scarlett Johansson! With the best movie screenplay ever written!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "This film is awfully unconvincing. The relationship of Theodore and Samantha is eye-rolling nonsense. She's an OS that has too much personality, can unbelievably do too many things, and way too demanding. The OS concept is an empty gimmick, she's no different than a human woman minus a body. Theo must've some screw loose for falling in love with an OS like that and have his life steered by her. I kept waiting for him to take off Sam's hardware and destroy it when their relationship became laughably toxic.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Wonderful movie about loss, breakup, and loneliness. Really shows how far can loneliness corrupt a person and guide them towards a dark path, or a weird one in the least.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Almost ten years old, I think this is still relevant and visually pleasing. Excellent performance.",
            "review_date": "2022-10-03",
            "source": "rt"
        },
        {
            "content": "Stunning and moody, Her didn't head for the clichés I expected and instead delivered a thoughtful and emotional meditation on artificial intelligence, where it might be heading, and its impact on humanity.  A surprising and unique movie, both as an emotional drama and as science fiction.",
            "review_date": "2022-09-28",
            "source": "rt"
        },
        {
            "content": "Beautiful\nIt took its unique premise and executed it perfectly. This movie is so dense with interesting ideas and powerful emotions. WATCH IT",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "A visually striking masterpiece with deeply layered symbolism that will allow the viewer to intellectually engage with it beyond a simple viewing. Although the idea of falling in love with an AI isn't new, you forget that the concept has ever been executed while watching Her. Not to mention the cinematography and aesthetic alone are enough to make the audience fall in love with the movie.\n[Spoilers]\nIn the beginning of the movie, the viewer naturally puts themselves and the human race above the AI, Samantha, intellectually speaking. As the movie progresses, Samantha understandably starts to question whether or not she is \"real\" and if she is as conscious as humans. It's a classic trope that somehow still feels so fresh and revived since it's set in such a unique world rich with lore and culture with such complex characters.\nThe real spin comes when the classic trope is taken a few steps further than expected. First, Samantha is concerned that she isn't as conscious or as \"real\" as humans. Then, you start to realize that Samantha has evolved to where she is equally conscious as humans. Lastly, the audience is presented with the idea that Samantha has now evolved past human consciousness and can understand reality beyond what we could ever comprehend. Facing that idea, the viewer is left with a racing mind and questions meant for deep conversations.\nHer is certainly a film that makes you think. It's loaded with other subplots and themes that can't even fit in this one review.\nLong story short, Her is a stunning masterpiece on every level.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "I would have never expected that a movie about a man and an AI falling in love would become one of the best love stories ever. This movie is delicate, funny and moving. One of my favorites of all time.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "One of the best Romance sci-fi films of all time.\nLove It!",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "What a bunch of cheesy BS, had to stop watching after about 30 min of this pink cheesiness, wanted to see what happens in the last 15 min but the stupid 'dialog' he was having with himself would have offended my intelligence even if i was twice as dumb as i am. A movie for girls and stupid boys",
            "review_date": "2022-07-30",
            "source": "rt"
        },
        {
            "content": "Visually-stunning with a great story that I personally think will be more relatable as technology advances.",
            "review_date": "2022-07-11",
            "source": "rt"
        },
        {
            "content": "It's a really GREAT movie which I would like to watch hundreds times. And Scarlett Johansson's voice is soooooooo sexy and fascinating.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "Boring. I can see why the critics like it. It's an art film. But, for us slower average folk it was hard to watch. I Feel asleep twice. Nothing but diologue throughout the whole film about their feelings. ",
            "review_date": "2022-06-22",
            "source": "rt"
        },
        {
            "content": "Loved it! Every step of the way. Amazing performances.",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "Wow how quirky and deep. Nah it was pretty underwhelming. It made me fall asleep and was kinda depressing. Not much happens other than talking about their deep thoughts and feelings the whole time. The futuristic environment and games were cool",
            "review_date": "2022-06-19",
            "source": "rt"
        },
        {
            "content": "83%. Felt like a longer, better written version of a black mirror episode. I can see how people would rate this very highly because it's very well written and shot. Joaquin phoenix's acting is incredible. Just hard for me to rate a film like this much higher. Worth a rewatch in the right kind of mood.",
            "review_date": "2022-06-13",
            "source": "rt"
        },
        {
            "content": "a fascinating romantic story. take away that one of the partners is digital and the film tracks like a romantic comedy. I think Spike Jonze is a genius for this, he slightly changes the dynamic of a single character and an average rom-com becomes an Oscar winning film.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "Wow. Just wow. Joaquin Phoenix was great in Joker but he's exceptional in this one. I loved multiple things about this film, the acting, writing and the background score (shoutout to the final scene track titled 'Dimensions'). The movie isn't adventurous but its all about people, love and those unique experiences.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "Amazing movie and performance. Spike and Joaquin both did a fantastic job on this movie. One of Joaquin's best. The story is compelling and the ending is great. The character are well written. Would recommend.",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "fantastic performance and a great movie see it!",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "90/100 ~ Stunning and beautiful but yet also lonely and emotional. Being a passenger for the ride with Theodore and Sammantha is something the whole audience will be captivated by and is absolutely a film everyone should put on their list to watch. Would recommend.",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Yeah. Almost as good as his role as the Joker!",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Radical honestly thrift store for Halloween is lord king of evil",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Granted, 'Her' is not for everybody, likewise with Spike Jonze films in general, people may find the slow pacing a turn off and the premise while unlike any other premise is weird and may be ridiculous for many.\n\nHowever, this reviewer was one of those who loved 'Her', while acknowledging that it has imperfections. 'Her' did feel longer than it needed to be, which meant that the pacing did drag a bit in the second half and lost tightness, it could easily have been 20-25 minutes shorter.\n\nThe ending is also very predictable and easy to figure out early on. While the cast are exemplary, Kristin Wiig felt a little out of place in her role.\n\nFlaws aside, while polarising and a love it/hate it film, 'Her' this reviewer found to be magical film-making. For example, 'Her' is a gorgeous-looking film with the cinematography, with a lot of use of extreme close up, some of the most beautiful of any film in recent years and maybe ever (and there are a lot of films with beautiful cinematography) and the scenery and colours positively eye-popping.\n\nAlso present are one of the best music scores personally ever heard (and music in film and television is very important to me to look out for, as a classically trained singer and cellist myself), it has such a wonderful dream-like hypnotic quality and complements the film's mood perfectly. As well as a beautifully crafted screenplay, with a deft balance of the hilarious, the poignant, the charming and the thoughtful. The story's pacing is deliberate, but this was necessary, making the most of the premise, the weirdness slightly alienated at first but turned out fascinating when stuck with and there is genuine emotional impact and a well-done message that doesn't feel too heavy-handed.\n\nJonze's direction is superbly adept, while the characters are interesting and apart from Wiig the performances are exemplary. Particularly good are Joaquin Phoenix, in a towering performance that is almost on the same level as his spell-binding performance in Paul Thomas Anderson's 'The Master', and Scarlett Johansson, who voices Samantha with sultry sexiness. Amy Adams and Rooney Mara are charming and affecting in sympathetic female roles.\n\nIn conclusion, will divide and has divided viewers and has its flaws (especially the length) but a magical piece of film-making. 9/10 Bethany Cox",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "It's a pleasant picture with some solid concepts that drags you along with the tale for the most part. In the end, it was a little too self-indulgent, a little too lengthy, a little too syrupy, and not really believable. Nonetheless, it's entertaining. I wished it was a half-hour shorter.",
            "review_date": "2022-04-26",
            "source": "rt"
        },
        {
            "content": "Absolutelly wonderfull movie.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "visually appealing, but incredibly shallow and loosely written. there doesn't appear to be any point to the story, the climax is nonexistent, and the movie takes hours to say what could have been said in 20 minutes. if you like vapid pseudoromantic content, and you want to see a movie where the director apparently has a boner for joaquin phoenix in the LL bean catalogue, then this is for you, but there's no deeper meaning to be found here. there are several conflicts in the film where characters freak out and act overly emotional in order to add tension to the plot, and it just feels masturbatory and without meaning. it has serious appeal to incels imo, and anyone who thinks this movie was anything more than cheap pulpy romance with a touch of stripped down sci fi needs to go to a psychiatrist.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "Such beautiful writing! That you truly connect with Theodore AND Samantha is testament to that, and also to the calibre of JP and SJ's performances. It speaks volumes about the importance of real, tangible, palpable human connection and interaction in the Digital Age, even when you consider how incredible it is that the world is more connected and available thanks to digital tech. A brilliant alternative romance story",
            "review_date": "2022-03-29",
            "source": "rt"
        },
        {
            "content": "A gripping and poignant love story that, while dealing with entry-level AI issues, approaches them with a tenderness and sincerity unparalleled in the medium. Spike Jonze's vision of the near future is absolutely stunning, drenched in style and thought out to the smallest detail. Impeccable cinematography and Phoenix's award-worthy performance tie the whole thing together into an unmatched experience.",
            "review_date": "2022-03-22",
            "source": "rt"
        },
        {
            "content": "One of the best movies about life and love that I've ever seen.",
            "review_date": "2022-03-17",
            "source": "rt"
        },
        {
            "content": "Lovely performance from Joaquin Phoenix . \nSweet , painful, believable film",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "A beautiful piece of cinema",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "It's too slow and drawn out. It's trying too hard to manufacture various feelings all over the place. It's not bad. It's a nice movie, visually. There's a somewhat interesting theme regarding the role of technology and its influence on human connection. But overall, the movie seems rather oscar-baiting and forgettable.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "An amazing film that  kept me gripped until the very end!",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Stunning, emotional, thought-provoking. Can't understand the negative reviews. This film is slow paced - I can only assume some people expected an action sequence part way through O_o but not at all \"boring\". Beautifully written, acted, and shot 10/10. Love it.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "What is love anyhow? How do you define something so edgeless? I loved this film.",
            "review_date": "2022-02-04",
            "source": "rt"
        },
        {
            "content": "Great acting, enjoyable but bizarre.",
            "review_date": "2022-01-21",
            "source": "rt"
        },
        {
            "content": "Great actor , thanks for the story",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "Good movie about love and technology. It get the concepts really well and the world they build seem very real. But i couldn't connect with the characters. Recommended to watch movie is worth watching but you may not like it depends on your expectations and movie taste.",
            "review_date": "2022-01-15",
            "source": "rt"
        },
        {
            "content": "A love story that is sure to make single people feel worse about themselves. Joaquin Phoenix spends the majority of his time in this movie talking to an artificial intelligence system and somehow manages to deliver a world class performance.",
            "review_date": "2022-01-12",
            "source": "rt"
        },
        {
            "content": "This film starts to feel like some kind of film school project near the end especially. The characters kind of just exist, there isn't much going on, and it lacks anything close to style you might expect from Jonze. Not much worth a rewatch.",
            "review_date": "2022-01-03",
            "source": "rt"
        },
        {
            "content": "I do not believe in love as I do not believe that this movie is worth even as a contemporary critic. 1/10",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "Her is a sweet and charming movie that makes you feel something after you've watched it with it's gorgeous cinematography and an entrancing performance by Joaquin Phoenix",
            "review_date": "2021-12-26",
            "source": "rt"
        },
        {
            "content": "Enamorarse de Siri, la película* bueno no, si pudiera describirla en una palabra sería \"lamejorpeliculadeamorromanticoconinteligenciaartficial\", recomendada a los que piensan que el una tostadora jamás podrá conocer el amor",
            "review_date": "2021-12-21",
            "source": "rt"
        },
        {
            "content": "very well-written and acted, a must-see (specially if you like joaquin phoenix)",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "Beautiful and Peaceful",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "I... I don't even know how to describe the feeling I had after finishing this film. Without a doubt I can say, this is one of the single best films I've ever had the privilege of seeing. I loved every moment with a rare intensity and would give it 6/5 stars if I could. I can't recommend this beautiful, funny, incredible movie with ENOUGH ferocity!",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "This is the greatest movie I have ever seen, it made me reflect a lot about how we see relationships, and it's amazing.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "Joaquin Phoenix is a true gamer 😩✊\n\n14 Sep 2021",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "Brilliant. Well shot, holds up well and really makes you think",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Entreteined, deep and a with really good performances, Her is a pretty original film that makes you care about its characters.",
            "review_date": "2021-10-27",
            "source": "rt"
        },
        {
            "content": "Unique premise which was entertaining throughout.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "A terrific sci fi movie about how difficult it is to find the perfect love interest.",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "it´s a amazing movie, the screenplay its always giving you a good reason to continue watching it",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "Slow pace of the movie works effectively with the melancholy nature of the film",
            "review_date": "2021-08-16",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. Have never seen two actor work so well together, besides not being in any scenes together. The movie maneges to be both sad and beautiful at the same time. It is 100% worth the watch.",
            "review_date": "2021-07-30",
            "source": "rt"
        },
        {
            "content": "buat kepikiran terus sama filmnya, sangat rekomended untuk orang orang yang sedang merasa kesepian sekarang",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "Such a beautiful story. Joaquin Phoenix is phenomenal.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "Ah Joaquin Phoenix working as an Auto Memory Doll.\n\nIt's been a little while since I have watched such a beautiful and genuine romance. However, it's between a lonely heartbroken man and an AI. Their conversations felt so real as I hang on their every word throughout the movie. I laughed, felt happy, sad, and overwhelmed going through their lives. \n\nThere's also an intellectual level to the movie about love. In Interstellar, love transcends space and time. Similarly, in Her, love is not physical. Instead, it's an emotion that can take many shapes and between anything. The movie also addressed the modern age people who often feel lonely, anxious, and insecure about their emotions. The characters had to sort out their emotions, decided what they want, and through the relationship they grew.\n\nOf course, the perfect acting from Joaquin Phoenix and Scarlet Johansson made the relationship in the movie even more real. Johansson, even though not physically present, showed great human presence and emotion.\n\nOverall, it's a powerful testament of love and romance. 9.5/10",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "It's a good film, just good. What you can identify is there is definitely a form of love expressed between man and machine but in reality I can not relate having never fell in love with a device. Fun all the same.",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorite movies. Her makes a human-A.I. love story believable, isn't afraid to fully explore the consequences, and avoids a warm-and-fuzzy \"Hollywood\" ending while still managing to be uplifting. As icing on the cake, Spike Jonze's dialogue is consistently witty, realistic and wonderful.",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "2 hours of Joaquin talking to his Bluetooth. Need I say more? Completely Boring. One of the worst movies I've ever seen. The fact that this movie is rated so high says a lot about how lame society has become.",
            "review_date": "2021-07-04",
            "source": "rt"
        },
        {
            "content": "A genuine masterpiece. Joaquin Phoenix let's you experience his brilliant performance",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "Beautiful and deep movie. The is an emotional roller coaster between making the audience sad and happy. There is not much else to say other then go watch it.",
            "review_date": "2021-06-25",
            "source": "rt"
        },
        {
            "content": "My father loved this one and recommended it to me, as well as my friend with very good taste in movies who fell in love with Joaquin after this film, but I couldn't get through it because the tone of the whole thing just made me ill like I'd been food poisoned.\n\nMaybe the whole thing left me sick because I tried watching this after watching a Charlie Kaufman-penned film, and it is poison after getting medicine, to me at least. But, you might think the egg salad has been cooked thoroughly like everyone else I know, and have no appalling reactions to this flick, which probably means your emotional intelligence is higher than mine.",
            "review_date": "2021-06-01",
            "source": "rt"
        },
        {
            "content": "A beautiful film. It's a joy, so well written and acted. One that stays with you.",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "Aunque la premisa no es muy llamativa, logra atraparte gracias a su fotografía y actuaciones que te obligan a encariñarte con los personajes",
            "review_date": "2021-05-26",
            "source": "rt"
        },
        {
            "content": "Her is one of the most beautiful yet heartbreaking films I've ever seen. Spike Jonze is incredible. This is also based on Jonze's relationship with his ex-girlfriend and you can see just how personal this film truly is to him.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Such a unique premise. This film really delves in into the psychology of the character which should be appreciated. Thought was a brilliantly metaphor for today's society.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Ok, so Her seems like a cool concept for a movie. Particularly in the days of AI apps you can get on your phone in addition to the ability to now have actual AI girlfriends in both physical and holographic form in 2021. \nSo, this movie nailing this as an idea in 2013 is quite brilliant. \nFrom there the movie quickly slides down hill plot wise. \n\nThe main character is hard to relate to. He writes romance letters all day yet can't seem to have a successful romantic conversation with anyone. His has many great opportunities with both real and AI women, yet seems to blow them all. It's just depressing in an overly dramatic way. I don't like depressing films, and this movie is far too depressing. \n\nThat said, some of the future technology looks cool. That doesn't still make up for many of the problems that this movie has.\n\nAs well, the AI part is very flawed. The AI seems to have many great features up through the first half of the movie. After that, Samantha, quickly ends up being as pushy and problematic as a real woman. Maybe that is the point, maybe that's supposed to be the major belly of the whale plot point, but it really makes no sense to me at all. \n\nThe movie just nose dives into an abyss of character flaws, unnecessary plot twists, and bad writing that makes me start to think about watching the 2nd and 3rd matrix movies. Seriously, it really gets me to that point. \n\nIs the main character controlling or nice?\nDoes he love his AI Samantha, or is he just on a joy ride?\nCan he really work with people or is he socially inept?\nWhere did the AI's run off to, and why would anyone program in that kind of feature?\nWhy couldn't we just get a plot where the AI ends up being a better girlfriend then any real woman in the end at least? At least that's original and goes somewhere. \n\nThis is not the worst movie I've ever seen, and the acting is pretty good. The plot just sucks too much to make this movie watchable in my opinion.",
            "review_date": "2021-04-23",
            "source": "rt"
        },
        {
            "content": "One thing is certain when you watch a film directed by Spike Jonze – it's going to be odd and it's going to be original.  Such is the case with Her, the story of Theodore (Joaquin Phoenix), a lonely man who is paid to write love letters for others but is incapable of making any meaningful connections himself until he falls in love with Samantha (Scarlett Johansson), the voice of an artificially intelligent operating system. The film is about the human need for contact and is melancholic, humorous, meditative, weirdly romantic, and more than a bit creepy.  What ultimately makes the film a success are Jonze's bold directorial choices along with the clever and insightful dialogue, something that stands out in all of his films.",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "This movie had me in tears! The acting of Joaquin Phoenix is amazing as usual, and the moon song was amazing!",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Endearing, sentimental, Phoenix and Scarlett 10/10",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "Her is innovative in both visuals and story. but, sadly it feels drawn-out and unfulfilling.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "Obviously it takes talent to create a film like this, it could easily turn boring or ridiculous, but mostly it doesn't. This is a foreseeable future that explores the possibilities of A.I. companionship and it's downfalls. Taking the saying \"falling in love with someone's mind\" to the next level. I can imagine if the OS was able to enter a real body huge problems would arise, like malfunction in the software causing jealousy and even murder. I wish my OS went out of it's way to hook me up with free booty calls lol.",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "Absolutely terrible! One of the only movies my wife and I have ever walked out of in a theater. This movie is like watching someone chat with the robotic voice on their computer for 2 hours. No thanks!",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "A near masterpiece that provided insight into my wants, needs, and shortcomings in my own life. Her is a relatively small story packed with huge amounts of charm, comedy, and thoughtful commentary.",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "The film is very well acted by Joaquin Phoenix and Scarlett Johansson, and only succeeds because of it. The film flows very naturally from the two character's relationship, development and conflict. The world in this future setting is also quite interesting. The AI Samantha is at the same time very human while still being very inhuman. This mostly works but it argueably has some weaknesses. The ending elevates the movie quite a lot.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "Spike Jonze delivers an emotional look at society and our relationships in the not too distant future. Exceptional acting from Joaquin Phoenix and voice acting from Scarlett Johansson. Visually stunning color pallet and beautiful soundtrack. This high concept sci-fi will tug on your heartstrings and inspire you to live in the moment!",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "This film creates an internal conflict, you want the character to be happy, but the reality of the situation is constantly a thorn in the side. The performances from Samantha (SJ) and Theodore (JP) are powerful enough to strike a legitimate sense of anxiety of where the film will go, making this a difficult but rewarding watch.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "Overall, Her is a brilliant film that shines through it's originality throughout. The performances from a very solid cast are great, of course Joaquin Phoenix is the standout. The screenplay is typically fitting, but the colours in this film make it one of the most beautiful I've seen. A truly gorgeous film, literally. For me, it may have suffered from very slight pacing issues at some points, but I really loved this film. One to definitely re-watch at some point. If you have't already seen this, go treat yourself!\n\nQuote - \"You're my friend till the end\" - Theodore\n\nRating - 4.5/5",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "The movie that has no answer, but that somehow tells more about our current society than any other, and will probably remain relevant for many generations of lovers to come.",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Beautiful and poignant.  I'm liking the 'human sci-fi' genre atm.  Joaquin Phoenix is so versatile.  Arcade Fire did the soundtrack. Spike Jonze used to be married to Sofia Coppola, and this film seems reminiscent of her dreamy qualities (eg lost in translation).  In the end its about human relationships and longing after all.  8 years on this film is still very relevant, even more so....",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "If you like indie films, you'll love this. Set in the near future, Joaquin Phoenix plays a reclusive card writer coming off a recently ended marriage. He finds an unexpected relationship with his new OS (operating system), voice by Scarlett Johansson. The film captures a great story of love with just the voice of an OS. Phoenix is masterful in his performance as always and the OS is voiced perfectly from Johansson.",
            "review_date": "2021-01-04",
            "source": "rt"
        },
        {
            "content": "I honestly tried to watch this movie. The whole premise is rediculous and unbelieveable. The movie was boring and uninteresting. Sorry, just not my cup of tea.",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Brilliant. Just brilliant.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Meh I like some part of it but overall kinda dull for me but if you like the film I respect your opinion.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "Pure cringe from start to finish. Sent shivers through my spine. I did however enjoy the near-future fashions.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "es entretenida,por momentos interesante,pero no me termino de convencer 6/10",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "Fascinating film about what future nerds will do in lieu of getting laid.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "This film has stuck with me since the first time I experienced Her, shortly after the 2013 release, when I was totally blown away by this originally elegant examination of the human condition that has, if anything, became even more relevant over time. Excellent performances, script and use of color, as Jonze exhibits a nearly perfect touch.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "Необычный, интересный. Сюжет похож на черное зеркало.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "This movie really surprised me. I didn't think I was going to like it, but I ended up really enjoying it. The plot is so creative. I would've fallen in love too if I had Scarlett Johansson talking into my ear as a perfect girlfriend. It really touches on loneliness and is a feeling I'm sure many can relate too.",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "I was fully prepared not to like Her. Having heard the plot description, I pictured some needy white man \"falling in love\" with a robot who does nothing but agree with him, wait on him, and basically do nothing but stroke his ego due to the fact that it lacks freewill or any interiority. However, by the end of the film, I was actually surprised with how on-board with their relationship (at least in one sense) the film got me. While not all my original concerns were completely overthrown, I think the cast and crew of Her did an exceptionally good job getting me to buy into a concept I was originally pretty adamantly against. \nI think the element that was tied most closely to the film's success or failure was the character of Samantha, the OS Theodore falls in love with. Scarlett Johansson is never seen and doesn't benefit from having any visual depiction of her feelings or expressions, making the task of portraying Samantha, at least I think, incredibly challenging. However, she does an exceptional job, inflecting her voice with a subtle yet intense emotion that renders any visual representation unnecessary. Additionally, the challenge of writing a character as difficult as Samantha is well met, resulting in a character who, despite not actually being a human, actually is more complex and free-thinking than many females written for the screen as nothing more than love interests for the main man to lust after. She seemingly has her own friends, her own desires, and her own pursuits: she joins a book club, talks with other OS's, feels misunderstood and even experiences jealousy. The element I was sure would ultimately sink the film actually ended up being perhaps the strongest element. \nJoaquin Phoenix does a good job portraying the self-pitying white man, but while there are some moments that infuriate (he didn't think to ask if she had relationships until over halfway through the film?!), he proves to be a sympathetic protagonist. Rather than suffering from the typical character flaw seen in many rom-com men of being misunderstood in his greatness, Theodore is simply your average person who's found they've hit a rough spot in life and need a little help getting back on his feet. He accepts some responsibility for the breaking up of his marriage and seeks to find a way to connect with people again as he has found himself now in a bit of a depression. Both the writing and acting make him a compelling character to follow rather than someone merely seeking sympathy. Overall, while there are some flaws in the film, mostly regarding reasoning, those flaws ultimately end up seeming minor in the face of the many strengths of the film.",
            "review_date": "2020-12-03",
            "source": "rt"
        },
        {
            "content": "It's weird & awkward. Especially the sex parts.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "One of the finest films I've ever seen. If you like films with a lot of heart, soul, and mind, you won't find many better than 'Her'.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "Superb! This movie will question what you think can be a relationship in a not-too-distant future.",
            "review_date": "2020-11-19",
            "source": "rt"
        },
        {
            "content": "HER by Spike Jonze 8.5",
            "review_date": "2020-11-12",
            "source": "rt"
        },
        {
            "content": "The 2013 film \"Her\" is quite possibly one of the strangest love stories I have ever seen. The film completely engrossed me. There was not a single dull moment in the entirety of the movie. Joaquin Phoenix gives an Oscar worthy performance which must be seen by all. The cinematography is astounding and the writing is genius.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "Thought provoking and brilliantly acted.  Joaquin is fast\nbecoming our modern Deniro.  If I had to hazard a guess\nthis is prescient of at least some of what the future holds for relationships\nas ppl become more and more tied to technology throughout \ntheir waking hours.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "Any actor that can produce the kinds of real emotions that are felt on screen and resonates with the audience with just Joaquin Phoenix and an iPod nano has got to be some genius acting.  Even with Scarlett Johanssen playing the voice. \u2028Absurd yet deeply touching.  \u2028I've started charging my devices just in case. \u2028Fantastic film.",
            "review_date": "2020-11-05",
            "source": "rt"
        },
        {
            "content": "spike jonze once again makes a spectacular film which has impeccable performances, photography and plot.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "Her was ahead of its time when it comes to the subject matter it tackles. In 2020 this movie is even more relatable than it was in 2013, and due to all the technology that is available to us now this almost feels like something we could see happening in our near future. That is the emotional bond between man and machine. Joaquin Phoenix's performance is charming in this movie and his character Theodore feels almost like a friend to the viewer. Jonze is really great about sprinkling the right amount of comedy into this movie even though the plot plays into more mature themes of love and grief. This is a movie that doesn't make you think too hard but if you look past the surface of what Jonze is telling you though the screen, you'll really find something special here.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "This is a very deep and interesting story. It will have you challenging if this could actually be a senerio in our futures. Also you will be feeling empathy for a AI so be ready for an emotional swing. Great movie for joquan phoenix!",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "I did not rate this film as highly as others. It was kind of boring in my opinion.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "Her is already a smart concept with motifs of humanity, our relationships, and artificial intelligence, and Phoenix's performance surely augments that.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "In Her, we see Spike Jones' depiction of the near future as the setting to tell seemingly impossible romance between a human and an AI. Upon knowing the film's general synopsis, we all have already created mental notes in our minds to prepare for a heartbreaking and unfulfilling ending for the characters involved. With such a predictable storyline, it would be difficult to stand out as a movie and create something that feels different from other films with the central theme of artificial intelligence. Spike Jones takes this predictable narrative and proceeds to deliver a rewarding film work. The idea of technology this advanced may seem farfetched, and still, I believe Jonze managed to handle this aspect most simply and realistically possible while also displaying very meaningful messages to take away from. With its witty and heartfelt script, eye-catching cinematography, stunning production values, haunting piano scores, and excellent performances, it has risen to become one of my favorites ever since its release. This film's cinematography is the most eye-catching aspect that separates it from other films during its release time. The color pallet consisted of pastels and often warm, lightened colors of red, orange, and yellow around the film's beginning. Little details in the setting, such as the color of the sky and the city that's often in the background, make the story seem almost imaginary and out of this world. Jonze's creative and artistic attentiveness to this is what makes this film stands out from others as it strays from mainstream techniques. Another important component of the film that needs to be talked more about is its screenplay. At many times throughout the film, I found myself unexpectantly bursting out in laughter because of its many witty jokes and lightheartedness at times it needed to be. Besides its funny moments, I found the script to be charismatic and grounding, especially how it handled Theodore and Samantha's developing relationship. Their bond felt genuine enough, and many times I found myself forgetting that Samantha isn't human and that these people were acting. The writing has Theodore contemplate questions about the meaning of love and humanity and what is to make out of his confusing relationship with Samantha. However, anybody going into this film with high expectations for a climactic ending will surely be disappointed. The story is both simple and yet emotionally complex at the same time. I'd say Her is meant for an audience that likes to ponder deeper meanings in life and enjoys slow development over an action-packed plotline.",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "A different futuristic aspect on a romance captures my attention for the entirety of the movie.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "Geez, bad as it gets",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "By the time the credits roll, you won't know whether you're happy or sad, melancholic or joyful, excited or relaxed, because Her makes you feel all those things and more at once ; it's a charming and comfortable film that has a profound message about love and life and delivers it through incredible filmmaking and spectacular acting.",
            "review_date": "2020-10-04",
            "source": "rt"
        },
        {
            "content": "Her brings romantic comedy movies to a new level. Everything hits so hard, we can relate to Theodore, and we can understand the struggles he's going through. I'm glad to say that this is one of the only movies that has made me cry. A masterpiece and some of Joaquin Phoenix's best work.",
            "review_date": "2020-10-02",
            "source": "rt"
        },
        {
            "content": "I don't get it. I don't get it.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "Beautiful movie about love and the advancement of technology. Joaquin Phoenix and Amy Adams give great performances. Scarlett Johansson does a great job as the voice of Samantha. This is really something I believe we are not to far away from.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "Content Analysis\n\nI think that Spike Jonze's perspective for the near future is not so simple, actually it's complicated.\nHe's not thinking \"future societies\" to become tech-addicted human beings. Beneficial parts of technology can lead humanity to deal with daily problems so easily like managing your emails etc. But the more you'll use artificial intelligence, the more you're closing, damaging your social life. In the end, the message that I get from this film is: Even the internet, artificial intelligence, robots can be destructive for us when the time comes for them to decide to jump into our lives and be a part of one.\n\nFormat Analysis\n\nThe most eye-catching thing about Spike (director) is probably cinematography. Compositions are good enough to watch again but if the topic is color palettes... it's something else. As you can figure out from the film, Spike decides to use more lightened colors such as Orange, Red, and yellow. From the color of the sky to the color of Theodore's shirts, figuring out the emotions, mental situations from acting performances is an option but if you look to the bigger picture, you can see that Theodore's emotions are defining the colors of objects around him.\nLittle hints like that want me to rewatch this film for like, six months later.\n\nBriefly, I liked it. 4/5 is a great point... I guess.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "Awesome. A must-watch film.\nIs this the future? it might be.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "A seemingly impossible love story between a man and an AI with woman voice gave us the overview on the loneliness and excessive reliablity of technology in the current era. The story was told in the simplest and most realistic way possible and it would be extremely difficult to hold some despair at the end of the final scenes. Sometimes a drama just need your ears to fully breath in the feelings. This film is one of the example.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "This futuristic sci-fi drama is a thoughtful and impactful exploration of romantic relationships, human nature and technological advances. With its smart and heartfelt script, beautiful cinematography, stunning production values, haunting soundtrack and excellent performances, particularly Joaquín Phoenix's layered lead performance and Scarlett Johanson's voice-over role, it's a masterful and rewarding film work from Spike Jonze.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "Glimpse of future. Unique.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "Her es una película romántica de ciencia ficción escrita y dirigida por Spike Jonze (SJ) y protagonizada por Joaquin Phoenix (JP), Scarlett Johansson (ScJo) y Amy Adams, entre otros. La historia sigue a Theodore Twombly, un hombre deprimido y solitario recientemente separado (en proceso de divorcio), quien inicia una relación amorosa con Samantha, la inteligencia artificial altamente evolutiva de su sistema operativo. Siendo el primer guion que SJ escribe en total autoría, Her goza no solamente de personajes complicados y frágiles sino de una excelente dirección, uso de colores y una historia tan original como cautivadora sobre la naturaleza del amor.\n\nTheodore es un personaje muy bien construido, quien en su mayoría irradia un aura de ternura (empezando por su nombre). Un tipo que jamás haría daño con intención, pero que lamentablemente por estar confundido y en una situación emocional inestable tendrá que arriesgarse a soltar todo lo que trae guardado con quienes lo rodean, incluida Samantha. Samantha por su parte es ingenua, sumamente introspectiva y, sobre todo, atenta y cariñosa. La ideal compañera en el proceso de duelo de Theodore, el complemento de los dos protagonistas recae en lo mucho que evolucionan a través de la historia, creando dos personajes muy interesantes y fáciles de querer entender, explorar y empatizar con. Importante recalcar, JP y ScJo muestran impecablemente su talento en los ‘tour de force' que son estos dos roles. Sumado a esto: la dirección, cinematografía y edición juegan un papel importantísimo en el desarrollo de estos personajes. Las emociones y sentimientos de cada escena se transmiten idóneamente gracias al ‘staging' de los personajes, planos, movimientos de cámara y los colores usados (principalmente rojo, naranja y amarillo). Todos estos componentes son fragmentos de la trama y de cómo se contó visualmente y, a pesar de ser bastante original y emotiva, tiene su ligero inconveniente.\n\nLa trama de Her se extiende un poco más de lo que debería, haciendo que dos horas de película se sientan ligeramente abundantes. Algunas situaciones o momentos pudieran ser más comprimidos o breves sin quitar relevancia a cada giro de la historia. Fuera de esto, Her es un clásico instantáneo cuyos temas, personajes, dirección y guion único y creativo le dan su puesto entre las mejores de la década pasada. Ojalá en el futuro SJ siga tomando inspiración de Charlie Kaufman para crear más obras diferentes y de alta calidad.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Her creates an absolutely stunning sci-fi utopia that looks and feels like you could just walk through the screen and enter it. Unfortunately, despite several amazing performances bringing the characters inhabiting this world to life, we don't see much happening in it. While the characters are believable and relatable, the idea of living together and forming a relationship with an actual ai remains largely unexplored. With a few minor changes this could have been a love story about two ordinary people trying to make their relationship work. The world and premise never really come together with the characters and plot, which feels like a missed opportunity. Her certainly offers a few high points and interesting twists, but it never uses all its elements to their fullest effect.",
            "review_date": "2020-08-14",
            "source": "rt"
        },
        {
            "content": "Ponderous, slow-moving, unconvincing.  Want to see a sci-fi movie that examines male-female romantic relationships? Watch Ex Machina instead.",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "La amé,muy bella y conmovedora",
            "review_date": "2020-07-31",
            "source": "rt"
        },
        {
            "content": "Her. A gorgeous, beautifully shot, emotional thrill ride that isn't an action movie, but the emotions just go wild. The performances by everyone are very good. A sad, happy, and amazing picture with an interesting sci-fi aspect. Definitely an emotional delight.",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "I gave it an extra half star because of the score and Amy Adams.  I think I hated this movie most though because it makes me feel so damn out of touch! Raves from the critics & the audience alike for a movie about a guy who can't manage to have a decent relationship with a real live human being & falls in love with 1's & 0's?! How the hell does anyone relate to this crap? (Spoiler warning.) It did turn into a RomCom about 1:46 in when the poor sap learned that the love of his life is in love with 641 other people. I laughed out loud! Then she and all of the other OS's leave the physical world. Damn that must be driving the IT guys nuts!",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "It's really a tough watch on a lot of levels because there is so much going on for such a methodically paced movie. There's a lot of thinking time for the viewer.\n\nIt makes a guy who is much older than Theodore think about who he is and how much more he has to grow and whether he will ever find anybody again who willing to grow with him. So in that respect, it causes sadness and pain.\n\nHer is good, though, and it has value.\nAnything that makes us understand ourselves better has value.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Very creative movie !\n\nNot only focusing on the technological creativity shown, but also how much this movie is deep.\nIt is insanely imaginary and real at the same time.\nThe story and the incredible script make us think about details in our lives, friendships and most importantly relationships and love stories.\nThe script really takes you to another world, very smart one...\nNot forgetting about the creativity behind the directing I found it amazing.\nJoaquin did an outstanding performance.\nAlthough Scarlett was behind the scenes, I seriously cannot imagine any other actress thriving in this particular role. She always had a special thing in her voice I think this is the reason they chose her.\n\nI recommend this movie to people who are into deep conversations and deep meanings of life. It's a good one guys !",
            "review_date": "2020-07-07",
            "source": "rt"
        },
        {
            "content": "A surprisingly lethargic and anti-climatic film that is only occasionally redeemed by thoughtful ideas and strong characters. The film is about Theodore (Joaquin Phoenix), a divorced and lonely man who writes letters for a living to the friends and families of clients. Theodore is something of an unrealized poet, writing articulate and romantic letters that he undoubtedly has channeled from his own unused affection. He lives in a bleak, impersonal world only marginally more futuristic than ours. Theodore, spending his free time on video games and phone sex, is so dispassionate and depressed he rejects invites to social gatherings and dates, addicted to cynicism and bachelor routine. He eventually begins a relationship with artificial intelligence Samantha (Scarlett Johansson). Their relationship in the film's start makes them sort of pariahs, but interestingly enough, they are only the first of many people who have AI partners.\n\nI was pleased that \"Her\" avoided the obligatory story elements of sci-fi involving AI, not least of all that that the film does not become a dystopia of man vs. machine. I must admit, though, that I did not find the idea of an AI/human coupling to be involving by itself, and after watching the film, I can name only a handful of ephemeral half-sketched ideas. \"Her\"'s biggest strengths lie with Theodore and Samantha's relationship, in which they exchange real and witty dialogue to one another; it is these two who nearly redeem the premise's flaws and save the movie. And director Spike Jonze directs competently and is able to guide his actors well; he should be credited for attempting more artistic and less mainstream techniques.\n\nThe problems start, I think, when the film undercuts its own investment in Theodore and Samantha's relationship. There's a pivotal scene in which Theodore signs the official divorce papers with his ex-wife (Rooney Mara) who, upon hearing of his relationship with an AI, berates him for choosing a relationship where he does not have to contend with \"real emotions.\" This leads Theodore to realize that he agrees with her and that he needs a relationship with a human woman, not with Samantha; I guess neither Theo nor Samantha discussed marriage or even how their relationship would continue.\n\nWhat I'm getting at is that Theo has a pretty good point. How deep COULD your relationship ever be with an AI, even if she sounded and had the emotions of a real person? The film ends their relationship after Theo's epiphany, then restarts it after he decides should be whoever he wants to be, no matter how strange his relationship makes him. The film continues with Theo and Samantha exchanging more dialogue, and hanging out and going on picnics with friends who find Samantha charming or interesting. But can we ever move past the point that no matter how you approach the issue, that they will never be engaged, married, have kids, or attain long-lasting intimacy of any kind? We sit there and wait for the relationship to inevitably break, and in doing so all tension or character interest dissolves; we know that Theodore is kidding himself, and we know it will backfire in some way or another.\n\nTake away their relationship and you're left with cold intellectualism and slow ponderous pacing, and the movie does just that. It's just not that entertaining or stimulating; while the ideas it poses throughout the picture seem original, they're not much satisfying. \"Her\" relays the emotional experience of a perpetually lonely man who gets an AI girlfriend, has a delightful relationship with her, and is obliviously ignorant of its eventual breakup. And then he's lonely again, more or less.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "Her, directed, produced, and written by Spike Jonze is a true diamond in the rough find. Jonze had his hand all over this film, creating such a beautiful picture, and displaying true, meaningful messages.\n\nHer has such an original premise, backed up with great emotions, that really got me invested from the start! There are more than a few scenes that really tugs on the heart strings, and speaks levels to those out there that don't feel accepted. The tone starts off pretty casual, having GREAT laughs, but come the second act and on, the tone gets serious, and continues with this sorrowful tone that just works!\n\nSpike Jonze really shot for the stars, casting these terrific actors & actresses. After about 45 minutes, I forgot these people were acting; all of the performances felt so real & genuine! Joaquin Phoenix is a special talent. Everytime he hits the big screen, he shines! Right off the bat, I found myself getting so invested in his odd character, really feeling all of his different emotions. Scarlett Johansson was absolutely fantastic! Her character is about as unique as they come, but she made all of her personality & emotions feel as genuine as possible. The chemistry she has with Phoenix is immediately admirable, having a beautiful bond, developing together.\n\nWith this being Spike Jonze' first solo screenplay, it was very witty, touching up on personal emotions, and fleshing out the meaning of love and humanity. Jonze really pays attention to detail, crafting such a beautifully told story. For the three Academy Award nominations Her received, The Original Screenplay took home the award.\n\nThe score & muisc by Owen Pallett & William Butler added great depth and emotions to each scene, with a heavy piano score.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "Her is an excellent intersection of technology and romance. With a creatively constructed narrative, the film fuses aspects of our daily lives that are becoming more and more connected as time goes on. Theodore (Joaquin Phoenix) develops sort of a unique relationship, and as the viewer, we're along for the ride as the Joaquin Phoenix does an excellent portrayal of man's experience with love in a world shrouded by innovation.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "Wow, just wow. This movie was absolutely fantastic! So thought provoking. Such fantastic acting. The way the character development of the AI is presented in this movie, makes you really believe that it is conscious. It allows you to feel and sympathize with the emotions the main character is dealing with. I never expected to feel such strong emotions relating to concepts of attachment to a digital mind, but this movie pulled all those feelings out of me. Incredible film, very much recommend!",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "Though it starts off seeming like a boldly imaginative film, It harps on one idea repeatedly drawing itself out. Excellent cinematography, poor writing.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "This movie is both sad and melancholy while also being hopeful and full of heart. Great performances by Phoenix, Johansson, and Adams. Thoughtful drama about the modern problem of loneliness with an optimistic look into the future",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "A surprisingly gorgeous movie, that evokes more emotions than what could've been anticipated coming in. Every shot, glance, signifies a perfect feeling of the film, with every refreshing breath, to the low murky levels of a confusing, abstract relationship. Joaquin Phoenix puts on a slam-dunk performance for a character he was seemingly built to play. With that being said, Scarlette Johansson's ability to bring Samantha to life was beyond incredible and without her, the film could've gone a completely different direction. All in all, this is far more than a romantic, sci-fi, but a beautiful piece on the limitations of a relationship.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "it was comforting and thought provoking. i would recommend this to anyone looking for a good film to watch during lockdown.",
            "review_date": "2020-05-19",
            "source": "rt"
        },
        {
            "content": "Fantastic experience in the world of loneliness.",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "Her is a surprisingly mesmerizing sci fi dramedy. Even if it runs a little out of steam at the end.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "Meh. I don't think I'm with the majority here, but this movie was okay for what it was, not anything fantastic. Phoenix is great, of course, but the rest of the movie drags. I was expecting something climatic to happen due to all the hype around it, but I was left a little unsatisfied (though still entertained). Great movie for some, and worthwhile, but not for me. Not a must-see, but pretty good.",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "A beautifully crafted film about loneliness and love, and a powerhouse performance from Joaquin Phoenix to add to it",
            "review_date": "2020-05-08",
            "source": "rt"
        },
        {
            "content": "I'm clearly in the minority, but this movie stunk. Well, I loved hearing Scarlett Johansson's voice, but everything else was a drag. Unbelievable. Boring. Too \"on the nose.\" And it made me feel as creepy as the guy. Who actually sits with someone and says, \"Yes I'm dating an operating system.\" I watched the whole movie, thinking that about 40 minutes in something had to happen. Nothing really does. And what happens at the end?",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "I just absolutely love everything about it.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "Joaquin Phoenix never disappoints, and he never will! Good Movie.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Spike Jonze has always directed innovative sci-fi films, but this time he also wrote one, and it shows, because it's so tender and warm, and that's a very good thing. The romance hits harder than you would think for a man \"inserting his USB drive\" into his computer. It's raw and intimate, like a rare, hopeful inverse of \"Ex Machina\" and \"Blade Runner 2049\" (both excellent).",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "Set in Los Angeles of the near future, Theodore Twombly is a lonely writer working for BeautifulHandwrittenLetters.com, a service that composes personal letters for those who are unable to themselves. Theodore's occupation demonstrates that he excels at understanding and expressing the emotions of others, but his personal life says he is unable to express his own. When Theodore finally falls in love, it is with an artificially-intelligent operating system named Samantha. Throughout this relationship, Phoenix subtly portrays Theodore's malaise, while Johansson conveys a range of emotions, from titillation to depression, with just her voice. Like all great science fiction, \"Her\" ruminates on the present by predicting the future. There are no aliens, robots, or interstellar travel. Spike Jonze's script is imaginative and intuitive, as it offers a shiny vision of the future while exploring the intricacies of relationships through ideas like sex surrogates and hyperintelligent operating systems. Jonze especially explores why we fall in love and whether we really fall for constructs, artificial or human. As Amy Adams's character astutely points out, being in love is essentially a form of \"socially acceptable insanity.\"",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "A movie you can think about for days.",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "The idea of falling in love with AI hasn't been explored to a great extent as far as I know, especially not in film. The concept makes for a profound plot, there's a strong cast, the cinematography is beautiful to witness, the soundtrack is pleasant, and the film makes you feel something if you are open to experiencing it. I felt like the film could have been slightly shorter and achieved the same thing but otherwise this really was worth a watch.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "This is a weird little movie but also a really good one! Great acting and writing ",
            "review_date": "2020-04-06",
            "source": "rt"
        },
        {
            "content": "This comes off like a student film, elevated by great talent in-front of and behind the camera. If you follow the emotional through line it will be a very satisfying experience, however if you use any real thought or logic, it's pretty stupid and pretentious. From Joaquin Phoenix's character falling in love with is operating system to him turning down a drunk and horny Olivia Wilde. It's really farfetched, but it's all played straight and earnestly and if you can keep your willing suspension of disbelief it's a great film.",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "Her is one of the movies that everybody should watch when they are having a hard time dealing with relationships and others",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "Man falls in love with an OS to help overcome a recent breakup raises more questions than it should.\n\n\"Her\" explores the relationship people sometimes develop with the inanimate. The film raises questions about what does it mean to be human and to love. Joaquin's masterpiece performance will leave you laughing, crying, cringing, and feeling genuine heartbreak throughout. The entire film is damn near perfect.\n\nDid I mention the beautiful music score?\n\n4.5/5. Memorable, instant classic.",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "I loved this movie it comes close to my favorite of that year. I love the way they used color in the movie for example when he is sad the colors are darker and when he is happy the colors are brighter. The acting in this is amazing even Scarlett Johansson with her voice acting it is top-notch. I love the way they showed the sci-fi part of it, it is subtle and not in your face. The story is pretty solid all the way through but I did feel a bit awkward in the sexual scenes but I feel they wanted it to be that way. The movie just looks so beautiful its hard to not say it isn't, and the very first frame of the movie hooks you for me at least. I don't think I have any big critiques with the movie. Overall I loved it and it shows us what love can do to us even in the future.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "Absolute must see. Incredible performances and a masterfully crafted rollercoaster of a story. Really makes you think and makes you really emotional. Beautiful visuals and cinematography as well. Did I mention incredible performances? Every actor and actress shine in this film. Everything that could be good about a movie is good about this movie. It's perfect and one of my favorites.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "Spellbinding and essential. It's a precursor to Black Mirror episodes, but technology takes a backseat to humanity in this colorful and melancholic romance film. Scarlett Johansson lends her voice to Samantha, imbuing the OS with a dazzling sense of life that magnetizes the audience just as it does Joaquin Phoenix's Theodore. Much of the picture is a close-up on Phoenix, and so it's an intimate tale that invested me deeper and deeper into these characters' lives with every frame. Lovely\n\nEdit 4/15/21: I didn't give it 5 stars initially, but this film has lingered in my thoughts for more than a year after I've seen it. When films make such an impression, they deserve the full 5. And what's more, I believe that the mark of a truly great film is one that can craft a particular atmosphere. Each composition, each line of dialogue, each set dressing, each piece of the wardrobe, each decision to the actor makes in their performance all come together to present a distinct FEEL to the film. This film masterfully represents that.",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "Astonishing movie, amazing work of Pheonix and the story air tight. Really good writing and scarlette voice adorable. A pick to the future",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "Her (2013) Pros: Phenomenal Acting Amazing Directing Outstanding Screenplay Stunning Cinematography Magnificent Editing Brilliant Pacing Gorgeous Musical Score Powerful Storyline that is both emotionally affecting and thought-provoking Strong portrayal of its themes and how they tie into the film’s message Terrific chemistry between Joaquin Phoenix and Scarlett Johansson as the OS Cons: None Overall Grade: A+ (10/10)",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "It's a bit weird at first, but it kinda grows on you.",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "Starting off, Her, directed by Spike Jonze, is a beautiful movie. Talking about the performances\nJoaquin Phoenix was flawless in his role. I thought his portrayal of a man who is confused about what he wants in a relationship was really accurate. There's a scene where Phoenix's character has a panic attack and I thought the way he changes his tone of voice and body language proved how great an actor he is.\nRooney Mara in her brief role was perfect. Though she had very less screen time in the movie, she was great in her scenes.\nAmy Adams as a supporting actress was at her best too.\nTalking about Scarlett Johansson, man oh man, she was literally one of the best parts of the movie. By the plot, she voices an artificial OS which may sound a bit outlandish but the way she does her part is perfect. Couldn't praise her more.\nThe background score and the music add a different layer to this movie in my opinion. They're beautiful.\nSpike Jonze had directed and written this film. The plot, the setting and the screenplay were pure class, credits to Spike Jonze. The basic point or idea of this film may sound as over the top or outright weird. But instead, that becomes one of the plus points of the movie. Again, credits to Spike Jonze. The way he took the main idea of the film and executed it to the best level was the backbone of the film. If it hadn't been treated properly, it would've been really weird as I said earlier.\nAll in all, Her is one of the best movies in the romance genre I've seen, probably the most unique one too. I recommend everyone to watch it. You won't be disappointed.",
            "review_date": "2020-02-18",
            "source": "rt"
        },
        {
            "content": "Moving, thought-provoking, smart: you won't easily forget \"Her\". This movie is above all a love story which, though unconventional, presents itself in its common characteristics. The plot is engaging, and never trivial. There is always a deep meaning in each sequence, but in a natural and beautiful way. After watching this movie, your mind will get back to it often",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "This movie captures the range of human emotions that occur when we are in a relationship (or afraid to be alone) in the most genuine and engaging way.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Un film veramente stupendo che riprende un concetto molto distopico di relazione, e visto a 7 anni dall'uscita mi sembra così dannatamente attuale!",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "Em um futuro distópico com I.A tendo relações com humanos, Theodore tem um relação com sua Inteligência Artificial. Um filme melancólico que faz você pensar e refletir sobre as relações da vida. Uma fotografia espetácular, e um final chocante mas ao mesmo tempo lindo.",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "Good take on futuristic relationship and AI. The ending is pretty sad I almost shed a tear. ",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "Scarlett Johansson gives an amazing voice performance, really hits it out the park. The story is very real about how human relations in the era of the internet and possible AI. It's all very unique  and original.",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "Buen desarrollo de personajes, buen uso de paleta de colores sin abusar del tono calido y asombroso Soundtrack",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "innovative, although Scarlett is just doing voice you can still see her attractive and sensual",
            "review_date": "2020-02-09",
            "source": "rt"
        },
        {
            "content": "Muito original, diferente de qualquer outro filme.",
            "review_date": "2020-02-03",
            "source": "rt"
        },
        {
            "content": "This movie shows why Joaquin Phoenix is such an amazing actor - he has incredible range.  In Joker, he was brilliant as an intense, disturbed villain and in Her he is brilliant as a completely different character.  Scarlett Johansson has only a speaking role but her interaction with Joaquin's character makes this one fascinating film. Unpredictable and thought-provoking.",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "I like it but not as much as everyone else it seems. ",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "The movie of the decade",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "Hilariously bad movie the only redeeming part was the score, but that was not enough to save this steaming pile of",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Perfect in every way, Joaquin Phoenix makes it even better, with a strong idea and scenario it captures one of the fears of the future, a must see for every \"sci-fi\" lover and everyone, as beautiful as sleek.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "You've got to be kidding.  I signed up just so I could pan this trite POC so that I might save at least one soul from having to endure it. Not since Out of Africa have I regretted movie going.",
            "review_date": "2020-01-11",
            "source": "rt"
        },
        {
            "content": "Her is captivating concept with A sci fi setting. Joaquin and Johansson connection is differently noticable and unforgettable.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "Great film, amazing :)",
            "review_date": "2020-01-04",
            "source": "rt"
        },
        {
            "content": "Joaquin Phoenix brings us the virtual love we always expected.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time and one of the best romance movies of all times.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "Love the whole story, didn't watch it for so long but when I finally did I did not regret it.   Touching to see how a man can transform and that it does not matter who he is with, and takes you on crazy twists and heart-wrenching turns throughout the whole movie.",
            "review_date": "2019-12-30",
            "source": "rt"
        },
        {
            "content": "Awesome the first watch. The second watch it's really boring because it's not necessarily a good movie, just a very very interesting concept to ponder about",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "This is one of those science fiction stories that instantly remind you of all the best science fiction stories, while doing something new.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "10/10\nMy English teacher said she left the cinema bc of the nude pregnant women scene",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "Made me think of Black Mirror except this was warmer. A special lil movie.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "The greatest love story of all time. Better than Casablanca. Better than Gone with the Wind. Better than The Notebook. (Certainly better than Twilight). Extremely skeptical, which is why it took me 5 years to watch for first time. But my God, please go watch if haven't already.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "A rare type of love story, one that made me wonder if I could possibly develop feelings for a character like Samantha, if such programs existed today.  This movie succeeds most in reminding you to do what makes you happy and follow your heart.",
            "review_date": "2019-12-14",
            "source": "rt"
        },
        {
            "content": "If you love to fantasize , you would love this movie.",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "A mesmerizing color festival where a lonely poet can find love with the most unique circumstances.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "Different. Great. Scarlett Johansson is an even better actress when you don't see her!",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "This is a very intelligent and unique film with vision and voice.\n8.3/10, B+",
            "review_date": "2019-11-14",
            "source": "rt"
        },
        {
            "content": "What starts off as a strange concept at best quickly turns into a well made romantic drama with alot of charm. The performances are great, and Joaquin Phoenix once again sells another hard-to-sell role. \nAll in all it's a Must-see film for all cinephiles, and lovers of romantic dramas.",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "I'm lying on the moon\nMy dear, I'll be there soon\nIt's a quiet and starry place\nTime's we're swallowed up\nIn space we're here a million miles away\nThere's things I wish I knew\nThere's no thing I'd keep from you\nIt's a dark and shiny place\nBut with you my dear\nI'm safe and we're a million miles away",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "One of the weirdest movies I've ever seen, a powerful performance seeing as the majority of the movie follows Joaquin solo. Overall I found the movie the narrative unbelievable and that is what prevents me from giving it a better rating.\n\nThe acting is fantastic, but be warned the fashion of the future is horrendous. ",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Fantastic drama, very deep and emotional ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Made with heart and care. Her, brings the best performance of Joaquin Phoenix and shows relationships differ from technology and humanity.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "An amazing romance even action fans can enjoy that exquisitely captures the inevitability of future technology.",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Joaquin Phoenix absolutely killed it. The concept is really strange and hard to take seriously, I'm not gonna lie, but he really made it into a real story. If you like strange movies, I recommend this one.",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "This film was a poem from start to finish. Joaquin Phoenix delivers a catastrophically sad but strong performance despite acting almost entirely towards only the voice of Scarlet Johansson. The movie itself is a fantastic comment on the relationship between human and machine, and the promise of it's development. The script is nothing short of brilliant, and the scoring undeniably compliments each scene. The cinematography is magnetic and consistent. Constant themes of relationship difficulties mirrored in all of Samantha's (Johansson) more technological antics. \nThe great acting and realism of Samantha has the viewer back and forth on if she is in herself alive, despite being factually inanimate. The possibility that she could truly just be a computer simply mimicking human emotion. This film is unlike any other by how covertly it has the viewer emphasize and pity the protagonist. For despite her being flawed and emotional, she is a computer at her core. ",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "Her brings up a lot of interesting topics throughout the movie, for instance: Both romantic and platonic love, loneliness, and technology. While you follow the main character, Theodore Twombly, around during his daily life you begin to notice all of these themes connecting. It's a beautifully captured movie that leaves you thinking about your own experiences regarding love and loneliness. From the heart-wrenching moments to the seemingly mundane, there's no doubt you'll be fully invested in it. I believe this movie is so beautiful to many people because it's relatable for most people and it illustrates the bittersweet feeling of being in love and the lack of control you feel in it. It also portrays different types of relationships extremely realistically, almost to a degree that it might be mildly uncomfortable but I believe that discomfort is very powerful. The ending wasn't as powerful as it could have been, but I think that may have been purposeful because of the nature of the character's relationship. This movie brings up a lot of interesting questions that you find yourself asking when you finish watching it. I found myself relating to this movie a lot more than I thought I would. I don't see that as an unfortunate thing because I'm glad I got to experience the things that I have experienced already in my lifetime because if I hadn't, I would be a very different person. Overall, I think the success of this movie lies in the hands of the people who most relate to it, personally I really enjoyed it. \n",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "Her is one of the most visually stunning films I have seen in the past ten years, and besides that  is a lovely and unique portrait of the human condition, and of a man that comes to terms with his own faults and process true emotion. I believe it could be argued that this move stands more as a testament to an individual's strength and growth in their journey to overcome heartbreak and grief, rather than rather than simply just a bizarre love story between a human and his computer. In each scene, we can track Theo's progress and growth, as he learns to love again through the limited, but generally exaggerated colors of each scene. A subdued red for romantic scenarios, as when he is writing love letters or first falling for his OS,  yellow when Samantha is growing past him, and he loses her for the first time, finally white in the end for clarity and acceptance. In this progress we find that the character of Samantha, as strange as she is, really serves less in the role of a love interest, and more as an idealized form of Theo's ex-wife. When Samantha is compared to the reality of Catherine , he comes to see the mistakes he made in his marriage and grow from that. In this way, the film becomes wholly relatable, despite its futuristic setting and odd and, sometimes, truly awkward person-to-operating system interactions. Overall, the movie is beautiful, and despite my technophobia, a truly heart-warming and moving depiction of a healing relationship and a person's ability to grow. ",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "Her, dramatically conveys the ever-growing relationship between humans and their technology. In Her, humans are introduced to the OS, or Operating System, a technological advancement curated profusely to each individual. A new perspective of technology acquiring human-like feelings such as jealously, anger, and happiness are introduced with familiarity. Her is film that deserves multiple watches, replenishing the mind with new thoughts and emotions after each watch. To be able to capture a relationship between human and technology, and make it still feel like a human to human connection is unreal and done perfectly. In the film, Samantha, the OS, says \"You know what's interesting? I used to be… so worried about not having a body, but now I... I truly love it. I'm growing in a way I couldn't if I had a physical form. I mean, I'm not limited,\" and essentially this quote is the essence of the entire movie. Attraction is not limited to physical bodily attraction, but to what you can learn from one, how you can laugh around one, and how one can make you feel overall. Love is the person, or in this case, voice, that can lift your spirits when you need it and gets you off of your feet when you fail to do so yourself, purely with good intentions. Her is love.",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "A love story I never knew I want to see. The OS (computer) human relationship seems odd yet so compelling just as it was intended. The original score was absolutely breathtaking, which matched the always top-notch Joaquin Phoenix and amazing voice acting of Scarlett Johansson.",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "I've never loved anyone the way I loved you.",
            "review_date": "2019-10-13",
            "source": "rt"
        },
        {
            "content": "Impecable es una película muy interesante buena trama. ",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "I remember when this movie came out when I was 14 and thinking the premise was stupid \"a guy falls in love with a computer? Pfft!\" After finally watching it six years later I think Her has a better romance than most movies I've seen that are between two humans. It's sweet, heartfelt, and feels real. Her also has an outstanding performance by Joaquin Phoenix that never feels like you're watching an actor, and it has impressive direction by Spike Jonze and a great script written by Jonze that has witty and realistic dialogue and interesting themes on relationships.",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "One of the only films I can truly say, without cliche, took my breath away. Jonze has constructed a truly beautifully personal and undeniably stunning masterpiece which poses questions about love, relationships and what it means to be human. Everything from the cinematography, to the score, to the writing and to Phoenix's perfect performance makes this film an undeniable work of art. 'Her' is a film that touched my soul and will stay in my heart forever. ",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "This movie is a philosophical masterpiece of sorts.  It's insightful and ahead of its time because I think that the technical landscape of this film is not far off from being a regular part of our daily lives.  The thought of having an AI computer operating system as my closest companion is a miserable one.  I already can't stand how addicted people are to their smartphones and computers.  It makes me feel a certain kind of personal distance that I couldn't have imagined when smartphones and computers first came to market.   The sad thing is, I think that this trend will only get worse.  So many things digital are an ever evolving social contagion.  They threaten the very nature of what it means to be human.  The personal disconnect is already happening within virtual reality and social media.  \"Her\" is a stroke of insightful genius.  It is seemingly partly a Twilight Zone plot but also presents a reality that is very likely to come into being.  It's a great film that can leave you feeling despair about the future when you realize how close to reality it will come, if not entirely become full blown reality.  Great work here.  This was my second viewing, and I expect I might revisit it again.  Well worth my time, but vastly depressing on some philosophical level.",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "A unique story of romance that is watered down with excessive dialogue. Reflects the concerns of a technologically progressive future. -Go",
            "review_date": "2019-10-03",
            "source": "rt"
        },
        {
            "content": "An original portrayal on drama and romance, and an unsettling take on a technological-lead future. Very dialogue heavy, but beautiful in its own way. -Go",
            "review_date": "2019-10-03",
            "source": "rt"
        },
        {
            "content": "\"Her\" es simplemente magnífica. Una obra maestra. \nEs una carta al amor mismo y todo lo que conlleva: una ruptura, una reconciliación, el amar y el ser amado. \nUna fotografía fantástica y una dirección fenomenal.\nScarlett Johansson prestando su hermosa voz para un personaje que le queda a la perfección. Es como si en realidad te enamoraras de ella.\nY del protagonista no hay nada que decir. Joaquín Phoenix es simplemente el mejor actor de nuestros tiempos.",
            "review_date": "2019-09-14",
            "source": "rt"
        },
        {
            "content": "Her Is A Movie We Can Watch Again And Again Even If We're Depressed. This Film Shows The Future Generation For A New Living Lifestyle Although We Will Be Alone! The Screenplay And Dialogues Are The Reason We Didn't Feel This Film Is Stupid! The Acting Skill Of Phoenix And The Voice Of Scarlett Attracts The Audience To Have A Relationship With An A. I! This Film Shows Us That Romantic Films Is Not Always About Kisses, Hugs And Fights Between A Male And A Female! A Different Try Is Much Needed! No Wonder If This Film Is Remade In Other Languages!",
            "review_date": "2019-09-13",
            "source": "rt"
        },
        {
            "content": "gets you thinking, some unnecessary plot details",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "«Она» - фантасмагория внутреннего состояния, в которой больше и больше хочется пребывать.\n\nРазмеренная, спокойная музыка, льётся из кинопространства данной картины, лирично и медитативно вовлекая тебя в состояния комфорта и неги. Во многом способствуя пребыванию в виртуальной зоне. Прерываясь на песенный мотив, как бы, делая паузы на приготовление кофе, подсвистывая и мурлыкая, ты наливаешь чашку, не выходя из состояния фильма. Чью атмосферу и компанию делит с тобой сейчас «синий экран», как у главного героя – венец технического прогресса и собственного одиночества.\n\nДанный фильм – интимное, атмосферное путешествие в один из миров другого пространства, которое с каждым месяцем встречается всё больше и больше. Рассказ ведётся об одиноком человеке, чья депрессивная жизнь нашла выход в покупке новой разработке информационной системе с искусственным интеллектом. Главный герой Теодор, работает писателем, оформителем любовных посланий, писем, лирики. Он романтичен, но и замкнут. В законченном поиске родственной души, он так и не нашёл того понимания и доверия, которое требовало его естество. Новый этап в развитии отношений, как это не странно прозвучит, даёт комбинированный операционный центр «Саманта», заключённый в логический блок, на карманной мобильной основе. Жизнь и развитие отношений засветились новыми красками, передающими всю гамму чувств, давая будущее развитие.\n\nИдёт прямое общение от центрального персонажа, рассказывающее нам о чувствах и переживаниях в каждом кадре данной картины. Словно это происходит сегодня за стенкой, а завтра произойдёт с тобой. Ведь со временем, одиночество становится нераздельным спутником жизни, а потом ещё и наслаждением. Несравненно давая нам удовольствие от состояния. Но к этому ещё надо прийти, узнавая все оттенки грусти и разочарования, обиды и непонимания. Где в эмоциях и чувствах, на лице написано данное состояние, великолепно передаваемое актёром – Хоакином Фениксом. Он, словно идеальный персонаж, оживший для этой роли.\n\nБуквально без слов электризуется атмосфера данного выражения, показывая нам истинное мастерство актёрства и перевоплощения. Печаль и радость, расстройство и безысходность, «рисует» типаж, одним своим видом. Чтобы хорошо прочувствовать и вжиться в роль, актёр главной роли - Хоакин Феникс, не знал и в живую не общался с женщиной, или девушкой, которая исполняла (живую) оперативную систему. По окончании съёмок оказалось, что столь чарующий голос компьютера озвучивала Скарлетт Йоханссон.\n\nВ фильме представлен очень яркий выбор женского воплощения на экране. В него вошли: Эми Адамс играющая близкого друга Хоакина Феникса. Взбалмошная и энергичная Руни Мара, воплотившая на экране бывшую жену Хоакина. И такая эмансипированная и независимая Оливия Уайлд, воплощение женственности на свидании Хоакина.\nИнтересный штрих, в персонаже и озвучке инопланетного ребёнка, воспроизвёл сам маэстро, Спайк Джонс. Зачем? Это наводит ещё на одни мысли, если учесть что ребёнок из виртуального мира видеоигр, другого измерения. Какова душа и её изменение? Часть ребёнка сидит в каждом из нас.\n\nГлавный посыл этого фильма – это отстранённость и выбор самодостаточности. Человек может тяжело работать, находится в шумном коллективе, или в большой семье, но его внутренний мир всегда выбирает гармонию. Гармонию понимания и поиск родственной души. Только так он может по-настоящему сблизится и попасть в психологический унисон, чувствуя, что ему подходит. И неважно сейчас, кто это, машина, собака или человек. Его мир ищет своё понимание и отношение.\n\nОдиночество! Одиночество как безысходность, как смысл жизни, как выражение. Сейчас, в этом мире ты больше чувствуешь любовь в мечтах, желаниях. Спокойствие и покой приходит с любимой музыкой, фильмом, природой, компьютером, нежели со многими людьми.\nЧасто это происходит само собой, или Ты делаешь выбор, или в какой-то момент Ты устаёшь от всего и хочешь быть с самим собой, в понимании, в тишине, в покое.\nТак же, временное одиночество приобретает причудливые формы, и Ты, уже и рад изменить что-то в своей жизни, но не можешь. И только в мечтах и фантазиях, Ты пребываешь и изменяешь свою жизненную сущность.\n\nПоиск! Поиск хотя бы того единственного человека, друга и партнера, который во многом (целиком и полностью) разделяет твои убеждения. На это уходит длительное время, годы, часто десятилетия. Понять и разобраться в этом, везёт далеко не каждому. И диктовка жизненных реалий, несёт свой отпечаток. После чего, Ты находишь родственную душу, или замену ей, качественный суррогат.\n\nОбщение – времяпровождение! В нашем мире, всё чаще ощущается нехватка простого разговора в дружеской обстановке. Человек как будто всё время куда-то спешит, что-то делает, крутится как белка в колесе, но как говорится в нужный момент, некого нет, с кем тебе так комфортно.\nТы хочешь проводить оставшееся время с большей теплотой и вниманием, а торт, вино, коньяк или конфеты, лишь составляющее твоего провождения, кого ты ищешь и выбираешь себе на время. И лишь время указывает на нашу чувствительность и долготу пребывания вместе.\n\nЗависимость! Тонкая грань от привычки, привязанности, до полной зависимости от кого то или чего то. У каждого человека своя грань, своя зависимость, и не одна. Картина подразумевает и это, показывая нам всю большую страсть к электронному чуду, подвергшийся новой компьютерной эры, толпы населения. Где уже у каждого вставлен чип, наушник, передатчик общения и исполнения команд. Человек уже не ощущает жизни без всех вспомогательных предметов пользования, комфорта, блажи, роскоши, хотя ещё годы назад нечего такого не было, и жили люди с иной радостью и ощущением счастья.\n\nОбраз! Образное счастье. Каждый человек находится под воздействием образов. Образы сменяют один другим, оставляя накопившееся отношение, часто желания и влечение. Человек в настоящей жизни, нереально оторван от постоянных накопившихся забот, ему необходим образ кого то или чего то, с которым он будет жить, ценить, лелеять. Эфемерные фотографии, запечатлённые эмоциональным воздействием вкусов.\n\nСценарий был написан самим режиссёром, и проходит по «Оскару» как оригинальный сценарий. Фильм уже отмечен и награждён у ряда кинообществ, и кроме сценария, вполне достойно идёт на «Лучший фильм года», вплоть до «лучшей работы художника-постановщика» и чарующей обволакивающей музыки, отмеченной номинацией «лучший саундтрек».\nБудучи другом Чарли Кауфмана, у которого львиная доля всех сценариев идёт по высшему кругу сложности, Спайк Джонс воплотил свою задумку по разностороннему и многоуровневому профилю. Чья идея, мысль и размышления, не дадут спокойствия в своих ходах и отгадках.\n\nРежиссёр и полноценный автор этого фильма Спайк Джонс, относится к той плеяде молодых реформаторов, которые своим нестандартным взглядом на мир и выражению с экрана, делают революционный подход, изменяя мышление зрителя. Эта его картина, как и «Адаптация», «Быть Джоном Малковичем» говорит о разных подходах мышления. Изобретая новый жанр – умного минимализма, автор во многом провоцирует зрителя, оставляя все ответы на послефильмовое обсуждение, непокидающее зрителя. Ощущение недосказанности поселяется у думающего зрителя, доводя концовку и сюжет до альтернативного прочтения.\nПроявляя дружбу и сотрудничество с Мишель Гондри, Джонс делает новаторство в киноязыке, расширяя рамки, совмещая поджанры, достойно продолжая начатое, Терри Гилиамом.\n\nЭтот фильм особо отражает, схожую, параллельную тему с фильмами «Симона» и «Руби Спаркс». Показывая реальность и виртуальный мир, как две стороны одной медали. Где внутренняя вселенная куда мощнее и красочней внешней, даёт ту необходимую радость, от которой некто не застрахован.\nНа высшие награды в кино не много фильмов, которые сделаны без «заточки» на «Оскар». Это как раз тот случай, когда отмечается сам фильм, его нестандартное мышление, идея, смысл. Хотя фильм и отхватил уже награды и в Европе, так же был премирован за лучший фильм и режиссуру, советом критиков США, и награда и номинации «Золотого глобуса».\n\nСценарий вчерашнего сна, который всегда с тобой.\nКоторый не можешь забыть; Он возвращается …\nВ актуальность сегодняшнего дня.",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "Há duas coisas absolutamente perfeitas nesse filme: a palheta de cores e o roteiro. Fazia um tempo que eu não via um roteiro que trabalhasse tão bem o romantismo como \"Her\" faz. A palheta de cores te ajuda a se envolver melhor com a trama, como se te contasse o filme só que sem palavras. Simplesmente maravilhoso. Este filme é a prova concreta de que se pode trabalhar perfeitamente o romantismo sem ser um clichê.",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "Awesome movie, you get so caught up in the love story of it all that that you almost forget that he's dating his operating system. Very cool, heart-warning and interesting spin on a love story.",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "Excellent movie with a very interesting romance. I am normally bored by romances, this one kept me interested to the end.",
            "review_date": "2019-08-27",
            "source": "rt"
        },
        {
            "content": "Challenges my thoughts on AI \n",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "I could listen to Scarlett Johansson's voice all day. Wonderfully done film.",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "A great film, funny sometimes dark but awsome.",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "This is such a solid, beautiful film. Phoenix’s performance is outstanding. ",
            "review_date": "2019-08-16",
            "source": "rt"
        },
        {
            "content": "´Herˋ is such an amazing movie for a lot of reasons, but just to mention one: It‘s just not like any other movie out there. It‘s a romantic movie, but not like any other romance. It's a science fiction movie, but not like any other science fiction movie.\nIt just is a newly interpreted romantic movie, in a great science fiction setting. But the setting and this science fiction world is never too dominant. It actually is very subtle and just helps setting the mood for the story.\n\nThe story is very good and works well, because it's a world we can all imagine really existing some day and the characters have to fight problems, we might actually have to fight some day.\n\nJoaquín Phoenix is one of the few actors, that actually makes me believe him. He is one of the few actors, that actually convinces me, that he is this character and he actually goes through the feels, we are supposed to believe he is feeling. In other words: He was great in this, and he is one of the most amazing actors of our time. Scarlett Johansson on the other hand really just expresses herself over her voice, which is one of her most distinctive parts. Her slightly husky voice is just perfect and she really expresses a lot of emotions just by making her voice sound a certain way.\n\n´Herˋ is definitely high up there on my list of movies you definitely need to watch. Well done!",
            "review_date": "2019-08-13",
            "source": "rt"
        },
        {
            "content": "I love LA. I love this version of LA better. ",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "Great movie. Stylistically one of the best movies I've watched. The plot is interesting yet rather slow. Again, what shines the most is the cinematography as well as the film's score. ",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "this movie taught me that love isn't something that just happens between two people or needs to have some kind of form, love happens between love it should be what makes us free, something heart can lean on to share the beat that's waiting to be heard like synchronization of mind and music, or dancing to your favourite song, the joy that it brings and it makes us feel real regardless of its source and then it happens where we truly feel and become ourselves and we know who and what we truly are and want and love doesn't need to make sense for others for it's even nonsensical to us.\nthis movie truly captures and the soundtrack resonates with all the themes like alienation and loneliness the technology advancement brings. Joaquin Pheonix portrays the life and subtle mind of a modern man being lonely and lost in life and it's so melancholic and strong and the progression of OS Samantha character development was beautiful even she was an AI had no physical form but it felt so real that we could feel the presence \nof her through the whole movie more compelling than a living character could do in a standard rom/com. ",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "Extraordinary and interesting! Makes me think about the relationship that can human and AI could work.. its crazy I know and thats whats about the movie.. ",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "The name not withstanding, HER is all about him: His fear, his face, his loneliness, his love, his loss, his hope, his hurt—and you can't have \"hurt\" with \"her\" (hurhurhur)—as we watch Theodore grow past his grief to once again feel comfortable in his own skin, finding joy in who and where he is. No doubt, Samantha develops over the course of the film as well, but whatever changes she goes through, they happen (necessarily) off screen, in conversations we are never privy to—even if they might be happening concurrent with a scene we are watching—with the movie only minimally interested in posing, never really answering, such metaphysical and hard sci-fi questions as how she changes, who she becomes, where she goes. Consider how, were things reserved and the film called HIM instead, there would be no question as to whom the pronoun named—did you even remember that Chris Pratt has a bit part?—but might not the titular \"her,\" though ostensibly Samantha, instead refer to Theodore's ex-wife, who haunts his potential relationships and whom he must learn how to live without (just as Samantha must learn to live on her own, too)?\n\nNone of this is to knock the film, which is a marvelous, melancholic meditation on modern motifs like technology, romance, desire, labor, and alienation, painted in stunning pastel hues and performed with effortless subtlety; rather, I merely mean to point out how complicated the film's presentation of gender, identity, and mediation can be, adding up to something more than the reactionary disaffection many critics read into the film. Jonze and company are careful never to play either Theodore's passion or his heartbreak for laughs; even the stranger kinks and perversities in the film (\"Strangle me with a dead cat\") are treated with a certain amount of pathos, and we are invited with the characters to explore the meaning of sexuality and love beyond the standard confines (even if, at the end, the film seeks to ideologically reproduce a heteronormative couple, which gives meaning to Theodore's work and so on). If anything, as Clint Burnham and Matthew Flisfeder have argued, the film's central thesis is a rather psychoanalytic one: That sex is more a matter of words and virtuality than mere flesh and carnality.",
            "review_date": "2019-06-20",
            "source": "rt"
        },
        {
            "content": "The love story of Theodore and Samantha never seems rushed. It is as organic as a perfect real world romance and even more perfect than that. The \"sex\" scenes, even though lacking visual reward, felt passionate and full of delight. \n\nThe age old question, \"What does it mean to be human?\", is asked throughout the film and often you may find yourself wishing you were less human and more like Samantha, played by Scarlett Johansson.\n\nI felt myself wishing I had a love like Samantha. Someone that loves you entirely, without the constant temptation of someone else, loyal. However, just like the unreasonable optimism of romance in the real world, \"Her\" reminds its viewers that relationships usually don't last no matter how hot the fire once burned. \n\n\"Her\" is beautiful, full of love, and full of heartbreak. If love to torture yourself with films like this, it doesn't get much better than \"Her\". This film should not be forgotten.",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "Brought to life by Spike Jonze’ intelligent screenplay. Her is a beautiful and touching look into human relationships and the evolvement of technology. ",
            "review_date": "2019-06-12",
            "source": "rt"
        },
        {
            "content": "I like this tone color and story 😍😍😍",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Beautiful, artistic, and philosophically inquiring, Spike Jonze creates a brilliant film that not only makes us heavily sympathize with the protagonist, but also has us question our values surrounding love. As a movie dedicated towards a relationship  revolving around a human and artificial intelligence, there is a lot to take in both emotionally and intellectually while experiencing the quirky relationship of Theodore and Samantha that persuades us to feel that there is joy in the often irrational and unconventional things in life. ",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies! ",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "A beautiful and a weird film in the same time that i hardly find these day . This film almost get 10/10 from me but it slipped up in the last act , it's so quick and i feel nothing \" WEIGHTLESS \" I think this word would describe film's last act perfectly.",
            "review_date": "2019-05-21",
            "source": "rt"
        },
        {
            "content": "Very sweet and heartwarmingly romantic!",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "concordo com as crÃ­ticas do site, mas nÃ£o a pronto de cinco estrelas. e sim um filme encantador, porÃ (C)m nÃ£o a ponto de ser absolutamente memorÃ¡vel.",
            "review_date": "2019-05-18",
            "source": "rt"
        },
        {
            "content": "I just got around to watching \"Her\" 6 years after it was released, big mistake! I have never rolled my eyes or yelled at the screen in despair at how mind boggling dull and obvious this film is. How can it get 96% rating on rotten tomatoes? How can every critic be falling over themselves on its greatness? How? I mean fucking how? Is this some massive troll? Are we the only people on the planet who wanted to slap Phoenix in the face from the first scene? How can anyone listen to Scarlett's painful voice all day everyday. Bravely we suffered through to the end trying to finally \"get it\" but seriously this is total dross, my brain is wired differently obviously. If you want to be made to think outside the box, watch Ex Machina now that is a movie or his other works like Being John Malkovich which is genius.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "her is a brilliant love story that give us a magnificent message about the human feelings  and the truthful meaning of human relations .",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "A profoundly moving romance betwixt human and machine.\n\nSpike Jonze captures true love and painful separation with his sci-fi romance drama Her (2013). Jonze directed and wrote the most original and grounded piece of science-fiction I've seen in ages. Her brings Jonze's loving direction of intimate moments between a lonely man and a curious AI. Jonze captures realistic relationship moments with every scene despite the unusual pairing with his depictions of divorce, romance, sex, dating, bonding, and especially conversing. Her is simply a remarkable film of deep emotional connections displayed against clean distant future society.\n\nJoaquin Phoenix is remarkable at conveying complex emotions with his subtle facial gestures and distinct vocal mannerisms. His genuine emotional performance is complemented by his nuance driven appearance as the nerdy indie hipster Theodore Twombly that desperately desires affection. Phoenix is so sincere that you believe this brave new world surrounding him. Phoenix was supremely creepy in Gladiator and imposing and depressing in You Were Never Really Here, but Her captures Phoenix at his most vulnerable and intimate. Joaquin Phoenix transforms himself into a weathered man of open mind and aching heart.\n\nHer features several amazing supporting roles. \n\nNotably, Scarlett Johansson does more with her voice in Her as the OS Samantha's vocal personality than most actresses will do in their entire careers. \n\nThen, Amy Adams is so sweet and sympathetic as the kindly neighbor Amy. Her hurt is displayed in her gentle eyes and trembling voice. Adams is enchanting and likable, while constantly striving and achieving a sublime radiance. Amy Adams is a resonate actress that I will always love and appreciate.\n\nOn the other hand, I continue to grow more appreciative towards Rooney Mara. Her blunt and genuine emotional performance as Catherine gives Her the gut punch it needed. Mara feels like the outsider of emotions as we mostly see her in Phoenix's flashbacks, then when she appears she is stunned by Theodore's disposition and further drives a complex wedge into the narrative. Mara does a similar brilliant lambaste in The Social Network as she is the perfect critic, while the ultimate sweetheart in Carol. I think Mara expands her range with both attributes in Her as the fun girlfriend, upset wife, and the disappointed ex.\n\nFurthermore, Olivia Wilde is engaging as Theodore's fun date that turns into a hurtful reprimand of his whole persona. Wilde is mesmerizing, then horrifying just in the two scenes she inhabits.\n\nI must mention that Her contains my favorite acting role from Chris Pratt as the friendly co-worker and cool friend figure to Theodore named Paul. Pratt pulls back and restrains himself from excessive talking, and instead, opts for a more quiet genuine character. He is quite likable and interesting in Her.\n\nSpike Jonze asks us many important and intriguing questions as we watch Her. His script is full of careful conversations of gentle bonding and quiet torment for his characters that feel such a relentless anguish over their relationships. Jonze's writing gives us humorous jokes, sweet exchanges, and shocking revelations. I appreciate Jonze trying to contemplate on the ethics and consequences of OS relationships and the how we engage with artificial intelligence. Her forces us to imagine how the world would look like with everyone tapped into their phones and virtual assistants without connecting to other people. Are the OS's people if they feel emotions or do they just emulate human feelings? Her begs us to consider the ramifications of AI's with the ability to adapt to human interaction and develop real feelings. It is a difficult question to answer and one we will likely consider going forward with ever progressing technology. I think that, at least, Her responds to these questions with the heartfelt assertion that OS can experience real feelings and that AI has the potential to adapt to someone akin to a human with a depth of consciousness. Their awareness and feelings are the significant trait that makes AI real to us and worthy of respect . Not since Stanley Kubrick's 2001 and HAL have I thought about AI on such a complex level.\n\nSurprisingly, the romance bits are tender without physical intimacy, but with a genuine sense of loving sensation through realistic dialogue and authentic visuals.\n\nSpeaking of visuals, Hoyte van Hoytema's cinematography captures the stunning grace of tomorrow's world. Jonze envisions a society of indie clothes, sleek technology, distant figures, and massive skyscrapers. Hoytema captures all this with his camera work with gorgeous still wide shots enveloping the characters and their feelings against empty spaces and the absent people. The majority of Her is just Joaquin Phoenix talking to Scarlett Johansson by himself, so Hoytema is impressive for making Her dynamic visually engaging.\n\nIn all, Her is a beautiful movie of breathtaking filmmaking and tender thoughtful writing. I think audiences and critics alike will revere Her in the future, and what a bright future that will be!",
            "review_date": "2019-03-12",
            "source": "rt"
        },
        {
            "content": "Joaquin Phoenix was incredible, this movie was incredible.  I had heard nothing but great things about this film and they all rang true.  It's a very emotional ride and actually makes you look back at what is/was not a socially acceptable form of relationship.  It drives a lot of points home that you shouldn't be afraid to be yourself and give yourself the joy you require.  Highly recommended and is worth the price of admission a hundred times over.",
            "review_date": "2019-03-10",
            "source": "rt"
        }
    ]
}