{
    "rating": 9.2,
    "release_date": "1985-02-15",
    "num_reviews": 569,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Five high school students from different walks of life endure a Saturday detention under a power-hungry principal (Paul Gleason). The disparate group includes rebel John (Judd Nelson), princess Claire (Molly Ringwald), outcast Allison (Ally Sheedy), brainy Brian (Anthony Michael Hall) and Andrew (Emilio Estevez), the jock. Each has a chance to tell his or her story, making the others see them a little differently -- and when the day ends, they question whether school will ever be the same.",
    "reviews": [
        {
            "content": "I Love this movie I think the characters were betrayed perfectly. If you haven't seen this movie your not living, I would definitely recommend this movie",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "Melhor drama/comédia adolescente",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "I know that they get detention a bunch of times, but getting to hear their life story and their relationships with their parents is what really drives THE BREAKFAST CLUB to a higher level.",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "A simple yet effective story. A classic for the ages.",
            "review_date": "2023-03-19",
            "source": "rt"
        },
        {
            "content": "Funny comedy about these people in high school that get in detention for various reason, like skipping class (really the most common reason), using a flare gun (which does nothing) and intentionally setting off the fire alarm for no reason.  This movie is absolutely funny, and shows the lives of these teenagers.  I keep asking myself questions in this movie, like, \"How are these people not caught?\", or \"Why does the dean verbally abuse these students?\".  Well, I guess it was the 1980s.  There also is an anti-gay joke in this movie, which was common in the 1980s.  If you do not like that kind of stuff, steer clear.  If you don't mind, this could be the movie for you.  Everyone acts well, like Molly Ringwald and Emilio Estevez, prominent young actors in the 1980s.  If you need a good comedy, \"The Breakfast Club\" is the movie for you!",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "Five high school students, all with different mindsets, face detainment in their school library on a Saturday morning. As time passes by, their egos fade and they become close buddies.\n\nThe breakfast is one of those classic comedies that i had never seen before, until now. Personally i think this movie at his core, isn't even a comedy, more of a character study. The movie follows a bunch of great characters, portrayed perfectly by the actors playing them. The first part of the movie introduces these characters all so great and then by the end of the movie, you just fall in love with them. The themes of rich and poor, smart and dumb, loved and not loved, are all so well done. The Breakfast Club would probably be the movie I would identify the 80s/90s the most with and I think that there couldn't be a better movie, to portray that image, fantastic movie and some of the most iconic moments and lines in cinema history!",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "The late great John Hughes delivered another iconic film based on such a simple premise, that if we come together, we'll realize that we're not so different. It also touches on teenage angst in a way which wasn't really seen in movies of its kind at the time. This is all brought to life by a perfect cast, playing their roles convincingly, and a small, but familiar setting. This film has and will continue to withstand the test of time.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "This is a classic and I can watch over and over.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "I didn't like this movie the characters they all were so dramatic. I found all of the characters really annoying in my opinion and it just ruined the movie for me. The acting was frustrating",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "This movie was boring after the first 3 mins. Them students sat in a library the whole movie and just copped it to each other. Absolutely disgraceful!!! 💩💩💩😤💀🤡👎👎 Wish i was blind👨‍🦯👨‍🦯👨‍🦯 The emo/goth was getting on me nerves 😡",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "The movie was average at best. The plot was sloppy and had zero concepts of time. The action was limited and the most action-packed part was running down the hallway. I have heard many good things about this movie and was quite disappointed with how terrible the movie was.\n\nI wish I had been in the hospital instead of watching this",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "This movie manages to use (very) dark humor well unlike other movies that go overboard with it.",
            "review_date": "2023-01-21",
            "source": "rt"
        },
        {
            "content": "The king of the coming of age is and will always be John Hughes (rest in peace) the movie makes you feel everything, sorrow, anger, makes you laugh and even dance with the brilliant soundtrack.\nMy only problem that's why I'm not giving it full stars is Allison's supposed \"Glow up\". At least if they thought to make her more \"pretty\" at the end of the movie, it would have been with her style. not an attempt by claire which is basically the complete opposite of the plot of the movie which is basically that each of them is different. I think that her and Andrew's couple could have developed more throughout the film as they gave certain hints with claire and bender.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "An all time classic movie, Must See!!",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "From the comedy to the drama, this film is a must see for everyone! Sure, there are some suggestive parts that kids probably shouldn't see, but they can just plug their ears and enjoy the rest of the film. There are some scenes where you just don't know what's happening, but who cares?",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "Simple premise; simple setting; great outcome. It's a tight knit cast delivering a commentary on society, within a High School setting, making it accessible",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "Not enough nudity tbh, I saw no boobies so I am thoroughly unsatisfied with this movie",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "A classic and iconic teen drama.  Not the best; that would go to Say Anything; or Juno; or Rebel Without a Cause or American Graffiti.  But it's definitely way up there.  It's one of those movies that; though it's uneven and imperfect; the parts that work, just work so well; they cut like a knife infact; they're so moving; so generation defining.  Moments like when Molly Ringwald admits that though they've all bonded in deep and profound ways; come Monday, all bets are off; since they belong to different cliques; and society has already said never the twain shall meet.  And the way that line just seers right into when you hear it; because it's so true.  Or the heartbreaking moment when Ally Sheedy says, \"I have no friends...\" Or when she says, \"it's inevitable.  When you grow up, your heart dies.\". Or when Emilio tells Judd Nelson, \"You know what Bender?  You don't even count.  If you didn't show up tomorrow no one would even notice, because you don't matter\".  And seeing the pain on Bender/ Judd's face when he says that.  Or when Emilio says to Ally, \"What do they (your parents) do to you?\" Using a shorthand teenagers use since they all feel hurt by their parents.  And she looks back at him and says, in that scratchy, soulcrushing voice, \"they ignore me.\"  Or in the title sequence, which quotes David Bowie's Changes: \"And these children, that you spit on.  As they try to make their worlds... They're immune to your consultations.  They're well aware of what they're going through ..\".  So many powerful moments.  Powerful enough to forgive the phony upbeat ending; when Molly kisses the guy who's been harassing her for two hours; or when Ally gets a makeover and then everyone has a happy ending; (like a makeover ever solved anything!  How shallow John Hughes).  In spite of those failings when the movie works it just works so well.  It breaks your heart; and also gives you such fleeting hope that someone, our guardian Angel John Hughes, was listening; someone who understood us; someone who cared.  Someone who spoke to that scared little 14 year old we all once were; and the scared little 14 year old that's still in us.  And this film still speaks to teenagers and connects to them that way; moving them; connecting them; making them grow in a small way.  That's why this movie is so special.  Not because it's perfect; but because when it worked it spoke directly to the hearts of Generation X; it moved us; it changed us; just like it continues to speak to generations since then.  It's become a right of passage and a cultural landmark.  It's one of those special miracle movies that could do all that.",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "One of my favorite films like 16 candles,and Pretty in Pink.",
            "review_date": "2022-12-16",
            "source": "rt"
        },
        {
            "content": "An instant classic and one of the most fun and uplifting family movies to watch.",
            "review_date": "2022-12-06",
            "source": "rt"
        },
        {
            "content": "A perfect movie! A combination of This, Dazed and Confused and Risky Bussiness will give anyone the ultimate guide to contemporary highschool.",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "a very incredible movie, that is extremely well written, well acted. a very powerful story of a group of high school students from different cliques, different backgrounds develop an understanding of each other, and become friends for a day. incredible movie ",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "I completely understand what john Hughes was going for, but some of the characters were just downright unlikable. Claire has HORRIBLE taste in men, and frankly so does Alice.  Again I understand why this is a classic, I think the concept is FANTASTIC, but I just can't get past some of the Jokes, and behavior, I get their teens but that doesn't make it ok.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "All time dance sequence, still a classic, some things haven't aged perfectly but a classic for a reason.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Cult classic from the 80s, that at the time was a revolutionary teen-drama/comedy. Now, if you're younger like me (mid 20's) you may not see it for the unique, special type of film it is because of how copied it has been over history - but rest assured, there is a reason it was so copied. This is a film that I have watched multiple times and enjoyed it more every time. Being sucked into their world and their detention is truly a mind entrenching experience. This movie approaches the topic of conformity, peer pressure and high school cliques. The plot development is insanely thick. It's also hilarious (to me anyway) - No I didn't go to High School in the 80's - but I can relate to this movie - and I understand what this movie is all about, and its fantastic. 5 stars all the way. Take a dip back into high school life - without actually having to go back. Also, the makeover was the only bad idea in this movie - and it has not aged well. There's a full hour and 20 mins of other classic scenes though. To all stoners - you'll especially like this one.",
            "review_date": "2022-08-29",
            "source": "rt"
        },
        {
            "content": "This movie is the pinnacle of the teen drama type movies. No movie I've seen has yet to be better. The characters each go through a lot of development. The breakfast club shows an accurate representation of high school, portrayed by the 5 stereotypes of the brain, an athlete, a basket case, a princess, and a criminal.\n I really believe each teenager should see this movie before going into high school. I could say so much more, but it's my absolute #1 movie.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "While it is funny throughout, The Breakfast Club is known for being a sentimental drama and one of the 80's great coming-of-age stories. The film focuses on high-school age adolescence and has each of the main niches outlined in it's cast of characters. We have the Jock Andrew, the Princess Claire, the Brain Brian, the Criminal John and the Basket Case Allison. While each is a unique individual with their own feelings and beliefs, they also conform to these niches both by peer pressure and by the natural order of things in high-school. I think most people can find at least one or more characters that they see themselves like or at least can understand and relate to when they were in high-school. While I wasn't a \"basket case\" I guess I could identify with Allison in the fact that I was mostly a loner (friends would come and go and would only be one or two) and I liked what I liked simply because I am who I am. The entire course of the film unfolds over a Saturday detention which all the students, for one reason or another, are stuck in for the entire day. The strict and seemingly miserable Principal Vernon is there to make the students feel as miserable as he is. Over the course of the day though each one learns to overcome their classification and befriend and even start romantic relationships with one another, when at the start of the day that had not even noticed them. They each grow as people and mature, not fully, but they learn something new about life and open up their futures in doing so.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (10/10) ; Cinematography (8.5/10) ; Plot (9/10) ; Acting (9/10) ; Pacing (10/10) = 93%}\"",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "I feel morally bound to review it because I lived it.  Not the detention part. At my high school, the teachers made us cut classes to do pagan rituals in the back field. The guys seem like a good representation of teenage boys at the time. But Molly Ringwald and Ally Sheedy serve as reminders that directors like John Hughes liked to write us into the script as one-dimensional stereotypes.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "L movie tbh. had premarital sex scenes which are always gay. also bro in green got no play. i dont understsand how the admin didnt smell the weed on them it doesnt go away that easy. i also dont get why the second half of the movie jujst completely forgot about the admin. uhhhh the red head was probably the most reasonable character untile  she had sex with the guy who sexually assaulted her tbh.",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Possibly the best teenage-angst movie. It's funny, touching, and dramatic, while never pushing it too far into camp or melodrama.",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "A really well done example of proper character development - a must see movie!",
            "review_date": "2022-07-20",
            "source": "rt"
        },
        {
            "content": "Different types of schoolkids brought together in a weekend detention.",
            "review_date": "2022-07-08",
            "source": "rt"
        },
        {
            "content": "Such a good movie, made me smile the whole time. Definitely should watch at least once in your life. ",
            "review_date": "2022-07-02",
            "source": "rt"
        },
        {
            "content": "I know I have most of my reviews as a 5-star rating but it's true, every movie that I've watched/re-watched recently that I have given that rating has earned that rating.  The Breakfast Club is no exception.  John Hughes is a fantastic director who captures the nostalgia and esthetic of the 1980's so perfectly.  The Breakfast Club is a great character study about five wildly different high-schoolers from polar opposite social classes who end up finding friendship in each other at detention on a Saturday.  It is my second favorite film from John Hughes as well as one of the best movies from the 80s in my opinion.",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "It's such a classic. I have no idea who would not like this movie. If someone says they don't like this movie, they are a red flag.",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "Memorable 80s film worth a watch",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "The breakfast club is an 80s gem that stands out because of its deep look into adverse adolescent psychology and it's self aware, dark, dry humor.",
            "review_date": "2022-05-18",
            "source": "rt"
        },
        {
            "content": "A movie about conformity. Great!",
            "review_date": "2022-05-14",
            "source": "rt"
        },
        {
            "content": "How can a movie about the detention of 5 students be so good",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "Enjoyable. Realistic characters, and an engaging story propels this movie to the forefront of the collective viewer's hearts and mind as the narrative propels us to an engaging and compelling ending.",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "This  blew chunks.  I saw it on cable around early 2000's.  I lived through the 80's, albeit at 13 years older than these characters.   High school doesn't change that much in a decade, but I saw absolutely nothing about this whole premise that was at all plausible.  No school I knew ever had all-day Saturday detention and if they had, no teacher AP was going to spend his Saturday for five kids who didn't commit an offense less serious than mass murder.  If the scenario was farcical, the characters' behavior was more so.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "It was an amazing movie",
            "review_date": "2022-03-27",
            "source": "rt"
        },
        {
            "content": "A cult film from the 80s!",
            "review_date": "2022-03-09",
            "source": "rt"
        },
        {
            "content": "Entiendo totalmente por qué esta película es de culto. El desarrollo de cada personaje y su complejidad nos hace sentir tan cercados a pesar de las décadas. Cómo nos dejamos llevar por las apariencias y el común denominador del por qué ellos están ahí. Y esto únicamente desarrollado en una biblioteca. \n\nSiemple y sencillo.\n\nMe encantó.",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "I didn't find it very funny, rather quite intense and suspenseful, as John Hughes' signature relatability with teen stories here takes a not-so-subtle jab at adults, how they influence adolescents, and how different backgrounds come together in different ways.",
            "review_date": "2022-02-27",
            "source": "rt"
        },
        {
            "content": "It's a classic. No other words are necessary...",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "ah yes, no one understands teenage drama better than adult film directors",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "Five unalike teens, doomed to spend their Saturday afternoon in detention, bond over the difficulties of growing up, familial struggles, and social pressure. All the while, they try to avoid their strict principal in order to get into some good old-fashioned mischief.\n\n\"‘The Breakfast Club' Is The Ultimate, Essential Coming-of-age Film. John Hughes's Story Is So Impactful, Accurate, And Relevant. He Explores Some Of The Dark Sides Of Teen-hood With A Lot Of Honesty. The Cast Was Exceptionally Engaging. Bringing These Memorable, 3-Dimensional Characters To Life Could Not Have Been An Easy Feat.\n\nHughes's Story Allowed Older People To See The Perspectives Of Young People And Vice Versa. When You Can Make People Think, Relate, And Come To An Understanding, You've Created A Timeless Masterpiece.\n\nThere Is No Simpler Way To Say That ‘The Breakfast Club' Is Raw, Real, And Relevant Than How I Just Said It. Every Teen Should Watch This Flick Growing Up. All Adults Should Watch This Flick Growing Old. 95%!",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "The perfect teen movie that is surprisingly emotionally deep and has a fun story that somehow works despite its silly premise. \"The Breakfast Club\" has incredible acting, and is one of the best teen and coming of age movies ever made that blends fun with a powerful movie with a fantastic message that still sticks with you even after watching the film. The characters are memorable and relatable in their own ways, and the film perfectly represents the stereotypes set for its time. Overall, a timeless classic that still remains relevant to this day, with characters that still remain relatable to this day.",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "The movie starts very slowly and takes it's time to establish the characters. This was well done. What fealty forced for me was the romance that was added at the end. It took nearly the whole movie just to learn the true characters of the students. What didn't fit proportionally was how the characters formed romantic relationships in slightly over 5 minutes. This felt rushed. The friendship building was done well. As are the sad moments. It was good but not as good as I was led to believe.",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all Time !",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Not exactly breaking stereotypes, however, it gets you thinking about why people act the way they do and how much influence our parents and friends have on our lives and our actions.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Enthralled with amazing characters, wonderfully writing and poignant themes, \"The Breakfast Club\" continues to touch generations even more now than it did during its initial release.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "A classic that should be watched, though I doubt it will blow you away.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "In one sentence: Funny, smart and with a perfect script, I loved this.",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "Absolutely love this film! Full of fun, laughter and entertainment! A true classic film!",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "Another one of those who were revolutionary at the time. But now we have so many more refined versions of the exact same story. This one has heart but is so campy, it dilutes the intended message.",
            "review_date": "2021-08-27",
            "source": "rt"
        },
        {
            "content": "Summary: Five high school students from distinctly different social circles land themselves in all-day Saturday detention with their god-awful principal. The boredom brings the kids together in interesting ways.\n\nTakeaways: Peer pressure isn't just something kids deal with. Too often, people change who they are based on who's in the room. Although the movie is from 1985, the student struggles are still relevant today.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "The original teen movie. A timeless classic that has heavily influenced every teen movie since.",
            "review_date": "2021-07-25",
            "source": "rt"
        },
        {
            "content": "\"CARL: You wanna be a janitor? Oh, really?  You guys think I'm just some untouchable peasant?  Peon? huh?  Maybe so, but following a broom around after s%$theads like you for the past eight years I've learned a couple of things… I look through your letters, I look through your lockers… I listen to your conversations, you don't know that but I do… I am the eyes and ears of this institution my friends.  By the way, that clock's twenty minutes fast!\"",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "An '80's classic which has not lost its charm or message over the years. \"The Breakfast Club\" successfully portrays high school stereotypes through five well-developed characters. With relatability, humour and memorable characters, this film is an enjoyable classic.",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "I was with this movie when I was thirteen until the end.\n\nJohn Bender (Judd Nelson), Claire Standish (Molly Ringwald), Andrew Clark (Emilio Estevez), Brian Johnson (Anthony Michael Hall) and Allison Reynolds (Ally Sheedy) all have their own reasons for a Saturday 7 a.m. to 4 p.m. detention with Vice Principal Richard Vernon (Paul Gleason). Before they leave, each of them must write a thousand-word essay that describes who they think they are.\n\nDespite the fact that they all come from different worlds, they're all living similar lives, crushed by parents who either give them too much or not enough attention. In one day, they all learn that they could be friends.\n\nJohn Hughes, who wrote, produced and directed this film pretty much ran the 80s when it came to teen films. Of course, the error in this film, the one that never makes sense to me, is when Allison gives up her quirky individuality to put on makeup and become like everyone else. Even when I was young it felt hollow and it seems even more empty today.\n\nP.J. O'Rourke, who worked with Hughes at the National Lampoon, summed up the film in a way that makes me question so much of it. He said that the movie lives up to Hughes's politics, in that the students do not organize a protest together but, \"like good conservatives do, as individuals and place the highest value, like this conservative does, on goofing off. Otherwise known as individual liberty.\"\n\nEveryone wants to have a moment of rebellion but when faced with the opportunity, so many of us put on makeup and try to fit right in.",
            "review_date": "2021-06-08",
            "source": "rt"
        },
        {
            "content": "It great. The characters are very relatable to teenagers and it has a good message about everyone has emotions and that you can be yourself.",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "Best movie of ALL time!!",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "I knew these kids in my high school. Maybe this is a giant ladle of teenage tropes, but I understood it, I felt it, it was good in its day. And its still pretty good now.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "A really enjoyable movie that strikes a realistic balance of intensity and humour which provides a great insight to the lives of teenagers from different upbringings and ways of life. This movie exists entirely within a school which means a largely static environment set up. Because of this, the weight is primarily on the characters throughout the movie. Seeing this veteran cast in their earlier years take on these various roles was a real treat. Their ability to reveal more and more various depths of emotion when required is brilliant. I believe whoever watches this film will find themselves being able to relate to one or more characters in some way or another. Alongside the powerful and revealing performances, the fantastic screenplay gives an honest presentation of the rapport between teenagers.",
            "review_date": "2021-04-30",
            "source": "rt"
        },
        {
            "content": "This movie's simplicity and witty dialogue are the elements that make it so wonderful. The characters are well developed, and although it takes place in few locations, it never fails to impress, entertain and provoke reflections.",
            "review_date": "2021-04-30",
            "source": "rt"
        },
        {
            "content": "I think maybe because everyone hyped it up so much I expected more.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "Fun of course, it has a very intuitive specific way of explaining the motivations through the consequences of the characters but, without being forced, it makes us feel sympathy or attachment for them even though some may tell you the opposite about their attitudes, full of humor, Strong songs and warm emotions \"The Breakfast Club\" is an absolute classic!",
            "review_date": "2021-04-11",
            "source": "rt"
        },
        {
            "content": "An iconic 80's movie, still relevant today.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Classic movie that has great actors and great directing and don't you forget about me.",
            "review_date": "2021-03-22",
            "source": "rt"
        },
        {
            "content": "This was a really good movie over all. But the only thing that really didn't make it for me is that some of the humor and concepts of the movie didn't really translate over for me. I don't know. Maybe I watched it and I'm too young to really get it. But either way, The Breakfast Club is a really good movie.",
            "review_date": "2021-03-07",
            "source": "rt"
        },
        {
            "content": "Classic, a movie everyone should enjoy once",
            "review_date": "2021-03-03",
            "source": "rt"
        },
        {
            "content": "Your review will help others decide whether to watch.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "One of my favorites from my childhood!  Great getting to see it on the big screen with my kids!",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "A cult classic with a soundtrack you won't forget",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "A fun high school movie",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "The greatest movie with the stars of the future!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "This film is a masterpiece in all of cinema.",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "To be really truthful. It is an honest depiction of high school hardship.",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "Ahhhhhh youth!!!!! Makes me smile from the memories it brings to mind",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "This is your typical 80's feel good movie. Although, it will have you experiencing every emotion there is.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "It's one of the classic coming of age movies. A few lessons dropped in to be learned, a bit of rebellion and a winning soundtrack. What's not to like.",
            "review_date": "2021-02-06",
            "source": "rt"
        },
        {
            "content": "The characters are amazing, but sometimes I think the movie tends to fetishize their sadness.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "This is my favourite movie of all time, so I may be slightly biased but for good reason! No matter how many times you watch this movie, it never gets old. This 80s classic just has a way of reaching a variety of audiences, across generations and ethnicities. It's got perfect comedic timing, a talented cast with great chemistry, charming screenplay and likeable characters. Seriously, it will change the way you think of 80s movies. John Hughes hit another home run with this one. Maybe not for everyone? But that's their problem!",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "A very funny and creative film that is John Hughes' 2nd best film.",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "i love this movie, see it!",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "It's a great and smart movie it depicts the Social Classes in Highschool and how everybody has their reason for their actions so we should always try to understand each other.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "I think I'm just a few years too young to understand why this movie meant so much to so many Gen Xers. Yeah, high school stereotypes are rooted in complex social truths but did you really need a whole movie about it? Somehow I think they'll still be eating lunch at different tables now that detention is over.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club falls into the category of films that, despite taking place in only one location (such as 12 Angry Men), still manages to be a fantastic story due to its great dialogue. The main characters, as different as they are, still work excellently off of each other, particularly due to the amazing actors portraying them.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Overrated. Coming of age movies often don't age well because they're kind of generational specific and this one is no exception to that. It's over-dramatic. The dialogue is often unintentionally funny. This would be labeled a joke if it came out and was exactly the same today. People like it because of nostalgia and familiarity. But there are some funny parts and the overall message is a valuable one even if it's a bit too idealistic.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "A classic in every sense of the word. \"The Breakfast Club\" offers up terrific writing and a simple, yet beautiful story to match it's charming and talented young cast. A true pleasure to watch.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "I am so glad that I finally watched this movie. I can't fault it for using very archetypal characters when it does them so well and the sheer quantity of dialogue was refreshing and rather surprising. This is a movie that was so sure that the screenplay and script were sound that they barely interrupted it with any sort of action scene. When they did it was in part to advance the plot, like when they get all the characters high. The plot itself was indeed predictable but it seemed this was more about the journey than the destination. They used some obvious tropes that made me feel smart watching the movie like having them shed layers of clothes as they reveal the layers of their personalities. The one disappointment for me was that I'm sure I read or heard somewhere that the soundtrack was fantastic, whereas I found it to only be so-so, and they didn't utilize their most famous song very well. I also thought the displays of aggression between the two main guys near the beginning was a bit clumsy and unrealistic, but this was otherwise a home run for me.",
            "review_date": "2020-11-27",
            "source": "rt"
        },
        {
            "content": "Another incredible film directed by John Hughes, fun and dramatic at the same time, The Breakfast Club is the best film I have ever seen in my life.  If I could I would give an indefinite number of stars to this masterpiece.",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a drama and comedy film released in 1985. The film tells the story of five young people with very different personalities who, being placed in detention at school on a Saturday, are forced to meet and thus form a strong bond of friendship. .\n\nThe strength of this film is impressive, I was born 20 after the release of the film and even so it marked my childhood a lot. He can portray adolescence very well, even in just 97 minutes of viewing, the characters are great and can make you even moved by the relationship of the five.\n\nThis film is part of the line of teen films by director John Hughes, which launched in the eighties: Ferris Buller's Day Off, Sixteen Candles and of course The Breakfast Club.\n\nHowever much this film has marked me a lot, I have to admit that it is not perfect. The feature has some slightly unnecessary and meaningless scenes (like when they start dancing out of nowhere), some exaggerations and clichés. But it is a remarkable film, funny, captivating and fun, even with some mistakes in my view.",
            "review_date": "2020-11-03",
            "source": "rt"
        },
        {
            "content": "I like to watch movies, and the reason for that is a movie should be fun for me to watch. This film is a perfect definition of fun. It tells a story about classmates trapped on a Saturday detention. All of them have different opinions and different looks on the world, which is why their chemistry works so well. The story opens up every single conflict they have and shows it brilliantly. This is my favorite movie ever made, out of all Teenage comedies, because it is actually relatable. Every single one of us is a princess, a bad guy, a sociopath etc, but all of us have our own flaws, which is why while watching this I didn't really know who my characters is, because I felt like if they are all part of me. If there was a numeric system on Rotten Tomatoes, I would give this movie a 10/10, as I have watched it nearly 10 years ago, but I still remember every single episode from it.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "Melhor filme adolescente de todos os tempos!!!!",
            "review_date": "2020-10-18",
            "source": "rt"
        },
        {
            "content": "Intramontabile commedia di formazione quasi totalmente incentrata sulla scrittura dei dialoghi, rapidi, intensi e in grado di variare dall'ironia alla tristezza con un'abilità immensa.\nCinque ragazzi che in qualche ora toccano picchi di gioia per crollare in fondo al pozzo della depressione, ed uscirne diversi, più maturi e forse migliori.\nMolto interessante la semplicità con cui vengono esposti gli effetti che hanno i comportamenti dei genitori sui figli.",
            "review_date": "2020-10-04",
            "source": "rt"
        },
        {
            "content": "EXCELLENT Movie It Doesn't Get Old Will Live On Forever.",
            "review_date": "2020-09-25",
            "source": "rt"
        },
        {
            "content": "The summer of my senior year of high school this was MY movie and my best friend and I literally went to the theater almost daily to see it. We couldn't get enough of it. Today my feelings for this movie have changed but it does have a great cast and has a powerful message. John Hughes did an amazing job with this movie which is full of a huge range of emotions. I am still amazed at how well he knew what teens of the 80's were feeling. This movie does have a LOT (and I mean a LOT) of swearing in it (some of which is funny, but mainly unnecessary, IMO), but the message is still there. I recommend i",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "I love John Hughes. I love a ton of his films like Ferris Bueller's Day Off, Weird Science, Sixteen Candles, and Plains, Trains, and Automobiles. But this is my favorite. This film has some of the best characters I've ever seen. This has some of the best acting and writing that I've ever seen. The best part of the film is that all the characters start off as stereotypes, and by the end they all see that they are all similar, at least a little bit. Which also results in you relating to all of them, while some more than others. My favorite scene is when all the characters are just sitting in a circle and just talking. It is amazing and I recommend it to you just for that scene. But it's not just the amazing acting but the amazing writing. It's so well written. I can't emphasize it enough. This film is a masterpiece and it's my favorite Hughes' film and you should watch it.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "Perhaps the most iconic and BEST 80s film of all time!",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "This film was amazing. It morals still hold up today and, the characters are relatable even with the stereotypes that were set up at the beginning. This film will always stand the test of time.",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "As a teenager watching The Breakfast Club for the first time, I had heard so much love and admiration for the film. It is praised for it's deep understanding of the teenage experience. Personally, I found the movie and its characters to be completely stereotyped and unrelateable. The Breakfast Club is a mediocre movie from a different time that suffers from way too much nostalgia, poor film making, and the false notion that having someone blatantly sexually assault someone and then end up with them is a good message to send kids.",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "A miraculous, effective and authentic depiction of genuine characters hidden beneath what they decide to show the world. you think it'd be boring to have a movie of five teenagers spending their saturday on detention from the the start to the end,yet somehow this movie manages to turn the tables to its advantage and create a masterpiece. the truthful and outstanding performance by each actor made it very easy to watch.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "An 80's teen movie, with cult status and an important message.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "A classic teen movie that has become a cultural reference.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "Great performances as well as an interesting story that like a lot of the films made during its time has a heart and soul. Classic",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "A classic. Can't believe how good a movie from 1985 felt. Perfect for teachers, parents, adults and teens. just a beautiful movie.",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "this movie helped me get through a lot of negative things in my life and displays accurate representation for a lot of issues the media usually shy away from. in one way everyone can relate to a character from this film. everyone. this will always be my favorite movie and for good reason.\n\n\n\nT",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "So overrated its not funny - finally sat down to watch it and was utterly disappointed.",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "Nearly perfect movie",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is 35 years old and still going strong.\n\nThe problems that high-school students have today aren't much different than they were for their parents -- or even their grandparents.\n\nWe have always had communication and respect issues for the people came before us in life.\nThe movie doesn't preach to us that \"all we need is kindness and understanding\" but it tells the story of five very different kids and how they are searching for the answers of how to cope with their parents and deal with authority.\n\nWe needed a good listener like John Hughes to help us understand the needs of our young people.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "i watch it whenever it's on .. and it still gives me awesome feels! \n    -Tom (The Nerd)",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "A charming, insightful, funny and emotional, albeit sometimes problematic, character study on the lives and struggles of teenagers.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Classic teen film with a great script.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "To be honest, I didn't really want to watch this movie. Reading the plot I was immediately uninterested. However- since it was often recommended to me by friends, who know of my constant search for another good movie- I finally decided to give it a chance. I was amazed! I love this movie! Although playing almost entirely in one room and lacking the usual complicated plots, this movie managed to capture my interest at the very beging and had me hooked. The acting was spectacular and since I am a girl that's all for happy endings- this movie was perfect.\nI highly recommend it.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "A better-than-average John Hughes teen flick from the Gen-X 1980's shines due to a well-written script. Identifiable clique characters avoid swimming too deep into stereotype territory.",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "This movie should be shown in schools around the globe. Think this is the state of the Art of that Time Period. All the Cast did a great job. This stuff is more real than u might think.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "Lots of coming of age aspects everything from character development to plot put together very well,Best Highschool movie of all time without a doubt",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "I've always wanted to watch this movie ever since I was a little girl. I forgot about it for a while but I recently watched and I adored it. These are the kind of movies that you should learn something from it. Its been many years later since this movie came out and nowadays many teenagers can still relate to these characters. In my case, I don't relate with any of the characters but I can understand what they are going through. I loved it. This is a definitely must watch.",
            "review_date": "2020-06-21",
            "source": "rt"
        },
        {
            "content": "It did have some great scenes and the characters were interesting, however I found it a little boring as nothing much happened. It has grown on me a little, but just wish for more plot.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "What a classic! I would definitely watch again in the future.",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "There is a charm and wit about this movie that save it from being a terrible movie. It is dialogue heavy, and there is not a lot going on in the story. Put simply, this is a movie about five very different kids trying to get through a Saturday of detention together. The great writing by John Hughes makes this one of the most memorable films from the 80s. The characters can be classified into standard stereotypical high school kid clichés, but there is depth added to them through their conversations. The actors all do great jobs of portraying all their character's nuances. The story is so simple, and yet it is entertaining and satisfying. Hughes is able to dissect the teenage psyche tactfully enough to make a deeper and more meaningful movie about high school. Any viewer of this movie will be able to relate to one aspect of at least one character to their high school selves. This film has some good laughs, and some great drama. The balancing act between the two is done so well that it makes it feel very natural and free flowing. Even 33 years later, this movie remains relevant and relatable to teenage audiences. The moral that people of all different backgrounds can be friends and coincide with one another is a never-dying moral, and \"The Breakfast Club\" teaches it well. This is a great movie and is definitely worth seeing more than once. Overall, I give this film a 9/10.",
            "review_date": "2020-05-30",
            "source": "rt"
        },
        {
            "content": "A relatable comedy that brings out the quirky yet maturing mindset of teenagers.",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "I just watched this movie for the first time and I can see why it's a classic! It's a lot of fun and pretty accurately reflects the feelings of being in detention, but in a fun way. The antics are just goofy enough to keep it interesting, and some clever camera work makes you feel like you're in the scene. Unfortunately the more dramatic parts of the film are a little harder to take seriously (first-world problems anyone?), and there a few social issues, like a fair amount of sexual harassment that isn't really taken seriously, and those detract from the viewing experience a bit. But overall, this is a classic for good reason!",
            "review_date": "2020-05-25",
            "source": "rt"
        },
        {
            "content": "It's a great movie about stereotypes and has lessons.",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "the characters were lovable and the plot overall was quite entertaining.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "Despite some cheesy stuff (it's the 80s after all), it's a sweet film which raises some issues that might seem trivial but it's a work well done.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "This clever teen drama/comedy is one of the best of all time. I for sure believe it to be John Hughes best film. The cast is brilliant. This is the true rawness of what really goes on in schools and how teenagers feel pressured into fitting in. It is a good behavior study of Americas youth in the 80s and still can be to this day. Don't you forget about..this one.",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "As a teenager I remember thinking that this was the only movie that correctly depicts landscape and human interactions of high school. With great performances from all of it's cast members, There is a reason why The Breakfast Club is such an iconic movie.",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "This movie is amazing even if the whole movie is just 5 students in a school the whole movie. It shows how to create real friendships and how to be open and honest. I shed probably one tear in this movie, but overall it is amazing.",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "Much of what makes Hughes' work so enjoyable is its simplicity and familiar character, like a Norman Rockwell painting. Much like those paintings, critics may put them down as frivolous takes on familiar territory, but the world puts a price on these works similar to that of any great \"serious\" artist, because it still gives you a sense of resonance. As much as any of his films, The Breakfast Club plays on straightforward characters that occasionally border on stereotypes (which is purposeful, the ridiculousness or assigning preconceptions onto people based off of major generalizations), but its candid dialogue and charm work in concert with these portraits to produce a classic film about coming-of-age in the era of cliques. (4/5)",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "Even by today's standard the discussions and issues faced by teens is relevant in this age of immense advancement as it was in the 80s'.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club sees the absurdity of Albee and Tennessee rejuvenated as the film delves deep into the existential angst of every teenager: who they are beyond the brains, the beauty, the jock, the rebel and the recluse? \nThis film intertwines humour with darkness, not only leaving the characters with changed perceptions of themselves and the others by the end of the film, but giving the audience new understandings of others too.",
            "review_date": "2020-04-29",
            "source": "rt"
        },
        {
            "content": "This movie is one of the best if not the best 80s film there is, the fact is, every teen character in this movie can be related to someone we know in High School. I loved every aspect of this film with some of the best chemistry that I have seen. This is one movie that left me feeling both happy and sad for each of the characters, and it isn't easy to make me care about a film in that way. As that being said for this being a 80s classic and each actor giving their best performances and for this movie becoming one of my favorite movies of all time and for becoming one movie that people would never forget, I give \" The Breakfast Club \" a A-.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "yes, it is a little cheesy and predictable but the whole film is an emotional journey from beginning to end for both the characters and the viewers. it was very enjoyable to watch and i think very informative as well.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "On paper the movie doesn't seem to be anything incredible, but given the chance to 5 absolutely talented actors to improvise and to a director (with interesting ideas) to tinker, you get an honest, warm and affecting picture",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "Loved it! almost every line was intentional and made you think but it was still an easy watch. The whole cast of characters has something different to offer and there are so many cool themes explored. The first 30 minutes are a little slow but I think it's so interesting even from then seeing the characters develop. Reminds me of when I was in High School in the best way and I can still relate to it a TON.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "'The Breakfast Club' is extremely good, entirely thanks to its fantastic cast who produce tremendous performances.\n\nJudd Nelson typifies that statement, he brings everything to the role of John which makes you feel for him despite his indiscretions. Ally Sheedy is also great, as she plays Allison - I already knew of her from 'Short Circuit' and 'WarGames', she's done some solid stuff. Molly Ringwald, Emilio Estevez and Anthony Michael Hall all add heart and meaning with their characters.\n\nOther than the on-screen talent, it isn't really that great a production in all honesty. The message is brilliant and it deserves the plaudits it gets, but take away Nelson, Sheedy & Co. and it's a much, much weaker film.",
            "review_date": "2020-04-15",
            "source": "rt"
        },
        {
            "content": "Interesting movie. I should've watched it when I was way younger, but still had some fun watching it. I wasn't involve emotionally with the movie, and at times I found myself laughing when maybe I should've been crying. It didn't reach the sensitive place inside me, but it was fun, nice movie with good acting, funny moments, and thought provoking moments.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is the story of five different teenagers who must spend a day in detention. \nMolly Ringwald is the princess,  Anthony Michael Hall is the brain, Judd Nelson is the criminal, Emilio Estevez is the jock and Ally Sheedy is the basket case. The film mostly takes place in one room and features good performances from all, including the principal, played by Paul Gleason. It's a unique look at how high schoolers really think and feel and is highly recommended.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "A coming of age teen story in which everyone can relate to in some way. Some great performances all round and a classic soundtrack for the time adds to the mood.",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "I am officially making this the 4th Perfect movie I've considered, because it's That good. the amazing thing about it is it hasn't aged At All, and is just like it is today, 35 years later. It's shocking just how relevant and interesting this movie is even Today for Everyone, and has some astounding scenes that are just Perfect! Characterization, cinematography, dialogue, plot, characters and Casting, I mean Judd Nelson was Perfectly cast for his role and noone anywhere, anytime in history, could have played it better for this specific role. This is a timeless masterpiece, worth endless watches throughout your life to remind you of truths you Will Factually forget (synapses Must be reformed in the human brain because each synapse has a maximum \"shelf life\" of 30 years, so sorry 40+ you probably do Not remember being a kid; facts). Watch this Today if you haven't seen it!\nSome bad things would be that the jailer guy was a bit Too intense, with one scene giving Bender some detention days, he came on Too strong to be the \"good guy.\" Also, some music is good but they might have found a better score, like in the hallway run scene. None of these things are \"negatives\" per say, but you do notice them. That's about it on bad things. Good jokes, humor, and cinema in total, and is one of the best movies ever made!",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "Very good, absolutely must to watch",
            "review_date": "2020-03-21",
            "source": "rt"
        },
        {
            "content": "When you decide to throw the dice and play nostalgia roulette, you know you run the risk of rolling snake eyes and what you remember is vastly different than what is. And it seems that the further back you go, the greater the risk. Luckily, The Breakfast Club is still a safe bet.",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "It was great to see a classic in the theatre again. It was almost like the first time but this time people couldn't help but quote the classic lines out loud but maybe just a bit too loud...",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "THROWBACK TIME!!!!!!!!!!!!!!!! It's Thursday and I haven't posted to my less than 30 people audience, but I'm back and ready to waste a few minutes of my life. So this is something my Nana showed me that made my mom go crazy! The characters are likable, it has a beautiful atmosphere, and It is actually accurate! Go watch this and don't waste your time reading this!",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "This 80s teen movie is a classic. The ensemble cast of Emilio Estevez, Molly Ringwald, Anthony Michael Hall, Judd Nelson, and Ally Sheedy did an excellent job in this movie. John Hughes did a great job directing this movie as well. The plot to the movie was funny and dramatic. It made detention seem like it can be fun. Check it out. It's worth seeing.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "What a pile of garbage. Maybe its because I didn't watch this as a kid/teenager so I don't have the nostalgia that many others do but this movie seriously sucked. \n\nBender is an obnoxious loser and as the main character makes the whole movie tough to watch because you don't sympathize with him or think he is cool you just hope he gets removed from the school and the movie so you don't have to watch him anymore. \n\nThe others aren't much better whining about their problems non-stop. What is the interest in that? That isn't compelling to watch at all. \n\nThe principal is a huge jackass that should have been fired long before the movie even started but really with the parents seemingly supporting sending their kids to detention for a whole Saturday maybe he isn't to blame and it is the moron parents supporting this ridiculous premise.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Truly a one of a kind movie.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Un clásico del cine adolescente . Insuperable . John Hughes era un maestro a cuanto a recrear las emociones y sentimientos de los adolescentes . Todos son destacables y cada uno aporta lo mejor de si sus frustacraciones y deseos de escapar de su realidad . Los más destacables de los 5 son Judd Nelson y Emilio Estévez .",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "Just had to rate to boost the numbers.  This is an all time favorite.  Maybe you have to be Gen X.  ;)",
            "review_date": "2020-02-11",
            "source": "rt"
        },
        {
            "content": "A movie I watch over and over...always will.\nThe only part of the movie that's bothered me a little was when they all smoke and Andrew Clark was going nuts and dancing all hyper... did he not smoke the same stuff as them? Who acts like that while high on weed? Lol",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "The best high school drama I have ever seen. It's old but it still works.",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "I went with 3 1/2 stars what a great movie they don't make movies like this anymore. So many good memories attached to this movie this movie reminds me of my dad, who showed me this movie for the first time when I was younger. Good story, acting, actors and soundtrack a 80's classic movie go watch this movie well worth the watch.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "A behavior guide for youth.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "By the numbers high school 80's comedy. Each character may start out as a stereotype but they manage to make you understand why each of them act that way and how they are all actually not that different. Highly recommend this film to anyone who hasn't seen it. I went way to long without seeing it.",
            "review_date": "2020-01-11",
            "source": "rt"
        },
        {
            "content": "Bittersweet is what I would describe this movie. Nothing will change, but each member of The Breakfast Club will take a heart warming memory from their encounter with each other. Something I think everyone wishes they could have. Wish I watched this when I was in high school.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "THE BREAKFAST CLUB is remembered as a classic, and rightfully so, as it portrays teenagers as actual people instead of nothing but sex crazed monsters. (I am disgusted that movies like \"American Pie\" even exist)",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "Biggest waste of my time. All hype no reward. Don't think it has stood the test of time or is more for an American audience. I Couldn't relate and found the while movie pointless",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "A++++, JOHN HUGHES!! This movie had everything that made me want to time travel back to 1985 and be a teen in the best decade ever! It had awesome music, like \"we are not alone\", and lots of comedy! Once I saw the movie, I saw a whole new perspective, and I can relate to characters. It's too bad we cannot see more of the five teens. \n\nOne con however is WHY all that sexual misconduct from Bender? I especially think they should have removed the infamous Bender-under-the-table-scene. Also, they should have made Bender apologize, as it kind of did not make sense for Claire to hook up with latter, after he abused the **** out of her.\n\nHowever, this is an awesome movie that is nearly impossible not to like!! Well done, John Hughes!! Well done!!",
            "review_date": "2019-12-17",
            "source": "rt"
        },
        {
            "content": "fantastic Movie! the cast is exeptionaly chosen, and the charaters are amazingly written and acted. I love the story, and the struggel is real. I am a teenager and I really reccognised my own adolecent troubles in this Movie. It's realistic and toned Down. It is not being more or bigger than it need to. Just overall a great Movie.",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "I'll recognize the movie for what it does right more so than what it doesn't do. It has a great script that makes sense and works toward its strengths. The actors seem like actually edgy teenagers all trying to find out who they are and express them selves. This is one of the older 80's movies that I can really appreciate. Its a product of its time is some area but that still seems to make it a classic that a lot of people re-watch.",
            "review_date": "2019-12-03",
            "source": "rt"
        },
        {
            "content": "watch it. just watch it.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "The breakfast club has such a simple idea yet director John Hughes makes it so much more than that.",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "A pure soul.. A sensitive plot with a fresh stroy which I'm sure one would relate to his/her youngerhood.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "This is such a great movie. It's by far the best 80s movie I've ever seen. 98%",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "Amazing brilliant 80s drama with John hughes at his best and the characters are so real and relatable to each other.",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "The best John Hughes movie ",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "One Of My Favourite Movies Of All Time!!!!!",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "I just watched it yesterday and it blows my mind how clever this film is. The story is so basic and simple, and it ends up having a strong message, a lot of clever jokes, relatable scenes and much much more.",
            "review_date": "2019-09-17",
            "source": "rt"
        },
        {
            "content": "If you´re only watching one coming-of-age movie in your lifetime, be it The Breakfast Club. ",
            "review_date": "2019-09-14",
            "source": "rt"
        },
        {
            "content": "Overrated. Film très cucu; s'il n'était pas si culte, je ne l'aurais même pas regardé en entier.",
            "review_date": "2019-09-13",
            "source": "rt"
        },
        {
            "content": "Review:\n‘The Breakfast Club' is an American comedy-drama film written, produced, and directed by John Hughes. I've seen this movie more times than I can count. I just love it so much, mostly because it's so relatable to me. We all remember being a teenager. A crazy, intense time when your highs were higher and your lows were lower, and every experience was that much more significant. This movie really captured what high school is like no matter what year you attend.\nThe movie starts with five teenagers getting dropped off at school for detention on a Saturday. None are well known to each other, and even start off with not liking each other's different personalities. As the day goes on it seems like one kid, Bender (Judd Nelson) starts to push the others out of their comfort zones and seeing who they really are. See if they're all more than just a \"criminal\", a \"jock\", a \"princess\", a \"nerd\", and a \"basket case\".\nThis is definitely an 80's film in all aspects, including the acting. I try hard to not judge acting when it comes from the 80's and prior because we just live in a different world now. I will say though, that the acting from this ensemble is equal all throughout, nobody was a true standout good or bad, and that's refreshing to see. I think everybody did a killer job for the decade it was released.\nWhat I like the most about this movie, other than the entire concept of the movie itself, must be how relatable it is. I was in detention a lot as kid and when I was with a group we always messed around and made it more difficult for the teachers because we all thought life was hardest for us. Its how kids are, and this movie expressed that in a way that my generation and even generations to come will still relate to. After re-watching this movie over and over I thought I would notice some things that stand out in a not so good way, but the whole movie has a solid story and was executed smartly. I will say however that the acting is subpar, even for an 80's film. It's not bad by any means, but there are times throughout where it seems like they knew they weren't going to get the right take, so they just kept one they weren't' happy with.\nOverall, I strongly believe that everybody will find something to love with this movie and I strongly recommend it if you haven't seen it. If you haven't seen in it a long time, give it a watch again to remind yourself of how amazing it is.\n4.5/5",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "An amazing classic everyone needs to see",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "Each one of those characters reflect what each one of us was back then.",
            "review_date": "2019-09-07",
            "source": "rt"
        },
        {
            "content": "What an amazing cast. Picked it up on my return from Maine.",
            "review_date": "2019-09-05",
            "source": "rt"
        },
        {
            "content": "My favorite and possibly the best teen movie of all time strong acting and a plot that would seem boring but the 95 minute movie flies by. Must watch ",
            "review_date": "2019-08-29",
            "source": "rt"
        },
        {
            "content": "Easily one of the greatest films ever made. Hilarious, poignant, quotable, unforgettable.",
            "review_date": "2019-08-22",
            "source": "rt"
        },
        {
            "content": "A brilliant depiction of teen life.The best part about it is that it can still resonate with teens today (exhibit a, me).its fun, heart warming, and a great cinematic marvel",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "Love this movie everytime i see it playing on tv i have to stop and watch it",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Jolly,Entertaining,Teenage Problems,Fun movie",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Not the worst movie I have ever watched but definitely not worth the hype.  ",
            "review_date": "2019-06-20",
            "source": "rt"
        },
        {
            "content": "5/10 has aged badly and stereotypically",
            "review_date": "2019-06-15",
            "source": "rt"
        },
        {
            "content": "This is the definitive high school movie for good reason, it's undeniably great. The writing, direction and acting is fantastic and the clever use of some memorable songs helps to cement the film's iconic status. For some people Ferris Bueller's Day Off (1986) is their favorite John Hughes movie but to me this is his magnum opus as he manages to understand the fears and concerns of teenagers with alarming accuracy and writes a film that feels like an entertaining character study instead of an anthropological dissection. As a teenager I feel a special connection to this film that an adult may not feel but in my experience this is a film that can be appreciated by all.\n\nFive teenagers, each from different socials group, attend detention on a Saturday at Shermer High School in Illinois. Claire Standish, Molly Ringwald, is the pretty, popular girl, Allison Reynolds, Ally Sheedy, is the outcast, Andrew Clark, Emilio Estevez, is the jock under immense pressure from his father, Brian Johnson, Anthony Michael Hall, is the depressed nerd and John Bender, Judd Nelson, is the philosophical bad boy who pushes the others to open up to one another. Principal Vernon, Paul Gleeson, is the main antagonist that the teenagers are able to unite against and the friendly janitor Carl Reed, John Kapelos, encourages them to bond.\n\nEach character is immediately introduced as exactly what most people see them as. In just a couple of seconds Hughes shows that Claire is a spoilt brat who usually spends her Saturday elsewhere and Bender is a delinquent with a wild streak. We make these assumptions, which Hughes plays on later, because these introductions are so specific and so identifiable in everyday life that we look at people in our own high schools or workplaces in the same way. I immediately felt myself leaning towards being an Allison but as Claire revealed her backstory I also began to relate to her, much like The Wages of Fear (1953) this film proves that nobody is just anything. Everything about them, from their dialogue to the way they dress feels so right to how we imagine a brain, an athlete, a basket case, a princess and a criminal.\n\nThe idea of teenagers projecting different images to who they really are seems obvious now but films about teenagers before this film don't seem able to articulate this idea in the same way. Yes, we hear about Brian's suicide attempt and the physical abuse that Bender faces in the same scene and one by one they all make their confessions but it is written to feel natural and the teenagers speak with character so you ignore the exposition. Everyone can relate to one of these characters to some degree, I relate to Allison, which makes the film universally engaging and the treatment of them as more than just stereotypes prevents the film from feeling as though it is pandering to a certain audience.\n\nThe final scene of Bender and Claire kissing is one that gives me all of the feels as the combination of \"Don't You Forget About Me\" by Simple Minds playing and the imagery of Claire's earring in Bender's glove is meaningful in a strange way. The idea of two opposites attracting is naturally romantic but Bender taking something from Claire that goes against his tough guy persona so completely shows just how crazy about her he is. The reading of the letter and fist pump after this are also deservedly iconic but almost every section of this film is near perfect in execution. Even the shots of the five of them smoking marijuana in the library feel as though they have been very specifically staged by Hughes to represent the shifting allegiances of the characters. His attention to detail creates these beautiful moments and suggestions of development in these kids who are simply looking for themselves in a world that doesn't support them.\n\nI really love this film and I think I will feel the same way in twenty or thirty years just for different reasons. Despite being 34 years old the film is still more in touch with youths than any of the high school films being released today and it is a wonderful testament to Hughes' ability that he was able to direct a timeless classic.",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "'85  good year  movies, think Blobbo.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Every teenager in every generation should watch this. It's a rite of passage. Love it....",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "Sincere, funny and simple; a must watch.",
            "review_date": "2019-03-29",
            "source": "rt"
        },
        {
            "content": "As a teenage boy of the 80s seeing this movie on opening day, my heart fell on the floor when I saw Molly Ringwald: sweet, cute and sexy. ",
            "review_date": "2019-03-24",
            "source": "rt"
        },
        {
            "content": "This movie is so relatable as I was growing up in the 80s. From bullies to being different. I think it's even relevant now. A a parent now I see what my kids have to go through",
            "review_date": "2019-02-28",
            "source": "rt"
        },
        {
            "content": "I felt this movie had no real story line and no real insight into the actual lives of teenagers. Although the acting was great and I found myself shipping Allison and Andrew as a couple it just wasn't enough to make me fall in love with the movie itself.",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "If John Hughes decided to add a more diverse cast the movie would have had something extra to make it great , with me right now the movie stands as good . However it does offer a lot of diversity in terms of characteristics of each teenagers . I like the total focus on dialogue and close-ups. The movie is contained which gives room for one of the best character development I have seen .",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "âThe Breakfast Clubâ? released in 1985 follows five high schoolers with nothing in common who find themselves spending a Saturday in detention together. The film made me feel nostalgic for the simpler times of high school when the only thing to worry about was othersâ(TM) perceptions. It made me think that we should maybe instill better ideals in our youth to not have their focus be on what âgroupâ? they fit into. This narrative, like a lot of John Hughesâ(TM) films really paved the way for the teen coming of age dramedy. I donâ(TM)t wish that they did anything differently, as the film is such a professional classic. In terms of the writing, my favorite scene was when all five of the kids start whistling with each other. Itâ(TM)s really the first time that the characters start to come together and work together. Directing-wise, I loved everyoneâ(TM)s entrances into the library. The way that the each carry themselves when theyâ(TM)re walking in is so telling of who their characters are but also their relationships with each other and very appropriately sets up the story and dynamic. In regard to editing, I loved when Bender reenacts his idea of what everyoneâ(TM)s home lives are. There are more reaction shots when he describes Brianâ(TM)s home life, but the editor makes the decision to solely stay on him when he is describing his home life. This choice by the editor makes the story that Bender tells and the impact of it more effective. My absolute favorite actor in the film was Ally Sheedyâ(TM)s as Allison. She has so many great facial expressions that I just love and that makes her character so enjoyable to watch. I like when her and Andrew are walking down the hallway to get some water and she stares him down, her hair covering her face. I also enjoyed how she slurps her coke from the table as it spills. Overall, the cinematography was wonderful. To me, the best shots that will always be my favorite are when the gang is running through the hallways trying to avoid the teacher. Theyâ(TM)re all always well-framed in the shot and the color palette is very vibrant and energetic. The sound design is also another incredible aspect of the film. I especially love the opening credits when the iconic âDonâ(TM)t You Forget About Meâ? plays and then the glass shatters to reveal the high school. The production value is impeccable, creating the iconic film that we know and still love today.",
            "review_date": "2019-02-09",
            "source": "rt"
        },
        {
            "content": "A movie about a bunch of whiny teenagers. Next. ",
            "review_date": "2019-02-08",
            "source": "rt"
        },
        {
            "content": "A sweet but realistic look at the lives of five teenagers, obviously representing all teenagers, though a plot device that would lend itself perfectly to a stage play and allows for an almost total focus on dialogue and close-ups.  Certainly a bit hokey at times, particularly the treatment of the teacher and the parents, but still a very good film.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "A diverse group finds common ground during detention.  A good movie.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "I have watched this movie more times through my adolescence and it still resonates with its theme of finding commonality even in our differences",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "This movie was and is so important to the children of the 80's. John Hughes was spot on with relating to generation x. This is one of the best written and acted movies of that time. Brilliant. \nA naked blond walks into a bar.....",
            "review_date": "2019-02-03",
            "source": "rt"
        },
        {
            "content": "A perfect mix of comedy and serious issues, the movie is driven by its really strong leads and is deserving of its status as a classic.",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "I really canâ(TM)t see what the buzz about this film is Iâ(TM)ve wanted to watch if for a long time after lots of references in films and tv shows Iâ(TM)ve seen. It appeared to be an iconic film so tonight we finally sat and watched it I was ready to give in after 30 minutes but persevered and I assumed something wonderful would happen at some point to make me love it well Iâ(TM)m still awaiting that moment and the film ended 10 minutes ago",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "A wildly inventive mix of comedy,drama and fun. the breakfast club is possibly the height of teen films of all time.",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "1/14/2019\nAside from St. Elmo's Fire and Pretty In Pink, this formed the triumvirate of the must-watch teen flick from the 80's. And like the other older films I've watched recently, this is my first time to see this. This was a slow brew but kinda picked up towards the end. Each of the leads had their own unique charm, which is definitely the reason why many people look back to this decade and have this film as a must-see.",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "This is so deep and so relatable. Its crazy !",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "Brilliant movie! Reminds me of my high school years. ",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "amazing. used to be my favorite movie until i saw infinity war.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "this movie was so amazing at showing teens true feelings. it makes you realize that teens go through a lot of stuff that they just keep in and donâ(TM)t do anything about. i had never seen this movie tulle now and i only heard good things about it. now i understand why",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "Pretty cute, I love the 80’s and Molly Ringwald is the cutest ",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "One of the best teen movies coming of age films, and one of the best 80s films, the Breakfast Club digs deep into a life of an american teen's hard life",
            "review_date": "2018-12-11",
            "source": "rt"
        },
        {
            "content": "A comedic, fun, and surprisingly heartfelt time at the movies \"The Breakfast Club\" proves itself to be a well written film powered by great performances. This movie is definitely worth a watch.",
            "review_date": "2018-12-01",
            "source": "rt"
        },
        {
            "content": "Heard of this movie before, but I only just caught it on TV. Boring. Why is this considered a classic? So freakin' dull.",
            "review_date": "2018-11-30",
            "source": "rt"
        },
        {
            "content": "A classic with very real characters anyone can sympathize with.",
            "review_date": "2018-11-22",
            "source": "rt"
        },
        {
            "content": "This movie is the scum of the earth .The only reason that audience like it sooo much is because itï¿ 1/2(TM)s totally pushed down our throats as one of the best movies of all time.\nPS I would still totally fuck Anthony Micheal Hall",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "Truly one of the most boring movies I have even seen in my entire life. The entire movie takes place in almost one room and the characters themselves are just boring. The acting is decent, but other than that you’ll mostly spend your time checking to see how much time is left during this awful movie. I suffered through this movie twice. Once just to say I have seen it, and the second time it was required for a college class. Each time was unpleasant. I do not understand the hype of the movie. It is not good. At all. ",
            "review_date": "2018-11-15",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a classic that makes all John Hudges fans feel proud for their incredible work, plus their well-crafted character and their plot unlike any other 1980s teen movie their casting for the characters was perfect.",
            "review_date": "2018-11-07",
            "source": "rt"
        },
        {
            "content": "This film was great!",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "This personally is my fav movie of all time. Mostly though that is from the fact that it's very similar to how my friend group met (though not in detention we were good students!) with a bunch of different people in different cliques. The camaraderie that the group gains is so inspiring, maybe in the future we could get a remake that would actually be good?",
            "review_date": "2018-11-05",
            "source": "rt"
        },
        {
            "content": "Strengths: Nearly everything about this movie works. The cast all give great performances and click with each other to deliver strong scenes. Judd Nelson (John Bender) is mostly good, though he's a bit over the top. Anthony Michael Hall (Brian Johnson) might be the standout, while Emilio Estevez (Andy Clark), Molly Ringwald (Claire Standish), and Ally Sheedy (Allison Reynolds) all deliver. There are plenty of great scenes. The scene where they all sit around and reveal major things about their lives is outstanding. Each character delivers some kind of truth and all are handled with care. It's emotion that works. Hall is amazing here, discussing bringing a gun to school and how hurt he was at the idea that nobody would act like his friend after this day. Following it with the famous dance scene was perfect, as these characters had now gone through something that bonded them. The script allows for these characters to tell stories that help them grow by the end, while the dialogue all feels natural. Lastly, the film's soundtrack is legendary. Not only are the songs great, but they're fitting of the tone and era. \n\nWeaknesses: It's clear that many of these characters are incredibly stereotypical. I would've liked if some people played against type. A female jock or nerd. Something like that. It's a small issue, though. The real problem is the relationships. While Claire and John feel like they have a bond throughout the movie, the Andy/Allison stuff feels so forced. They only share one real scene with any kind of bond. If that wasn't enough, when they do get together, it only comes after Allison changes her appearance. She shouldn't have needed to do that, as her being weird and different is what worked for her. \n\nOverall: One of the greatest teen movies of all time. With a great cast, insightful script, killer soundtrack, and lots of emotion, it hits nearly every beat it needs to.",
            "review_date": "2018-10-28",
            "source": "rt"
        },
        {
            "content": "Relatable characters are what make this one of the stand out movies from the 80's",
            "review_date": "2018-10-22",
            "source": "rt"
        },
        {
            "content": "A classic coming-of-age film!",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "Hughes manages to turn the simple into the extraordinary, telling a film that echoes throughout the decades and shows us that appearances may be deceiving, and everything is a little bit more than what it seems.",
            "review_date": "2018-10-04",
            "source": "rt"
        },
        {
            "content": "While John Hughes has other films that I think are better, The Breakfast Club might be the most purely distilled essence of his style in the 1980s. He takes all the high school stereotypes and locks them in a room together in order to force interaction, revelation, and an exploration of teen behavior. Of course, by extension, he’s also trying to say something about all of us no matter the age through these teenagers. I always find it uncomfortable to watch at the start, because I knew a number of John Bender’s in my life and seeing him act so abusive and intimidating to the other kids reminds me of bullying I received. (Just for the record, I was a Brian Johnson with a little Allison Reynolds thrown in, so my high school life is not something I look back on with fond memories.) I find it remarkable how this movie sums up exactly why that time in my life was so miserable because it shows that we have this tendency at that age to divide ourselves, fight or just shun those who don’t fit in with us, and feel endless pressure in our home lives to always be better. When the walls start to break down between the characters in The Breakfast Club is when the film transcends a typical high school drama. For one thing, these kids act realistic as I would imagine actual teenagers would in a similar situation. They let their guards down slowly, and seem leery about appearing vulnerable. It takes time for them to reach the point of breakthrough, but it’s at that moment we finally see these characters for who they really are instead of who they pretend to be. The amount of breakthrough that comes from a single day spent in a room together is probably a little exaggerated, because this feels like enough drama that it could have taken months to reach this point, but for the sake of making a good movie I’m willing to accept the sped up timeline. The movie delivers a nice balance of heartfelt drama that can bring you to tears and comedy that can make you laugh out loud, and it can make the turn from one to the other on a dime. The acting performances are all wonderful, and I am impressed with the perfect casting of each role. The part I always struggle with when I watch The Breakfast Club is that it doesn’t feel like we can rely on any resolution or change. While the characters appear to have made some type of cathartic journey over the course of the film, there’s no evidence that they will change for the long term. Nothing is done to refute the chilling truth that Claire delivered when she talked about the return to normal life on Monday morning. The pseudo-relationships that are formed don’t seem strong enough, or grounded in anything that will last. Perhaps there will be a fling between Claire and John, but it doesn’t seem viable for the long-term. That being said, I still have to commend The Breakfast Club for how it presents a perfect microcosm of high school life. Even though the events seem far-fetched at times, the emotions and themes are authentic. I love the film for how it makes me feel and the hope it gives me, because in general all people can form these bonds if they let down their guard and accept that deep inside we are all the same no matter how we look or act.",
            "review_date": "2018-10-02",
            "source": "rt"
        },
        {
            "content": "Hughes manages to turn the simple into the extraordinary, telling a film that echoes throughout the decades and shows us that appearances may be deceiving, and everything is a little bit more than what it seems.",
            "review_date": "2018-09-30",
            "source": "rt"
        },
        {
            "content": "Rarely have I heard so much about a classic, and not have been disappointed by my viewing. This movie lives up to its renowned status, and has character that is still all-too relative to this very day.",
            "review_date": "2018-09-26",
            "source": "rt"
        },
        {
            "content": "GOD  i wish detention had been like this lol",
            "review_date": "2018-09-25",
            "source": "rt"
        },
        {
            "content": "This movie is a fun look into the mindset of 1980s teenagers, however, the story lacks true character development. When looking at the ending the relationships seem forced and almost unnatural leaving the audience to believe that they won't last. Though this was a tough criticism I did enjoy the movie.",
            "review_date": "2018-09-21",
            "source": "rt"
        },
        {
            "content": "I see fellow criticts referring negatively at the the fact that this movie is set in pretty much one room, this is not a problem this is a credit to the film; and I have to applaud the director for keeping is audience thoroughly engaged for 97 minute run time with this single set. It dosent rely on over stimulating action and multi million dollar set pieces. It is the purist form of social reflection and crafted dialogue, this movie is brilliant. Admittedly there are some minimal pacing isses, however the ideologies reflected through the distinct cast of characters and watching the characters develop after the first act of the movie and experiencing  these unforgettable characters  not only accept each other but actually embrace and absorb each other's differences is why this movie is a colt classic.",
            "review_date": "2018-09-21",
            "source": "rt"
        },
        {
            "content": "I feel this film is showing its age. The stereotypes are so obvious - the brash kid from the abusive background who fights all the way through with rich girl only for them to get it together at the end; the freaky girl who gets a make-over and decides she is beautiful before getting off with the athletic one; and finally the geek who is too brainy to be attractive but easily persuaded to do the hard work for the other kids. Once was enough.",
            "review_date": "2018-09-16",
            "source": "rt"
        },
        {
            "content": "i have watched this movie about 100 times and its amazing",
            "review_date": "2018-09-08",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nResultará encantador para los fans del cine independiente, y si bien hasta cierto punto funciona, resulta algo pobre y un tanto incongruente.",
            "review_date": "2018-09-06",
            "source": "rt"
        },
        {
            "content": "Can be considered a very natural to have a nostalgic feeling when a movie you enjoyed in high school is released on the DVD/Blu-ray is a 20th-anniversary edition. However, when the film is one that your soul with your wife after getting her parents to babysit your one-year-old child is marketed as '30th-anniversary collector's edition', that goes beyond nostalgia and firmly into the realm of making your old. The film that incited these feelings was a milestone opus filmmaker, John Hughes, his 1985 masterpiece, 'The Breakfast Club.' This was a movie that was targeted to a very specific program, the 'X Generation.' Generational demarcations are germane to understanding the impact of this film, the X Generation, individuals born after my generation, 'The Baby Boomers,' before the Generation We Would Give Birth to, Really Known As the 'Y Generation.' Under normal circumstances, precise attention to the birth year audience members would be closed insignificant but in this particular case is a significant part of why this film has become such a lasting example of cinematic history. John Hughes was one of the most influential directors of his time. Fans almost universally accept it, critics and film historians, that Hughes played a major part in defining both the decade and the generation growing up within it.\n\nThe style embraced by John Hughes as a director dominated the filmmakers of his day. As a screenwriter's subject matter, predominantly exploring themes growing up in the 80s, but one of his most lasting contributions is introducing the group of young actors would become the A-list stars in the coming years. Our parents, the ones that fought in World War II garnering the name 'The Greatest Generation,' where entertained by a group of singers, comedians, and actors collectively known as 'The Rat Pack.' Envied by many men for their freewheeling, excessive lifestyle in such places as Las Vegas, the group included such legendary performance as; Frank Sinatra, Sammy Davis Jr., and Dean Martin. John Hughes introduced younger, contemporary personalities that would widely become known as 'The Brat Pack.' Instead of converging on Las Vegas these twentysomething stars would frequent the latest venue for excessive libations; the nightclubs of New York City and Los Angeles. A roster of the Rat Pack, for the most part, comprise the principal list actors in this movie; Emilio Estevez, Judd Nelson, Molly Ringwald, Anthony Michael Hall and Ally Sheedy. Not only would they be frequently found several other high school/teen angst films by John Hughes, but they would go on to drive ticket sales are just appearing in the film.\n\nJohn Hughes was able to touch his audience by making a substantial emotional connection with readily identifiable characters. He also set his stories against the background of familiar events common to most teenagers such as a sweet 16 party, or in the case of this film preschool detention. Okay, I have to confess that in high school I was very much a by the books kind of student never received detention, I understood the concept and its purpose. Intended by the faculty to punish and perhaps shame one sentence to the attention, to those most likely to receive it on a regular basis it was little more than a place to raise the now or to time. The core of this film is that it offers an opportunity for the filmmaker to bring together an exceptionally divergent group of students together in one place sharing the same experience. This was considered a major departure from the high school movies that proceeded, and a large number of those that would follow. Teenagers in high school are inevitably depicted as being defined by the clique that they belong as they share a Saturday sentence confined to the library and the punishment known as' The Breakfast Club.' The progression of the story is how the boundaries of the individual cliques began to dissolve, and reform is something new.\n\nJohn Hughes managed to the major cliques familiar to any high school movie. Andy Clark (Emilio Estevez) is the high school jock, a state champion wrestler. Brian Ralph Johnson (Anthony Michael Hall) is the 'A' student with Claire Standish (Molly Ringwald) is the pampered princess of the class. Rounding off the roster of detainees on the darker side of the group; John Bender (Judd Nelson) as a delinquent and Allison Reynolds (Ally Sheedy) providing the emotionally and psychologically damaged girl. Normally in charge of them as the designated adult supervision is the assistant principal Dick Vernon (Paul Gleason), who has the diluted perception that his authority bears the kids, \"you mess with the bull, you get the horns.\" The only other adult that wanders in and out of the story is the school janitor, Carl Reed (John Kapelos). As Mr. Vernon explains to them, their punishment includes the following provisions. They are to remain in your seats without speaking or sleeping until 4 PM, almost 9 hours already. During that time they are to write a 1000 word essay on 'what do you think you are.' All the students in the group Vernon have had the most contact with Bender as a frequent offender in common fixture in detention. There is a great amount of animosity pre-existing between the two and Bender has absolutely no respect Vernon either as an authority figure or human being.\n\nIt should come as no surprise that ordering a group of teenagers sit quietly in the seats almost 9 hours while composing an essay is not something that is likely to be obeyed. Predictably it is Bender instigates the rule breaking that will persist with the entire course of this sentence and the film. The rebellious young man begins to pick fights with his fellow 'inmates.' Considering the diversity among the group members and Bender's predilection for stirring up trouble, it doesn't take long before the 'sitting rule quietly' is not even a memory. In a strange but very believable way, the confinement quickly erodes the boundaries between each of the students and their innermost secrets begin to bubble to the surface. A clue as to why the acts out in such a way could be limited to the fact he comes from a very abusive home life. Allison is a compulsive liar, and Claire is a virgin was taunted and pressured by her friends. They also discover that there is a major bond between that is far stronger than the superficial definitions of their cliques; they all have exceptionally strained relationships with their parents.\n\nThere are so many ways that the success of a movie can be gauged. The most important thing for the studio has always been the Box office revenue. The executives focused on how great the return on the budgeted investment.Considering the film had an estimated budget of $1 million in a gross over $45 million studio executives are ecstatic the film received critical acclaim although it was largely overlooked during the award season not receiving the industry accolades mostly controlled by the previous generation. The genius of this storm is held well spoke to generation X, but it did so with such intrinsic truth that even now over 30 years later it is easily relatable to those watching. I school will always be a time cliques, pairing us for life as adults are the only thing that changes the parameters of the cliques and the repercussions for inclusion and exclusion. John Hughes was able to tap into the complex emotional state of teenagers in such a fashion that many felt his movie spoke directly to them. The themes of alienation and constantly being misunderstood by other teenagers and the adults proves that teen angst is not something that belongs to one specific generation but that it is a persistence quality of the human condition. Perhaps the most important lesson to be learned from this film is one that also transcends the age of the viewer; cliques are based on the most superficial criteria. Once you make an effort to get to know a person on a deeper level discover there are far aspects of common than differences. There's been another great release of this film but the special edition those include some extras that go to great lengths to elucidate what serves the foundation for this movie. The matter which generation you happen to call your own, this is a fitting film add to your collection and periodically revisit.\n\nFinally, this film has achieved another means to recognize the substantial contribution to the zeitgeist of a generation lasting effects on filmmaker techniques going forward. The 'Breakfast Club' is the latest in a continuing effort undertaken by the Criterion Collection to preserve significant examples of cinema as a means of artistic expression. The mandate of Criterion has always been the preservation of the filmmaker's artistic vision by presenting their work as closely as possible to the theatrical premiere. When they further select a title to be remaster the movie to high definition the details of the video take on such a new life that the nuances previously missed can be ascertained to the betterment your understanding and appreciation of their work.\nbullet\tAudio commentary from 2015 featuring actors Anthony Michael Hall and Judd Nelson\nbullet\tNew interviews with actors Molly Ringwald and Ally Sheedy\nbullet\tNew video essay featuring director John Hughes s production notes, read by Nelson\nbullet\tDocumentary from 2015 featuring interviews with cast and crew\nbullet\t50 minutes of never-before-seen deleted and extended scenes\nbullet\tRare promotional and archival interviews and footage\nbullet\tExcerpts from a 1985 American Film Institute seminar with Hughes\nbullet\t1999 radio interview with Hughes\nbullet\tSegment from a 1995 episode of NBC's Today show featuring the film's cast\nbullet\tAudio interview with Molly Ringwald from a 2014 episode of This American Life\nbullet\tPLUS: An essay by critic David Kamp",
            "review_date": "2018-09-04",
            "source": "rt"
        },
        {
            "content": "\"The Breakfast Club\" is a great coming of age movie. You can find a great number of teenage high school movies with the repeating roles of bullies, popular kids, nerds, etc. \"The Breakfast Club\" picks those stereotypes and offers a deeper, personal view of the person behind it. The movie has a great character development and is very refreshing and easy to watch.",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "This movie was so hard to sit through, and I didn't even end up finishing it. Bender is a crazy, annoying, disgusting character that constantly is harassing Molly ringwalds character. Ally's character is mental and never speaks. Andrew goes from a \"good kid\" to smoking weed and complaining about how his dad is so hard on him to be a great athlete that he beats up a kid??? The movie had no point and nothing really happens for the whole first hour and a half. This movie sucked and I don't understand why so many people love this movie",
            "review_date": "2018-08-18",
            "source": "rt"
        },
        {
            "content": "Good movie. Predictable at times. A little overhyped but still iconic.",
            "review_date": "2018-08-15",
            "source": "rt"
        },
        {
            "content": "This movie is the best teenage movie ever, i dont know if it will ever bE outdated as it fits into every schools social system, this is truly a classic",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "The breakfast club es la manera simple de establecer personajes en el cine, y  esto lo hacer logra superar a su básico guion y construirlo como un gran clásico, y es que cada dialogo es tan real que en verdad logra trasmitir ese conflicto de aceptación adolescente en la escuela.",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "OMG, i didn't expect that this will be my favorite film, has so many nice moments and characters completly real",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "Could you describe the ruckus? Easily one of the BEST films ever made.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a 1985 American comedy-drama film written, produced, and directed by John Hughes. \n1001",
            "review_date": "2018-06-12",
            "source": "rt"
        },
        {
            "content": "This movie is boring and I did not care for a single character.\n\nPeople say this movie is relatable? That is a lie!",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "Interessante desenvolvimento para no final eles brigarem por coisas idiotas de novo. Uau, eles simplesmente não evoluem.",
            "review_date": "2018-05-26",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club \nBy:John Hughes\n\n\tAlthough it may be an older movie the ideas and views expressed in the movie are still relatable to most high school students and also to older viewers wanting to relate to their childhoods. To modern day high school students the culture and the things that were popular in the movie may be very different than what they might be interested in. The characters were very unique in their own way.Although they had very basic descriptions of the characters at the beginning of the movie throughout the development of the story and the progression of the movie you start to see that the characters are all much more than their basic descriptions given by the administrator in charge of the detention they are all attending. At the beginning of the movie it starts off with the parents talking to the kids and it gives another perspective and it also gives the characters backgrounds. The problems with their parents shows up later in the story when they are all talking. They figure out that although they may be labelled differently they are all still the same on the inside and are in some of the same problems. Also the problems they are having they can help each other through them. The acting throughout the movie was well done and even though they are teenagers all of the actors were very talented. I love the way in this movie the soundtrack told a story and it also added to the plot, the fades in and out of the music covering up John Bender screaming at Mr.Vernon was a beautiful touch. Everyone in this movie and on the movies crew did an amazing job, i would recommend this movie to anyone and everyone.",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "If you are a son of the 80s, don't you, forget about this movie.",
            "review_date": "2018-04-30",
            "source": "rt"
        },
        {
            "content": "just you and me..\n\nThe Breakfast Club\n\nAs much as powerful the screenplay is, John Hughes's attempt to install cheesy and petty inputs in characters to attract younger audience wears down the intensity and gravitas that it had created that easily would have helped it enter the major league. His directorial work is appreciative but deserved a better supervision compared to its script. The performance wasn't up to the mark which is the only thing that itches one down the throat in this old classic. The Breakfast Club is a typical teenage movie retold in the most intriguing way that it is almost impossible not to invest in it and be moved by it (no matter how much familiar their tales may sound but the impact doesn't grow shallow at all).",
            "review_date": "2018-04-24",
            "source": "rt"
        },
        {
            "content": "This movie is a true cult classic some people will like it, some will love it, and some will hate it. I found the film really funny and great how serious the band is even with the jokes going on I like the film though I didn't love it. It's still better than 90% of the crap out there. You can't go into a film like this expecting The Dark Knight Rises this film is to be looked at scene by scene and you need to notice the little things to get all the humor. The film has been rated as one of the funniest films of all time so it's definitely worth a watch.",
            "review_date": "2018-04-22",
            "source": "rt"
        },
        {
            "content": "a film to watch when your a teenager",
            "review_date": "2018-04-14",
            "source": "rt"
        },
        {
            "content": "This might be my favorite movie of all time, all the actors and actresses do a fantastic job. It’s funny, sad, and just overall great.",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "best friggin movie ever!",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "A very entertaining and fun movie",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorite movies, and the best of the John Hughes movies (which is saying a lot). I love how it shows that even though they don't all get along, they standup for, cover for and defend each other vs the \"adult/teacher/authority.\" They're quite aware of what they're going through.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "It’s rare to find such a perfect movie, that so accurately depicts teen angst. Brilliant screenplay, but what sold it was the amazing cast and sheer acting mastery. ",
            "review_date": "2018-03-11",
            "source": "rt"
        },
        {
            "content": "A strong, formulaic film that's a great example for feel-good movies.\n\nTrapped in a day-long Saturday detention in a prison-like school library are Claire, the princess (Molly Ringwald); Andrew, the jock (Emilio Estevez); John, the criminal (Judd Nelson); Brian, the brain (Anthony Michael Hall); and Allison, the basket case (Ally Sheedy). These five strangers begin the day with nothing in common, each bound to his/her place in the high school caste system. Yet the students bond together when faced with the villainous principal (Paul Gleason), and they realize that they have more in common than they may think, including a contempt for adult society.\n\n\"The Breakfast Club\" is one of the most iconic films ever? Why haven't you watched it yet, Chris? Why not? My friends always ask me this. I'll answer with the fact that you don't need to see every \"renowned classic\" in order to be smart about films. In fact, since this film, it has been done a thousand times over. It's nothing special, but if you look back to what this film originally was, it's still executed great, and is surely one of the better films of its decade.\n\nYou got nothing different here. You have the jock, the queen, the nerd, the emo, and the outcast. You have every essential stereotype packed into one room and that's not different. The different is the small things in this film and the writing. The characters themselves are pretty self-explanatory and while they're not special, they're still written well. The characters have great dialogue and they certainly give solid performances. \n\nThe best thing about this film is the screenplay. It's a very well written screenplay with so much small jokes and great lines of dialogue. It's well crafted and I think it's really the core of this film. It'd be nothing without the small and minute details that makes it what it is. The film is simple but deep down, it's more complex. I think the screenplay was in the hands of the right person and it certainly was well structured. \n\nIn the end, \"The Breakfast Club\" still holds up well today. As someone who wasn't born in the 80s, I can't speak for this film and its impact back then. All I can do is compare to media today and it holds up pretty decently.",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "There are very few movies that get the high school experience right and thanks to the all star cast, John Hughes' direction, and memorable characters, The Breakfast Club is one of them.",
            "review_date": "2018-02-18",
            "source": "rt"
        },
        {
            "content": "Labeled as “one of the greats” this movie manages to be set in one room and still be entertaining.",
            "review_date": "2018-02-18",
            "source": "rt"
        },
        {
            "content": "An all time classic!  Never gets old.",
            "review_date": "2018-01-31",
            "source": "rt"
        },
        {
            "content": "the breakfast club is every teenagers brain",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Brain\nAthlete\nBasket case\nPrincess\nCriminal\n\nSo nostalgic n don't you forget about me",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "I don't know why but it's one of ma fav's hehe",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time!  The simplicity of the story mixed with the complexity of the characters were perfect in making this a strong film with a lesson everyone should learn.  We are all different but underneath all the same.  We all yearn for love, acceptance, and understanding.",
            "review_date": "2017-12-21",
            "source": "rt"
        },
        {
            "content": "Now I understand everyone's infatuation with this movie.",
            "review_date": "2017-11-28",
            "source": "rt"
        },
        {
            "content": "I just didn't get it. I think where films have used this as s template in future films it felt like I'd seen this done elsewhere. I didn't really like where nothing really happened and didn't really get what made the characters bond.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Teen angst at its best. Defines the 80's teenager which was me at 16. I was mostly like Allison the basket case.The last scenes are really melodramatic and over the top sentimental. One of my all time favorites.",
            "review_date": "2017-10-14",
            "source": "rt"
        },
        {
            "content": "File this one under the already scant list of movies that I'm shocked I didn't love. Now, don't get me wrong; I don't dislike it. It's just that there's something a little slapdash and thrown-together about the structure here. Something almost piecemeal about the central line of action (or lack thereof, rather) that really made me buy the fact that Hughes wrote this in such a short period of time. The matrix of character relationships, however, is what makes this movie really sail by, and the respective performances from Nelson, Ringwald, Hall, Estevez, and Sheedy all really do help in the end. Again, not a movie that I didn't like, just one that I feel hype may have ultimately undercut for me overall.",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "My favourite movie, good script and perfomances, a score that is just beoutifully envolved, and obviously the school movie cliché we all love to see, the story of diferent types of guys that can make a weird but grat team.",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "A timeless classic that anyone who's ever been to high school can relate to.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club has a fantastic cast and is one of John Hughe's best films. The Breakfast Club is not at all I thought it was going to be. It shows that people outside of your friends circle are not so much different after all. This is a must see film for all ages.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "Wonderful, memorable film. I feel watching this is a right of passage to \"growing up\"",
            "review_date": "2017-08-23",
            "source": "rt"
        },
        {
            "content": "A great movie about the way teens look at authority and how people from different social groups can really connect and find out they are not really different after all.",
            "review_date": "2017-08-17",
            "source": "rt"
        },
        {
            "content": "A quintessential coming of age movie from the 1980s, The Breakfast Club broke ground and created a genre that has often been mimicked but seldom been done better. It follows the exploits of an unlikely group of high school students who have been put into a detention one Saturday morning. The 5 pupils are stereotypes (the geek, the prom queen, the rebel, the jock and the emo) and wouldn't normally have anything to do with each other. Here, however, they are forced to spend time together, work out their differences and forge friendships. Masterfully directed by John Hughes this is the \"Go To\" film of the the era. I was surprised on a recent rewatching just how little music there was. My memory had the movie jam-packed with hits from the time. Still, the Simple Minds theme tune is a classic and just helps the memories, of those of us of a certain age, come flooding back. Definitely something of a time capsule, if you've never seen it, it's a movie worth seeking out. The only aspect that is today a little cringe making is the last few scenes where the group couples-up and Ally Sheedy's \"alternative\" character gets the all American makeover courtesy of Molly Ringwold's bobby socks character, Claire. This was a movie that defined and reflected a generation and is still good today.",
            "review_date": "2017-07-31",
            "source": "rt"
        },
        {
            "content": "Although almost all of the characters are archetypes aimed at advancing the narrative, The Breakfast Club nonetheless features some committed performances, an appropriately memorable soundtrack, and some legitimate, accurate insight into the adolescent experience.",
            "review_date": "2017-07-30",
            "source": "rt"
        },
        {
            "content": "If you're going to have a film about a captive characters least make the interactions interesting",
            "review_date": "2017-07-26",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club (1985) is about 5 high school students from different cliques who create a camaraderie while trapped in weekend detention. Thanks to fantastic young stars & a great script providing insight into the teenage brain; everything about The Breakfast Club is so real. Unlike most teen films, there's also nothing cloying about The Breakfast Club. It's commendably sincere as well as funny; it has integrity. The Breakfast Club is an intelligent film with insightful statements to make on the issues that continue to be so important for teens today. The Breakfast Club stands out as a teen film with something intelligent to say. It's an examination of teenage angst and social pressure. The Breakfast Club's simple and understated filmmaking allows the enthusiastic cast delivering the excellent script to carry the film along. It really worked; The Breakfast Club is, indisputably, one of the best teen films ever made.",
            "review_date": "2017-07-20",
            "source": "rt"
        },
        {
            "content": "One of the best 80's movie I've seen, amazing story line and amazing actors, love Judd Nelson's character, bender.",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "Great american classic about teenagers at that time. Worth watching.",
            "review_date": "2017-07-13",
            "source": "rt"
        },
        {
            "content": "This movie makes me wish I was a teenager in the 80s. It's so funny and so awesome. One of the greatest movies of all time, insanely hilarious!",
            "review_date": "2017-06-17",
            "source": "rt"
        },
        {
            "content": "One of the best 80s teen coming of age films. The cast is amazing. Its super fun and it has a great soundtrack. Its a definite classic. An awesome watch.\n\n\nRating: 10/10",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "Smart and time breaking, \"The Breakfeats Club\" is one of the best movies I´ve ever seen. Even being from the 80´s the movie have a contemporaneous theme that is stereotypes, and it´s about breaking them. Not just to see, but to also think.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "Definitely a classic tale of teenage struggles. Amazing to watch with friends and after watching it once, you'll want to watch it 100 more times!",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "Simply amazingly good",
            "review_date": "2017-05-08",
            "source": "rt"
        },
        {
            "content": "Has a better screenplay about teenagers even been written?\n\nThe answer is a big no. This is a masterpiece.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "Puts you in the shoes of the characters and makes you remember vividly being a teenager in high school.",
            "review_date": "2017-04-27",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is my favorite movie of all time. It perfectly casts a group of relatable teens and takes a deep look inside. I despise the thought of Hollywood remaking it.",
            "review_date": "2017-04-23",
            "source": "rt"
        },
        {
            "content": "the premise is very simple: 5 teenagers have to spend their saturday together in detention, and basically nothing really extraordinay or a big twist happens, but the way the movie is crafted, the way the relationship between these very different characters grow up, it´s simply marvelous. \na must watch for every teenager.",
            "review_date": "2017-04-12",
            "source": "rt"
        },
        {
            "content": "The best of the \"Brat Pack\" films. Still relevant to this day. Absolutely timeless.\n\nPerfect scripting and casting.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "Yea it's teenage movie that has its cheesy moments but I thoroughly enjoyed the Breakfast Club as it has some great humor and heart to it. This film was able to take all these characters and give them a sense of personality that is memorable, and yes the characters are suppose to represent the tropes and stereotypes of the categorized teenagers, but The Breakfast Club took those tropes and actually did something with them that delivers an entertaining but meaningful coming of age film.",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "One of the best high school movies of all time starring Molly ringwald, Anthony Michael hall, Emilio estevez, and two other people that I have no clue what their names are. This movie is one of the greats or to be called a timeless classic. And the ending is without a doubt when the guy who acts bad goes on the football field and raises his hand up, that's iconic. Even with that song the don't you forget about me song is just awesome. The arm raise is the thing that inspired a whole generation of people and effected them in the greatest way a movie can affect someone by a single gesture. I watched this movie again because of the Goldberg's, a 80s tv show and it had a huge impact on the kid Adam F Goldberg. The actors feel real and just everything in this movie is iconic. But one question, why the fudge is this movie rated r, their is noting wrong with it.",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "An enjoyable film following five lovable characters overcoming each other differences in detention and becoming friends while addressing important real world problems.",
            "review_date": "2017-03-04",
            "source": "rt"
        },
        {
            "content": "Very good movie, both likeable and dickhead characters",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "One of my very favorites.",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "Very funny and cool story about different high school clicks bonding.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "An 80s teen classic. \n\nA great blend of comedy & drama.\n\nI fell a little bit in love with Ally Sheedy's crazy character in this. \n\n[8/10]",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "A timely classic that will surely appeal to many teens from different generations, The Breakfast Club relays the old, recurring problems that everyday adolescents face, be it at their own homes or schools.",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "The setting may be stationary and there might not be that much going on in terms of action, but the characters and their backstories are so engaging that they completely save the movie from being a bore in the slightest.",
            "review_date": "2016-12-25",
            "source": "rt"
        },
        {
            "content": "My favorite teen comedy ever. It isn't very suprising that it is loved by many.Estevez, Hall, Nelson, and Ringwald do great. A funny, sweet, and well written teen classic.",
            "review_date": "2016-12-18",
            "source": "rt"
        },
        {
            "content": "very good film I enjoyed the film",
            "review_date": "2016-12-01",
            "source": "rt"
        },
        {
            "content": "I won't forget about this movie.",
            "review_date": "2016-11-11",
            "source": "rt"
        },
        {
            "content": "The movie is great and tells you can't judge every person who they are by making your own assumes.",
            "review_date": "2016-10-13",
            "source": "rt"
        },
        {
            "content": "Easily earns its rightful place as an 80's classic.",
            "review_date": "2016-10-06",
            "source": "rt"
        },
        {
            "content": "Would've been fine if Judd Nelson's character weren't in the movie at all, but it's overall a charm to watch a small film with a big voice, and the performances are excellent.",
            "review_date": "2016-09-12",
            "source": "rt"
        },
        {
            "content": "I really wanted to like this movie. But I can't get over the fact that the only reason why they got all friendly, is because they were high on marijuana.",
            "review_date": "2016-09-09",
            "source": "rt"
        },
        {
            "content": "Never get tired of watching this great movie!",
            "review_date": "2016-08-31",
            "source": "rt"
        },
        {
            "content": "Hugely popular, but really hasn't aged that well compared to other 80s teen movies like Fast Times at Ridgemont High and Ferris Bueller's Day Off. The characters are thin stereotypes and the the limited character development feels forced. Still, there are some decent performances and one or two funny moments.",
            "review_date": "2016-08-22",
            "source": "rt"
        },
        {
            "content": "Bratty suburban white kids spend a Saturday in detention together whining about their miserable lives. We get the basic teen comedy characters. Estevez stars as a jock, Ringwald is the princess, Nelson as the school bully, Sheedy as the freak and let's not forget to top it off with a good nerd played here by Anthony Michael Hall. Look, I get that many consider this movie a classic but seriously let's not confuse classic with blockbuster. This movie became huge in 1985 but if you look at this movie from a critical standpoint, it's nothing exciting. It's really about nothing. Sorry but with characters so whiny and self indulged, I'd never want to spend a day with them, detention or otherwise.",
            "review_date": "2016-08-20",
            "source": "rt"
        },
        {
            "content": "Very relatable and engaging story. The dialogue is clever and insightful, the acting is believable, and the movie manages to do a whole lot despite being set in a library the entire time.",
            "review_date": "2016-08-19",
            "source": "rt"
        },
        {
            "content": "This movie rocks detention!",
            "review_date": "2016-08-19",
            "source": "rt"
        },
        {
            "content": "this is my fav movie of all time \nit is really good\ndo not let ur young children watch this movie",
            "review_date": "2016-08-17",
            "source": "rt"
        },
        {
            "content": "a group of people that get to know eache other",
            "review_date": "2016-08-16",
            "source": "rt"
        },
        {
            "content": "John Hughes trouxe um ar divertido e,ao mesmo tempo dramático,The Breakfast Club junta um roteiro eficiente e sensacional a atuações fantásticas.",
            "review_date": "2016-08-15",
            "source": "rt"
        },
        {
            "content": "Rich suburban teens sit in detention on a Saturday, griping and complaining about their fears and well, coddled suburban lives.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "A great high school movie that is probably the most insightful story I've ever seen on teenage life.  One of the greatest scripts of the 1980's.",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "This movie truly depicts the life of a highschooler in an amazing story full of pop references and aesthetic. The plot may seem uninteresting a dull but once you start this fantastic film you will keep watching not wanting it to end. In my opinion it could be one of the best teen films ever made.",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "A teen classic. I'd strongly advise that anybody who hasn't seen this, does.",
            "review_date": "2016-07-16",
            "source": "rt"
        },
        {
            "content": "The most timeless film of the Hughes / Ringwald / Brat Pack era, and clearly the most serious, personal work of the director's career. The Breakfast Club is an up-close, introspective look at five essentially disparate souls who share one cramped Saturday together in detention and, along the way, discover there's much more to their peers than what they wear and who they hang with. Reminiscent of theater, much like the closed-room classic 12 Angry Men, this isn't a flashy picture but it really doesn't need to be. This film rides entirely on the strength of its authentic, revealing dialog and the astonishingly mature, resounding performances of its cast, who contribute many of the sharpest, most memorable lines via ad-lib. It's about trust (or lack thereof), pushing others' buttons, being honest with oneself, testing new boundaries and revealing a shared, deep-seated uneasiness about the perilous approach of adulthood and its inherent responsibilities. Emotions run high at this age, and they respect no class distinctions. The cast may be extremely small, but it delivers across the board; Judd Nelson's damaged loner, Ally Sheedy's bashful antisocial, Anthony Michael Hall's over-stressed bookworm, Emilio Estevez's high-strung jock, Molly Ringwald's pretentious priss. Each role a potential career-maker, and not a missed note in the bunch. It's an existential essential, a notice to uncertain adolescents that somebody understands, and a reminder to their grown-up counterparts that they, too, were once just as troubled.",
            "review_date": "2016-07-12",
            "source": "rt"
        },
        {
            "content": "Meaningful, thought-provoking, and intriguing, The Breakfast Club contains a brilliant script and captivating performances from its cast to form a perfect chemistry, and perhaps the best high school movie ever made.",
            "review_date": "2016-07-10",
            "source": "rt"
        },
        {
            "content": "For an 18 year old watching this in 2016, the movie left in me a great impression.",
            "review_date": "2016-06-21",
            "source": "rt"
        },
        {
            "content": "The definition of a timeless classic. No matter how many times you watch it, it just seems to keep getting better.",
            "review_date": "2016-06-17",
            "source": "rt"
        },
        {
            "content": "My favourite movie of all time.",
            "review_date": "2016-06-11",
            "source": "rt"
        },
        {
            "content": "John Hughes' classic stands the test of time and relates to teens of all generations.",
            "review_date": "2016-06-02",
            "source": "rt"
        },
        {
            "content": "still one of the best movies I'v ever seen.",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "A classic coming of age movie that brings together 5 students during detention. It gets really interesting when they start opening up to each other. That's when you see them for \"real\". Truly one of the greatest movies ever made.",
            "review_date": "2016-05-21",
            "source": "rt"
        },
        {
            "content": "This movie goes way beyond typical high school archetypes, teen angst, etc. Layered within the movie is a hard look at the schooling system (at least in America) and a commentary it's effects on child development psychology. Basically young adults who are almost by definition going through one of the most vulnerable stages of their lives are shoved in to the social gladiator arena called \"high school\", with little or no spiritual or emotional guidance.",
            "review_date": "2016-05-20",
            "source": "rt"
        },
        {
            "content": "Laughed a few times and then, are these tears...",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "one of the best ever with great music too",
            "review_date": "2016-05-17",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club (1985) ?? 1/2\nFive kids sit and talk about themselves during daylong detention. Daring and interesting, but predictable and self-important.",
            "review_date": "2016-05-01",
            "source": "rt"
        },
        {
            "content": "The incredible thing about this movie is that the premise seems so incredibly boring, and it could have been so incredibly boring, but it isnt! The Breakfast Club is a warm, insightful and hilarious movie about a group of seemingly polar opposites of each other.\nThis is a character driven performance piece, despite only starring young actors and a always hilarious asshole teacher and a delightfully innocent janitor who sometimes walks into scene. But what mostly keeps this movie together is not the fantastic script, but the engaging, interesting, hilarious asshole of a character, beautifully portrayed by Judd Nelson called ''John Bender'', every scene he is in (quite alot), he steals the show. He is just so engaging, your eyes are glued to him whenever he says or does something, it is Judd Nelson who is unforgettable as Bender that acts as the catalyst of everyone's emotions.\nOn top of that the last half hour of The Breakfast Club, is truly incredible, emotional and heartbreaking. Every actor in this film shows their true potential there, and oh boy do they all shine.\n\nWith ''The Breakfast Club'', John Hughes shows us once again why he is the king of 80's comedies.",
            "review_date": "2016-04-20",
            "source": "rt"
        },
        {
            "content": "Simple yet complex dialogue/character driven 80s pop culture classic. Adolescent social commentary and social economic class dynamic with a bit of coming of age, Maybe I'm reading too much into it. Sure its just stereotypes and silly but that makes it charming and maybe you need to look past the stereotypes to see a piece of yourself. Fantastic, well written, funny, and intriguing with great performances.",
            "review_date": "2016-04-11",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club doesn't have much to offer other than drama and comedy, but it does an amazing job using those to it's advantage. The idea for the movie is simple and the execution is done okay. The Breakfast Club does have a few scenes, which are quite memorable and funny.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "I love its uniqueness, the raw emotion, and the desperate struggle to fit in, to matter, and to rise against authority.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "Solid high school movie investigating stereotypes and 'boxes'- great film!",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "Perfect. A life lesson.",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "After decades since the movie's release, I finally saw it and was certainly not disappointed. It's got it all. Humor, drama, entertainment, and thrill. A true classic.",
            "review_date": "2016-02-23",
            "source": "rt"
        },
        {
            "content": "Three decades later and after hearing so much about it, I finally watched The Breakfast Club. It's certainly incomparable to today's fast paced films, but this classic teen drama is all about quality writing and directing. There's so much depth to every character portrayed greatly by his or her respective actor. Hughes has definitely done a remarkable job and in return created an immortal film for all ages.",
            "review_date": "2016-02-20",
            "source": "rt"
        },
        {
            "content": "A very classic movie...still popular.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "except the last 15 mins in the movie, it was horribly overrated!!!! i wouldn't recommend this to anyone.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "Emotional, intelligent, creative. You probably already know about this movie. It's considered THE teen movie of all teen movies. It's an excellent drama-comedy. The five teens we see in this movie are treated like real characters with legit problems. It's very insightful. I will warn you though, there is a LOT of yelling and cussing at each other, but it's done with such passion. Classic. I like to revisit this movie every once in a while.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "There is a good reason why people still love this film even 30 years after it's release. Because even though these teenagers are obviously from the mid 1980's, it speaks to teenagers of every generation. It speaks to the struggles that we all go through at that age and let us know that we are not all that different. Sure on the outside we all fit into our little cliques and some rise above each other on the popularity ladder, but really, if we took the chance to know one another, we actually have more in common then we know. Great performances by the whole cast and of course I can't forget to mention the great use of music at the end. Do I even need to say what song it is. You all have heard it...... Well, if you don't, then watch, 'The Breakfast Club'",
            "review_date": "2016-01-27",
            "source": "rt"
        },
        {
            "content": "I watched this movie when I was young. It was good. But I watched it yesterday again, and it is pretty bad. It is incredible how some movies age badly.",
            "review_date": "2016-01-24",
            "source": "rt"
        },
        {
            "content": "one of the best coming of age movies ever made.to me growing in the 80,s it was very relevant.each character is perfectly played by a superb young cast.and what a great soundtrack.i have to revisit this every few years.perfection",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "A thought provoking look into adolescent psychology.",
            "review_date": "2015-12-02",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a quintessential teen movie. Director John Hughes really knew what he was doing when he wrote his teen movies. Set during one Saturday detention, The Breakfast Club is a movie about five different kids from five different social groups becoming friends and finding out they're not so different after all. The five main characters are Claire the princess, Andy the jock, Allison the basket case, Brian the nerd, and Bender the criminal. Though at first the five characters argue, they pour their hearts out to each other and realize that they aren't So different after all.",
            "review_date": "2015-11-24",
            "source": "rt"
        },
        {
            "content": "Arguably the best \"high school\" film ever made. Great dialogues (Although at times filled with unnecessary swearing or profanity), well acted, and this film has a good message. But, I felt the conclusion was not strong and the teenagers in this film at times discuss about the same matter over and over again. Still, this is a great film.",
            "review_date": "2015-11-17",
            "source": "rt"
        },
        {
            "content": "Teenage angst is immortal and so is this movie",
            "review_date": "2015-10-28",
            "source": "rt"
        },
        {
            "content": "People that disliked or hated this movie because they thought that nothing happened did not realise that they were sitting on a social and emotional rollercoaster.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "This movie is fun, entertaining and well acted. The best coming of age movie I've seen.",
            "review_date": "2015-10-19",
            "source": "rt"
        },
        {
            "content": "The only aspect of the film that is more impressive than it's surprisingly effective simplicity is how genuine and interesting it's characters are (all of them). The Breakfast Clucb is truly an unforgettable mix of humor, warmth, authenticity and sleekness, managing to be consistently touching and cool throught.",
            "review_date": "2015-10-14",
            "source": "rt"
        },
        {
            "content": "Um clássico cult, por assim dizer. Talvez um dos filmes mais bem sucedidos em tentar trazer toda a essência dramática da adolescência, porque convenhamos que é como dançar ziguiriguidum em cima de uma corda a 3 metros do chão. Porém, o que fez desse filme um dos mais aclamados da temática adolescente?\n\nSábado, 24 de março, 1984. Colégio Shermer, Shermer, Illinois, 60062. Cinco adolescentes são obrigados a ficar confinados dentro da escola, cada um tendo que escrever uma longa redação sobre o que eles pensam de si mesmo.  O cérebro Brian Johnson(Anthony Michael Hall), o esportista Andrew Clark(Emilio Estevez), a princesa Claire Standish(Molly Ringwald), o marginal John Bender(Judd Nelson) e a neurótica Allison Reynolds(Ally Sheedy) formam o Clube dos Cinco. Todos bastante distintos uns dos outros, mas que vêm nos problemas pessoais uma coisa em comum.\n\nVivemos uma época em que filmes considerados adolescentes envolvem grandes revoluções, a sociedade separada em castas e cenários pós-apocalípticos e, se você pensar bem, o filme em questão traz muito dessa vibe revolucionária, com jovens sendo forçados a deixar sua inocência para trás e começar a batalhar pela sobrevivência. O diretor John Hughes usa o marginal John Bender(Judd Nelson) de estopim para isso. É através dele que vemos o desenrolar dos outros personagens e como eles reagem ao mundo em sua volta. Isso acabou fazendo com que, mesmo que não propositalmente, Bender carregasse a imagem de mocinho da história, e isso é uma visão meio deturpada das coisas, porque um dos pontos positivos do filme é não focar em apenas um personagem e aponta-lo como o mocinho/mocinha/mocinhx da história e sim dar espaço para que seus dramas pessoais entrem em cena e deixe claro que ninguém é, de fato, um mocinho.\n\nJohn Hughes utiliza a escola como um instrumento crucial na construção de seu filme. Que lugar poderia reunir jovens de diferentes tribos em prol de um bem maior? - E não, o escadão não é uma opção.  - Desde os anos em que guaraná tinha rolha, o adolescente e a escola passam por uma relação de amodeio difícil de ser explicada. Fica claro o desconforto dos personagens em ter que acordar cedo e ir à escola em um sábado de manhã.  Acordar cedo já é um sacrilégio e acordar cedo e ir à escola e escrever uma redação autodescritiva seria como cometer todos os pecados capitais e ainda desenhar a Xuxa segurando um pentagrama na porta da igreja. Hughes se aproveita do ambiente escolar para introduzir outros personagens indispensáveis para a trama: o diretor do colégio Richard Vernon(Paul Gleason) e o zelador Carl Reed(John Kapelos).\n\nOutro ponto positivo do filme são os diálogos totalmente críveis que ele apresenta, parecendo fluir sem a necessidade de um roteiro, e foi exatamente o que aconteceu na cena em que todos estão confessando suas desgraças em conjunto no chão da biblioteca. Nenhum ponto negativo no que diz respeito à atuação dos atores,  dando destaque para Ally Sheedy e Emilio Estevez. E fato curioso: Nicolas Cage estava sendo escalado para fazer o papel de John Bender, que bom que não rolou né pessoal?\n\nMas talvez o que tenha deixado o Clube dos Cinco marcado na mente de tantos jovens da década de 80, 90 e do povão de 2000 foi mostrar que todos precisam conviver com seus próprios demônios, e que não dá para fugir disso. A vida de adolescente é uma desgraça - ainda mais se você passa para uma federal - e não adianta querer correr, ninguém escapa. Porém, isso não quer dizer que você tenha que estar triste o tempo todo. Quando se está com os amigos rindo, se divertindo, jogando totó, cantando forró, pensando nelx ou qualquer outra coisa que você faça com seus amigos, tudo melhora. E não perca tempo pensando no amanhã, aproveite o agora e compartilhe energias positivas com todos. Mesmo que não façam parte da mesma tribo social que você, vocês sempre podem ter algo em comum.",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "I don't care when you were born; if this movie wasn't part of your childhood, you missed out. It teaches lessons that will always be relevant. It dives into how being an angsty teenager really is, hits home on the issues kids can have with their parents, and properly displays what it feels like to be the black sheep. The soundtrack only makes it that much better. You need to see this movie.",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "great characters that any teenager could identify with, the breakfast club shows the lives of the different clases of high schoolers",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "A surprisingly popular look at the minds of high school students, but completely honest and brilliant in its writing and focus, and is only occasionally betrayed by its 80s comic relief.",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "what should sound like the most dull film created Hughes still manages to create a cult classic! The characters are a masterpiece each one making me sympathise and relate to them even though they are all different.",
            "review_date": "2015-10-05",
            "source": "rt"
        },
        {
            "content": "just an all out great film glad to have finally seen it great movie great cast",
            "review_date": "2015-10-03",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club through an well-written story, picks in the teen lifes and authentically approach it, transmiting a touching message because of the genuine performances by the cast, but unfortunately the good moral lessons were overshadowed by its cliched end and by its \"marijuana scene\" that has no credibility, spoiling the warm story that this should have been.",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "John Hughes is a genial!",
            "review_date": "2015-09-20",
            "source": "rt"
        },
        {
            "content": "This was such an epic \"coming of age\" teenage drama. It was corny, yes. But that was to be expected from an 80s movie. It was also over-dramatic and had one too many climatic moments. But again, that was expected. It was also very touching and made me wonder what would happen if people who never ordinarily talk to each other or even notice each other crossed those boundaries and discovered that at the end of the day we are all people and we all have or our demons to battle. This movie illustrated that we all share the commonality of that struggle no matter who we are. Well worth seeing.",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "The classic coming of age movie of the 80s... A must-see",
            "review_date": "2015-09-08",
            "source": "rt"
        },
        {
            "content": "This is an ICONIC film for the Brat Pack. It also accurately depicted  situation for many teens in middle class schools in the 80's. Who didn't go through angst at trying to fit in, or be accepted as a teen? Who didn't get bullied or feel forced to bully someone? Deep down inside we all know we are the same. This film is poignant, and thought provoking look at what we as a society put our children through when we teach them to look down on each other, over  pressure them to achieve,ignore them, or abuse them...If you didn't relate to this film as a teen you must not have a heart. The themes of isolation, loneliness, and peer pressure are timeless. John Hughes was a GENIUS and directs a great cast in this classic.",
            "review_date": "2015-09-05",
            "source": "rt"
        },
        {
            "content": "While I can't say this is my favorite John Hughes film, I think this script has some of the best writing he has ever done. The Breakfast Club is heartfelt and insightful film that looks into the inner feelings and thoughts of a teenager. The great thing is that you see the inner self in each type of teenager. The rebel, the brainiac, the athletic, the pretty girl and the artistic basket case, and it's all very powerful. Aside from the great script, the performances are great and The Breakfast Club is just a wonderful coming-of-age classic.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "Funny, sweet and brutally emotional, The breakfast club is the defining 80's movie and will be re watched by anyone with a heart. And let's be honest the theme songs amazing.",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "This is the one John Hughes teen movie that really works for me.  It works for me despite the fact that there's more than a few things about it that really aren't very good.  The last section of the movie is overly serious, somewhat disjointed in it's construction and really suffers from Paul Gleason fading into the background.  Some of the dialogue in this section is painful (\"When you grow up your heart dies\"?) and the characters tend to launch into awkward monologues that are way too on the nose.  In a way, it's a perfect film for teenagers, and that's probably why it still works for me.  I was 16 when I first saw it, and it was perfectly designed for me at the time.  I give it a lot of credit despite its flaws.",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Meh, it was alright. After being lauded as a classic, I figured I had to check out Joh Hughes' masterpiece, The Breakfast Club. Was pretty impressed at the start. Lots of memorable characters and a great set up fro conflict and interesting character study. Only the characters being studied were so boring and dislikeable! John Bender was an annoying prick, who reminded all too much of the douchebags you have to tolerate in high school. The quiet girl was boring, the even quieter girl was fluctuate in her ambitions and traits way too much, and the Emilio Estevez jock I couldn't give two shits about. The only person who gave any justice to the band of bad characters was Bryan, and he was just getting told to \"fuck off\" every minute. In fact, the one person I sympathised most with was the principal! The Breakfast Club does have it's funny moments, but that's about it. Even the final scene where they're discussing personal issues would just turn into something predictably dark and the whole send off where four of them end up as couples was just predictable and unsatisfactory. Fun, slightly charming film, but barely tolerable beyond that.",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "Maybe I would have related more to this had I been in their age when I was a bigger idiot than I already am. Of course, I speak for myself. It makes me think we dont stop being the idiots we always were. Just biggest idiots. Adult idiots that make bigger mistakes. Like raising a family when you aren't ready. Oh well. Fun fun movie.",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club: Yes, it was the quintessential stereotype-busting teen angst movie of the 80s, and yes it had a slew of stars that became household names but re-watching it was a bit of a chore - complete with cliches and awkward and really forced dialogue. The ending, however, was really sweet. B",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "THIS IS THE BEST MOVIE OF ALL TIME!!!!",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Excellent soundtrack, powerful acting. Great story and message dealing with stereotypes.",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "quite simply a masterpiece a template for recent and upcoming works.",
            "review_date": "2015-08-04",
            "source": "rt"
        },
        {
            "content": "An iconic classic. Liked the quirky humor. Great sound track.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "keeps growing on me..",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "Great movie, and this would absolutely be 100% or 5 stars if this movie wasn't inside a school the whole time, however they nailed this movie amazingly, with the personalities, some smart talk, and knowing what other people's problems are, an absolute classic and terrific movie and like I said of what could've been 5 stars if the setting was different.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "Classics never die!!!",
            "review_date": "2015-07-18",
            "source": "rt"
        },
        {
            "content": "Regarded as not only one of the best High School films ever made, but also one of the defining pictures of the 80s, The Breakfast Club is one of the funniest, smartest, most charming and emotionally affecting movies I've seen in a while. Featuring a set of teenage stereotypes, you could be forgiven for thinking this is simply going to be another run-of-the-mill, angst-ridden adolescent flicks. But what we get is 5 fleshed-out, realistic and completely loveable individuals who not only discover that their cliques are not what define them, but also what makes them choose to belong to such social groups, as well the stigmas associated with each one. The film is essentially a meditation on High School life, with thoughts on paternal expectations, trust, acceptance, the importance of honesty and, above all, friendship. Perfect casting, wonderful acting and a witty, insightful, touching screenplay make this film an absolute joy to sit through, and it's a testament to the talent involved that arguably its most emotional scene was ad-libbed. It wouldn't be an exaggeration to say that this is one of my new favourite movies. I felt for the characters and identified with their emotions, and when it was over I wanted nothing more than to spend more time with them. And that may be one of the biggest compliments you can give a motion picture.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Stunningly accurate depiction of teenage angst, loved it.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "John Hughes was a master at capturing teenage angst in ways that were often funny, silly and crude. The cinematic magic in much of his work is his ability to fully connect with the generation because he always found a way to add just enough realism to be profound. The Breakfast Club remains entertaining and a timeless glimpse into the challenging realities of teenage identity and high school. If anything this film has gained more power over the years. All seven of the film's actors give brilliant performances. Molly Ringwald and Anthony Michael Hall are simply brilliant here. Yet, Judd Nelson's \"Bender\" remains the center and core power of the movie. It is impossible to deny this film it's power and place as possibly the most entertaining and simultaneously potent depiction of teenagers is not only stupid -- it would be wrong. A must see.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "One of my favourites. A very relatable and interesting character-based movie.",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "I Can't Believe It Took Me This Long To Finally Watch This Great Flick. This Is Deff One Of My Top 5 Favorite Flicks. Love The Breakfast Club. <3",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "This is the contender for the all time best teen movie ever!",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "One of the best high school dramas ever made.. It's simply a moving, emotion filled gripping film about a group of kids that spend a Saturday in detention. Why are they there? Who are these kids? Will they listen and compromise? Or will they leave a legacy of crime behind them? It had a great soundtrack, characters, and humor.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "A teen movie classic, \"The Breakfast Club\" came out at the height of John Hughes' career and was an instant success for its wisdom, authenticity, and eye-to-eye reliability.\n",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club remains timeless. In each of the students in detention, every viewer will find at least one person to identify with - the athlete, the princess, the criminal, the genius or the basket case.  I first saw this when it was originally, a few years out of my teens and loved it then as much as I do now, thirty years later. The scene where Judd Nelson acts out his home life is one of the great scenes of all time.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "A good movie? Yes. A classic? Not even close.",
            "review_date": "2015-05-07",
            "source": "rt"
        },
        {
            "content": "Best film ever. Maybe that sounds crazy and of course its not the best movie ever but its awesome. I just love the acting and the setting and everything in this movie. It teaches you a strong message and just makes the movie great. Love this film, great job.",
            "review_date": "2015-05-07",
            "source": "rt"
        },
        {
            "content": "Classic movie from my past that my children now get to appreciate!",
            "review_date": "2015-04-23",
            "source": "rt"
        },
        {
            "content": "It sometimes feels very forced and it may seem cliched at the beginning, but The Breakfast Club manages to overcome the plot's familiarity with solid performances, some very iconic scenes, a couple of funny moments, beautiful emotional approach and of course excellent character development. The whole conversation at the end, although forced at some points, is very touching and adds heart to the movie. It is not without its flaws, but it is a warm, clever and above all fun film with wonderfully realized characters and honest approach all leading to one stupendous teen movie deservedly called a classic.",
            "review_date": "2015-04-18",
            "source": "rt"
        },
        {
            "content": "One of my stuck on an Island videos.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "Funny, honest and extremely spirited, The Breakfast Club is a teen classic in terms of both its entertainment factor and the respect in which it treats its adolescent protagonists.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "Good scenes, bad characterization, worse ending",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "9 out of 10:\n\nSmart and funny, this is the perfect film for teenagers.",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "The quintessential and best movie about High School. Period! John Hughes' magnum opus.",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a high school movie in it's greatest form.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "This movie was a very heart warming movie, emotional and picks up on many teenage issues, and it still is enjoyed by many generations. As I am only 14 I now understand that whatever kind of person you are known to be at school e.g jock/popular person or even the nerd everyone has their story.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "It's amazing how a movie that takes place on so few sets can be that good. Certainly recommend it.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "love it this movie and more the end....its great and funny",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Classic. Just watch it.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "I member the breakfast club back win I was a teenage years this is  still one best movie ever yea",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "awesome film.  something you can watch over and over.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a great, character-driven teen movie. It is hilarious and quite emotional at times. While there's no denying that this film has its share of 1980's cheesiness, it still manages to be very culturally relevant, 30 years later. It is a film I would recommend any teenager to see.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "I think that it was great to get to see this comedy classic on the big screen for the first time. I wasn't born when this movie was released but I think that the breakfast club is still relevant 30 Years Later.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "One of the best 80s movies of all time.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Classic movie.  Best high school movie of all time.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "John Hughes is back on the big screen thanks to Fathom Events and UEC Theaters!  The Breakfast Club has aged pretty well, but seriously a little of Judd Nelson goes a long way. Still, if you've never seen a Hughes film this is a good place to start. So if you can go see it, Molly Ringwald, Emilio Estevez, Ally Sheedy, Anthony Michael Hall, and even Judd Nelson have some magical moments. And dang, I love their hair! John Hughes, you left us too soon.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "best 80's movie ever!!!!!!",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Continuing to revisit the 80's my school era. Ally was so damn cute.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "Growing up in the 80s,this was iconic.....one of Hughes's best.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "Even thirty years into the future, this movie remains the most honest and heart-felt reflection on high school out there, and it's characters, dialogue, and heavy themes are not to be forgotten.",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "The movie does a good job at making us care for each character, even Bender, which is what the movie is about; while each person is very different, we like them all for what binds them together. The movie at times can be heart-warming and then heart-wrenching. The movie has very good dialogue between the characters. Unfortunately, the plot itself is not very fascinating or entertaining, but the characters are what really drives this movie.",
            "review_date": "2015-03-18",
            "source": "rt"
        },
        {
            "content": "It's amazing how many \"top critics\" don't understand and never will really understand. Back when it was made, and even still today kids all over the world are able to relate in one way or another. That is what makes this movie continue to  be so powerful and relevant.",
            "review_date": "2015-03-17",
            "source": "rt"
        },
        {
            "content": "Very 80s. It's a cult classic, But hasn't aged very well - or maybe I've aged badly - it touched some uncomfortable truths but wrapped them up in optimism, then. Now I know better.",
            "review_date": "2015-03-10",
            "source": "rt"
        },
        {
            "content": "John Hughes production of The Breakfast Club staring  Emilio Estevez, Paul Gleason, Anthony Michael Hall, John Kapelos, Judd Nelson, Molly Ringwald and Ally Sheedy really is a must see.  The movie is about five teenagers, each a member of a different high school clique, who spend a Saturday in detention together and come to realize that they are all more than their stereotypes.  Before watching this film, I was quite confused considering the title, \"The Breakfast Club\" really does not not have to do with what the film is about at all. Also I was very hesitant at first considering this is a film produced in 1985. Viewers really can feel a sense of understanding and can relate to Hughes story line because of cliques today. Also we can relate to the ways some of the actors feel and the things they say when they are upset. Molly Ringwald \"The princess\" exclaims during the film that, \"You know, I have just as many feelings as you do, and it hurts just as much when someone steps all over them\". Her saying that really helps us relate to viewers because in life people feel like they are being stepped on when others put them down. Being as relatable as it was, it was also very enjoyable to see how these five very different students have to work together to make it through detention and also play pranks on their principal (actor Paul Gleason). The reason I gave this movie four and a half stars is because I wish it didn't just end as they all left detention and went their separate ways. Overall a very great movie and I recommend it to anyone considering watching it!",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "So many emotions in one movie, it's a master piece!\nA special mention to Sheedy's performance",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "Great. 8.5/10. A-.\n\n\nThroughly enjoyable and enticing, it holds the audience's attention from beginning to end.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "The definitive 80's teen movie. The measuring stick by which all teen movies should be measured. Filled with heart and laughter.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Isn't even about breakfast.",
            "review_date": "2015-02-24",
            "source": "rt"
        },
        {
            "content": "Enormously well made and above all well written. The film is equal parts strong in its comedy as in its drama, partially thanks to the fantastic delivery from the actors. Breakfast Club surprised me, it was believable and it is indeed a timeless classic in my mind.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "Though I appreciate how it's become a cult classic, I might have gone in with too high of expectations. I was moved by how such totally different social archetypes came together, and the end was quite poignant, but perhaps I'm just not as interested in \"the high school\" scenario",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "A look at varied school kids finding themselves and each other after a weekend of detention. It sounds a little boring, but this pic drew me in with it's excellent development and character interaction.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club through an well-written story, picks in the teen lifes and authentically approach it, transmiting a touching message because of the genuine performances by the cast, but unfortunately the good moral lessons were overshadowed by its cliched end and by its \"marijuana scene\" that has no credibility, spoiling the warm story that this should have been.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "\"You see us as you want to see us... In the simplest terms, in the most convenient definitions.\" \n\nWhen you think about it chronologically, The Breakfast Club is out of order when it comes to John Hughes' (RIP) career. Usually the smaller, cult hit is supposed to be first. It's like Tarantino making Kill Bill before Reservoir Dogs or Spielberg making Saving Private Ryan then going on to make Duel, it just doesn't make sense that a director would come from a big success with a relatively large cast and many more sets with Sixteen Candles and go on to create this little gem.\n\nBut thankfully he did. \n\nThe Breakfast Club is basically proof that a film doesn't need to have millions of dollars backing it, huge sets, crazy special effects and big name actors to be incredible. In all seriousness, a school student could have made this script into a film without being out of pocket. There is one location; a school. There are five main cast members with two supporting and five extras. That's it. Nothing else! The secret to this film's brilliance is in its perfect character development and note perfect script. \n\nThis film is one of the best examples I know of for character development. We get taken on a journey through each one of these character's lives and get to know each and every one of them, without the help of a voiceover, thanks to John's brilliant script. The main focus of the script, if there is one, is John Bender, a guy who clearly hates authority and tries to get under everybody's skin. Who is played brilliantly by Judd Nelson, showing every single side of him with ease. In one particular scene, when John and Andrew have an altercation during their detention, the various facial movements by Nelson perfectly portray his character's true thoughts and his trying to cover them up. You are able to see through to the fear that he feels, the self-loathing, the frustration that comes through as abrasiveness, it's all there, as well as the effort to cover them all up. It's acting at it's finest and most underrated. \n\nThe rest of the cast is fantastic as well, especially Emilio Estevez, in particular in the scene where he explains himself to the other characters. The purity of acting is the thing to see here, the raw talent is absolutely incredible. \n\nFor each character, we begin with a small glimpse into their homelife; Andrew's sport obsessed and neglectful father, a small slice of the feud between Claire's parents, the 'pushy-parent' syndrome inhabiting Brian's, Allison's self-centred/uncaring parents and John's total lack thereof. Each of these tell something about the character immediately and the way they act in detention is a direct result of it. This sort of attention to detail and perfect scripting means that the film will stand up to and benefit from repeat viewings. I've seen the film four times now, and each time something more is revealed about each and every character, something is brought to light which you would never have seen before. \n\nThe pacing of the film is also something which filmmakers can learn from. Hughes slowly reveals and unpeels his characters, rather than using cookie cutters to create them. Instead of letting John giveway in the first five minutes, letting Claire reach her breaking point in under 10 and Brian in the next five afterwards, Hughes takes his time in their various ongoing changes. \n\nApart from all the serious stuff, this film is absolutely hilarious. Gut burstingly funny stuff. Whether it's John ranting about Brian's homelife or, well, John ranting at the Principal, there are some fantastic lines in there. \"John: (to Claire) What are you eating? Claire: Sushi? John: You won't accept a dude's tongue in your mouth but you'll eat that?\" \"Sir, is Barry Manilow aware that you raided his wardrobe?\" Genius stuff. \n\nThe Breakfast Club is a fantastic film and of my favourites. Hughes' script and characterisation is something to be studied. \n\nDefining Scene: \nJohn and the Principal go head to head. Perfect writing for characters.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Best 80s comedy ever",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "A film about defining characters, creating them halfway then destroying them in the other half. Perhaps one to see just for pleasure, but I'm not guilty of that.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Recordando nuestros tiempos de secundaria y preparatoria.  Excelente pelÃ­cula",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club has its moments, but is very predicable and cliché. The characters are all stereotypes, though the idea of putting kids of different cliques was clever. The concept is a fun one, but not one that could successfully extend beyond a TV episode run time. There are entertaining moments, but there are some boring scenes. There are also lots of questionable scenes in which the kids' motives for doing certain things don't seem clear or plausible. There are some fun moments and well defined characters to keep you entertained. Overall it's  a solid film, but pretty predictable. The Breakfast Club gets 3.5/5 stars (B).",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "Entertaining manipulation.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "I finally saw the Breakfast Club! It is one of those films that not only was popular when it was released, but it may have changed or left a stamp in pop culture. I have seen a lot of imitations and poses based on the film's cover which involves five students with five different stereotypes. It starts off in a Saturday morning where five \"stereotype\" students are placed together in a room where they have to spend the rest of the Saturday writing an essay on who they believe they are to their principal. The five students at first do not get along, but soon start talking and getting to know each other and discover they are not so different. Yes, there are parts where each of them become shaky with one another and dark secrets are revealed. To me, it seems like writer and director John Hughes got together and listened to what they had to say. In fact, his presences is felt though the films as the students start to talk. The stereotypes we have are the Jock (Emilio Estevez), the popular kid (Molly Ringwald), the Criminal (Judd Nelson), the Nerd (Anthony Michael Hall), and the Outcast (Ally Sheedy). The movie is, I must confess, good at speaking and addressing the young audience. However, it only addresses to a certain audience and speaks to only a certain group. Hmm, I wonder what group that is. Looking at the poster, there is something I can't quite touch on what they all have in common. Anyways, despite some \"touching\" and \"moving\" moments, I dreaded experiencing this film. I could not relate to it even though I myself was a teenager and a student in my school and not everyone could or will ever relate to this film, so thanks for setting a standard even though that was not the intention of the late director Hughes. \n\nBy the way on a final not, I want to call out and invite that moron who commented on my review for the Perks of Being a Wallflower. Granted I was harsh about the late director, but I could not help myself to laugh at your ridiculous rant especially when you \"liked\" your own comment. I'm sorry, but disagreeing with me is one thing and I can come to terms about it. However, liking your own comment does not solidify or is valid for you argument. It only shows me that you are one dumb son of-! I await your rant which I respond with \"what?\"",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "It lacks something but I couldn't really tell, is it the sloppy acting? the dialogues that feel incohesive sometimes? it needs bit more natural approach I guess to really elevate the whole otherwise great idea",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a vitally iconic film of the 1980s and one of the decade's best, giving angsty teens just one more free voice in the world as 5 different personalities share their unpleasing out of school lives.\n5 high school students (a beauty queen, a jock, a nerd, a basket case, and a rule bending bad boy) are stuck on a weekend detention, where they avoid their strict principal and attempt to have fun as much as they can, eventually digging deeper into sharing at home issues and pressure.\nThe Breakfast Club is one of John Hughes' classics in the only decade he was still great in. The synopsis could have easily led to disaster and filler but the movie masters what it does, and legitimately leaves you interested in these cliched characters we've all seen before - that takes skill. It stills holds a rapid fanbase today, although the film is noticably dated with its signature soundtrack blaring every now and then, but the film knows how to appeal to anyone when designated for teens. Breakfast Club is brilliant and is extremely well done.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "While I accept that its simplistic and straightforward plot and characters were intended as such, I wish the characters were made a tad more believable. I get that the point was to highlight the stereotypes in order to break them down later, but I felt that that could have be done in a much more believable way. They often either got too grandiose and eloquent for teenagers (who the hell says \"I don't think from a legal standpoint what he did can be construed as X (plot point omitted)\" in ordinary speech?), or got excessively silly with childish antics.\n\nPerhaps it's just an effect of having seen several high school films that came after it, most likely were influenced by it, and gradually improved the genre, or perhaps it's just a film I should have seen when I was younger. In any case, although it was definitely entertaining and interesting, I don't think I would see it again.",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "Funny, utterly charming, brilliantly acted, and with a soundtrack capable of making the least elegant of dancers kick off their shoes and fly around their living room, The Breakfast Club is an achievement in every single way. It is the peek of teen-comedies, and even now, it is still the undoubted and untouchable king.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Hughes' most recognizable work, this is a well written and acted movie, all the characters were so interesting, and weird at times, this movie is funny, heartbreaking, and dramatic in certain scenes, the acting was so good in this movie, that you actually want to know about these characters, and their backstory, the chemistry between them was so great, this movie is a classic and John Hughes' finest work",
            "review_date": "2014-11-27",
            "source": "rt"
        },
        {
            "content": "No words only my amazement.",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "I get that this is supposedly an iconic movie, but I just didn't care for it all that much.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "The brilliance of \"The Breakfast Club\" is largely lost on those who think of it as a teen movie about high school archetypes. It's not a movie about a rebel, a princess, a jock, a freak, and a nerd; there are no such people. It is, apologetically, a high-concept play about people trapped in a room until they realize that their similarities are greater than their differences. It rips up Moliere-literally-and adorns itself with the clothes and music and fresh faces of the era's key movie-going demographic, but preserves the close character work, human insight, and polished bon mots of a \"serious\" work for stuffy theater-goers. Among the people who didn't notice the script's incredible energy and sophistication were the voters of the Academy of Motion Picture Arts and Sciences, who failed to nominate the script for Best Original Screenplay though it is worthy of favorable comparison with the likes of \"12 Angry Men\" and Jean-Paul Sartre's \"No Exit.\" Similarly, the Academy failed to recognize the accomplishment of Ally Sheedy, who completely transformed herself from the sunny girlfriend of \"WarGames\" (1983) into the impish, shocking, hilarious Allison of \"The Breakfast Club.\" Audiences focused more on Molly Ringwold's girl-next-door appeal, but she is slightly miscast as an alpha female and her screen presence pales next to Sheedy's show-stealing talent. Perhaps most damning of the Academy's ability to recognize quality when it comes in the guise of a popcorn movie is the lack of an acting nomination for Judd Nelson, who shows incredible range and depth as Bender. Nelson underplays and overplays in exactly the right places as Bender's determination to speak painful truths drives the film and sets off chain reactions within the ensemble. More snubs at Oscar time included the film's tense, cerebral score, and the songs that make up its now-iconic soundtrack of 80s pop picked to play during the beginning, end, and the choreographed montages that break what could be a one-act play into a traditional three-part structure. Some might criticize the montages for being silly, dated, and disconnected from the plot, and they would be right, but the segments are fun and they let each character reveal his or her nature in a non-verbal context by the particular way that they dance on banisters and slide down hallways. The only really indefensible missteps in \"The Breakfast Club\" come near the end, and the timing sours the experience. The makeover scene is hokey and regressive, a too-easy climax that was perhaps meant to suggest the mutability of image and the multiplicity of the individual, but that comes across as a defense of conformity. A related impulse to pair the characters off is unearned in at least one case and arguably both. The Anthony Michael Hall character's arc is too derivative of Billy Bibbit's in \"One Flew Over the Cuckoo's Nest,\" though the stakes are already high enough without being raised to life and death. After all, the really interesting question presented by the film is not whether these kids will live, but how they will live. That said, \"The Breakfast Club\" is not the only work of genius to botch an ending. Oscar voters, like Assistant Principle Vernon, saw only what they wanted to see and missed the chance to enshrine it in the canon. Popular opinion and critical consensus have been less blind.",
            "review_date": "2014-11-18",
            "source": "rt"
        },
        {
            "content": "When a person would ask what John Hughes movie they remember,they would say Home Alone, Sixteen Candles, Pretty in Pink, Uncle Buck, and other films.But what they would really remember from John Hughes, is The Breakfast Club. Everybody from my high school knows how much of a classic it is, and it makes sense because the characters are very memorable. At first, they seem like your stereotypical kids in high school, but when the plot goes on, they get more and more developed to the point that they feel like real people. They are people that the viewers can relate to, and it has some great writing to it. The acting is excellent, it has a right balance between drama and laughs. It can also be thought-provoking, the soundtrack is very catchy, and the dialogue keeps the viewers very interested in this. The Breakfast Club is an amazing movie that gives a reason why John Hughes is known as the king of high school movies.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Very nearly a great movie, prevented from being such only by the crummy ending, which seemed to me to have been written by the studio (did they have to doll up the goth girl to make Emilio Estevez notice her?  What was wrong with her before?).  Up until then, its pretty dynamite stuff.  It is a dialogue movie set almost entirely in one room. It seems like it was written to be a play but this in no way hurts it as a movie.  More than pretty much any film, The Breakfast Club captures the pop-mythical teenage experience, but in a way that doesn't seem fatuous or unreal.  For nearly all of its run time, It is utterly engrossing and often funny.  I don't like it as much as I did 11 years ago, but I shouldn't really.",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "5 representatives of cliques that make up a high school student body bond and spend a Saturday detention in contemplative self discovery.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Like everyone else ever, I love this movie.",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "will these kids from different universes still be friends tomorrow?",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "A cult-classic. Entertaining and well performed. One of John Hughes best.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "I hate that I didn't see it before.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Maybe the greatest teen movie of all time",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "\"The Breakfast Club\" is one of the best teen movie I've ever seen and it insist that a 80's is the best-all-of-time teen/coming of age movie era. While it's simple, you can't ignore the facts that this film is absolutely warm, fun, awakening, poignant but not sentiment.  A powerful and deep explorations of teenager's inner lives and their each trouble. Eventually, this movie reminds me to \"Stand By Me\"",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Quintessential coming-of-age teen angst classic. Never gets old no matter how many times you watch it. A film to stand the test of time portraying the different social groups of high school aged teens. A true and heartwarming journey into the contrasting lives of these kids who in the end bare all and realize they have much more in common than they originally thought. Classic John Hughes. Great cast of actors.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "shudve watched this when I was a teen. nowadays it doesn't affect me at all",
            "review_date": "2014-09-30",
            "source": "rt"
        },
        {
            "content": "one of the best movies I have ever seen. It is so inspiring and it really goes to show that \"we are all bizzare, some of us are just better at hiding it\" . 10/10 oh my god",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "I didn't like this movie at all it would almost get to an important message then fall short...",
            "review_date": "2014-09-26",
            "source": "rt"
        },
        {
            "content": "An entertaining character study, and not much else really. Overcomes some of the tropes of it's time while falling victim to others.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "Just watched this, haven't seen it for years and had forgotten how good it was!!!!!",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "o melhor filme que vi em muitos meses.... classic",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "Maybe I've grown sick of people reminding me how good it is or maybe it just isn't that great but The Breakfast Club is a movie with some great moments and some utterly horrible moments. The film often comes across as a shallow, empty film that tries so hard to get teenagers to connect with it but also comes across as a sweet and well-meaning film. I can't give it a bad review but I can't give it a glowing review either. The incredibly funny scenes are undermined by the unintentionally funny scenes (the dancing, the glass breaking, and the whistling) which are both gimmicky and cringe-worthy. Overall The Breakfast Club is a decent movie but an incredibly overrated movie.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "Not my cup of tea, but I can see why it's a classic.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Funny, stereotypically insightful and tearjerking, The Breakfast Club is the quintessential 80's film that defines high school life and is one of the greatest teen films of all time.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "Memorable moments from kids that are frozen in the 80s.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "This movie is a classic for teens and more people from my generation need to learn to appreciate such great works (I'm 14).",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club relies a bit too much on stereotypes to convey its message, holing the characters into very particular roles that might be more accurate at the time. As a whole though, it is a satisfying, funny, and entertaining film with a wide library of quotable lines.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "One of -if not thee- best high school movies ever and *arguably* John Hughes' calling card.\nOften rehashed and immitated by many a filmaker, this remains top dog",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "For anyone who hasn't seen this movie, you're a stupid, worthless, no good, goddamn, freeloading son of a bitch. Just kidding. But yeah, see this movie. It's amazing.",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "One of the great movies from the eighties!",
            "review_date": "2014-08-27",
            "source": "rt"
        },
        {
            "content": "One of my favorite classics of all time. This is one one of the movies I can watch over and over again without getting bored.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "Still not sure why that glass explodes... :/",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "Definitely one for the time capsules. Almost in spite of the clothing, language and setting (which are all clearly dated) this maintains a true sense of timelessness through the universally recognizable trauma the main characters all face: adolescence.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "My Favorite Movie Of All Time",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "Great classic movie \"2 hits each I can kill you\"",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "What I got to say about \"The Breakfast Club\" is that \"it's very funny, insightful, smart, and clever.\" The performances by the cast is great. The directing and screenplay by John Hughes is outstanding. The cinematography in this is good. And the score is perfect. \"I'm raving that \"The Breakfast Club\" is a movie that looks into the inner lives of teenagers. Must see movie!\"",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "\"The Breakfast Club\" is a fantastic high school movie with engaging characters who all face real problems. The dialogue in this movie just keeps it going so fluidly. The movie manages to hit all the right notes making it a memorable and moving experience. It's both heartbreaking and uplifting and it delivers a message important to the youth of any generation. It's a timeless movie that is sweet and heartfelt and is very entertaining.",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "Fairly entertaining movie with a pretty relatable situation. The premise of the movie is cool enough to enjoy it and should leave people more than satisfied.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "Cult classic for the ages.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "best movie done with these actresses and actors",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "Simple yet effective. Many people can relate to this movie in some way.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "As a teen in high school  I can really connect to this. I feel like I'll like this movie more as I get older, for nostalgia and just because it feels a lot like high school. And I love Judd Nelson as Bender. Definitely one of the greatest high school movies out there.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "The breakfast club is so much like my high school, you have the athlete who has something to prove, the egotistical \"bad ass\", you have the awkward nerd, the popular girl who everyone understands except herself, and the sociopathic girl who no one understands but her self. It shows how diverse teens are at first but once you get detention with them, they might be more similar than different. Everyone is a little bit of what these 5 teens represent. And the movie is just the perfect blend of seriousness and goofiness and does it near flawless. Flawless casting with amazing dialogue to make you think and situations as well. (9.5/10)",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club just blew me away. It has a simple yet creative premise with superb acting from each cast member. It seems to depict high school life somewhat better than most teen comedies from the 1980's.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "Another fantastic 80s movie with relatable aspects for all viewers.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "This really is timeless!!  The acting, dialog and everything about it is so iconic, entertaining and reflective of real life! 18 years old and seeing it for the first time in 2014 I can see why everyone always raves about this movie!",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "Great movie, but you don't have to take my word for it - look at the reviews!",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Hilarious and inspirational possibly the best movie ever made",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "This movie is the absolute definition of a \"classic movie\". This smooth cinema is let alone one of the best creations from the movie industry. \"The Breakfast Club\" is probably my favorite movie from the 20th century. If you haven't seen this flick, you need to WATCH IT IMMEDIATELY.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a seminal '80s cult comedy from writer/director John Hughes.  The story follows a group of five high school students from different cliques who find themselves in detention together on a Saturday morning, and throughout the day they learn to see past the labels that society has imposed them.  It's a fairly simple plot that plays heavily on stereotypes.  And Hughes' writing isn't that good, as the melodrama is overdone and the characters' mood swings shift between extremes from one scene to the next.  Yet, the film has a powerhouse cast full of '80s icons (Molly Ringwald, Judd Nelson, Emilio Estevez, Ally Sheedy, and Anthony Michael Hall) who are able to carry the material and make it work more than it should.  While it has its problems, The Breakfast Club is a fun and entertaining film that speaks to the high school experience.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "In my opinion, this was the best John Hughes film of my top three John Hughes movies. A",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Watched this classic film the other night with Sarah.  Absolutely one of the best films to touch on the insecurities of young teenagers and what we go through to find our own identity.  If you haven't seen it lately watch it again because Hollywood sure as heck doesn't make great films like this anymore!",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "with all the hype around this, I expected more than some kids in detention talking about themselves. It was a slow movie where the biggest part that happens is the credits rolling.",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "OMG this movie was made the same year i was born! :) It doesn't out of date, the clothes and the sushi! still relevant to this day, well more of vintage style..hehe\nThe acting still stiff compare to the present, but i like classic movie and i like breakfast club ^^",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies!!",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Oh yeah! In the besties!",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Anybody who ever went to high school and remembers it to some degree will instantly relate to this classic film.",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "This is absolute movie torture. Director John Hughes presents a world where all persons are one-dimensional stereotypes. All teenagers, naturally, are assigned a caste, and all adults are morons. By movie's end, the teens have \"grown\" (their inter-caste hatreds having subsided), but the adult world is still inhabited by idiots. Making matters worse, the whole affair is packaged with perfect Hollywood sheen and a catchy Top 40 soundtrack, lending teen credence to this shameless manipulation disguised as a \"message movie.\" Shame on John Hughes for leaving us this '80s turd. On my list of all-time worst movies.",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "such a great film with a great cast!",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "Awesome!! More of a drama than a comedy but still amazing!",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "A great movie but it still to me has a shaky ending to me and wrapped up a bit to smoothly with all of the characters.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Now, one of my favorite films.",
            "review_date": "2014-07-14",
            "source": "rt"
        },
        {
            "content": "Watched it and this movie is probably the best movie i have ever watched.I watched it 5 times in 3 days and it doesn't get old.LOVE IT!!",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "A true teenage classic that gave teens a voice they never had",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "This film is 100% worthy off the rating I'm giving it. I absolutely loved this movie and still remains my second favorite film by Hughes (First being Ferris Bueller)",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite 80's movies and teens movies... This is a must see!",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "John Hughes best film and one of the 80's best movies. An all around CLASSIC.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "A funny script and interesting characters combine to make John Huges' magnum opus.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Great acting, believable and relatable characters, and amazing character development for only a $1 million budget. Definitely one of my favorites.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "You know that movie that everyone has seen and you feel odd that you haven't seen it? This is the movie, which I needed to sit down and watch and see what the big deal was. SO I'm pleased to say this movie has it all. Yes it's simple, small, but has a huge point to make. I could relate to all the struggles and pain the characters felt. Watch it now, so you can talk about it with your friends and not feel left out now.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "Does Barry Manilow know that you raid his wardrobe?",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "This is a classic teen comedy which dissects the high school stereotypes in a brilliant entertainment.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "movie is powerful, dramatic and epic. One of John Hughes best filmes.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "One of the first teen movies to analyze teenagers rather than treat them as the brunt of bad gross-out gags and the means to cheap exploitation in movies.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Basically sums up all of high school within simply five teenagers.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "If you were a product of 90`s life, probably you will love it so much. But if you weren`t, i don`t think so.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "don't you forget about me",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Wow. And I mean wow. What a difference a couple generations can make huh? Everyone absolutely loved this movie when it first came out right? And people continue to love it today? I sure as hell didn't. I found almost nothing to like about this movie. I like Emilio Estevez. That's it. And I'll admit that some of the things they talk about (when Judd's character isn't screaming at them or acting like some escaped lunatic) are very touching and thought provoking. But I couldn't enjoy it because of one thing. It's not like the whole movie is crap, but there's one element that just drags it down so badly that I couldn't enjoy most of it: Judd Nelson. By god is his character terrible. Not terribly acted, oh no, just terrible. There's nothing to like about him, and yet he ends up with one of the girls at the end?! You're supposed to identify with him in some way, but all I saw was a serial killer/ abusive husband in teenager form. If he said or did half the things he did in the movie today he'd have already been in juvie the moment the movie started. But no, he's the 'lovable criminal' who's just 'misunderstood' and needs a ' little bit of love' to set him straight. Bullshit. Maybe I missed something, but he just ruined the entire film for me. He just was far too outlandish and cruel. I never had an inkling to see this movie, but it got turned on somehow. I'm sure there's some likeability to it, but I couldn't get past the glare of Judd Nelson. Sorry.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "I'm not a fan of coming of age movies, but The Breakfast Club is just too thoughtful, sweet and emotional to resist.",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "(Quick Review)\r\n\r\n\r\nThis is one of the best teen flicks you will ever see. The Breakfast Club presents teenagers from all corners of the social spectrum trapped together, who only reach an understanding of one another during an 8 hour Saturday detention. The criminal, Jock, Prom Queen, Weirdo, and Geek establish in just a few hours that their social standings in high school aren't as rigid and unyielding as they initially thought. Situated in the largest high school library that I have ever seen, the students are supervised by the anally- retentive teacher. He manifests all of the blatant and frequently damaging stereotypes which adults project onto teenagers. The performances from all five delinquents culminate in an exuberant weed smoking session followed by a touching denouncement, establishing their similarities as human beings and teenagers. Their gradual revelations ground commonalities and begin to break down each of their personal barriers. The film produces moments of charm, when princess Claire gives the weirdo a makeover, when brainy Brian reveals his attempted suicide, and when the theatrical Bender re-enacts a typical family scene. After struggling with social standings, divisive homes and the fear held by us all: that we'll become exactly like their parents they turn to the question of whether this bizarre Saturday experience can unite them when they return to school on Monday morning. The Breakfast Club  may not offer its audiences anything ground breaking or new, but it does remind us of our own High School experiences and of the pressures put on by ourselves and adults into maintaining an \"image\". Stereotypical characters break stereotypical boundaries confirming what we've all known and experienced before, being a teenager seems unfair at times.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "It's an exceptionally broad achievement in making such a moving film with only one setting, a handful if actors, and no special effects. The message is strong and moving in both directions, dramatic and humorous. Each actor is solid in performance and contributes to the gripping truth of high school drama.",
            "review_date": "2014-05-27",
            "source": "rt"
        },
        {
            "content": "A bit slow, but gets the point across.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "+ timeless, legendary\n- that I can't 'watch it again for the first time'",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club, with it's very simple plot, stereotyped actors and almost play like set, has no where to hide. Saying that, The Breakfast Club provides light and heartwarming entertainment and manages to explore these stereotypes and develop the characters throughout the Saturday Detention. The Breakfast Club has set itself in the 80's decade for a reason (though the costuming and the music) and in even in 2014, that stuff holds up and the stereotypes rain true all this time later! (8.5/10 or A-)",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Best coming of age flick plus great music",
            "review_date": "2014-05-23",
            "source": "rt"
        },
        {
            "content": "It's remarkable how adults do not respect the complexity of children.",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "The Breakfast club uses absolute stereotypes to illustrate a reality still present in current High School life: Social Pressure, loneliness, marginalization, family troubles...  Each Character embodies a category of student and reveals how can the education of parents become the roots of exclusion and self-rejection. A deep analysis of adolescence towards a bunch of young and talented actor. Some funny situations and conversations are a real entertainment to witness. In term of cinematography I didn't notice any noticeable pattern, here the content seems more important than the shape but really good soundtracks to bring strength to those teenagers' rebellion! Definitely a classic in which the meanings are still topical, 25 years after.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Great John Hughes classic has tons of f-bombs. Ages 15+",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "I never care much for teen angst, even if I currently am one.  I can't imagine high schoolers talking about their problems like this to each other when they're not even friends.  And the ending should make you roll your eyes...",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Don't you forget about me...",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Excellent symbolism and a very thematic portrayal of teenagers that refreshes the worn out ideas around high school cliques, and presents it in a way that is moving, simple, and powerful.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club has to be one of the best films of the 80s. It has heart and soul paired with an unbiased perspective on each character equally. The script is perfection, never stumbling and always focused. John Hughes' film is surely an American classic.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "John Hughes is the king of the quintessential high school flick, but this modern classic critique of American teen culture might just be his masterpiece. It may be dated, dialogue-heavy and theatrical, but even to this day, The Breakfast Club blows teen psychology wide open, giving us the ultimate high school psychodrama: a house of cards precariously propped up by adolescent angst and pubescent preconceptions.\nGoofy 80s charm swings in full force throughout, yet the films graceful balance between zany entertainment, sincere reflection and animosity of character offers a portrait of teendom set to forever remain original, raw and unforgettable. One of cinema's true greats.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club has some flaws, and is overrated, but it's enjoyable and full of heart.",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "We are not so different after all.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "88%\nA charming and hilarious classic 80s movie.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "What can I say? It's a classic.",
            "review_date": "2014-05-07",
            "source": "rt"
        },
        {
            "content": "Finally watched after many years of not understanding references from other films and/or TV shows",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "silly at times, but hard not to enjoy. Years later and this film is ageless.",
            "review_date": "2014-05-06",
            "source": "rt"
        },
        {
            "content": "A must-see. The Breakfast Club demonstrates teen angst at its finest. It's a movie that everyone will be able to relate to in some way (whether you're a brain, an athlete, a basket-case, a princess or a criminal). It's hilarious and it's moving.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Un ovni sorti en 85, entre comedies et films d'action, ce film tranchait. Reflexion sur les relations entre ados. \nHuit clos oblige, tout est concentre sur le dialogue et l'interprÃ©tation. \nAujourd'hui, je doute que les jeunes ados s'y retrouvent.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "\"I could move out to the left for a while, I could slide to the right for a while, I could get up and back right on track!\". Ladies and gentlemen, \"Right on Track\", by the one-hit wonder band Breakfast Club, which didn't get an album out until two years after this film, but formed before the film and is therefore the original. I'd be tongue-in-cheek here and say that it's a shame that people forgot about them, but that Breakfast Club probably should have tried to get a movie deal, because Simple Minds probably would have been forgotten if it wasn't for this film. Don't you children after the mid'80s dare tell me that \"Don't You (Forget About Me)\" didn't play a big role in your teen years, because it went on to be everyone's senior anthem, including - you guessed it - mine. I for one would have voted for Billy Joel's \"Vienna\", but the kids wouldn't have gone for that, as it's a little too bittersweet of a coming-of-age ballad... as opposed to this film, which is consistently upbeat and fun. Well, retrospect at least makes the film kind of sad, because the careers of the Brat Pack members featured in this film didn't really go as far as many had hoped, kind of like the careers of Brat Pack members in any film. Sorry, kids, but if you're going rip off the Rat Pack, don't expect to make Frank Sinatra money, and just worry about making a good movie, like this one, which isn't to say that you can easily forget about this film's flaws.\r\n\r\nLabeled a comedy-drama, this film, as quite decidedly John Hughes' heaviest film, is much more dramatic than anything, yet it does have a tendency to lighten up, perhaps too considerably, with fluffy elements of humor, or at least lightheartedness (Perhaps Keith Foresee's score a touch too funky), that defuse some dramatic momentum. More detrimental to momentum is, of course, an unevenness in pacing, a more serious issue that incorporates a few lively spots to break up the monotony of the dominant thoughtfulness that, while effectively compelling on the whole, goes so padded by repetitious material in John Hughes' scripting that the thoughtfulness often runs out of material to draw upon as subtly lively. Being backed by a minimalist narrative, this film's runtime of almost 100 minutes is questionable, and you feel most every step to that point through draggy written storytelling and often limp directorial storytelling, until the film is rendered a little dull at times, yet still too tight for exposition's sake. An extensive character study, this film has plenty of expository depth, which unravels very slowly, thanks to immediate development's being lacking and gradual characterization's being too steady for you to get a quick grip on the depths of the characters who feel stereotypical before they feel layered in this drama which rarely loses its superficiality. There's a lot of genuineness to this coming-of-age drama, but it's primarily found in Hughes' tasteful direction, which cannot completely overshadow the histrionics within Hughes' scripting, whose unsubtly cheesy spots in dialogue and moments of melodrama thin the genuineness of the final product, ostensibly in an attempt to flesh out tensions more than they ought to be fleshed out in this narrative. Set during a single day in an isolated school environment, this film's story is certainly heavy enough to be interpreted into quite the rewarding affair, but at the same time, it's minimalist in dynamicity, and that limits a potential for momentum that goes further retarded by all of the aforementioned lapses in realization in tone, pacing, development and dramatic genuineness. The final product could have slipped into underwhelminginess, but in the hands of a filmmaker beneath the abilities of John Hughes, who proves to be inspired enough to craft a rewarding final product, whose compellingness can be traced back to the very story concept that I just described as a touch too minimalist for its own good.\r\n\r\nYeah, not a whole lot goes on in this narrative, even on paper, as it's simply set within a limited space and a limited timeline, but at its core, this story of comradery and self-discovery is very worthy, both thematically and dramatically, with a potential that has be explored pretty deeply in order for thorough engagement value to be sustained. John Hughes, as screenwriter, shakes engagement value with many a lapse in subtlety, but more than that, he secures it pretty firmly, with fair wit and audacity to what humor there is, and deep, if belated exposition that takes you into the heart of this layered character study, almost as much as the portrayers of the memorably well-drawn characters. In a drama this minimalist, performances can go a long, long way, thus, despite some limitations in acting material, most everyone delivers, with Paul Gleason, as an antagonistic assistant principal who represents oppressive emphasis on the flaws of stereotypical protagonists, and has his own personal demons to come to terms with, convinces, though not as much as the young leads, as Ally Sheedy captures the quiet nervousness of the \"basket case\" role, and Molly Ringwald captures a sense of uncertainly of the spoiled \"princess\" role, while Anthony Michael Hall captures a sense of alienation within the geeky \"brain\" role, and Emilio Estevez proves to be charismatic as an \"athlete\" and self-appointed voice of reason who still feels controlled, just as Judd Nelson proves to be charismatic, as well as show-stealingly layered in his portrayal of a corrupt youth, the \"criminal\" role. Really, while Nelson's performance arguably feels about as nuanced as anyone's, each performance carries its share of layers and dramatic range which transcend the stereotypes and organically sells a sense of character evolution that feels a tad forced in certain areas of storytelling, while electric chemistry sells the relationship that is just as instrumental in driving this drama's depth, thus making the final product as much a vehicle for inspired acting as it is a vehicle for inspired direction. What can ultimately make or break the full impact of this intimate drama is the offscreen directorial performance by Hughes, which alternates between thoughtful and colorful, albeit jarringly, but not to where you can disregard inspiration within either storytelling extreme, because when it comes to the color, Hughes subtly, but surely plays with stylish editing and filming enough to entertain, sometimes thoroughly. The film has plenty of entertainment value, but this isn't that kind of fun coming-of-age film that Hughes went on to do the rest of his career, relying much more thoughtfulness that proves to be kind of bland once material in Hughes' writing begins to run thin, but is primarily effective, utilizing an atmospheric sobriety that meditates upon the profound highlights in scripting and consistent heart in acting with a very human core that gradually immerses you into this intimate drama, eventually to the point of moving around every corner. The film is about as powerful as it can be, carrying a lot of shortcomings, but also a lot of inspiration, on and off of the screen, with enough heart as an intimate coming-of-age portrait that ultimately endears as a rewarding young adult drama and Hughes' relative magnum opus.\r\n\r\nWhen it's time to be dismissed, the minimalism of this narrative finds itself brought too much to light by uneven tone and pacing, some undercooked and derivative characterization, and histrionics for comfort, but through tasteful scripting, moving performances and both subtly stylish and powerfully thoughtful direction, worthy subject matter is done enough justice to make John Hughes' \"The Breakfast Club\" an effectively entertaining and moving portrait on self discovery through comradery.\r\n\r\n3/5 - Good",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Almost 30 years later",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Defining everything about friendship and the \"coming of age\" genre The Breakfast Club is an unforgettable 80's classic with John Hughes smart writing, and an unforgettable theme song",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Aside from some really bad dance montages, this has quite a lot to offer! Not sure why it's taken me almost 30 years to watch it, but it is pretty good!",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "Next time put me in sensory deprivation",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "Classic. Never disappoints you.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "The ultimate high school movie.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "What I expected to see was a poignant, heartwarming, and, charming look into the lives of teens in the 80's. What I got was nothing but a completely un-charming, unenlightening, maddening, teeth-grinding pastiche of stereotypical bullsh*t.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "An awesome movie that could be only compared to a great piece of poetry. It doesn't matter who you were during young hood, but you are going to find yourself here.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Fairly good acting in a classic 80's film, that forces 5 teens from different social statuses to talk about their differences. One of the best high school 80's films for sure.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "Hard to get into. But once you do. You're hooked.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "the best movie is this if u dont rate this movie five stars you will die",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Um clássico filme sobre adolescentes dos anos 80.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "John Hughes' coming-of-age classic is engulfed with brash stars (Estevez, Ringwald, Nelson, Hall, Sheedy) in their most pristine and memorable roles. The Breakfast Club is witty, hysterical and impacting with its in-depth portrayal of high school teenagers in the 80s. The film is heartfelt and is a great motion picture for generations of then, now and the future. 5/5",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "So as someone who has just left their teens years, I can see how this film has at least one character every teen could relate to. However, I don't see how this film has any life lessons anyone could relate to. (Spoilers) So the moral of this story is if you want to get a girl you should say horrible things to her and treat her like crap, or she has to get a makeover by the popular girl before she can be worthy? I don't think so. I frankly do not see what the fuss is with this film, it seems very slow and just jumps around randomly between funny and serious scenes. So on the whole a slow film that leads to an unrelatable and immoral ending.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "An essential coming-of-age story and deep characters study with an optimistic look at diversity, identity, and togetherness in teenagers.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "Best movie ever! Perfect in every way!",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "In my opinion the greatest teen movie, The Breakfast Club transcends it's competitors with its well fleshed out characters and realistic conversations. The characters in this movie are timeless and will probably speak to every generation the same. It's the kind of movie that you'll want to watch more than once.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "I truly believe you could watch this movie at each stage in your life and find something new. When I watched this as a high-schooler, I probably related more technically because I was going through it, but even now, almost ten years later, the primal challenges of growing up in a caste system devised by the minds of puberty-stricken adolescents still ring true. We all have troubles with each other and our parents. That never changes. John Hughes, one of my favorites more and more as I grow older, tapped into something very basic. As kids, we want to be like our parents. But we also want to be cool, accepted. In short we want love from anyone we meet. We want recognition and affirmation. When our parents can't deliver, we turn to our peers and thus blossoms the classic stereotypes of princess, jock, criminal, brain, and basket-case. All of us have little pieces of each of these inside us. We also have two more that sum up our lives: saint and sinner. Hughes commands great performances from actors who shine at young ages in beautifully capturing what it's like to have an image and have something real underneath. Does this mean parents are bad? High school sucks? No, it means life is hard but worth it. While I don't think everything in this movie is perfect, it perfectly bottles the storm. Watch this movie, then wait ten years and watch it again. It will bring things to mind that were buried deep. It will spark conversation that will breathe new life in someone or something. It will be worth your time every time. Plus it's funny.",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "Funny and original, its no wonder this movie is still remembered today.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Vi esse filme há anos e pouco me lembrava. Sabia apenas o achava genial. Revisto em blu-ray e é apenas um bom filme da década de 80. Vale mais pela nostalgia da época e só.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "classic....great movie for teens and older",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "This is what is was like at high school for just about anyone!  watch it - You'll love it and the soundtrack is one of the 80's best!",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "The breakfast club is a buildungsroman of five high school stereotypes who figure themselves out that dull Saturday when they meet each other in detention. Brilliant acting by the star cast; the last scene where they are sitting on the floor and discussing what they did to get in here is pretty interesting.\n\nGood work in showing how family and parental influence affects children; the peer and parental pressure and \"image\" that directs their lives, and others'. Sexuality, grades, friends, fighting parents- everyone's life juggles between these and they come out of the detention room with an essay telling 'who they are'. It is not an emotional or nostalgic movie, and is a fine watch, but won't make you reaching out for tissues, reminding you of your school times. Written and directed by John Hughes, it is a clichéd story, but a good critical reading into the mindset of children. \n\nMy favourite line from the movie, with which I cannot agree more: \"We're all pretty bizarre. Some of us are just better at hiding it.\" One-time watch, for being a movie produced in 1985, and still gaining new viewers like me:p",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "Not bad, but it isn't my favorite teen movie.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "\"You see us as you want to see us.\" The Breakfast Club is a superlative character study of five different high school stereotypes having to spend their Saturday together in detention. An incredibly relatable and moving film about the pressures and difficulties of growing up, everyone should see this at least once in their life.\n\nAlthough The Breakfast Club is almost 30 years old, nothing has really changed with highschool. The same stereotypes, indentity problems, and social constructs still exist. Even outside of school in our adult lives we still see the cliques being formed much like we did in highschool. I believe that everyone can watch this movie and relate to one of the characters, or maybe we simply see a little bit of ourselves in each one. For me it stirs the thought, what if we could go back and do highschool over knowing then what we know now? Seeing how petty and how much we lacked understanding of one another at a time we should have banded together. Then again, we still see many of the problems from high school in adulthood. \n\nWhere this film exceeds is in it's exploration of each highschool stereotype, the jock, princess, nerd, rebel, and weirdo. While they are very generalized labels, there is a lot of truth behind them and I believe we can all relate. What you see on the surface of these characters, much as in life, is not who the person really is. \n\nThe characters all start out more or less hating each other, separated to their rightful label and world. As the movie progresses they interact more and get to know each other, their personal lives, and driving factors as to why they are the way they are. It is in this interaction that these five generalizations find out they have more in common than any of them would have ever thought, each one fighting a personal battle on the inside that no-one else can see. This is where the movie makes you think about the people you know or have known and wonder just how much you really knew them, or maybe that one person from your past that you wish now maybe you had been more understanding of. \n\nSure you can look at The Breakfast Club for it's face value as a teen drama that is superbly acted and exceptionally written, but the point is to make you think and realize that we aren't so different from one another. At the end of the day we all settle into our groups where we feel most comfortable and accepted but we should not forget that we're all battling with something, and each one of us deals with that in a different way. Be more understanding and inviting of others, break out of the social prisons we have constructed for ourselves, these are the lessons that should be taken away from this excellent piece of cinema.",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is a legitimately funny and legitimately heartfelt comedy that helped defined the 80's.The  key to this movie is it's characters all of which are very well realized and flawlessly executed. I didn't expect much from the acting, but each actor managed to surprise me in quite a good way. The Breakfast Club is a classic comedy that will stand the test of time. 4.5/5",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "Obviously a rewatch for the millionth time, but still as brilliant as ever.",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "This is a coming of age cult classic that has that 80's charm to go with it. What we have here are 5 high school kids spending 9 hours of their Saturday in Detention in the Library. All of these kids are meeting each other for the first time (and hopefully not the last) and they all seem to have nothing in common. You've got the Jock, played by Gordon Bombay er I mean, Emilio Estevez who's not as arogant as you would expect a jock to be. This jock is pretty likable and means well most of the time. Then you've got the criminal, (played by Judd Nelson) To me the crime he commits here is darn near stealing the show in the beginning. He often does this by being rather confrontational. The most mysterious of the bunch was the Basket case played by Ally Sheedy, who I think said the least of the bunch, but still makes an impression. The Other two, Brian (Played by Anthony Hall) is the brainiac of the bunch, and Claire (Molly Ringwald) is the princess of the bunch. Through a little soul searching and getting to know each other they find out that they have more in common than they think. However, it does not take much soul searching to know that one other thing these 5 have in common is their dislike towards the rather villainous principal played by Paul Gleason. This man keeps these 5 in one room and has them stay in one spot the whole time. (or so he thinks) I personally wouldnot expect 5 kids in detention to simply stay where they are, and when you leave the room, ANYTHING can happen. This whole movie takes place in the school where these kids (The Breakfast Club) spend their time learning more and more about each other, themselves, and of course, have some fun in the process. I recommend this film as a 1980's coming of age cult classic.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "ð?\nAs the collective whole of thoughts that anyone who ever was a teenager in high school would understand, The Breakfast Club, even as old-fashioned it might be, depicted the simplest truth buried underneath the complex hierarchical mechanics in most high school teenage stereotypes: We are all basically the same, even if we come in different shades. \nMe, as the basket case I am, profoundly liked this movie.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "My Favorite John Hughes Film",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "My Favorite John Hughes Film",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "My Review: 9/10\nDate: 3/21/2014\nThe Breakfast Club is a classic.  I hadn't seen it in a long time but it aged surprisingly well.  It's still a good depiction of the tribulations of high schools and cliques.  Some of the music and dancing was a bit dated and cheesy, but overall the heart of the movie stayed true.  It has tons of great quotable lines too.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "The greatest teen film ever made, and it holds up to this day. Great acting and a great script, this is a powerfull film that should be on any serious movie watcher's list.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "Um dos melhores do John Hughes. Assistam!",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Another of the great movies of my senior year...1985.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "Possibly the quintessential coming-of-age film in history. Its charming and funny and plays on stereotypes to address a lot of questions that are posed by going to high school.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club focuses on the clichés of every high school in the 80's, but it uses them to its advantage in this social drama. The dialogue is fresh and sharp, and many a memorable line can be quoted from this movie.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "A film I knew I would eventually have to see. Well I finally bit the bullet and you know what, it's actually pretty damned great. John Hughes has always been the master at creating realistic yet wildly unrealistic films. Here, he paints a portrait of five very different high schoolers (a jock, a basket case, a prom queen, a nerd, and a bully) that are forced together on a saturday for detention and as the hours tick by realize that it's their differences and their problems that unites them. A great film about high-schoolers, and it's realistic about problems high schoolers face. Is it realistic to think that all of these people's problems could be solved after 8 hours? Definitely not, but when all is said and done The Breakfast Club is still the best hour-half plus you're likely to spend in detention. Break the rules, and join the club. (Also,imo the best character is the too cool for school bully Bender as portrayed by Judd Nelson. Everyone is fantastic in their roles as well. it's honestly one of the most well-acted films you'll see).",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Makes me feel terrible after watching it, though.",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "The Breakfast Club is one of my favorite 80s movie!  The characters in this movie are complete opposites of eachother and yet they click beautifully on the screen.  The performances are top notch and in the end, everything is tied nicely together.  The group that couldn't stand eachother, end up learning a lot about each person.  This movie was a joy to watch.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "This is the quintessential High School movie. The characters talk like real teenagers and, even though they are all part of a particular social clic, anyone can identify with them. This film is rated R, mainly for the language but besides that, this film could have easily been rated PG-13 and I think mature teenagers can handle it. This is one of the few movies that can actually make me cry, seeing as the ending to this movie is one of the best in film history, and you really grow attached to these characters during the course of the film. I can offer nothing more than the highest recommendation for this film. This is some of best that cinema has to offer.",
            "review_date": "2014-03-02",
            "source": "rt"
        }
    ]
}