{
    "rating": 9.4,
    "release_date": "1993-12-25",
    "num_reviews": 730,
    "genres": [
        "Western",
        "Action"
    ],
    "summary": "Wyatt Earp (Kurt Russell) and his brothers, Morgan (Bill Paxton) and Virgil (Sam Elliott), have left their gunslinger ways behind them to settle down and start a business in the town of Tombstone, Ariz. While they aren't looking to find trouble, trouble soon finds them when they become targets of the ruthless Cowboy gang. Now, together with Wyatt's best friend, Doc Holliday (Val Kilmer), the brothers pick up their guns once more to restore order to a lawless land.",
    "reviews": [
        {
            "content": "An All Time Classic. The acting is phenomenal overall. Val Kilmer gives one of the most iconic performances of the genre and what's more impressive is Russell is able to not be overshadowed by him either doing an excellent job balancing being likeable, charming, and a badass while never being over the top. Baxton is good and Elliott & Delaney are very good as well. The villains are good but the one thing that holds them back from being as good as their foes is they come across as very over the top and forced. I wish they would've been more subtle. Boothe comes across as he's trying to be Lee Marvin with varying degrees of success. The cinematography is excellent overall. The camerawork is amazing with tons of influence from Ford, Leone, and a overall Spielberg/Donner tone. The locations are really memorable as well never feeling generic. The special effects and action are extremely well done with the only complaint being sometimes it can go a bit over the top and feels unneeded but 90% of the time it works very well. The whole film has the look of a Modern Era big budget western done in a ungritty style. The music is amazing in this as well. The editing is very good but is the weakest part. There are certain scenes that feel unneeded like the opening wedding massacre which feels over the top and you could take out, and the film has trouble sometimes transitioning between Wyatt's Brothers, Wyatt, The Bad Guys and Doc in the first half but does a good job. There are a couple of great cuts in this and it has a unique identity of a big budget western done in a Golden Era style during ironically enough a time when the Western had faded away. This is phenomenally paced as well with great action, drama, and tension despite going over the top occasionally. And as the second half focuses more on Doc & Wyatt it never lets up. This is something everyone should check out once. this is truly one of the last great Westerns.",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites! Val Kilmer as Doc Holiday has to be one of the greatest roles ever performed",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies! ",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "Top 10 western for me",
            "review_date": "2023-03-13",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time.",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Good Western drama. Good production values.",
            "review_date": "2023-02-22",
            "source": "rt"
        },
        {
            "content": "Characters are fantastic but the plot goes down hill quite suddenly",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "First time seeing this movie and I'm 36 and all ok I say is wow wow wow wow Doc was badass in this movie def my fav character. The cast was awesome the storyline was great I see why this movie had such a high score on here I'm so glad I seen it on freevee would watch again became a big fan of this movie now I have to buy it on blu ray",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "The best western movie you will ever watch and can not be toped.",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "Narratively uneven but entertaining Western. Initially intended as a longer epic, the story strands are built nicely before its rushed final act seems to largely contain montage pieces involving Russell and his deputies gunning down the cowboy gangs. Russell is excellent as Wyatt, whilst Kilmer gives a delightfully eccentric performance as Holliday, but the love story subplot between Russell and Delany fails to catch fire. Production standards, notably the sets, are high.",
            "review_date": "2023-01-14",
            "source": "rt"
        },
        {
            "content": "This is the movie that got me into westerns. I would suggest everyone give this movie a shot. ",
            "review_date": "2022-12-24",
            "source": "rt"
        },
        {
            "content": "Best western movie of the last 40 years hands down.",
            "review_date": "2022-10-29",
            "source": "rt"
        },
        {
            "content": "This is simple TOMBSTONE IS ONE OF THE BEST MOVIES EVER MADE.  For sure it is the best western ever made.  Kurt Russel, Val Kilmer, Bill Paxton, and Sam Elliott do a fantastic job.  Powers Booth was great villan.  If you haven't seen this movie, you can not call yourself a movie buff.",
            "review_date": "2022-09-18",
            "source": "rt"
        },
        {
            "content": "Val Kilmer and Kurt Russell are masterful in this intense, thrilling western that will live on in film history.",
            "review_date": "2022-09-16",
            "source": "rt"
        },
        {
            "content": "Great movie, it has everything....",
            "review_date": "2022-09-15",
            "source": "rt"
        },
        {
            "content": "Loved this movie when it came out, and love it to this day. Please don't take my word for it, just give it a watch. (also, Val is awesome!)",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "This is a very good character driven western film. It features a good cast, lots of tense moments, good camerawork/cinematography and decent visual effects. There are plenty of action based scenes - fights/shootouts and the like but there are also scenes inbetween that help show the quieter side to different characters nature.\n\nIt's a little cheesy but its certainly worth seeing, if your a fan of biopics/character driven westerns, so yes I'd recommend it.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "3 years ago- With a career making turn from Val Kilmer, Tombstone cements it's place in the Western genre with action packed gunfights and brotherly drama.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "This. Is. The. Greatest. Movie. Ever. Made. Literally every single actor nails every single role. Not one of them phones it in, but Val Kilmer is without question the indisputable champion of any role played by any actor at any time in the history of entertainment. The sound. The lighting. The camera work. The editing. The dialogue. The story. The characters. The historical significance. Absolute perfection and every film maker should hope their work is half as good.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Some of the scenes and dramatically spoken lines can be a bit corny.  It's Val Kilmer's performance as Doc Holliday that makes this film worth watching again and again, and become a source of quotes.",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "My all-time favorite Western.  Kurt Russell as Wyatt Earp turns in a strong performance, but Val Kilmer as Doc Holiday steals every scene he's in.  So many great lines in this movie.  Very nearly the perfect Western.  Michael Biehn as Johnny Ringo is also well-performed.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "Oh my, where to begin? How about the cast? You have peak Kurt Russell, Bill Paxton and Val Kilmer. Sprinkle in roles with Sam Elliott, Michael Biehn, Powers Boothe, Thomas Haden Church and Charlton Heston (also Michael Rooker) - the movie has great pace, good suspense and executes well on the story. The is one of the first western's I really enjoyed watching and would highly recommend if you haven't seen it.\n\nSide note: Two Deadwood alums were in this movie with Paula Malcomson and Powers Booth. Deadwood being one of my top 5 shows of all time.",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "The best movie ever made!",
            "review_date": "2022-08-02",
            "source": "rt"
        },
        {
            "content": "Great Western. Val Kilmer rules!",
            "review_date": "2022-07-30",
            "source": "rt"
        },
        {
            "content": "Favorite country film of all time.",
            "review_date": "2022-07-21",
            "source": "rt"
        },
        {
            "content": "Definitely won't go down as my favourite western...but it was a well designed movie...Val Kilmer as doc was particularly impressive.",
            "review_date": "2022-06-13",
            "source": "rt"
        },
        {
            "content": "Tombstone is the most \"Hollywoodified\" Western I have ever seen, and I'm not saying that as a bad thing. Examples include, but are not limited to, Wyatt Earp (Kurt Russell) stumbling into the pouring rain with his brother's blood coating his outstretched arms, Wyatt Earp going full Leroy Jenkins out into the creek during a gunfight (I actually hated this part), tears shed as one friend visits another on his deathbed, long gazes between forbidden lovers, the Robert Mitchum narration, the four horsemen riding side-by-side through the plains, the end credits, the score in general, and lots of shoot 'em up violence. This, of course, also includes some excellent quotes, \"You gonna do something or just stand there and bleed?\" \"You called down the thunder, well now you got it!\" And most notable, \"I'm your huckleberry.\" Gosh dang does owning a saloon on the main strip of a frontier town look fun (drinkin', gamblin', smokin', prostitutin'), except for the frequent gunfights and fear that the consumption might take hold. Val Kilmer as Doc Holliday is one of those roles that seems to teeter between Oscar and Razzie, but by the end credits, it's definitely the former — perhaps a little hyperbolic, but you know what I mean. It's the accent that bothered me at first. I suppose we wouldn't know what Doc Holliday actually sounded like, but it gave off \"The Duke\" (Richard Roxburgh) in Moulin Rouge! vibes. Kurt Russell as the legendary Wyatt Earp is the draw here and I just cannot get enough of his voice. He's Old West American brawn to the max and when the ass-kicking starts the movie really takes off. *Side Note* Has Sam Elliot aged at all? He looks the same in 1993 as he does in 2018's A Star is Born — must be mustache magic.",
            "review_date": "2022-06-01",
            "source": "rt"
        },
        {
            "content": "Really competent modernish made western film with a great casting. Only thing that felt a little bit unnecessarily cheap was some of the quick cuts to when they go hunt down the bad guys. I bet most people really like that part, but I felt like it could've been more deliberately constructed during that sequence. Otherwise very good western and definitely worth the watch.",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "Loved the movie really loved the whole thing!",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Love everything about this movie. Val Kilmer is a legendary character in this. ",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "Tombstone is one of the best westerns I've ever seen, with great performances by Kurt Russell and Val Kilmer.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "Just a great Western. From start to finish great actors with a great script with amazing set pieces and a great director. When you have the best people for the job the film is amazing.",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "All time favorite movie, best Val Kilmer and Kurt Russel movie by far",
            "review_date": "2022-01-24",
            "source": "rt"
        },
        {
            "content": "A good western drama should almost make you feel the smell and taste of dust, sweat, gunpowder and whisky, and Tombstone manages to achieve this. The film also has a balanced combination of realism and western romance, with delicate cinematography and solid acting performances, where Val Kilmer as the slowly dying Doc Holliday stands out.",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "Kurt Russell and Sam Elliott give very bad performances in yet another version of the shootout at the OK Corral.  The best version is the one in the Star Trek episode.  Big production values can't save a grandiose script full of superficial and uninteresting characters, as well as a slow and meandering story.  And then there's Kurt Russell's acting, which is like a .45 caliber slug into the heart of this movie.  Massively overrated film.",
            "review_date": "2022-01-13",
            "source": "rt"
        },
        {
            "content": "Val Kilmer should have won an oscar for his performance in this. Rewatching just for his performance alone. but the entire movie was great.",
            "review_date": "2021-12-21",
            "source": "rt"
        },
        {
            "content": "What an amazing, wonderful, testosterone-infused adventure. I had so much fun watching this movie and cheering. Absolutely amazing and some of the greatest dialogue of all time!",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "This movie has become a classic. It is the movie to which all modern western's should live up too. Amazing performances, quotable lines, and awesome action. The script is well written and very close to Wyatt Earp's story. A far better movie, compared to the Kevin Costner epic.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "Great characterizations of the Earp brothers and Val Kilmer carries off the prize as the consumptive but still deadly Doc Holiday.  Good entertainment if you can get behind all the revenge killing.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "Two Words: Val Kilmer. He became Doc Holliday and it was glorious.",
            "review_date": "2021-09-08",
            "source": "rt"
        },
        {
            "content": "Got overhyped on my tiktok for you page. Not bad but won’t be rushing to rewatch any time soon, it was alright.",
            "review_date": "2021-09-01",
            "source": "rt"
        },
        {
            "content": "A fun and enthralling western with a great cast.\n9.1/10",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "i could not believe how many famous people are in this movie!! haha, every time a new character came into view i'd point & yell \"hey that's [enter name here]!\" - was kinda fun. i also can't believe it took me this long to see it. it's a pretty good movie; I enjoyed it a lot. would recommend to anyone who enjoys westerns.",
            "review_date": "2021-08-15",
            "source": "rt"
        },
        {
            "content": "Would've benefited from a tighter script and more serious direction. As it is, it's an entertaining, slightly cartoony flick.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "Even if you don't like westerns this is still a good movie. A must watch. Val Kilmer still deserves an Oscar for this role",
            "review_date": "2021-08-13",
            "source": "rt"
        },
        {
            "content": "Just an amazing movie with a great story!",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "This may be my favorite movie of all time. Val Kilmer delivers one of the most memorable performances in movie history. You will find yourself quoting him constantly. A must see for anyone.",
            "review_date": "2021-07-23",
            "source": "rt"
        },
        {
            "content": "The clever editor would be best served by taking the intrinsically, better parts of it's  competitor \"Wyatt Earp\" and some of the wonderful nuance of this movie. It would probably stand the test of time, as the best OK Corral movie ever made.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "I really liked the movie, Val Kilmer was great!!",
            "review_date": "2021-06-09",
            "source": "rt"
        },
        {
            "content": "Enjoyed the movie a lot, mostly liked it for Kurt Russell's role, Val Kilmer was decent but the plot and way it was shot was great too.",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "Tombstone is a bombastic mess of a movie with a mediocre script that unsuccessfully attempted to be both old-fashioned and modern. There are way too many shootouts in this action-heavy movie and the pacing and structure are all over the place. The acting ranges from believable to over-the-top. The highlights are the romantic elements, the cinematography and score, and the very strong characterization of the main players.",
            "review_date": "2021-04-13",
            "source": "rt"
        },
        {
            "content": "I do not believe that there is a better western out there. Yes, I said that.",
            "review_date": "2021-04-11",
            "source": "rt"
        },
        {
            "content": "I'm not even a fan of westerns really but will watch this every time it is on. Great cast, great performances.",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "It’s a mustache western with a 90’s feel. It gets better once you get to the second half when it’s about revenge. Really good acting and the bad guys are set up as scum really well. Stuff that hasn’t stood the test of time is the excessive corny western underscoring, the corny love story, and the mustaches. Great lines from Doc Holliday, and some from Earp. The ending is one of those lame ones that just lists one or two sentences about what happened to all of the main characters.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "Absolutely great movie.\nAll the actors were wonderful. ditto direction, cinematography.\nVal Kilmer shd receive awards for his portrayal of Doc Holliday.!\n\nHighly recommended.",
            "review_date": "2021-03-22",
            "source": "rt"
        },
        {
            "content": "Possibly the best western ever made. Dozens and dozens of quotable lines. Terrific acting. Terrific costumes. Terrific music. Terrific everything.",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "Very charismatic actors!",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "OK, after reading the so-called experts' mostly negative reviews of this gem of a Western, I'm convinced that I love everything they hate and I hate everything they love. How can these sad-sacks poo-poo a movie like Tombstone? Most fans agree that Kilmer was robbed of an Oscar nod (didn't even get a nomination!). Kurt Russell was deliciously intimidating as W Earp. The romantic sub-plot balanced the harsh scenes without detracting from the main thrust. This is one of those movies that I'll drop everything to watch whenever it pops up in my channel-surfing. Movie critics? Bah humbug! I'd rather know what normal people think.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "Sure it's plenty silly at points and its overall plot can be extremely scattered. But as an old fashion, shoot em up western it's dam good fun!",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Yeah, I know I am 28 years behind in making this comment...but this movie is the BEST.  I will forever claim this movie in my top 5.  The acting is great, the story moves quickly, leaving the audience engaged from start to finish, and I find myself really caring about the characters.  Top notch western that will stand above most, for years to come!",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "Every single actor brings their A-game to this piece of cinematic perfection.",
            "review_date": "2021-01-08",
            "source": "rt"
        },
        {
            "content": "A large number of stellar actors all cleverly disguised by moustaches and hats.",
            "review_date": "2021-01-03",
            "source": "rt"
        },
        {
            "content": "6 bags, we checked ourselves for exit wounds after the thing was over, geeez how intense! It was a great Xmas movie to (PCC: WW84, where there's a Xmas scene tacked on at the end 'cause the release day is on Xmas, and your family is fighting and you're at home after an awkward family get together watching it drunk). You probably wouldn't have the Xmas Chronicles if not for Tombstone but we didn't watch that series yet, until Next Christmas!",
            "review_date": "2020-12-31",
            "source": "rt"
        },
        {
            "content": "Great acting,  great casting,  entertaining storyline. Also well written,  well paced. Production value as good as it gets.  Memorable scenes,  Memorable lines. Great actors in their prime.  This is a must see.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "After years of hype surrounding this movie, I finally watched it in 2020. Despite it's quotable lines and iconic scenes, I just don't think it worked for me. It was like an American attempt at a Spaghetti Western, but it was just too melodramatic for my tastes.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "My personal favorite movie ever. A bit of the old \"serial\" feel, and not a Best Picture winner, but PURE ENTERTAINMENT from the first frame to the last. Isn't that what we want in a movie?",
            "review_date": "2020-12-08",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "Tombstone is not a neo-Western; it's entirely classic for the genre, but takes advantage of far more sincere writing, performances, and production quality. Bad guys are bad, their motivations are simple, and in most cases, they're just mean with no further explanation necessary. Earp and Co. have to go up against conflict on two classic fronts - the rootin'-tootin' cowboys and the foppish government system of justice. It's a formula that allows the film to cater to a uniquely American sense of a heroic figure, the independently-minded and hyper-capable individual that manages to walk the line between flipping off the establishment and preserving the public good. This movie is positively stellar in its casting, with Russell and Elliott bringing their respective mustachioed swagger, but ultimately playing second fiddle to a note-perfect Val Kilmer, who peppers the runtime with so many jeweled one-liners that he has become the unofficial star of the film in the years since Tombstone's release. It's a well-known (semi-)historical narrative, and doesn't bend any rules of the genre, but instead caters to its strengths. (4/5)",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "Most rewatchable movie all time and has the best one liners which will have you borrowing for years to come. ",
            "review_date": "2020-10-31",
            "source": "rt"
        },
        {
            "content": "Great fun with strong lead and supporting cast; good to revisit",
            "review_date": "2020-10-06",
            "source": "rt"
        },
        {
            "content": "I was named after Wyatt Earp, so it is only natural that I watch and know all I can about him. Kurt Russell really grabbed this character by the gun holster and took it home. Kurt put 100% into the character and presented him as the historic legend he was. Val Kilmer and Sam Elliot also star in this classic film and nail it. This film is a definate for anyone who enjoys westerns but also enjoys the works of Kurt Russell.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "This is my all time favorite movie. I love western movies and there's no better than Tombstone. The lines from here are timeless and we still quote them to this day more than 25 years later. Val played Doc amazingly perfect and hilarious. I'll be your huckleberry.",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "As someone who isn't into westerns I love this movie. It shows the elements of the Wild West and the infamous OK corral gunfight. And yes it may not be accurate in the sense of timing due to the fact that Morgan Earp was killed a couple of months AFTER the gunfight not like the next scene (and yes it is only a movie but I'm a stickler for timelines). It has comedy but not to ruin the plot of the movie but enhances it.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "It's a good B movie if can really funny at times and it has many memorable quotes but it's not historically accurate which is a shame but it's still a good movie",
            "review_date": "2020-07-21",
            "source": "rt"
        },
        {
            "content": "The actors are good but it plays too much with history to truly satisfy.",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "It's a good movie, with a lot of action, fine scenery, interesting cinematography and a real bunch of good actors. It never drags despite the two hour running time. Maybe it is a bit over the top at some moments but you easily forgive it, because you get enjoy it.",
            "review_date": "2020-06-24",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's Georgian Accent is worth watching anyways,",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "A mostly fictional, but incredibly entertaining retelling of the exploits of Wyatt Earp and Doc Holiday, which is given an all time great performance by Val Kilmer.",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "It has all the fun of a western with a perfectly cast Kurt Russell and an innumerable amount of quotable lines of dialogue. I just wish the last 15 minutes didn't drag like it did.",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "Val Kilmer shines as Doc Holiday!",
            "review_date": "2020-05-31",
            "source": "rt"
        },
        {
            "content": "All star, iconic cast. One of my all time favorites. Well done!",
            "review_date": "2020-05-29",
            "source": "rt"
        },
        {
            "content": "This is a fun western that I could watch anytime.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "Most under rated western ever. Fantastic and imminently quotable dialogue. Great cast and great characterizations that really drew you in. You even love the bad guys. Plot moved along at a good pace and really led to climatic showdowns. Epic score capped a great, very re-watchable movie. ",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "One of the best modern day Westerns. Legendary cast and acting and a worthy plot it does everything right. I was rooting for the bad guys but I liked it anyway.",
            "review_date": "2020-05-09",
            "source": "rt"
        },
        {
            "content": "‪A bit dull, but interesting at points.‬",
            "review_date": "2020-04-24",
            "source": "rt"
        },
        {
            "content": "Tombstone is everything a Western should be. It's simple, filled with violence & memorable characters, and absolutely BA.\n\nI'm usually not a Western fan, but this film may make me one.\n\nTombstone is a historical fiction that follows the real-life Wyatt Earp. Kurt Russell plays the role of Wyatt with flawless brilliance. The Van Kilmer as Doc Holliday? Ingenious. And the villains (Powers Boothe as Curly Bill and Michael Biehn as Johnny Ringo) were absolutely vile.\n\nIt's a great script that pays respect to its source material. There are some biblical undertones that I'm too lazy to explore in this interview. And the world-building of the Wild West was perfect.\n\nYou can watch this movie over and over again w/o losing any amount of love for it. It's that good.\n\n5/5. One of my top favorites of the genre.",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "I had heard a lot of good things about this movie for years, but I went in pretty blind other than knowing that it’s a Western. I loved the movie and I have very few complaints. The beginning was a little slow, but it needed to be slow to set up the characters and story. Once the movie gets going, it keeps going and doesn’t stop. The characters, dialogue, and story were very well-written and well-executed by the actors. I noticed a lot of lines that I’ve heard referenced in other shows and movies. The style of the movie did a great job balancing modern filmmaking with a classic western style, both visually and with the soundtrack. If you haven’t seen the movie, it’s a must-watch unless you’re not a fan of the Western genre.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "9.0/10 An all time classic and I will hear nothing else on the subject. Val Kilmer delivered an all time performance as Doc Holliday. “I’m your Huckleberry” ",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "A likable cast and more historically accurate story than past versions make this film a must watch for fans of of westerns.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "I constantly found myself wanting quicker to get to the OK Corral shoutout.  A good bit of the early movie drags on, going places where there is just filler material, and not interesting.\n \nThe style and posh are great.",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "This should be in the top ten best western movies. The suspense in the battle at ok corral and the duel between doc holiday and johnny ringo plus that scene at the saloon with johnny ringo and doc holiday showing off their skills in pistols is perfect with the movie..",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "Just an incredible masterpiece of cinema! One of the great western movies of all time hands down!",
            "review_date": "2020-02-01",
            "source": "rt"
        },
        {
            "content": "A super impressive cast with Kilmer and Russell the stand-outs. Despite a really slow and torrid opening act it really picks up the pace like a stampede when Wyatt and his crew go after the Cowboys.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "one of the greatest western films of all time in my opinion great cast great story great action awesome film and a very iconic movie quote from yours truly mr Doc holiday played by the great val kilmer im your huckleberry 2 thumbs up a must watch indeed.",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "A classic westerns one of the last few great westerns.",
            "review_date": "2019-11-30",
            "source": "rt"
        },
        {
            "content": "Best Western movie ever!!!!!!! 100% 5 stars",
            "review_date": "2019-11-30",
            "source": "rt"
        },
        {
            "content": "The best western movie i have ever seen!!",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "one of the best western ever ",
            "review_date": "2019-10-10",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's portrayal of Doc Holiday is one that will leave you fully satisfied. Kilmer and Russell taking on the mantel of the famous western duo are one of the best to ever meet the screen. ",
            "review_date": "2019-09-19",
            "source": "rt"
        },
        {
            "content": "My favorite movie! If you haven't seen it \"DO IT\".",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "I love Westerns and I love the Ok Corral story. Although Tombstone may be one the better movie adaptations from a historical perspective, I felt it came up short on too many levels. Kurt Russell's Wyatt Earp was bland and Val Kilmer's Doc Holiday is cartoonish and lacked edge. I wished Russell's part had been played by either Paxton or Elliot and I wished Dennis Quaid's Doc Holiday had been in Tombstone and not wasted in Kevin Costner's Wyatt Earp. Then, of course, there is the plotting and the script. Both could have been tighter...but the biggest weakness is the casting. ",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "Great cast. Characters believable and intriguing. Love the dialogue, especially Doc Holliday. Story line is fairly accurate, even with expected \"Hollywoodese love claptrap.\" \n",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "With a choppy story that drags on with overrated performances, it's not even great for it's genre...  I'd take \"The Treasure of the Sierra Madre,\" \"High Noon\" or anything with Clint Eastwood in it before this... Tombstone is basically Young Guns with a better cast and better costume design.  ",
            "review_date": "2019-07-31",
            "source": "rt"
        },
        {
            "content": "Best Western movie. Douglas, Kilmer, Elliott, Paxson... Best cast ever.\n\nYou tell em I'm coming and HELLS coming with me you hear HELLS COMING WITH ME.",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "It's almost criminal that Val Kilmer didn't win best supporting actor for his portrayal of Doc Holiday in this film. Also Kurt Russell, Michael Biehn, Sam Elliot,, Stephan Lang, Bill Paxton. Wow thats an A-List cast if have ever seen one.",
            "review_date": "2019-07-11",
            "source": "rt"
        },
        {
            "content": "This movie withstands the test of time. One of the all time best cowboy films, and the best take on two of the biggest legends of the wild west era. Doc Holliday and Wyatt Earp. Kurt Russell and Val Kilmer are outstanding in these roles. I recommend this film to anyone who enjoys cinema.",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time! Val Kilmer is incredible.",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "I finally watched Tombstone after hearing so much about it and it certainly lived up to my expectations. It's nothing short of a great western with solid performances. I loved the cinematography, score, costumes and production design as well as the outstanding fight choreography and stunts. Tombstone is definitely on top of the list of its genre. ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "best western made ever",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "I love this movie. I watch this probably 10 times a year. It's so well done. ",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Let me start this by saying that westerns generally are not my favorite genre (along with kung fu). There are a handful that I've enjoyed: Shane, Rio Grande, Gunfight at the O.K. Corral, Man of the West, Rio Bravo, Pat Garrett and Billy the Kid, and The Man Who Shot Liberty Valance. There are far more that just haven't done it for me, and I can't pinpoint what exactly it is that doesn't do it for me. \n\nI think Tombstone gave me something that a lot of westerns don't with its stellar cast and excellent production value. It seemed far more violent than the standard western I'm used to watching. I'm going to credit that to the fact that it's just a more modern take though. It felt at times that they tried to tell too much of a story in too short of a film (not that it needed to be longer, but maybe cut out some of the extra filler). \n\nIt has so much energy, and felt as though I was truly there, part of that had to be thanks to the portrayal of Wyatt Earp (Kurt Russell) and Doc Holliday (Val Kilmer). The on screen duo lit up every scene they were in and made the entire experience different from what I had experienced before. I would caution that this isn't for the faint of heart, but if you want a solid telling of this story, I can't recommend this enough.",
            "review_date": "2019-04-10",
            "source": "rt"
        },
        {
            "content": "Tombstone is a western based on a true story directed by George P. Cosmatos and Kevin Jarre. The film stars Kurt Russell as Wyatt Earp and Val Kilmer as Doc Holliday. \n\nThe actors in my opinion fit the characters very well from Kurt Russell to Sam Elliot as Virgil Earp. The acting is also very strong especially Val Kilmer.\n\nThe characters in which are mostly based off real people are strong and enjoyable to watch on screen. I personally really like Doc Holliday  mainly because of how is character is played out.\n\nThe cinematography is very good with some great shots here and there. \n\nThe setting with Tombstone in my opinion was very good from the way the town is to the way that the characters are in the town.\n\nThe set design and props are down to the point fitting the era really well.\n\nThe costume design in my opinion works really well with the characters and also fits the era really nicely.\n\nThe film has a very good style from the colour design to the cinematography.\n\nThe practical effects are also very well down from the shooting to the way the blood looks.\n\nThe film also has some very vibrant and fast paced action which is also directed really well.\n\nThe film also has some good and steady dialogue with a couple of quotable lines. \n\nThe film has a very steady soundtrack that fits very nicely in the background of the film.\n\nThe story is based off true life events following Wyatt Earp and his brothers leaving there gun slinger ways to make money in the town of Tombstone, but they werent expecting to run into the Cowboys.\n\nThe film also has some very good comedy especially from Doc Holliday.\n\nThe film at points also has some very good atmosphere especially toward the end.\n\nThe film also has some emotional scenes that can bring a tear to the eye.\n\nI also personally really enjoy watching the film but I can see some people who could get a little bored. \n\nThe film does have a couple things wrong with it though like a couple shots were they use slow-mo which in my opinion doesnt work with the rest of the film.\n\nOver all I give it a 8/10 - worth paying for two tickets",
            "review_date": "2019-04-03",
            "source": "rt"
        },
        {
            "content": "Tombstone is the coolest Western ever.\n\nTombstone (1993) brings creative shots from director George P. Cosmatos to tell a riveting Western story of law and order. Tombstone forces us to confront the truth that some men are so evil that they deserve to be gunned down. Likewise, Tombstone offers up a triumphant and inspiring vision of lawmen brave enough, skilled enough, and virtuous enough to do the right thing and stand up for society.\n\nKurt Russell is brilliant, in perhaps his finest role, as the legendary lawman Wyatt Earp seeking retirement and peace. Russell commands each scene and breaths each line to life with a manly confidence and undeniable power. Russell's presence is palpable as all of Tombstone's energy and magnificence starts with him. Russell plays Earp with a respectful sternness and resolute morality. He only draws his gun finally for the right cause. My god, when Russell starts killing, Tombstone's exhilarating gunfights are the stuff of cinematic legend themselves. Tombstone is truly remarkable for making the hail of bullets carry weight with consequence and purpose with each shot.\n\nSimilarly, Val Kilmer delivers his finest acting in Tombstone as the hilarious quick witted Doc Holliday. Kilmer gives a cool edge to Holliday that is unforgettable. His smooth delivery and frail visage is an intriguing pairing. Kilmer's devotion to maintaining Earp and Holliday's friendship is admirable. His gunplay is astonishing, but Kilmer's dramatic moments as Holliday are moving as well.\n\nTombstone's supporting cast is one of film's all time greats. Sam Elliott is fascinating as the stout and moral Virgil Earp. Bill Paxton is likable and endearing as Morgan Earp. Michael Biehn is terrifying as the quick draw cowboy Johnny Ringo. Powers Boothe is hilarious and fun as the sleazy killer Curly Bill. Stephen Lang is despicable as the cowardly murderer Ike Clanton. Thomas Haden Church is intimidating as Billy Clanton.\n\nThen, Dana Delany is mesmerizing as Josephine. Jason Priestley is really excellent as Billy. Joanna Pacula is really fun and lecherous as Kate. Dana Wheeler-Nicholson is great as the addicted lush Mattie Earp. Billie Zane is really entertaining as Mr. Fabian. His part during the Faust play is very convincing. Michael Rooker is great as the reformed cowboy Sherman McMasters.\n\nTombstone is so awesome that it even features a host of mind blowing cameos. Charlton Heston is nice as the rancher Henry Hooker. Frank Stallone is good as the outraged poker player near the start Ed Bailey. Billy Bob Thornton is funny as the portly gambler Johnny Tyler.\n\nLastly, Tombstone is cool enough to get Robert Mitchum as the narrator. Mitchum's distinct deep voice booms through the narration lines with ease and emotion not often heard in a narrator.\n\nTombstone is a marvelous film. Stunning mustaches, killer dusters, thrilling combat, hard hitting pistol whipping, fast horse riding, and intense mowing down of human life. Tombstone is as entertaining, fast paced, and interesting as the entire Western genre gets. Do yourself a favor and watch Tombstone immediately!",
            "review_date": "2019-03-22",
            "source": "rt"
        },
        {
            "content": "With a career making turn from Val Kilmer, Tombstone cements it's place in the Western genre with action packed gunfights and brotherly drama.",
            "review_date": "2019-03-14",
            "source": "rt"
        },
        {
            "content": "One of the best modern westerns in the last 30 years. Russell and Kilmer are superb.",
            "review_date": "2019-02-17",
            "source": "rt"
        },
        {
            "content": "Greatest film of all time with. Most rewatchable movie ever. Best one liners that don’t get old ",
            "review_date": "2019-02-11",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time. End of story.",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "Pros: High tension, a variety of well-played characters, fashionable western style and attire.\nCons: Weak and unbelievable finale.",
            "review_date": "2019-02-03",
            "source": "rt"
        },
        {
            "content": "Highly entertaining and cool action tombstone has a lot to offer",
            "review_date": "2019-01-02",
            "source": "rt"
        },
        {
            "content": "classic. val Kilmer and kurt russell hit it out of the park. the scene at the gun fight at the O.K. coral was my favorite western scene of all time ",
            "review_date": "2018-12-10",
            "source": "rt"
        },
        {
            "content": "A brilliant cast of actors portraying very likable characters and deeply investing you into the story and events.",
            "review_date": "2018-11-20",
            "source": "rt"
        },
        {
            "content": "80. The first half was much more interesting and engaging than the second half, but overall an excellent western that has an incredible cast. It's just too bad it couldn't finish what it started. ",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry! This movie is one of the best western ever! Val Kilmer's role in here is one of his best ever. You need to see this one.",
            "review_date": "2018-09-17",
            "source": "rt"
        },
        {
            "content": "Wow, the top critics have really screwed the pooch on this one.",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "Tombstone is a highly watchable and authentic modern Western.",
            "review_date": "2018-07-31",
            "source": "rt"
        },
        {
            "content": "Exciting and most accurate representation of the western genre ever!",
            "review_date": "2018-06-01",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time. Kurt Russel’s best performance.",
            "review_date": "2018-04-13",
            "source": "rt"
        },
        {
            "content": "The cast is incredible: from the main, the supporting and the minor characters; they are all played by notable players past and present.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Great western movie with awesome perfomances by Russell and Kilmor. 4/5",
            "review_date": "2018-03-16",
            "source": "rt"
        },
        {
            "content": "All around azz kicking western. Great characters, great actors.",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "Greatest movie of all time",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "I â?¤ï¸? this movie very much",
            "review_date": "2017-11-21",
            "source": "rt"
        },
        {
            "content": "One of Val Kilmer’s greatest performances. ",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "This is a very entertaining film from beginning to end. Val Kilmer, who plays Doc Holliday, give a performance of a lifetime. Tombstone does a great job of making you root for the heroes and make you hope to see the villains get what they deserve. Every actor in this movie did a great job and this film is so entertaining that you will want to watch it multiple times. You will also find yourself quoting all of the great lines in Tombstone. Do yourself a favor and watch this movie!!",
            "review_date": "2017-09-19",
            "source": "rt"
        },
        {
            "content": "One of the best westerns ever.  All-star cast that perfectly painted a masterpiece.",
            "review_date": "2017-08-22",
            "source": "rt"
        },
        {
            "content": "Western about a society that is besieged by outlaws and the 4 lawmen who take up arms to protect everyone. Very much a good vs. evil movie set in the 1800's but with Hollywood action and flair. Great quotes. Great acting. Val Kilmer should have won many awards for his portrayal of Doc Holiday.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Wyatt Earp, Doc Holliday and Earp's two brothers try early retirement, but can't seem to escape the notoriety of their gunslinging past. It's a bit on the shallow, simplistic side, but machismo levels are off the charts and the strong personalities are endlessly entertaining, bouncing around and ricocheting off one another like careless lead sprayed on a dusty street. Earp gets the marquee treatment, but there's no masking that Holliday is the story's real star. Played with an overdose of charisma by Val Kilmer, Doc is a vastly intriguing character; damaged both mentally and physically, he spends the entire film in some combination of deep intoxication and sweaty near-death, brought on by the later stages of tuberculosis. Doesn't matter. He still gets the best lines, the most memorable scenes and the densest, most complete individual storyline. A staggering, winking car-wreck of a man who's simply impossible to look away from, I'd throw him up against any of cinema's all-time greats. The surrounding film is secondary. We get a heavy dose of gunfights, shady characters and gentlemen who look cool in an absurd mustache and a duster, par for the course given the era and genre. But Doc, man, Doc elevates this film from a stylish also-ran to an absolute classic.",
            "review_date": "2017-08-15",
            "source": "rt"
        },
        {
            "content": "Tombstone is a movie with excellent characters, and great action. It is a bit of a slower movie at times, but it is still good.",
            "review_date": "2017-08-14",
            "source": "rt"
        },
        {
            "content": "True classic. Doc Holiday alone is worth the watch.",
            "review_date": "2017-08-08",
            "source": "rt"
        },
        {
            "content": "Difficulty one of the best movies of both Kurt Russell and Val Kilmer!",
            "review_date": "2017-06-23",
            "source": "rt"
        },
        {
            "content": "One of the best Western movies! Love it and will never get tired of watching it.",
            "review_date": "2017-06-04",
            "source": "rt"
        },
        {
            "content": "A fun movie with good performances,(Especially from Val Kilmer). However, the performances are the only recovery this movie contains which save it from its flawed and choppy screenplay.",
            "review_date": "2017-06-03",
            "source": "rt"
        },
        {
            "content": "My second favorite Western behind Unforgiven. The biggest strength is an underrated cast and performances which I thought were spot-on. I loved the dialogue and interaction between the characters, both the good guys and bad guys. The drama and tension are drawn up beautifully in a realistic way to the climax, which is actually in the middle of the movie. The technical aspects of the filming were also handled very well. The only reason I did not give it 5 stars is the protracted ending that drags on after such a dramatic climax. This undoubtedly is an attempt to honor epic western film tradition, but I really prefer the deep, realistic feel of the first half of the film. If you like a thrilling drama built up the right way, a good cast performing at their best with excellent dialogue, immersion into a Western period piece, a good mixture of epic feel mixed with a healthy dose of realism, and gun-slinging violence then I highly recommend this movie.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "One of the best ever. Doc Holliday is played perfectly. The strain was more than he could bear.",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "the greatest western ever, end of story!",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "One of my two favorite movies ever. There are so many lines to quote you end up lip-synching the whole movie. Val Kilmer was robbed of an Oscar for his part. His role and character, Doc Holiday was one of most original in all of moviedom. He dominates every scene. I think what I like was the portrayal of the West and the characters. You get to like each of the characters, even the bad guys like Johnny Ringo, Curly Bill and especially the loathsome, Ike. The best movies have good guys you like and bad guys that are memorable. I thought the casting and acting was 100% and there are over a dozen characters that play important roles. It is a large cast for a movie. It is an old movie but one of the few I can watch over and over and often find some little nuance I missed before to enjoy.",
            "review_date": "2017-02-21",
            "source": "rt"
        },
        {
            "content": "Second to Unforgiven, it is one of my favorite westerns. The only character that I did not like was Bill Paxton.  Everybody else fell right into place, Val was on of the best Doc Holiday's that I have seen. I own the DVD",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "This film is based on events in Tombstone, Arizona (America), including the Gunfight at the O.K. Corral and the Earp Vendetta Ride, during the 1880s. It depicts a number of western outlaws and lawmen, such as Wyatt Earp, William Brocius, Johnny Ringo, and Doc Holliday. Don't take this one too seriously - it's a western with humour sprinkled in as well as drama and action.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "Tombstone is magificent the more I watch it, the better it gets.",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "I know alot of people that say this is one of there favorite movies if not there single most favorite movie.  I had yet to have seen this movie until the other night, and I now realize why it's important to have other friends that actually understand what great movies are.  Sure this is a fun movie, but it really doesn't have a whole lot of substance to it.  It was cool to find out that this movie was based on some real people and the characters were pretty cool.  It was like a western version of a team up superhero movie.  Overall, it was cool but I didn't think it was as good as other people made it out to be.",
            "review_date": "2017-01-15",
            "source": "rt"
        },
        {
            "content": "I think I've figured out the formula to making a financially successful western, you must make your characters unique enough to the point that the audience doesn't realize that all Westerns are all essentially the same thing. Tombstone doesn't do that. Everything about this movie just screams, been there done that, and even in a fun way.  Maybe this could be used as a case study for future screenwriters to know how to not due a Western.",
            "review_date": "2017-01-08",
            "source": "rt"
        },
        {
            "content": "Man, I love this movie, such a great western/adventure.  Man oh man the cast! A bit grittier nature would have perfected this, but it's still a great time. If the rumors are true, it'd fascinating to get that \"directors\" cut...",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "A movie that, from start,  to finish, captures and embraces you with a classic western story, with the proper doses of action, character development and suspensful moments, all superbly combined with the presence of an amazing cast.",
            "review_date": "2016-12-20",
            "source": "rt"
        },
        {
            "content": "uninspiring first half and ridiculous second half",
            "review_date": "2016-11-25",
            "source": "rt"
        },
        {
            "content": "This film has some amazing acting and roles, especially Kilmer. Otherwise, it's a trainwreck and I don't understand its fandom...",
            "review_date": "2016-11-08",
            "source": "rt"
        },
        {
            "content": "I can't even explain why, but this is my favorite movie of all time.  I can watch it over and over.  \n\nSome of the best quotes ever. \n\nDoc Holliday: \"I'm your huckleberry.\"  \n\nWyatt Earp: \"So run, you cur... RUN! Tell all the other curs the law's comin'!\nYou tell 'em I'M coming... and hell's coming with me, you hear? Hell's coming with me!\"\n\nBilly Clanton: \"Why, it's the drunk piano player. You're so drunk, you can't hit nothin'. In fact, you're probably seeing double.\"\n[Billy Clanton draws a knife]\nDoc Holliday: [takes out a second gun] \"I have two guns, one for each of ya.\"\n\nDoc: \"A man like Ringo has got a great big hole, right in the middle of him. He can never kill enough, or steal enough, or inflict enough pain to ever fill it.\"\n\nDoc: \"Oh. Johnny, I apologize; I forgot you were there. You may go now.\"\n\nDoc: \"Nonsense, I have not yet begun to defile myself.\"\n\nVal Kilmer is so sexy - all of the actors were perfectly cast.  You won't regret watching it!  Or re-watching it.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "One of my favorite Westerns of all time.",
            "review_date": "2016-10-08",
            "source": "rt"
        },
        {
            "content": "C+\n'Tombstone' is shot brilliantly to the point where it felt like I was watching a western from the 60's, and the performances are kind of decent all-around. The one major problem I had with this film was that its story felt like something was missing: A lot of the tension between Earp's gang and The Cowboys. It still makes for a decent Western.",
            "review_date": "2016-10-03",
            "source": "rt"
        },
        {
            "content": "Great cast and intense moments of gunfights! Kurt Russell, Val Kilmer, Bill Paxton, Sam Elliot star in one of the best westerns ever!",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "The Tombstone Vendetta, told from Wyatts point of view. The real Wyatt lobbied early Hollywood until his death to do a movie of these events to vindicate his actions that day. This looks like what he would have wanted.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "Greatest Western Movie ever.",
            "review_date": "2016-07-17",
            "source": "rt"
        },
        {
            "content": "Awesome movie. Again Kilmer is outstanding as Doc! The accent with lines such as \" I'm you huckleberry\" made him center stage.",
            "review_date": "2016-07-05",
            "source": "rt"
        },
        {
            "content": "Kurt Russell battling gunmen and cowboys, ftw.",
            "review_date": "2016-06-17",
            "source": "rt"
        },
        {
            "content": "The best western ever made.",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "The film Tombstone was based off of a historical event that happened in the 1800's in Tombstone, Arizona, but it is not meant to be seen as a documentary. The movie was made to be a western film and in order to grab the audience's attention and have them enjoy the movie as a western genre, they couldn't be focused on how historically accurate the setting of the movie was. The acting was phenomenal and has become my favorite movie!",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "A movie near perfection.  Excellent acted movie that delivers everything promised.  The only drawback is they took many liberties that never happened in real life.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "Tombstone is a very well made western featuring great performances and story. Check it out if you haven't!",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's finest role.",
            "review_date": "2016-01-22",
            "source": "rt"
        },
        {
            "content": "one of my favorite western movies",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "this movie did not get the reviews nor positive attention it deserved. \nPure enjoyment, almost worthy of classic Western status.",
            "review_date": "2015-12-19",
            "source": "rt"
        },
        {
            "content": "I'm not a big fan of Westerns, but I've grown to appreciate them more this year as I have watched several to expand my horizons.  This particular film was one that I was very interested in seeing because I like the cast.  Aside from Kurt Russell, who I struggle to accept as a period actor, the cast really delivered on what I expected.  Sam Elliott was basically born for Westerns, and I cannot believe how perfect he is for the role.  I also loved watching Val Kilmer's portrayal of the man who tries to remain strong despite his steadily declining health.  The best part of any Western, in my opinion, is when you have a good showdown, and this one gave you several sprinkled throughout the film, which I thought was a nice way of keeping the audience engaged.  In fact, pretty much everything between the Earps and the cowboys was a treat for me to watch.  What drags the movie down is the romance stuff.  I swear the only purpose in having Dana Delany in the movie is so they can manufacture a happy ending, and it's a pretty artificial and unconvincing ending, too.  I wanted more time with the Earps and Holliday, perhaps more time with the cowboys as well to establish how evil they could be, but I didn't need a second longer with the pointless damsels in distress.  Tombstone is not a bad movie by any stretch, but it could have been better with a little tweaking of the plot.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "A well-crafted and solidly acted Western.",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "Oh my...this one didn't aged very well...with all this overdrawn, papercutlike characters it's hard to bear the longer it goes...it's like one of these staged tourists shows...mÃ¤h",
            "review_date": "2015-11-21",
            "source": "rt"
        },
        {
            "content": "My dad likes this movie a lot but I'll give it another later",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "One of my old favorites",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "A solid addition to the western genre.",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "good but lengthy western",
            "review_date": "2015-10-10",
            "source": "rt"
        },
        {
            "content": "One of the greatest Western Movies of all time. There are so many one liners in this movie they are back to back. Great acting. Great acting even by the supporting cast.",
            "review_date": "2015-09-25",
            "source": "rt"
        },
        {
            "content": "It's not a historically-accurate film, but Tombstone stands as one of my favorite movies of all-time.  The cast is impeccable (Val Kilmer turns in one of my favorite rolls in any movie I've seen), the music is outstanding - if there is one problem with the movie, it's that it can't be duplicated.  There are few movies out there that I would call \"favorite\", and Tombstone definitely slots into that category.  Of course, few people going to the theater today would appreciate the movie as much as audiences did.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "One of the Best Westerns Ive seen the Cast was Great!",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "alright,  shouldn't have waited this long to watch this movie.",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "alright,  shouldn't have waited this long to watch this movie.",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "Love this movie. The sheer number of brilliant moments - not the least of which is Val Kilmer's peerless performance, make this one of the richest, most satisfying \"westerns\" I have ever seen...",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "This is a fun movie that of course takes dramatic license with history. Still, it gets enough things pretty much right.  Earp was never hit by a bullet and vendetta ride is as interesting as the showdown at the O.K. Coral. But it isn't Russell's solid performance which is memorable. In Val Kilmer's best acting performance, he steals the show as Doc Holiday.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "I couldn't figure out why I wanted to watch this movie over and over and yes, over. Sure, the writing is authentic, the casting perfection, direction amazing and of course the story is compelling in its theme but what it finally comes down to is that it's just so visually beautiful.  It's a work of art that I never get tired of viewing. The scene in the bar with the yellow flowering bush in the background, the sunlight and warm colors and the camera work from inside the doorways... I could go on and on and that's why I never tire of watching this movie.  And yes, Kurt Russell, Val Kilmer, Sam Elliott and the rest are all amazing to see and hear.  I place this movie in my top 10 for all the right reasons a movie should be in someones top 10.",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Except for its atmosphere, nothing about this movie feels genuine. \"Tombstone\" boasts underwhelming performances and bland dialogue.",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "Without Kilmer's performance this would be unwatchable.",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns!",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "Tombstone suffers from speedy scenes that tend to skip a lot of story to make-up time in in such scenes, the film loses many points. That being said, there is so much done well that it doesn't take away from the fact that this is a must-see western film. The story of Wyatt Earp is classic, Russell is great, and Kilmer steals the show. Earp is an outstanding western bad-ass thanks to Russell and it's a lot of fun to see, even if it could have been much better. (80%)",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "As corny as it is awesome, there are lines that make me say 'scheesh' as well as inspiring classics.  A few scenes make the movie and every man will be left wanting to be Doc Holliday.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "Great cast, holds up well for a film that allegedly directed itself 22 years ago.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "The audience score has it right... This film is damn near perfect",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "This movie has a lot of critical acclaim, but for all the wrong reasons. I mean the movie had an extremely huge amount of action, but at the same time had some cheesy thing's that made me laugh out loud. All in All it was a pretty fun movie to watch. 7/10",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "An epically casted and vastly entertaining western flick.",
            "review_date": "2015-04-20",
            "source": "rt"
        },
        {
            "content": "The action movie version of Wyatt Earp's story.  Way more action packed and fast paced.  Great ride through the Old West.  Kurt Russell is a BAMF.",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "Could have used more Wyatt and Doc and that romantic last ten minutes dragged on but the fight scenes and Kilmer were great.",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "great movie.  very tough and hard cast. much better that kevin costner... one of my favs...very hard movie and der on my top 20 best westerns",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Hands down the best Western film I've ever seen and will probably ever see.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Possibly the best modern western aside from Unforgiven.  Great cast highlighted by Val Kilmer as Doc Holliday.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "A fantastic film. Guaranteed rewatch!",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "One of the best Neeson movies in a long time!",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Fairly good movie with believable acting which had both sympathetic heroes and despicable villains. It has a good balance between dramatic dialog and gun fighting with all around interesting characters. The sets, styles, and wardrobe also stayed more faithful to the 1880s than many Westerns.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "83%\nSaw this on 28/1/14\nTombstone deserves praise for not sacrificing the story or true incidents for any particular character or for any stars. Tombstone has wonderful performances from Kurt Russel(his finest I have ever seen) and Val Kilmer( who mostly seldom disappoint). Since it does not alter it's original story for cliched thrills, it provides much much entertainment and quirky twists. Though, I believe that the film could have had a more power packed ending. Other than the lead characters, none of the others in the film have much to do here and all the supporting characters have poor character development, especially the women here. Tombstone leaves me craving for more and I must have to watch Kevin Costner's Wyatt Earp.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "The absolute pinnacle of movie westerns.",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "One of the better modern westerns!",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "Great movie although there were quite a bit of creative liberties taken. Still, a great performance by Russell and Kilmer. This has got to be one of the best Wyatt Earp movie I have ever watched. Truth be told, Johnny Ringo wasn't the jerk hes portrayed as in the movie. He was found dead under a tree but his boots were hitched to his horse so its thought that someone came up on him while he was snoozin under a tree and put one in his temple. Earp was never associated with Ringos death.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "At times this is a slow moving western but makes up for it with it's impressive storyline, near great gunfights and an excellent cast. It does have it's tense moments and pretty much has every clichÃ© you'd expect in a western but with a few dark humorous moments, weather this was done on purpose doesn't really matter. The film does have heart and a sense of realism and very much loosely based on a true story. Some scenes are long winded but once you get passed that, it's a good western and as I've said before...the cast are superb and a great, if a little short, gunfight. A good modern western.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "my favorite western movie ever",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "Brilliant movie. Timeless.",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "This was a fantastic Western with great acting, a pretty average story, but great costumes and direction. Val Kilmer & Kurt Russel were fantastic and the supporting cast also did a great job in this classic Western action flick. I'm not a fan of the genre, but this one is pretty interesting!",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "With excellent acting, amazing Western cinema scenery, tense moments, & a gripping story based on (mostly) true events, \"Tombstone\" serves to be one of the greatest modern Western films & one of the best of the 1990s! A great film to watch!",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "Nathalie: j'ai aime le jeu d'acteur de Val Kilmer.  A l'aube de mes 30 ans j'ai bien du voir ce film une 20ene de fois....",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "\"Nonsense, I have not yet begun to defile myself.\"",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Another Kurt Russell classic. Val Kilmer gives one of his all time best performances as Doc Holiday",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "Solid western. It seemed a little too long for the plot it was working with, and could have been a half hour shorter. Second half is very good, and there's lots of action. Worth watching once.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "A fantastic film with a strong cast (including Val Kilmer, Kurt Russell, Sam Elliot, Bill Paxton, Michael Biehn, Charlton Heston, Stephen Lang, Powers Boothe, Thomas Haden Church, Michael Rooker, Billy Bob Thornton, Billy Zane, Robert Mitchum, and Terry O' Quinn), and a classic plot. A must-see",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "The characters were engaging and captured your attention from the beginning. Wyatt was engaging and easy to relate too.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "bad writing, bad lighting - looks like 50's, missing plot lines, too many characters, don't waste your time, its just bad",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Fantasic western feel and brilliant portryal of Doc Holliday by Val.  Makeup artists nailed it and Tombstone comes out on top.  A must see.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "One of my top 5 favorite movies.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "I'm surprised I've never seen this before now honestly since it came out at a time when I was in love with Westerns...though I imagine I was a bit young to be watching such at the time!\n\nA very well shot Western with memorable characters and classic Western style.",
            "review_date": "2014-10-20",
            "source": "rt"
        },
        {
            "content": "Never watched this before, but saw it on Netflix and thought I'd give it a try. I believe it's about the best Western I've ever seen. I loved Jeff Bridges' True Grit, but this was even better.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "2 starts for Kilmer, the rest just seems like it was written- thrown in the air- then gathered what didnt blow away in the wind and try to piece together into something (and when something comes up, lets just montage that shit into 3 minutes of \"what the fuck just happened?\")",
            "review_date": "2014-10-08",
            "source": "rt"
        },
        {
            "content": "EXCELLENT JOB THIS MOVIE IS GREAT COUNTRY COWBOYS  THIS FILMS IS THE BEST..",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Tombstone stands as one of the great classic spaghetti westerns of the 90s. It has great bad guys, lots of action, wonderful sets, A-list casting, honest Hollywood heroes, and most of all - Val Kilmer is truly amazing in this film. The weak spot might be the romance subplot (Kurt Russell in general is a little off, but is a contrast to Kilmer so it kind of works). Some of the actors to mention include Sam Elliott as his usual self and never disappoints. Bill Paxton is good as well for what role he was given. Also, a cameo role by a younger fatter Billy Bob Thornton is fun to see.  Although again everyone is outshined by Kilmer as Doc Holiday and Michael Biehn as Ringo - that dueling chemistry on screen is enough to see the film alone. The music is sweeping and cinematic enough, and the set design is top notch. The shots are nice too, complimenting the same style, very Sergio Leone, but in the 90s (meaning more medium shots and medium long shots). The film also touches on some social issues like drinking with men, and opium with women during the hard days of the west to name a few, but that is fine as it is a plot device as well within the story. Unfortunately, saying that points to the main problem, that the plot does feel a little awkward, predicable, and weak at some moments. For example, some of the dialogue can be lame, but if you let yourself just go with it, I think a good time can be had for sure. Mainly because not too many westerns are made anymore, let alone good ones from that era. That said it delivers on all of the great expectations for what it is: An action packed spaghetti western. In modern times comparing it to say Django offers a unique perspective on how this film delivers today. It's not as ambitious as Django, but its a totally different story and team too. From that time compared to say Unforgiven (a realistic western), as far as pure character and story go, its not as good, but in the genre I believe it was meant to be in, it stands as a good film, and a great popcorn movie. If you liked this film, I also recommend another western from that era Quigley Down Under, it is less serious like Django, (although Django is very serious sometimes), but still spaghetti with meatballs. I rate this 4 stars because of movies like, The Quick and The Dead!  Short Review by Movie-Mike",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "This by far is the most authentic depiction of Wyatt Earp's story. I wish Val Kilmer had won those awards for Best Male Performance and Most Desirable Male Character: what a gonzo performance, Val! On my list of best westerns of all time, this is #1.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "Criminally underrated modern western. Much better than the Kevin Costner shitheap \"Wyatt Earp\".",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "Tombstone is a fairly entertaining ride and a good Western film, but not my favorite.  To be honest I'm not big on Westerns.  It's just not a genre I'm very into.  However, I'm not going to be biased and judge the film on whether it's actually good or not and whether I had a good time overall.  I know this is based off real events and the characters in this were real people but I won't judge on how accurate this film is because I don't know the real story very well.  I will say the film definitely good and I got some entertainment but, at the same time, I wouldn't watch this all the time.  One because I don't care for Western that much and, while it fun, it was also boring and poorly paced in places.  It also fakes you out too many times.  There are a few Western I enjoy.\nThe plot is as follows.  A man named Wyatt Earp (Kurt Russell), a former lawman moves into the city of Tombstone with his two brothers, Virgil (Sam Elliot) and Morgan (Bill Paxton) and their wives to settle down and make their fortune.  They also run into and old friend named Doc Holliday (Val Kilmer).  However, in the Wild West there is little-to-no order.  The sheriffs and lawmen are almost nonexistent.  The cowboys really run the show so it virtually total anarchy.  Wyatt's brother, fed-up with the lawlessness and people living in fear, become lawmen to bring order to an order-less town despite their brother's protest.  They soon realize how difficult that is.  When one of the brothers is killed and another injured Wyatt rejoins the fray, becomes a U.S. Marshall, and, with his posy, guns down every cowboy they can find. \nThe film looks good and the fight scenes are quite entertaining.  You have an amazing cast.  You have Kurt Russell, Bill Paxton, Sam Elliot, Val Kilmer, Powers Boothe, Billy Zane, Michael Biehn, and the list goes on.  I think everyone in the cast does a great job acting-wise.  I like all the main characters and though they were all memorable and badass especially Wyatt and Doc.  I loved Kurt Russell as Wyatt Earp but the one who stole the show for me was Doc Holliday.  I'm not too familiar with Val Kilmer.  I'm not a big fan of Batman Forever and I haven't seen anything else he's been in other than this film.  I though he did an amazing job in this film and Doc is the definition of badass.  Powers Boothe and Michael Biehn do good as the villains though they're not given much to do which I'll get to.\nThere are a few things I didn't care for.  This film does seem like a bit of a romanticized version of the Wild West.  It looked nice but a little too nice.  It looked too fancy for the Old West to me but maybe I'm wrong.  I wasn't in the Old West so what do I know?  There are conflicting tones in this film.  It tries to play itself very series and dark in places yet it goes very over-the-top action movie in others.  For example, there is a shoot-out near the end where Wyatt snaps and kills everyone.  That scene is so goofy that it took me out a bit.  I don't know if that was intended or if it was just the execution.  The villains are all comical too despite good performances by the actors.  \nThe pacing is to too draggy as well.  While it definitely had its entertaining moments it also had its slow and boring moments especially at the beginning.  The film is 2hrs. 10 min. and it feels like it if not longer.  There are like three or four seemingly final fights.  You have the fight in town against the cowboys.  You would think that that would be the big final fight but the film keeps going.  Then you have the big shoot-out between Wyatt and Powers Boothe's character's groups but the film keeps going.  There are two more seemingly final confrontations after that.  It didn't seem like the film knew when to end.  However, most of the fights were enjoyable.    \nThe villains are nothing.  The actors and their performances make them a bit more worthwhile but ultimately they're forgettable.  The villains are built-up throughout the entire picture, but, at the end of the day, they just couldn't compete at all.  They aren't, at all, interesting either. \nOverall, Tombstone is a good movie.  Half of my complaints are really minor grips.  My lack of enjoyment in some areas could be due to the fact that I'm not a big fan of this genre of film anyway.  If you like Westerns then you should definitely watch this film if you haven't already.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "Great movie in spite of cheeks russel",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "A film I have been meaning to see for years and finally got around to seeing....and thankfully I was pleasantly surprised.\n\nThe fictionalised account of Wyatt Earp & Doc Hollywood filled to brim with testosterone & gun duels but it's popcorn film at its heart.\n\nVal Kilmer was a standout & it's always great viewing a western that has a strong story. It's a great watch....",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "My favorite western of all time. Val Kilmer is awesome as Doc Holliday.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "\"Witty dialogue, intense showdowns,  and powerful performances by its talented cast (including Kurt Russell) makes Tombstone an entertaining but a \nmore mature Western\"\n\nwould be my consensus, since the site does not provide one for this.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Some great figures! Some great acting all around! A story that doesn't veer to for off from the the truths. Tombstone is a classic in my book",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever...just for Doc Holliday alone!\n\nI still quote this movie, and it will always be one of my favorites.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "Great movie, I must of seen this film over 100 times. Great acting based on a true story and this movie gave us some great quotes, clearly Kilmer's best work ever.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns of all time. Val Kilmer is perfectly quotable throughout the movie. For a genre that has been, for the most part, dead for a couple of decades, Tombstone breathes new life and causes us to remember why westerns are so great in the first place.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Val Kilmer single-handedly elevates this film from good to great.",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Outstanding.The Best Western Movie Since The Dollar Trilogy.Kurt Russell And Val Kilmer Are Terrific Together.B+",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "Great flick! Val Kilmer's best!",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "My second favorite western (first being Django Unchained.) This has a great cast, great performances and great action scenes. It has some of the most memorable lines and its an amazing movie overall.",
            "review_date": "2014-07-12",
            "source": "rt"
        },
        {
            "content": "I am a big Kurt Russel fan!  Kurt Russell's interpretation of Wyatt Earp  as a man of action, resonances with the viewer.  A man who kept his word and did as he said.  (a quality I admire)  Val Kilmer's interpretation of Doc Holliday, a man, with a death wish who had nothing to live for.  He pushed everything to the limit, and stole the movie.  The two characters/friends balance each other out, and take care of each other.  The story of the two characters destiny at the O K corral and the aftermath makes for a memorable movie.  Four and half stars out of five.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "A fantastic and nicely made western that is overlooked and unappreciated. The film has great characterizations which adds considerable power to it as well as breathtaking gunfights and awe inspiring scenery that just goes to show why the great American west is so influential. Lead actors Russell and Kilmer give arguably one of their best performances of their career which they pull off with so much power and charisma that is is truly remarkable that the Oscars overlooked their performances in this film. True this film does have a few flaws in its woodwork (pardon the expression), but the film's characters, scenery, and action scenes pull you in to the extent that you overlook its flaws. This is not your average western, this is a dark, brooding, and extremely violent period piece that is not for the squeamish which portrays the era in a more realistic sense. A remarkable achievement.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Tombstone is a return of the classic 40's and 50's westerns by not being as gritty as all westerns after Sergio Leone stepped in. This is a slightly cheesy but hell of a good time western. Val Kilmer also gives us what I think is an Oscar worthy performance as Doc Holliday. This is one of my favorite movies of all time.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "Who cares if this movie is historically accurate or not? Tombstone will forever be one of the best movies of all time. Val Kilmer phenomenally played the infamous Doc Holliday. I laughed and cried and had a heck of a good time. I recommend this to anyone who enjoys sarcastic humor, funny westerns, or anybody who's just looking for a good time that will last you a lifetime!",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "greatest western ever  made",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Good movie.  Hollywood of the 1990s doing justice to old-school Westerns of the past.  (Made at a time Val Kilmer was on his game and showing great promise - before he became a \"direct to DVD\" legend...)",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "Some of the best tuff guy one liners since Dirty Harry!",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "Best western ever made",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "[img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Top 5 westerners of all time.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "A great western action/drama with great performances from an all-around great cast. The story is intense, the script is entertaining, and the direction is exciting. The greatest Hollywood western I've seen.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "Silly ending and romance subplot aside, Tombstone is a fairly decent western with some great action scenes to keep things interesting.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "A good movie with a few cheesy moments.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "An outstanding film. A brilliant cast play it to the max. Not a classic western but as a period piece it really evokes a lawless era.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "superb in almost every way western!",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "Probably one of the best westerns ever made. Weather it is historically accurate or not, this is an amazing movie worth watching. It has everything you could want: action, great acting, and humor. The dialog between characters is so good. So many good movie quotes! It is very humorous, and also very sad at the end. It is well acted, well directed, and well written. The props and set pieces are great to. In short, its just stinking awesome. A must watch.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "Aside from some fine performances, \"Tombstone\" is a melodramatic, tired rehash of old western cliches.",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "The Good the Bad and the Ugly is still my favorite western. But this is second without a doubt.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "This film benefit from a phenomenal performance from Val Kilmer as the reckless Doc Holliday. This character fascinated me to no end. A man so full of self-loathing that he is willing to throw his life a way for the heck of it and at the same time has such undying loyalty to his one and only friend, Wyatt Earp. Such a wonderful performance. Easily one of the greatest westerns ever made.",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "One of the all time greats.  Plot, action, acting, it has it all!",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "I just liked it ! I'm your Huckleberry. Sam Elliott as Virgil is underrated but then again he is an underrated actor.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "I'll be your huckleberry",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "My Favorite Western Film Is 1956's The Searchers.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is the best thing about this fast-paced and entertaining flick.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "Well crafted western with a multitude of interesting characters, highly recommended for genre fans.",
            "review_date": "2013-11-30",
            "source": "rt"
        },
        {
            "content": "How can you not love Tombstone?",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "Best mustache movie ever made.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "I am generally not a fan of westerns but this one takes the cake! Val Kilmer as Doc Holliday is fantastic! If your having a movie night and haven't seen this film, I highly recommend it!",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "A  brilliant example of the powerful impact that the western genre gives.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "A true coming of age classic if there ever was one, Tombstone will usher your children into adulthood and remind you of your younger days. A brilliant spin on an old classic story, impeccable acting, fantastic drama and of course a bevy of western violence makes this movie a must see for all.",
            "review_date": "2013-11-09",
            "source": "rt"
        },
        {
            "content": "Tombstone takes a different approach to its character drama than more stereotypical westerns do because of how it uses a musical score to enhance the drama in the scenes that follow such dramatics. Although this is an achievement, too many of the negative elements seated in Kevin Jarre's script remain dormant in Tombstone, predominantly the length of the script and excessive subplots which end up giving Tombstone a rather boring first hour to work with which is burdened by too much talking and not enough serious western drama when it was advertised as an action-adventure western, which makes it misleading. Although the first hour has all the film's technical benefits and talented actors, it's just boring and slow. Even though it's traditional for western films to be slow, Tombstone is slower than average but advertised otherwise which is troubling for the viewer, and much of it is mere melodrama.\nAlso, the musical score, although very well composed seems to be misplaced in a western-crime hybrid like Tombstone because it's more appropriately fitting to a Disney adventure movie due to its melodramatic nature, mixed with its light tone and brief movements of heaviness. It sounds weird, but keep your ears open watching Tombstone and you'll see what I mean.\nThings turn around as the film enters its second half because the pacing between the drama and action is more balanced and the scenes tie together better, which makes it function at a more entertaining rate. But after a slow first hour, this more-or-less splits Tombstone into two films, with the former film being a slow and boring drama focused on character building and the latter being a brutal western drama with some visually impressive action. Lastly, much of the time Tombstone can't decide between being a crime drama or a western, but only succeeds in blending particular elements of them together while coming up short in other areas. \nReally, a lot of the troubles with Tombstone can be attributed to Kevin Jarre whose poor story writing and scripting \"skills\" didn't give Tombstone such a strong setup and left it to everyone else to fix. Luckily enough they did, and even more luckily Kevin Jarre didn't end up directing Tombstone, because had he done that then there isn't much to say that Tombstone would have been better than Kevin Costner's competing western flop from the same year, Wyatt Earp. Luckily Tombstone had, among other things, a very talented cast to hold it up.\n\nKurt Russell is exceptional in Tombstone. He's not just incredibly strong at articulating his characters emotions for the dramatic scenes, but he's incredibly intimidating too. Even though some of his lines a poorly written, he uses a natural skill as a heroic actor to spearhead the role of Wyatt Earp and ensure that he transcends the norms of a cowboy to make himself a lawman, and an actor as talented as Kurt Russell cannot and does not fail at that. He does an excellent job, and one of his most heroic next to his iconic Snake Plissken. \nVal Kilmer continues to impress me, because in Tombstone he makes use of a stare, a particular stare that looks into the soul of the viewer and says \"don't piss Wyatt Earp off\" and convinces us that he truly is Wyatt Earp. Tombstone serves as a front for him to make use of his greatest skills as an actor again, and it proves to be one of the finest benefits of Tombstone. He is solid and powerful in Tombstone.\nSam Elliot was also awesome because he has a western warrior persona to him which he plays to the benefit of Tombstone in a really powerful manner and creates a strong character from Virgil Earp.\nBill m Paxton, Michael Biehn and Billy Zane were also good, and essentially the entire ensemble cast was a good decision.\nAnd the production design, costume, cinematography and film editing on Tombstone are all astounding and very convincing in setting the mood of the story and the time it comes from, and it just adds to the visual credibility of the movie, as does the awesome shootout scenes which feature a combination of all the films technical achievements as well as proper sound effects and editing as well as a a sense of real intensity.\n\nSo overall, Tombstone is lacking in pacing as the main problem, but the cast and cinematography is too good to ignore.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Val Kilmer and Kurt Russell are both fantastic, but especially Kilmer as Doc Holiday.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Loved it. It's quite violent and seems realistic compared to other Westerns-I mean the gunfights look sloppy at times. The script vacillates from being excellent to hokey, so I feel maybe they had many people working on the script and didn't integrate styles well. \nAlso-Val Kilmer plays a very cool character and acts well.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Love It, Love It, Love It.. My all time Favorite Western.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "One of the best and most underrated westerns ever. Val Kilmer nails it as Doc Holliday.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Classic Westren Film About a Legned of Man with a Name : Wyatt Earp",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns of all time!",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "As far as Westerns go, I really enjoyed this one.",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "It will be hard (if not impossible) to get any movie about this event historically accurate.  This one had some historical flaws, but it was a lot of fun to watch.",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "the movie looks great. the moustaches are hilarious!! i don't watch a lot of cowboy movies but I imagine that this film has all the prerequisites of the genre. It's a good movie with a good cast. yea, watch it.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's best role ever",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Best movie of all time",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Directed by George P. Cosmatos (Escape to Athena (1979), Rambo: First Blood Part II (1985) and Cobra (1986)), this western tells one tale in the life of Wyatt Earp, unlike Lawrence Kasdan's Wyatt Earp (1994), which told his whole life story, this is a focused western with a massive cast, and this focuses on the Gunfight at the O.K. Corral, which was a footnote in the Kasdan film, but this is more to the point and a slightly better film as well. Wyatt Earp (Kurt Russell) and his brothers Virgil (Sam Elliott) and Morgan (Bill Paxton) move to the Arizona town of Tombstone to settle down and live out their lives, it's here where they meet Wyatt's old friend Doc Holliday (Val Kilmer), who has also moved to the town, as the climate is good for his TB. In Tombstone, Wyatt becomes attracted to Josephine Marcus (Dana Delany), even though he's already married to Mattie Blaylock (Dana Wheeler-Nicholson), but the Earps and Holliday find a threat in Tombstone in the form of \"Curly Bill\" Brocius (Powers Boothe), who has a gang of outlaws known as The Cowboys. Even though Earp has retired as a lawman, he's soon called back into the fold one more time to help protect Tombstone from these murderous thugs. There has been a lot of debate as to who directed what in this film, (Russell claimed he ghost-directed the film), but it doesn't matter, as this is a very well made western, with a brilliant supporting cast including Stephen Lang, Michael Biehn, Billy Bob Thornton, Thomas Haden Church, Billy Zane and Charlton Heston. It's well worth a look, especially now as the western is back in vogue again.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "A bit cheesy at times.  Val Kilmer was a great Doc Holliday.  Otherwise just good to average.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Easily one of my favorite movies of all time. Val Kilmer as Doc Holliday does an amazing job. Everything that comes out of the mans mouth is quotable. Highly recommend.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is amazing in a cast that is Supreme on all levels.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "I can watch this over and over, I used to watch this all the time with my dad",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "\"I'm your Huckleberry.\"  'Nuff said.",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "I was very much looking forward in seeing Tombstone as I had heard plenty of good things about it, I eventually was able to see this one, and although it is not the best Western as what everyone has claimed, this is still an entertaining action film with some good performances. Kurt Russell and Val Kilmer deliver the best performances here along with Powers Booth and they all bring something worthwhile to the screen. Tombstone is far from the old Sergio Leone Westerns, which were epic in scope and storytelling. This is a movie that tends to be more action oriented than give the viewer a straight forward well layered plot that you can really get into. It's not a bad thing, but it does make you want more out of this movie. Overall this is a good movie, but one that does fall short of many other Westerns that we've seen before. Luckily Director George P. Cosmatos keeps the action thrilling and interesting and you are well entertained for its two hour run time. If you love the genre, Tombstone is worth checking out, but be warned, it is far from the classic Westerns, and it does lack the effective storytelling and immaculate performances that have made the old school Westerns such a treat to watch. However for a straight forward Western action film, Tombstone delivers good action and is a fun movie, but it does leave a lot to be desired. It is not the movie that could have been, and it could have been improved upon. With a good cast of talented actors, Tombstone is a fun popcorn film, but it doesn't rank up there with the best Westerns movies either. There are still enough gun fights in the film to entertain the most devoted fan of the genre. Tombstone for all its faults is a fun ride.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Does nothing for pretty much 1 hour. Some nice action scenes, but overall should not be considered as a Western film, but rather a film that takes place during the Western era.\r\nParticularly pleased with Val Kilmer's performance.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Tombstone is once again a retelling by Hollywood of the legendary Wyatt Earp, this time with great production values and well known actors, including Kurt Russel and Val Kilmer. It's a colorful, exciting, and highly-stylized western that's a lot of fun, but it's also very flawed.  It often slips into melodrama, and it really does feel like a Hollywood movie,   which is a shame considering the events this movie highlights are really something to be told. At a run time of about two hours, it feels bloated, and there are lots of notable flaws. However, Tombstone is nonetheless worth a watch, especially with big names such as Kurt Russell and Val Kilmer. \n\nTombstone is about Wyatt Earp (Kurt Russell) who decides to retire from law enforcement and moves to the growing town known as Tombstone, Arizona, intending to make a living there with a normal life. Along the way, he reunites with his brothers, Virgil (Sam Elliott) and Morgan (Bill Paxton), as well as his friend, Doc Holliday (Val Kilmer). They learn that a group of outlaws known as the \"Cowboys\" are terrorizing the citizens of Tombstone, and now, instead of Wyatt Earp residing in the town with his love interest and living normally, he is caught up in a conflict with the outlaws. The acting for the whole cast is pretty good, but the two actors that caught my eye right from when they were introduced was Kurt Russell and Val Kilmer as Wyatt Earp and Doc Holliday. They carried the movie for me, and without them, this movie probably would've been significantly worse. Kurt Russell is a really likable actor here, and has lots of great development as a character, but Val Kilmer is even better, stealing the show in every scene he's in. He's brilliant in his role and it's a shame that his performance here is not as recognized. He was legendary and he really should've won an Oscar for his performance, but he was overlooked completely. Although there's this really unintentionally funny and over the top scene where Kurt screams \"Noooo!\", but he and Val really carry this film on their shoulders.\n\nThe action is really well filmed and entertaining, as well as being pretty violent, but it's nothing too bad. I would have preferred that the O.K. Corral shoot-out was at the end instead of being replaced by something else, but both sequences were well made. You can tell that the production values of this film were big, with the cast having really over the top facial hair, and the set design looking nice and clean. But that's a problem in its own way, since westerns shouldn't really look \"nice\" and \"clean\", and even the dirt here looks pretty. It's highly-stylized and should look a lot more gritty to really capture what the old west was like, similar to what Leone did with his movies. In Leone's movies, everything looked really dusty and dirty, but here, everything is really bright, pretty, and colorful. Anyways, it's not too bothersome, it's just something I wanted to point out. The cinematography is still gorgeous, and the soundtrack is great, and the film as a whole really feels energetic and lively. When they say Tombstone is a growing town, it really does look vibrant and big. However, the film is a little bloated, and everything is interesting and fun except the bad romantic sub-plot. It's a little ridiculous and melodramatic, and I feel like it was under-developed. You're going to get a lot of characters that are under-developed and have little screen time, so they don't leave as much as of an impact on you. Tombstone also has the tendency to incorporate almost every western movie cliche available, and it often feels like you've seen parts of it many times before. \n\nI feel like Tombstone will appeal more to the modern audience than to the old western audience, and the end result is a little underwhelming and ridiculous at times. It's clearly inaccurate in its portrayal of the events that happened, and lots of this movie was altered for entertainment purposes. However, there's no doubt that it's a very cool western, and the best thing out of this movie was Val Kilmer's legendary performance. His performance alone drove this film past its flaws, and is among the best performances I've seen in a western, or any film for that matter. If you can look past Tombstone's flaws, you're rewarded with a very entertaining and cool western, and it's nowhere near the best I've seen, but it's still well worth spending your time checking this out. By the way, \"I'm your huckleberry\".",
            "review_date": "2013-06-29",
            "source": "rt"
        },
        {
            "content": "First rated R movie I saw. CSB",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "One of my library classics",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies ever made. Probably the greatest.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "The best version of this story.  Kurt Russell shines as Wyatt Earp, but the real star of this film is Val Kilmer as Doc Holliday.  He absolutely steals the show and has fun doing it.  Damn, he nails this character and is one of the main reasons this movie is as good as it is, and is definitely the main reason why it is so high up on my list of favorite movies of all time.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "This will forever be the best retelling of the ok corral story.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "One of the best Western's I've ever seen.",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "Tombstone tells a tale that's been told over and over again, but manages to make it interesting.\n\nThe good. Well done decor and costumes. Nice photography. Plenty of shootout. Interesting story.\n\nThe actors. Kurt Russell did a credible job as Wyatt Earp, but it's probably the extent of his capabilities as you can see his limitations from time to time. Val Kilmer is absolutely excellent as his cultured, but edgy friend, Doc Holliday. Sam Elliott and Bill Paxton both give nice performances as his brothers.\n\nThe bad. The river scene is of poor quality, Russell overdoing it by a fair margin, probably under the direction of the director. There are a few scenes where he's not at his best, but that one is the worst.\n\nThe ugly. Nothing.\n\nThe result. Excellent western action entertainment. Recommended to those who like the genre and the fans of Russell or Kilmer.",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "The last of a dying breed. Kurt Russell was masterful and the western genre lives on.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "Historically ridiculous but still just a solid fun watch.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "best western  ever val kilmer does a great job .this  has been one of my favorites for a long  time",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "This Western features more action than the similar film Wyatt Earp.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Salvo que puede hacerse un poco lenta y larga por ritmo segun el tipo de espectador, el tipo de pelicula que facilmente podria ser el patron de hollywood, nada increible ni especial, pero tampoco lamentable ni risible, y ampliamente disfrutable, entretenida, deja un buen recuerdo y buena taquilla, buenas ventas en cine casero...",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies, probably one of the best westerns out there if not the best, and certainly the best adaptation the Wyatt Earp's legend. Val Kilmer and Kurt Russell have good chemistry on screen, but Val steals the show.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "For me the Sergio Leone westerns of the 60's are dated, but the ones from the 90's and of the 21st century rock.  Tombstone is one of the best westerns I have ever seen.  The director of this film George P. Cosmatos is a one hit wonder.  He made this one great film, but all of his other films were bad.  This film shows that he should have been doing westerns his whole career.  \n\nThe film was a perfect western.  It was really well paced, and it was intense when it had to be.  It had all the characteristics that made old westerns great, and many more modern ones.  The newer westerns are usually better acted and this film was really well acted.  I feel the need to point out the terrific performances from Kurt Russell, and Val Kilmer.  Those two carried the movie for me.  It also had more development.  Not only was there plot development, but also there was character development, and the suspense gradually got greater as the film went on.  They went more into the personal lives of the characters, which modern westerns tend to do.  It had the old western characteristics like all the gunfights, and the fact that it was a gang of bad guys.  SO this film will appeal to lovers of old westerns, and more modern ones.\n\nWhat actually happens is that there is a man named Wyatt Earp (Kurt Russell) who decides to retire from law enforcement, and go to the town Tombstone.  He meets up with his old friend Doc Holliday (Val Kilmer) and learns that the town has been taken over by a group called \"The Cowboys.\"  He came to Tombstone to retire and reside with his wife, but now he is caught up in something huge.  It started off slightly slow, but then got really intense, and it was great.\n\nI like my western films to be like this.  Unpredictable, suspenseful, well acted, and well developed.  I am writing a western screenplay, and this is one of the films that inspired me to do it.  Westerns were an acquired taste for me, and I am really growing to love the genre.  This will always be one of my favorites of the genre.  My favorite western films are ones like \"Unforgiven,\" the remake of \"True Grit,\" and this one.  I liked the intensity of this film a lot, and that is what made this film so great.  One of the all time great westerns for sure.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "Outstanding performances by an outstanding cast!",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "\"I've got two guns, on for each of ya.\"",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Best Western ever made!",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "All these actors bring their 'A' game to one of my top three favorite westerns.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is no longer the worst Batman to me, he shoots people in the throat.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "One of the most quotable movies of our time.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "The mustaches alone are worth the repeat viewing.  I revisited \"Tombstone\" in my blog.\n\nRead my review at...\n\nhttp://revronmovies.blogspot.com/2013/03/tombstone.html",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "Fairly good movie with believeable acting which had both sympathetic heros and dispicable villains. It has a good balance between dramatic dialog and gun fighting with all around interesting characters. The sets, styles, and wardrobe also stayed more faithful to the 1880s than many Westerns.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is epic ,  \" Huckleberry \"",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Best Doc Holiday ever....love this movie!!!!!!!",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "great, great, great! could watch over & over.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "This is the story of members of one of the greatest gunfights in US history, the OK Corral in Tombstone, Arizona. The film focuses on \"Wyatt Earp\" (Kurt Russell), who reunites with his brothers \"Virgil\" (Sam Elliot, who seems to favor doing Westerns when one comes up) and \"Morgan\" (Bill Paxton) and the rest of his faction in the famed gun battle including the ailing \"Doc Holiday\" (Val Kilmer). \r\n\r\nThe film not only runs through the months and days leading to the gunfight, but it also shows the battle and its fallout where the Earp Gang goes after . \r\n\r\nThe first thing you will notice in this movie has an authentic look. The costumes, though none had that \"worn\" look, looked real authentic right down to the buttons. Even facial hair on the men looked to be the style worn during the time of the Gunfight at the OK Corral. \r\n\r\nThere are some good performances in this film. Russell does a good job in the feature role, and Kilmer almost steals every scene he is in. If you want somebody in a Western, then you have to go to Elliott. Just about every film I've seen him in, Elliott has appeared in one and basically has made a name for these roles. One actor I suggest you take a look at is the one playing OK Corral survivor Billy Claiborne. Claiborne is played by Wyatt Earp, the fifth cousin of the real man played by Russell. \r\n\r\nMany of the supporting cast does do good performances. But, because a lot of the screenplay was cut, they aren't really developed well. \r\n\r\nThe soundtrack to the film is not really memorable. I can barely remember any music in this film. I do remember mostly instrumentals, but nothing spectacular. \r\n\r\nLike other Westerns, there is violence in this movie. However, it is a bit more graphic than some of the classics with \"The Duke\" John Wayne. When Westerns were the thing in Hollywood, you would get people shot with blood running from the \"wound\" (usually a blood pack hidden in the actor's hand), but in this one the blood comes squirting out. You will also get close-ups of body parts where a bullet hole will appear when they are hit. I clearly remember a close-up of one \"Cowboy\" being shot by \"Wyatt\", and a bullet hole appearing in the dead center of his forehead (without a burst of blood). \r\n\r\nThis movie tries to show us the lives and relationships of the Earps and Holiday. However, no historian knows with 100% certainty anything about these men. Much of what we see is pure speculation on these men. But with the performances of the cast, you can believe that these are how these people actually were. \r\n\r\nThere are many scenes which drag on, but the pace is pretty good for the entire movie. It may not be a movie for everybody, but it's still a good movie and could be a pretty good rental.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen. Makes my top 10 of all time. Wonderful and feeling film. Great acting. A film that take us back to how things might have been in the Old West. Highly recommended.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Tombstone (1993)\nIt's a good western from the 90's and has a really great cast but Leone's cowboy movies are better. With that being said, there will probably never be a modern western as good as Tombstone is. Update: Django Unchained came out and that was up to par.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "A true epic western and an amazing cast. One of Val Kilmer's best roles and brought the western back to the box office after numerous campy and frivilous entries have failed to.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "Come on totally awesome flick ! End of story! If you don't like this you don't like good movies!",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "I'LL BE YOUR HUCKLEBERRY",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "This movie is like one of the two westerns that I love. \r\n\r\nOkay, three if you count American Tail: Fieval Goes West.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's best role EVER!! I don't even like westerns but totally fell in love with this movie & Val in this movie!",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "I Really Wanted to Like It Like Other Westerns, But It Felt Like Something Was Missing Throughout.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "The best \"fun\" western to watch. Val Kilmer steals the movie as \"Doc\". He has some of the best lines! Movie moves along real good. Nice small part of Charston Heston as well.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "\"I'll be your Huckleberry.\"",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's Doc Holiday is the reason you'll love Tombstone and the reason you'll watch it again and again.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "\"It's true, you are a good woman. Then again, you may be the antichrist.\"\n\nThere's a lot to like about Tombstone including Val Kilmers performance and the beautiful costumes (to say the least). But there is also a lot not to like and at times the faults can be annoying. Its an enjoyable western. That says a lot.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "A balanced, well-paced first half leads to a flat conclusion with plenty of action but few satisfying moments. Val Kilmer steals the show with his dry-humored portrayal of Doc Holiday.",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "Obviously I love this Western too",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Greatest.  Movie.  Ever.",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "a modern western with a definitive dark edge to it.  the story is pretty traditional for the genre, and except for a bit more graphic violence, really isn't all that memorable.  the highlight of this movie for me is easily Val Kilmer.  his Doc Holliday character is terrific--classy, funny, entertaining, and possessing some actual depth.  one of the better performances I've seen from him.  the rest of the cast was just OK--even Sam Elliott's mustache.  overall worth a watch or two, but certainly not a favorite.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "CLASSIC, WESTERN. potrayed so well by Kurt and Val Kilmer...",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "My favorite western!, Val Kilmer, awesome.  Sam Elliot, a true 'cowboy\" Kurt Russell's best role.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Best Western I've seen to date.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "I enjoyed this western.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "Classic. Classic as hell. I love that cup spinnin' scene.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Amazing western, based on a good story, well followed up",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "The only good western ever made. Eat it, Costner.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "\"I'm your huckleberry.\"",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "Grew up watching this awesome movie, can't ask for a more perfect Wyatt Earp or a Doc Holliday portrayals than in Tombstone",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "You tell 'em I'M coming!  And HELL'S coming with me!!!",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "EPIC WESTERN. To even expect me to review it is insulting.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Val Kilmer (Doc Holliday) is so cool in this film",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Yer a daisy if ya do!",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "My favorite!!!! I do watch this over and over...",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "best movie!!  where clayton got his middle name Wyatt from!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "great movie.  Kilmer steals the show!",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "I'm not a fan of westerns. Ill have to admit that this movie kept me watching.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Great western flick, and great acting on all parts.  It brings a part of history to life!",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Love this movie. It has become my favorite western with a wonderful balance of western mythology, violence, memorable lines, fine cinematography and some fine acting, certainly Kilmer's best work. is it accurate? No, but it is more accurate than many other versions of the story.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Best western of all time!",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "I love this western movie, one of my favs!",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "GREAT FILM !!!!!!!!!!!!!!!!!!",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "One of Val Kilmer's best movies and roles.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "The best Western ever.  This movie is full of great lines, especially from Kilmer's Doc Holliday.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "While it's not my favorite western, it is one I can watch over and over again. I particularly like Val Kilmer's role in this film.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorite movies. I have seen it countless times.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "my favorite movie of all times...",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "One of the best westerns ever made.  Val Kilmer is amazing as Doc Holiday.",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry!",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "My favorite modern western. It's one helluva of a movie. Kurt Russell is solid as Wyatt Earp but it's Val Kilmer as Doc Holliday who steals the show. And just look at the supporting cast: Sam Elliott, Bill Paxton, Michael Biehn, Powers Boothe, Dana Delaney, Billy Zane, Jason Priestly, Michael Rooker, and Billy Bob Thornton. Exciting shootouts and wonderful dialogue make this a winner. And has some of the best lines in movies, period.\n\nWyatt: \"Go ahead, skin it! Skin that smokewagon and see what happens..\"\n\nDoc Holliday: \"It's true, you're a good woman. Then again, you may be the antichrist\".\n\nDoc Holliday: \"Why, Johnny Ringo, you look like someone just walked over your grave\".",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "My favorite movie next to Young Guns.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "One of my favourite western.",
            "review_date": "2012-12-13",
            "source": "rt"
        },
        {
            "content": "Top ten fav western movie",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "my favorite western of all time excelent story well done",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is this whole movie.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Add a review (optional)...",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "although not historically accurate it's damn entertaining.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "I watched this movie a few years ago and now I really want to watch it again. It was awesome.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Only the greatest western ever made. If you haven't seen it yet then go rent it",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "Another movie I can watch over and over.  Definitely Val Kilmer and Kurt Russell's greatest performances!",
            "review_date": "2012-12-04",
            "source": "rt"
        },
        {
            "content": "Best Western Ever, apart from \"The Good The Bad and The Ugly\".",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "One of Val Kilmer's best roles.  I'm not a western lover, but enjoyed this true story.  Not too keen about all the violence.",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is absolutely amazing in this flick! A great-modern day western....lots of great gunfights and well-developed characters! A modern classic!",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "A good western, maybe not based on exact events but close and fun to watch.",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. It's not a masterpiece, but it sure is entertaining.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "My favorite movie. Love Doc. :-)",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "do you love some root need to be shooting Cowboys right now dude what's up with these guys they actually be get 5 stars on the radio",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "I wonder if I'm too late in the game for a career change to a cowboy.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "Terrible, so many better westerns",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "Very entertaining and face paced with a wonderful turn by Val Kilmer as Doc Holliday",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "History........ Again.  Wyatt Earp this time and nicely played by Russell.  Good all round cast with Kilmer's Doc Holiday the pick of the bunch. Set in Tombstone the Earp brothers take on The Cowboy in a gunslinging' fest that plods a bit but gets there in the end.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "This is a great movie. It has a lot of action, sympathetic and deep heros and villains that you despise. My favorite western.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "The best modern western, bar none. Val Kilmer's best role ever. No one else will be as good as him in the role of Doc Holiday.",
            "review_date": "2012-11-09",
            "source": "rt"
        },
        {
            "content": "one of the best ever",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "the charisma of western legends captured in celluloid ,tombstone does it fair part doing justice .",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "An awesome take on Wyatt Earp, this action western manages to stay engaging the whole time, and Val Kimer is flawless as Doc Holiday.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "not as good as i remembered it.",
            "review_date": "2012-10-30",
            "source": "rt"
        },
        {
            "content": "I love this movie!! Val Kilmer is amazing as Doc Holiday.",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "Quite possibly my favorite western!",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "Kilmer's performance is oscar-caliber and worthy of watching...",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is amazing in this!  Memorable characters and fabulous cast!",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "One of the best westerns made!!",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "Fantastic Cast, awesome movie. Val Kilmer as Doc Holiday was the best.",
            "review_date": "2012-10-18",
            "source": "rt"
        },
        {
            "content": "The best western of my time, unforgettable performances by Kilmer as Doc and Russell as Wyatt.  Supporting cast was awesome.  I watch this movie at least once per year if not more",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "My ALL TIME Favorite Movie!",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "i'll be your huckleberry!",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "Very entertaining.  Is it the best western ever made? No.  But Hollywood at it best.",
            "review_date": "2012-10-04",
            "source": "rt"
        },
        {
            "content": "There's something endearing about TOMBSTONE. Perhaps it's the fantastic cast. Maybe it's the top-notch action and western gun-play. Most likely: It's the one-liners. Whatever the reason, the film ranks among the best westerns of the 90's and one of the most watchable movies for a free afternoon.",
            "review_date": "2012-10-01",
            "source": "rt"
        },
        {
            "content": "The best retelling of this lawman yet!  One of my favorite movies of all time! I'm your huckleberry",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "Ensemble cast and everyone plays it like they are in the starring role.  A Latin cipher.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "Possibly the greatest western ever made",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "I'm a big fan of the Western genre since they always seem to have some of the most interesting characters and stories out of any genre. Tombstone is good Western, while it does suffer from having too many characters, it's nonetheless well worth a watch.\r\n\r\nTombstone follows successful lawman's Wyatt Earp who plans to retire anonymously in Tombstone, Arizona, where he's disrupted by the kind of outlaws he was famous for eliminating. At about it two hours and fifteen minutes length there a couple of notable flaws with this western. One mainly being it suffers from having too many characters which means you'll get some characters that don't get enough screen time, development, and death scenes that will little impact due to the lack of screen time some receive. Another issue is the romance is a bit under developed, there was never a solid enough for Wyatt Earp to fall in love with another character and was surprised to see them together by the end of movie. What it does get right pacing, while a little slow in the beginning, but when everything shifts into full motion it get started and the plot will hold attention till the end. The cast here is one of best I've seen in a Western with all the actors giving some of their best performances. Kurt Russell mainly steals the show here, he makes an excellent Wyatt Earp nearly carrying the entire film on his shoulder to good results. Though there is a scene where Kurt Russell shouts \"no\" for some reason and delivers the movie most over the top moment which will probably make the viewer laugh unintentionally. The cinematography is great in creating atmosphere and the terrific score is well worth mentioning as well. Tombstone is also one the most violent Western I've seen since The Wild Bunch, though it never comes close to reaching the triple digit body count as the The Wild Bunch.\r\n\r\nTombstone suffers from having too much characters, but the cast more than makes for it with their memorable performances. Tombstone is might not be as good as some of the other Westerns I've seen, but it's well worth your time to go check it out.",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "Without a doubt, Val Kilmers role as Doc Holliday is one of the best performances of all time.  One of my favorite movies ever.",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "\"I'm your huckleberry!\"  Great movie!",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "One of the best Westerns EVER!!!",
            "review_date": "2012-09-20",
            "source": "rt"
        },
        {
            "content": "Great movie. Great scenes, great quotes, really good actors. Everything about the west that I love. One of those movies you can always watch.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "Best of the \"modern\" westerns by far. Great cast and well written. Val Kilmer is awesome as Doc Holiday.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "One of the best westerns I've ever seen. Loved their choice for actors and their acting ability. Loved Val Kilmer as Doc.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "Tombstone Western-film directed by George P. Cosmatos, written by Kevin Jarre. Starring Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Robert Mitchum (the narrator).\r\n\r\nIt is based on actual events of Gunfight at the O.K. Corral, along with the Earp Vendetta which followed it soon after in Tombstone. Kurt Russell plays Wyatt Earp and Val Kilmer plays Doc Holliday, Bill Paxton and Sam Elliot both play Earp's brothers.\r\n\r\nAmazing locations, and true characterization of actual persons from American Old West. Doc Holiday character has been purely portrayed by many actors, and it furthers interest for audience. I was disappointed with too much of violence in the film, killing someone seemed as if no big deal; and it doesn't panic us anymore to see Earp's brother shot to dead in the mid of the movie.",
            "review_date": "2012-09-13",
            "source": "rt"
        },
        {
            "content": "A much better story and direction that Wyatt Earp. Kilmer is perhaps his best ever as Doc Holiday and Russell surprised me as a believable Earp.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "love this western   so  much fun",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "The western thriller Tombstone tells the story of one of the seminal events in the history of the West.  The film follows Wyatt Earp as he attempts to settle down with his bothers in the boom town of Tombstone, but forces conspire against him and lead Earp to mount a posse to chase down a renegade group of criminals known as the Cowboys.  An all-star cast has been assembled for the film, and includes Kurt Russell, Val Kilmer, Powers Boothe, Michael Biehn, Sam Elliott, and Charlton Heston.  All the performances are excellent, and the level of detail in the costumes and sets are amazing.  Additionally, the score is particularly powerful and really enhances the film, and gives it a lot of energy.  Some aspects of the film are underdeveloped, but Tombstone is an exceptionally good western with a compelling story and exciting action.",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "Dana Delaney was horribly mis-cast, but everything else works in this movie. After 19 years, it still holds up as one of the best westerns, ever made.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Val Kilmer gives one of the best performances of his career. Not to mention the shootouts are gloriously shot!",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Favorite western movie",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Nice Western movie. I love it.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "Val Kilmer steals this movie.",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "20 years later and this movie hasn't lost a step.  It is officially a Western Classic.",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "I had heard of this movie and never watched it until recently.  I was expecting something completely different, but I enjoyed it.  I was especially entertained by Val Kilmer's character, Doc Holliday.",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "Loved this movie the first time I saw it, and every time since!!!!!",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "I'm not much for Westerns, but this one stays pretty entertaining.  The cast is pretty great, but I think Val Kilmer takes the cake with Doc Holliday.  However, I didn't think Dana Delany was the bombshell the movie played her as.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "Observe...my new favorite Western movie. It could have done without the language but the rest of it was INCREDIBLE!! The directing (which was done by Kurt Russell...thanks Kurt),the acting,the flow of the story,the costumes,just everything about this movie was done to the utmost perfection. It was also pretty accurate historically which is another huge bonus. Kurt Russell did a phenomenal job with his performance as Wyatt Earp. I love his opening scene with the guy beating the horse and Wyatt saves the horse. Very funny. Kurt just does such a good job of portraying both Wyatt's heroic,sherrif-like side and his deeply emotional side. He plays both those characteristics of Wyatt flawlessly. And of course who could EVER leave out the TREMENDOUS, OSCAR-WORTHY performance of Val Kilmer?? I was completely,totally mesmerized by his character from the start. His character was just so spirited and independent but loyal to Wyatt. There is NO ONE and I mean NO ONE who could have pulled off Doc Holliday's character better than Val Kilmer. Just the way he TALKS goes to show how TALENTED and focused Val is. He plays all of the serious,dramatic scenes beautifully (i was actually almost crying when Doc died) and his funnier scenes which were SO FUNNY! \"I know...let's have a spelling contest!\" My favorite quote in the whole movie lol! Val really should have got an Oscar for his performance. So yeah great movie...highly recommend it.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie of all time...Val Kilmer was the ultimate Doc Holliday...I can quote this movie almost line for line...a truly brilliant film...a must have for any true movie fan...the cast was absolutely stellar as well...",
            "review_date": "2012-08-28",
            "source": "rt"
        },
        {
            "content": "The true western returns with this film.  Not since the Clint Eastwood classics has a western impacted with such power.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "Take a classic western story, turn it into a love and revenge tale and add an ensemble cast and you've got Tombstone. Val Kilmer was pretty good in this, but for some reason I just couldn't get into Kurt Russell in the lead as Wyatt Earp. Sam Elliott and Bill Paxton were supremely awesome in this, though, as was Powers Boothe, whom I also loved on Deadwood.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "My #1 all time favorite movie, i mean come on...how can u not like this movie, Doc ROCKS!",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "A modern western classic, as essential to a film collection as Unforgiven, and True Grit the second.   Val Kilmer should have won an Oscar for his incredible Doc Holliday.   This film is a must see for that alone.  Great cast, and a fine job by all.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "Featuring an awesome cast, an interesting plot, good action and wonderful performances and well played out characters this is a really good western from the early 90s.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "Best western of all time. Val Kilmers greatest role.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "One of the finest westerns ever filmed. Excellent action. A very good script. The cast was amazing. Val Kilmer should have received an Oscar for his role as Doc Holiday. The movie was probably about 90% accurate historically, but was one of the best retellings of what had occured.",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "It was good. What more can you say? Gotta like what Val Kilmer did as his role as Doc.",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "\" You gonna do something, or just stand there and bleed.\"",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "Full of cheese and cliches, Val Kilmer's performance as Doc Holiday  ranks among cinema's best character creations",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "4 stars just for Kilmer's performance -\"I'm your hucklebearer\". Along with Kiss Kiss Bang Bang his best",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever. Kilmer at his best as Doc Holliday, Kurt Russel in his only role better than Snake from Escape from New York. If I could only watch 10 movies for the rest of my life, this would be one of them",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "I love this movie. Val Kilmer definitely stole the show! If I;m not mistaken, he ot an academy award.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "Amazing movie Val Kilmer's performance as Doc Holiday was wonderful.",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "one of my favorite films, when ever its on i have to stop what im doing to watch it",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "I love this western.\r\n\r\n\r\nDoc Holiday is an awesome character and my favorite scene is when Wyatt Earp just keeps killing out-laws and repeating the same word NO! and this is a much more interesting and better movie than the...other Wyatt Earp movie....you know, Kevin Costner and 4hrs. and 30mins.\r\n\r\nIf you love westerns than you are gonna love Tombstone.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Val Kilmer makes this movie. His role as Doc Holiday is simply amazing.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "Kurt Russell Kicks Butt",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "both russell and kilmer play there roled very well and close to oscar  preformances I think",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "best western the only one that i like",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "the hubby loved this one.",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "A film with interesting and compelling performances, familiar faces in acting, good humor and scenes, epic drama, and great action.  It's a good Western film, not the greatest but definitely one of the more memorable ones.  This is good entertainment.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Tombstone serves as an example of what a modern Western should be.\nBolstered by its all-star cast, every actor gives this movie their all, which may possibly be a by-product of the amount of fun these performers had making this movie, or so I'm told.\nThe action is pulse-pounding and fast-paced. The dialogue is witty, fun, well-written and extremely memorable, leading to some of the best movie-quotes of the 90's. The drama is well-acted and even well-paced.  This is one of the few movies where excellence seems to exude from every aspect of the film's production. There were a few surprisingly glaring mistakes in the actual physical production of the sets in a few shots, but there is never anything that harms or hinders the narrative in any tangible way.\nGive Tombstone a watch. There are very few films that shine as brightly as fiction that's truly compelling, well-made, well-acted and fun.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "If you don't like this movie you have no penis",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "Best western ever made!",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "My favorite Western ever. Val Kilmer as Doc Holiday is one of the best portrayals of a character in film history.",
            "review_date": "2012-07-13",
            "source": "rt"
        },
        {
            "content": "A smashing look at what it took to take down the scum of the West. Often beautiful photography, a well laid-out story, and excellent performances all around, with a special boost from Val Kilmer's stellar work as Doc Holliday in probably his most impressive performance. A very good western, a very good action film, a very good time.",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Very well done, well written, well acted and well cast.",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "A personal favorite of mine for not just a good movie but for the best performance of Val Kilmer.  His performance as Doc Holliday is great, his one-liners and overall delivery superb.  Russell is also good as is Michael Biehn.  A rare good Western in the last 2 decades.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "Alright for a Western.",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "one of my all time favorite movies to quote, me and albert saw this at the movies when it came it out was awesome \"i'm your huckleberry\"",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "It is the best movie in the whole world. I love Kurt Russel and Val Kilmer beacuase they are realy good actors. Val Kilmer also is in Batman Forever and Kurt Russle is in Tango and Cash and Escape From L.A. and Breakdown. George P. Costmas makes the best movie in the whole WORLD.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "After successfully cleaning up Dodge City, lawman Wyatt Earp (Kurt Russell) moves to Tombstone, Arizona, and wishes to get rich in obscurity. He meets his brothers Virgil (Sam Elliot) and Morgan (Bill Paxton) there and as well his old friend Doc Holliday (Val Kilmer). A band of outlaws that call themselves The Cowboys led by Curly Bill Brocious (Powers Boothe) and Johnny Ringo (Michael Biehn) are causing problems in the region with various acts of random violence, and inevitably come into confrontation with Holliday and the Earps, which leads to the shoot-out at the OK Corral...\n\n\"Tombstone\" was made when Kevin Costner was making his \"Wyatt Earp\" and as far as I remember I only did see Costners version. A more stylistic, serious and slowpaced in depth look on the person Wyatt Earp, while \"Tombstone\" is a much more commercial actionadventure and a bit \"simpler\" take on the legend of Wyatt Earp in my eyes. \"Tombstone\" has a massive ensemble cast and I reckon that really gives life to the story and that lifts the movie as well. Most of the script follows known facts about Earp, but with a few sidesteps as far as I have understood. Kurt Russel is not too bad as Wyatt, but I had trouble accepting his fake handlebar moustache. However, the one who steals the show is Val Kilmer as Doc Holliday. I reckon one of his finest moments. I liked \"Tombstone\" until Earp ends up going on his own hunt for revenge, then the plot became a bit sketchy and a bit too much \"actionstylish\". I reckon \"Tombstone\" is a pretty ok western, but I would not stretch it as far as saying it is up there amongst the great western movies as some people claim.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "This grade A1 ensemble cast provides the best tale of Wyatt Earp & the OK Corral yet.",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "Best movie with best one liners ever made...PERIOD! \"Are you gonna do somethin or just stand there and bleed?\"",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "\"I'll be your huckleberry\"",
            "review_date": "2012-06-26",
            "source": "rt"
        },
        {
            "content": "\"Tombstone\" is a decent enough western from the early 90s, that features several actors wearing various kinds of mustaches. Kurt Russell is the lead (as Wyatt Earp), but it is Val Kilmer as Doc Holliday  who steals the show in every scene he is in.  The movie itself is hit or miss really, but it has some good things about it, but it has several moments in which I didn't really care what was going on with the story or any of the characters.",
            "review_date": "2012-06-26",
            "source": "rt"
        },
        {
            "content": "It's so cheesy and so full of romanticism, I love it!",
            "review_date": "2012-06-25",
            "source": "rt"
        },
        {
            "content": "saw the movie long tiem ago. can't remember anything though... :) not a good sign for a flick!!",
            "review_date": "2012-06-25",
            "source": "rt"
        },
        {
            "content": "Watching it now, for the 20th time? LOL!!! :-D \"I'm your huckleberry.\" ;-)  Love this movie!",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "ONE OF MY FAVORITE MOVIES!",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "best western ever made",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "Hmm, let's see, Kurt Russel or Kevin Costner?    \n\nIt doesn't really matter because Michael Biehn and Val Kilmer steal the show.  Johnny Ringo and Doc Holiday are CLASSIC.  This movie trumps Wyatt Earp in every way.\n\nAnd, for the record, Costner couldn't act his way out of a Waterworld urine processor.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "I dont always watch westerns, but when I do - I prefer Tombstone",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "\"I'll be your huckleberry\"",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "Probably one of the very best \"modern\" western movies.  The cast is absolutely awesome and they bring the story of Wyatt Earp to life in the most enjoyable and exciting way imaginable.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "I am really starting to love westerns. This is my favorite.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "Hell yes this is a great movie",
            "review_date": "2012-06-19",
            "source": "rt"
        },
        {
            "content": "I'll be your Huckleberry",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have ever seen.  Val Kilmer is amazing - easily one of his best roles.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "val kilmer makes this movie wonderful! \"i'm your huckleberry\"",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "amazing cinematography, set designs and superb acting from all cast members. One man in particular however, deserves a special mention, and that's Val Kilmer. His performance as Doc Holliday deserved an Oscar nomination and it's always a privilege watching him in this.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Amazing. One of the best Westerns ever created. The performance done by Val as Doc Holliday is outstanding.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "awesome movie but kinda odd.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Great movie. Never gets old.",
            "review_date": "2012-06-05",
            "source": "rt"
        },
        {
            "content": "Best use of the word \"cur\" in any western, before or since.  Upvote.",
            "review_date": "2012-06-04",
            "source": "rt"
        },
        {
            "content": "Kind of a ridiculous and silly last 20 minutes but nevertheless an entertaining 'western' style adventure film. The performances make it worth watching. Russell, Kilmer and Biehn are unforgettable really. Also, there are some subtle parellels to the recent (and impeccable) HBO series Deadwood. Of course Deadwood is immeasureably better, but Tombstone makes the grade for a oul watch.",
            "review_date": "2012-06-04",
            "source": "rt"
        },
        {
            "content": "Great one liners. But looses steam 80% of the way.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "Another can i get a good movie back in 3D here Hollywood?",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "By far, the best western.",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "Val Kilmer, what more do I need to say. This is my favorite western. It has many of my favorite actors in key roles.",
            "review_date": "2012-05-30",
            "source": "rt"
        },
        {
            "content": "You go and tell'm Im comin and tell'm HELLS comin with me !!",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "Best western ever made.",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "Best western movie I have ever saw. Probably Val Kilmer's best role.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "kurt russell and val kilmer make great partners in this amazing movie!!!!!!!!!!!!!!",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "This western takes awhile to get going but it is worth sticking with it. There is a nice ensemble cast and there are plenty of good actors in small roles. The performance that stands out the most is the one by Val Kilmer. If you like westerns then you should check this one out.",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have seen.",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "Really great western.  Lots of great actors in this one.   Based on a true story, a must see!  If you don't like westerns give this one a try, you won't be disappointed! :)",
            "review_date": "2012-05-23",
            "source": "rt"
        },
        {
            "content": "best western movie eva!!!!!!! i lov val kilmar as doc hoilday.",
            "review_date": "2012-05-22",
            "source": "rt"
        },
        {
            "content": "Just plain silly. There are a small handful of worthwhile moments to be had here, but, overall, the film comes across as over the top and ridiculous, full of contrived scenes that do nothing to support the weaknesses of the western genre. In fact, it seems to embrace these shortcomings as if it's a noble gesture to do so. The action scenes are boring, the dialogue is laughable, and the performances are uninspired.",
            "review_date": "2012-05-21",
            "source": "rt"
        },
        {
            "content": "If you like classic westerns you're sure to like this one",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "Certainly one of the best regarded Westerns in more recent times but it does make many missteps they all seem to make. The over indulgent length, amazing accuracy/luck of the heroes and scenes of superhuman legend played out as facts. The large cast is notable for some great performances from side characters many of whom are now stars in their own right.",
            "review_date": "2012-05-14",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time...loved it!",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Great western. Val Kilmer should have got an oscar for playing Doc Holliday. Much better that Kevin Costners Wyatt Earp.",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "AWESOME I WANT A DIGITAL COPY!!!!!",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "Phenominal film, this is what all westerns should aspire to be!",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "To me, best western ever.  And the best part is that this movie contains, in my opinion, the single greatest character in hollywood history: Val Kilmer's Doc Holliday.  I KNOW that preposterous,  I should say Peck's Atticus Finch, but Kilmer just hammered this one home.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "Not bad, keeping the whole Western genre alive.  If only for a little while longer.",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "A rousing western, anchored by great performances from Kurt Russell as Wyatt Earp, and Val \"I was robbed by the Academy\" Kilmer as Doc Holliday. The list of cool-as-hell actors in 'Tombstone' is as long as your arm, despite the inclusion of Jason Priestley. So manly, it makes one want to slap Fat Billy Bob Thornton in his face, and laugh at him for bleeding.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "It's a good western.  I liked Silverado better.  But this is based on real people so it is interesting and historical.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "The most exhilarating western ever made. This movie could not be more classic.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "Val kilmer as doc holiday makes this whole movie",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "Uh.....Just have great action in it. I just don't like the setting in this movie about Wyatt Earp. Kurt Russel did okay in it. I just don't like this version of it. I still think GUN FIGHT AT THE O.K. CORRAL  was the best. Because its older movie. This movie Kurt Russel plays Wyatt Earp was decent but........still enjoyable watch....",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever.",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "My favorite Western ever made.  Kurt Russell is great, but Val Kilmer carries the movie with his spot on delivery of such amazing dialogue.",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "It isn't all that historically accurate, but it sure is entertaining.  Val Kilmer back when he was riding high on having been Ice Man, but way before the complete and total let down of the Saint.  Kurt Russell is spot on, Michael Biehn is very decently evil, Sam Elliott is excellent, and Bill Paxton is just funny enough to make it all work.  They even cast Jason Priestley as a goofy sissy whipping boy, fantastic.  Billy Bob Thornton before Billy Bob was \"Billy Bob\" is pure brilliance.",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "Already a great classic, & the main one liner I'll be you huckleberry",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "I don't like westerns usually.  I liked this version of tombstone, val kilmer, sam elliot, and of course kurt russell were fantastic, so was jason priestley from 90210 as he will be known most for and bill paxton from well too many things to list, only other westerns I sort of like are both the movie and tv series of magnifficent 7 and maybe purgatory (pergatory, one of these has got to be right)",
            "review_date": "2012-04-30",
            "source": "rt"
        },
        {
            "content": "a good one my dad watches it whenever it's on lol",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "I saw this film on the big screen (the only way to see a good film) and loved it.  I know it's not historically accurate but it's interesting anyway though I thought Dana Delaney's maneating character should've been shot.  Anyhoo, good film, does Sam Elliot play anything else but sheriffs and civil war officers?  Val Kilmer played possibly the finest Doc Holliday ever.  Kevin Costner's Wyatt Earp was probably more historically accurate but this is more entertaining.",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Val Kilmer makes the movie.  I love Westerns and this one doesn't disappoint.",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "This was the best tombstone!  Of it's time",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "make a doc holiday spin off",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "Just because I recorded it, then purchased it on VHS, and then on DVD does not make it my favorite movie!! ok so it does.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "This movie was awesome..I loved it!",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "One of the best Westerns ever!  if not the greatest.... Val Kilmer totally makes the movie worth it.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "VAL WAS GREAT IN THIS",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Just an awesome, shoot-em-up Western that's good to view at any time you want to see bullets flying and the body-count rising. Also, Sam Elliott is in his ideal role.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Love it, love it, love it!",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Loved this movie when I was a kid!",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "2nd best western ever in my opinion, rivaled only by Lonesome Dove. Val Kilmer steals and makes the movie. I'm your huckleberry.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "I'm your Huckleberry.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "right up there with unforgiven\r\nVal Kilmer shines ...",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "Why did they even attempt to make this again? Wyatt Erp? Kevin Kosner? What a joke. Kilmer, Russell, Elliott, Paxton, Booth, Biehn, Wheew.. \r\nYou know \"I'm ya huckleberry\"",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "I love this movie!!! It's my favorite western!!",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "This movie is awful. I actually couldn't sit through the whole thing the first time I watched it. This movie was so bad that it took me two tries to watch it.\n\nI could care less about historical accuracy. This movie was like some kid's awkward wild west fantasy. Every waking moment of this movie is astoundingly, ingeniously bad. I'm generally forgiving of cliches, but this movie lays them on like a kid in a candy buffet.",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "One of the best Westerns ever made!",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "One of my favorite Westerns. Tombstone is a truly great movie with fantastic performances from Russel, Kilmer and the rest of the all-star cast. This film tells a fantastic story, and is always entertaining and high-octane. Awesome action, soundtrack, script and very quotable dialog. On a side-note, Kilmer was totally snubbed an Oscar nomination.  \nTombstone is a classic of the Western genre, if you haven't seen it, check it out.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "Tombstone is without a doubt the most authentic portrayel of the events in the lives of the people involved with the gunfight at the OK Corrall.   It is by far the best western ever.  And if you don't like this movie, then I will fight you and thats no lie.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "Very good Movie and how in the world Val Kilmer didnt get an Oscar let alone not get nominated just shows you how out of date the Oscars are!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "I'll be you huckleberry.",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry.",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "I love this movie and I normally do not care for westerns.",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "I'll be your huckleberry.....",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "Doc Holiday ....Wow. Best cowboy flick ever!!!!",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Val Kilmer as Doc Holliday is one of my favorite performances of all time.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Wow this is a western, a little over the top",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "My favorite Western!",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "One of the best westerns ever! Val Kilmer is phenomenal!",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "MY FIRST REAL WESTERN!",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "Tuberculosis, anyone??",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "CLASSIC COLLECTORS ITEM",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Loved the gun fights especially\r\nDoesnt hurt it had Sam Elliot one of the sexiest man in it",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Great western. Val Kilmer steals the show in this movie and Kurt Russell does a great job as Wyatt Earp. \n\nI'll be your huckleberry.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "\"You're a daisy if you do....\"",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "So good ...\n\"I'm your huckkle berry \".",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "You know after watching The Quick And The Dead which I just reviewed and True Grit (2010) which I'll review sometime later, I didn't think I will list another western movie to watch and like but I have and the movie is called Tombstone. The story is about three brothers, Wyatt played by Kurt Russell, and his two other brothers Morgan played by Bill Paxton and Virgil played by Sam Elliot arrive to Tombstone in Arizona to build their fortune with their wives. His long-time best friend Doc Holliday played by Val Kilmer lives there but unfortunately for them, the town is taken over by a group of brutal outlaws called the Cowboys. When the town marshal is killed by one of them, Wyatt steps in to prevent the lynching and this starts the rivalry between the three brothers and The Cowboys. Virgil then takes over as town marshal and arrests several of the Cowboys causing them to kill both Virgil and Morgan causing their wives to leave Tombstone while Wyatt stays behind with Doc to seek revenge and hunt down every last one of the Cowboys until they meet up with the leader Johnny Ringo played by Michael Biehn who wants Wyatt to duel him. The movie had excellent cinematography that I guess was supposed to be filmed in the 1920s because the movie was supposed to be historical fiction but it was great. The cliche action was great and so was the western score. It wasn't really that bad as I really, really enjoyed it. Tombstone gets a weak 9.45/10.",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "A very glossy western. Glorification of the old west.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "They chose the right actors for the movie.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "I can be your huckleberry",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Even with the historical inaccuracies this film is definitely one of the 10 best westerns ever made.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "you can never go wrong with this movie",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Another classic modern-day western.  Terrific performances all around.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "Absolutely legendary story, with great acting and excitement.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "I gave an extra half star just because Kilmer is an exquisite Doc Holiday.",
            "review_date": "2012-03-23",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time.",
            "review_date": "2012-03-22",
            "source": "rt"
        },
        {
            "content": "This is a great western film with some killer performances by Kurt Russell, Val Kilmer, and Sam Elliot. Russell plays Wyatt Earp who comes into Tombstone trying to leave his law days behind him and go into business, but ends up with no choice but to fight when his brother is killed. Though this Hollywood version of Wyatt Earp isn't exactly historically accurate, and rushes through a little too fast without much character development, It is still an entertaining film with some good action",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "Kurt Russell and Val Kilmer own these roles. Any time I think of Wyatt Earp or Doc Holiday I think of those two.",
            "review_date": "2012-03-20",
            "source": "rt"
        },
        {
            "content": "One of the greatest characters of mine, Doc Holliday. This is just one tough western. Kurt Russel is also the man in this too.",
            "review_date": "2012-03-19",
            "source": "rt"
        },
        {
            "content": "One of the greatest westerns made",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Great reworking of the Gunfight at O.K.Corral story, both Kurt Russel and Val Kilmer excel as Wyatt Earp and Doc Holliday, plus a great BGM and  the atmosphere of the Wild West.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "Tombstone is my favorite western of all time. It's the best as far as acting and story. Just because its not eastwood or J. wayne doesnt't mean it isnt great. It's the best acted western ever! eastwood, Wayne and all those other old school guys are great for sure but they are monotoned and the same tough talking character. Val Kilmer and Kirt Russel give by far the best performances of there careers. Kilmers Doc Holliday ranks with some of the greatest ever.",
            "review_date": "2012-03-14",
            "source": "rt"
        },
        {
            "content": "This is a stupid movie about four fools who rape people out of money but then get morals and take on an army of \"cowboys\" and win because they are paid more as actors.  First off, the Cowboys have Earp outnumbered the entire movie, but rather than fight him \"in mass\", they always fight him in smaller numbers.  In the \"night of the long knives\" when the 30-40 cowboys decide to kill all four fools at night, instead of coming with all their forces they only send a couple of men and only kill the young fool and wound the old fool and Earp survives because he is paid the most in the movie.  Earp then puts together a small, heavily outnumbers posse and instead of the cowboys sticking together they let Earp gun them down in small numbers until the cowboys set a trap and catch the outnumbered Earp in a cross-fire and it is hopeless until Earp leaves cover and instead of just gunning him down the lead cowboy also leaves cover and runs out of ammo and gets killed.  Then if that is not bad enough, outnumbered by 10 to 1, Ringo, who takes over as leader of the Cowboys, asks for a stand-up fight rather than just bringing all his forces to bear and just outright overwhelming Earp and his pitifully small force.  This is as stupid as a movie can be. I have watched around 25 John Wayne Westerns and each one of them is far better than this stupid movie!",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "Wish I could give it more tha 5 stars!",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "i'll be your huckleberry",
            "review_date": "2012-03-08",
            "source": "rt"
        },
        {
            "content": "Very good film and a great blend of an old fashioned western film and good acting. Well worth a watch.",
            "review_date": "2012-03-03",
            "source": "rt"
        },
        {
            "content": "I'm a sucker for westerns...and this was well worth it.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "One of my most favorite movies ever!",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "My second favorite western film ever. Val Kilmer is amazing as Doc Holiday!\n\"I'm your huckleberry\"",
            "review_date": "2012-02-25",
            "source": "rt"
        },
        {
            "content": "A dying genre. One of the last great Westerns.\nA film with great cinematophraphy spliced together with great editing and filled with great actors both old and new. Brand named and character whom all gave great performances wether it is a small role or large. \nDefinately one to see. \nShit, if this film was made recently, THE DARK TOWER, THE LONE RANGER, and other western (or western like) films would have had no problems getting made.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "Trumped up version of the Gunfight at the OK Coral.",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "One of the better Westerns in recent memory.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "One of the best Westerns in the last 20 years. Kurt Russell is amazing as Wyatt Earp but it is Val Kilmer as Doc Holliday that steals the film. He's got the best lines and the best scenes. I was not so sure if Kilmer could pull off a Doc Holliday, especially since his role has been played quite differently in all the Tombstone stories. I would go so far to say Kilmer deserved awards nomination for his turn as the good Georgia dentist with a fast draw. Sam Elliott and Bill Paxton are always solid as strong supporting characters and this film was no different. While I thought the chemistry between Dana Delany and Russell was weak, that did not take away from the overall strength of this film. Highly recommended film.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "While it has some issues in the story and pacing, Tombstone is an exciting and extremely well-made tribute to westerns, combining memorable dialogue with great performances. Well worth any western fan's time.",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "Val you magnificent bastard",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "Teh greastest cowboy movie ever",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "Awesome western!!! Val Kilmer is wicked in this!",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "The best version of the Wyatt Earp story. Val Kilmer's deserved recognition for his portrayal of Do Holiday,one of his best perforamcnes ever. Tombstone stands on its on step in way of westerns, and a high one at that.",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "One of the best westerns ever made with line after line of memorable dialog, realistic fight scenes and a host of stars.",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "See it for the bullet-taking-out scene. Its crazy.",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "I love this movie. Me, my friends James, Pat and Sean can recite the entire movie. Kilmer was robbed of a Oscar nom and Russell, Paxton, and Elliot are excellent as the Earp brothers. A perfect movie.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "I can see this movie over and over agian. Love it !!!",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "I'm you're huckleberry. Very stylish telling of the Wyatt Earp Legend. More flashy, less accurate telling, but a lot of fun.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "Cheesefest. Give me a break.",
            "review_date": "2012-01-22",
            "source": "rt"
        },
        {
            "content": "501st flixster rating.",
            "review_date": "2012-01-22",
            "source": "rt"
        },
        {
            "content": "Awesome western. Val Kilmer is great in this movie.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "My second favorite western film ever. Val Kilmer is amazing as Doc Holiday!\n\"I'm your huckleberry\"",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "Val Kilmer made the movie...",
            "review_date": "2012-01-18",
            "source": "rt"
        },
        {
            "content": "Great contemporary Western, one of the first to actually pay attention to period-correct costumes, guns, and sets.",
            "review_date": "2012-01-16",
            "source": "rt"
        },
        {
            "content": "val kilmer is a genius",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "I can watch this over and over. No, it's not the best Western ever made but it has a special place in my memory. \"I'll be your Huckleberry.\"",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "\"I'm your huckleberry\"  Luvz it.",
            "review_date": "2012-01-13",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is superb as Doc Holliday! That's all you really need to know about this movie to be honest. It has a great story as well but his portrayal is worth seeing the movie alone.",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "best cowboy movie ever!",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "Two words: Western Classic",
            "review_date": "2012-01-09",
            "source": "rt"
        },
        {
            "content": "Now there a good western.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "You're a daisy if you do.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "old looking but ultimately awesome western.",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "My favorite western!",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "one of those movies that has all kinds of quotes and every time it comes on tv, i stop to watch it...",
            "review_date": "2012-01-02",
            "source": "rt"
        },
        {
            "content": "Tombstone is one of the best westerns I've ever seen!  And just so all you pun-lovers out there know, I'm not talking about the Best Western hotels.  Tombstone has a great cast featuring Kurt Russell, Val Kilmer, Billy Zane from Titanic, and even a minor role by Thomas Haden Church from the TV show \"Wings!\"  The film may have some minor elements of common hollywood cheese, but even some of those cheesy parts really happened!  Don't forget, Tombstone is a true story!  Val Kilmer also does a perfect job with his \"huckleberry\" line!  Ha ha!  This movie is also famous for one of the great history-making movie flaws!  You'll find it.  And you'll like this movie a lot!",
            "review_date": "2012-01-02",
            "source": "rt"
        },
        {
            "content": "Tombstone is one of the best westerns I've ever seen!  And just so all you pun-lovers out there know, I'm not talking about the Best Western hotels.  Tombstone has a great cast featuring Kurt Russell, Val Kilmer, Billy Zane from Titanic, and even a minor role by Thomas Haden Church from the TV show \"Wings!\"  The film may have some minor elements of common hollywood cheese, but even some of those cheesy parts really happened!  Don't forget, Tombstone is a true story!  Val Kilmer also does a perfect job with his \"huckleberry\" line!  Ha ha!  This movie is also famous for one of the great history-making movie flaws!  You'll find it.  And you'll like this movie a lot!",
            "review_date": "2012-01-02",
            "source": "rt"
        },
        {
            "content": "xcellent Movie...don't be concerned about the historical facts. Just enjoy it for what is... great entertainment!",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "Another remake ... (original: gunfight at the OK coral ?)\nAre we out of books/stories ? Wasn't the original good enough ?",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "I'm your huckleberry...",
            "review_date": "2011-12-26",
            "source": "rt"
        },
        {
            "content": "\"I've got two guns...one for each of ya.\"",
            "review_date": "2011-12-24",
            "source": "rt"
        },
        {
            "content": "While not a defining piece in this dying breed of genre, Tombstone offers a pleasant balance of grit and ethos while Kilmer goes on to steal the show from the already star studded male ensemble.  What tears it down; however, is it's brutally elongated conclusion.",
            "review_date": "2011-12-22",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns.",
            "review_date": "2011-12-21",
            "source": "rt"
        },
        {
            "content": "Saw it, liked it, didn't love it. It's a good old west movie, but it's still an old west movie. Same plot as all the others, but filmed in the 90s. Why does everyone think it's so amazing, again?",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "I'LL BE YOUR HUCKLEBERRY.\r\nYOU'RE A DAISY IF YOU DO.",
            "review_date": "2011-12-13",
            "source": "rt"
        },
        {
            "content": "My favorite western of all time!!!",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "One of my top ten favorite movies of all time.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "This movie is truly one of a kind. I can't explain the joy this movie brings me. I must admit I might be slightly bias in regards to this movie due to the overwhelming sentiment I hold this movie in. Kurt Rusell is great but the star that really shines is Val Kilmer. Val plays the role of his life, Doc Holiday, the ostentatious dentist turned gambler/gunfighter and tragically doomed Doc Holiday. I have probably seen this movie more than any other movie in existance.",
            "review_date": "2011-12-08",
            "source": "rt"
        },
        {
            "content": "One of my five favorite westerns. Russell, Paxton, and Elliott are rock solid as prototypical wild west lawmen. The real gem here is Val Kilmer as Doc Holliday. He's funny, quick with a reply and witticism, and the best gun our heroes have. Powers Boothe and Michael Biehn make for great villains, and you have countless recognizable performers appearing left and right. This includes an appearance by Charlton Heston and narration by Robert Mitchum.",
            "review_date": "2011-12-06",
            "source": "rt"
        },
        {
            "content": "All the guys in my family love it and it's not that bad.",
            "review_date": "2011-12-03",
            "source": "rt"
        },
        {
            "content": "Tombstone is a great western film that really takes in some issues such as crime, rebellion, and even friendship.  This story is true, which made watching it just twice as fun.  The acting from Kurt Russell was great, but the true star here is Val Kilmer who plays one of his finest roles of his career.  They made this feel and look like a truly great western like a classic Clint Eastwood movie.  But it does start off very slow and takes a while to get truly interesting, but only a small issue.  If you want a great western, you should check this out.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "you can be my huckleberry",
            "review_date": "2011-11-29",
            "source": "rt"
        },
        {
            "content": "The best western ever. Loved Kurt Russell and most of all Val Kilmer.",
            "review_date": "2011-11-16",
            "source": "rt"
        },
        {
            "content": "this has to be the best western since 1980.  this movie has an immesurable amount of talent in its star studded cast. i feel that val kilmer steels the screen as doc hollywood but, kurt russel is also at the top of his game as well. bravo!",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "I am not really a western fan, but this one was fantastic. It was not slow paced like most of the westerns I have seen and it has a large and talented cast, a good amount of action, the main characters are developed fairly well; and  for a large cast in a film, sometimes that can be really hard to do.",
            "review_date": "2011-11-15",
            "source": "rt"
        },
        {
            "content": "This movie fell a little short for me. The only redeeming thing about it was Val Kilmer's performance as Doc Holliday. Definitely worth watching if you're a Kilmer fan. Otherwise, good luck sititng through it.",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "Pretty entertaining film.  Watched it for the first time in ages and it holds up well.  I thought the score was distracting at times, but overall it was good.  Kilmer was amazing in this.",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "An ingenious remake of the classic \"Gunfight at the OK Corral\" story, loaded and cocked with powerful performances from Russell and Kilmer",
            "review_date": "2011-11-10",
            "source": "rt"
        },
        {
            "content": "I can't think of another movie that captures the Western genre better. First off just take a second and look at the cast they built for this. Just amazing. And everybody's performance is top notch. Why Val Kilmer was never even nominated for an Oscar is just mind boggling. He steals every scene. Everything about this just makes me feel like I'm right there. The clothes and facial hair, settings, props, scenery, and especially the dialogue. I love every line. And the camera work captures everything with such surgical skill. Hail to Cosmatos for making a Western that calls back to the days of John Ford and John Wayne.",
            "review_date": "2011-11-09",
            "source": "rt"
        },
        {
            "content": "A l'epoque ou chacun y allait de sa petite relecture du Reglement de compte a  OK Corral, j'avais mate \"Wyatt Earp\" avec le (alors) bankable Kevin Costner.  Manque de pot, c'est \"Tombstone\" que j'aurai du voir.  Pour un regard actuel, il est pourtant evident que ce Western semble issu d'une autre epoque.  Il ne s'agit pas d'un huit-clos en espace ouvert a  la \"3h10 pour Yuma\", ni d'un Western-Noir geographiquement atypique comme \"The proposition\", encore moins d'une oeuvre crepusculaire et contemplative telle que \"L'assassinat de Jesse James\" : non, le classicisme de \"Tombstone\" a plus en commun avec les glorieux ancetres des annees 50 et 60 qu'avec la nouvelle vague des annees 2000.  C'est peut-etre une autre caracteristique strictement generationnelle qui parvient a  lui conserver un reel attrait a  15 ans d'intervalle : la vision megalomane et depourvue de second degre de l'Actionner frique des annees 90, ceux qui recherchaient la sequence mythique a  n'importe quel prix, vous collaient dans les oreilles la bande-son qui vous hanterait les dix annees suivantes et vous transformaient une celebrite locale  (le type en kilt, le Minutemen patriote, le gladiateur,...) en super-heros ultime.  Mine de rien, le procede fonctionne toujours a mort sur moi et il y a fort a parier qu'aussi en retrait que soit Wyatt Earp, et aussi cabochard que soit Doc Halliday, Kurt Russell et Val Kilmer en resteront les interpretes les plus memorables pour encore un bon paquet d'annees.",
            "review_date": "2011-11-07",
            "source": "rt"
        },
        {
            "content": "Great movie.  My favorite moment was towards the end but I don't want to tell and spoil the movie.  It also has one of my favorite quotes by doc holiday.  \"I'll be your hucklberry\"",
            "review_date": "2011-11-01",
            "source": "rt"
        },
        {
            "content": "Real moustaches, real thunderstorms, and one of the greatest lines ever given.....\"....tell em I am coming and hell's coming with me.\"",
            "review_date": "2011-10-30",
            "source": "rt"
        },
        {
            "content": "Love this movie, I think its the black long coats that make it soo cool!",
            "review_date": "2011-10-26",
            "source": "rt"
        },
        {
            "content": "one of the greatest westerns ever...perhaps? (not including the eastwood and leone movies...those are the best)",
            "review_date": "2011-10-17",
            "source": "rt"
        },
        {
            "content": "I'll be your huckleberry",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "Another of my Top 5 movies with phenomenal acting and stunning performances by these wonderfully talented stars.\nFantastic story of Wyatt Earp and his gang of brothers that set out for a great new life in the Southwest.\nPlenty of dramatic license taken to make the fiction more riveting than reality and keep  you pulling for the underdog.  Wonderfully written and great scenery.  The lead characters from top to bottom do everything right to make you happy and sad, just the way a great story should.",
            "review_date": "2011-10-10",
            "source": "rt"
        },
        {
            "content": "This is a very well casted movie!! Excellant!!",
            "review_date": "2011-10-03",
            "source": "rt"
        },
        {
            "content": "A quality cast in Kurt Russell, Michael Biehn, the legend that is Powers Boothe, Sam Elliott but Val Kimer eclispes everyone of them ,the showdown with him and Biehn is one of the finest moments in the history of cinema 8)",
            "review_date": "2011-09-30",
            "source": "rt"
        },
        {
            "content": "Fuck yeah I own this movie now!!!",
            "review_date": "2011-09-28",
            "source": "rt"
        },
        {
            "content": "Val Kilmer's best performance. Kurt Russell. Brilliant.",
            "review_date": "2011-09-25",
            "source": "rt"
        },
        {
            "content": "Tombstone is among my all-time favorite films.",
            "review_date": "2011-09-24",
            "source": "rt"
        },
        {
            "content": "I don't know why but I love Westerns.",
            "review_date": "2011-09-21",
            "source": "rt"
        },
        {
            "content": "\"I'll be your Huckleberry\"\n- Doc Holiday\n love that line",
            "review_date": "2011-09-13",
            "source": "rt"
        },
        {
            "content": "Not as good as some other recent westerns but still worth watching",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "Fantastic western. Loaded with memorable lines, aweinspiring acting from a group of fantastic actors (Val Kilmer especially shines, bringing just the right amount of decadence and valour to his character) and just an all out fantastic amount of action.",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "AWSOME DUSTER!!!!GREAT ACTORS...",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "I am not really a western fan, but this one was fantastic. It was not slow paced like most of the westerns I have seen and it has a large and talented cast, a good amount of action, the main characters are developed fairly well; and  for a large cast in a film, sometimes that can be really hard to do.",
            "review_date": "2011-09-01",
            "source": "rt"
        },
        {
            "content": "Is it just me, or is this movie really long?\r\nNo, wait. I checked. It really IS long, so it didn't just feel like it was.\r\nThe main problem was that some things were left unexplained, lost in the slack plot-line. After looking them up, I could finally enjoy this movie, and I thought it was a great one. Outstanding performance by Val Kilmer, who can play a dying person better (looking) than anyone else. Kurt Russell did not QUITE convince me - at least not all the time -, but that's just details you aren't supposed to look at in a western anyway.",
            "review_date": "2011-08-30",
            "source": "rt"
        },
        {
            "content": "My favorite western movie.  Kurt Russel was excelent in his role but Val Kilmer stole the show as Doc Holiday.  I wish I could give it 6 stars :)",
            "review_date": "2011-08-26",
            "source": "rt"
        },
        {
            "content": "Val Kilmer as Doc is awesome",
            "review_date": "2011-08-23",
            "source": "rt"
        },
        {
            "content": "Flaws as it may have, as do any other biographical/historical western, Tombstone is just about the most entertaining western ever made. It is of epic proportions, and I'd only wish it was an hour longer. The acting is superb, both by Kilmer and Russel, but also the minor parts are played flawlessly. The cinematography is great and the score is hair-risingly perfect! Small historical  adjustements have been made in order to make the film more fluent, but I still miss some of the epic dwelling at characters. But maybe that's just me, or because the characters are so awesomely portrayed. Val Kilmers best performance to date. Lots of wonderful one-liners and an epic score...al makes this a western masterpiece.",
            "review_date": "2011-08-21",
            "source": "rt"
        },
        {
            "content": "Excellent wester movie about law bringer Earp brothers and Holliday (dying of tuberculosis in the whole movie) go toe to toe against the Johnny Ringo and his Cowboys",
            "review_date": "2011-08-15",
            "source": "rt"
        },
        {
            "content": "Doc Holiday = the man.",
            "review_date": "2011-08-13",
            "source": "rt"
        },
        {
            "content": "The acting and cinematography is great. An awesome western!",
            "review_date": "2011-08-09",
            "source": "rt"
        },
        {
            "content": "Pretty decent, Val Kilmer was great a Doc Holiday.",
            "review_date": "2011-08-09",
            "source": "rt"
        },
        {
            "content": "Have to get me some boots..",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "John Wayne would be proud.",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "One of my favorite in this genre",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "Val Kilmer was robbed big time for not getting an Oscar for this one.",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "Oh what is there to say about this movie but that its awesome all the way around!",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Top notch.",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "I want to be doc holliday",
            "review_date": "2011-08-03",
            "source": "rt"
        },
        {
            "content": "My favourite western of all time!",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "At very least, a top 20 western of all time. Great move. Great acting.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Shh! Don't tell my boss I only gave it 3 stars.",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "My favorite modern Western! Val Kilmer is phenomenal as Doc Holliday.",
            "review_date": "2011-07-26",
            "source": "rt"
        },
        {
            "content": "This is by far one of the greatest movies.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "Jason Priestly becomes Billy the Kid and Frank Stallone has a bit part.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "I'm your Huckleberry.\n\nYou're no daisy. You're no daisy at all!",
            "review_date": "2011-07-19",
            "source": "rt"
        },
        {
            "content": "Worthwhile revisionist western.",
            "review_date": "2011-07-17",
            "source": "rt"
        },
        {
            "content": "One of my all time favorites.",
            "review_date": "2011-07-14",
            "source": "rt"
        },
        {
            "content": "Great and memorable performance by Val Kilmer.",
            "review_date": "2011-07-11",
            "source": "rt"
        },
        {
            "content": "Before Johnny Depp was Jack Sparrow, Val Kilmer was Doc Holiday- one of the most quotable movie characters of all time. This film has a few very obvious flaws, but covers it up with an all-star cast and an incredibly well written script. Without a doubt one of the greater westerns ever made, and a bad-ass one at that.",
            "review_date": "2011-07-11",
            "source": "rt"
        },
        {
            "content": "Val Kilmer made this movie. I wasn't near as interested in scenes that didn't have Doc Holiday in them than scenes with him. Great script and acting all around Tombstone is one I'll be quoting for quiet some time",
            "review_date": "2011-07-09",
            "source": "rt"
        },
        {
            "content": "Although its conclusion is generic (being faithful to the true events), this star-strewn classic western promises top notch adventure and drama with a most memorable performance by Val Kilmer. Thumbs up!",
            "review_date": "2011-07-09",
            "source": "rt"
        },
        {
            "content": "If you don't love this movie, something is wrong with you. A cast with powerhouse performances, bad guys you love to hate, a phenomenal performance by Val Kilmer, and fun/cool dialogue. Cheers to one of the best damn Westerns I've seen in my life.",
            "review_date": "2011-07-07",
            "source": "rt"
        },
        {
            "content": "I didn't like the love story, but the rest is awesome. Val Kilmer makes the movie.",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "One of the best modern western films out there",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "Great movie and highly quotable.",
            "review_date": "2011-07-03",
            "source": "rt"
        },
        {
            "content": "Val Kilmer is the most badass Doc Holiday period.",
            "review_date": "2011-07-03",
            "source": "rt"
        },
        {
            "content": "An overall entertaining film. It starts very promising, but it comes apart after the Corral scene. After that the story meanders, we get dozen of random montages of shooting that mean next to nothing. Even the final good scene of the film were Holiday takes out Ringo is ruined with music that sounds like 1970's Godzilla thrash!\nGood casting and a Val Kilmer that nearly walks off with the movie, being sarcastic and bad-ass with style,  save the day.\nAlso, Sam Elliot has West written all over him...",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "This review turned out better than I expected, seeing as I'm coming down from this film's dramatic, fact-based counterpart \"Wyatt Earp\". It's tough to make that transition from captivating history lesson to a bunch of historically incaccurate action. I'm kidding, this is a good film. Boy, I'de be worried about getting in trouble for my \"Wyatt Earp\" praise if it wasn't for the fact that among the few people who read my reviews, I'm not likely to find a \"Wyatt Earp\" viewer, since I'm probably the first one since it came out in 1994. Still, it does suffer from cliches, bad dialogue and some overdrawn segments. In spite of this, the film is supported by great production designs, good makeup and a smooth pace. The greatest strengths seem to be the excellent cinematography, some solid performances and solid action sequences.\r\n\r\nOf course, the question on everyone's mind seems to be \"Do I go with this or 'Wyatt Earp'?\" Well, I can certainly see why people like this better than \"Wyatoo...\"Wyeet Ur...Wyatt Art... Man, I can't even type that. Really, it's hard to compare the two films, because this film is almost the polar opposite of \"Wyatt Earp\" in theme, as it has almost completely fictionalized the event of this time period in order to set up a more action-packed environment, where as \"Wyatt Earp\" is a lengthy, fact-based, dramatic study on basically the entire life of Earp. They're very different genres, but if we're deciding on which one is the better film, in general, this film is not as respectable, captivating, fascinating or intellegent, for that matter. I'm sure I'll get some heat for this, but I'm unquestionably going with \"Wyatt Earp\". Of course, if you're not as tolerant about the 3 hour runtime and just want an action-packed fun time, then by all means, check out \"Tombstone\" and while you're at it, go see \"Transformers 3\" and give it a 100%, then figure out how to give a 0% rating just for \"The Curious Case of Benjamin Button\" before you write an incomprehensible review critisizing it for not having enough gore or nudity. No, this film isn't that stupid, but don't expect to get much depth in the real story.\r\n\r\nReally, I joke about this not being as deep as \"Wyatt Earp\", but this really isn't that sophisticated of a film and I'm not just saying that that's a strike against it because I'm so use to the depth of \"Wyatt\". The action-oriented atmosphere and cliches do take their licks at this as a general film. Still, that's not to say that \"Tombstone\" isn't an entertaining, action-packed thrill ride that's worth experiencing. One more thing: \"What's with all of the moustaches?\" This is the real \"Magnum P. I.\". Oh wait, they didn't have magnums back then. Ah, I don't regret it.",
            "review_date": "2011-06-30",
            "source": "rt"
        },
        {
            "content": "Entertaining . One of my all time favourites .",
            "review_date": "2011-06-30",
            "source": "rt"
        },
        {
            "content": "This movie is one of my favorite Westerns. Kurt Russeel and Val Kilmer steal the scene in this action packed ride.",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Love this movie!! Without a Val Kilmers best performance!!!",
            "review_date": "2011-06-26",
            "source": "rt"
        },
        {
            "content": "One of two OK Corral/Wyatt Earp movie released in the same year. The other one was a forgettable Kevin Costner effort. Tombstone did everything right. Great performances, compelling characters, superior cast and much better action. Plus one of the greatest lines ever uttered on film.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "It never becomes more than the sum of its parts, but it never needs to - it's endearingly passionate, Kilmer's performance is outstanding, and its entertainment value is off the scale. It's rewatchable, even straight after the first viewing, and there's no intellectual message or social commentary behind it; it's simply a masterpiece in fiction, shrouded in myth and legend, and the war between the decent folk and the cowboys. Just excellent.",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "Val Kilmer should have taken an Oscar for his portrayal of Doc Holliday",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "Every word of dialogue out of Val Kilmer's mouth makes this movie worthwhile.",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "After watching ten minutes of \"Tombstone\" I turned it off mainly because it was making me lose faith in Hollywood and I almost started to not like the western genre. The characters who are supposed to be bad guys cracked me up, they looked so incredibly silly that I thought I was watching a Monty Python Skit. I'd say that Val Kilmer is one of the worst actors in the business today and after seeing him once on the screen it seemed like he was trying to be Tim Robbins in the Shawshank Redemption. I was not at all interested in any of these people and when you have a group of strangers ride into a town and kill everyone in it I think that the viewer should at least be mildly interested in who the people are but I really immediately did not give a crap. Perhaps one might say that I did not give it a chance but after ten minutes of un-engaging crap I decided that this movie was not for me.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "Makes me wish I had a mustache!",
            "review_date": "2011-06-16",
            "source": "rt"
        },
        {
            "content": "A sprawling and suitably violent western that goes much deeper into the historically and mythically important clash between the Earps and the Clantons. The ensemble works terrifically, especially a legendary performance from Val Kilmer as Doc Holiday, this reconciles myth with history, entertainment and drama to produce a human account of America's legends.",
            "review_date": "2011-06-15",
            "source": "rt"
        },
        {
            "content": "Beware of Doc Holiday.",
            "review_date": "2011-06-10",
            "source": "rt"
        },
        {
            "content": "ill be your huckle berry",
            "review_date": "2011-06-09",
            "source": "rt"
        },
        {
            "content": "In George P. Cosmatos' \"Tombst-- wait a second. Who the frick is George P. Cosmatos'? Oh well. This movie was pretty damned good, so he's o.k. in my book. Anyway, in George P. Cosmatos' \"Tombstone\" he creates an endlessly entertaining modern western; something that is nearly unachievable these days. The movie features about as much action as it features comedy, tension, and drama. I found myself incredibly impressed by this movie and how gratifying it was to watch. All the performances were great, especially Kurt Russell's memorable portrayal of legendary lawman Wyatt Earp. But. . .Val Kilmer, bro. This guy is a frickin' riot; funny as hell, and badass too. Probably (and sadly) the greatest role he's ever played.  I found very little to criticize in this movie- the script was well written, the camerawork was aesthetic, and the music was pretty appropriate for the movie. I feel that \"Tombstone\" is quite possibly one of the greatest westerns I've ever seen.  Immensely entertaining. I highly recommend it. . .pardner.",
            "review_date": "2011-06-09",
            "source": "rt"
        },
        {
            "content": "this movie was so brilliant i was amazed of how good the movie was the action was amazing and i was never bored in this movie",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "One of my favorite westerns of all time. Great cast, and Kurt Russell, Sam Elliot, Bill Paxton and Val Kilmer have great chemistry. Great memorable dialogue, and every actor and actress does a perfect job.",
            "review_date": "2011-06-02",
            "source": "rt"
        },
        {
            "content": "Hello yeah!  Lots of men, mustaches, guns, dusters/long jackets, boots and revenge- you know I love it! Oh and not to mention Val Kilmer looks super hot (even if he is dying in it- hahaha!)",
            "review_date": "2011-05-31",
            "source": "rt"
        },
        {
            "content": "This is a great western film with some killer performances by Kurt Russell, Val Kilmer, and Sam Elliot. Russell plays Wyatt Earp who comes into Tombstone trying to leave his law days behind him and go into business, but ends up with no choice but to fight when his brother is killed. Though this Hollywood version of Wyatt Earp isn't exactly historically accurate, and rushes through a little too fast without much character development, It is still an entertaining film with some good action",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "I'm your Huckleberry!",
            "review_date": "2011-05-27",
            "source": "rt"
        },
        {
            "content": "Definitely one of my favorites.",
            "review_date": "2011-05-25",
            "source": "rt"
        },
        {
            "content": "Pretty good. Dana Delany is really hot.",
            "review_date": "2011-05-21",
            "source": "rt"
        },
        {
            "content": "\"Skin that smokewagon and see what happens.\"  Other than that annoying bitch who sings \"Red River Valley\", this movie is damn near perfect.",
            "review_date": "2011-05-17",
            "source": "rt"
        },
        {
            "content": "Tombstone's got a pretty decent story, great performances, and baddassery and cool one-liners just like every other western. But where Tombstone fails is it's, sloppy ambiguous writing. The structure towards the end is just a crappy mess, and the ending is tied together horribly. I was liking the film for the most part, until the last ten minutes completely ruined my experience. But I also have to admit that the rest of the film is almost also as poorly structured, and there are a few emotional and narrative hang-ups that are a bit confusing. The only thing that saves this film from being horrendous, is that Val Kilmer's AMAZING performance as Doc Holliday, and all the great one-liners and badass shootouts. Other than that, this film just isn't worth the ride.",
            "review_date": "2011-05-12",
            "source": "rt"
        },
        {
            "content": "Greatest western of my short lifespan.",
            "review_date": "2011-05-10",
            "source": "rt"
        },
        {
            "content": "A fabulous little western that's packed with stars and complete bad-asses. Plus, it's Wyatt Earp. Again, if you're a fan of westerns, you've probably seen it, otherwise, you should.",
            "review_date": "2011-05-06",
            "source": "rt"
        },
        {
            "content": "Great 90s western, with a surprisingly apt cast. Can't say I could picture Russel and Kilmer in a western film until I first saw this. A couple of great shoot-outs and emotional scenes makes this movie a memorable experience.",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "Hur kan jag ha missat denna guldklimp frÃ¥n 90 talet. Val Kilmer i topp form.",
            "review_date": "2011-04-28",
            "source": "rt"
        },
        {
            "content": "I'll be your huckleberry.",
            "review_date": "2011-04-27",
            "source": "rt"
        },
        {
            "content": "An ambitious modern western that while entertaining does not live up to what it could have been.",
            "review_date": "2011-04-25",
            "source": "rt"
        },
        {
            "content": "This is one of my favorite westerns.  Not an original story, nor historically accurate, the style seems to take a lot from other western directors, but it is put together beautifully and the casting is brilliant.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "Everyone is great but Val Kilmer's Doc Holliday steals the show. By far my favorite western.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "Val Kilmer... What the hell happened after this?",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "the Best Western, and greater than Goodfellas, though not by much, and similar in a lot of ways, also, Kilmer's greatest performance, and Russell's too, by far, my favorite Kurt Russell movie, one of the worst acting performances of all time, Bill \"don't let em get you brother\" Paxton couldn't even ruin this movie",
            "review_date": "2011-04-21",
            "source": "rt"
        },
        {
            "content": "Tombstone is a decent western that would warrant a little bit higher rating from me if they didnt botch the ending so badly. Yeah some of the acting is kind of corny especially by Kurt Russell in some parts especially the famous \"Noooooo!!!\" scene but with those corny moments aside he gave a pretty good performance. The roles played by Val Kilmer and Sam Elliot were to me strong points in the film. Of course Sam Elliot in anything is a plus and this movie is no exception. The action sequences are part of the saving grace of this film as well as the cinemotography but I usual always like Western films cinemotography. Its a good shoot em up western that falters at the end of the film. But overall I would recommend it to people that just want to see a decent shoot em up film with good action.",
            "review_date": "2011-04-20",
            "source": "rt"
        },
        {
            "content": "A revival of what a western should be Tombstone is brilliantly acted and filmed. A must see modern classic.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "My all-time favorite!",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "a Great film...much better than Wyatt Earp. Val Kilmer should have won the Oscar!",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "i'm not much for westerns but i enjoyed this one, prolly cause of russell as wyatt earp and kilmer as doc holliday.",
            "review_date": "2011-04-12",
            "source": "rt"
        },
        {
            "content": "Really good western.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "My favourite Western!",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Kurt Russel, Sam Elliot, Bill Paxton and Val Kilmer. Awesome, enough said.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Perhaps the only western in my top ten, Kilmer's Doc Holiday could easily be grouped in with the greatest portrayals of loyal sidekick in all cinema.",
            "review_date": "2011-04-05",
            "source": "rt"
        },
        {
            "content": "Big fan. One of the best movies of all time. Epic mustaches, cast and ghost directed by Russell. Boosh!",
            "review_date": "2011-04-05",
            "source": "rt"
        },
        {
            "content": "This movie was one of the better Westerns. The cast was good and the plot was good. The action was good along with the drama in this movie.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "It all gets a bit cheesey, but it's no too bad",
            "review_date": "2011-03-31",
            "source": "rt"
        },
        {
            "content": "Best western movie I seen since unforgiven!!",
            "review_date": "2011-03-29",
            "source": "rt"
        }
    ]
}