{
    "rating": 0.0,
    "release_date": "1999-04-30",
    "num_reviews": 34,
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "The best cop movie from Bollywood, bolstered by stellar performances by Aamir, Mukesh Rishi n Naseer Shah.",
            "content": "I first saw this in the summer of 1999 in a theatre.Revisited it recently on a tv channel n felt like writing a review now so that I can remember the sweet summer of 1999.Bollywood to me started with Sarfarosh.Before watching Sarfarosh, me n my pals were wannabe \"cool fellas\" always preferring Hollywood movies.Always preferring Sterling, New Excelsior n Regal theaters in Mumbai for Hollywood movies.But Sarfarosh changed everything.I will never forget the summer of 1999 n i still remember i was wearing a white shirt n camel color cargo pants due to the heat.Me n my fiancé entered Gaiety theatre in Bandra, midway n that too without realising which movie was playing.That particular time a beer bar dance sequence from Sarfarosh was going on.My fiance's reaction was a big wtf n i was kinda embarassed thinking which z grade film did we enter.We decided at least we wait till one hour for the air conditioning but then we were captivated with the movie.Once the end credits rolled, we both looked at each other and started discussing the movie and how we regretted missing the beginning part.During those days vhs rental was cheap (10 rupees) n it used to b available the very same day of its theatrical release.I saw it again in the summer of 1999 on a vhs to catch up the beginning and loved the movie.The editing of the movie is brilliant. Aamir's acting is top notch. Mukesh Rishi n Naseer Shah deserved accolades.Sonali Bendre was a perfect package of cute n sexy in this movie.The movie dealt with so many relevant issues plaguing my beloved country and the way the director handled everything is top notch.Sadly the director John Matthew never got his dues. I don't kno why he didn't do more movies aft this.This movie broke all the norms of a typical Bollywood trash which were produced dime a dozen those days n surprisingly Bollywood trash is still produced these days.(Inserted this bracketed line aft revisiting it again in 2022 but this time with my teenaged kids. The print n the movie is indeed a bit outdated but now my kids r aware why their dad is a big fan of Aamir).",
            "review_date": "2013-11-05",
            "lang": "en"
        },
        {
            "review_title": "great movie - definitely worth a watch",
            "content": "This movie leaves the theatre with you and stays in your mind for a long time. A realistic and honest look at the problems our police system is facing is the theme of this movie. Amir Khan, is as usual,incomparable and produces a strong and honest performance. He and his team are a bunch of honest, hard-working cops trying to get Mumbai rid of all the terrorism and criminals. Amir Khan plays a tough cop with a rough past (his brother was killed by gangsters) and the event has led him to try and sweep crime away from Mumbai. All the actors in the movie have done their job very well, especially the actors in Amir Khan's police team. Sonali Bendre has done as much justice as she could to her role, which is kind of minimal and unfair. Yet, the movie is a great one. Naseeruddin shah is amazing as usual, and goes through with his character with ease and perfection.Worth a watch, the movie will surely not fail to impress.",
            "review_date": "2005-02-16",
            "lang": "en"
        },
        {
            "review_title": "Best Directorial Debut",
            "content": "John Matthan directs a fantastic film in his directorial debut. With so many characters popping in one after the other it would have been very difficult to maintain the flow of the film which John Matthan has done very successfuly. Aamir Khan as usual has given an excellent performance as A.C.P Rathore who is set to end the flow of Arms and ammunition from Pakistan to India. Aamir, the dedicated actor that he is, had studied all about the police force, the IPS people, talked with many police officers and stayed with some of them to study the role of ACP rathore.Nasserudin Shah has only 6 to 7 scenes but he dominates the movie. He has the role which was similarly played by Jack Nicholson in 'A Few Good Men'. Sonali Bendre is wasted in what turns out to be a fine performance by her. The surprise factor of the film is the acting of Mukesh Rishi which has got lots of critical acclaim from the critics and the general audience. Do not be surprised if he wins all the awards for \"The Best Supporting Actor\". Although the film is very predictible,the climax is the best part of the scene. This is the one of the best climax ever used in an hindi movie. Its hard to believe that this is John's directorial/writing debut.",
            "review_date": "1999-06-12",
            "lang": "en"
        },
        {
            "review_title": "flawless...",
            "content": "this is a real gem of a movie...it's right there among the top 5 of my favorite Hindi movies. the movie hooks you right away and the plot never slackens throughout...coupled with realistic treatment, it makes the movie an instant favorite. also the subject is very different - the proxy war waged by Pakistan's ISI. refreshingly and reassuringly, there are no corrupt cops in the movie! Aamir Khan as ACP Rathore is superb. he brings alive a cop's passion and determination to cleanse the system of criminals. the action sequences are played out very realistically. Mukesh Rishi as ACP's right hand man is just brilliant! This actor usually plays only \"black\" characters - this surely added to the impact of his performance (for me, at least). There are some truly heart-warming scenes of Rathore with his family. Sonali Bendre as Rathore's love interest provided some (much-needed) light moments. And, finally, Naseeruddin Shah as ghazal singer-cum-terrorist played his part with understated villainy. i love such villains - they seem so real! the climax is truly innovative - it invariably brings a smile to your face. It's difficult to spot a flaw in the movie. and considering that it's the director's debut film, you have to doff your hat to him.",
            "review_date": "2005-02-23",
            "lang": "en"
        },
        {
            "review_title": "A good movie, very good action scenes",
            "content": "The back of the DVD case claims that Sarfarosh is the first Hindi movie to take a look at some of the real reasons behind terrorism and insurgency in India. This seems like a fairly radical claim that I doubt they could really defend even though my knowledge of Hindi cinema is still far from complete. DIL SE seemed like a pretty honest examination of the subject to me, and that was several years earlier. I don't want to hold the claims on the DVD case against the movie though, as SARFAROSH is certainly an interesting take on the subject.Ajay Singh's brother is killed and his father brain damaged by terrorists when Ajay is a small boy, because his father was going to stand up against them in court or something. Ajay takes this to heart (as you would), and as a young adult he devotes himself to becoming a police inspector and fighting against crime, and terrorists in particular. The movie is essentially about one case, where Ajay has to get to the roots of an operation smuggling guns into the country. The operation is backed by a Pakistani general, with the rationale that arming criminals in India is a cheap but effective way of waging war. The movie does push a fairly unbalanced \"Pakistan aggressors, India = victims\" message, though it is very careful/keen not to equate this with Muslim vs Hindu and turn it into a religious issue.\nThe movie is fairly serious throughout - although there is a romantic interest (the lovely Sonali Bendre), it's not overplayed and does serve a useful function by building the character of Ajay and putting the case in the context of his life. For the most part though, the movie is focussed on the investigation and the encounters between the police and the criminals as they trace the criminal network closer to its roots. It's quite an action packed movie, and features some of the best action scenes I've seen in an Indian movie. No bullet ballet or kung fu, but quite realistic fights and shootouts that are never-the-less very well choreographed and filmed. The movie bears an 18 rating, because the action does get quite violent. A lot of people die in the course of the movie, and a few of them in quite gruesome ways. One thing I've noticed in quite a lot of Asian movies is that police violence is treated quite sympathetically - even as quite noble. The cops in Sarfarosh don't mess around - if threatening, beating or framing a criminal is the best way to get a result then they don't hesitate to do so. If a criminal happens to get killed in the course of an operation then they don't seem terribly upset either, unless it was somebody they wanted to interrogate .Ajay Singh is played by Aamir Khan, an actor I haven't come across before. He's not a pretty boy by any means, but he does a very good job with the character. It's a good character too - well developed and believable, honorable without being sanctimonius. The rest of the cast all do a good job too, although Sonali Bendre doesn't have a lot to do except look pretty and dance around in the musical numbers.The script for the movie is very tight, with both the criminals and the cops operations and motivations seeming quite convincing. The movie does veer a little towards preaching in places, especially towards the end, but this is forgivable. The direction is very confident and focussed, and sound and cinematography throughout are good throughout.All round, a good movie worth seeking out.",
            "review_date": "2002-05-26",
            "lang": "en"
        },
        {
            "review_title": "The best part ...",
            "content": "One of the best things about this movie is that it shows the hero taking the right path to revenge. He becomes an IPS Officer and concentrates on eradicating crime. This is in contrast with the regular Bollywood hero, who takes the shorter and easier path justified with tit-for-tat logic to kill a particular villain in the story. Thus, this movie rises above the parochial view of solving problems through one particular revenge. Otherwise also, of late Bollywood heroes are never shown as studious ones because it is only the poor students that most people like to relate to and studious people or anyone can laugh on them as well.",
            "review_date": "2006-12-04",
            "lang": "en"
        },
        {
            "review_title": "Good Story..",
            "content": "The movie haunts you long after watching it also. John Mathew Matthan did a fair job for a débutant. The story of a sincere police officer in Mumbai crime branch is just a front end for many other stories like love, friendship, patriotism, religion and bigotry etc.Aamir Khan made excellent cop in Mumbai police. But, the character of Inspector Salim is the most impressive in the movie.A must watch for all those movie buffs as this has been a very genuine effort to show what is happening across the Indo-Pak border. What made this film a different experience is the genuinity in the script.A must watch for every one out there. This will not disappoint you in any way. 9/10 from me.",
            "review_date": "2005-02-15",
            "lang": "en"
        },
        {
            "review_title": "Best movie, Best Performance",
            "content": "Aamir Khan has performed at his best. Loved the movie.Ajay Singh Rathod (Aamir Khan) is a honest officer who hates the criminals and terrorist. He loves his country. He gets some information about criminals who are involve in supply of arms in order to create terrorism.Ajay solves this mystery and reaches the root of this gang. But at the end he comes to know that this terrorism was under-supervision of his very good friend and singer \"Gulfam Hassan (Naseeruddin Shah)\" The story, Music, Dialogues, everything is just perfect.A MUST SEE",
            "review_date": "2006-10-31",
            "lang": "en"
        },
        {
            "review_title": "Crisp Script, Cracking Movie!",
            "content": "Who said Indians cannot make action movies. \"Sarfarosh\" can be compared to any of the leading hollywood actioners. Aamir Khan is too tough to look sweet in this movie. His commitment to perfection can be seen in the way he carried the movie on his shoulders. The director John too did a great job. Though I feel Naseerudin Shah's role could have got more meat as his potential wasn't tapped complete. Music too is very good. Sonali should start looking serious than trying to look cute, as she is no longer a new comer. A solid movie with sharp dialogues and a crisp script.",
            "review_date": "2000-08-14",
            "lang": "en"
        },
        {
            "review_title": "Indian cinema needs more of these!!",
            "content": "When I watched this movie, I was expecting yet another action flick with a decent storyline. I was in for a surprise. A great movie with some realistic scenes and an excellent story, this is probably the best action movie in a long time in India.In a country that has been target of terror, it is not uncommon that weapons like AK-47 are smuggled deep into the heart of it. Veeran, a tribal leader wreaks havoc by looting and killing civilians. Mumbai Crime Branch takes the case up and discovers that there are links at every level leading to the enemy government. The tribal leader, the local goon with illegal businesses (Bala Thakur), the weapons' supplier (Sultan), the middleman (Haji), the smuggler on the border (Mirchi Seth) and a Pakistani military official. This chain of evil poses a threat to the nation. The film also touches sensitive subjects like the loyalty of the common Indian Muslim towards the state, the mentality of the people who have suffered the partition of India, friendship and loyalty etc.Aamir Khan does a splendid job as Ajay Singh Rathore, the patriotic cop previously a victim of terrorism who vows to fight them. All the aforementioned actors did a good job, but the surprise package in the movie is Naseeruddin Shah. He is probably the best actor in the country at the moment and one can say, looking at this role why. He is brilliant as Gulfam Hassan, the singer born in India and brought up in Pakistan.A great movie with a good story and excellent performances.9/10",
            "review_date": "2006-08-04",
            "lang": "en"
        },
        {
            "review_title": "Universally liked movie",
            "content": "Sarfarosh is a movie very few people can dislike.Movie is neither intense one nor over exerting.It is a movie tightly followed to a very good script.Story of the movie is fast paced,engaging like Sidney Sheldon's novels, has depth and all characters looks very natural and evolved.Although movie is over 3 hrs long but time just flies by.Topics like terrorism,crime , patriotism are dealt with a great aplomb.How arms are smuggled through border and reaches naxalites or bandits,how the police functions,movie makers had clear idea of.It is one good performance of Mukesh rishi as saleem,Aamir khan as ACP and even other small characters like Aamir's department's colleague,family members, everybody has done excellent job.None of the scenes in film looks forcefully inserted and movie progresses to a very concluding climax with every scene.A great movie from debutant director John Mathew Mathhan.",
            "review_date": "2008-05-01",
            "lang": "en"
        },
        {
            "review_title": "Enjoyable but a Bit Long and Somewhat Dated",
            "content": "This film begins in a remote area of India where some gun runners from Pakistan have arraigned for a shipment of AK-47's to be delivered to some local Muslim tribesmen. Not long afterward these tribesmen proceed to stop a bus loaded with Hindu passengers and subsequently kill everyone on board and then quickly escape back into the jungle after taking all of the money and jewelry they can find from the bodies of their victims. Quite naturally, this act of lawlessness causes a great stir among the citizenry and an inspector by the name of \"Ajay Singh Rathod\" (Aamir Khan) is chosen to lead the investigation over that of the normal investigator named \"Inspector Salim\" (Mukesh Roshi) who happens to be Muslim. Needless to say, Salim doesn't take this very well even though Ajay tries to explain that he had no input into this decision which was made due to political circumstances. Yet even though they both share a revulsion to the violence that has just occurred, what neither of them realize is that the arming of these tribesmen was a carefully planned event from myopic partisans within Pakistan wanting a religious civil war in India for their own selfish interests. Now rather than reveal any more I will just say that this was an interesting movie which might require the viewer to have a certain degree of knowledge concerning the historical significance of the Partition of India in 1947 and the ramifications that are still ongoing today. That aside, I liked the general plot of the film although I thought that some of the romantic elements didn't quite blend in with the more intense dramatic scenes as well as they could have. Likewise, some of the action scenes could have used a bit more polish as well. In any case, this was an enjoyable film for the most part and I have rated it accordingly. Slightly above average.",
            "review_date": "2021-02-13",
            "lang": "en"
        },
        {
            "review_title": "Awesome and one of the best cop films",
            "content": "This is one of the best cop films except the Pak bashing which is one flaw yet the way the film is handled brilliantlyThe cops aren't shown larger then life here and are shown realistic Also even a Muslim is shown as a good person and that z niceThe film follows a no nonsense approach and works well throughout Though the pace slows and drags at times when the focus goes on the villains but luckily they are several good scenes and brilliant handling that overpowers itThe climax is brilliant too, the face off between Naseer and Aamir is brilliantJohn Matthew Mathan makes a commendable debut, his best work Sad he couldn't follow it up and made a dud like SHIKHAR Music is good and suits the film Cinematography is aptAamir played a cop in BAAZI with a filmy style but here he is more restrained, mature and natural He acts like he is for real and doesn't try to hog the limelight but let's us focus on the dialogs between the co-stars Mukesh Rishi for once gets an opportunity to act and be a good guy and he does a fantastic job as Salim He is superb, hope he gets such roles more Sonali provides comic relief and is good Naseeruddin Shah is given a clichéd role and he does well Amongst others Pradeep Singh Rawat(villain of Ghajini), Govind Namdeo and the cops are all perfect",
            "review_date": "2009-04-09",
            "lang": "en"
        },
        {
            "review_title": "One of the best and most inspiring Indian movie",
            "content": "When i viewed this movie for the first time i thought OK lets watch another action movie with some common story.But since then i have watched this movie nearly 20 times and still i like it even more. The best thing about this movie is that it does not glorify the image of terrorists and cops.It shows how a common man can give his contribution to the society.Every thing from the direction to editing and acting and music,both songs and background is top class.It is the first movie directed by John Mathew Matthan but it looks like a very experienced direction.Performances by Aamir Khan,Naseeruddin Shah,Sonali Bendre and Mukesh Rishi are of top quality.The pace of the movie is very fast which makes it more adorable.The scene between Aamir Khan and Mukesh Rishi are the best part of the movie.A must watch for everyone irrespective of the age bars.",
            "review_date": "2010-03-16",
            "lang": "en"
        },
        {
            "review_title": "One of the best cop film of bollywood",
            "content": "This film isn't overdramatic. A very good police film. Closer to reality. Amir's one of the finest.No action crap like other heroes.It really has some magic which will compel you to watch this movie all over again no matter how many time you have watched this before. Awesome movie!",
            "review_date": "2021-12-06",
            "lang": "en"
        },
        {
            "review_title": "Fervour amidst the dunes of Bahid",
            "content": "The scorching heat, a windy desert, a deep-voiced narrative and the bright sunlit sandy terrain of Bahid complements the dark overtones which the film explores in the reels that follow. SARFAROSH - the title unravels.\nFor a directorial debut, John Mathew Matthan put up a great show, bringing to us a taut storyline, impressive dialogues, a star cast full of undervalued gems and scintillating music, all wrapped in a cinematic treat. The strength of this movie is its diversity and non-aligned behaviour.\nDiverse, because it focussed on a variety of sub-genres under the umbrella of an action film - be it the innocent romance between the college sweethearts Ajay (Aamir Khan) and Seema (Sonali Bendre) or the grey natured Gulfam Hassan (Naseeruddin Shah) whose character was scarred for life with the ravages of the Partition - the film covers all extremes while keeping the pace of the film just perfect.\nThe film is non-aligned as neither does it supplicate itself to the genre of a full blown war-film, nor does it advocate to be a staunch romantic saga set against the backdrop of a conflict ridden country.\nThe praise of its cinematic brilliance may cause this review to be worth a book's length. The next aspect, a most wonderful aspect of this film is its music.\n\"Jo Haal Dil Ka\", marks the beginning of the film's soundtrack - its infectious guitar riff is what makes it a chartbuster. The evergreen ghazal, \"Hoshwalon Ko Khabar Kya\" by the indisputable King of Ghazals, Jagjit SIngh is an excellent confluence of lyrical and melodic artistry. \"Yeh Jawaani Had Kar De\" and \"Meri Raaton Ki Neenden\" are worth a listen, but their growing on you is up to your taste of music. The final track of the film (which ironically is the first song shown in the film) \"Zindagi Maut Na Ban Jaaye\" by the hit duo of Sonu Nigam and Roopkumar Rathod can surely give you vibes of \"Sandese Aate Hain\" sung by the same duo 2 years prior to the release of this film.\nOverall, the film is worthy of the 10 stars it has been awarded from my side. Note that this review has been written after seeing the film multiple times.",
            "review_date": "2018-10-11",
            "lang": "en"
        },
        {
            "review_title": "A Very Realistic Movie featuring Most Realistic Performances.",
            "content": "Sarfarosh is the story of a man, Ajay Singh Rathod(Aamir Khan). His journey in the world we think we know,yet there is conspiracy everywhere, there are many things unknown. Ajay is a normal youth, he lives a life of every youngster in India until, one day his brother is killed by the terrorists, his father is beaten up ruthlessly. Why? Because they had the courage to say the truth, to stand up for it.Ajay Singh later begins his career as Police Officer. The honest, sincere police officer, whose duty is his life, whose only motive is to protect law and see that the law punishes the criminals. An International crime, or Inter-Country crime, source is Pakistan, and Ajay has to find the root of the problem which starts at smuggling and ends at war, terror war from ISI(Pakistan Intelligence Agency).Coming to Performances:Aamir Khan as Ajay Singh Rathod is simply mind blowing in a hard hitting, sincere cop role. This has to be one of the very Realistic performances ever. You become so involved with this character of Ajay that you will feel emotionally attached to him. Director John Mathew Matthan direction is spot on, and the pace of the movie is well maintained, except for some time in the middle of the movie where you feel that film is being dragged. But for a debut this movie has to be a great achievement.Other Departments: Naseeruddin Shah is impressive as a Singer cum Terrorist. Sonali Bindre is lovely. Music is good, but one wonders if the Songs were a necessity. Action scenes are well shot.On the whole this film deserves to be used as a Prototype for Cop/Terrorism-based movies. Watch it, you will be satisfied.",
            "review_date": "2009-02-19",
            "lang": "en"
        },
        {
            "review_title": "Aamir steals the show. Outstanding",
            "content": "I recently became avid fan of this actor.\nWill take time to review many of his titles.\nThis movie act was compelled to watch again and again.\nHe deserves a 10 star rating.\nHats off brother.\nGood luck and make something outstanding like this again.",
            "review_date": "2019-10-26",
            "lang": "en"
        },
        {
            "review_title": "Overlong but well acted and directed police thriller",
            "content": "This film may be overlong but it is a solid entertainer. The production values are good and the direction competent. Aamir Khan and Naseeruddin Shah face off against each other here and both excel. Aamir is convincing despite looking too young for his role. The film is patriotic and squarely blames a rival nation for inciting trouble in India. However, it refuses to demonize any particular community. There are too many songs but some of them are quite melodious. I personally liked a gentle ghazal sung by Jagjit Singh. Sonali Bendre provides the glamor element. Watchable.Overall 7/10",
            "review_date": "2009-02-06",
            "lang": "en"
        },
        {
            "review_title": "Well executed",
            "content": "Well executed.. You can say without any flaws.. Good acting by Aamir Khan, Sonali Bendre (she looks very beautiful), Nasiruddin Shah, Mukesh Rishi and all actors...Even the songs are very good...",
            "review_date": "2020-10-21",
            "lang": "en"
        },
        {
            "review_title": "Aamir's best performance till date",
            "content": "There are so many brilliant films given by Aamir Khan but acting wise his best should be counted as this and would rate it above lagaan, dil chahta hai, ghulam, rangeela etc but it goes the dangal way where also his acting was commendable and effortless...Direction and other pointers are amazing alongside a film of Mr. Perfectionist I can view anytime from anywhere as the plot is routine as usual making it memorable but not close to Gangaajal which remains the best cop-politician nexus ever in Bollywood and second one being this...Not to be missed!!",
            "review_date": "2018-08-10",
            "lang": "en"
        },
        {
            "review_title": "One of Aamir Khan's leading man roles just before he became a mega-star.",
            "content": "I've seen enough Indian films to have noticed some changes in their quality in recent years. Starting around 2000 (more or less) the films became more polished....with much better and less tinny sound during the musical numbers and more subtlety in the writing. I mention this because \"Sarfarosh\" does suffer in this regard. The music sounds poor...like they were playing it over a cassette player and filming that. And, occasionally the film could stand more subtlety. Again, this is NOT unusual for the 1990s but some 90s films sound and look better than this one. I think that this increased quality has resulted in folks now taking Indian films MUCH more seriously...and they are often as good or better than movies coming from Hollywood. But sound-wise, \"Sarfarosh\" is technically poor. I also wonder if some of this also might have been that the movie, at the time, was NOT seen as such a prestige project and Aamir Khan was not yet a mega-star like he'd soon become. Had he been bigger at the time, perhaps the sound would have just sounded better. Comparing this film to his \"Lagaan\", made just three years later is shocking...they are THAT different and the degree of polish is that great.The film begins some time ago with some truly horrible bandits holding up a bus and massacring nearly everyone*. Soon you learn that the Pakistanis are behind selling dangerous weapons like AK-47s to bandits in order to de-stabilize their nemesis, India**.The film now jumps ahead and is about a tough policeman, Ajay Singh (Aamir Khan). The murder of his policeman older brother in the massacre is why he is now a policeman, as he dedicates his life to dispensing justice to scum like the bandits at the beginning of the film. Vijay's crusade against terrorism with his crime taskforce is typical of what you see quite often in Indian films...the police are outgunned and deal with organized crime by 'bending the law'...such as slapping around folks they arrest and resorting to a LOT of shooting! What's next? See the film as Vijay and his men seek to destroy not only the crooks but the folks supplying them with the weapons.I was very surprised that none of the reviews I read talked about the issues with the sound in the musical numbers or a few scenes which lacked realism. A few called the film 'perfect' which it cannot be if the sound is this bad during the musical interludes. However, I do acknowledge that the story is excellent and exciting and the film does deserve its positive reviews...but perfection? No...especially when I can think of quite a few Aamir Khan films that are so much better, such as \"Lagaan\", \"Like Stars on Earth\", \"Dangal\" and \"Three Idiots\"....all films that might be seen as perfect or near-perfect. This one, instead, is exciting, interesting and STILL well worth seeing.* I had a laugh at the massacre...which should NOT have been a funny part of the film. This is because of one brief scene where a man is shot and he flies about 30 feet...something which is physically impossible...unless you know absolutely nothing about guns or physics! Of course, in Indian crime films this is not that unusual....it's just part of the fun...much like how Vijay's leg instantly heals following surgery and a few hours in the hospital!**Over the years, both countries have blamed domestic terrorism cases on each other. I am certainly no expert on this but was a bit surprised the film actually said the Pakistanis were to behind these murders.",
            "review_date": "2021-08-27",
            "lang": "en"
        },
        {
            "review_title": "Just that movie which won't ever bore you",
            "content": "Now its the movie which turned my love for Amer movies into an obsession..\"There are certain things that you do in your life, which at the end of the day make you proud, For Amir SARFAROSH is one such thing for him\"Its songs are near to perfection....ACTING WISE amir was at his very best, and RISHI(inspector salim) was fantastic..sonali looked desperately beautiful in that mini skirt... Even though every dialogue in this film are well knit ,but that one dialogue (when salim comes to amir to complain about people chastising him for letting a criminal go) salim: \"kya yeh desh mera nahin hai\"rathore:\" shayad nahin hai\"is the best....End is also a cliff hanger...one of the best i have ever came across..",
            "review_date": "2010-05-23",
            "lang": "en"
        },
        {
            "review_title": "Favourite Aamir Khan movie",
            "content": "I am big fan of Aamir Khan and this is my favourite movie of his. It is a superb film, very well made. An intelligent film but still a commercial one which I like. Aamir Khan is a joy to watch. You can tell with some actors when they are trying hard to portray their characters it makes you enjoy the movie even more. There are several scenes I enjoy in the movie. I love the scene where he is at the hospital and he is reading a newspaper when one of the villains appears and tries to bribe and threaten him. When he jumps from the chair and on to the villain it gives you a bit of a jump! I also love the dialogue between the Aamir Khan and Mukesh Rishi when he tells he tells him his purpose of joining the police force. Definitely a film to watch if you crave an intelligent film.",
            "review_date": "2009-10-06",
            "lang": "en"
        },
        {
            "review_title": "Regular routine",
            "content": "Can watch for Amir bhai but not a great movie to talk about and watcg several times",
            "review_date": "2019-05-26",
            "lang": "en"
        }
    ]
}