{
  "title": "Captain America: The Winter Soldier",
  "rating": 8.3,
  "release_date": "2014-04-04",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Thriller"
  ],
  "summary": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America, lives quietly in Washington, D.C. trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the BlackAfter the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America, lives quietly in Washington, D.C. trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy.… Expand",
  "critic_reviews": [
    "Captain America: The Winter Soldier is a tremendous piece of pop entertainment, smart and engaging and featuring a home run movie star lead performance by Chris Evans.",
    "In his third outing as the Captain, Evans seems totally comfortable in the role. He manages to convey his character’s goodness without making him seem like a self-righteous stiff. There’s an ease in his performance, and a sense of humor that makes him very appealing.",
    "What it comes down to is the difference between spectacle and craftsmanship. The Winter Soldier has plenty of the former – every dollar of its estimated $170-million (U.S.) budget is onscreen – but it’s also got an intricate dramatic and thematic structure holding everything in place.",
    "The rare film in this genre that serves as both entry point and continuation. For a change, you can walk in cold and you won't be too lost.",
    "Captain America: The Winter Soldier neatly and entertainingly puts into motion some big changes in the Marvel universe, while still sticking to its own charms — no easy feat, but one fit for a hero.",
    "Co-directors Joe and Anthony Russo and the team of screenwriters have fashioned a story with just the right balance of superhero fun, nods to the greater Marvel Universe and genuine dramatic tension.",
    "The newest Marvel blockbuster-to-be boasts an array of well-cast leads and supporting characters; a crisply paced, sensible plot; and above-average dialogue. Even more importantly, every scene and every character interaction prove that the movie’s creative team truly understands the core appeal of Cap himself—the tone of not just the character, but the comic book series from which he springs.",
    "By far the best Part Two in the universe (not necessarily hard to achieve) it also rests at the franchise’s peak alongside Iron Man, Avengers, and its predecessor to show the viability of cinematic serials.",
    "This sequel is, by design, entirely absorbing and satisfying without being one whit memorable.",
    "The best Marvel film since \"The Avengers.\"",
    "The creators of Captain America: The Winter ­Soldier have brought off something fresh and bold.",
    "Despite some of its more rickety story elements, Captain America: The Winter Soldier is possibly the studio's best action film and the one most able to stand on its own since the original \"Iron Man.\"",
    "This entry won't win any new converts, but anyone already invested in this series is going to have a blast.",
    "What makes \"The Winter Soldier\" so enjoyable, though, and what will make it so profitable, is its emotional bandwidth — all the vivid, nuanced life lived by its characters in between their frenzied escapades.",
    "Steve and the movie still fly high through plot twists and cool stunts.",
    "Count Captain America: The Winter Soldier as another success in the Marvel line. Thanks to the chemistry between Evans and Johansson and a willingness to shake things up, it's more than just a placeholder between \"Avenger\" films.",
    "The script is solid, and the fight scenes are excellent.",
    "Parents, take note: For all its heart, this is a tougher, more morally complex movie than its predecessors. Young kids carrying their miniversions of Cap’s famous shield may be in for a jolt.",
    "This installment delivers a heavy and welcome dose of paranoia, administered between fleetly paced smackdowns.",
    "It may climax with an overly formulaic splurge, but The Winter Soldier benefits from an old-school-thriller tone that, for its first half at least, distinguishes it from its more obviously superheroic Marvel cousins.",
    "In the first movie, an injection transformed wimpy Steve Rogers into strapping Captain America; similarly, this sequel gives the flagging comic-book movie an adrenaline shot of relevance. You've got to hand it to them.",
    "With a string of gratifying action sequences, and a breakneck pace leavened by a frequently witty script, The Winter Soldier stands alone as a solidly entertaining blockbuster.",
    "If we must endure yet another spring-summer cycle of comic book superheroes, this movie at least delivers the wham-bang goods (recycled though they may be).",
    "It tells its own story and, unlike with \"Thor 2\" and \"Iron Man 3,\" we don't feel the absence of the rest of the team.",
    "An often breathlessly exciting action thriller told with humor and intelligence.",
    "The new film isn’t nearly as bleak as Christopher Nolan’s take on Batman (in general, Marvel seems more risk-averse when it comes to fiddling with the crown jewels), but it still creates an action-movie landscape torn between patriotic ideals and harsh post-9/11 realpolitik.",
    "The movie does its duty. It's a reliable commodity, delivered efficiently and well, like pizza.",
    "Captain America: The Winter Soldier is every rousing, whup-ass thing you want in an escapist adventure.",
    "A baggy, at times brutal conglomeration of surprisingly deep character development and aggressively percussive action, The Winter Soldier is a comic-book movie only in its provenance.",
    "It's a heady blend, at times requiring more speechifying than throwaway pop deserves. But it keeps one guessing between ill-staged and frenetically edited fight scenes. Directors Anthony and Joe Russo handle vehicular mayhem better.",
    "Beneath the expensive, computer-generated busyness of this second Captain America installment is a bracing, old-style conspiracy thriller made extra-scary by new technology and the increasingly ugly trade-offs of a post-9/11 world.",
    "It needs to seem cool enough that we want to watch it despite its obvious silliness, and viewed through that prism of canny analysis, the craftsmanship of “Winter Soldier” is first rate.",
    "Arriving in the middle of Phase Two of the Marvel Cinematic Universe, The Winter Soldier is among the best of the nine films released so far—roughly on par with the first Iron Man and The Avengers—but if the film has one major flaw, it’s the obligation to serve a larger franchise that keeps taking on weight.",
    "For sheer plotting and audience involvement, this is a notch above any of the other Avengers-feeding Marvel entries, the one that feels most like a real movie rather than a production line of ooh-and-ahh moments for fanboys.",
    "It’s to the credit of the Russos that they give the characters such room to breathe in a movie that easily might have been about rushing from one gargantuan setpiece to the next.",
    "At over two hours, The Winter Soldier could have easily been trimmed by a good 20 minutes, but if it’s spectacular imagery and duplicitous goings-on that you crave, the film will not disappoint.",
    "The Winter Soldier is probably in the upper tier of Marvel pictures in terms of quality, but ultimately proves too muddled and frantic to match the heights of \"The Avengers.\"",
    "The problem with Captain America: The Winter Soldier is that there's too much going on: the Marvel Universe stuff, the WikiLeaks-ish paranoia stuff, the video game-ish CG visual effects stuff, the epic John Woo-ish everybody-pointing-a-weapon-at-everybody-else face-off stuff.",
    "With his glorified Frisbee and good-guy smile, Evans is engaging, but “The Winter Soldier” might be stronger with a little less Captain and a little more America.",
    "It’s OK for April, in other words, but not up to the higher standards of a Marvel summer blockbuster.",
    "So here's what moviegoers can trust from the Russo's Captain America: Winter Solider: They can trust it to be a brisk ride. They can trust it to be entertaining. They can expect it to be suspenseful.",
    "You can’t help but feel disappointed that a film with a relatively spicy premise becomes, in the end, so risk-averse.",
    "Given how little creative wiggle room there is in properties like The Winter Soldier, it’s a minor triumph that the Russos imprint any personality on the movie, which is less a stand-alone work than a part of an ever-expanding multimedia enterprise.",
    "The most memorable element of The Winter Soldier, besides Redford, is probably Scarlett Johansson, whose dryly funny Natasha at times comes perilously close to being … a well-developed female character?",
    "Has the usual overlong running time, the half-hearted feints in the direction of human feeling and the obligatory action sequences that are big without being either exciting or particularly legible.",
    "It's a product of the highest quality, but at the end of the day that's what it is: a machine-made, assembly-line product whose strengths tend to feel like items checked off a master list rather than being the result of any kind of individual creative touch.",
    "Deeply mediocre and ultra-predictable.",
    "Despite one or two moments of Venture Brothers-worthy fancy, the film is as by-the-numbers as any this series has ever offered."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Very good movie, best I've seen in a while. Comparable to Avengers really. Acting and Writing were both awesome. Could potentially be the movie of the year.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "'What's going on' asks Chris Evans of Scarlett Johansson at one point in this confused unstructured movie. This is the question that I would like to have had answered a lot earlier than is actually the case here. By the time some sort of'What's going on' asks Chris Evans of Scarlett Johansson at one point in this confused unstructured movie. This is the question that I would like to have had answered a lot earlier than is actually the case here. By the time some sort of resolution is offered one really couldn't care less. In fact this Marvel-less movie is a thorough going bore. Aside from a few sequences (involving a lift, and a climatic fight aboard an artillery carrier) most of the action is un excitingly derivative. In between these set pieces we have a lot of waffle spoken in an attempt to build character, but this only extends the agony of an already over long film. Visual effects are impressive, generally, although one static shot of the three artillery stations does look very fake.\rIt is good to see Robert Redford playing a villain for a change although he must obviously be doing it for the money. After all, didn't he set up Sundance as an alternative to this kind of movie regularly churned out by the Hollywood machine.\rFans of the first film, I'm sure, will love it and will stay (if in the know) for the two sequences that arrive during, and at the end of the final credits. Others, like myself, may wish they had left after the first 20 minutes.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "\"Captain America: The Winter Soldier\" was a sequel that certainly surprised me, as it exceeded all my expectations and definitely jumped over the quality of its prequel by miles. The plot, which looks to have drawn influences from exposing\"Captain America: The Winter Soldier\" was a sequel that certainly surprised me, as it exceeded all my expectations and definitely jumped over the quality of its prequel by miles. The plot, which looks to have drawn influences from exposing deceptive, blurred lines between the good and bad seen from cold war era spy movies, is very intricate and well-woven, and the action sequences are very satisfying to watch, all of this supported with good quality production. The Captain America series just gets better after each movie!",
      "review_date": "2015-08-14"
    },
    {
      "review_title": null,
      "content": "The future sure has been quite a time for Captain America (Chris Evans). His first encounter with the modern world saw him running through Times Square, confused and scared. Next, he assembled with some other Superheroes to save the worldThe future sure has been quite a time for Captain America (Chris Evans). His first encounter with the modern world saw him running through Times Square, confused and scared. Next, he assembled with some other Superheroes to save the world from the disgruntled brother of a fellow Avenger. In Captain America: The Winter Soldier, Cap faces off against an internal threat and an organization that is just as powerful as S.H.I.E.L.D, as well as a familiar face and new adversary from his past. Life is rough for Cap. On top of everything, he is still trying to find a way to successfully assimilate himself into present day society. You think saving the world is hard? Try figuring out the internet, getting back on the dating scene, and making new friends at the age of ninety-five. Thankfully, there are only a few things Cap needs to get through the day; his trusty vibranium shield and his handy notepad with a slew of suggestions for catching up with the last seventy years, and Cap is ready to take on the world–or corrupt government organizations. Either or, Cap is always ready to save the day, even if he has to take a beating while doing it.\r When I first became aware that the directing/producing brothers behind episodes of  ’Community’ and You, Me and Dupree were going to be responsible for  extending the Captain America canon, I may have gotten a little worried. Thinking that Joe and Anthony Russo were going to follow in the same footsteps as Captain America: The First Avenger director Joe Johnson, focusing more on the comedy and special effects of the Superhero genre and less with the complex, unflinching patriotic mentality of America’s greatest super soldier, the Russo brothers sure proved me wrong. It’s movies like these that make happy to swallow my words and stand corrected, knowing that audience members are able trust that the television medium is one that can be used as an adequate platform towards advancing characters in film as well.\r Substituting as much VFX work as possible for a very organic and old-school action approach, Captain America: The Winter Soldier is certainly the best Phase Two Marvel film so far, and may perhaps be the standard film to compete against in a post-Avengers film world, or at least up until the Avengers: Age of Ultron.\r Always on a mission, it seems that Cap lives to work, not works to live. Especially since he has been in deep sleep for the last little while. While the United States government is surely getting the most out of their ridiculously expensive investment, the government trusts that their super solider is never compromised and his dedication and hard work to his country is never skewed. When a secret organization with similar interests to those of S.H.I.E.L.D threaten to kill twenty million people, Cap is sent to fight at sea, on land, and in the air. Accompanied by his trusty sidekick Natasha Romanoff/Black Widow (Scarlett Johansson), the two seem to always be pitted within the same missions but always having ulterior motives. Commanded by their one-eyed superior Nick Fury (Samuel L. Jackson), S.H.I.E.L.D must face off against their most ruthless enemy yet.\r One of the biggest issues I will continue to have with Marvel’s stand-alone films from now on, is the fact that once conflict reaches a certain level of danger, like lets say a global level, I will always ask, “Where the heck are the Avengers? And if not the Avengers, where is Tony Stark? The Hulk? Someone? Anyone?” No problem could be too big for the super-powered team of freedom fighting Superheroes. This is one film where I questioned the presence of Tony Stark? Was he just waiting to see what Cap would do on the other side of the country while he sat at home on his couch?\r Essentially, Captain America: The Winter Soldier is a team effort in crime fighting, with Black Widow and Sam Wilson/The Falcon (Anthony Mackie) helping out are star-spangled Superhero this time around, Cap sure doesn’t seem to be without powerful friends. What was also refreshing was finally seeing Nick Fury get in on the action, providing the film with one of the best car chase scene Marvel ever assembled. One of the virtues of Captain America: The Winter Soldier stands by is the fact that, you don’t need to wear a mask to be a Superhero–which might explain why Cap always insists on removing his.\r At times, the film may seem like Marvel’s take on Minority Report anticipating danger before it even happens, and upholding the idea of ‘peace’ for the sake of the world. But as the Head of S.H.I.E.L.D operations ironically points out, “peace is not an achievement, its a responsibility”. So when S.H.I.E.L.D is corrupted from the inside, right under their noses and Cap is left to face-off against a super-soldier baddie, later known as the Winter Soldier (Sebastian Stan), the organization really has some explaining to do.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Way better then the first movie which only seemed to be a vehicle to help promote the Avengers. This a stand alone movie and with a little background anyone could be caught up to speed even without seeing the first one. This one will be putWay better then the first movie which only seemed to be a vehicle to help promote the Avengers. This a stand alone movie and with a little background anyone could be caught up to speed even without seeing the first one. This one will be put into the blu ray collection as well as maybe buying the first one just to help my gf catch up a little more on the whole background of the Avengers and Capt America. This movie started to make me a fan I wont go out and start buying up the older comics like I have with Avengers but I am very excited for 2016 and Capt America 3.",
      "review_date": "2014-05-13"
    },
    {
      "review_title": null,
      "content": "Best Phase II Marvel movie.  Shows what you can do with a Marvel movie, good script and some good ideas.  It has the feel of an old school 90s action movie as well a little bit of political thriller thrown on top.  The cgi is more disciplinedBest Phase II Marvel movie.  Shows what you can do with a Marvel movie, good script and some good ideas.  It has the feel of an old school 90s action movie as well a little bit of political thriller thrown on top.  The cgi is more disciplined here than in the first one.  I liked Robert Redford as the bad dude and he plays it great, like it was his character from the Candidate won a secretary of state position.  This is my favorite of the phase II Marvel movies, yes I liked it more than Gaurdians.  I believe it is the best Marvel movie since the first Iron Man.",
      "review_date": "2014-09-26"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThere’s no point in denying that the new Captain America movie is anything less than another instalment in the superhero saturation of the last ten years, but although the Captain himself has been considered the blandest of the bunch, at least as far as The Avengers (2012) is concerned. It’s still a fantastic world of unbelievable stunts and perfectly timed one-liners, but the new film offers a lot more depth than some of the weaker superhero fare on offer.\r In addition to the ambitious Marvel Cinematic Universe, the rich tapestry of interwoven stories that Disney’s Marvel Studios has been crafting at the rate of about two blockbusters a year since 2008’s Iron Man, we have seen everything from the unrelated narratives of Marvel’s Spiderman and X-men series, to the gritty reboots of rival DC classics like Superman and Batman. The Marvel Universe alone is an unprecedented shared universe multimedia franchise, extending from the silver screen to various short films, television series and tie-in comic books.\r Wanton American patriotism is far from internationally popular, and the challenge with Captain America as a character is to give this bastion of United States glory modern appeal. The first film took the character back to his roots, giving us a brilliant pulp action adventure, set during the character’s 1940s heyday.\r This was an easy place to be Captain America, but after being dragged into the twenty first century in time for The Avengers, Steve Rogers (Chris Evans) must work out what America stands for today, and decide what he represents. The temporal displacement is a rich vein to be mined for soul searching and character interpretation.\r As a pawn of SHIELD, the superhero intelligence organisation: our Nazi-punching hero has been reduced to a shady covert operative who is unsure if the missions he is sent on are aiding or abetting the forces of evil. This insecurity comes to a head when he learns of SHIELD’s Project Insight, a sinister initiative which operates under the twin axes of surveillance and pre-emptive strikes, undeniably referencing drone controversy and the concerns over US internal surveillance. Thus The Winter Soldier is an espionage thriller, firmly rooted in modern day concerns, but with a style heavily influenced, according to the directors, by cold war conspiracy thrillers from the 1970s.\r Events are still very much rooted in the events of the first film, mysterious forces have been working in the background since the end of the war, and the Captain finds himself battling enemies both old and new. Symbolically, he trades his brand new twenty first century black and navy blue uniform for his bright red, white and blue wartime clobber before the film is out.\r As is the case with many comic book movies, I am impressed to learn that much which transpires on screen, no matter how incredible or brief, is in fact distilled from the original comics over their seventy year history. I’m certainly not the one to personally notice all this detail, but it’s apparently crammed full of nods to various eras, arcs and character backgrounds.\r The characterisation of Falcon, real name Sam Wilson (Anthony Mackie), was strong. An Air Force veteran, he shares Rogers’ military background and helps him adjust to the modern world. Later, he demonstrates his loyalty when he is called upon once the Captain becomes a fugitive.\r Of course, the question having over every post-Avengers solo movie is why characters neglect to call in their superpowered chums to save the day in a fraction of the time. There is a slight aversion in that Captain America does spend the whole film working closely with fellow Avenger Black Widow (Scarlett Johansson), who has been largely sidelined in her previous appearances. The truth is that having fewer lead characters mean more attention can be given to others, and Johansson is finally given some significant screen time. Black Widow’s alluring presence is welcome throughout, her moral ambiguity and chequered past providing a stark contrast to the Captain’s clear cut integrity.\r Similarly, SHIELD director Nick Fury (Samuel L. Jackson) is much more important to the story than the cameo status he has held until now. By contrast, the eponymous Winter Soldier, a bionic badass bearing Soviet livery has little screen time, initially filling the role of unbeatable enforcer to the villains, and the only individual strong enough to challenge the Captain, but his tragic presence is vital to the overarching saga. Also noteworthy is Robert Redford’s appearance as a sinister SHIELD executive.\r Freedom, the most American of values, nevertheless carries a global relevance, and remains a major theme, but any overt patriotism is relatively, and wisely downplayed, despite the character’s name and apparent raison d’être. What’s left is a solid conspiracy blockbuster, with the superhero status incidental aside from enabling higher octane action sequences than a subtler spy movie.",
      "review_date": "2014-04-20"
    },
    {
      "review_title": null,
      "content": "I never saw the first Capt America, but I did see the avengers and to be honest didnt like him there. However in this film I found him enjoyable. The film its self is enjoyable and just pure fun! the best of phase 2 for sure.",
      "review_date": "2014-05-04"
    },
    {
      "review_title": null,
      "content": "Captain Is Back and he is kicking so much ass! The sequel to a mediacore original is surprisingly amazing! With good visual effects,Good Characters and a scary villain.It one of the most violent Marvel film to date.The movie has some manyCaptain Is Back and he is kicking so much ass! The sequel to a mediacore original is surprisingly amazing! With good visual effects,Good Characters and a scary villain.It one of the most violent Marvel film to date.The movie has some many action and drama,it's basically not a superhero film it is a spy thriller but still qualifies as a superhero movie cause it;'s based on a comic book superhero.Captain America is enjoyable for all ages!",
      "review_date": "2014-12-21"
    },
    {
      "review_title": null,
      "content": "Very shocked at how much I enjoyed this movie! one of Marvel's best without a doubt, and the only sequel on an avengers solo that is good. Capt 2 delivers!",
      "review_date": "2016-06-01"
    },
    {
      "review_title": null,
      "content": "Captain America: The Winter Solider is the least Marvel-like film in the MCU. It's a real deal spy-thriller, and I really enjoyed it. There are some moments of unbelievability that a lot of Marvel films have that kind of annoy me, but to seeCaptain America: The Winter Solider is the least Marvel-like film in the MCU. It's a real deal spy-thriller, and I really enjoyed it. There are some moments of unbelievability that a lot of Marvel films have that kind of annoy me, but to see Captain America really just beat some dudes up and for it to actually be pretty brutal, and not toned down like I'd kind of expect from Marvel, was cool to see. The story does seem a little convoluted at times but it's also setting up a lot of stuff for the MCU so it's understandable that there's a lot going on. One of the best films in the MCU, I think.",
      "review_date": "2018-12-08"
    },
    {
      "review_title": null,
      "content": "good acting, action, and plot. the story is well written and executed, and has good characters. the action was great.the overall movie had some clichés, but was still very good. i wish that falcon played a bigger role than what he had, though.",
      "review_date": "2014-04-16"
    },
    {
      "review_title": null,
      "content": "brilliant I could not help but enjoy the film great plot and a nice balance of the drama and action and doesn't over do the jokes and I've course great performances the director really has been careful when doing this film one of the best inbrilliant I could not help but enjoy the film great plot and a nice balance of the drama and action and doesn't over do the jokes and I've course great performances the director really has been careful when doing this film one of the best in the marvel cinematic universe",
      "review_date": "2014-05-09"
    },
    {
      "review_title": null,
      "content": "I was far from excited to see the movie because the first one was dull. Honestly. However, this sequel really gives me a new perspective to consider Captain America to be more than just a movie they did to make sense of The Avengers. Hands upI was far from excited to see the movie because the first one was dull. Honestly. However, this sequel really gives me a new perspective to consider Captain America to be more than just a movie they did to make sense of The Avengers. Hands up to the directors and screenwriters, and shall I say, Scarlett Johansson, for being the hottest and bestest sidekick ever!",
      "review_date": "2014-06-03"
    },
    {
      "review_title": null,
      "content": "Better than expected. Actually, I didn´t expect a thing. Nevertheless it ends up being a really entertaining movie, much better than the first one, really good visuals, and it keeps your attention all the time",
      "review_date": "2014-04-06"
    },
    {
      "review_title": null,
      "content": "Winter Soldier was a step in the right direction. They finally started showing some of the reasons Captain America is so beloved. The story suffers though as they give too much spotlight on every major character in the movie. At times itWinter Soldier was a step in the right direction. They finally started showing some of the reasons Captain America is so beloved. The story suffers though as they give too much spotlight on every major character in the movie. At times it seems everyone else is doing something more heroic than the captain. It's just odd that Captain America who is supposed to be one of the best martial artist and fighters in the Marvel universe seems just on par with your average Shield Agent. We have to remember though, it's a super hero movie, and in that area it delivers.",
      "review_date": "2014-09-23"
    },
    {
      "review_title": null,
      "content": "This film features more action and better CGI than the first Captain America film. Although I find the plot a little bit confusing, its actually quite nice and has many twists to the plot. This is probably a better Captain America filmThis film features more action and better CGI than the first Captain America film. Although I find the plot a little bit confusing, its actually quite nice and has many twists to the plot. This is probably a better Captain America film compared to the first one in terms of actions and CGI. The directors should make the plot less confusing. Overall, this is an awesome film. Thumbs up for this film!",
      "review_date": "2014-12-09"
    },
    {
      "review_title": null,
      "content": "It is a funny action film, that does what is supposed to do, entertain. It's mock spy films, but it worked for me. Much better than the boring first part of captain America during the WW2",
      "review_date": "2014-04-06"
    },
    {
      "review_title": null,
      "content": "Although you may question some plot elements, this is easily the best stand-alone Marvel movie since Iron Man.  I was biting my nails throughout the film, the directing and action was spectacular, and it is helped by stellar actingAlthough you may question some plot elements, this is easily the best stand-alone Marvel movie since Iron Man.  I was biting my nails throughout the film, the directing and action was spectacular, and it is helped by stellar acting performances.  There are also several twists you definitely will not see coming and likely didn't even think Marvel had the balls to do, let alone pull off.",
      "review_date": "2014-09-22"
    },
    {
      "review_title": null,
      "content": "Fantastic movie by any means - only better because of it being an MCU movie. For me, this is a strong contender for the best Marvel movie yet. I rate it only behind Avengers and Thor 2 because I prefer the sci fi genre to political thrillers,Fantastic movie by any means - only better because of it being an MCU movie. For me, this is a strong contender for the best Marvel movie yet. I rate it only behind Avengers and Thor 2 because I prefer the sci fi genre to political thrillers, which this movie was.",
      "review_date": "2014-07-31"
    },
    {
      "review_title": null,
      "content": "I am not a comic book expert, but there is something I can guarantee: this film deserves our full attention. If \"Captain America: First Avenger\" turned out to be pleasant and full of quality, this film proved to be a worthy continuation. ItI am not a comic book expert, but there is something I can guarantee: this film deserves our full attention. If \"Captain America: First Avenger\" turned out to be pleasant and full of quality, this film proved to be a worthy continuation. It will not be correct to say that I was surprised: Marvel has provided us with excellent productions, and it is difficult, therefore, to keep expectations low. However, in the end, I was satisfied.The plot goes back to Steve Rogers' past to reveal the existence of a rival to his height: the Winter Soldier, a super soldier, like Captain America, whose origins and past are closely related to Rogers. I don't know if this story is faithful to what is told in the comic books, but I also feel that, for me, it doesn't matter. The plot is developing well, with space for action and the fight scenes are good and seem real.Chris Evans returns to the role of Captain America, and he is skilled, heroic and energetic. Samuel L. Jackson and Robert Redford also do an excellent job, at the level of the best they have done so far in their long careers. Scarlett Johansson and Anthony Mackie seem to have received characters tailored to them, especially Johansson. Sebastian Stan is good, but he didn't get my attention much. Emily VanCamp is good, but her character is not very relevant and is not very interesting.But where this film really excelled was in the quality of production values, and the most technical aspects. Cinematography, for example, is sharp, elegant, with excellent filmmaking and an absolute command of color, movement, and shadows, which make the film visually extraordinary. Add to that the grandeur of the visual effects, the latest generation CGI and, of course, the action and fighting scenes, and the result is overwhelming. The sets and costumes also deserve a note of great praise: I especially liked the sets at the Avengers headquarters, a futuristic and elegant complex that seems to have been taken from an urban planning project in an Asian city. The aircraft also look magnificent and impress. The soundtrack, on the other hand, is quite good, it fits perfectly in the film, but I confess that it was not in my ear and that I did not find it particularly memorable.",
      "review_date": "2021-03-08"
    },
    {
      "review_title": null,
      "content": "Probably the best MCUmovie, very good story, excellent action. And i loved the character of Falcon, what can i say about this movie that has not been said already. This movie is just F*cking great! 9/10",
      "review_date": "2020-06-28"
    },
    {
      "review_title": null,
      "content": "I think this movie was killer and is easily top 3 for mcu movies. It was just so satisfying to watch.",
      "review_date": "2019-04-07"
    },
    {
      "review_title": null,
      "content": "Very interesting movie. I thought this was the best mcu film to this day. Absolutely amazing.",
      "review_date": "2019-04-07"
    },
    {
      "review_title": null,
      "content": "Best MCU movie until Avengers Endgame came out. But still this movie really is a huge step up from The First Avenger.",
      "review_date": "2019-04-26"
    },
    {
      "review_title": null,
      "content": "I absolutely love this film. The story telling is really good, the fight scenes, emotions and the acting is just absolutely spot on. I think this film is better than Infinity War.",
      "review_date": "2019-04-26"
    },
    {
      "review_title": null,
      "content": "Movie was good had great action scnees. Great character relations. And did a good job deveoping cap in the 21st century.",
      "review_date": "2019-09-11"
    },
    {
      "review_title": null,
      "content": "Easily one of the strongest MCU entries to date and one of the best superhero movies. I wouldn't quite call it a masterpiece as I do have a couple of subjective problems with it. However, the characters are very well developed and feel likeEasily one of the strongest MCU entries to date and one of the best superhero movies. I wouldn't quite call it a masterpiece as I do have a couple of subjective problems with it. However, the characters are very well developed and feel like 3-dimensional characters especially Captain America. The action and choreography are brilliant and hold up very well. And the story is just overall very good. I gave the movie a 10 but it is a light 10.",
      "review_date": "2021-12-02"
    },
    {
      "review_title": null,
      "content": "More like The Dark Knight  than \"The Avengers\rCaptain America: The Winter Soldier manages to have the perfect balance of seriousness, humour and a complex plot that not only raises the stakes for the whole Marvel Cinematic Universe but alsoMore like The Dark Knight  than \"The Avengers\rCaptain America: The Winter Soldier manages to have the perfect balance of seriousness, humour and a complex plot that not only raises the stakes for the whole Marvel Cinematic Universe but also manages to keep intact who Captain America is and how the world should be more like him not the other way around.\rThe action is the best action in a Marvel movie and the soundtrack keeps you on the edge of your seat as the plot evolves. Acting wise everyone fits their role perfectly and special mention to newcomers Anthony Mackie who gets most of the more funny scenes as Falcon and Robert Redford who turned what could have been a boring character in Alexander Pierce into a truly well rounded character.\rOn par with The Avengers as the best Marvel film.",
      "review_date": "2014-04-10"
    },
    {
      "review_title": null,
      "content": "Wow. This film takes the Avengers series to a new level. Not only is the story and action superb, but the events in this film have huge implications when it comes to the overall Avengers story. Keep them coming Marvel Studios!!! Top 3 alongWow. This film takes the Avengers series to a new level. Not only is the story and action superb, but the events in this film have huge implications when it comes to the overall Avengers story. Keep them coming Marvel Studios!!! Top 3 along with Avengers and first Iron Man.",
      "review_date": "2014-04-08"
    },
    {
      "review_title": null,
      "content": "Excellent movie, lots of action, great acting, story was pretty good. Well worth my time. Far better than the first movie.\r...........................",
      "review_date": "2014-08-04"
    },
    {
      "review_title": null,
      "content": "This is the best Marvel move to date. Tons of action, great story, great characters. Loved the addition of the Falcon. Definitely worth seeing, even if you aren't typically a Marvel movie fan. It really feels like a great spy/politicalThis is the best Marvel move to date. Tons of action, great story, great characters. Loved the addition of the Falcon. Definitely worth seeing, even if you aren't typically a Marvel movie fan. It really feels like a great spy/political thriller movie that just happens to have a super hero in it.",
      "review_date": "2014-05-11"
    },
    {
      "review_title": null,
      "content": "Holy cow... what a ride!  So much better than the first one, though expected since Captain America didn't need to be born again, just on with the show. Awesome effects, great casting",
      "review_date": "2014-05-16"
    },
    {
      "review_title": null,
      "content": "One of the best Marvel movies and possibly one of the best action movies to come out in the past decade.  The stakes are real and this movie is a game changer for the Marvel universe without modern day gimmicks like shaky cam, slo-mo actionOne of the best Marvel movies and possibly one of the best action movies to come out in the past decade.  The stakes are real and this movie is a game changer for the Marvel universe without modern day gimmicks like shaky cam, slo-mo action shots or overuse of CGI.  An instant classic.",
      "review_date": "2015-01-04"
    },
    {
      "review_title": null,
      "content": "Lately Marvel movies have been losing their touch and have really become a franchise with only one tone which eventually becomes quite tiresome. TWS is not only a great superhero movie/ sequel but also a great movie in general. All the cringeLately Marvel movies have been losing their touch and have really become a franchise with only one tone which eventually becomes quite tiresome. TWS is not only a great superhero movie/ sequel but also a great movie in general. All the cringe worthy jokes and fairly basic plot, which have been ruining marvel for me, have been replaced with an almost masterfully crafted story. From acting to the dialogue, this movie is great. Though I did have an issue with some of the choices they made, but overall a pretty solid movie that deserves all the love that its getting (unlike most marvel movies these days).",
      "review_date": "2016-03-28"
    },
    {
      "review_title": null,
      "content": "The success of 'The Avengers' back in 2012 was undoubtedly going to usher in another phase of films from the ever expanding Marvel Cinematic Universe. Robert Downey Jr. was the first to suit up for the third Iron Man outing and his fourth forThe success of 'The Avengers' back in 2012 was undoubtedly going to usher in another phase of films from the ever expanding Marvel Cinematic Universe. Robert Downey Jr. was the first to suit up for the third Iron Man outing and his fourth for the franchise overall. The third entry in the Iron Man franchise proved to be riding the wave of the massively successful Avengers, taking a huge haul at the box office. Next up was Chris Hemsworth as the muscle bound god of thunder Thor.\rBoth proved to be successes, the former continuing to impress while the latter was better than the first outing but still left plenty of room for improvement. But the first avenger to start it all was Steve Rogers as Captain America, his first film was good but not great, it had a wonderful retro feel to its first half until it took an explosive and predictable path for its final hour, each event leading into The Avengers. Cap was always difficult to put in front of an audience that nowadays demands darkness and gritty realism over charm and light-hearted antics. He stands for goodness and doing what's right, something that isn't very sought after in modern day heroics.\rBut in this sequel to the 2011 film, it's a different time and a much different film. Not only does it improve upon the last solo outing, but it could very well be the best film to come out of the Marvel franchise so far. The man who was frozen in time returns with Chris Evans again putting the famous shield on his arm, he now works for S.H.I.E.L.D. who continue to be a very secretive organisation which Cap is determined to get to the bottom of. He works closely alongside fellow operative Black Widow (Scarlett Johansson). The witty chemistry between these two is easily one of the highlights of the film, even in the stickiest of situations, the writers manage to infuse some comic relief that works every time. But the threat this time in the film is much closer to home as S.H.I.E.L.D. itself is the centre of attention for all the wrong reasons. Nick Fury (Samuel L. Jackson) is given a much larger and more pivotal role in the Winter Soldier, the more Sam Jackson the better if you ask me! The story plays out in thrilling fashion as a mole within headquarters has each of our good guys on their hit list. The great alliance is now in tatters and someone that Cap has never dealt with is hunting himself and his friends down. Who better to send after them than the mythical Winter Soldier, he may just seem like a master assassin with a metal arm and anger issues, but there is much more of a story going on behind the mask that plays a part in a film that finds balance between emotional repercussions while also entertaining the fans with explosive set pieces, thrilling fist fights and a fantastic car chase involving director Fury, it all packs a heavy punch while infusing the film with superior wit and charm, especially from supporting cast member Anthony Mackie who dons a familiar pair of wings as the plot unfolds. The story delves very deep into the history of the S.H.I.E.L.D organisation while also outlining the problems that face a company who is trying to do everything right by preventing crime before it happens, \"What about freedom?\" the Cap asks, always there to detail the line between right and wrong. Chris Evans himself is on fine form and he acts out a very emotional script that paints Steve Rodgers as a man who is unsure about what to do with his life after the secrets of the people he works for start to unravel. It pays homage to the first film while also solidifying itself as possibly the best Marvel film so far, it has everything that could possibly be imagined and just when you think that it can't get any better, Robert Redford shows his face along with several other strong characters, there are surprises at every turn but enough of the same characters we've come to know from previous films to add up an adventurous, pulsating and epic adventure that could be the best film of the year. Stay for not one but two credit scenes, one in the middle and one at the end, mind blowing!",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Fantastic movie and by far the best of the MCU movies so far in my opinion. This is not just a superhero movie but is also equal parts action and thriller and has a well written story, action and fight scenes and some interesting newFantastic movie and by far the best of the MCU movies so far in my opinion. This is not just a superhero movie but is also equal parts action and thriller and has a well written story, action and fight scenes and some interesting new characters.\rWith out giving any spoilers Captain America The Winter Solider not only clearly furthers Steve Rogers story but also that of SHIELD and will no doubt have massive lasting effects on the MCU as a whole.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Not only is this a great superhero movie, it's a great political thriller. The story was intriguing and the acting as well as action was good too. This is one of Marvel's best to date... easily the best of Phase 2 thus far.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "There is nothing to say except that this is the best marvel movie to date. Out of the nine, this movie is by far the most well put together and has the best told story. It connects with events from Captain America 1, the Avengers, and the TVThere is nothing to say except that this is the best marvel movie to date. Out of the nine, this movie is by far the most well put together and has the best told story. It connects with events from Captain America 1, the Avengers, and the TV show, MARVEL Agents of Shield. If you haven't seen this movie, go and see it now!",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "One of the best solo character movie by marvel since iron man. cant imagine the hype it has created and it has lived more than up to its expectations. The actions cant get better than this. Simply superb. Highly recommended for all MARVELOne of the best solo character movie by marvel since iron man. cant imagine the hype it has created and it has lived more than up to its expectations. The actions cant get better than this. Simply superb. Highly recommended for all MARVEL fans. ;) love it !",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "The soldier superhero (Chris Evans) is living quietly in DC, when an evil plot is discovered. He enlists Black Widow (Scarlett Johansson) and newbie The Falcon (Anthony Mackie) to help. This may be the most unoriginal screenplay yet forThe soldier superhero (Chris Evans) is living quietly in DC, when an evil plot is discovered. He enlists Black Widow (Scarlett Johansson) and newbie The Falcon (Anthony Mackie) to help. This may be the most unoriginal screenplay yet for Marvel heroes: no surprises, no peril and no humor. It moves forward with momentum and some of the visuals are cool. Most of the fights are fast cut, hand held and hard to follow. While it's never dull, the predictability and unimaginative action don't render it special. NOTE: There's one additional clip after the closing titles and another after the final credits.",
      "review_date": "2014-04-08"
    },
    {
      "review_title": null,
      "content": "What can I say about this movie other than to go see it ASAP?  It's everything that you come to expect from a Marvel film taken to a whole new level.  Again, go see it ASAP.  That is all.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "\"Captain America:The Winter Soldier\" is a really good movie that is leagues better than the initial first film, which I was not a fan of. This new story of The Cap is brought into the modern world and it’s fun seeing him deal with how much\"Captain America:The Winter Soldier\" is a really good movie that is leagues better than the initial first film, which I was not a fan of. This new story of The Cap is brought into the modern world and it’s fun seeing him deal with how much the world has changed, but at the same time how much it has stayed the same. The script is well written. It is filled with great relevant social commentary about our government and major organizations and how they preserve freedom by reistricting it. However, while the script is fairly heavy, it does manage to have enough fun Marvel humor that we’ve all come to love.\r One thing in particular that I love about this movie is that it gives a lot of respect to its characters. The Captain himself is show to be more than just a leader. He can hold his own, but is also a great human being. Chris Evans has finally owned the character and it’s hard seeing anyone else play him. We also get more backstory to Natasha a.k.a Black Widow. It allows the audience to connect with her on an emotional level. Same goes for Nick Fury. The Winter Soldier is a pretty awesome villain, who I believe to be the best villain from the Marvel Cinematic universe only behind Loki.\r Overall, “Captain America:The Winter Soldier” is a fairly entertaining and surprisingly thought provoking movie that is stepping up the quality of the modern superhero movie genre. It has everything from great characters, to an engaging and honest story, to some of the best action we’ll get this year. My only gripe with the film would be the heavy use of shaky cam during the action sequences. Other than that, it is a a movie that you go and see in theaters today. Also, stay after the credits there is a big reveal that will surely get everyone excited for The Avengers 2. I give 4/5",
      "review_date": "2014-04-09"
    },
    {
      "review_title": null,
      "content": "This is an amazing movie.  Fantastic action, special effects and character development.  My favorite Marvel flick so far.  ( You honestly cannot please a critic with anything other than the most cryptically boring or oddity of a movie.). DidThis is an amazing movie.  Fantastic action, special effects and character development.  My favorite Marvel flick so far.  ( You honestly cannot please a critic with anything other than the most cryptically boring or oddity of a movie.). Did a great job showing Caps strengths and weaknesses and making him a truly human character.",
      "review_date": "2014-05-27"
    },
    {
      "review_title": null,
      "content": "I know people are going to hate me for saying this, but if I'm being honest, this movie was overrated. The pace was rushed, the story made little sense, it crammed WAY too much back story that should have ebeen in the first CA movie.I know people are going to hate me for saying this, but if I'm being honest, this movie was overrated. The pace was rushed, the story made little sense, it crammed WAY too much back story that should have ebeen in the first CA movie. Nonetheless, i did enjoy it a little, but it's definitely not Marvel's best movie, not by any means.",
      "review_date": "2014-09-14"
    },
    {
      "review_title": null,
      "content": "Easily one of my favorite movies to come out of Marvel yet, the sequel for Captain America is a solid, enjoyable movie that really attempts to go above and beyond its genre, while also retaining elements that just make it another superheroEasily one of my favorite movies to come out of Marvel yet, the sequel for Captain America is a solid, enjoyable movie that really attempts to go above and beyond its genre, while also retaining elements that just make it another superhero movie. In terms of the political commentary, Captain America's sequel soars above most other superhero movies. It uses its position as a popular movie to try and bring up things  that it feels could occur in our world if we continue down the path we are going down. However, it then returns to stereotypical superhero nonsense and, generally, feels like a run-of-the-mill summer superhero movie. Sure, it is one, and is a good one at that, but that does not mean it could not step up in \"class\" a bit. On top of that, I felt the story was too much. The whole world is being threatened and all that it is being defended by is Captain America, The Black Widow, and Anthony Mackie? Really? Did Iron Man, Hulk, and Thor, call in sick that day or...? The plot was very interesting and really makes this movie what it is, but it felt more appropriate for the second Avengers movie, rather than the sequel for Captain America.\r In terms of acting, everyone did very well. Chris Evans, Scarlett Johansson, and Samuel L. Jackson, really led the way with that. Also, the character development was great and unexpected for this movie. The amount of development they did here, coupled with the ending and post credits scene, really set up the upcoming third film nicely.",
      "review_date": "2014-05-28"
    },
    {
      "review_title": null,
      "content": "Wow. If the main problem about phase 2 up until this point was it's lack of connection to the MCU then this movie is exactly what was needed. The story is thrilling, the characters are great, the acting is top notch and the action is some ofWow. If the main problem about phase 2 up until this point was it's lack of connection to the MCU then this movie is exactly what was needed. The story is thrilling, the characters are great, the acting is top notch and the action is some of the best that I've ever seen. Plus there's all the huge game changing moments that'll be effecting the MCU for years to come.",
      "review_date": "2014-06-24"
    },
    {
      "review_title": null,
      "content": "Though it may not abide religiously to its subtitle, \"Captain America: The Winter Soldier\" remains a spine-tinglingy well-staged, frighteningly relevant, and brilliantly monumental addition to the Marvel/Disney dynasty.",
      "review_date": "2014-04-12"
    },
    {
      "review_title": null,
      "content": "Miles away better than The Amazing Spider-man 2. and could even rival films like The Avengers and The Dark Knight, the acting was fantastic, and the action scenes were some of the best I've ever seen. Brilliant film.",
      "review_date": "2014-05-05"
    },
    {
      "review_title": null,
      "content": "I don't give 10's out lightly.  There is nothing wrong with this action film.  Great story.  Great action and cgi.  Funny.  Great characters.  The only thing I would have added would have been a last second cameo of Iron Man.  Marvel does aI don't give 10's out lightly.  There is nothing wrong with this action film.  Great story.  Great action and cgi.  Funny.  Great characters.  The only thing I would have added would have been a last second cameo of Iron Man.  Marvel does a bad job when it comes to forgetting about other characters that still exist in this world.  If you don't want them in the movie, you better come up at least a mention as to why they are not here.  Remember when they kept referring to the Thor hammer in the desert in a few other Marvel movies?\r For an action movie this is a 10.  I would have given the first Avenger movie a 5.",
      "review_date": "2014-06-30"
    },
    {
      "review_title": null,
      "content": "This movie is very nice I'm so proud with marvel this movie  is different   from another movies of marvel very nice and good have a lot of fun Chris Evans is very handsome ha ha I'm glad and love marvel more I hope next movies of marvel isThis movie is very nice I'm so proud with marvel this movie  is different   from another movies of marvel very nice and good have a lot of fun Chris Evans is very handsome ha ha I'm glad and love marvel more I hope next movies of marvel is better more than this good over another movies Yeahhhh P.S.Hail hydra >3",
      "review_date": "2014-04-10"
    },
    {
      "review_title": null,
      "content": "Marvel has once again done it with Captain America 2. I entered the movie thining it would be a decent movie, but was amazed at the edn result. Not only does it out do the first Captain America, but the plot grabs onto you and takes hold ofMarvel has once again done it with Captain America 2. I entered the movie thining it would be a decent movie, but was amazed at the edn result. Not only does it out do the first Captain America, but the plot grabs onto you and takes hold of you. I'll be honest I was not a huge fan of the first one, and only wanted to see it because it leads up to Avengers 2. The acting was amazing, I have now become a bigger fan of Chris Evans. I can't wait to see what happens next in the Marvel Universe..........and neither will you when you see this. I did not give this a 10 because I believe that nothing is perfect, but I did give it a 9",
      "review_date": "2014-04-11"
    },
    {
      "review_title": null,
      "content": "Wow... it has been years.. that I have sat in the theaters and felt so excited and entertained. I loved Captain America.. Loved Loved this movie. It was fabulous. This is one movie I would pay to see again. Excellent writing , Love ChrisWow... it has been years.. that I have sat in the theaters and felt so excited and entertained. I loved Captain America.. Loved Loved this movie. It was fabulous. This is one movie I would pay to see again. Excellent writing , Love Chris Evans. Perfect Captain America. Love the incorporation of the the Shield team . Did I tell you that I love this movie. Love it.",
      "review_date": "2014-04-14"
    },
    {
      "review_title": null,
      "content": "Amazing movie, a very interesting way to connect all the Marvel franchises together. Amazing visual effects and special effects and great storyline too! The connection can be seen clearly as in all the other movies. If you are planning toAmazing movie, a very interesting way to connect all the Marvel franchises together. Amazing visual effects and special effects and great storyline too! The connection can be seen clearly as in all the other movies. If you are planning to watch other upcoming Marvel franchises, I recommend you to see this one because it has a huge impact on the story of S.H.I.E.L.D.",
      "review_date": "2014-04-16"
    },
    {
      "review_title": null,
      "content": "Before I get on with the review I have to mention that MCU is an abbreviation of Marvel Cinematic Universe, the universe where all the Marvel-studios movies take place. Are we on the same page? Yes? Good, let’s start the reviewing!\r CaptainBefore I get on with the review I have to mention that MCU is an abbreviation of Marvel Cinematic Universe, the universe where all the Marvel-studios movies take place. Are we on the same page? Yes? Good, let’s start the reviewing!\r Captain America: The Winter Soldier” is the latest installment in the MCU and it is technically a sequel to both “Captain America: The First Avenger” and “The Avengers” and it follows Captain America (Chris Evans) who now works for S.H.I.E.L.D in modern time. When he discovers a conspiracy in the organisation his loyalties are trusted and old friends turns enemies. In his doubts he also encounters a new foe called the Winter Soldier (I will not say who plays him since that may spoil something for you) and secrets from the past and the present are revealed…\r The cast in “Captain America: The Winter Soldier” is star studded and fantastic! Chris Evans is reprising his role as Cap and he has really grown into the part. Scarlett Johanson, Samuel L. Jackson and Cobie Smulders are also back in their roles from previous MCU-movies and they are better than ever! Newcomers to the MCU includes Anthony Mackie and Robert Redford(!). All the actors are fantastic in their roles. The chemistry between, well, everyone is great. Evans and Johansson share intriguing scenes where their characters morals clash. Anthony Mackie’s character is the comic relief but his acting makes the character more than that. It is great to see Samuel L. Jackson’s, Nick Fury get some real action in this film and Robert Redford is very fun to watch.\r “Captain America: The Winter Soldier”‘s strongest suit is probably the script, which is weird to say since this is a comic-book movie and this particular genre is not known for strong writing. Every single character is written perfectly with new characters getting enough development and already established ones are explored further. Captain America as a person was not very interesting in the previous two movies he appeared. He is however a very well written (and acted) character in this movie. One thing that was done brilliantly in the script was that the story isn’t just a “fish out of water” arc. Cap does react to his new surroundings in a very fun and cool way but the emphasis is on the S.H.I.E.L.D-and-everyone-who-works-there and Captain America relationships. The Winter Soldier is a perfect character with much depth and, well, he’s a major bad-ass! Not only the characters are written well but the plot is also great. It has, much like the characters, a lot of depth and twists and turns. It plays out very much like a political thriller in present day with the classic, but oh so fitting, “don’t trust anyone” theme.\r The action in “Captain America. The Winter Soldier” is nothing short of amazing! I was literally chewing down my nails, panting and I if I wasn’t so tense I would’ve jumped out of my seat because of all the suspense. The movie was rather violent for being a Marvel-studios production and I appreciated that. It gave the movie a sense of realism and it was intense to the limit. When Cap is being punched around you really feel his pain. There are so many great action pieces and scenes with spectacular fight-choreography and jaw-dropping, in lack of a better word, action!\r Directors of the movie are Anthony and Joe Russo from “Community” fame. One would not think that a director-duo mostly known for comedy would be suited for a 170 million dollar blockbuster. One would however be wrong! The Russo’s are handling the directing brilliantly. The comedy is definitely not out of hand. As of matter of fact, nothing is out of hand. Everything is balanced well, the tone is perfect for the kind of story that is being told and all the action is shot amazingly! Kudos!\r This film is packed with action, has stellar performances a thick plot and solid directing. Giving great nods to comic-book fans and movie fans alike “Captain America: The Winter Soldier” isn’t only a fantastic comic-book movie, it is a fantastic movie in general! Cap is back and he is cooler than ever!",
      "review_date": "2014-04-18"
    },
    {
      "review_title": null,
      "content": "All that is needed to be said is...... Murica! Movie is great. It is fun, entertaining, exciting, and kicks butt. Marvel comic's are awesome, Capt. Murica is awesome must see film!",
      "review_date": "2014-04-29"
    },
    {
      "review_title": null,
      "content": "I have never been a fan of Captain America. I didn't find the first movie to be fascinating. Captain America: The Winter Soldier went far beyond my expectations. If you are a fan of Marvel, you will enjoy this film. However, you won't be tooI have never been a fan of Captain America. I didn't find the first movie to be fascinating. Captain America: The Winter Soldier went far beyond my expectations. If you are a fan of Marvel, you will enjoy this film. However, you won't be too lost if you haven't seen Captain America: The First Avenger. It has a nice story line that was smart and not too complicated. In this movie Captain America and Black Widow work together to battle a new threat. This movie is an action film with a number of intense action scenes. It blends its story telling and action scenes together leaving no dull moments.",
      "review_date": "2014-05-28"
    },
    {
      "review_title": null,
      "content": "The best Marvel Cinematic Universe film there has ever been, with the exception of The Avengers. Captain America: The Winter Soldier is first and foremost a political thriller with the essence of a superhero movie. Returning to the role ofThe best Marvel Cinematic Universe film there has ever been, with the exception of The Avengers. Captain America: The Winter Soldier is first and foremost a political thriller with the essence of a superhero movie. Returning to the role of Steve Rodgers, I can safely and assuredly say that Chris Evans is Captain America. One of the best parts of this sequel was the chemistry between the actors, especially between Evans and Scarlett Johansson. The dialogue they share stays compelling and doesn't feel forced at all. And speaking about not feeling forced, Anthony Mackie joins the cast as The Falcon. This could've easily been one of the weak points of the film, as history has proved that the addition of a sidekick tends to backfire on the film. However, Mackie does a great job in providing humour and playing a character that Rodgers can truly identify with and befriend, as they are both war veterans and have similar outlooks on life. Samuel Jackson has appeared in his fair share of Marvel films, yet he was always just a voice in the background. That couldn't be farther from the truth in Marvel's newest addition to their cinematic universe because Nick Fury finally gets down and gritty. The action has never been better and greater than they are here. From the martial arts style fights to the epic set piece battles to an incredibly shot car chase scene, this film will not only amaze superhero fans but action fans as well. Many people are interested about the Winter Soldier and if he is a worthy and menacing antagonist, and the answer to that question is an emphatic yes. Sebastian Stans's performances reminds me of Tom Hardy's Bane from The Dark Knight Rises in that both men have most of their face covered, with their eyes telling a story all on their own. Being the figure in the shadows and suddenly appearing out of nowhere throughout the movie was fantastic as it helped maintain the tone that the directors were gunning for. This is Marvel's response to The Dark Knight in terms of its dark and gritty approach, tackling spy and political themes that are very relevant in today's world. The Russo brother's directing of this film, I think, was probably the best aspect of it. They did a marvelous job in transitioning from the action scenes to the comedy, and then to the emotional character driven moments. Not to be outshined, the script was the best of the Marvel movies, and a large part of that was the character development, which some superhero movies tend to lack. Is it a great superhero movie? Yes. Is it a great MOVIE? Yes. Does it take the genre and go beyond its own limitations and journey into uncharted territory, just as The Dark Knight did? Yes. This is truly an exciting time to be living in.",
      "review_date": "2014-09-23"
    },
    {
      "review_title": null,
      "content": "Captain America the winter soldier is a great milestone for marvel that really adds to an already expanding universe full of interesting, unique, characters that is changing the way we see comic book films today in our society. Easily my newCaptain America the winter soldier is a great milestone for marvel that really adds to an already expanding universe full of interesting, unique, characters that is changing the way we see comic book films today in our society. Easily my new favorite Disney Marvel film due to the fact that the films plot is just so beautifully presented and how everything flows so smoothly and gracefully through all the gritty dark themes that are starting to became a lot more present in the Disney Marvel universe and the fact that the Character Captain America finally feels as if he has found is place within the universe and 2 me is one of the new best characters within this expanding universe. I could go on and on about how astonishing the film is but 2 sum it up, GO WATCH THE FILM, u will be entertained and taking away by the amazing acting, plot, characters and jaw dropping action scenes.\r 10/10",
      "review_date": "2014-05-03"
    },
    {
      "review_title": null,
      "content": "Best Marvel movie to date. Chris Evans Takes his performance of Capt. America to a whole new level. He is the reason Cap is 4th on my list of favorite superheros. And Anthony Mackie has just given me reason to start buying some Falcon comicsBest Marvel movie to date. Chris Evans Takes his performance of Capt. America to a whole new level. He is the reason Cap is 4th on my list of favorite superheros. And Anthony Mackie has just given me reason to start buying some Falcon comics and reading up on his character.  Not to mention the fact that this movie took such an in-depth look into S.H.I.E.L.D. (which was my favorite part of the Avengers). And they brought in a b-level villain (Batroc the Leaper) and made him look cool. My ONLY gripe is.... COME ON SITWELL!!! WHY?!!",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "I'm very glad that I go to the cinema to see this amazing movie! It's spettacular, intencive and has dinamic  action scene at new level! The story is also preety strong and I definitely reccomend this movie to everybody who like this genre,I'm very glad that I go to the cinema to see this amazing movie! It's spettacular, intencive and has dinamic  action scene at new level! The story is also preety strong and I definitely reccomend this movie to everybody who like this genre, you will not be dissapointed.",
      "review_date": "2014-04-05"
    },
    {
      "review_title": null,
      "content": "I absolutely LOVE this movie. I was gripped by what was happening throughout almost the entire movie! There was one bad actor, but I do not think that just because of him this movie's score should be brought down.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "As I watch Captain America Civil War,I thought It was the best Marvel movie but After I've rewatch the this,my opinion becomes different.Captain America:The Winter Soldier is still the best Marvel Movie.\r The film has a great actionAs I watch Captain America Civil War,I thought It was the best Marvel movie but After I've rewatch the this,my opinion becomes different.Captain America:The Winter Soldier is still the best Marvel Movie.\r The film has a great action sequences that is entertaining as hell,the movie is more serious but still has funny moments but all in all it is serious, The plot is well written and straightforward that also inspired from our real world.The characters are great in this,Black Widow was just fantastic,Nick Fury has a bigger role here and it was fascinating,Captain America is just a badass while his Alter Ego Steve Rogers was having a hard time fitting in to the new world he is living after a decades in ice those scenes were just interesting,Agent 13 and Falcon were great addition but Sam Wilson has more screen time than Agent 13 who was also underdeveloped and so thus Maria Hill.Hydra is the real villain here with the leadership of Alexander Pierce and their secret weapon the titled character who was just compelling and who happens to be cap's friend making Cap conflicted about it.The performances were fantastic in the film,all of them,no one did wrong,and no one felt shoehorned for a commercial of an upcoming film(Spider-man was shoehorned in Civil War but because he was well executed,we didn't feel like it).\r All in all the film was great,the plot has a clearer focus than civil war,the action set pieces are also clear and well executed,the characters are entertaining to watch,the music score is fine for this film. The balanced humor and seriousness well and the dialogue was well written.Captain America:The Winter Soldier is far superior movie than Civil War but that's just me.",
      "review_date": "2016-06-04"
    },
    {
      "review_title": null,
      "content": "Captain America: The Winter Soldier is literally a Marvel of a movie, and is very much a game changer for that universe which will shake up things hugely and have ramifications for the several franchises that it connects with. A fantasticCaptain America: The Winter Soldier is literally a Marvel of a movie, and is very much a game changer for that universe which will shake up things hugely and have ramifications for the several franchises that it connects with. A fantastic infusion of adrenaline to the heart that will prevent the Marvel universe from becoming stale and repetitive in the coming years.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Winter Soldier is the best movie about Captain America at this moment. Story is interesting spy action with nice special effects and few unexpected moments. Those people who liked movies about comics or good action movies, I'm certainly recommend.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "This is probably the best superhero movie I've seen come out of the phase 2 plan for the Marvel movies so far. This movie was filled with tons of action and suspense but most of it will be lost on you if you know anything about Cap's history.This is probably the best superhero movie I've seen come out of the phase 2 plan for the Marvel movies so far. This movie was filled with tons of action and suspense but most of it will be lost on you if you know anything about Cap's history. From a comic book fans perspective, this is your standard tie-in movie with the next Avengers and you already know what happens at the end. For others, it's a suspenseful thriller with  tons of action and intrigue. Everything was exceptionally well done and I liked this movie alot more than I did either Iron Man 3 or Thor 2. I do not like what they did with some of the characters though, including Robert Redford's character and the fact that they turned Falcon into a knock-off side-kick. Fans of the comic books will know why Redford's character was no good and that's all I'll say about that. Everything else here is wonderful. We can only hope that the next few Marvel movies before the next Avengers can live up the hype set by this movie. Until then, it's nice to see them taking these movies very seriously and they put alot of time and effort into this piece, especially after the first Cap movie was not that great.",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Fantastic movie by any means - only better because of it being an MCU movie. For me, this is a strong contender for the best Marvel movie yet. I rate it only behind Avengers and Thor 2 because I prefer the sci fi genre to political thrillers,Fantastic movie by any means - only better because of it being an MCU movie. For me, this is a strong contender for the best Marvel movie yet. I rate it only behind Avengers and Thor 2 because I prefer the sci fi genre to political thrillers, which this movie was.\r Superhero movie of the year? Possibly. I'll have to wait till Guardian of the Galaxy is released to say for sure. Being part of the MCU already puts it ahead of X Men and Spider Man no matter how great they may be",
      "review_date": "2014-04-07"
    },
    {
      "review_title": null,
      "content": "Brilliant acting, amazing score, everything a superhero movie needs. Comparable to Marvel's The Avengers. The writers did an awesome job. It's good seeing Redford portray a villain. Potentially, one of the best superhero movies of all time.",
      "review_date": "2014-04-05"
    },
    {
      "review_title": null,
      "content": "okay, we're getting a pretty great build-up to \"The Avengers 2\" next year. we had Thor and Iron Man, and now we've come to America! yeah, that's right. it's \"Captain America: The Winter Soldier\". the sequel to \"Captain America: The Firstokay, we're getting a pretty great build-up to \"The Avengers 2\" next year. we had Thor and Iron Man, and now we've come to America! yeah, that's right. it's \"Captain America: The Winter Soldier\". the sequel to \"Captain America: The First Avenger\" from 2011, and it's probably Cap's first modern movie where he's on his own. and i was excited to see that. well, he's still working for the S.H.I.E.L.D and they send him to deal with everything and **** goes down! so, this is the first action/thriller movie directed by the Russo brothers and i gotta say: as their first try, they did a great job in this movie! what i loved about this movie is that, instead of just being a great superhero movie, it's also a really good political thriller too. it was really well, like i loved the theories that's going on like \"don't trust anybody\", and Cap's in the middle cause he trusts everybody. but now, he starts to look around and when you look at the world that he's in against the one he came from, you can totally see that he doesn't really know where he belongs anymore. i thought the Russos did a fantastic job in showing that and you definitely feel about Cap's characters a lot more. and what's so great about Marvel is that, when your least character gets to be one of the best, that's what Marvel does right and it's great. like Captain America's a lot more interesting here, cause we get to see him dealing with this world and dealing with S.H.I.E.L.D and the easter eggs in this movie are top notch. the acting was really good too. Chris Evans was great as Captain America, Scarlett Johansson owned the role of Black Widow and their relationship was great. i loved seeing how they have a conversation while kicking some serious ass, that was awesome! the action was amazing, it was awesome and intense and it felt so real! the pacing was great, the cinematography was great, the script was well-written and this movie was just so much fun to watch. i'm telling ya right now: whether you're a Marvel fan, a comic book fan or a action movie fan in general, then you're gonna love this movie. \"Captain America: The Winter Soldier\" was a fantastic sequel to \"Captain American: The First Avenger\" and honestly, i can't wait for the third one.\r10/10",
      "review_date": "2014-05-23"
    },
    {
      "review_title": null,
      "content": "Brilliant fighting scenes (not 2014s best though, check The Raid 2 for that), very well choreographed. Actors do a decent job (it´s not a movie to shine as an actor anyway) and the story is slightly superior to the average Marvel film. ButBrilliant fighting scenes (not 2014s best though, check The Raid 2 for that), very well choreographed. Actors do a decent job (it´s not a movie to shine as an actor anyway) and the story is slightly superior to the average Marvel film. But the hype around it is too much. Robert Reford is totally wasted. The brief scenes with real dialogue are as corny and childish as in any other Marvel film, jokes are weak, which makes for a weird mix of serious tone and action and these cheap jokes that does not work that well. Particularly annoying is the score during the first past of the film, very American-ish in a bad and patriotic way. The villain was a little bit better than usual too, but still weak and all their scenes remind the audience of The Dark knight Batman and Joker scenes, only that failing to come close. Overall, entertaining but only a little bit better than the typical mediocre comic book film from Marvel.",
      "review_date": "2015-02-16"
    },
    {
      "review_title": null,
      "content": "Excellent movie. One of the best Marvel Superheroes movie besides The Avengers. It was fun and keeps you on the edge of your seat. The script is superb and the actors were stupendous.",
      "review_date": "2014-04-23"
    },
    {
      "review_title": null,
      "content": "Not just one of the best comic book movies, but one of the best political-thrillers, and one of the best movies of the year. Amazing acting, amazing story, amazing visuals. The Winter Soldier is Marvel Studios \"The Dark Knight\". I transcendsNot just one of the best comic book movies, but one of the best political-thrillers, and one of the best movies of the year. Amazing acting, amazing story, amazing visuals. The Winter Soldier is Marvel Studios \"The Dark Knight\". I transcends a genre into new territories and with it enhances the entire Marvel Cinematic Universe and The Agents of S.H.I.E.L.D. television show. It changes everything you think you know about this universe and our own. Calling it realistic would be far-fetched, but it truly is inspired by our own government and it's secrets.",
      "review_date": "2014-08-02"
    },
    {
      "review_title": null,
      "content": "As much as I enjoy the political thrillers of the 1970s for their simplicity and grittiness, there were some serious pacing issues with 'Captain America: The Winter Soldier', a film directly inspired by those films. Like some of the films ofAs much as I enjoy the political thrillers of the 1970s for their simplicity and grittiness, there were some serious pacing issues with 'Captain America: The Winter Soldier', a film directly inspired by those films. Like some of the films of the 1940s that let themselves get bogged down in shoe-horned love stories, “Captain America: The Winter Soldier” stumbled hard in the middle of the narrative.\r Much of the problems in this film stem from Scarlett Johansson’s character. She’s really unnecessary to the overall nature of the film, except to impart some level of humanity to Captain Rogers. But the character of Emily VanCamp has no logical function at all. Ultimately, if the story had stuck to its guns as a political thriller throughout, it could have been fantastic. However, the film felt too bloated with all of its characters and it brought the film to a screeching halt.\r Movies like “The French Connection” and “Serpico” live up to the political thriller genre. Unfortunately, “Captain America: The Winter Soldier” may be entertaining in a fun way but it is more a movie for kids and not the thinking man's political thriller we were promised by Disney/Marvel.",
      "review_date": "2014-04-09"
    },
    {
      "review_title": null,
      "content": "I actually enjoyed watching this movie, which was a surprise for me due to the fact that I didn't find the previous movies entertaining. The “Winter Soldier” looked Mysterious, he was awesome, too bad he didn't pop up much in the Movie. JustI actually enjoyed watching this movie, which was a surprise for me due to the fact that I didn't find the previous movies entertaining. The “Winter Soldier” looked Mysterious, he was awesome, too bad he didn't pop up much in the Movie. Just about every aspect of this movie was flawless, 9/10.",
      "review_date": "2014-04-06"
    },
    {
      "review_title": null,
      "content": "I saw this a few weeks ago and IT IS the best marvel movie yet, don't listen to the people who say that Iron Man 3 is better, there wrong. There's a lot of moments in that movie including the ending with all the suits that I thought were justI saw this a few weeks ago and IT IS the best marvel movie yet, don't listen to the people who say that Iron Man 3 is better, there wrong. There's a lot of moments in that movie including the ending with all the suits that I thought were just stupid and all those moments with the cliche ''US president being kidnapped'', is so over used. With The Winter Soldier it is an edge of your seat Thriller with some spectacular action sequences including Nick Fury's car chase which is a change of pace for him as he is usually stuck behind his desk but really shows his true self in this one. This is the Marvel movie that isn't full of the usual cheesy moments and only has humour at the right moments and isn't over used.\rThe Winter Soldier is a proper bad ass who really stands up against Captain America but the big reveal of his identity was already known for months so that moment was that great but Rogers' reaction is still pretty interesting. Scarlett Johansson is flawless in this movie and is taken way more seriously this time and shows every one that she should get her own movie and I really hope she does because of this\rone. It may even happen after The Avengers Age of Ultron if we're lucky. There just isn't a dull moment and I can't wait for Age of Ultron when we will see the full effect of Winter Soldier's Story. We have already\rseen the effects of Winter Soldier in Agents of SHIELD so it should be interesting to see what happens next. We will just have to wait and see",
      "review_date": "2014-05-05"
    },
    {
      "review_title": null,
      "content": "Caught Captain America: The Winter Soldier yesterday and it really is a great movie. And it would help if you watched the first Captain America I don't think it's absolutely necessary but some parts will go by you. Acting was on point, actionCaught Captain America: The Winter Soldier yesterday and it really is a great movie. And it would help if you watched the first Captain America I don't think it's absolutely necessary but some parts will go by you. Acting was on point, action scenes were phenomenal, and love a couple of unexpected twists. Stay for the 2 endings after the credits.  (the first one is great, the second not so much). But go - go watch and enjoy!",
      "review_date": "2014-04-07"
    },
    {
      "review_title": null,
      "content": "Superhero movies are all the same to me as far as the plot goes.  This one has better than average action and special effects.  But in the end, you will forget most of the movie a couple of months from now.  There is nothing new we haven'tSuperhero movies are all the same to me as far as the plot goes.  This one has better than average action and special effects.  But in the end, you will forget most of the movie a couple of months from now.  There is nothing new we haven't seen before to make it memorable.",
      "review_date": "2014-04-16"
    },
    {
      "review_title": null,
      "content": "Better than the first Captain America movie. I just loved the development of the story. The action sequences were top notch. Chris Evans looks great in his role.",
      "review_date": "2014-04-09"
    },
    {
      "review_title": null,
      "content": "This is a good movie... I really liked the action sequences of this movie and the story line was very good as well as the acting... a fun movie to watch",
      "review_date": "2014-05-19"
    },
    {
      "review_title": null,
      "content": "Without a doubt the best Marvel movie. Not only is it insanely engaging (the fight choreographies give Bourne a run for its money), it has a very thought provoking and clever story about the importance of trust and ideals. Not to mention it'sWithout a doubt the best Marvel movie. Not only is it insanely engaging (the fight choreographies give Bourne a run for its money), it has a very thought provoking and clever story about the importance of trust and ideals. Not to mention it's the only Marvel sequel where the events of the previous movie had any major consequences.\rChris Evans proves once again why he was a perfect pick for the lead (the speech near the climax has him at his finest moment), and the suppprting cast plays with him very well.\rI can't wait for Civil War!",
      "review_date": "2015-11-07"
    },
    {
      "review_title": null,
      "content": "A comic book film mixed with political thriller the best stand alone marvel film since The Avengers.  I admit I may not have caught on to everything going on, but it's terrific none the less.  A-",
      "review_date": "2014-04-04"
    },
    {
      "review_title": null,
      "content": "Very nice. Chris Evans and Scarlet Johanson are great duo. Actual plot in additional to newest special effects makes this movie A class. Cant wait for Avengers 2. Also, while Iron Man 3 and Thor 2 was worse than previous movies, this one isVery nice. Chris Evans and Scarlet Johanson are great duo. Actual plot in additional to newest special effects makes this movie A class. Cant wait for Avengers 2. Also, while Iron Man 3 and Thor 2 was worse than previous movies, this one is definitely better than Capitan America 1. Keep it up!",
      "review_date": "2014-04-17"
    },
    {
      "review_title": null,
      "content": "I'd say it's defiantly worth watching. Marvel have hit another massive home run with this movie. Iron Man 3 was great, but this was awesome. Great characters, excellent story and superb action scenes. Only problem is that for a film with theI'd say it's defiantly worth watching. Marvel have hit another massive home run with this movie. Iron Man 3 was great, but this was awesome. Great characters, excellent story and superb action scenes. Only problem is that for a film with the subtitle \"The Winter Soldier\", it's less about him and more about Hydra, which is maybe a little misleading. But overall, great film.",
      "review_date": "2014-04-27"
    },
    {
      "review_title": null,
      "content": "Boasting killer action scenes and a superb cast, CAPTAIN AMERICA: THE WINTER SOLDIER is a pleasant change tone and a welcome addition to the Marvel Universe",
      "review_date": "2015-02-24"
    },
    {
      "review_title": null,
      "content": "The only issue I had with the movie was the over use of shaky-cam effects. I like to see the action, not try to guess at what is happening on the screen. Fortunately, they don't have too many moments that use this effect.",
      "review_date": "2014-04-07"
    },
    {
      "review_title": null,
      "content": "To say Captain America is the best Marvel Film from the Marvel Cinematic Universe or just in general wouldn't be the craziest thing to say, and that's when you consider The Avengers. This film isn't another generic action movie, it's aTo say Captain America is the best Marvel Film from the Marvel Cinematic Universe or just in general wouldn't be the craziest thing to say, and that's when you consider The Avengers. This film isn't another generic action movie, it's a political thriller. Think Bourne, but with a shield and superpowers. This movie will make you think of the Marvel Cinematic Universe in a different light altogether. The plot and the action in this movie go hand in hand, and you will definitely be in for a ride. Also, be sure to stay until after the credits as usual with Marvel films. This is a definite must see for comic book fans and movie-goers alike.",
      "review_date": "2014-04-09"
    },
    {
      "review_title": null,
      "content": "Captain America: TWS is a very good action film and anyone who is a fan of action will undoubtedly enjoy this film. The Story was overall very good and captivating (even though I got confused by it at times, but that's probably my own fault)Captain America: TWS is a very good action film and anyone who is a fan of action will undoubtedly enjoy this film. The Story was overall very good and captivating (even though I got confused by it at times, but that's probably my own fault) and there is also some good humor. There was also a lot of drama which was good, overall this film was excellent and while I still don't think that it's probably as good as The Avengers IMO, I do think that this film is better than Captain America: TFA in many ways. I recommend it.",
      "review_date": "2014-04-09"
    },
    {
      "review_title": null,
      "content": "Amazing Movie! Great Characters! This movie perfectly blends espionage thriller with the blockbuster comic book movie. If you see one movie make this your movie!",
      "review_date": "2014-04-05"
    },
    {
      "review_title": null,
      "content": "Cap 2 is one of Marvel's best and sets the bar for all of the comic book movies to follow. It has awesome action and fighting sequences, just great story, hard choices, good interactions with main characters, terrifying villain.\rIt is simplyCap 2 is one of Marvel's best and sets the bar for all of the comic book movies to follow. It has awesome action and fighting sequences, just great story, hard choices, good interactions with main characters, terrifying villain.\rIt is simply one of the best superhero movies of all time, and if you a fan of comic book movies you definitely need to watch this one, you will not regret!!!",
      "review_date": "2014-04-08"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nMarvel Cinematic Universe (MCU) Analysis: Captain America: The Winter Soldier (2014)\r 2014 has been a good year not just for movies in general, but also for super-heroes flicks. With the disappointing sequel that’s known as “The Amazing Spider-Man 2”, I also saw “X-Men: Days of Future Past” and “Guardians of the Galaxy” which were pretty damn amazing, but the first super-hero film I saw this year was “Captain America: The Winter Soldier”. Holy sh*t, this movie is REALLY good. The pacing is great, the plot is great and the action scenes, oh my god… they are phenomenal. After re-watching it, I had to lower my score but you’ll know why I did that, if you read this whole review. I went to see this movie with my pal, and we were satisfied by how good this movie was. Although, there are some questionably bad elements, some other elements make up for that, and you know this movie exceed my expectations for future Marvel installments.\r Steve Rogers, finding it easier to acclimate to the modern society as a soldier of SHIELD, learns that the organization has been compromised and a Soviet assassin known as The Winter Soldier will stop at nothing to kill Captain America, which leads him uncover a truth that will change everything.\r First off, let’s talk about the plot. The movie’s spy-thriller plotting is so well done. I love how the filmmakers were trying to fit Steve Rogers in the new world, dealing with the pop culture he has never met before, because, if you saw the first Captain America film (which is most likely you did), you’d know that Captain slept for about 70 years. There’s one scene (curiously, it’s right in the beginning of the movie) where Steve picks his notebook to write down few things he missed when he was frozen back in the 40’s, if you look closely, you’ll see that there’s “Star Wars” written on it. Man, that will blow his mind because if you have seen Star Wars, you probably know that Samuel L. Jackson (the same actor who plays Nick Fury in this movie) is in it. I also love the fact how they constructed the whole Hydra subplot. Now, the villain. While the Winter Soldier is an appealingly badass character, there is no much depth to him. I don’t know, I just think the Hydra’s subplot too often overshadows the title’s character, NOT Captain America, but yes, The Winter Soldier. I think they should have renamed The Winter Soldier to “Captain America: The Fall of Shield”. Perhaps the title didn’t want to give an impression that Shield was going down, to not give too much away of the plot. So yeah, the antagonist was cool, there’s a fight scene where he Bucky Barnes (aka Winter Soldier) punches Cap’s shield, and that resembled the comics, when once Barnes punched Captain’s shield right in the center of the object. I didn’t read the comic, but I heard for someone else.\r The dialogue is really bad. I mean, occasionally, it is very bad. Not the way that it’s written, but in the context that the dialogue is put, like for instance, when Natasha Romanoff is sitting next Rogers in the car and she starts asking this: “Was I really your first kiss since 1945?”. Jesus, is really that what were you thinking when you guys were driving towards Shield bunker in New Jersey? Yikes. One of the main reasons that the dialogue in “Iron Man” works is because the director and the studio let Robert Downey Jr. improvise his own dialogue, he hammed it up as Tony Stark. Unfortunately, it is my duty sorry to report that Steve Rogers is not Tony Stark. He’s not witty. In “The Winter Soldier”, the dialogue is rather more annoying than amusing. Luckily, one of the highlights of the film make up for that, which leads me to the next point.\r The action sequences. Although the action scenes suffer from some shaky cams, the battles are well choreographed, not only in the final battle but when Agent Romanoff and Captain America are fighting the Winter Soldier in the highway. They are… amazing. My friend and I were astonished by how good they are. Sometimes they felt like warfare battles instead of an ordinary super-hero blockbuster, but then a guy with eagle-wings comes in, and yeah… you know.\r The cast is outstanding. Chris Evans returns to reprise the role as Steve Rogers/Captain America and Scarlett Johansson is simply the hottest super-hero sidekick in a while. Like I said before, Samuel Jackson also returns as Nick Fury and other actors like Robert Redford (portraying Alexander Pierce, basically the villain of this movie, kind of) and Anthony Mackie are just great.\r Final Score to Captain America: The Winter Soldier: 8.5/10. I’m not a huge Captain America fan, but this movie was startling, stylish and the actors’ performances were magnificent. The dialogue and the villain could use some work, but at the end of the day, this entertaining for everyone. Next MCU review: Guardians of the Galaxy.",
      "review_date": "2014-12-07"
    },
    {
      "review_title": null,
      "content": "Awesome movie,but the first one still better.This movie got some very good action scenes and funny jokes but in concept of story,the first one wins.This is a good movie,nothing more.",
      "review_date": "2014-04-16"
    },
    {
      "review_title": null,
      "content": "Hands down the best marvel movie. Top quality - almost as good as M&T standard.\r Great plot twists as well as action : story ratio. I was happy to see the story was not focused around the Winter Soldier and I believe that it is better thanHands down the best marvel movie. Top quality - almost as good as M&T standard.\r Great plot twists as well as action : story ratio. I was happy to see the story was not focused around the Winter Soldier and I believe that it is better than the Avengers.\r A lot of lovely references just like all Marvel movies and Cap was definitely more fun to watch now that he had EPIC hand to hand combat.",
      "review_date": "2014-04-17"
    },
    {
      "review_title": null,
      "content": "Captain America: the Winter Soldier is a testament to what Marvel can do in the Cinematic Witness.  Groundbreaking effects, good writing, and extremely powerful chemistry between actors brings together what seems Marvel's zenith in the MCU.Captain America: the Winter Soldier is a testament to what Marvel can do in the Cinematic Witness.  Groundbreaking effects, good writing, and extremely powerful chemistry between actors brings together what seems Marvel's zenith in the MCU.  Although the character of Falcon seems a bit odd with no origin story at all, the movies plays him off well later on as a good friend and companion to Captain America.  I also LOVED the fight choreography between Captain America and Bucky, as well as the Cap and the enemy soldiers.\r Overall, a well-earned 9/10.",
      "review_date": "2014-05-07"
    },
    {
      "review_title": null,
      "content": "i have to say. the first one wasn't a great movie. although this movie is defiantly really really good. the main thing in the first one was that it just made captain america a regular strong guy. in this one it made it seemed like he was ani have to say. the first one wasn't a great movie. although this movie is defiantly really really good. the main thing in the first one was that it just made captain america a regular strong guy. in this one it made it seemed like he was an actual super hero. the movie kept me on the edge of my seat the entire time. the story was interesting to see how this whole plot unfolded. this really is the peak so far of the marvel universe, and i cant wait to see gaurdians of the galaxy",
      "review_date": "2014-05-07"
    },
    {
      "review_title": null,
      "content": "So much better than the first one, action wise. Moves quick and keeps you on the edge of your seat!  Some of the story was predictable, but still well done and great casting.  Special effects were the bomb!",
      "review_date": "2014-05-16"
    },
    {
      "review_title": null,
      "content": "Great movie period. It's the best movie in theaters in 2014 so far! If you liked The Avengers you most definitely will like this one! Do not make your assumption about this Captain America sequel based on the 1st movie if you didn't like it.Great movie period. It's the best movie in theaters in 2014 so far! If you liked The Avengers you most definitely will like this one! Do not make your assumption about this Captain America sequel based on the 1st movie if you didn't like it. Is a MUST SEE! There shouldn't be ANY negatives to this movie especially if you consider yourself the type to be a bit biased towards liking Marve.",
      "review_date": "2014-07-19"
    },
    {
      "review_title": null,
      "content": "AWESOME. that is one of few words I would use to describe this film. its one of the better marvel films out there right next to the x-men films and of course the avengers. my only hope now after seeing this is that the new x men film willAWESOME. that is one of few words I would use to describe this film. its one of the better marvel films out there right next to the x-men films and of course the avengers. my only hope now after seeing this is that the new x men film will live up to the same hype cause this film has set high standards",
      "review_date": "2014-07-20"
    },
    {
      "review_title": null,
      "content": "This is probably the best superhero movie I've seen come out of the phase 2 plan for the Marvel movies so far. This movie was filled with tons of action and suspense but most of it will be lost on you if you know anything about Cap's history.This is probably the best superhero movie I've seen come out of the phase 2 plan for the Marvel movies so far. This movie was filled with tons of action and suspense but most of it will be lost on you if you know anything about Cap's history. From a comic book fans perspective, this is your standard tie-in movie with the next Avengers and you already know what happens at the end. For…",
      "review_date": "2014-07-31"
    },
    {
      "review_title": null,
      "content": "Captain America is back and this he's better than ever. The first one was enjoyable but the sequel definitely takes the cake. One of the best Super hero movies I've ever seen and a great follow up to The Avengers: Age of Ultron.",
      "review_date": "2014-08-01"
    },
    {
      "review_title": null,
      "content": "Captain America is back and this he's better than ever. The first one was enjoyable but the sequel definitely takes the cake. One of the best Super hero movies I've ever seen and a great follow up to The Avengers: Age of Ultron.",
      "review_date": "2014-08-01"
    }
  ],
  "num_reviews": 148
}