{
  "title": "Gone Girl",
  "rating": 8.2,
  "release_date": "2014-10-03",
  "summary": "On the occasion of his fifth wedding anniversary, Nick Dunne (Ben Affleck) reports that his beautiful wife, Amy (Rosamund Pike), has gone missing. Under pressure from the police and a growing media frenzy, Nick's portrait of a blissful union begins to crumble. Soon his lies, deceits and strange behavior have everyone asking the same darkOn the occasion of his fifth wedding anniversary, Nick Dunne (Ben Affleck) reports that his beautiful wife, Amy (Rosamund Pike), has gone missing. Under pressure from the police and a growing media frenzy, Nick's portrait of a blissful union begins to crumble. Soon his lies, deceits and strange behavior have everyone asking the same dark question: Did Nick Dunne kill his wife?… Expand",
  "critic_reviews": [
    "Gone Girl is a terrific movie, everything the book and its fans deserve.",
    "Grimly dark humor and spot-on production design buttress the captivating story and heighten the unnerving atmosphere...Gone Girl will leave you breathless and haunted.",
    "Fincher is a fearless filmmaker who understands his audience’s intelligence (not to mention their cinematic blood lust). By the end of Gone Girl, we feel like we’ve lived through about four movies, not just one. Good luck letting go of any of them.",
    "Superbly cast from the two at the top to the smallest speaking parts, impeccably directed by Fincher and crafted by his regular team to within an inch of its life, Gone Girl shows the remarkable things that can happen when filmmaker and material are this well matched.",
    "Anyone who loved Gone Girl the book will walk out of Gone Girl the movie with a sick grin on their face. You can stop being nervous.",
    "It's a hypnotically perverse film, one that redeems your faith in studio smarts (but not, alas, in local law enforcement, tabloid crime reporting or, indeed, marriage).",
    "Surgically precise, grimly funny and entirely mesmerizing over the course of its swift 149-minute running time, this taut yet expansive psychological thriller represents an exceptional pairing of filmmaker and material.",
    "Gone Girl offers interesting, even amusing audio cues: the sound of a distant mourning dove when we suspect Amy’s been killed, or Blue Oyster Cult’s “Don’t Fear the Reaper” playing on a car radio as Nick returns his obnoxious father to an assisted care center.",
    "Twisty pulp entertainment at its highest level.",
    "The movie’s most tantalizing mystery is the question of what’s really going on in their heads. It remains unanswered.",
    "Gone Girl is not Fincher's best film, nor is it the most conventionally satisfying of them, but it feels like this is a movie that represents the very best that Hollywood craft can offer at the moment.",
    "David Fincher's meticulous direction pays off in spades. From the way he expresses the book's construction — not quite he-said/she-said, but a version of that — to the way the film looks (cold and uncaring, like its characters) to his work with actors (go Tyler Perry!), Gone Girl delivers.",
    "Gone Girl reveals itself as an optimal meeting of the minds, a perfect amalgam of a writer and a director with complementary fixations.",
    "The movie is phenomenally gripping—although it does leave you queasy, uncertain what to take away on the subject of men, women, marriage, and the possibility of intimacy from the example of such prodigiously messed-up people.",
    "Not only brutal but also brutally funny, Gone Girl mixes top-notch suspenseful storytelling with the kind of razor-edged wit that slashes so quick and clean you're still watching the blade go past before you notice you're bleeding.",
    "Fantasies and phantasms aside, Fincher proves himself yet again to be a better cinematic psychologist of (in-)human nature than almost any other director alive. It’s another squirmily excellent date movie from hell, courtesy of contemporary cinema’s most overt nihilist.",
    "Here’s another word for Gone Girl: “meta.” It’s a word Flynn uses, which means it’s a thriller about thrillers, and a narrative about narratives, especially the form of domestic violence relished by current-affairs television shows.",
    "Gone Girl is a rare movie: a delicious thriller that provides plenty of titillation and gruesome pleasure while offering a dollop of social commentary. It's smart, twisted, bloody, and almost guaranteed to satisfy anyone with a penchant for the macabre.",
    "Gone Girl is art and entertainment, a thriller and an issue, and an eerily assured audience picture.",
    "The editing, with so many twists and turns and so many supporting characters needing their due, is without hiccups. And thankfully, there’s plenty of dark humor.",
    "David Fincher's film version of the Gillian Flynn bestseller Gone Girl is a stealthy, snake-like achievement. It's everything the book was and more — more, certainly, in its sinister, brackish atmosphere dominated by mustard-yellow fluorescence, designed to make you squint, recoil and then lean in a little closer.",
    "David Fincher's shockingly good film version of Gone Girl is the date-night movie of the decade for couples who dream of destroying one another.",
    "Gone Girl is a rare bird: a tricky, weird mystery that benefits from people knowing its twist from the outset.",
    "In a movie of subtle tones and wild swerves, Pike expertly mixes a cocktail of hot and cold blood. She is the Amazing Amy you could fall for, till death do you part.",
    "Like a film noir siren Gone Girl is beautiful, sexy, and fascinatingly mean — a nasty but estimable piece of work.",
    "It’s a work of chilly wit and bleak metaphor, an artifice that invites the kind of analytical response where we pull on our chins and discuss how other people, more naive than we, will receive it.",
    "Doesn’t have the heft of Zodiac or the verve of Se7en but Gone Girl is a masterful adaptation and a superior crime-thriller. As for Fincher changing the ending… See for yourself.",
    "Stylish, twisted and daring, Gone Girl is a David Fincher date movie: dark, smart and dangerous. If it doesn’t deliver in its finale, its twist, turns and commitment to moral repugnance will leave you reeling.",
    "Gone Girl, finally, may be no more than a storm in a teacup. But what an elegant, bone-china teacup this is. And what a fearsome force-10 gale we have brewing inside.",
    "For all its simmering malice and buried secrets, it’s worth remembering that this is David Fincher in fun mode: unnerving, shocking and provoking for better and for worse, in sickness and in health, but mostly sickness.",
    "A sharply made, perfectly cast and unfailingly absorbing melodrama. But, like the director's adaptation of another publishing phenomenon, The Girl With the Dragon Tattoo, three years ago, it leaves you with a quietly lingering feeling of: “Is that all there is?”",
    "The less you know about Gone Girl going in the better, but even knowing what’s ahead doesn’t prepare you for the movie’s tone, which is funny yet curdled and cynical and black. This is a satirical antidote to the feel-good pap most Hollywood movies about relationships push on their audiences - here’s the perfect date movie for someone you want to break up with.",
    "Ultimately what makes Gone Girl so watchable is the three-headed monster of Fincher, Pike and Affleck. The director bathes the B-movie scenario in the queasy-green hues of a morgue, while Affleck flashes his million-dollar smile like a dime-store Dracula and the beautifully inscrutable Pike absorbs the light like a wax mannequin. If it’s true that Nick and Amy were made for each other, they were made in a fiendish lab.",
    "Gone Girl is a great thriller until it stops being one, about 20 minutes before the finish. Until then it’s brilliant, not just a triumph of story but of strategy, a movie that keeps the audience grasping and reaching in all the wrong directions, while consistently delivering something a little better, a little crazier and a little more disturbing than expected.",
    "It’s good, but we’ve come to expect more from the guy who gave us “Fight Club” and “The Social Network.” This is more on a par with “Girl with the Dragon Tattoo.” The calculated shocks feel like a movie we’ve seen before, though at least in this case, that’s not true.",
    "While Gone Girl is certainly his slightest film to date, it's nonetheless undeniably gripping. Fincher clearly enjoys turning the screws and rounding the wild corners of the plot from the first frame.",
    "By the end of Gone Girl, the social issues that animate the film's beginning — job loss in an economic downturn, differences in wealth and class, media manipulation — have receded, and things have gotten so plot-driven and pulpy, there's nothing to challenge the director or make him stretch. In the film's final stages he seems to be relying entirely on craft — but, boy, is it effective craft.",
    "The movie, with some of the trappings of a murder mystery, makes its points with blunt force. Fun seldom figures in this adaptation, which is overlong and mysteriously unaffecting. Still, Mr. Fincher's film has many fascinations.",
    "The movie, while entertaining and extremely well crafted, is too self-conscious about its depravity to be either truly disturbing or disturbingly funny. Ticking along with metronome-like efficiency, it's more slick than sick.",
    "Though some artfulness is dredged up amongst the trash, there's plenty to perturb and perplex.",
    "At its strongest, Gone Girl plays like a queasily, at times gleefully, funny horror movie about a modern marriage, one that has disintegrated partly because of spiraling downward mobility and lost privilege. Yet, as sometimes happens in Mr. Fincher’s work, dread descends like winter shadows, darkening the movie’s tone and visuals until it’s snuffed out all the light, air and nuance.",
    "A few of the supporting players, including Kim Dickens, as a suspicious local cop, and Carrie Coon, as Nick’s twin sister, move beyond the formulaic, which is more than can be said for the movie.",
    "Fincher likely prides himself on turning coal into diamonds at this point, but Flynn's script can feel so retrograde at times that one wonders whether it might have been better served by a De Palma, Bigelow, or even a Verhoeven — which is to say, a filmmaker less concerned with making the lascivious seem prestigious.",
    "A glossy, empty and ultimately unsatisfying — if undeniably entertaining — movie.",
    "Gone Girl may get the job done as a dutiful, deliberately paced procedural, but it never quite makes the splash it could have as a thoughtful, timely and thoroughly bracing plunge.",
    "Perhaps Flynn, who did the adaptation, has been a little too faithful to her novel. The faux-punchiness of her dialogue doesn’t help matters. The characters sound like people trying to sound like people in the movies and not quite pulling it off.",
    "Preposterous, illogical, senselessly over-plotted and artificial as a ceramic artichoke, David Fincher’s Gone Girl is another splatterfest disguised as a psychological thriller about the disintegration of a murderous marriage that I find one of the year’s grossest disappointments.",
    "The glum fact is that Gone Girl lacks clout where it needs it most, at its core.",
    "There's a comic streak to the film that suggests David Fincher may understand the material as trash, but it's the kind of affectation that only reinforces, rather than dulls, its insults."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A masterpiece of genre film-making.  I felt like I was watching a long-lost Hitchcock classic (but one with all the sex and violence Hitch was only allowed to hint at).  No spoilers. The less you know about the story going in, the more you'llA masterpiece of genre film-making.  I felt like I was watching a long-lost Hitchcock classic (but one with all the sex and violence Hitch was only allowed to hint at).  No spoilers. The less you know about the story going in, the more you'll enjoy it. Fans of the novel are in for an impeccable and precise adaptation of the source material.  Fincher nails the tone and sustains it effortlessly for the entire running time.",
      "review_date": "2014-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I believe today is a jewish holiday, so this word may best sum up Gone Girl -- OY! What started off as a reasonably interesting mystery, turns very ridiculous very quickly, and then descend into absurdity. Once the movie takes \"that\" dreadedI believe today is a jewish holiday, so this word may best sum up Gone Girl -- OY! What started off as a reasonably interesting mystery, turns very ridiculous very quickly, and then descend into absurdity. Once the movie takes \"that\" dreaded turn, everything from the acting and dialogue turns into a cheap made-for-tv melodrama you'd find on Lifetime. This is a rental folks.",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I see Gone Girl as a horror movie, it shows us how a relationship can take a dark turn and urn our life upside down. Firs of all, Ben Affleck: man that guy has come a long way. He did an amazing job and you could really see that Fincher hasI see Gone Girl as a horror movie, it shows us how a relationship can take a dark turn and urn our life upside down. Firs of all, Ben Affleck: man that guy has come a long way. He did an amazing job and you could really see that Fincher has helped Ben become a better actor. Rosamund Pike was amazing and I seriously think she was robbed at the Oscars. Great performance from everyone and we got exactly what we expected from David Fincher, a masterfully cratered movie from start to finish.",
      "review_date": "2016-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's mercilessly dark, but that's David Fincher for you. He's also one of those who likes to keep twisting your perspective of each character around and around until you don't even know how to feel. The ending really was tormenting in bothIt's mercilessly dark, but that's David Fincher for you. He's also one of those who likes to keep twisting your perspective of each character around and around until you don't even know how to feel. The ending really was tormenting in both the good and bad way. While it tied the story up nicely, it left a bad taste in my mouth. Rosamund Pike does well with the psycho crazy and Ben Affleck is pretty good at playing Ben Affleck.",
      "review_date": "2015-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was riveted by the first 2 hours of this movie; it was intense, well-acted, and expertly filmed, and I was already planning on writing a glowing review. Then, the movie heads downhill at such speed as to suggest that the people involvedI was riveted by the first 2 hours of this movie; it was intense, well-acted, and expertly filmed, and I was already planning on writing a glowing review. Then, the movie heads downhill at such speed as to suggest that the people involved really wanted to give a good story over one that was plausible, and it shows with the insanely horrendous ending.",
      "review_date": "2015-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A tension filled, cerebral ride of a film with subtle yet effective social commentary, Gone Girl is a fine example of David Fincher at his directorial best.",
      "review_date": "2015-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is such a masterpiece, this is the kind of movie that Hollywood should have more of, Gone Girl is such an impact-ful movie, it's literally the kind of movie that makes your jaw drop, that makes you feel all sorts of feelings duringGone Girl is such a masterpiece, this is the kind of movie that Hollywood should have more of, Gone Girl is such an impact-ful movie, it's literally the kind of movie that makes your jaw drop, that makes you feel all sorts of feelings during it's amazing two and a half hours.\rAs you can probably see I enjoyed it, a lot, I enjoyed it because it is such a complex and interesting movie, during its longevity you never feel bored, you never feel like you're watching useless entertainment, this movie is able to be brutal, thrilling, dramatic, and able to provoke all sorts of other feelings on you.\rNow let's talk about the elements of the film, the acting was top-notch, amazing performances from Ben Affleck and Rosamund Pike and of course all the other actors did an amazing job, like for instance Neil Patrick Harris did a great job and even Tyler Perry feels authentic and great. The way this film is shot is amazing, every frame is filled with information and detail, the soundtrack while not the most extravagant manages to be captivating and unique, David Fincher did an amazing job, his films feel like distinct universes and different realities than ours because of the uniqueness and complexity of the situations we see in his movies, kudos for all of this.\rThe plot is amazing, it's awesomely complex and so interesting, it manages to gather so many different themes in one storyline while making it feel very natural and realistic, the brutality in this film, the violence, the pressure, these are all elements that come in to make the film feel darker and darker as we go along, and damn, it's a hell of a ride.\rThe only downside that I find in this movie is the ending, I am not saying I dislike open endings but I feel like if we got a solid ending we would be more satisfied, as the movie takes most of it's time during the second act, it leaves the third act with less time than it should have had, this time could be used to develop the ending in a more solid ways, as it feels like some parts of it were chopped of for time's sake.\rUltimately I absolutely recommend everyone to go and watch this movie, it's a true masterpiece of today's cinema and the reason why I like movies so much, because this ain't just movie, this is an experience.",
      "review_date": "2016-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lot of people would described this movie as 'too brutal'. I don't think so. I guess people just can't expect such action from other normal-looking people. If you like movies, whose development you can't guess, this one is for you. AnA lot of people would described this movie as 'too brutal'. I don't think so. I guess people just can't expect such action from other normal-looking people. If you like movies, whose development you can't guess, this one is for you. An intricate story, almost insane.. not almost, but you know. This movie shows how some people pain can become a madness, that is rooted in complete revenge. The protagonist Amy is hiding is hiding behind a mask of a successful, intelligent and independent woman, who has many hobbies, can handle with everything and is also happy. In fact, that's what her parents want her to be and how they actually see her. She found a guy, that change her life and make her really happy, but then he turn out to be a **** selfish person, who start ignoring her  and act like she is nothing. Sooo the revenge comes and it's so satisfying.    .Outstanding acting, fascinating story with unbelievable plot twist. Must watch for thriller fans out there!",
      "review_date": "2018-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very disappointing after all the hype. Actually quite disappointing w/o any hype. This is an '80s cable movie with high production values. To walk through it... terrible dialogue ... both main characters are unsympathetic.. plot is the bestVery disappointing after all the hype. Actually quite disappointing w/o any hype. This is an '80s cable movie with high production values. To walk through it... terrible dialogue ... both main characters are unsympathetic.. plot is the best thing, and it's rediculous... bored / revolted first third... chortles second third..more chortles and, when will this wrap up please?\rReally not good",
      "review_date": "2016-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved it up until the twist reveal in the middle of the film and then it all went down hill from there. It just became another boring, over talkative drama that you couldn't wait to end. Definitely should have cut back on the run time andI loved it up until the twist reveal in the middle of the film and then it all went down hill from there. It just became another boring, over talkative drama that you couldn't wait to end. Definitely should have cut back on the run time and made it more bare-able to sit through. And the ending was pretty eh and not worth sitting through 2 and a half hours for.",
      "review_date": "2017-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After a second watch i decided to give it a review. I was really close for a 9/10, but the ending was a bit unfinished (in my opinion). Overall i recommend it to pretty much everyone!",
      "review_date": "2018-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe moral of this movie: Don't get married. No wonder Neil Patrick Harris turned gay! Should have known it would wind up reeking of family values when I eventually found out Tyler Perry was in it.",
      "review_date": "2015-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely LOVED this movie! Amazing cast (Ben Affleck is the only one that didn't convince me like the others did - I usually prefer him as a director more than I do as an actor). Amy Dunne is my hero, for real! The story got me on theI absolutely LOVED this movie! Amazing cast (Ben Affleck is the only one that didn't convince me like the others did - I usually prefer him as a director more than I do as an actor). Amy Dunne is my hero, for real! The story got me on the edge of my seat the whole time! Amazing, truly.",
      "review_date": "2016-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is a modern day classic in the thriller genre. It's honestly a movie that will somehow keep you on the edge of your seat for it's impressive three hour runtime. In my opinion, this is David Fincher's best work as a director. EveryGone Girl is a modern day classic in the thriller genre. It's honestly a movie that will somehow keep you on the edge of your seat for it's impressive three hour runtime. In my opinion, this is David Fincher's best work as a director. Every shot is immaculate. The soundtrack is tense. Every performance is too real. The story, written by Gillian Flynn (the author of the novel this movie is based on) is filled with twists and turns, and will have you guessing and leave you shocked with every development until the very end. The ending of this movie is so satisfying and shocking, and I won't spoil anything about it!Gone Girl is a very cleverly done meta of a film. At it's core, this is a movie about secrets, manipulation, lies, and ultimately a conflict between men, women, and how relationships are perceived by society vs. how relationships actually are. The performances by Ben Affleck and Rosamund Pike are jaw dropping. Easily their best work. Carrie Coon is incredible as always, and even Tyler Perry busts out some great acting chops.This is a must-see movie. If you like mysteries or thrillers or good acting or a good script, you need to see this movie!",
      "review_date": "2018-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most overrated movies of all time. David Fincher's direction almost saves the film, but an average script, and a terrible, slap in the face ending ruined it for me. It's a slow start but I would give the first 1 45 to 2 an 8. TheOne of the most overrated movies of all time. David Fincher's direction almost saves the film, but an average script, and a terrible, slap in the face ending ruined it for me. It's a slow start but I would give the first 1 45 to 2 an 8. The end destroyed the whole movie however and made me actually quite angry.",
      "review_date": "2017-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Metacritic has been so consistently spot on with their cumulative review scores that it has become my go to stop before putting on a movie or heading to the theater.  I didn't actually check the Gone Girl score before watching it but decidedMetacritic has been so consistently spot on with their cumulative review scores that it has become my go to stop before putting on a movie or heading to the theater.  I didn't actually check the Gone Girl score before watching it but decided to come back and check here after the fact.  The shock of finding it had received universal acclaim is far more surprising than any twists found in this awful movie.  Even suspending disbelief to enjoy some of the wildly implausible aspects of the plot (and there are MANY to choose from), there are ridiculous 180-degree character shifts that occur with nearly no explanation, development or understanding in order to propel this train wreck into the station.  Ben Affleck is cast perfectly as the unfaithful husband as it usually doesn't take more than a single frame to make Ben Affleck unlikable (I kid!) but he's hardly to blame here.  The screenplay is loaded with cringe worthy clunkers that do nothing to help this long winded story get anywhere fast.  It will be interesting to see how time remembers this one and if it will age well.  Girl, next time just stay gone.",
      "review_date": "2018-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my friends shows this movie to all of the girls he is dating on the first date. He says if they cannot handle the intensity of this film, then he will not bother pursuing a relationship further. While my love for Gone Girl may not beOne of my friends shows this movie to all of the girls he is dating on the first date. He says if they cannot handle the intensity of this film, then he will not bother pursuing a relationship further. While my love for Gone Girl may not be that intense, I can easily say that this is one of the best movies that has come out in the last 10 years.",
      "review_date": "2018-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I went into this movie with high expectations. That was a bad idea. Don't get me wrong, the performances and technical aspects are incredible. Gone Girl suffers from a terrible screenplay, but a lot of it is blurred by the phenomenalI went into this movie with high expectations. That was a bad idea. Don't get me wrong, the performances and technical aspects are incredible. Gone Girl suffers from a terrible screenplay, but a lot of it is blurred by the phenomenal direction. Even with a master at the wheel, though, Gone Girl just doesn't stand for anything relevant, important, or even worth watching.",
      "review_date": "2020-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a crime mystery drama.\r But it is more than that. It is an attempt to look at problems that many married couples have: financial problems, loss of work, infidelity, unhappiness.\r\n\r\nAs a drama it does not really cut it but as aThis is a crime mystery drama.\r But it is more than that. It is an attempt to look at problems that many married couples have: financial problems, loss of work, infidelity, unhappiness.\r As a drama it does not really cut it but as a mystery the movie gets more interesting as it goes on. First, we see a line of events though HIS eyes. Then we see HER version of the same events. They are so dramatically different as two sides of the same coin.\r I was not very happy with the lead performances.\rOn the other hand, supporting cast was excellent, and so was cinematography. A healthy doze of satire definitely makes watching the movie more enjoyable.\r Overall for the entertaining value and the style I give it 7 out of 10.",
      "review_date": "2014-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A mostly meandering movie that never reaches a satisfying moment to take the film to another level. Moments of intensity are neutralized by long drawn out scenes. Acting and writing were solid but as a film, just above average.",
      "review_date": "2014-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Don't get the adulation and acclaim - what am I missing? The plot is dumb, the attempted dark humour doesn't work, and Ben Affleck acts like a dope throughout. This film has two part - the first 15 minutes - 7/10, the rest 0/10, and anDon't get the adulation and acclaim - what am I missing? The plot is dumb, the attempted dark humour doesn't work, and Ben Affleck acts like a dope throughout. This film has two part - the first 15 minutes - 7/10, the rest 0/10, and an insult.\r The film loses ALL credibility shortly after the start, and ends in the most stupid way imaginable. For those who gleefully say, 'It's a dark comedy. Didn't you get that?' Eh, well I laughed alright...",
      "review_date": "2015-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie started out well and was entertaining and a solid 80, but the 2nd half was a disappointment and the story line started to lose credibility and dropped to a 50.  A shorter movie with one story line would have been better.  Overall IThe movie started out well and was entertaining and a solid 80, but the 2nd half was a disappointment and the story line started to lose credibility and dropped to a 50.  A shorter movie with one story line would have been better.  Overall I would give the movie a 65.  I enjoyed it but was somewhat disappointed.",
      "review_date": "2014-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is about as average as I would have thought it would be, but with all the hype around it my expectations were high.  Some of it was pulled off well, most of it wasn't.  This is typical mass-audience garbage, and certainly not aThis movie is about as average as I would have thought it would be, but with all the hype around it my expectations were high.  Some of it was pulled off well, most of it wasn't.  This is typical mass-audience garbage, and certainly not a must-see movie (but would make an okay rental).  Cool idea for a plot, but mediocre execution at best.",
      "review_date": "2014-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the stupidist movies I have ever seen besides \"Dumb and Dumber\"! I should have known as the book was ridiculous as well {thought I would give the movie the benefit of the doubt}, and if that is what people consider good literature, noOne of the stupidist movies I have ever seen besides \"Dumb and Dumber\"! I should have known as the book was ridiculous as well {thought I would give the movie the benefit of the doubt}, and if that is what people consider good literature, no wonder the nation is going down the tubes! People were actually laughing at the absurdity of it!!",
      "review_date": "2014-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entertaining enough, fun to see NPH in this role...I'm not a fan of Affleck so can't get excited about his performance and he's one of the main characters. The movie went on a little long for my tastes, could have wrapped at least 15-20 mins.Entertaining enough, fun to see NPH in this role...I'm not a fan of Affleck so can't get excited about his performance and he's one of the main characters. The movie went on a little long for my tastes, could have wrapped at least 15-20 mins. earlier. Good, not a masterpiece and if you miss at the cinema its a good get for Netflix this winter.",
      "review_date": "2014-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good for awhile, though the answer to the 'mystery' disappearance is pretty obvious, but about 3/4 of the way through, the story takes a very very unrealistic turn.  Worth watching, but expect to say \"What the ...?\" a few times throughout.",
      "review_date": "2015-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well that was awkward. This thing just keeps getting weirder and weirder until the ending when you feel this strange feeling of ludicrousness flowing through your veins.",
      "review_date": "2014-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worst movie I've seen all year. Waiting, waiting, waiting for the twist and then BOOM! ...nothing but a predictable plot. There was an attempt to wake me from my daze of boredom with an unnecessary gore scene towards the end. Movie could haveWorst movie I've seen all year. Waiting, waiting, waiting for the twist and then BOOM! ...nothing but a predictable plot. There was an attempt to wake me from my daze of boredom with an unnecessary gore scene towards the end. Movie could have easily been 45 mins shorter in length. The one star is for Afflecks lawyer in the movie, great character.",
      "review_date": "2014-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On the plus side this movie reveals how easily public opinion is manipulated. There is much that is clever. However, there is sexual dialogue (Ben talking about her incredible amazing vagina to friends) and some brief scenes that are notOn the plus side this movie reveals how easily public opinion is manipulated. There is much that is clever. However, there is sexual dialogue (Ben talking about her incredible amazing vagina to friends) and some brief scenes that are not necessary to the plot (for example, oral sex)... Yes my husband tells our friends about my vagina all the time -haha. This is the kind of stuff Hollywood thinks it has to have to be cutting edge and \"intelligent\". Anyway, the movie feeds you information that keeps altering your perception of the truth-sand something somewhat interesting. Tyler Perry did a great job and so did the other actors. But I just couldn't get past Doogie Houser as the wacko who gets wacked. He is talented but they should have cast a new face. It might as well have been Nicholas Cage.  Something like this for me is not entertainment. Poor Jennifer Garner in Alexander's Horrible Day--I cant help but wonder what Ben and Jen talk about at dinner! Genre shenre, who cares. The people leaving the theatre I was in looked disappointed and deflated.",
      "review_date": "2014-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I cannot believe the number of positive user reviews here. were people not watching? do they have no standards? the critics gave the movie a  a high score, however, if you look at the credible reviewers, like the  other reviews\ryou'll see aI cannot believe the number of positive user reviews here. were people not watching? do they have no standards? the critics gave the movie a  a high score, however, if you look at the credible reviewers, like the  other reviews\ryou'll see a rating of 60 - which is mediocre at best. This movie, should be  tmc movie on Tv\r- the twists and turns - like a tv movie\r …  149 Mins total Wasted by the ending do not watch this film you will be very dissapointed",
      "review_date": "2015-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are movies that make you ponder marriage/relationships -- yours and other people's. This isn't one of them. Nick and Amy are (one hopes!) nothing like you and your significant other. Their twisty story is darkly funny and provocative,There are movies that make you ponder marriage/relationships -- yours and other people's. This isn't one of them. Nick and Amy are (one hopes!) nothing like you and your significant other. Their twisty story is darkly funny and provocative, although I think I might have enjoyed it more had I not read the novel. (Same plot problems, in my opinion.) Ben Affleck -- whose acting was the worst thing in \"Argo\" -- is the best thing here, perfectly cast. Rosemund Pike is a weak link, seeming like an American Doll whose descriptive theme is \"sociopath.\" Trent Reznor's score is not so much a soundtrack as just sound effects.",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the last 45 minutes are so preposterous that it wipes out the memory of the great performances and stylish production that come before. It becomes laughably silly, so that the film morphs from a semi-gripping  who dunnit drama into a bit of a joke.",
      "review_date": "2014-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I refuse to join the chorus of applause for this film. Gone Girl is predictably Fincher-ish--visually stylish and slick but cold and soulless. I find both lead performances entirely vacant and robotic, with Rosamund Pike's Amy Dunne borderingI refuse to join the chorus of applause for this film. Gone Girl is predictably Fincher-ish--visually stylish and slick but cold and soulless. I find both lead performances entirely vacant and robotic, with Rosamund Pike's Amy Dunne bordering on having been inspired by Haley Joel Osment in A.I. While the supporting cast steals the show (Lisa Banes, Lola Kirke and Neil Patrick Harris are highlights for me), Carrie Coon's Margo seems to have come from an entirely different film where all the actors weren't told they were making a film noir parody.\r On a positive note, there are three moments emblazoned in my memory where Cronenweth's photography is quite remarkable.",
      "review_date": "2014-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Noir has to be believable at some level, and darkness should not extend to near invisibility.  The film wears its trashiness like a caste mark--let's show the middle classes what  gore and sex is all about.  And then the film suddenly thinksNoir has to be believable at some level, and darkness should not extend to near invisibility.  The film wears its trashiness like a caste mark--let's show the middle classes what  gore and sex is all about.  And then the film suddenly thinks it's saying something about marriage, society, human nature.   Hitchcock--are you kidding?!  The master had finesse--this just has pretension and gall.",
      "review_date": "2014-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was very disappointed with this movie. It built the suspense quite well but then all of a sudden the characters began acting wildly out of character. One character who was portrayed as extremely intelligent in the beginning of the filmI was very disappointed with this movie. It built the suspense quite well but then all of a sudden the characters began acting wildly out of character. One character who was portrayed as extremely intelligent in the beginning of the film began acting as if they had suddenly had a frontal lobotomy. The other character who was portrayed as an ethical person suddenly lost all their moral sense. Perhaps something was missing in the film that was in the book, but I cannot see how the last third of the film realistically would have followed from the first, well-done (except for the very annoying music) 2/3 of the film. I was so disgusted by this turn of events that I made an account on meta critic so I could express just how disgusted I was! Don't waste your money!!!!",
      "review_date": "2014-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film started off interesting and developed well and would have got a much higher score if it wasn't for the completely illogical ending that completely unraveled a taught, well devised thriller. It seems the author got a good storyThis film started off interesting and developed well and would have got a much higher score if it wasn't for the completely illogical ending that completely unraveled a taught, well devised thriller. It seems the author got a good story started but there are so many absurdities, plot holes and nonsensical actions in the last 30 minutes that it just ruins the plot and everything that came before it.\r All the legitimate questions as to the implausibility of Amys story asked by Detective Boney were all just brushed aside, probably so they could cash in with a sequel. With a less daft ending it would have been a much better film in my opinion.",
      "review_date": "2014-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing crime-drama thriller. The film's strength is in it's ability to play with your perception of what's happening and what has happened. Particularly with it's main character. A brilliant and huge twist that changes everything makesAn amazing crime-drama thriller. The film's strength is in it's ability to play with your perception of what's happening and what has happened. Particularly with it's main character. A brilliant and huge twist that changes everything makes this a very different movie when it happens.\r The longer it progresses the more tense and involving it becomes. It's not afraid to get dark. The way it presents every aspect is amazing. The way the general public reacts to new information shows how easily people's perceptions are twisted when they really have no idea what's going on, but truly want to. Dialog flows meticulously and is believable. The cast is fantastic and they play characters who feel like real people. Real, twisted people.\r It's a masterfully written thriller. One that perhaps does go excessive with it's mature content at times, but this is a mature story so it's to be expected. This is one for an adult audience who enjoys slower, more detailed focused movies. If you're looking for a thriller with a lot of action the look elsewhere. This one is grounded in realism and manipulation as opposed to bullets and punches.\r I give \"Gone Girl\" a 9.8/10.",
      "review_date": "2015-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Lifeetime movie of the week material brought up slighty by fincher's steady direction.  One scene of course stands out but the movie has whole didnt feel that thrilling or that engaging.  It has some good moments but I wont be revisiting this one.",
      "review_date": "2014-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a very, very good movie.  Fincher is a master of style, and he knows how to make almost any material absorbing, and sometimes even electrifying.  The cinematography, acting, music, and plot are all first rate.  I felt like I wasThis was a very, very good movie.  Fincher is a master of style, and he knows how to make almost any material absorbing, and sometimes even electrifying.  The cinematography, acting, music, and plot are all first rate.  I felt like I was viewing something destined to become some sort of classic.  That being said, I didn't find it flawless.  Something about it felt somewhat artificial, there were some pretty dirty scenes, and the ending greatly disappointed me.  It's still probably one of the best thrillers of the past couple of years though, and that definitely counts as high recommendation coming from me.  Oscar season has officially begun.",
      "review_date": "2014-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nPredictable to say the least. I have to admit, I never thought Afflack's character killed his wife. I asked my wife (who read the book) and she said that in the book they did a lot better at making you believe it was him. That may be part of the reason for my dislike.\rOverall the movie was mediocre. The acting was ok, and for the most part the story was good. Not great, but good, could have been a lot better.\rThe big beef I had with this movie, was the terrible ending... I mean commmme on! Like anyone would actually just stay with her, give me a f'in break! Made this psychological thriller turn lame in my eyes.\r Wish I would have waited until DVD, not worth the money at the theatre.",
      "review_date": "2014-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movie started as a decent mystery expanded to good thriller and ended as a horrible American mind numbing garbage. Main cast was good but why in the world would you cast Barney Stinson for a serious role? He must have VERY good agent, giveMovie started as a decent mystery expanded to good thriller and ended as a horrible American mind numbing garbage. Main cast was good but why in the world would you cast Barney Stinson for a serious role? He must have VERY good agent, give that man a raise.\r At the end movie is trying to convince you how Nicks situation is inescapable when in truth there are so god damn many inconsistencies in her story and so many evidences that are contradicting her. I mean what are the odds that two ex boyfriends raped you in exactly the same way.",
      "review_date": "2014-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With David Fincher's assured direction complementing magnificent performances (especially Rosamund Pike's star turning performance as complex Amy), Gone Girl is a fascinating portrayal of a relationship gone wrong through a suspensefulWith David Fincher's assured direction complementing magnificent performances (especially Rosamund Pike's star turning performance as complex Amy), Gone Girl is a fascinating portrayal of a relationship gone wrong through a suspenseful mystery thriller and a perfect companion piece to its Gillian Flynn penned novel of the same name.",
      "review_date": "2015-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What is the heck was that ending? The movie goes on so long, it could have had 2 separate movies but add a little more details in different situations and they could have been good. Half way through would have been good given the set up ofWhat is the heck was that ending? The movie goes on so long, it could have had 2 separate movies but add a little more details in different situations and they could have been good. Half way through would have been good given the set up of the movie, but then it kept going.......and going.....with no real pay off for why it kept going. And they completely wasted the Barney Stinson/Controlling Boyfriend character. Like, gimme a break. It starts off really good but the last half ruins it",
      "review_date": "2014-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hereby support a constitutional amendment prohibiting ANYONE from comparing any film to \"Hitchcock\" unless Hitchcock directed it.  The dialogue is so pretentious, the line deliveries so forced, the plot elements so preposterous that it'sI hereby support a constitutional amendment prohibiting ANYONE from comparing any film to \"Hitchcock\" unless Hitchcock directed it.  The dialogue is so pretentious, the line deliveries so forced, the plot elements so preposterous that it's like watching a bad acting class.  There's no one in the film remotely interesting.  I picked up the novel just to see if they had done the author an injustice, and was astonished that people rave about the book.  Ugh:  this is  what movies have become?  And this is great fiction?  Pretentious, preposterous, and with a Lifetime Achievement Award for Bad Endings in a thriller, both book and film division.  Gillian Flynn is not Dashiell Hammett, she's Patricia Cornwell light, and the film is a lot more Brian DiPalma than it ever will be Hitchcock.  At least it reinforces the notion that Ben Affleck is a far better director than actor.",
      "review_date": "2014-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe misanthropic ingredients in the \"Gone Girl\" blender result in an unappetizing drink smacking bitter.\r \"Gone Girl\" is what stoners call a 'Goof,' i.e. a stupid joke played on those high to have a laugh at their expense. A step further; \"Gone Girl\" is self-reflexive and abets itself. The script for the film is part of the story of the film which is a soapy, broad slice of rancid Americana.\r Simply, if Affleck/Pike were to snuggle and watch a film within \"Gone Girl\" it would be \"Gone Girl.\"\r \"Gone Girl\" is a social/media satire, and could have been one of the best ever except it both takes itself too seriously and relentlessly rubs the audience's nose in ugliness and extreme cynicism.\r The filmmaker's tongues are also too far in the cheek. There are dumb as posts Ozark Dwellers/Thieves. A caricature 'Bad Girl' who gets away with murder. The insensitive, cheating dumbbell hubby. The beyond-catty Nancy Grace stand-in Missi Pyle. Even the choice of openly gay in non-cinema life Neil Patrick Harris as an obsessed former suitor underscores the satire. Like what you see? According to the filmmakers they're you.\r Those who rant and rail about the lapses in logic, nuances of plot, and motivation miss the point. There is no point except to allow junk-media-obsessed America a cold hard look in a mirror. Stand back and inspect the story. Scene after scene, this film is so over-the-top as to be laughable. Except the joke, told by elitists, is on you.\r Though meant to be acerbic, this satire bites too deep into the hand that feeds it. \"Gone Girl\" is terribly misguided. It misses greatness through lack of restraint and balance.",
      "review_date": "2014-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Felt like it was two movies forcibly merged together to form one.  First 2/3 of the movie was deliberate, and highlighted by great acting.  The final 1/3 was a painfully meandering.",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am a big Fincher fan but this film fell apart at the pivotal plot point. The problem was that there was never any viable alternatives to the two outcomes and once one outcome was eliminated, the remaining outcome became coical andI am a big Fincher fan but this film fell apart at the pivotal plot point. The problem was that there was never any viable alternatives to the two outcomes and once one outcome was eliminated, the remaining outcome became coical and implausible. Nobody was buying that ending. There was simply no payoff to the viewer in this film.",
      "review_date": "2014-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is a difficult movie to rate because its strengths and weaknesses are tangled together. I have not read the book, and I'm reviewing the film as its own entity.\r The movie’s worth seeing, if only because of the twists, the character of Amy, and the post-movie talking points that are meant to provoke a battle of the sexes debate.\r I did enjoy Fincher branching out in a new direction, and I wouldn't say that it's the wrong direction for him as much as it was a difficult tone to hit for anyone.  The movie sets out to mix melodrama, realistic satire and absurdism. Though I love weird tones and shifting tones, to me the tones in Gone Girl don't always land well or mix well.\r Worse still, there’s inconsistent acting, and wobbly story logic.  The movie isn’t deliberately unreal enough (whether absurd or dreamlike or mythic or farcical etc) to get away with the wobbly story logic.\r I'm not sure the actors are always successful at staying in the same movie together, as mentioned by user-reviewer benutty.  And Affleck (as A-lister personality actors often do) seems to be so intent on 'playing a character with a backbone' that it's basically frigid, unflinching acting where his 'character' doesn't really change or have an interior. We're left watching Affleck bring the role to himself so entirely that he's not really doing anything. It's just flat acting that has about the same tone all the way through. (And it's not unlike the frigidity that Casey Affleck has in Gone Baby Gone, directed by Ben Affleck) I think this is partly dismissible by the character's degree of narcissism and shallowness, but not entirely.\r But… I have toyed around with the idea that Fincher and Flynn are jazzing around metafictionally here.  I’m not convinced that they are, or that they did it well if intended.  But at some point, two intelligent artists may have discussed how a man is to direct a woman’s novel/screenplay of this sort.\r IF they baked a metafiction joke into it, the setup clearly runs through Affleck’s under-emoting, under-engaged acting that undermines the story, and through the way that nearly every story logic problem serves to make Amy more amazing.  And the meta-joke, if there is one, only plays if you see the characters as puppets, more or less:  The psychopathically overengaged, self-justified modern wife who gets to always be right, and the self-centered, resentful boy-husband who takes her just barely seriously enough to subtly manipulate back and stay alive.\r Yet... I'm not sure I want to give Affleck the benefit of the doubt that his practically unchanging tone and lack of interior were all just a brilliant meta-joke.",
      "review_date": "2014-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I didn’t love this movie, but I can’t dismiss it either.  Ben Affleck stars as the husband, Nick, whose wife Amy (Rosamund Pike) has ‘disappeared’.  The general public and most of the police think she is probably dead and that he has killedI didn’t love this movie, but I can’t dismiss it either.  Ben Affleck stars as the husband, Nick, whose wife Amy (Rosamund Pike) has ‘disappeared’.  The general public and most of the police think she is probably dead and that he has killed her.  However, we (the audience) learn almost immediately that she has engineered her own disappearance.  I’m not giving anything away by telling you that.  The movie is about why she has left and resolving that situation.\rTension comes from the fact that we know Nick didn’t do it, but don’t really understand why he doesn’t seem to care all that much that his wife is missing.  Nick’s public appeal for his wife’s return lacks any emotion or sincerity and everyone notices.  Missy Pyle plays a TV commentator, who is a dead ringer for real life commentator Nancy Grace, and has a field day trying Nick’s case in the court of public opinion.  Soon everyone hates Nick.  One of his neighbors believes she has compelling evidence of Nick’s guilt and relentlessly tries to volunteer her information to the police.  Unsatisfied with their uptake, she feels compelled to confront Nick with her ‘knowledge’ in a very public setting.  Strangers emerge on the scene, like parasitic larva, seeking a vicarious thrill.  Women show up to have their selfie taken with Nick.  Hordes of people begin to patronize the quiet small town bar owned by Nick and Amy.  Still, it’s hard to feel any sympathy for them.  The more we learn about Nick and Amy the more there is to dislike about both of them.\rRecently, there have been a lot of movies about dismal and depressing dystopian societies set in the relatively near future (such as Hunger Games, Divergent, and Her).  What I found interesting about this movie is that it provides a window from which to view the dystopian elements of our present society as well as some of the more disturbing elements of our individual personas that could lead us down the path toward that sort of unpleasant future.\rThere are only three normal people in the whole movie:  Nick’s twin sister Margo (Carrie Coon), police detective Rhonda Boney (Kim Dickens) and high-profile, celebrity defense attorney Tanner Bolt (Tyler Perry).  The most depressing part of the movie comes when Margo and Boney ultimately recognize that they are completely impotent in affecting behaviors or outcomes.  Bolt seems to have come to this same conclusion sometime in the past, but sees it all a game.  The most memorable line in the movie is given by Bolt when, with a chuckle, he tells Nick that, “You two are the most f**ked up people I’ve ever met.”\rAround the two hour mark, the movie has a “Carrie” moment, where Amy returns home drenched in blood.  It was shortly at this point where I thought Gillian Flynn’s story started losing all believability (and I started losing interest) as Nick’s character undergoes a total transformation (from complete jerk to total wimp) and the public gets fooled by Amy for a second time.\rMy final conclusion:  At 2½ hours, this movie is just too darn long.",
      "review_date": "2014-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very, very bad. Starts off with a strong story, and not to mention an impeccable cast. However, I was ready to leave the cinema about 20 minutes before the end when I knew how it would end, even though I was wishing a crazy twist, but I wasVery, very bad. Starts off with a strong story, and not to mention an impeccable cast. However, I was ready to leave the cinema about 20 minutes before the end when I knew how it would end, even though I was wishing a crazy twist, but I was disappointed. Luckily I didn't read the novel before seeing the movie. If the film is direct and true to the book as everyone claims, then fortunately for me I didn't waste anymore of my time on such poor, ridiculous story telling. A shame such a fine cast made me lose much respect in their films.",
      "review_date": "2014-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fincher is not only savior of bad scripts (Seven, Benjamin Button) but he can actually make you sit through 2.5 hours of predictable and thematically shabby film without expecting a wonder. This time he failed more than succeeded in my opinion.",
      "review_date": "2015-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Starts off as in interesting thriller, some good shots, and intro to the characters,  but quickly turns into nonsense and  predictability. There are lots of back in for which makes sense for the case, but it becomes one of the worst hollywoodStarts off as in interesting thriller, some good shots, and intro to the characters,  but quickly turns into nonsense and  predictability. There are lots of back in for which makes sense for the case, but it becomes one of the worst hollywood endings I've seen in years.  I literally saw half a theater start to boooo and say are you kidding me.\r I also think that the number of positive reviews is just hacked by the film business as  I literally saw half a theater start to boooo and say are you kidding me at Sundance Kabuki. If if that audience dislikes it most audiences do to.",
      "review_date": "2014-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Here it is in a nutshell: Girl wanted to become pregnant...so someone had to die. That is essentially the underlying premise. Not to undermine Fincher's directorial gifts as his cameras have the ability to make puke covered walls look awesomeHere it is in a nutshell: Girl wanted to become pregnant...so someone had to die. That is essentially the underlying premise. Not to undermine Fincher's directorial gifts as his cameras have the ability to make puke covered walls look awesome somehow. Here we have an excellent director with a dud for a story. If you don't walk away hating both of these clowns (main characters) or pitying their self absorbed delusions than you may have more in common with them than you realize.",
      "review_date": "2014-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A solid mystery/suspense thriller, Gone Girl keeps you guess up until the very end. Even when the cards are on the table it's not easy to see where the story will take you. Fincher masterfully brings the threads of the tale to tension 15A solid mystery/suspense thriller, Gone Girl keeps you guess up until the very end. Even when the cards are on the table it's not easy to see where the story will take you. Fincher masterfully brings the threads of the tale to tension 15 minutes in and holds that tension throughout the 2 and a half hour movie, rarely letting up or giving reprieve.\r The performances of all involved are more than competent. The actors here are all more than capable of holding the suspense and adding their nuances. Nothing stand out here, no one should be getting any best actor/actress nominations, but they carry the movie well and keep outrageous characters mostly believable.\r I say mostly because some turns are a bit difficult to stomach. Some character motivations and actions seem out of place, and there are a few fairly large plot holes that aren't explained, and presumably the viewer is just supposed to assume to chalk these up the \"Well it's a movie, maybe they did this or this.\" I personally don't mind making these leaps sometimes. They make the movie less impressive, but don't completely ruin the experience, though I'm surprised they don't ruin it for more people.\r There's also little substance here worth taking away. That isn't necessarily a bad thing, though a lot of the hype seemed to dress this movie up in thinking man's clothes, holding the promise for some unmasking of life in some degree, or at least contemplation of it. However once the movie stripped to its core it was revealed to be just another suspense thriller. Certainly carefully crafted with unique and intriguing contours, and it performs its function of instilling doubt and unease throughout. But that is pretty much all that it's good for.",
      "review_date": "2014-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gillian Flynn's book 'Gone Girl' is one of the best novels that I have read in years. It has great characters, intrigue and a bold ending that would definitely not be to everyone's taste. It's a real intelligent page turner that once startedGillian Flynn's book 'Gone Girl' is one of the best novels that I have read in years. It has great characters, intrigue and a bold ending that would definitely not be to everyone's taste. It's a real intelligent page turner that once started can't be put down. The problem with 'Gone Girl' the film is that it has been so faithfully adapted, too faithfully even, by Flynn herself that there are no surprises to be had. I acknowledge that this sounds churlish when there are so many book adaptations that are bad, but the lack of surprise unfortunately dulls the movie experience. The film is well cast. The setting feels right and the score sets an appropriate tone. However, David Fincher's unfussy direction does nothing to add an extra visual dimension to the story. As a result I felt somewhat disappointed by my own reaction, even whilst rationalising the reason for it. As already stated the actors are almost perfect fits for their roles. Ben Affleck is better than I had expected and really carries the film. Rosamund Pike, although over praised, is still good and the supporting cast are pretty much spot on, with a special mention to Neil Patrick Harris. The sequences that involve him are amongst the best in the film.\rIn summation I can only say that for people who have not read the book this should be a most rewarding experience. Fans of the source material, however, might want to think a little harder about there expectations before viewing.",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Powerfully captivating and suspenseful movie of the year. The movie lead audiences to a full ride with twist and turns at every corner. Ben Affleck gave a great performance. Only flawed was Neil Patrick Harris playing his normal self Barney.",
      "review_date": "2014-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was very entertaining and intense, but is not perfect. Ben Affleck as the main character Nick made for a relate-able and sympathetic main character as you begin to feel for and suspect him as he works through the situation he hasThis movie was very entertaining and intense, but is not perfect. Ben Affleck as the main character Nick made for a relate-able and sympathetic main character as you begin to feel for and suspect him as he works through the situation he has found himself in. For me the person who stands out most in this film is Rosamund Pike for reason i can't give without spoiling everything, but you'll have to trust me when i say that she was brilliant. The story itself was well thought out, well written and well paced making the 2hr 20mins run time entertaining and enjoyable for the most part. The reason i haven't given this film a 10 is because of the ending. Again without revealing anything i can't give specifics but there are a few things that don't add up and the reaction that the policewoman gives to the out come seems to be there just so the director could get the ending he wanted. That being said i would definitely watch the movie again for the suspense and brilliant writing in this film and if you are a fan of David Fincher's other work, then this film is a must see for you.",
      "review_date": "2014-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Damn, Gone Girl really ropes you in and does not let go until the final bell tolls, which is very impressive for a film that is two and a half hours long. At really no point does it lag and while it is certainly very slow at times, it neverDamn, Gone Girl really ropes you in and does not let go until the final bell tolls, which is very impressive for a film that is two and a half hours long. At really no point does it lag and while it is certainly very slow at times, it never becomes boring and leaves you hanging on the edge of your seat for much of it. Ben Affleck and Rosamund Pike are stellar here, as are Neil Patrick Harris and (oddly) Tyler Perry. The cast, on paper, seemed odd, but in practice, David Fincher shows why he is one of the best around and got the best out of everybody. The general feel and mood of the film is also brilliant and entirely chilling. However, beyond the whole murder mystery type deal, the most interesting part to me here was the total indictment of the media and the 24 hour news cycle, which Fincher does a great job showcasing throughout and how the media will believe just about anything and then jump to conclusions based off of what small information they may have. The twists and turns here are also very interesting and the script from Gillian Flynn is very strong. The way the story was told at times was odd, but that would be my only complaint really and it was nothing major. As a whole, this is certanly not Fincher's best work (Seven, Fight Club, and Zodiac, would be my top three from him), but it is certainly not his worst (excluding Alien 3) and is overall, a very well made, well acted thriller that will leave you wanting more. Would be surprised if Affleck and Pike are not major contenders at the Oscars.",
      "review_date": "2014-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis film would score higher except for the weak and disappointing ending.  The film looks good and throws lots of red herrings to create an interesting mystery.  Along the way, you're not sure who did what, and the flashbacks suggest a particular outcome.  Up to a certain point it is mysterious if not very slow.  Then it becomes a bit clever and intricate as details emerge.  The third act at the lake house is surprising, compelling and confronting.  But the final sequence reeks.  There are so many loose ends which would deliver justice but none are explored or even acknowledged.  For a film with good potential and even better word of mouth, this is ultimately a disappointment.",
      "review_date": "2014-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "fantasic film interesting well put together fantasic story one MASSIVE LET DOWN is WTF happened to the last 30 mins of the film the film just flopped and didnt make sence everything just magiclly worked out worst ending ive seen this yearfantasic film interesting well put together fantasic story one MASSIVE LET DOWN is WTF happened to the last 30 mins of the film the film just flopped and didnt make sence everything just magiclly worked out worst ending ive seen this year apart from the good film would watch again but wouldnt buy due to ending just killed film",
      "review_date": "2014-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I only lasted 45 minutes. Things just didn't ring true. For instance, the cops first show up and there's this silly lighthearted banter going on, stupid irrelevant questions like \"How long have you lived here?\"  I tried to give it some time,I only lasted 45 minutes. Things just didn't ring true. For instance, the cops first show up and there's this silly lighthearted banter going on, stupid irrelevant questions like \"How long have you lived here?\"  I tried to give it some time, but I decided to pull the plug on this corpse. I usually read the worst reviews before I go, wish I had done so this time.",
      "review_date": "2014-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely loved this film! Kept me on the edge with constant twists throughout the story. A little disturbing in some scenes but clever storyline which keeps the audience gripped, left the cinema feeling very satisfied!",
      "review_date": "2014-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is a realistic, dark and visceral story, although is hard to describe with words the nature of the plot created by Gillian Flynn. First of all, the characters and their relationships are very well developed, establishing the moralGone Girl is a realistic, dark and visceral story, although is hard to describe with words the nature of the plot created by Gillian Flynn. First of all, the characters and their relationships are very well developed, establishing the moral of each one, representing their own stereotypes and then breaking them; second, the narration style is preserved, immersing the viewer in the game/conflict between Nick and Amy, creating a serious reflexion about how marriage changes people or how people change for their marriage; and third, the twists in the storyline that mess with your mind. David Fincher definitely was a great choice for directing this crime novel, and we see him in all its glory, such as Se7en or Fight Club. The problem is that Gone Girl is more than that, is a combination with a psychological thriller (characteristic more distinguishable in the book), and is here where Fincher fails; the torment and questioning that invades not only the protagonists, but also Go and Amy's parents, its not so clear in the film. Another huge problem is Ben Affleck, he makes Nick a static character, its impossible to empathize with him, though same parts of the movie requires it, others not. Nevertheless, Rosamund Pike is magnificent as Amy, which compensates everything.",
      "review_date": "2015-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastic dark comedy for those of us who have lived on a steady diet of reality crime and have sometimes stooped to lapping up the salacious content of crime show talk shows.  I wonder, was Nancy Grace flattered or offended by the obviousA fantastic dark comedy for those of us who have lived on a steady diet of reality crime and have sometimes stooped to lapping up the salacious content of crime show talk shows.  I wonder, was Nancy Grace flattered or offended by the obvious (and brilliantly executed) spoof of her persona?",
      "review_date": "2015-06-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Played out like the book it was written off of I suppose.\rReminded me of a murder mystery/ crime book more than anything else. Also, had hints of those Dateline specials you see on TV late at night.\rIn summary, see it in theaters for moodPlayed out like the book it was written off of I suppose.\rReminded me of a murder mystery/ crime book more than anything else. Also, had hints of those Dateline specials you see on TV late at night.\rIn summary, see it in theaters for mood setting and presentation. Don't expect a date-type movie, it's more of a slow-moving thriller.",
      "review_date": "2014-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film with disturbing topics and scenes. One of the best performances by a female in a leading role of 2014, Rosamund is a total revelation, what a juicy, dark and crazy role. Outstanding job. Ben Affleck is also very good in his roleGreat film with disturbing topics and scenes. One of the best performances by a female in a leading role of 2014, Rosamund is a total revelation, what a juicy, dark and crazy role. Outstanding job. Ben Affleck is also very good in his role and seems like he keeps growing as an actor (apart from as a director). The film is long but doesn´t feel like it. You want more. Its slightly corny tone at times is totally intended although it may not be for everybody. My biggest complain would be that the ending drags a little bit, which I was loving until the film ended, because suddenly I realized it didn´t leave me totally satisfied. But still great and a really surprising film thanks to its very misleading promotional campaign, which is always something to be thankful for.",
      "review_date": "2015-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well made, as you'd expect from David Fincher, and well played by the leads, but eventually \"Gone Girl\" never really delivers what it promises. The story feels contrived and forced for its conclusion. Overrated would be unfair, as \"Gone Girl\"Well made, as you'd expect from David Fincher, and well played by the leads, but eventually \"Gone Girl\" never really delivers what it promises. The story feels contrived and forced for its conclusion. Overrated would be unfair, as \"Gone Girl\" is worth watching minus the hype that surrounded its release.",
      "review_date": "2015-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film was absolutely great! Ben Affleck and Rosamund Pike are both captivating in their roles and the story is just so well written (cheers Gillian) alonng with it's script writing being well made too for sure. David Fincher fan? ThenThis film was absolutely great! Ben Affleck and Rosamund Pike are both captivating in their roles and the story is just so well written (cheers Gillian) alonng with it's script writing being well made too for sure. David Fincher fan? Then watch this: our archetypal expectancy of a dark tone along with all it's twists and turns are righr here bundled all nicely together. The direction is nicely made but Fincher has done better, yet his signature style is not detatched from this title. I found the was split into two parts, and even hough the first half was good me sitting around about a 7/10, the second half nailed it and made it some of recent cinemas most captivating story telling. Another Fincher classic, definitelt one to buy and keep!",
      "review_date": "2015-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredible movie made from an incredible director. The movie as a whole was intense, dark, wonderfully acted (Affleck and Pike respectively) and incredibly directed.",
      "review_date": "2017-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is slow at first, and is a long film. Yet it is well directed and had me interested the whole time. They could cut the run time a little but that is my only gripe. It is sexual but it is an adult film people. If you hate sex andGone Girl is slow at first, and is a long film. Yet it is well directed and had me interested the whole time. They could cut the run time a little but that is my only gripe. It is sexual but it is an adult film people. If you hate sex and violence in movies, read the rated r rating.",
      "review_date": "2014-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfect in every way, Fincher's 'Gone Girl' is a movie that lives up to the standards of his legendary 'Se7en' and is, in that vicinity, his second best film I've seen so far. Everything about this film is absolutely stunning. The atmosphere,Perfect in every way, Fincher's 'Gone Girl' is a movie that lives up to the standards of his legendary 'Se7en' and is, in that vicinity, his second best film I've seen so far. Everything about this film is absolutely stunning. The atmosphere, combined with wonderful aesthetic details, embraces you and sucks you inside the suspense of the movie, not allowing you to leave because you might miss a crucial scene (and you just never know when those might appear). The cast is brilliant, especially Rosamund Pike, who deserved her Oscar nomination in every aspect, and Tyler Perry, who proved to be an absolute scene stealer almost every time. Fincher once again proved his class and his mastery in the thriller/crime genre and I am certainly looking forward to his next work. It is truly a dreadful decision of the Academy not to give Fincher and this movie at leas a nomination, but... well, those are the Oscars for you. In any case, a brilliant work of art that manages to elevate both Fincher's skills and the genre onto a completely new level.",
      "review_date": "2015-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Round about the two hour mark I found myself wishing that Nick would kill Amy, or she would kill him, or some good Samaritan would step up and kill both of them, just so I would be saved sitting through a further 29 minutes of this film.Round about the two hour mark I found myself wishing that Nick would kill Amy, or she would kill him, or some good Samaritan would step up and kill both of them, just so I would be saved sitting through a further 29 minutes of this film.\r Gone Girl is not without merit.  The cast does a fine job with the material, and someone obviously turned on their thinking cap while organizing the various plot points, but this isn't Hitchcock, and after about ninety minutes the film starts getting tedious.  The problem of course is that neither Nick nor Amy appear to have any redeeming characteristics.  It's more a matter of which one you dislike more.\r Ultimately, perhaps the worst crime is the refusal of the local police to further their investigation.  This is not explained and I can imagine no justification other than \"convenience of the producers\".\r I would have given this film a 6 out of 10 till I realized that a 6 would tally up as \"favorable\" when my reaction is decidedly \"mixed\".  All in all it's not a bad film, it just isn't particularly engaging.",
      "review_date": "2015-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ethereal Rosemund Pike....yells after losing all her money and it seemed sexual the way the camera \"Bounces\" for it.......on the other hand the Neil patrick Harris death was more tasteful than I thought it was going to be.....The Pure LengthEthereal Rosemund Pike....yells after losing all her money and it seemed sexual the way the camera \"Bounces\" for it.......on the other hand the Neil patrick Harris death was more tasteful than I thought it was going to be.....The Pure Length of this film makes it good....but her as a delusional girl who wanted her man begging her on tv to come back wasn't all that interesting.  I will say i was invested for it...but don't feel bad...few movies are worth of a second viewing....this one isn't.....-JRA",
      "review_date": "2015-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amy Dunne: \"This man might honestly,truly kill me\".\r The story is about Nick Dunne, as he finds out his wife has gone missing. As increasing police and media pressure mount, the facade of a loving and blissful union crumbles and amidst theAmy Dunne: \"This man might honestly,truly kill me\".\r The story is about Nick Dunne, as he finds out his wife has gone missing. As increasing police and media pressure mount, the facade of a loving and blissful union crumbles and amidst the lies and behavior of Nick, the question remains - did he kill her?\r I have to say that David Fincher is a true master class of directing, because Gone girl is one of the best films of this year. Ben Affleck was perfect for this role, because Ben Affleck through out his career had a lot of hate from the media and the critics that mostly slammed him in every role that he was in. And that's why he was outstanding in this movie. Rosamund Pike acting in this film was pure brilliant and spectacular. She was so good in this role she might get a Oscar nomination for this. Tyler Perry in this movie was actually pretty damn good, and am so surprise saying that because Mr. Perry was in such awful films like: MADEA trilogy, Alex cross and the list goes on. But in this movie he did good.\r What this movie does so brilliantly well is how we view media today, because most of the stories you hear on the news might not be true and how the media can spread lies about people and ruining they lives. Everybody always believes what the media says even if it's true or not, because we don't know what that person on the news is going through, and this movie got that message out they so perfectly.\r My only problem with this movie is Neil Patrick Harris character. Now let me just say that Neil Patrick Harris wasn't terrible in the movie, but his character to me slowed the film down for me. Overall Gone Girl is a fantastic film and it's the movie to see.",
      "review_date": "2015-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Did everyone else on this website watch a different movie than I did? Did I manage to somehow find only the first half of this clearly unfinished movie? I find that doubtful, considering the movie was almost two and a half hours long. TheDid everyone else on this website watch a different movie than I did? Did I manage to somehow find only the first half of this clearly unfinished movie? I find that doubtful, considering the movie was almost two and a half hours long. The first half of the movie was extremely exciting, because I was anxiously waiting for a series of interesting events to occur. However, with each minute that passed, I began to realize that there is no climax to this story, no conclusion, and no elements to relieve the tension in the buildup of the storyline. Watching this movie to completion is very similar to getting \"blue balls,\" for those of you who have experienced that scenario. You sit there, waiting, anticipating the epic plot twist that brings the story to its clever, dramatic conclusion. But instead, the movie just sort of... ends. All the unanswered questions remain unanswered. Additionally, new questions arise, such as \"Did the person who wrote this movie's storyline die halfway through writing?\" and \"How did over 800 people on this website get brainwashed into thinking this movie was complete?\" If you have not seen this film yet, I do not recommend it. You are better off watching just about anything else. There are movies you could find that are just as disappointing and waste less of your time.",
      "review_date": "2015-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is definitely one of the best movies of 2014.It keeps you engaged on the story until the very end with crazy twists and awesome acting especially by Rosamund Pike.This movie should have absolutely got nominated for Best pictureGone Girl is definitely one of the best movies of 2014.It keeps you engaged on the story until the very end with crazy twists and awesome acting especially by Rosamund Pike.This movie should have absolutely got nominated for Best picture because it deserves it.",
      "review_date": "2015-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i am astounded by the number of positive user reviews here. were people not watching? do they have no standards? the critics gave the movie a 79, however, if you look at the credible reviewers, like the NY Times,\ryou'll see a rating of 60 -i am astounded by the number of positive user reviews here. were people not watching? do they have no standards? the critics gave the movie a 79, however, if you look at the credible reviewers, like the NY Times,\ryou'll see a rating of 60 - which is mediocre at best. This movie, played out like a cheap movie on Court Tv\ror Lifetime!  I found it offensive - the twists and turns - like a bad soap opera. Puh- leez!  The big story before the movie came out was that Affleck wouldn't wear a Yankees hat in one scene -- the story now should be Affleck never even read the script.",
      "review_date": "2014-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not at all a replication of the text in style and thematic focus, but utterly in substance and content. Fincher adds to this blissfully melodramatic mystery thriller in a multitude of ways.",
      "review_date": "2014-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are some heavy hitting names on the screen, and behind the camera. But this is a plot not even worthy of a lifetime movie. The only believable character is the media savvy lawyer.\r Seriously, NPH as a love interest? A woman goneThere are some heavy hitting names on the screen, and behind the camera. But this is a plot not even worthy of a lifetime movie. The only believable character is the media savvy lawyer.\r Seriously, NPH as a love interest? A woman gone missing, who has the national spotlight, goes to a mall, and nobody notices her? Then Ben Affleck takes her back at the end?  I dont want to spoil it too much, but the things that happen that the characters overlook is laughable.\r Who does this stuff?\r It is just a ridiculous plot. The movie has about the same basis in reality as Star Wars.\r I wanted to watch this and like it. After \"The Town\" I made a point of seeing this because Ben Affleck and David Fincher. But it is just preposterous.",
      "review_date": "2014-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow this film is looney tunes and I loved every minute of it.  First what can you say about David Fincher the man is a master craftsman behind the camera with every shot in this film more gorgeous than the last.  The acting is all great hereWow this film is looney tunes and I loved every minute of it.  First what can you say about David Fincher the man is a master craftsman behind the camera with every shot in this film more gorgeous than the last.  The acting is all great here but the standout by far is Rosamund Pike who gives an Academy Award winning performance.  As funny as it is thrilling Gone Girl deserves to be in the conversation with Fincher's best.  A+",
      "review_date": "2014-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The worst movie of the year so far.Pure embarrassment to watch-from ridiculous story,unreal and totally unlikable characters to awful acting,nothing works here (although actress who played police woman did a fine job).This movie treats it'sThe worst movie of the year so far.Pure embarrassment to watch-from ridiculous story,unreal and totally unlikable characters to awful acting,nothing works here (although actress who played police woman did a fine job).This movie treats it's own audience like they are bunch of morons;the less I say about taking an urin from unflushed toilet (?) or being realised from hospital completely covered in blood-the better.I never thought about David Fincher as a really significant director,even his best movies like Seven or Fight Club was kind of lifeless full of posing and detached from real substance but this is bottom of the barrel for him.Why so many people praised this movie is beyond me-american culture is obviously obsessed with psychopaths and that makes me worry:of all the things in the world that you can get obsessed with you choose absolutely the worst one.",
      "review_date": "2014-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Every once in a while, a film is able to live up to the yearlong hype that precedes its release. Gone Girl goes above and beyond. It's enthralling and epic. Rosamund Pike's performance as Amy Elliott will live on for years. I guarantee it.",
      "review_date": "2014-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film has more plot holes than any other film I have seen in a long while.  Events transpire that are seemingly quite unlikely to happen.  The story only moves forward because the writer wills it forward.  Ben Affleck gave an uninspiringThis film has more plot holes than any other film I have seen in a long while.  Events transpire that are seemingly quite unlikely to happen.  The story only moves forward because the writer wills it forward.  Ben Affleck gave an uninspiring performance...he was not acting...he was just being Ben Affleck.  Neil Patrick Harris was badly miscast (due to his decision to publicize his lifestyle) as a heterosexual stalker.  The film could have edited out about 30-45 minutes of its 2 1/2 hours running time...there were many, many scenes that were unnecessary that did nothing to advance he story.",
      "review_date": "2014-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Minus the, shall we say, rather revealing sex scenes, this is the kind of movie my parents used to complain that Hollywood doesn't make anymore.  You know, films with a great storyline and topnotch performances.  Well, guess what.  HollywoodMinus the, shall we say, rather revealing sex scenes, this is the kind of movie my parents used to complain that Hollywood doesn't make anymore.  You know, films with a great storyline and topnotch performances.  Well, guess what.  Hollywood did make it, and it's terrific.  Even though I read the book and basically knew what was coming, I was still caught up in the suspense of it.  Needless to say, I recommend \"Gone Girl\" to anyone who appreciates a great night at the movies.",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most over-rated film of 2014 and also one of the worst.  The movie was boring and actually made me fall asleep on the first attempt, and on night #2 I finished it despite it being completely boring and nonsensical to find an ending evenThe most over-rated film of 2014 and also one of the worst.  The movie was boring and actually made me fall asleep on the first attempt, and on night #2 I finished it despite it being completely boring and nonsensical to find an ending even dumber then the movie itself.\r As someone who has studied psychology, none of the character acted realistically, whether they were psychopaths or not.  That is not how those people behave.  And even if you want to call it a satire, well it showed me nothing new as I already know the  media influences the  mob mentality in various ways which is something I knew about 10 years ago.  If you needed to see Gone Girl to figure that our you are about as smart as the moron mob depicted in the film.  This film showed me nothing new, was not entertaining, was not funny, and wasn't even a good plot since it was so convoluted and predictable, and mostly laughably stupid.\r This films popularity is a showcase of the stupidity of the American population and shows them to be just as dumb as the mob depicted in the film.\r Terribly dumb, boring, and the most over-rated film of 2014.  3/10.",
      "review_date": "2015-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movie Review: Gone Girl\rDirected by: David Fincher (The Social Network, The Girl with the Dragon Tattoo, Fight Club)\rStarring: Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry\r\n\r\nBy Justin Madore\r\n\r\nOne of the most prominent andMovie Review: Gone Girl\rDirected by: David Fincher (The Social Network, The Girl with the Dragon Tattoo, Fight Club)\rStarring: Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry\r By Justin Madore\r One of the most prominent and distinguished directors in Hollywood, David Fincher, returns to theaters this October to kick off awards season with Gone Girl, the slick, darkly humorous, murder mystery based off the bestselling book of the same name.  Fincher brings his A game, with impeccable casting, his signature cinematography, and a deliciously disturbing tale of revenge, anger, laziness, narcissism, betrayal, and manipulation.  The screenplay (written by the books author, Gillian Flynn) examines the hardships of marriage and sensationalism of the media in ways that, while not groundbreaking, ultimately are constructed incredibly well by a fantastic cast of interesting and relatable characters.\rGone Girl Trailer\r Tragedy and misery has never before been so enjoyable.  Continuing his hot-streak, Ben Affleck stars as Nick Dunne, whose wife (Rosamund Pike) mysteriously disappears on their fifth wedding anniversary.  His sense of detachment in an increasingly perilous situation  finds its way through the screen and manifests itself in the viewer, to the point where I oddly felt calm and detached myself.  The character of Nick Dunne is that persuasive.  His performance as a well off, self loathing, arrogant writer fits the bill perfectly.  Opposite him, Rosamund Pike, the standout of the film, comes off as the cool, calculated, meticulous, and narcissistic wife.  Her role had much more complexity that I believed there was based on marketing materials.  The rest of the casting, while on paper may seem questionable (Tyler Perry seems like he’s trying to change his image at the moment), is perfect, and full of surprises.\rFrom the opening shots, viewers will immediately recognize the style of director David Fincher.  A shadowy dark blue tint encapsulates the screen, and wide shots of Dunne’s Missouri hometown are shown, interspersed with the credits.  At this point, Fincher has become known for his intricate title sequences.  His body of work reveals that he loves to revel in dark, tension filled murder mysteries (Zodiac, Seven, Girl with the Dragon Tattoo).  While not his best film (that honor belongs to the incredible Social Network) overall, it is his best crime thriller, of which there are an abundance to choose from.  While not quite as dark and twisted as his 2011 adaptation of Stieg Larsson’s über popular series, that is most definitely for the better.  One of the best surprises of the film, is how often humor is interlaced in this decidedly bleak looking tale.\rProlific composer and frequent collaborator Trent Reznor graces his audience with another fantastic soundtrack, following his work in The Girl with the Dragon Tattoo and The Social Network.  The long, strung out cords creates an ruthlessly eerie mood, which helps perfect the tone and presentation of the film.  The score is never too and is used sparingly to great effect.\rDF-01826cc - Nick Dunne (Ben Affleck) finds himself the chief suspect behind the shocking disappearance of his wife Amy (Rosamund Pike), on their fifth anniversary.\rThroughout most of the film, Nick Dunne is ruthlessly hounded by the media.  He becomes a prime suspect in the disappearance of his wife, and for palpable reasons easy enough to understand for audience members.  “Nick Dunne, you’re probably the most hated man in America right now” says the Nancy Grace character that Dunne agrees to be interviewed by to help clear his name.  And he is the most hated man in America, not because he had been proven guilty, but because of the sensationalism present whenever a case like this happens.  This point isn’t fiction, and it’s one of the valid, and strong points driven home by the script.  People love to hate.  I was reminded of one of the more famous trials in recent memory. Zimmerman v State of Florida.  News coverage was vastly misleading, from editing of evidence, to misrepresentation of the subjects, to allegations of the shooting being a hate crime.  It’s a strange phenomenon, but when you can make someone look really bad, people gobble it up.  Although Zimmerman was ultimately acquitted of his second degree murder charge, I’m not advocating that either him or Trayvon Martin were certain types of people, and that’s the point.  Both Nick and Amy Dunne are deeply flawed individuals, with their own sets of problems that they deal with away from the spotlight.  While the ending is not maybe as ambiguous as one might hope, no one gets away scot free.  There is a definitive villain revealed before the credits role.\rGone Girl impresses on every front.  The presentation of the film is flawless.  The score, cinematography, performances, create a sleek, atmospheric mood that suits the film fine.  While I haven’t read the book, and therefore can’t speak for the quality of the adaption, what you find here is a fully fleshed out story, and I never once felt like anything was missing.  The two and a half hour running time disappeared before my eyes.  There are a astounding amount of onscreen clues for the attentive viewer, grabbing your attention, and fixing your eye on the screen.  The ridiculousness of the plot at certain points, covered in layers of satire, are utterly intoxicating.  This is a film for the engaged movie goer.  About 40 minutes in, when the first twist presents itself, the hooks sink in, and they never come loose.  Do yourself a favor and go see this one.\r 5 out of 5 Stars",
      "review_date": "2014-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boring..... The word excruciating comes to mind.....it seemed like it would never end!  Rosamund Pike was brilliant as Amy, but that was not enough for me.  It did pick up towards the end ,but by then I was ready to go.",
      "review_date": "2014-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "i loved this film there was a few plot holes but if you can get around that (and it is easy to get around) it is a movie that will keep you guessing and you really will not know where it will end up\r Rosamund Pike should really be put upi loved this film there was a few plot holes but if you can get around that (and it is easy to get around) it is a movie that will keep you guessing and you really will not know where it will end up\r Rosamund Pike should really be put up for best actress at the oscar and i'm looking forward to Ben Affleck playing Batman on the back of this film and Argo",
      "review_date": "2014-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great interpretation of the Gillian Flynn novel, David Fincher puts together Gone Girl perfectly, except for the ending. Ben Affleck and Rosamund Pike steal the show in this dark and twisted murder mystery!",
      "review_date": "2014-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a mouthwatering and disturbing experience. Not aware of the underlying story going into the film- the dense thematic nature of this picture rewarded me quite succinctly. Affleck holds his own and the extraordinary Pike stands out asThis is a mouthwatering and disturbing experience. Not aware of the underlying story going into the film- the dense thematic nature of this picture rewarded me quite succinctly. Affleck holds his own and the extraordinary Pike stands out as one of the year's most persuasive, haunting, provocative, and masterful performances. The characters perpetually evolve and morph before our eyes and perceptions (which, ultimately, becomes the prevailing theme the film succeeds to get at with a particular eye towards the \"shock value\" ideology of a 21st century electronic media). The premises of overwrought suspenseful machinery coupled with perspective flashbacks and, above all, a sardonic sense of humility within very clever and with great wit and verve human dialogue. Notwithstanding a few plot holes near the end- the film stands out in its gorgeous (Hitchcock gothic) cinematography, adroit acting, and compendious execution of deep subject matter (namely, marital and communal knowledge; the epistemology of identity of the self and the other; irrationality and truth).",
      "review_date": "2014-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gone Girl is a dark masterpiece from David Fincher, building suspense and tension for it's whole (ass-hurting) 150 minute runtime. It stays brilliantly true to the novel it was based on, even surpassing it in some areas. Go and see it!",
      "review_date": "2014-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seriously, I think the critics fell asleep during this one!  It played like a soap opera, or bad Lifetime movie of the week. Ridiculous twists and turns and an ending that stupefies.  On the positive side, it was entertaining, as soap operasSeriously, I think the critics fell asleep during this one!  It played like a soap opera, or bad Lifetime movie of the week. Ridiculous twists and turns and an ending that stupefies.  On the positive side, it was entertaining, as soap operas can sometimes be... but that's what it was. I wouldn't deign to call it a film.",
      "review_date": "2014-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No spoilers here, only a warning..., stay away! This movie employs so many plot manipulations that border on the absurd only to be followed by the moronic. The actors are forced into playing characters ranging from imbeciles to embarrassinglyNo spoilers here, only a warning..., stay away! This movie employs so many plot manipulations that border on the absurd only to be followed by the moronic. The actors are forced into playing characters ranging from imbeciles to embarrassingly stupid. It's amazing and sadly disappointing to be living in a world where the majority of movie goers likes this kind of movie. Think of Body Heat, take away the terrific plot, writing, acting and directing..., mix in a bit of Scary Movie (one or two, either way will do), and there you have it - a ridiculous movie pretending to be serious. Laughable if it wasn't so bad. I guess you can tell, I didn't like this movie.",
      "review_date": "2014-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If I could give Gone Girl an 8.5, I would. Gone Girl proved to be worth my money and time over my weekend. There are a lot of good things about the movie, but the main thing that kept me engaged throughout the entire film was the plot. TheIf I could give Gone Girl an 8.5, I would. Gone Girl proved to be worth my money and time over my weekend. There are a lot of good things about the movie, but the main thing that kept me engaged throughout the entire film was the plot. The sinister plot and multiple twists actually got me to say \"Oh s**t\" at several moments during the film, but the plot did have a couple of holes, but none of them were detrimental to the film. I wanted the kidnapping/revenge mystery to keep going on. In addition, the characters were performed very well by all. No actor/actress played their role badly and the development of these characters makes you feel for them even more. Overall, this film is definitely worth seeing right now.",
      "review_date": "2014-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As Amy Dunne in “Gone Girl” Rosamund Pike joins the ranks of  Sharon Stone in “Basic Instinct” and Glenn Close in “Fatal Attraction” and to say more would give away the last hour and twenty-five minutes of the film.\r The film is mostly aAs Amy Dunne in “Gone Girl” Rosamund Pike joins the ranks of  Sharon Stone in “Basic Instinct” and Glenn Close in “Fatal Attraction” and to say more would give away the last hour and twenty-five minutes of the film.\r The film is mostly a ‘He said-She said’ narrative of a possible kidnapping and/or murder, starting with Amy and Nick Dunne (Ben Affleck) returning home, after both losing their jobs in New York City, to North Carthage, not far from St. Louis, to take care of his mother dying of cancer and his father drifting into Alzheimer’s. Amy’s parents, psychologists, (David Clennon and Lisa Banes), have become wealthy writing books about a child, Amazing Amy, who was always just a bit better than their real daughter. We see brief scenes of Amy and Nick meeting and falling in love.\r Within a few minutes we see Nick coming home to an empty home leased by the couple with money from her trust fund from the books, their cat outside, a table upended, the glass top smashed and Amy missing. It isn’t long before evidence points toward Nick as the murderer of his golden wife Amy, his being pursued by detectives Rhonda Boney (Kim Dickens) and Jim Gilpin (Patrick Fuhgit), his twin sister Margo, (Carrie Coon) supporting him 100% while a sensation seeking TV cable reporter/host, played by Missy Pyle, slowly turns the public against Nick. Eventually Margo makes Nick hire news making lawyer, Tanner Bolt, (Tyler Perry). Along the way we meet Desi Collings (Neil Patrick Harris), Amy’s boyfriend, so he thinks, in high school, Carrie Wilson as Noelle Hawthorne, a neighbor of Nick and Amy’s, Emily Ratajkowski as Andie Hardy, a student in the one college class Nick teaches, plus Boyd Holbrook and Lola Kirke, as Jeff and Greta, plus a cameo by Sela Ward as another cable TV host.\r With the exception of Neil Patrick Harris in a wasted, undefined role, and the roles of Boyd Holbrook and Lola Kirke, though acted strongly, could have been cut without taking anything away from the story except making it shorter, the acting by the cast is of the first order with Ben Affleck at his best while Rosamund  Pike is definitely going to be up for most of the acting awards.\r The screenplay by Gillian Flynn, based on her best selling novel, and the direction by David Fincher, serve the film well to hold the audiences attention as all the production values do.. They have made it one of those movies that will make people who haven’t read the book to do just that to see what, if anything, they have missed.",
      "review_date": "2014-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is vibrant, and an overall great piece of filmmaking. David Fincher proves again to be one of the best still directing today and this movie based on a novel sure does show that. With a great soundtrack, a eerie feel, and its longThis film is vibrant, and an overall great piece of filmmaking. David Fincher proves again to be one of the best still directing today and this movie based on a novel sure does show that. With a great soundtrack, a eerie feel, and its long run time, Gone Girl is one movie you must see this fall. With its great cast and plot development you can still be stunned by the storyline itself. Despite some sex scenes, the movie is very profitable on how it uses character dynamics and other features that make movies great. This is one of the best I have seen this year...\r9.5/10",
      "review_date": "2014-10-04",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 149,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller"
  ]
}