{
    "title": "The Lunchbox",
    "rating": 8.1,
    "release_date": "2014-02-28",
    "genre": [
        "Drama",
        "Romance"
    ],
    "summary": "A mistaken delivery in Mumbai's famously efficient lunchbox delivery system connects a young housewife to an old man in the dusk of his life as they build a fantasy world together through notes in the lunchbox. Gradually, this fantasy threatens to overwhelm their reality.",
    "critic_reviews": [
        "Kaur and Khan, who was robbed of a IIFA nod, scarcely share a frame of The Lunchbox, yet the emotional connection of their characters is palpable.",
        "One thing that makes Lunchbox so strong is that a touch of melancholy hangs over its sweetness. Finally this is a film about the wheel of life, about what helps us cope with its turns and find our way in its unforgiving labyrinth.",
        "The Lunchbox isn’t an example of bravura moviemaking or cutting-edge style but simply a tale told with intelligence, restraint, and respect.",
        "The Lunchbox,” Indian director Ritesh Batra’s debut, is a witty and perceptive film that reveals the hopes, sorrows and regrets of ordinary people.",
        "It’s an intimate, quiet and slow-paced romance, a simple, richly rewarding movie in the classic style of India’s greatest filmmaker, the late Satyajit Ray.",
        "A crowd-pleasing import that would leave only the most steadfast curmudgeon unmoved.",
        "The Lunchbox, the debut feature from Indian director Ritesh Batra, has such a sweet premise that I sincerely hope it doesn’t get remade with Tom Hanks and Meg Ryan.",
        "Khan in particularly is wonderful in Batra's film, which takes the time to indulge in quiet moments that Khan expertly fills with his expressive face and sense ease in front of a camera.",
        "The Lunchbox is perfectly handled and beautifully acted; a quiet storm of banked emotions.",
        "The Lunchbox is a first feature for director Ritesh Batra, but it nicely captures the almost overwhelming crush and noise of contemporary India, and it plays cleverly and delicately with the tension of whether its two correspondents might eventually meet. Theirs is one \"virtual\" romance that has nothing to do with social media.",
        "Wonderfully fresh and affecting fable from India.",
        "Going strictly by plot description, Ritesh Batra’s The Lunchbox sounds a little like an Indian knock-off of a Nicholas Sparks movie, but it plays out more like Brief Encounter.",
        "Batra adeptly plays on the tension of will they or won’t they meet, making good decisions based on character and situation rather than the need to uplift an audience.",
        "The Lunchbox offers us a naturalistic glimpse of middle-class life in modern Mumbai.",
        "The debut creation of director Ritesh Batra, it’s a lovely little film from a place where the little things linger.",
        "If co-writer and director Ritesh Batra occasionally takes his sweet time getting from point A to point B, it’s equally true that he gives the audience a nice, comfortable ride.",
        "The Lunchbox is better as an experience than as a memory. When you're watching it, you can still believe it might actually be heading somewhere.",
        "It’s neorealist corn, but it gets to you.",
        "The patience in mercurially presenting the characters' backstories and desires is matched by the film's genuine curiosity about the healing power of sharing stories.",
        "Batra's film is ultimately less about love than about the vulnerability relationships place us in emotionally, and courage required to move past pain, and experience life again after we've been hurt.",
        "The comedy is more wry than uproarious, the melodrama gently poignant rather than operatic, and the sentimentality just sweet enough to be satisfying rather than bothersome.",
        "Batra isn't ambitious with the visuals, but he creates an effective, unfussy sense of urban space, both indoor (cramped apartments, crowded buses) and outdoor (even leafy residential streets seem to be swarming with playing children).",
        "What is most endearing is the delicacy with which writer-director Ritesh Batra reveals the hopes, sorrows, regrets and fears of everyday people without any sign of condescension or narrative trickery.",
        "This long-distance love story is comfort food in any language, perfectly agreeable and unlikely to surprise.",
        "The Lunchbox ultimately registers as a too-hesitant portrayal of hesitancy, and its pleasures are largely incidental.",
        "A clever setup that harkens back to “You’ve Got Mail” and “The Shop Around the Corner” doesn’t quite pay off in India’s warm-hearted comedy-drama The Lunchbox.",
        "There’s nothing wildly original here, but it’s carried off with charm and wit, and two very enjoyable central performances.",
        "First-time writer/director Ritesh Batra deserves credit for mining gently captivating drama from a pitch that could have just ended with passive-aggressive Post-its left on the office fridge."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Irrfan plays an accountant named Saajan Fernandez, based in Mumbai, who has been working day and night for years on files that now line his desk in hordes. His life is essentially as dry as the pencil lines he draws on paper while managingIrrfan plays an accountant named Saajan Fernandez, based in Mumbai, who has been working day and night for years on files that now line his desk in hordes. His life is essentially as dry as the pencil lines he draws on paper while managing numbers. Having food from a restaurant during the lunch break; having a cigarette right before getting on the Mumbai local after work; reaching home to packed food from a restaurant, again; and finally smoking one more time before calling it a day - are things that Fernandez's day from the start to finish. Until one day, he gets a lunch box which is not his. A little mix-up leaves him with a lunch box packed with homemade food. One can tell. Nimrat Kaur plays Ila, a housewife and a mother. She cooks scrumptuous dishes that she hope will revive the magic between her husband and her. Only one day she realises the lunch box didn't reach her husband. And, so, begins the ritual of little notes resting atop a pile of 'rotis' in the lunch box. New hope - that holds a secret promise - springs up in both Fernandez's and Ila's lives. What ensues between these two characters is something that can't be given a tag - the relationship is too delicate for that to happen. It's almost as if the movie never ends. You walk out of the movie hall and the film continues with you. How it ends changes with your life experience. The Lunchbox is the best indian movie of the year. A sweet and absorbing drama from start to finish.",
            "review_date": "2014-03-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When tasting someone else’s food for the first time, there is always a bit of a risk–whether the food will be satisfactory or not. Will it quench that craving of delight and hunger? Will it sit in your stomach well? The same can be said forWhen tasting someone else’s food for the first time, there is always a bit of a risk–whether the food will be satisfactory or not. Will it quench that craving of delight and hunger? Will it sit in your stomach well? The same can be said for film, especially when dealing with a debut director who only has small, difficult to find short-films that are usually discovered by acciedent or through scouring the web for elongated periods of time. Thankfully, The Lunchbox is a pleasantly packed surprise of a film.\r It’s been a long time since I have anticipated a small independent film that looks to be a happy-go-lucky telling of real people dealing with very real everyday issues. For the most part, so many independent foreign films today are embedded in the world of deep tragedy, pain, and suffering. The Lunchbox is a refreshing and unique gem of a movie filmed on location in Mumbai, India. Although the trailer of the film promises a feel-good premise with the chance of a realistic happy ending, the film instead opts for ambiguity and a chance for hope, another very strong yet common characteristic of independent foreign films.\r The main incantation of The Lunchbox is that, “sometimes the wrong train, will get you to the right station”, with a few unexpected stops along the way. Although the film did not fully exceed my expectations and offer a truly unique, foreign experience, the film is still an essential viewing for people with a hard to please foreign appetite.\r The Lunchbox is a complete sensory film experience. From the moment Saajan Fernandes (the irreplaceable Irrfan Khan) receives his new green lunch surprise full of culinary wonder, he revels in its delicious smell, almost eating his food with his nose. The green lunchbox of wonder that Sajaan receives comes from the magical hands of Ila (the wondrously beautiful Nimrat Kaur). Ila, whose new life as a content housewife, finds very simple pleasure in her everyday duties as a wife and mother; such as the entertaining stories of her unseen Auntie who lives atop her, the longing of her husband’s love and affection and the confidence knowing that she prepares a lunch for her husband that is both tasty and nutritious. Unfortunately for her, Ila’s husband Rajeev (Nakul Vaid) spends more time at work, in front of his cellphone, and attending to the needs of his profession, never really giving Ila and their daughter any attention.\r When we first meet Saajan, he is a closed off, lonely man intent on being left alone. Pushing papers and working almost unseen by his employees and the world around him for the last thirty-five years, his world is nudged ever so slightly when he is tasked by his boss to train a new employee, Shaikh (Nawazuddin Siddiqui) who will be taking his spot as he nears retirement. At first, Saajan avoids Shaikh, making a run for it as soon as his shift ends, and diverting the young, enthusiastic Shaikh to mindless duties. As time passes, the wrongly delivered lunches continuously make their way to Saajan, he allows happiness and change to enter his life, allowing him to warm up to Shaikh, as they connect and bond over sharing the miraculous lunch which leads to a healthy friendship for the two co-workers.\r The film teaches that everyday all over the world people are connected in ways we cannot begin to imagine until we get to know them. First time feature film director Ritesh Batra may not be as discreet with his foreshadowing of people’s kindred spirits, but nonetheless, his efforts are met with an open-minded happiness and joy that such a filmmaker exists. Set in the hustling-bustling centre of one of the most populated cities in the world, this small film focuses on the chance relationship between a man and a woman who are both searching for new meaning in their constantly disappointing lives.\r Both main characters offer us a very sensible look into the lives of men and women in India; the life of a working man in an office; and the life of a domesticated, elegantly unappreciated and beautiful housewife. As the two individuals continue to send letters to one another using the lunchbox as their own personal express-mail system, sharing their inners thoughts, secrets, and discontents with life, they begin a special bond that allows them to enact many of the unwanted desires that allows each of them to better one another’s lives. Both Saajan and Ila lead lonely lives, bound to each of their own desks (one an actual desk, the other a kitchen counter top), they use one another bravery and resilience to accept a mundane life for a chance at happiness, which is all you can ask from any piece of art.\r The Lunchbox is a tiny little film that asks, ‘what do we live for?’. Do we live to attend to and please others, packed into an existence that can be easily replaced by a catering service or another employee? Or are we meant for something greater?",
            "review_date": "2014-03-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“The Lunchbox” is an Indian film starring Irrfran Khan and Mimrat Kaur. Directed by Ritash Batra. The film got rave reviews from the major papers and periodicals as well as some word of mouth recommendations from people we know. The question“The Lunchbox” is an Indian film starring Irrfran Khan and Mimrat Kaur. Directed by Ritash Batra. The film got rave reviews from the major papers and periodicals as well as some word of mouth recommendations from people we know. The question I must ask is “why?” This is one of those films where a great idea is executed poorly, mostly because of the poor writing and the illogical circumstances that take place and the difficulty in trying to follow exactly what the characters are and will be doing. In spite of a few dozes during the film, I was sorry to see the credits come on so rapidly because it left me in the cloud of  not knowing how the characters resolve or don’t resolve their issues. I give the film  a 6 and hope that those who do see it will get more out of it than I did.",
            "review_date": "2014-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I recently watched the last season of 'In Treatment\" -- in which one of Gabriel Byrne's tormented patients in therapy is played by Irrfan Khan -- and was struck again by his riveting presence in this film. He is mournful, wry, intelligent,I recently watched the last season of 'In Treatment\" -- in which one of Gabriel Byrne's tormented patients in therapy is played by Irrfan Khan -- and was struck again by his riveting presence in this film. He is mournful, wry, intelligent, dark, hopeless, hopeful, all conveyed with such subtlety. The touching interactions between his character and the lovely woman who prepares his mistakenly delivered food have a \"You've Got Mail\" (or \"The Shop Around the Corner\") quality. Yet they might not lead where you expect.",
            "review_date": "2014-07-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Even though some consider this movie a romantic comedy I found very little comedy in it. It is a very sad and melancholic movie about lonely people in a huge city. One may be packed with millions of other people in overcrowded Mumbai but beEven though some consider this movie a romantic comedy I found very little comedy in it. It is a very sad and melancholic movie about lonely people in a huge city. One may be packed with millions of other people in overcrowded Mumbai but be all alone. The movie drastically differs from those that Bollywood produces, it is deep and delicate, more like a French one but so un-mistakenly Indian. A bit too slow but overall very well made.",
            "review_date": "2014-03-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good film. With sensitive humour.\rFor a first time film it is very good. Every critics web site give to the film a very good note.\rA true masterpiece.",
            "review_date": "2014-04-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Rarely an Indian film without its trademark dancing-and-singing routines, director/writer Ritesh Batra’s feature debut marvellously utilises the exotic “dabbawalas” system of Mumbai, which is an intricate lunch delivery service to people atRarely an Indian film without its trademark dancing-and-singing routines, director/writer Ritesh Batra’s feature debut marvellously utilises the exotic “dabbawalas” system of Mumbai, which is an intricate lunch delivery service to people at work from their their homes or restaurants and is remarkable for its accuracy, but Batra fictionalises a little mix-up of the system and links two strangers  into an epistolary communication, and from there, their penfriend-ship will further sublimate into something more genuine and profound.\r keep reading my review on my blog, please google: cinema omnivore, thanks!",
            "review_date": "2015-08-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nLovely movie.  Two lonely people get to know each other through notes in a lunchbox sent to the wrong office.   It was somewhat slow, but that gave it a sweet, contemplative rhythm, and the crowded street and subway scenes in Mumbai were a wonderful contrast to the isolation of the main characters.   Best was Irrfan Kahn, a brilliant, soulful actor who lit up the movie with his expressive face.  Next best--the Indian food.  I loved the notion of a lunchbox from home with a bunch of different homecooked dishes.  Wish I could get one of those delivered to me.  No sandwiches here. What I hated:  the ending.  C'mon, the characters should have at least met--maybe not run off together, but the trains passing in the night ending was extremely frustrating.",
            "review_date": "2014-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ritesh Batra's heartwarming solo endeavor 'The Lunchbox' is a powerfully acted, delicious dish sweetly served through an absorbing, small-scale tale that feels gleefully old-school.",
            "review_date": "2014-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautifully acted; at times, poetic. But ultimately deeply sad. especially for the women. One gets the feeling that the men, however bumbling or foolish, will eventually come out okay. But the women, including the auntie character who youBeautifully acted; at times, poetic. But ultimately deeply sad. especially for the women. One gets the feeling that the men, however bumbling or foolish, will eventually come out okay. But the women, including the auntie character who you never see, the mother of the young neglected wife (who is the star) and the girlfriend of the young man who will take over Mr. Fernandez' job. All these women seemed ultimately unhappy and beholden to their men; with their downcast eyes which spoke volumes. The neglected wife has dreams which I felt would never be fulfilled. When she sells her jewelry, there's a sense of foreboding. Earlier in the film she reads a news story of a young woman who jumps off a building with her daughter. I can't help but feel this is somehow connected strongly to the story. So sad.",
            "review_date": "2014-09-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An amazing tale that shouldn't be missed. The type of movie that will compromise your emotions and forget your watching a movie. A truly remarkable film that you will regret by passing it up.",
            "review_date": "2014-10-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's the small things and minute details in the movie which makes it so beautiful and real.\"Sometimes even the wrong train takes you to the right destination.\"",
            "review_date": "2019-06-04",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 40
}