{
  "title": "The Tale of The Princess Kaguya",
  "rating": 8.5,
  "release_date": "2014-10-17",
  "genre": [
    "Drama",
    "Fantasy",
    "Animation"
  ],
  "summary": "Found inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her – but ultimately she must confront her fate, the punishment for her crime. [Gkids]",
  "critic_reviews": [
    "This delicate, hand-drawn marvel is lyrical and heartbreaking in ways that most live-action movies never approach.",
    "Magical and melancholy, The Tale of Princess Kaguya comes from the other mad genius of Studio Ghibli, Isao Takahata, who co-founded the beloved Japanese animation company alongside the great Hayao Miyazaki back in 1985.",
    "The Tale of the Princess Kaguya is a marvel of Japanese animation, a hand-drawn, painterly epic that submerges us in a world of beauty.",
    "The Tale of Princess Kaguya is both very simple and head-spinningly confounding, a thing of endless visual beauty that seems to partake in a kind of pictorial minimalism but finds staggering possibilities for beautiful variation within its ineluctable modality. It’s a true work of art.",
    "A devastating and deceptively simple tale adapted from 10th-century folklore, Isao Takahata’s The Tale Of Princess Kaguya distills a millennium of Japanese storytelling into a timeless film that feels both ancient and alive in equal measure.",
    "It’s a lovely piece of work.",
    "Emotions and moods are anchored to specific moments of stillness, and we feel them all the more intensely because of it.",
    "At over two hours, it might test the patience of some younger viewers (and some impatient older ones as well), but for anyone willing to take the time, it's an utter treat.",
    "Glacially told gem from animator Isao Takahata, the 78-year-old cofounder with Hayao Miyazaki of Studio Ghibli.",
    "It's a remarkably gorgeous piece of work.",
    "An exquisite, hand-drawn marvel and an alternatingly jubilant and heartrending epic pastoral.",
    "The Tale of Princess Kaguya is a visionary tour de force, morphing from a childlike gambol into a sophisticated allegory on the folly of materialism and the evanescence of beauty.",
    "This folk tale about a magical child has even been cited by some scholars as an early and elegant work of science fiction. However, it’s also possible to bypass all this baggage and just approach The Tale of Princess Kaguya as the gorgeous and expressive film that it is.",
    "It's good for the soul, and composer Joe Hisaishi's themes are so right they sound as if they came straight out of the ground with the girl in the bamboo.",
    "It’s a gentle epic, based on a 10th-century Japanese folk tale, that uses pencils, ink, and impressionistic washes of color to convey a glowing visual otherworld, one that stands in contrast both to Takahata’s earlier work and the hard-edged lines and bright tones of much anime.",
    "A gorgeous, magical and melancholy fantasia about the joy and pain of human existence.",
    "The soft colors, graceful movements, and clean lines together embody the ineffable beauty of life on Earth that is one of the film's main themes.",
    "Notwithstanding the fairytale set-up, this is not exactly a children’s film. ‘Kaguya’ demands patience and open-mindedness. In return, it offers an achingly nostalgic meditation on what it means to love, age and depart from this world with dignity. A fitting farewell.",
    "Unique, beautiful and endlessly fascinating. It really is a work of art.",
    "Over-long, but a work of great artistry and emotion. As the woodcutter says upon finding our heroine: “A gift from heaven”.",
    "It's the best kind of fairy tale — tough, deep and meaningful, with a heroine who stays true to herself in spite of shallow temptations.",
    "Exquisitely drawn with both watercolor delicacy and a brisk sense of line, the film finds a peculiarly moving undertow of feeling in a venerable Japanese folk tale.",
    "This adaptation of a 10th-century folk tale is less sumptuous than Ghibli maestro Hiyao Miyazaki’s surreal classics, yet it’s also more affecting than most of them. An allegory about the irrecoverable joys of childhood, it may make parents hug their kids now.",
    "Throughout The Tale Of The Princess Kaguya, even when it gets bogged down in too much story, the animation is so gorgeous that any given frame could pass for a masterwork.",
    "It’s the beautiful and breathtaking animation that gives The Tale of the Princess Kaguya a luster that is both simple and sophisticated. Once again the visionary Takahata and Studio Ghibli prove that great animation is not just for kids, but can be universal in its reach.",
    "An old fashioned Japanese folk tale beautifully rendered in old-fashioned hand-drawn animation.",
    "The original story was called \"The Tale of the Bamboo Cutter,\" but Takahata's title puts the focus where it belongs.",
    "Taking Eastern watercolours as inspiration, the aesthetic is impressionistic and painterly with a fluidity that imbues the piece with an intrinsic magic."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "No stranger to crafting animated works of devastating emotional power, Isao Takahata''s latest masterpiece, and I don't throw that term around lightly in any capacity, is a beautiful impressionistic fantasy with a towering quality ofNo stranger to crafting animated works of devastating emotional power, Isao Takahata''s latest masterpiece, and I don't throw that term around lightly in any capacity, is a beautiful impressionistic fantasy with a towering quality of timelessness and emotional realism. Watching The Tale of the Princess Kaguya is the equivalent of having one of your childhood fairy tales fleshed out in a universe that feels more tangible than anything you've ever experienced in animation. I cannot stress the overwhelming beauty of the art style featured throughout Kaguya. I was blown away. The hand-drawn sequences stun with simultaneous clarity and formlessness, reflecting the duality of the perception of reality. I was emotionally floored when the climax came to pass. It is an ending that makes me consider my past failures in life and all the wasted time and emotions I've spent on not living to the utmost that will truly hit me hardest upon the forever leaving of a person from my life, maybe even my own passing. To love people as deeply as we do, and then to spend our time avoiding emotional intimacy or dismissing the great love for others that lie untapped in our beings, is truly heartbreaking. I cried at the finale, but the deep reservoirs of heartache that The Tale of the Princess Kaguya caused me is something I that I'm still reeling from almost a week after seeing it. The overall joyous euphoria I experienced leading up to Kaguya's departure wasn't underscored by the romantic dread that this feeling is only fleeting, allowing you to truly forget entirely about real-life eventuality and become absolutely lost in the primal happiness found in the recesses of childhood memories, only to find out moments later that this feeling will not last, just like youth itself. Do not squander your time. Find love and cling to it, in it's many forms and accompanying heartaches, for if you do not, your life will pass you by and you will not be able to remember what it truly means to be human, the greatest tragedy of all, which truly makes The Tale of the Princess Kaguya a must-see, once in a lifetime, impossible accomplishment.",
      "review_date": "2015-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not a fan of  japanese animation, and i always found these type of movies very strange for me to view.\r But i see \"Spiried Away\" and \"princess Mononoke\" about a month ago, and really the ghibi studio caught my attention. those moviesI'm not a fan of  japanese animation, and i always found these type of movies very strange for me to view.\r But i see \"Spiried Away\" and \"princess Mononoke\" about a month ago, and really the ghibi studio caught my attention. those movies were great, but still a little difficult to watch for someone who is nor familiar with the japanese culture and their movie culture.\r But this is a really masterpiece. The animation itself is one of the best and with the amazing soundtrack, there are some parts of the film that are really beautiful and epic.\r And the storyline is much easier too understand and see than Mononoke and Spirited Away.\rThe end of the movie was very schoking for me, and the whole situation, i can feel the pain of the princess.\r Maybe this is an exaggeration, but we still seeing some type of conducts that are represent in the movie. And the meaning for me of the movie, was very touching.\r This is a movie that you need to see alone, or with more people but with no distraction, because all the movie it's very amazing. the music it's simply perfect.",
      "review_date": "2015-05-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "5/5★ Drawn in a delicate watercolor style that bleeds from the edges and utilizing simple charcoal-like lines to convey complex emotions, this Studio Ghibli film is a wonderful example of how film can be art. Princess Kaguya's tale is told in5/5★ Drawn in a delicate watercolor style that bleeds from the edges and utilizing simple charcoal-like lines to convey complex emotions, this Studio Ghibli film is a wonderful example of how film can be art. Princess Kaguya's tale is told in a frank and realistic manner and with an un-Disney like lack of cutesy characters. It's a film that treats its audience and subject matter with maturity and respect.\rThe care in every moment is obvious, the story is heartbreaking and proof that it's the films that don't have a happy ending that are most memorable.\rVerdict: Watch.",
      "review_date": "2015-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Watching Isao Takahata's 'The Tale of the Princess Kaguya' one question bewildered me: how can something so minimalist contain so much beauty? I am speaking, of course, of the brilliant chalk/crayon-style animation. It looks like a coloringWatching Isao Takahata's 'The Tale of the Princess Kaguya' one question bewildered me: how can something so minimalist contain so much beauty? I am speaking, of course, of the brilliant chalk/crayon-style animation. It looks like a coloring book, offering this film a true artful palette.The film's screenplay is inspired by a Japanese folk tale and it revolves around a girl birthed from a stalk of bamboo and grown by a bamboo cutter and his wife. She grows at an unnatural rate, yet the film keeps the mystery of her origin hidden for most of the duration. This is a good thing, because the mystery offers a way of enthrallment for the viewer. Speaking of which, this is a meticulously crafted picture, its slow-paced, it requires patience and thoughtfulness and a love for the aesthetically pleasing and narrative-driven. Indeed, this film focuses a lot on debunking Japanese traditionalism in a perfectionist detail. Many directors pay homage to their native roots by honoring their country's traditions. Yet, Takahata does more than that. He scoffs at the superficiality of the Japanese nobles, where princesses had their eyebrows plucked completely and their teeth blackened. But he revolts through Kaguya whose innocence is the most emotionally powerful against these dehumanizing customs. At her naming party, which lasted for three days and three nights, she was nowhere, people getting drunk and some even patronizing her. \"All I do is sit here\" she says.By the time we learn of Kaguya's true origin, we do not get the usual plot-twist shock. This film is more than that. What we get instead is an emotional crescendo, as she realizes the inevitability of her fate. There is a deep regret every time we hear her screaming. \"I don't want to go!\"; \"Give me more time!\" In the end, though, her parents suffer the most. Her mother wants the best for her and the same thing can be said for her father, even though he constantly lies himself believing that his happiness is hers also. I found them very familiar. To me, they are symbols of every true-loving parents. Imperfect and always suffering for their children. I smiled at every goofiness of Kaguya's father. It kinda reminds me of my own. And I am sure I am not the only one feeling this way.I am a huge advocate of watching films in their original tongue. Please, if you watch this, do that. Read the subtitles. Make an effort. Isao Takahata defies Oriental traditions, but he has an infinite respect for its arts. He deserves that from you.",
      "review_date": "2018-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I read somewhere that of the Academy Award nominated Animated Feature Films, Big Hero 6 (the winner) garnered something like 85% of the vote, followed by How to Train Your Dragon 2 with 15% of the vote, followed by all the others includingI read somewhere that of the Academy Award nominated Animated Feature Films, Big Hero 6 (the winner) garnered something like 85% of the vote, followed by How to Train Your Dragon 2 with 15% of the vote, followed by all the others including Tale of Princess Kaguya getting 0 votes. I'm not sure if this is in fact true, but if so it is a travesty. Tale of Princess Kaguya was one of the best animated films I've ever seen, and Big Hero 6, while slickly animated, is ridiculously predictable and uninteresting (and this coming from someone who loves origin stories).\r The Tale of Princess Kaguya is a very simple, heartfelt tale based on The Bamboo Cutter, a Japanese folktale from long ago. The standout element visually is the hand drawn watercolor style of animation. My favorite moments in this film are when the animation style changes to mirror the main character's emotional states. These moments are simply amazing and to me represent some of the best animation I have ever seen.\r I think The Tale of Princess Kaguya is for everyone to enjoy no matter what your age, gender, or cultural background is.",
      "review_date": "2015-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If Miyazaki is a genius, Takahata is another, his works are distinguished, not to mention that the artwork is amazing, looks like a complete work of art. Kaguya-hime is a wonderful, heartfelt film, is a spectacle.",
      "review_date": "2015-09-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe tale of the Princess Kaguya brings in the Japanese tale about princess kaguya and her journey to find the meaning of happiness.\r Since this is Ghibli studio movie , it's for sure still amazing looking movie but even more stunning with it's Japanese painting style , and even that the movement of characters in the movie is still really good and some scene which character moving really fast it's just so amazing and so beautiful to watch.\r With that and Isao Takahata great storytelling just make this movie a really top list of animation movies.\r One thing that really make a lot of people angry is the ending of this movie which is not a surprise consider Isao Takahata famous movie like Grave of the Fireflies but honestly i personally really like the ending because it's just fit to the theme of this movie so much.\r and that theme is talking about finding the \"happiness\" but in the reality world it's not that easy and sometimes you just can't change everything especially the terrible fate that waiting for you and that what's The tale of the princess kaguya talks about.\r In the end this movie is truly the best animation movie of 2014 without any doubt in my mind , and maybe even the best movie of studio Ghibli.",
      "review_date": "2015-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall, my thoughts are that this film is excellent.  It’s genuinely a brilliant animated film that keeps up Studio Ghibli’s reputation and if this is to be Isao Takahata’s final film, he is going out on a brilliant film, and this is by farOverall, my thoughts are that this film is excellent.  It’s genuinely a brilliant animated film that keeps up Studio Ghibli’s reputation and if this is to be Isao Takahata’s final film, he is going out on a brilliant film, and this is by far his best work to date.  My only major complaint with the film is that a few of the darker moments feel the film should have warranted a PG rating rather than the U rating that it did get and I think a few parents might be a bit shocked by some of the things that are allowed in Japanese kids films.  I was aware that there were plans to censor certain scenes of this film, but I am happy to say that the film is completely uncut in its British release and it’s all the better for it.  The film gives us excellent characters, a brilliant but hard hitting storyline that offers us no easy answers and I really think that everyone will be emotionally affected by the end.  It’s a brilliant, but sombre piece.  I’m not sure that it will appeal to as large an audience as past Ghibli films have, mainly on its distinct Japanese sensibility and culture.  However, for me personally it was damm near brilliant.  Particular praise goes to Chloe Grace Moretz for her excellent performance as well as the rest of the brilliant ensemble cast and the amazing animation and film score.  I am firmly in the belief that as much as I liked Big Hero 6 this film should have won the Oscar.",
      "review_date": "2015-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Tale of Princess Kaguya is a gorgeously animated film, with whimsy and sadness and grace.  From the mountain countryside where the princess grows up, to the city and mansion buildings, to the beautiful clothes they obtain for theThe Tale of Princess Kaguya is a gorgeously animated film, with whimsy and sadness and grace.  From the mountain countryside where the princess grows up, to the city and mansion buildings, to the beautiful clothes they obtain for the princess, everything is stunningly beautiful.  The story builds very slowly, and as a viewer unfamiliar with the original fairy tale, I was often completely clueless about where it was going, although things were clear as they unfolded.  (I did find the ending a complete surprise, though; presumably this is not the case for viewers who know the story.)  The characters are complex and highly sympathetic, even the father whose decisions about his daughter's life are questionable throughout.  Most of all, though, I was surprised by how very sad this movie felt to me--not in a tragic or sudden way, but in an atmospheric sense.  For me, the movie was full of the kind of intense longing and yearning that's engaging even as it hurts to watch.  Long and slow, I don't know how many children (or even some adults adults) have the attention span for this story of growing up, but it richly rewards a patient viewing.",
      "review_date": "2015-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Visually one of the most unique and beautiful movies I have ever seen.  The soundtrack is phenomenal with both haunting and lively tracks that really add to the atmosphere of the movie.  Yes, it does go for a long time but it really allowedVisually one of the most unique and beautiful movies I have ever seen.  The soundtrack is phenomenal with both haunting and lively tracks that really add to the atmosphere of the movie.  Yes, it does go for a long time but it really allowed the Kaguya's character to grow and it made it all the sadder at the end.  Definitely worth watching.",
      "review_date": "2015-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "With what we have given in recent years from Studio Ghibli, Pixar, and Warner Brothers it seemed unlikely that animation would become more stunning. While the world is expanding the limits of 3-D animation, by reflecting larger radiantWith what we have given in recent years from Studio Ghibli, Pixar, and Warner Brothers it seemed unlikely that animation would become more stunning. While the world is expanding the limits of 3-D animation, by reflecting larger radiant settings around the characters like in Wall-E or The Lego Movie, or giving 2-D animation for color and depth like in Spirited Away, it is truly remarkable to have a film use its animation to make every scene stripped to the bare bones. A lot of work goes into showing the shadows, the lighting of which season it is, and making the expressions of people radiate. It takes a very smart director, in this case Isao Takahata, to make sure the flowers bend in the wind the way they need to,  and animal move like they would in real life, especially with this type of animation. Isao Takahata isn't only making smart artistic choices but also brings out the imagination we have come to expect from such a high caliber studio. With the animation being mostly water color the film feels very fresh, unless it doesn't want you to feel that way. The film reflects the mood of the princess, in her earliest days the world is all nature and mystery, in her most frustrating moments the world is a haze of dark shapes.  The movie's style is something I didn't know I wanted until I had it. I want to see more lightly shaded versions of beautiful landscapes, more steady pacing, and more effort put into the story working with the visuals. If you aren't as interested in animation style and rather just get an engaging story then I would still recommend this film. It is slow but it is still fulfilling to watch Princess Kaguya grow up. Perhaps fulfilling isn't exactly the right word as there is an ambiguity to the film. I want directly address what these elements are but I will say the film comes full circle again, and then leaves on one less optimistic note. The story does bother me in it's dream sequences. The film seems to prologue them longer then necessary only for the sake of finishing a character arc. But that is really the only issue I take with the writing. The characters aren't perfect though, Princess Kaguya is filled with depth and complexity, but the parents, not so much. The father is sort of that \" You will get married because it is what I, I mean you want\" but the give him more depth at the end. The mother is interesting in the beginning but kind of disappears and stays quiet for most of the end. All in all it is one of Ghibli's best films.",
      "review_date": "2015-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's astonishing. A prime example of how much poetic beauty, grace and wonder a film can inspire with so little. Mr. Takahata designs the film with minimal impressionistic dream scribbles that makes the whole thing like like a delicateIt's astonishing. A prime example of how much poetic beauty, grace and wonder a film can inspire with so little. Mr. Takahata designs the film with minimal impressionistic dream scribbles that makes the whole thing like like a delicate precious jewel that is humbling to view — not with its story of divinity, but its strange, wonderful tale of humanity. That this same sense of passionate sensitivity went into developing the princess herself into a fully developed and emotionally complicated woman rarely seen in film, animated or otherwise, helps it to transcend to the level of an unqualified masterpiece. It's my favorite movie of the year.",
      "review_date": "2014-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "With the exception of the energetic The Lego Movie, this year has been a disappointment for the animated genre. What a relief then it is that Isao Takahata's (Grave of the Fireflies) new film is a triumphant success.\r Based on a 10thWith the exception of the energetic The Lego Movie, this year has been a disappointment for the animated genre. What a relief then it is that Isao Takahata's (Grave of the Fireflies) new film is a triumphant success.\r Based on a 10th century Japanese folktale, The Tale of Princess Kaguya is a bitter-sweet coming of age story. Our protagonist is Kaguya-hime who is discovered as a baby in a bamboo stalk by an old peasant man. He and his childless wife raise her as their own, providing the best they can as she rapidly ages. While her mother is fearful of change and just wants a comfortable life for her adopted daughter, her father envisions great things. He sees Kaguya as part of a divine plan and after fine clothes and gold come shooting out of bamboo stalks he concludes that the heavens want her to become a proper princess. He assumes this is the best way to make his daughter happy instead of asking her what she wants.\r A sharply observed feminist critique of traditional Japanese culture as well as a cautionary tale of the burdens we place on our children, The Tale of Princess Kaguya has a wealth of complex themes and archetypes hidden beneath the surface of its fairly straight- forward story. This is one of the rare films that are both easily accessible to a young audience and one that film students can write thesis papers on.\r The final word should be reserved for Studio Ghibli's animation. The style used invokes something between impressionist paintings and water-colours while employing a muted palette. Ghibli moves away from traditional anime and the results are breathtaking. The hand drawn frames could each stand alone as a portrait and yet the film feels fluid. At times the animation blurs into expressionism; the brush strokes matching the characters inner- turmoil.\r Easily the best animated film of the year, it's a must see for fans of the genre.",
      "review_date": "2014-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An astonishing, wonderful experience. The hand-drawn animation style makes it a very unique film. This is about the tale of a young princess that wants to be free, which itself is based on an old Japanese story. It is very different comparedAn astonishing, wonderful experience. The hand-drawn animation style makes it a very unique film. This is about the tale of a young princess that wants to be free, which itself is based on an old Japanese story. It is very different compared to the other Studio Ghibli's films, but that just makes it closer to perfection.",
      "review_date": "2015-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What an utter disappointment. I was really looking forward to seeing this but after viewing I wish I never had. The film was meant to be beautiful but just failed to engage. I was dreading a terrible ending but the ending I got was worse. TheWhat an utter disappointment. I was really looking forward to seeing this but after viewing I wish I never had. The film was meant to be beautiful but just failed to engage. I was dreading a terrible ending but the ending I got was worse. The first 20 minutes was good so I can't give it zero marks. But really it's not worth watching!",
      "review_date": "2015-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"The Tale of the Princess Kaguya\" is Isao Takahata's renaissance since disappointed \"My Neighbors the Yamadas\". A gorgeous, beautiful and classical folktale with particular Ghibli avant-garde sight. This film is a masterpiece, a Japanese\"The Tale of the Princess Kaguya\" is Isao Takahata's renaissance since disappointed \"My Neighbors the Yamadas\". A gorgeous, beautiful and classical folktale with particular Ghibli avant-garde sight. This film is a masterpiece, a Japanese delicate old painting that it's filmed-made.",
      "review_date": "2014-10-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I love the film, the animation in particular, I can't help but feel frustrated with the story, which is extremely confusing without having read the original tale and never feels like it's building to anything until the unexpected andWhile I love the film, the animation in particular, I can't help but feel frustrated with the story, which is extremely confusing without having read the original tale and never feels like it's building to anything until the unexpected and unfulfilling climax.\r Disney knew how to adapt a fairy tale so that it was a cinematic experience, but that skill was not evident in this script, aside from a few beautiful sequences that had to be separated from the plot as dream sequences. However, the animation is fresh and lovely to see on the big screen, each motion beautifully captured. The love of the Princess' parents and the ill-fated attempts of heaven to get them to give her an existence she never wanted are well explored as tragic, although it's well countered by understated comedy. The Japanese culture on display is intriguing, although one or two instances left me confused as some character appeared or event occurred I didn't know enough about to understand the meaning of.\r Overall a good film, with the look and style of beautiful Asian art. But it failed to touch me emotionally, and its overlong running time was difficult to sit through. I want to love it more, but ultimately find it frustrating where the best Ghibilis were always awe-inspiring and engrossing.",
      "review_date": "2014-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Way too slow for me. Nice animation. I think you really need to be a fan of this genre to like this movie.\r There's a character minimum. There's a character minimum.",
      "review_date": "2015-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For this to score higher than any other Ghibli movies is rather stunning. This tale is at its core not so interesting as the main character Kaguya spends most of her short life on Earth in complete ignorance to the life around her andFor this to score higher than any other Ghibli movies is rather stunning. This tale is at its core not so interesting as the main character Kaguya spends most of her short life on Earth in complete ignorance to the life around her and completely raptured by what is superficially being waved in her face, even though its to her dislike. She is powerless to be more than an annoyance to the men wanting her hand and in the end when its too late she suddenly finds the ability to lets just say do things humans normally cannot do in order to spend the 1 minute in the film that is suppose to bring us to the ultimate conclusion...whatever that was. Try any other Ghibli movie and you will be more than satisfied relative to this clunker.",
      "review_date": "2015-04-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A animated film strongly emotional. This history put face to face traditions and freedom development in a lovely and nostalgic environment with a really awesome concept art. It proves how can mix a lot of feelings, lonely, happiness, sadnessA animated film strongly emotional. This history put face to face traditions and freedom development in a lovely and nostalgic environment with a really awesome concept art. It proves how can mix a lot of feelings, lonely, happiness, sadness and love. It deserves every tear.",
      "review_date": "2016-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "very cute and sad movie. I enjoyed how the kids were focuses in the movie. The art design is unique and new, very different to US art. Also the setting and story is different to western style.",
      "review_date": "2020-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The tale of princess Kaguya is a breathtaking, wonderfully animated and surprisingly intense film that really deserves to be part of Studio Ghibli's best works.",
      "review_date": "2017-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Based on an ancient japanese leyend, the inspiring, dazzling tale of a princess who was not to be and tried to outrun her destiny. The style of animation by hand is of the best of genre, with a beautiful score by Joe Hisaishi and aBased on an ancient japanese leyend, the inspiring, dazzling tale of a princess who was not to be and tried to outrun her destiny. The style of animation by hand is of the best of genre, with a beautiful score by Joe Hisaishi and a heart-breaking final act. Superb!",
      "review_date": "2017-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stunning animation with brilliant storytelling, The Tale of The Princess Kaguya has the elements to be a flawless film. Its powerful, heartwarming, devastating and thought-provoking story says so much with so little. It explores themes likeStunning animation with brilliant storytelling, The Tale of The Princess Kaguya has the elements to be a flawless film. Its powerful, heartwarming, devastating and thought-provoking story says so much with so little. It explores themes like the quick passage of time, what it means to be a human, a daring critique to old traditions, questioning why things have to be the way they are supposed to be, how artificial everything in this world feels, the meaning of happiness...It is a movie about so much. While some of those themes are shown in an obvious way, some of them are more subtle. The writing is wonderful. The characters are all well developed, complex, realistic and compelling.The way it looks just complements the brilliant storytelling. Its unique visual style, specially compared to other Ghibli films, gives this movie its own personality. Its presentation is truly amazing. The score is also beautiful.This is an outstanding cinematic experience that can be enjoyed by everyone. It's not an abstract art film, it's actually pretty straight forward and easy to understand, yet it's not a surface level movie. Movies like this are why animation is also a form of art. Not only in the visual aspect but in how the story uses its animation in a clever way to take the audience to a never before seen world. It is infurating to see Big Hero 6 take the award instead of this movie. This is genuine art.",
      "review_date": "2020-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautiful film. The overarching theme is pretty obvious early on, but there are many subtle messages & deeper themes present in the movie that unfortunately go over most people's heads. If you are the type of viewer that can only take thingsBeautiful film. The overarching theme is pretty obvious early on, but there are many subtle messages & deeper themes present in the movie that unfortunately go over most people's heads. If you are the type of viewer that can only take things at face value, then I'm sorry...stick to Disney.",
      "review_date": "2019-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Tale Of Princess Kaguya, directed by Isao Takahata, is one of the finest and soul refreshing movies that Studio Ghibli has ever made. All that it relies upon is simplicity. It invokes the attention of the audience through its way ofThe Tale Of Princess Kaguya, directed by Isao Takahata, is one of the finest and soul refreshing movies that Studio Ghibli has ever made. All that it relies upon is simplicity. It invokes the attention of the audience through its way of Storytelling, and beautiful animation technique, and character development. Also it has a lot of emotion: joy, surprise as well as grief, and a very true message which conveys that Joy and Grief are an integral part of our life, without it no human can be human,and it is certainly not necessary that our life will always be a joyous. The characters have been developed excellently, and it is really worth watching. Truly it's a Masterpiece.",
      "review_date": "2020-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film left me speechless. The sheer beauty of unique hand done animation is something so eye catching and the phenomenal color palette which is one of the if not the greatest one I've seen in a film. I'm so happy that Takahata put so muchThis film left me speechless. The sheer beauty of unique hand done animation is something so eye catching and the phenomenal color palette which is one of the if not the greatest one I've seen in a film. I'm so happy that Takahata put so much time into this film which was absolutely worth it as this is an easy pick for one of the most beautifully animated films of all time.",
      "review_date": "2020-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "like japanese films, and this one is definitely one of the best japanese movies seen for recent months.. a lot of beautiful scenes, nice cast, interesting story, recommend without any hesitation!!!!!!",
      "review_date": "2022-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've watched and loved many Studio Gbili movies. Plus positive reviews of this movie. So with high expectations going in sustained at first by the first half hour being pleasant and the art is beautiful. The next part of the movie isI've watched and loved many Studio Gbili movies. Plus positive reviews of this movie. So with high expectations going in sustained at first by the first half hour being pleasant and the art is beautiful. The next part of the movie is gruelingly depressing including people being unreasonably stupid to keep the movie on it's senseless trajectory, including at least two inexplicable timeline resets that make you scream what just happened?!?Ending in a deeply depressing. If you are like me, you will feel like your mind was just **** I got such a headache now.",
      "review_date": "2021-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI have seen almost all the films of Ghibli studios, for me this film is a work of art, with a beautiful animation, a very good soundtrack, an interesting and unusual story in anime of the last century. He was very attached to Japanese culture as such. The end for me was the best I have seen so far, touching the Buddhist philosophy, where the princess leaves the world to return to the moon where there are no impurities, no pain or suffering, with a beautiful celestial melody she leaves the earth.",
      "review_date": "2021-08-13",
      "source": "metacritic"
    }
  ],
  "num_reviews": 58
}