{
    "rating": 8.6,
    "release_date": "2012-09-14",
    "num_reviews": 110,
    "genres": [
        "Hindi"
    ],
    "summary": "Shruti loves Barfi, a hearing and speech-impaired man, but marries someone else. Years later, she learns that he is in love with an autistic girl, and feels the need to rethink her own marriage.",
    "reviews": [
        {
            "content": "Barfi! is a film that has worth-watching parts in places. As always Ranbir Kapoor's acting will win your heart and every single character has done a fabulous job. Watch it for emotion and acting.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful film with great acting and amazing cinematography. An engaging screenplay and story.",
            "review_date": "2022-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The screenplay is more meandering that it needs to be, and a lot of the gags cross the line between homage and plagiarism - but you'd forgive these trespasses for a film that so obviously has its heart in the right place.",
            "review_date": "2021-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that touched upon the true emotions that everyone can connect with so well that it becomes a teary ride.",
            "review_date": "2020-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anurag Basu had so shamelessly copied so many other movie scenes in his movie 'Barfi'.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a beautiful rom-com where two imperfect people are so wonderfully perfect for each other. It's heartwarming. Ranbir & Priyanka at their best. A must watch.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish acting was the only thing required to like the movie.If you have watched Amélie,The notebook and Charlie Chaplin acts,then you know what I am talking about.I wish this movie was novel in storyline aspect. Watch the movie only if you are a fan of Ranbir Kapoor or Priyanka Chopra.",
            "review_date": "2019-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi , well its a movie which I had been waiting for long. I perceive Barfi as an academy award winner as it brings out the cinematic excellence and emanates the highest attributes of human creativity.",
            "review_date": "2019-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You should know this is going to be a sad yet beautiful film before you watch this or you will left frustrated at the end of this masterpiece.",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet film with a surprising twist at the end. Priyanka Chopra (at 29) plays an autistic 16-year-old (and pulls it off). I cannot think of another actress (one that's drop dead gorgeous no less) who would even attempt such a role and allow herself to be so vulnerable.  Ranbir Kapoor pays homage to Charlie Chaplin, Roberto Benigni, and others as her deaf and speech impaired rescuer. Filmmakers and screenwriters should be studying Indian film. They're doing some beautiful work.",
            "review_date": "2016-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's real and meaningful movie",
            "review_date": "2015-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Bollywood movies!  Albeit with an unfortunate name in English, Barfi! is sweet and combines all that is fun about Bollywood with characters with autism and who are Deaf.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The label 'Bollywood' movie normally causes me to turn off as i assume there will be hours of dancing but this film is a must see. Ranbir portrayal of the deaf mute man is  comic genius and  the Charlie Chaplin influence is clear.  The second reason to see the film is the inspired performance of Priyanka playing the woman with autism.  What would seem to be on the surface unusual subject combinations works to become one of the most moving films seen.  The plot with the kidnapping was a bit hazy but do not let this put you off.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had me thinking about the spectrum of disabilities and abilities. The story had many ups and downs, but the main character, despite his disabilities, had the ability to survive and stay positive during his life.",
            "review_date": "2014-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never thought I'll see an Indian dedication to Charlie Chaplin movies before. \n\nBittersweet, uplifting and altogether charming.",
            "review_date": "2014-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi didn't steal Chaplin and other classic films' highlights.  Barfi just like those classics and wanted to show their respect to them. Three leading actors are just great.",
            "review_date": "2014-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stolen pieces from The Notebook, Fried Green Tomatoes etc... are got together and music style of Amelie is copied.. and finally all were served warm, that's it..! The movie is fine and fun to watch, but it lost my respect..",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sep 14th, 2014 Sunday.\nAges of customers: The most is around 35-50\nMan:Woman 3:7",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming story about a deaf and mute boy, 'Barfi' is beautifully shot in Darjeeling and Calcutta - i even paused and made screenshots of some of the countryside scenes! Ranbir is amazing and flexible in range, hardly speaking a word throughout this film, but showing amazing talent and physicality, especially in the sofa comic act! Makes me wanna watch Raj Kapoor and Charlie Chaplin stuff soon. Priyanka as Jhimil is so brilliantly depicted - right down to daily mannerisms - that I wondered if the actress herself was autistic! The cinematography and music were awesomely coordinated, and the colors rich and lush.. it's such a beautiful ode to Darjeeling! And the film is a glorious celebration of life!",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if most of the indian movies are typically 2.5 hours Anurag Basu has shown how to keep the audience engaged and giving an enthralling experience into the life of a person who is deaf and dumb. This is Ranbir's best work ever.",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies that I've ever seen.. I strongly suggest.. Indian type of Amelie.. amazing soundtrack..",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad effort, but I found it boring. For a film with little dialogue it was way too long. The soundtrack was random and did not sync well with the film. I hate to say it, but I also found the title character to be annoying. (First and only viewing - 6/18/2014)",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just lovely. A wonderful story. The main actor's portrayl was reminiscent of Buster Keaton. I just fell in love!",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best movie ever!!",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A totally different story.",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "official oscar entry",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You may say they copied scene from others, but when they make such MASTERPEICE you should be ashamed of your perceptions and rather rephrase: they got inspired from some others. Priyanka Chopra worths every award of this earth for her role. She defied almost every grounds. I never thought she was such brilliant! She's got too much to handle. Awesome! Superb!! I'm just out of my adjectives!!! Ranbir was absolutely brilliant too. Until Priyanka came to the scene, he was blowing it up. And then Priyanka made it Grand! And together, they created one of the Best movies on the earth. Ileana is beautiful and she performed nice too. As Priyanka and Ranbir will take away all the credits, she will not be mentioned that much. But she was also mesmerizing. Anurag Basu, the director, showd some guts to draw his dream picture and let it not go away to be a lush bollywoody flick. Kudos to him. More to mention, I was also amazed how beautifully Ranbir imitated Charlie Chaplin's trademark shots! In total, Barfi! is outrageously beautiful! A full 5.00 out of 5.00 for this piece of art!!",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "BRILLIANT! loved every second of it! Piggy chops rules, oh and yes Ranbir is darn good too! Heartfelt, feel good movie!",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Mute From Darjeeling",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Believe me: you´ll watch this with a friendly smile on your face from the beginning to the end. Against your will, you may even shed a tear.",
            "review_date": "2013-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Barfi!\" is an irresistibly sweet movie that will warm your heart. I thought the way the story was presented was surprisingly complex and the performances were truly top notch. While I felt the movie slows down in some of the middle parts, as a whole the experience was worthwhile. It is an upbeat movie that blends comedic and dramatic elements well. The movie also has something to say about normality and true love and it leaves an impact.",
            "review_date": "2013-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very sweet movie that has a humor but is also very powerful. I wish it was shorter, but it is still one of the few Bollywood movies that is able to show love between two people without any physical depictions.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb ! What a revelation for Hindi cinema. A sensitive topic beautifully dealt with, mostly light hearted even when dealing with strong emotion. Superb performances especially by Ranbir and Priyanka. Lovely soundtrack too. Well directed and edited too.",
            "review_date": "2013-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with great performances it is a great feel good film",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi! combines the physical comedy of silent era films with modern story telling, with varying degrees of success. Endearing at times, it comes close to running off the tracks (using the train theme from the movie) in places. It would be a fun game to have audience members identify movies from the last 100 years that inspired different scenes of the film.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with very few words, Ranbir Kapoor smashes the role as a deaf-mute guy.. Priyanka as his autistic friend is not too bad either.. both disabilities portrayed with aplomb if i may say so.. Ranbir is improving with every movie.. excellent performance.. Ilean D'Cruz puts in a convincing debut too..\nthe brief instances of cinematography of a silent movie added to the background score gives the whole movie a innovative and attractive spin",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely unusual for Bollywood. Great soundtrack, and sweet story,  it's major fault lies in being a bit too long...",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not your average love story. very funny and cute.",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aamir Khan-style social commentary meets Bollywood love triangle trope. A surprisingly good combination, though the back-and-forth through time and memories makes the story hard to follow at times.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie has fantastic actors and acting but still it is a borin film",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Goofy deaf man falls in love in a stunningly beautiful woman who is already spoken for, accidentally kidnaps an autistic woman and falls in love with her, finding that having no common language is not a barrier for love that is blind - a love triangle is born.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing and heartwarming Bollywood romantic comedy. Great cast and awesome photography and soundtrack.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magical experience. Beautiful story and music. Hats off to Ranbir Kapoor.",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shouldered by career defining phenomenal performances from Ranbir Kapoor & Priyanka Chopra Barfi is epitome of quality Indian cinema. An emotional beautiful uplifting movie that invites us to question our priorities in life. A rare movie that deserves an above perfect score if possible for its direction & performance",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in the 1970s and various other decades, this romantic comedy tells the love story of a differently abled couple. Overacting by Ranbir Kapoor and Priyanka Chopra are balanced out by beautiful cinematography, Chaplinesque slapstick and a light-hearted score.",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Priyanka is money in this",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't expect too much it is going to disappoint  you if you expect\n from it",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie from Bollywood! Ranbir's role as Barfi and Priyanka's role as Jhilmil is amazing! Ileana doing very very very good! Must watch movie for movie lovers! It is the director of Gangster and Kites! Well done!",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movies are about what you feel - and this one will make you happy. Overlook all the 'inspirations' it got from old hollywood and Raj Kapoor movies. In the end, it's such a damn feel-good film with superb performances turned in by all. \nWatch it when you're down and too much going on in life and you just wanna relax with a loved one.",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly beautiful Indian film, a mix of comedy and drama. It tells a story of Barfi, a guy who can neither speak nor hear but manages to win the hearts of everyone, including the unhappily engaged Shruti and the autistic Jhilmil. A love triangle story that is rather untypical of Bollywood. With beautigul music, nevertheless. The music and the vivid colors reminded me of French cinema, most prominently Amelie. The actors do a terrific job and carry this story without it drifting into a plain tearjerker or empty comedy. I am new to Bollywood cinema but I was familiar with Priyanka Chopra (Miss India and World 2000). Her performance really caught me by surprise. I hope that a wider Western audience will get the chance to see see this wonderful film.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very cute movie with a lovely and entertaining story. The music is fun & beautiful. :)",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie worth watching over and over again. A mute Ranbir Kapoor teamed up with Autism cradled Priyanka Chopra portraits a meaningful, heart-felt romance. Love needs expresions, which both successfully make it happen. Bollywood need to make movie like this a lot.",
            "review_date": "2013-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully directed.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Barfi!,\" from directing to cinematography to editing, is well put together, especially for an Indian movie. I really enjoy how the film tends to focus on the positive as opposed to all the melodrama. Yes, it does get melodramatic, but not for too long. We get some beautiful shots of the scenery, but what would a technically sound film be without a script? This film has top notch writing with interesting characters and a sweet story that will melt the coldest of hearts. The story is pretty simple, but it is done in a unique way. There is minimal dialogue and most of it is conveyed through action, sort of like classic movies of the past. It's cute and adds to the overall charm of the film. However, the story is over complicated by some contrived plot points. One in particular happens towards the end of the film, but for the most part it doesn't take away much from the film. Another issue would be with how the story is told, at times it gets confusing because it jumps from brief moments of three different time periods. Even with some of these issues the film manages to come through with a sweet, touching, and charming story.\n\nActing is top tier for the most part. Ranbir Kapoor proves yet again that he is the new leading man in Indian cinema. His performance of Barfi is touching yet subtle. He has a sense of charm and charisma that bleeds onto the screen. No matter what the character is doing, you can't help, but love him. Priyanka Chopra gives a career transforming performance. She's usually known as the beauty queen, but here she shows a lot of depth and understanding for her autistic character. I couldn't believe that this is the same person. The rest of the cast is good, but the one to look out for is Ileana D'Cruz, who made her Bollywood debut. Her character is emotionally disturbed and indecisive. She's likable and we can root for her.\n\nThe score and songs for this film are great as well. The score has a upbeat style to it that at the same time feels whimsical. It brings you back to an era of your own youth. The songs are equally as good. They are fun and super catchy. They drive their respective scene along and it helps glide over some of the melodramatic moments.\n\nOverall \"Barfi!\" is a fun and entertaining flick with a lot of heart. The story is well told and fairly original. The cast of characters are colorful and their respective actors do justice to their complex roles. Music is a driving force for this film and aids in each scene.  While the movie can get confusing and the third act feels a bit contrived, the film's charm and sweetness more than makes up for it. I give it 4/5, There's enough entertainment and lovable moments to overlook any missteps.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "barfi is a visual delight nd despite all d copied scenes, it works just fine as a love story.......i felt d movie nd even shed a tear. dats all dat matters\nP.s. hats off 2 priyanka for pulling off jhilmil",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi!, from the beginning, had every mark of an absolutely amazing movie. It's been long since I've seen such a beautiful movie. Seriously! \n\nBarfi! for sure is sweeping all the awards this time and there's no stopping that. I love the way the movie started with that song \"picture shuru...ho gayi picture shuru\".\n\nRanbir is such an amazing and versatile actor. I, personally, love the way Ranbir says \"BARFI (murphy)\". The scene where Ranbir Kapoor explains to Illeana as to why she rejected him is just top class acting. Oh! His mute acting is just so brilliant, so amazing.\n\nIlleana D'Cruz, yes, you are really cute. But Priyanka, without any glamour, steals the show. Ranbir and Priyanka overpower everything. Priyanka proves yet again how versatile she is.\n\nThe music gives a good feeling within. Yes, the background score was a rip-off or intelligently used or whatever but it was apt.\n\nI don't understand the critics though. They say \"the director's not content with a simple story\", \"he complicates the narration with confusing timelines\", \"there's a needless-who-dunnit subplot\" What is your problem? It's really easy to talk when compared to stepping out there and directing a movie! So I personally think sometimes you guys should shut the...\n\nThe movie has a good mix of acting, comedy, drama, love, background score, songs, little twists and turns and above all excellent direction! Anurag Basu is the real hero. Thank you for such a nice and a different movie. My rating - 10/10\n\nP.S - Yes the duration of the movie is around 180 minutes, yes the movie might seem on the slower side but each scene has its own depth and importance. Its been thought out, planned and directed really well.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most charming Hindi film i have ever watched. Love is blind and it shows. Accompanied by excellent cinematography and brilliant music, Barfi is a must watch for its sweetness and great performances from Priyanka & Ranbir.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi is a good movie. It entertains with its silence. Ranbeer Kapoor was good with his role. I liked it.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant cinematography and art direction...great use of music and silence in equal measure...an undercurrent of child like innocence that is endearing and makes it a must see...",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. What a film put together. Definitely a romance classic. Highly recommended. Goes to show, words are not necessary to express feelings. Film had comedy,  romance, and mystery.  A very deep felt story.  A must watch.  Barfi is a well example of a hopeless romantic.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, touching, funny, cinematically gorgeous, musically delightful... Must-see movie!!",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb performance by Ranbir as Barfi and Priyanka Chopra as Jhilmil.... and with a heart touching story Anurag Basu has given us a wonderful movie to watch..",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time.  Moving and powerful with a large dose of comedy.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ranbir really surprised me ...",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, in a nutshell I can say this movie is uh, extremely sappy. And touching. Acting is wonderful. Although some scenes are direct copies from other movies, the screenplay, the setting, and everything is just so, um let me say very very sweet. And the 70's setting is nostalgic too. Overall a must watch.\n\nP.S. Ileana D'cruz looks drop dead gorgeous! ;)",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a much fan if Bollywood movies for certain reasons. But Barfi proved me that there are still a ray of hope about acting and scripts in Hindi movies. Randir, Priyanga and Illenga were so impressive. Although some scenes were copied from Hollywood, it's a good movie to watch.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible visuals and acting with a beautiful storyline.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very mediocre movie, with some good camera work. The most annoying thing is the music. The Director is trying to copy some Iranian/French movies and did not succeed. I watched t for 20 minutes, got bored to hell, and annoyed by the background music. There are much better movies around worth watching and your time.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. As a writer, I salute the scriptwriter and director. An amazingly well done movie. This is a rich, very complex love story.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best India's movies so far. Usually India's movies quite stupid with that stupid overacting and completely lack of logic and stupid jokes. But not this one. Story is very touching, acting is very good and especially acting of Ileana D'Cruz just splendid, simple superb. Very good sound too. Although, sound doesn't look like genuine India's sound, but reminded to me music themes from latina's telenoveles and some Japanese movie, also that mysterious trio playing here and there reminded to me something from La Rue Kétanou. And of course there is still enough of overacting and a bit of nonsense not to get to the top but to stay at 8/10. And a time... 2 hours and 30 min it's a way too much!!! I have been forwarding... :)",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ranbir Kapoor and Priyanka Chopra shine in this must-see film. Don't miss it! In the age of all style and no substance, Barfi's simplicity is at the center of its effectiveness.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "spell binding direction plus cinematography,, but a slow drama",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dec 2012 - Mom\n\nAwesome movie, Ranbir was excellent!",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it! I know the prosthetics did not convince anyone that the characters got old, but the performances were very endearing - a charmer, I'd say; especially, Priyanka Chopra who isn't exactly my favorite Bollywood actress. She made me love her in this film. Darjeeling is lovely, as always. And though this kind of love, between Jhilmil and Barfi, may be quite whimsical, it's the kind of love that really makes you believe in love. And the music is as charming as everything else in the movie. Watch out for the street band that pops up from nowhere. A must watch Bollywood film.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though numerous scenes have been rip off from Hollywood classics (and even Hongkong!), this was still an enjoyable piece as a difficult attempt to pull off a film with very little dialogue (and any Hindi film watcher knows how difficult that is!). Ranbir is great, Priyanka was bold in her portrayal and Illeana was also quite good.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT Movie. Absolutely loved it and I have not cried like this in a long time ha ha ha. Thank YOU>",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A charming story! Excellent cinematography!",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike 99.99% of the Bollywood crap, uplifting, beautiful location and cinematography, a killer soundtrack to match, whats not to like ? Go watch.",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! Beautiful cinematography, storyline and acting. YOU MUST SEE IT!",
            "review_date": "2012-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So boring, i would rather have gone deaf than watch this movie.....",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi - CATCH IT (A-) \nBarfi, an unlikely love triangle of a normal girl, mute boy and autism girl. This is an unlikely combination, which Doesn't seems like to work in Indian Cinema but things have been changed and great success of Barfi proves that even if the hero and heroine are not stereotypical a good story can lead to utmost success.  Barfi is not a perfect movie, it was too long and becomes complicated as we travel back and forth between 1976, 1979 and 2012. Besides that life being so easy and cheerful for a mute boy and autism girl is hard to accept, there is a time they live alone for 6 months in big Calcutta city, he can't talk and she doesn't understand but apparently they are happier than ever, how they communicate with world is not explained. Anyways I know it's a movie and i should not go onto that much dept. So, kudos to Anurag Basu for making and attempting a brave subject matter. Ranbir Kapoor is great as always, though his performance is almost the same as in a movie \"Ajab Prem Ki Ghazab Kahani\" with Katrina Kaif \"where he tries to get her affection\". This time he was only mute. Priyanka Chopra did a fine job and looked the part. Ileana D'Cruz is a fresh faced beautiful girl. Standing next to too famous young actors and still getting noticed is a huge achievement. In the end, Barfi maybe long but it's fresh, beautiful and heartening.",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong performances from the two main stars and an inspired homage to the silent film era aside, the film suffered from slow pacing and a plot and romance that didn't quite click with me.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "v cute beautifull movie. .. priyanka's acting is mind blowing",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oscar material. Loved the movie. Emotional, full of laughter , excellent cinematography, acting, direction, music and story.",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally, a movie I can recommend. No one else can do what Ranbir Kapoor has done with this performance. PC gives a solid restrained performance. 5 stars to the director for making a semi-silent film so engrossing.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sweet charm, but has drastic tonal shifts that will leave you airsick.  So this is about a young man, who is both deaf and mute, on his search for love, only it may not turn out how you think.  While I am still looking for a Bollywood movie that I am head over heels for, this is definitely one of the better ones I have seen.  I watched this in two different parts, as there is an intermission, and I think that helped to improve my opinion of it; ultimately, it is a sweet story, and it's difficult not to be won over by it.  What I did like about it was the lead, as played by Ranbir Kapoor.  He brings a lot of charisma to the table without talking, and they pull off a lot of stunts that are akin to those of the silent era of film, and they really work.  It would have helped in a number of spots if I had any familiarity with sign language; you can get the gist of what is being communicated when they are utilizing it, but it is just like watching a foreign movie without subtitles.  Where Barfi constantly lost me is that it has these wacky, goofy scenes all played for laughs right next to these serious scenes about autism, and they don't really fit together.  It even reaches the point where the silly seeps into the serious, like our main character walking into a door after some stuff just went down, and it did get in the way of my enjoyment of the film.  It is also the type of movie where if you changed the music for any given scene, it would completely change the context of the entire story.  Still, it did finish off on a note that I genuinely loved, and I walked away feeling much more positive than negative.",
            "review_date": "2012-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a movie where a differently abled character is not shown as a saint, an always do-gooder and is having fun with his life. Very nicely done.",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the start I knew if would be a great film. After watching if I found out truly that if was one of the best films of the year. Deserves at least 1 watch!",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you can watch the first Half, The Second Half will take you on a Roller-coaster Ride . Ranbir's performance is the best in the movie. Watch it for Him :D\nThe Screenplay is Amazing , So the Cinematography !! 9/10",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You will see everything in this movie - love, passion, comedy,drama,suspense- Ranbir and Priyanka did an amazing job. Simply loved it :).",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the movie, loads of feeling, heart touching romance and comedy movie. Something different and worth it. Priyanka is brilliant in the role of a girl with autism... Would recommend to everyone...",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too bad it goes overlonged on the half last part. But after all, it's pretty awesome as tribute message with kind of Hindi's film signature.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun and funny, beautifully-shot film with a curious plot that also may amuse many viewers by capturing much of the whimsical spirit of 'silent films' from long ago.  It's made in Bollywood, but I think it goes well beyond the expectations that many foreigners may associate with the term \"Bollywood Movie\".  For me, there are some awkward elements to the plot,and I find it a bit  \"mushy\" for my tastes, but others might not feel this way at all.",
            "review_date": "2012-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi! Loved every bit of it! Beautiful story! Awesome cinematography! One of the best movie that I watched! RK was simply fantablous! 4.5/5 it is!",
            "review_date": "2012-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Barfi! is a performance-oriented movie, the performances by Ranbir Kapoor and Priyanka Chopra were, without a doubt, the best performances from Bollywood I have seen in 2012 so far. Screenplay is well-written, the narration is somewhat genius and the direction is outstanding. It's okay to think that many of the scenes have been copied from Hollywood movies but the execution also matters which is clearly upto par in this movie.",
            "review_date": "2012-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the film is a masterpiece...loved this movieâ(TM)¥",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Hindi movies ever! Very impressed with Ranbir Kapoor and Priyanka Chopra's acting!!!",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hats off Priyanka! TOUCHIN' story...but cnt call it a total success! Scenes were scrambled n i felt like solvin' a jigsaw...bdw dis one got homework for audience too!",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}