{
    "rating": 8.6,
    "release_date": "2012-09-21",
    "num_reviews": 710,
    "genres": [
        "Crime",
        "Drama",
        "Action"
    ],
    "summary": "Longtime LAPD partners and friends, Brian Taylor (Jake Gyllenhaal) and Mike Zavala (Michael Peña) patrol one of the most dangerous neighborhoods in Los Angeles. Though they may bend the rules, their honor and dedication to the job are unquestioned. Taylor and Zavala always have each other's back, even if Taylor's surreptitious filming of their daily activities for a college course is a bit ill-advised. All hell breaks loose for the officers when they run afoul of a vicious Mexican cartel.",
    "reviews": [
        {
            "content": "A boohoohoo cop show. 🤮",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "The best buddy cop film and best cop film ever made this film deserves so much credit and the cast just play off each other perfectly",
            "review_date": "2023-04-16",
            "source": "rt"
        },
        {
            "content": "Realistic Adventurous and Entertaining",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "This is a movie, which just about avoids being ordinary. Apart from that, there's no massive surprises in there, but good production values, and good performances by both the lead roles.",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "Watched this with no expectations but it wasn't long before I was hooked, the chemistry between Gyllenhall and Peña is superb .\nA really enjoyable watch",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "Great acting by both main actors! Laughed, cried, was on toes etc. keeps you locked in!",
            "review_date": "2023-02-16",
            "source": "rt"
        },
        {
            "content": "Greatest cop movie ever! The writing is phenomenal! The actors followed around LAPD officers for 6 weeks to get a feel for the job. The camera switching between their cameras and a cinematic camera is genius.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "Still dont like cops but good movie",
            "review_date": "2023-01-09",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made. Period. The dialogue is organic and authentic, and the story rocks!",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "this movie is the best cop movie I've ever seen. now i understand why cops don't talk about what they saw at work with their families.",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "6 years ago- Filled with gritty action and chilling visuals, the film is elevated by letting all of this fall to the side to allow the film to focus on the charismatic performances of Pena and Gyllenhaal and their chemistry.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "The constant suspense and homemade feeling of the movie kept me on the edge of my seat wondering if they would make it out alive of their calls. It truly shows what LEOs go through during their day-to-day lives.",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Great action, all on cams. Jake Gyllenhall usually doesn't disappoint.",
            "review_date": "2022-05-31",
            "source": "rt"
        },
        {
            "content": "Sonic I love the king king lord king of",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "Tagging along on patrol on a candid camera",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Really good crime drama. The only issue, as is usual in Ayer films, is the supposed gangsters and street slang... overacting big time, not believable.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "* 89/100 -------------",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "It's a decent story but the cinematography I didn't like and subsequently couldn't get into the film",
            "review_date": "2022-01-30",
            "source": "rt"
        },
        {
            "content": "Its predictability is met with an originality of approach that makes End of Watch a memorable journey.",
            "review_date": "2021-11-29",
            "source": "rt"
        },
        {
            "content": "David Ayer's best film by a country mile.",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Copaganda at its finest",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "Hard, dry and gritty.",
            "review_date": "2021-10-02",
            "source": "rt"
        },
        {
            "content": "This is a must see movie, there's so much real life in this one. I fell in love with it.",
            "review_date": "2021-08-07",
            "source": "rt"
        },
        {
            "content": "I went into this film expecting a standard action flick and instead was treated to an emotional rollercoaster. Both the leads knocked it out the park by creating grounded characters that feel like real people who are doing a very difficult job.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "Amazing how 10 years changes your perspective.  This fawning love tribute to the LAPD would never get made today.  All the cops are noble hero's, except the one female that can't hack it.  All the criminals are black or brown.  All the offhand misogynist or racial slurs are ok, because we love each other.  Gyllenhaal is good, as always.  After that you have the stock Mexican-American character aptly filled in by Pena, although not much to work with.  Anna Kendrick does what she does best; filling in a cardboard cutout of a pretty girl next door cop wife who looks good in a dress and cries a little.  A big waste of time and the shakycam found footage aspect is annoying (someone asked me if we needed to reset my router to improve the streaming quality).",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "How can we ever trust cops again when they tell us things like; \"The best coffee is a Starbucks coffee.\"",
            "review_date": "2021-06-02",
            "source": "rt"
        },
        {
            "content": "The handheld style is distracting at the best of times and fully a sidetrack at the worst, but this is a nice buddy cop film. Pena and Gyllenhaal work really well together. Kendrick does well in the few scenes that she has and really builds a strong relationship with the main character. The film mainly focuses on procedure and the daily beat of the main men, but provides action in an effective manner. The events leading up to the climax are muddled, but the final scenes pack a real punch. The muddle comes from the existence of a few stock antagonists that contrast in colour and depth to the the complicated and fleshed main pair. This leads, ultimately, to a film where the police force is almost canonised in favour of tackling the unnuanced ugliness of their surroundings. While putting the focus upon the human sides of police officers is by no means a negative objective, one cannot help but feel that the interchangeability and randomness of the main physical conflict detracts from what still is an immensely serviceable cop action-drama.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "Hip and visually stunning the film focuses on two LA police officers thorough a documentary film footage approach. Both funny and extremely violent the film ages well and remains one of the best cop films of its day.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "don't watch this if you want to be cheered up - it was pretty morbid all the way through - made like a documentary but I found nothing much to like about it am afraid",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "kickass action non-stop that's what i like to see, wish Jake had some hair on his head tho",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "Loved the comedic, gonzo element to this. Then you have the hardcore LA violence that's quite realistic. Nice pairing in Pena and Gyllenhaal, more of the same please.",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "this movie made me laugh made me cry. both great actors  in a great movie",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "It has some pretty exciting scenes but it's a little too straightforward for me. It also has a bit too much of the hero-cop worship so maybe I'm not the particular target for this kind of film. It's not bad but I kept expecting it to be more than just a very dramatized look into the life of a couple officers. It's a little longer than it needs to be. I doubt I would watch it again.",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "This was not a good movie but a great one and no cap I teared up at the end.  It shows such a gritty look into what it takes to be a cop and was shot in a cool way as well, this is a movie everyone should watch.",
            "review_date": "2021-03-04",
            "source": "rt"
        },
        {
            "content": "Girato praticamente dall'inizio alla fine con la tecnica della camera a mano, può far venire mal di mare per le immagini traballanti, ma presenta con forza una costruzione del personaggio da non sottovalutare. E' questo l'aspetto del film più convincente, sostenuto da dialoghi essenziali che consentono una presentazione più efficace dei personaggi e, di conseguenza, all'inevitabile connessione emotiva con lo spettatore.",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "End Of Watch è un meraviglioso ritratto di una coppia di poliziotti in uno dei quartieri peggiori di LA.\nIl found footage funziona alla perfezione, regalando estratti rapidi e potenti, dell'ordinarietà della vita dei protagonisti; i dialoghi sono incredibilmente scorrevoli e divertenti.\nIl finale colpisce come un pugno, e l'estratto posto come ultima scena è allo stesso tempo divertente e straziante.\nRegia pulita e magistrale, Gyllenhaal e Pena sono perfetti insieme.",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "Brilliant movie. Very authentic, action packed and emotionally satisfying. Great chemistry between the leads.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "This movie is great! Got some new respect for cops. Jake did an amazing job. Michael Pena is amazing too. Their chemistry is so noticeable. Its real, contemporary, tense, action-packed, exciting and funny",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "Spoilers!  \nWhile as expected one (or both) would not survive the film, this was a portrayal of bromance built under (literal) fire and a joy to watch. Great actors, great acting.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "As a fan of gritty crime dramas this will give you an entertaining watch. Like how almost it feels like a doc. Good actors but didn't really age as well next to a training day.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "This movie sucked. One long eyeroll of a movie.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "Ride of a Lifetime: Review of End of Watch\n\tAction packed and a mix of emotions, \"End of Watch\" keeps the audience on their toes at all times. This eye catching movie makes it hard to stop watching even for a second. As we dive into the movie, we experience up close the day in the life of two LAPD gang department officers, Miguel Zavala and Brian Taylor. This duo has their own take on a typical day policing their assigned neighborhoods, and Taylor does not hold back on giving the inside scoop of everything as he films various encounters for his film class. \nThe main thing that sets this movie aside from so many others is the way in which it was filmed. Instead of a typical relaxed, steady film, we have scenes that jump from one to another without leaving any gaps in between for anything. Zavala and Taylor will be at their morning meeting one second and will be knocking doors over and discovering gruesome crime scenes within seconds apart! The jumps from one scene to another works in favor of the film since it presents it in a way that the viewer feels that they too are living in this hectic police officer type of day when one second you can be cruising and everything is fine, and the second you can be part of a wild goose chase with a guy who just ran a red light. \n\tOfficers Zavala and Taylor's work is not only action packed police calls most street cops would never go to throughout their whole career; it is also a ride of a lifetime which ultimately determines the fate of both cops. This duo goes above and beyond their job requirements, they look further into cases and ‘normal' traffic stops which earns them great recognition and they search for any slight clue that might bring them closer to make the neighborhood a safer place. \n\tThese longtime partners go through everything together and do basically everything together ranging from Quinceaneras to weddings, all the way to responding to calls in one of Los Angeles' most dangerous cities. These officers are not afraid to bend the rules slightly in order to do the best that they can to protect the people in their city, so much so that when one of them runs into a burning house on fire, the other one goes right behind him as if there's no tomorrow without a second guess as to why they are running into the house instead of waiting for the firefighters. \n\tThe emotional connection that this movie draws between the audience and the storyline is much to real to ignore. This movie feels like it can be relatable to many different people whether you are thinking of joining the police force or not. This movie shows just how genuine a friendship can be and how strong a partnership can and should be as well. Throughout the movie there are many instances that may foreshadow events that may happen in the near future, some good and some that are not the very best. This movie is important because the meaning of it and the message taken out of it is so increbibely enriching that it is not easy to forget about afterwards. \n\tOverall, this movie was beyond a feather of doubt jam packed with everything that a five star movie should include and should display throughout itself. The emotion packed into each and every scene transforms this movie from a typical Hollywood movie into a jumpy and vlog style type film which is extremely lively and exciting to watch. The dramatically different style of film depicted the hectic type of lifestyle that comes with being a law enforcement officer. Also, the amount of dedication shown for the job by both officers is immaculate. I believe that this movie was made specifically for people that needed that extra push and that extra motivation in order to be the best version of themselves possible. The tragic and extreme twist at the end of the story is a huge eye opener, not only to the characters in the movie, but also to the audience that has been following along with the police officer's daily assignments and phone calls.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "Great acting by both leads. Without these two great actors as leads, I would not have been so invested.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "If you ever want to watch a cop movie then this should be the first one you watch or show to someone. It's such a raw and powerful movie. Some people may not like how it's filmed but I love it. It's shot documentary style but by doing that it brings you in with our lead two characters so much more. The whole film is based around them and their day to day life on the beat in a really dodgy L.A. neighbourhood. What these two see and have to go through each day is tough on anyone and they both show a ton of restraint and resiliency that I'm sure most people would wish that cops in the real world would show as well. \n\nThis film is really a character study on officers Taylor and Zavala. We get really close and personal with them and get to see how tight they are as friends and not just partners. They basically share their lives together and go through some of their toughest moments together. Despite going through some horrible things the one thing that is never questioned is their friendship. This in a way is the ultimate buddy cop film. It only makes what happens during the events of the movie more gut wrenching. It's also a testament to how great the performances of both Gyllenhaal and Pena are. Pena in particular I've never seen in such a great role. We are really drawn to both these characters and as an audience are emotionally invested in their fates. \n\nWith everything going on in the world at the moment cops get a tough time. Some obviously deserve it but this film shows that some are good people and heroes as well. This movie just feels so realistic and it's refreshing to see. It doesn't need the big budget and ridiculous stunts and cheesy back and forth. It feels like a real friendship and real scenarios that could happen. You're invested from minute one up until the last moment. \n\nOne thing I will say is that if you don't like a tough watch emotionally this may not be for you. If you fancy a good cry though then this is definitely the film for you. End Of Watch is a phenomenal movie and it's inclusion on this list was never in doubt in my mind. Director David Ayer absolutely nailed the presentation and the performances speak for themselves. This film is an absolute necessity. \n\nCheck out my site LifeLowdown.com for more Film & TV news!",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "brutal action which follows 2 patrol officers as they go through their days. lots of strong language, brutality, mass murder and some damn good shoot-outs. when the finale rolls around we see why it carries the title. highly recommended.",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "End Of Watch pretty much throws every cop drama trope out the window with its no-nonsense approach, as it walks a fine line between sensitive and unfiltered. What's left is a stripped-down, gritty and brutally honest portrayal of law enforcement stuck in a never-ending war on crime.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "David Ayer nos brindó el guión de \"Training day\". Aquí escribe y dirige de muy buena forma, una de las mejores películas policíacas de los últimos años, guardando mesura obviamente. De manera muy convincente Jake Gyllenhaal y Michael Peña interpretan a 2 policías que se ven envueltos en problemas con un cartel de drogas por su alto sentido del deber.\nLas escenas de acción están muy bien logradas, los diálogos y situaciones son muy realistas y nos muestran el lado violento de la ciudad de Los Angeles.",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "Mostly good with the exception of the completely implausible ending. There's no complete story here. No narrative arc. And the ending is 100% bullshit. An otherwise good movie that just didn't get there.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Real buddy cop tear jerking movie with Amazing action and hints of humor.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "well shot but deeply depressing. The supporting staff is not given much to do. The entire thing feels gimmicky.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "This film is an example of when an idea barely breaks the surface. I'm not entirely sure which idea this film was trying to convey: is it your typical, undercooked cop action film or is it meant to be a body of work that attempts to show a realistic, humane side to officers of the law and the dangers they expose themselves to? Regardless, the film falls short in more ways than one: the characters are severely underdeveloped, there are some cringeworthy scenes that are both unnecessary and drag on far too long as well as the build-up towards the film's conclusion was beyond lacklustre. You can tell in several instances that the developers of this film were trying to provide something impactful and hard-hitting but it's because of my aforementioned gripes that this film did the opposite of what they intended to do. The handheld, \"Cloverfield-esque\" filming style is a plus, given the fact that the characters have body cams and camcorders to add different points of view between characters--but it seems unrealistic in some scenes. Are we expected to believe that cops are filming themselves with handheld cameras during a shootout? Please...how can you even attempt to make a realistic film when a large percentage of it is the opposite? To conclude, this film could've done more but it seems that the writer, director and other developers settled for less.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "What makes this movie are very strong performances by Jake Gyllenhaal & Michael Pena & their great chemistry together. The script itself is good but very predictable and isn't anything we haven't seen before.",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "Such a great movie!! Laughs and Shocking surprises",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "I really like this movie. The story is rich and the character are fanstactic. I really recommend this one. I just have one issue with the way the movie is filmed.. There's too much shakiness at time.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "The realism, relationships and emotion of this movie makes it an absolute must see!",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "This movie brakes me every time .... 💙➖👮‍♂️",
            "review_date": "2020-05-14",
            "source": "rt"
        },
        {
            "content": "The style of the movie made it impossible for me to get invested in it. It was very distracting for me. If it was shot in a traditional manner/style, I would likely have added a few stars.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "More raw emotion in this than I expected and thought the style worked well, however in a technical sense there were a few big problems here. 6.5/10",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "I didn't want to like this movie. It feels in the beginning like a buddy cop movie. But sticking with it gives you a better pay off and the surprise ending made me love it.",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Great movie :) love how it's in documentary style!!!!!",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "The best cop movie I've ever seen in my life. So real, so gritty, it makes every other stereotypical cop movie look like farce. Gyllenhaal is great, but Peña steals the show in his tour-de-force performance.",
            "review_date": "2020-04-05",
            "source": "rt"
        },
        {
            "content": "This suspenseful and dramatic action movie met all of my expectations. The perspective is almost entirely from the main character's camera (Jake Gyllenhaal); I highly enjoyed seeing this movie from that lens, and it made it seem as if it was real life and not the movie screen. On top of the beautiful screenplay, the cast for End of Watch was outstanding, especially Jake Gyllenhaal's and Michael Peña's performances, who adjusted to their roles as South LA Policeman perfectly. The conclusion of this movie was the best part, and it was perfectly scripted and executed by the cast. The only critic I would make of this movie is that the plot was unclear until the end, which left the audience confused at the beginning. Overall, it was a very impactful and dramatic movie, and I would not recommend this to an audience under 15 years of age.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Very entertaining. Great at executing comedy and drama and easily makes transitions between the two. Very lovable  characters thanks to the great writing and acting.",
            "review_date": "2020-03-15",
            "source": "rt"
        },
        {
            "content": "The film style is rather nauseating. Would have preferred it shot more traditionally. The film style does make it feel more real, but I can't get past the constant movement.",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "Film policier qui se veut ultra-réaliste. Encore une fois Jake Gyllenhaal au top.",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "The plot is the only thing that gets in the way of what this movie does best: the back and forth and genuine chemistry between the leads.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "'End of Watch' (2012)\n\"Longtime LAPD partners and friends, Brian Taylor (Jake Gyllenhaal) and Mike Zavala (Michael Peña) patrol one of the most dangerous neighborhoods in Los Angeles. Though they may bend the rules, their honor and dedication to the job are unquestioned. Taylor and Zavala always have each other's back, even if Taylor's surreptitious filming of their daily activities for a college course is a bit ill-advised. All hell breaks loose for the officers when they run afoul of a vicious Mexican cartel.\" 'End of Watch' is a raw and realistic take on the found-footage and crime/drama genre. It blends comedic and everyday situations into some gritty underworld scenarios that we find our two leads in throughout the events of the film. This really serves as a testament to law enforcement, the brutal realities and highs-and-lows that they can face. Pretty much all of the cast does excellent jobs here, coming off perfectly authentic and believable for the purpose of the film. Jake Gyllenhaal is great as always, Frank Grillo, Anna Kendrick, and David Harbour are also exceptionally real here; although the big surprise for me was Michael Peña. I was never a very big fan of him as an actor, but I can easily say this is his best role and he really brought a lot to this film. As far as more of the technicalities go, it's shot in very true-to-life fashion. The cinematography overall is good and much it is actually shot in dash-cam or POV camera style, which adds to the authenticity. It can however at times feel a bit too jarring for its own good. There's also quite a bit of shaky cam when it comes to the action, even when it's not shot from POV perspective, and that was pretty disorienting as well, but I admit it still suited the nature of the movie. Its depiction of everyday life for law enforcement, as well as its dark and light contrasts was really captivating and portrayed respectably. It takes you on an emotional rollercoaster of laughter, sadness, anxiety, and even some gruesome and mortifying moments. My only real quarrels with 'End of Watch' involves much of the lesser cast and supporting characters. A lot of their acting just didn't come off convincing, perhaps even trying a bit too hard at times. Also the plot really doesn't have a set path, it seems to meander and deviate into a lot of very separate events, which some may ultimately see as having lacked focus. I'm a bit in the middle when it comes to the storyline, I enjoyed the random everyday events that our leads find themselves caught up in, but I also tend to prefer a concise and set plot-line for films. There isn't a whole lot more I can delve into without entering spoiler-territory, so if you're a fan of the found-footage genre, or just looking for a solid crime/drama blended with comedy, then you will certainly like this one.\n\nMy Rating - 7/10",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Thrilling, genuinely funny at times, and very emotional. This movie does a really good job of making you understand what it's like to be a cop in gang-infested cities.",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Its flawed. But its also ingenious realistic and engrossing",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "Great story. Loved seeing all the different perspectives. Main characters rubbed off on the audience throughout the film using their brotherly bond made the audience genuinely care for them.",
            "review_date": "2020-01-18",
            "source": "rt"
        },
        {
            "content": "Super unnerving. Very great at setting up serious and violent energy. Intense to the highest degree with some nice lighthearted moments intermittent throughout. Great characters thanks to their actor's performances. David Ayer's direction is amazing. The shots are great and set up in very close shots of the handheld variety. Some shots don't make sense as Brian should be the only cameraman. The ending had me in a multitude of tears.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Watched 1/7/20.\n\nThe ending is a rough one, but all the characters do a great job in their roll.",
            "review_date": "2020-01-08",
            "source": "rt"
        },
        {
            "content": "It may not make for easy viewing. But End Of Watch has compelling characters and heartfelt drama to keep the viewer from turning away. ",
            "review_date": "2020-01-03",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the better movies I've ever seen! This movie was comedical, gritty, and meaningful. The viewers are drawn into the life of two LA police officers as they go through their day to day as well as uncovering a deeper plot within the city. By the end of the movie the viewers are absolutely attached to the characters and the wonderful relationship that Peña and Gyllenhaal present onscreen. Although some people might not appreciate the shaky-cam and mock-umentary style of this film, it adds to the grityness and reality of the characters on screen. Great acting, great plot, great meaning--all around a great film.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "Great acting, very tight writing, and a nice blend of action, comedy, and pathos. This is a great cop movie for the intelligent viewer.",
            "review_date": "2019-12-25",
            "source": "rt"
        },
        {
            "content": "This movie was refreshing and had a sense of realism...in a sense. A certain fight scene was over the top, but \"keeping it 100\" in that sense does ironically happen. Still enjoying the movie 7 years later.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "Interesting take on the cop-buddy movie. Dedicates most of the film to the relationship between the two leads with occasional moments of intense violence. There is a bit of an overall plot tying things together, but it is really a story about the bond between the characters.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "Best cop film of the 2010s definitely a must see.",
            "review_date": "2019-12-14",
            "source": "rt"
        },
        {
            "content": "The worst part of End of Watch was literally the end of the watch....",
            "review_date": "2019-12-13",
            "source": "rt"
        },
        {
            "content": "Estas peliculas son las que me gustan, muy recomendable, realista y en algunos momentos divertida. 5 estrellas .",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "So this is around a 3 and a half. It was actually quite interesting, how it speaks to today, but alittle boring at first. But it does the unexpected later on, and suprises.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "I'm surprised I didn't really hear anything about this. One of the best police films since colors in my opinion.",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "Realism is key in this film as is the strikingly unique and quite poignant acting from both Pena and Gyllenhaal.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "Moved!  Great chemistry between the two leads accompany an engaging story and the result is moving.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "The chemistry between Jake Gyllenhaal and Michael Pena is what takes this film home.",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "End of watch is a gritty drama on the daily life of cops with the dangers and friendship and brother hood that cops deal worth and was this was portrayed by gyllenhal and Pena and the rest of cast and the story written excel at by Ayer the director ",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "With a story that is hilariously charming while also painfully true and a solid (if somewhat strained) ending, End of Watch not only overcomes its genre clichés with great ease, but forms possibly one of the top ten cop thrillers ever.",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "This movie is phenomenal!! Both Pena and Gyllenhaal should have won an Oscar. I never leave movie reviews, but I had to for this movie,  it was that good.",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "Great movie, Non-stop believable action. Not your typical action movie, it has some depth. Highly recommend",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "Overall not bad. I have a hard time believing so many people with machine guns can't hit a couple open targets running in an empty room sone 20 feet away. Or that they would be so incompetent as to not confirm their kills... without spoiling much, it suffices to say there are some flaws in the realism here despite it being shot like those found footage movies. It won't make your top ten list by any stretch but it's worth watching.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies for some reason.",
            "review_date": "2019-09-23",
            "source": "rt"
        },
        {
            "content": "A descent movie. I loved watching it. Writing could have been a little but better but it showed what it wanted to. It never got off track  ",
            "review_date": "2019-09-21",
            "source": "rt"
        },
        {
            "content": "A good duo at the forefront of this thing, but I don't especially care for the half-assed documentary schematic or, you know... cops.",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "Pena and bubble-boy as good cops vs life in general. The string of baddie incidents were a tad coincidental but this is always a great movie to watch Ayer in true form.",
            "review_date": "2019-08-20",
            "source": "rt"
        },
        {
            "content": "\nApart from the good atmosphere achieved by editing and photography, the interpretations of Jake Gyllenhaal and Michael Peña are convincing and with personality - their characters are well built in the script -, loaded with strength and authenticity, with good chemistry and complicity between them.",
            "review_date": "2019-08-04",
            "source": "rt"
        },
        {
            "content": "Filmed like a found footage movie. Great relationship and chemistry between Jake Gyllenhaal and Michael Pena. Great story telling and writing. Great acting.",
            "review_date": "2019-07-20",
            "source": "rt"
        },
        {
            "content": "This movie felt so realistic and genuine thanks to Jake Gyllenhaal and Michael Peña's amazing chemistry",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "Amazing movie. I enjoyed every bit of it and I am so glad it exists. I don't want to give any spoilers but it's worth it so much to see.",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "This was an emotional roller coaster and I hate my self for watching this movie but it was beautiful and touching , David Ayer made this movie with passion rather than a ordinary job he just took .",
            "review_date": "2019-01-10",
            "source": "rt"
        },
        {
            "content": "Some of the best character chemistry of any movie. The ending is powerfully moving.",
            "review_date": "2018-12-31",
            "source": "rt"
        },
        {
            "content": "Very Intresting and very enjoyable",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "Probably one of the best cop movies I have ever seen and without a doubt this will make you think about the men and women who go out on the streets everyday and risk their lives for our safety.",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "Showcasing the grim, nitty-gritty realities of work as policemen in a unique documentary style, this film strikes an incredible balance between a buddy-cop tone and a raw narrative of the burdensome tasks of police officers. From the captivating performances of Gyllenhaal and Peña that developed emotional connections with the audience, to the distinctively exceptional cinematography and editing, I was left with an even deeper appreciation for our men and women in blue.",
            "review_date": "2018-12-10",
            "source": "rt"
        },
        {
            "content": "Great movie.  New Classic.",
            "review_date": "2018-12-05",
            "source": "rt"
        },
        {
            "content": "Strengths: If you're going to do a movie that completely focuses on the relationship between two friends, you must make sure they're casted right. Jake Gyllenhaal (Brian Taylor) and Michael Pena (Miguel Zavala) were great together. They were fun in almost every scene and you genuinely felt like they were best friends. Their chemistry was the star of the film. Anna Kendrick (Janet Taylor) was great as always, while Natalie Martinez (Gabby Zavala) was a strong supporting character. Director David Ayer gets how to do cop movies and this is some of his best work. Opting to have some of the scenes shot from Go Pro style cameras being used by the officers made for a unique experience. The film is ripe with tense and emotional moments all throughout. It's one of the more memorable police dramas I can ever recall. The closing scene is unforgettable and blew me away, taking turns I never expected or saw coming.\n\nWeaknesses: As cool as I felt the handheld camera stuff worked in some cases, it felt overused. There were times we saw it when it wasn't really needed. Though the movie doesn't even reach two hours, a handful of scenes feel like they're just there to fill time. As great as the closing action scene is, the way the movie cuts back for the very final scene feels odd. It just shows a moment of friendship between Brian and Miguel. It's nice, but it doesn't add much to the characters or their relationship and seems like a lesser note to finish it on.\n\nOverall: The movie ends on a weird note and has some moments that don't quite click. That still doesn't keep it from being a great film. The two leads worked extremely well together and there were so many emotional moments that you can't help but be captivated.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. There is action, funny, and very intense scenes. Highly recommended!",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "Simply the best cop movie ever made. Walk the beat with two of LA's finest, in the most dangerous section of LA, and see what it's like for really, really good people to make the rest of our lives normal and safe. The film has the gritty feel of Saving Private Ryan, as if we are there; doing what they do. The acting is so good, too. You see police, not well known actors. A heartfelt thanks to our police. God.Bless.Them.All.",
            "review_date": "2018-08-24",
            "source": "rt"
        },
        {
            "content": "An overall tension throughout the movie, charismatic characters, rewatchable.",
            "review_date": "2018-05-27",
            "source": "rt"
        },
        {
            "content": "i did not write the law..\n\nEnd Of Watch\n\nThe affection of the writer; David Ayer, towards the suffering and the routine that police goes through is crystal clear in here as the urge to install intense high pitched dramatic sequences is something that helps in its account but also wears it down. David Ayer's smart concept to project it through each perspective is admirable but unfortunately doesn't go as anticipated because of its wafer thin script and undercooked characters (not the lead ones). Jake Gyllenhaal and Michael Pena are brilliant in their parallel lead role and so is Anna Kendrick in a supporting role although she doesn't have much to factor in, among with other cast. End Of Watch has its strength (the chemistry between the lead actors) and moments (the burning house sequence) where the audience cannot not be moved by it, but the series of events feels redundant in the end as it fails to bind it all.",
            "review_date": "2018-05-01",
            "source": "rt"
        },
        {
            "content": "Great movie!!\nWatching this movie made me understand why Trump wants a wall. Lol",
            "review_date": "2018-04-24",
            "source": "rt"
        },
        {
            "content": "The movie has some action scenes but there is more at the end. Overall the movie is good and funny at times when the main characters are at the car talking about different things. The two\n cops also have a strong relationship as friends which makes the acting also good.",
            "review_date": "2018-04-22",
            "source": "rt"
        },
        {
            "content": "Excellent movie! A must see!",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies. The Lead-Roles have so much depth. The story is unbelievably strong. Go through the eyes of 2 men who play as young LA police officers that get caught up in a fight with the most dangerous drug cartel in the US. The story is so gripping, it will have you laughing, cheering and feeling sad throughout.  Recommend to all people who love a good story and love the 'drama' genre.",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "More shaky cam than I generally care for.  Both Gyllenhaal and Pena were excellent.",
            "review_date": "2017-12-12",
            "source": "rt"
        },
        {
            "content": "Utter crap. Zero plot, nothing actually happens. Just lots of average banter full of \"fuck this\" \"dude\" that. Over an hour in and still, if you can believe this, the action with the cartel happens. The whole point of this film is squeezed non sensically in to the last 10 minutes.",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "One of the top five police movies I have ever seen. The style of the filming made this overdone genre fresh again and all actors did a good job down to the scumbag gangstas. I would love to see a sequel or other movies in the same style.",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "Exceptional action film using (what appears to be) mostly handheld cameras.",
            "review_date": "2017-10-05",
            "source": "rt"
        },
        {
            "content": "Its a great movie! It looks like its a real life documantry! I recommend watching this even if your in 2017.",
            "review_date": "2017-07-04",
            "source": "rt"
        },
        {
            "content": "Well built characters mixed with great action and filiming techniques made this an outstanding movie, truly good",
            "review_date": "2017-06-29",
            "source": "rt"
        },
        {
            "content": "I made an account just to rate this 5 stars. This movie was funny,thrilling, and emotional all at the same time i loved it. one of the best god damn movies ive ever seen.",
            "review_date": "2017-03-17",
            "source": "rt"
        },
        {
            "content": "The buddy cop dramedy revisited and made relatable by the spot on performances on it's lead players. The plot setup is somewhat far fetched but its nada but a thrill rise after all. And while not Hope and Crosby, the banter often is not too far from them either.",
            "review_date": "2017-03-17",
            "source": "rt"
        },
        {
            "content": "If you can get past the constant swearing and shaky cam this isn't a bad film, but not really a good one either in my opinion. It is quite predictable and doesn't really show either the Police or the people they are catching in a good light. If real life is like this in the US I'm very glad I don't live there.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "A well acted, brutal film emphasising the friendship of fellow policemen. The filming style is questionable with a handheld feel though why there would be a character with a camera in some instances is questionable. It's best not to get bogged down in that (such as why a member of a gang seems to be recording their illegal activity)  and enjoy the film for what it is.",
            "review_date": "2017-01-24",
            "source": "rt"
        },
        {
            "content": "I may be biased because I'm a cop, but this is one movie I can watch over and over again.  The plot is a basic, yet incredibly twisted one.  Seeing as there is an actual war on cops these days, this movie was ahead of its time.  In terms of being authentic; from an actual police officers point of view, it is just that.  There are some parts (apartment fight between civilian and cop), that don't quite pinpoint the realism of police work.  However, the interactions between Zavala and Taylor felt very real and the camaraderie was all on point.  The story is excellent, the realism is there.  The only real gripe I have is that the \"bad guys\" could have used a better backstory.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Im quite a fussy movie goer & I don't like many. But this movie is one of the best I've seen and is the only that has ever brought a tear to my eye.",
            "review_date": "2016-12-30",
            "source": "rt"
        },
        {
            "content": "AMAZING!!!!! I have seen it over 20 times, and it never gets old. One of those all time favorites for sure!!",
            "review_date": "2016-12-03",
            "source": "rt"
        },
        {
            "content": "An excellent cop film that shows what the warriors in blue go through each day. Props to David Ayer for showing us what it means to be a cop in the real world.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "Really good film about a couple L.A. cops and the various things that they have to deal with in the course of duty. Certainly not your usual cop drama.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "The hand-held video style is initially annoying, but as the subject matter is interesting it get less so as the movie progresses.",
            "review_date": "2016-09-15",
            "source": "rt"
        },
        {
            "content": "An excellent addition to the found footage genre, that perfectly contrasts the highs and the morbid lows of the lives of two LA cops. What could have very easily turned into another Buddy cop film manages to maintain the audiences investment throughout, due to great performances from the leads and support cast alike.",
            "review_date": "2016-09-09",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen in a while, throughout the movie you start to care for the main characters the acting was just that good. It was a mixture of comedy action, and honestly the ending was just too sad. But it gets a solid 5 stars from me",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "Pretty good. Keeps you interested.",
            "review_date": "2016-08-13",
            "source": "rt"
        },
        {
            "content": "We follow the lives of Brian Taylor and Miguel Zavala, two members of the LAPD, as they accomplish their job of protect and serve.\n\nEveryone has an actor that has makes you excites you for a film or makes you watch a film that you have no interest, and one of those actors for me is Jake Gyllenhaal, so I watched this film when it came out but now with \"Suicide Squad\" approaching I wanted to see David Ayer´s directorial style so I rewatched this 2012 film and I have to say it wasn't as bad as I remembered. \"End of Watch\" has two solid and charismatic performances by Gyllenhaal and Peña, the pacing is more than solid it is consistent, the two main characters have believable chemistry, the comedy is actually funny or at the very least charming, and its action sequences are more than exciting thanks to its mashup directing style (this is found footage mixed with documentary and standard), particularly the ending. But regardless this film has many problems. The acting of the supporting cast is just awful (it feels like they waste their budget on getting Peña, Gyllenhaal and Kendrick so they only managed to get cheap actors for the rest of the cast), it has tonal issues as you can literally go from our two lead laughing and hanging out to LA violence, the story comes off as rushed as many of its scenes don't feel intertwined and the editing doesn't help either (while I respect the fact that Ayer tried to go the opposite direction of the corrupt cops from \"Training Day\", this script is just poorly written and more than predictable), and its directing style comes off as obnoxious very often. Granted it works in the action sequences when there is shaky cam or you cut from a handheld shot to an average shot scene (where the camera is placed correctly) it disorients you. \n\n\"End of Watch\" is an interesting failure that while I give full props for trying to tell a grounded story of the LAPD in the most realistic way possible, it still has a rushed story and its directing style doesn't completely work and will take you out of the film in more than one occasion. Nice try Ayer but not nice enough as other than the two leads and the found footage like style there isn't much to say about this film.",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "Solid, well paced and emotional.",
            "review_date": "2016-07-27",
            "source": "rt"
        },
        {
            "content": "Thrilling, intense and incredibly funny, with fantastic chemistry between the two lead actors: Gyllenhaal and Peña, \"End of Watch\" is a great action time.",
            "review_date": "2016-07-24",
            "source": "rt"
        },
        {
            "content": "A must see almost disturbing ride along with Jake Gyllenhaal and Michael Pena as LA cops in one of most enjoyable catch all the action pulse pounding action movies ever made!",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "Entretenida,para psar el rato 6/10",
            "review_date": "2016-07-03",
            "source": "rt"
        },
        {
            "content": "gritty and moving. \nexcellent performances\nWell shot. A genuine feeling of being a part of the story",
            "review_date": "2016-06-24",
            "source": "rt"
        },
        {
            "content": "Thrilling, gritty and incredibly acted.",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "With a perfect duo and some gritty visuals, \"End of Watch\" will manage to surprise its viewers with its realism and thrills.\n\nThis is the story of two police officers who continually dig up a deathly operation, which soon puts them at the center of attention and a target for one of the deadliest drug gangs in all of California. \n\nI still hold to this when I say that \"Jake Gyllenhaal\" is one of, if not the best male actor in cinema today. I truly mean that and the proof is all of his performances. He's been in so many amazing films in the past few years and has excelled in all of them. The way he's able to take on so many different roles makes him a quadruple threat and this is yet another impressive film to add to his resume. His chemistry with Michael Pena is fantastic and I hope they come together on another film. It's always a treat when you see a pair, or group of actors work so well together. They build off each other to deliver this natural script that feels very real and their performances are something to behold.\n\nDavid Ayer has created a couple of real gritty movies in \"End of Watch\" and \"Fury\", giving you a realistic and ugly visual treat. He doesn't hold back on content in this film and although it's not filled with disturbing pictures around every corner, there's no doubt that it's in here. He shows that the drug cartel is not one to be messed with and a lot of messed up stuff happens. He manages to deliver a great story and some memorable moments. \n\nOne thing Ayer seems to struggle with is making relatable and likable characters. He often goes for a more realistic depiction which works, but there are a couple moments where you look at his characters and just consider them to be plain asshol*s. \"Fury\" is a great example of that and in both films, the redemption often comes from the climax or the action, so I hope to see a better characters in future Ayer films.\n\nThis is also one of the best found footage movies I have ever seen. The entire movie isn't found footage per say, but it's shot like one. The camera angle on screen isn't always someone holding the camera, which I actually like. It still looks like found footage without all of the awkward and awful camera angles. It's a great mix between found footage and actual footage, while all keeping the style of a found footage movie. Their excuse to film is not so original but either way, it made for a realistic and unique experience that not many cop films can offer.\n\nIn the end, this is another fantastic film starring my favorite actor, and even though I admire him, that doesn't stop me from giving my honest opinion about the movie. This is an excellent, well made film that deserves all the praise it gets and I'm proud to own it on blu ray.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "Who left their shaving cream on the table?.",
            "review_date": "2016-06-10",
            "source": "rt"
        },
        {
            "content": "Enjoyed the chemistry between Jake Gyllenhaal and Michael Peña. The one character that I felt was not quite authentic was the chola. Really enjoyed this movie.  Michael Peña did a good job in a role that was way different than I've seen him do before.",
            "review_date": "2016-06-10",
            "source": "rt"
        },
        {
            "content": "1000000000000000000%  \nfucking amazing",
            "review_date": "2016-06-07",
            "source": "rt"
        },
        {
            "content": "I definitely could enjoy a realistic cop drama starring Jake Gyllenhaal and Michael Pena as partners. I mean these guys are totally charming and you can tell they're having a blast. Throw in a little Anna Kendrick and I am a happy camper, even if she did feel a bit out of place in this movie. There's nothing wrong with showing the day-to-day adventures of cops in a dangerous city, and most of the things they did in this movie came across as extremely authentic (as if a police consultant was always right next to them every moment, showing them how it's done.) There's just 2 faults that I found in the film that make it one that I will probably never watch again, and one that I can't rate higher. First is a pet peeve of mine that I know others don't mind as much as me, but I prefer a better narrative structure that connects one scene to the next. The movie feels very choppy as it bounces from one night to a different night that could be a week or month later with no warning. The movie lacks some cohesion in my opinion because of the choices they make in how to tell the story.\n\nThe second, and easily the biggest flaw I find in End of Watch, is that it's a stupid found-footage film!! I'm sorry, I know there are people who might enjoy that, but it is an awful way of making movies. They never have a logical explanation for all the shots, so I'm constantly asking myself \"Well, who put a camera there?\" or \"Why would anyone film this?\" Then there is the constant need for people to reference the camera's presence with phrases like \"Get that camera out of my face!\" or \"You can't film this.\" Naturally there are excuses for why people have cameras that is written into the script in some ham-fisted way, but it never makes sense. I want to appreciate the positives in this movie but I'm constantly annoyed, distracted, and even a little bit nauseated by the shaking camera. There is nothing about this film that is made better by the found-footage/documentary style of presentation. It's a shame because there are moments that could be brilliant, and I can't say I was ever bored by End of Watch, but I'll gladly never watch it again.",
            "review_date": "2016-06-02",
            "source": "rt"
        },
        {
            "content": "\"End of Watch\" is a gripping crime drama film where even though its cinematography is a bit uncomfortable to the extent that some shots are dizzy, the storyline is impactful thanks to its deep characters and interesting acting performances from Jake Gyllenhaal and Michael Pena.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "This movie puts you into the everyday life of a south central los angeles police officer, and it does it with style. It's a riveting film, and a must see!",
            "review_date": "2016-05-13",
            "source": "rt"
        },
        {
            "content": "OMG \nHOLY #### \nBAD ASS",
            "review_date": "2016-05-12",
            "source": "rt"
        },
        {
            "content": "one of my favorite action/drama movies ever",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "In fairness at least the feels is there... I'm still keeping my fingers crossed.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Filled with gritty action and chilling visuals, the film is elevated by letting all of this fall to the side to allow the film to focus on the charismatic performances of Pena and Gyllenhaal and their chemistry.",
            "review_date": "2016-03-08",
            "source": "rt"
        },
        {
            "content": "Grade: A- (87%)\nRating: 8.7/10 - Awesome",
            "review_date": "2016-03-01",
            "source": "rt"
        },
        {
            "content": "End of watch is so realistic, well written, dark and intriguing. End of Watch is one of the best cop films I've seen and is definitely worth your time to see!",
            "review_date": "2016-02-25",
            "source": "rt"
        },
        {
            "content": "Quiza el estilo de dirección y narración no es de mi gusto, pero eso no le resta méritos a la enérgica narrativa, que a pesar de su convencionalidad, resulta apta para el interesante duo interpretativo.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "Gritty but flawed cop drama that has a premise that is ahead of it's time but doesn't quite work.  The idea of a found footage cop film is especially interesting in present, with the spread of car & body cameras for the police, thus giving this film it's innovative feel. When director David Ayers sticks to that premise, those are the best scenes, especially the opening chase from the perspective of the dashboard camera.  However, some feel out of place, such as a bedroom scene that makes one wonder who exactly is filming, though the follow-up scene is perfect, if only to show how charming Anna Kendrick can be.  The two leads are excellent, with Gyllenhall & Pena making believable cops & partners and you feel a real friendship between the two.  They are do a good job portraying their characters as good cops but daredevils to the point of being dangerous to themselves & others (if those were real body cameras, they may not be cops for very long).  Despite it's flaws, an innovative & gritty drama and one of the better police films in the past few years.",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "Pretty good. Realist and raw cop/gang flick.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "Thrilling film with appealing performances from Jake Gyllenhaal and Michael Peña. Definitely a good watch.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "Another found footage movie? Ugh!! \n\nEnd of Watch is a great crime thriller starring Jake Gyllenhaal and Micheal Peña. Both put on fantastic performances as two buddy cops in an unnamed city that sort of is what like Dallas, Texas is what I imagined if it had a lot more gangbangers. Some 'found footage' technique is used here, but there also is some work done with an auctual film crew. The movie is great, it got me hooked on I the two relatable and well developed characters and the ending was just simply incredible. There is a lot of disturbing imagery and the film gets very dark and gritty the more you watch it. I really was shocked at some of the scenarios the two main characters were placed in.Please watch it if you have the chance",
            "review_date": "2016-01-27",
            "source": "rt"
        },
        {
            "content": "6/10 A bit over-the-top sugar-coated propaganda film about the good that there is in every cop... hmm... It is engaging though albeit too naive.",
            "review_date": "2016-01-24",
            "source": "rt"
        },
        {
            "content": "Has some raw moments, but never reaches it's full potential. Dennis Hopper's Colors (1988) is still the best cop movie set in LA.",
            "review_date": "2016-01-22",
            "source": "rt"
        },
        {
            "content": "What seemed like it's going to be another American cop film fighting drug crime blah blah blah, But it's far from that it has no real story just the everyday life of two street cops, But their on screen chemistry was fantastic they really worked off each other well, Brilliant acting, Some very gruesome scenes at times, Little in action but when there was it was gripping, A great emotional ending as we start to care for them, That's how good the performances were, One of if not the best cop film around.",
            "review_date": "2016-01-12",
            "source": "rt"
        },
        {
            "content": "It's good when it's going through the more normal parts of Policing... It's not so good when it escalates towards the end.",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "I would love to trash this movie, but the truth is this is a brilliant movie slightly Hollywoodized but at the same time solid acting solid writing, tugged at my heartstrings. Screw you Jake Gyllenhaal you brilliant bastard. and everyone else's movie brilliant brilliant brilliant.",
            "review_date": "2015-12-30",
            "source": "rt"
        },
        {
            "content": "Disturbing content and it oftentimes feels like it's dark for no purpose, but it's a well-executed law enforcement thriller.",
            "review_date": "2015-12-28",
            "source": "rt"
        },
        {
            "content": "OK, there are quite a few shaky cams early on, and I'm thinking I'm going to hate this movie, and the longer it runs, the deeper it gets, and the more you care about these characters...... it's going to mess you up...",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "Solid acting, good action, modern-day cop buddy flick. Very violent. Have to be in the mood. Shaky cam made me loopy.",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "So much chemistry from the duo of Jake Gyllenhaal and Michael Pena. The kind of film that has so much charisma, and also have shown the dark side of Miami. The director made some great choices, like using handheld cameras in a few scenes, and the use of violence to greatly depict the \"evil\" our protagonists are fighting against. Thing did dimmed down every time Gyllenhaal and Pena is not on duty and live their normal lives.",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "David Ayer's End of Watch is a gritty hard hitting cop drama with great performances, wild in your face directing, and a killer script that comes along once every few years. Gyllenhaal and PeÃ±a do a fantastic job as two partners who have a strong brotherhood. you buy every second of it. the violence is brutal and disturbing, which is common for David Ayer. the directing is insane and frenetic switching between first person and third person viewpoints. some times the directing is a little two much and it grows a little bothersome but the action scenes are perfect with this direction. the dialogue provided by Ayer's often hysterical script is amazing. one of the best cop dramas in recent years with tremendous performances, perfect dialogue, and superbly violent action scenes has a name... and it is End of Watch. \n\n9/10",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "This was fucking awesome",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "End of Watch stars jake Gylenhaal and Michael Pena and they are phenomenal in this movie, the camera work is a little annoying at times but you believe that these two cops are best friends and would die for each other. The story is strong and the emotional attachement to these characters is definitely present, my heart was racing in a couple scenes, and it ends perfectly. there is a chunk of time where the plot is not really moving along and you are just getting more character development that is kinda unnecessary, this movie is still great though. 4.5/5",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "I'm a fan of Mr Gyllenhaal, and I loved David Ayer's \"Training Day\". This is definitely from that same stable, with a no-punches-pulled approach (perhaps until the final scenes, when it gets all mythic and heroic). Gyllenhaal and Michael Pena are terrific as the LAPD cops who for some not-very-well-explained reason are recording their rounds of South Central LA. Their relationship seems properly lived in, and there are loads of terrific scenes, including some gut-wrenching violence on occasion. The hand-held camerawork is generally very well done, but I understand that many will find it hard to take ...",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "The movie follows 2 cops who get tangled up in a big drug business and upon cataching one of the dealers, they are in constant danger. It's not the greatest story, and at times feels overly dramatic and like a tearjerker movie. The acting was brilliant, though! Jake Gyllenhaal and Michael Pena have a great chemistry and their characters are both likeable and interesting. The ending of the movie was seriously messed up. I loved it. It strays a lot from the usual path these kind of movies take and it's genuinely shocking and sad. Also what bothered me was that half the movie is shot like a found-footage movie, but then there's also scenes where it isn't shot like one. I found it very confusing and it's much better if you stick to just one style of filmmaking. All in all, a pretty damn great movie with brilliant performances, but a rather familiar story that is only special for its ending. I would recommend checking the movie out!",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "Pena and Gylenhall are fantastic and allow you to feel like a passenger in their friendship (as does the found footage feel). The story keeps you on the edge of your seat right to the very end.",
            "review_date": "2015-09-29",
            "source": "rt"
        },
        {
            "content": "Great film ruined with a poor choice of final scene.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "Brian Taylor (Jake Gyllenhaal) and Miguel Zavala (Michael Peña) are close friends and partners in the Newton Division of the Los Angeles Police Department (LAPD) in South Central Los Angeles. Taylor, a former Marine, is recording their police activities for a film project. Upon responding to a public disturbance call, Tre, a Bloods gang member, yells racist insults at Zavala, who responds by accepting a fight. Zavala beats and arrests him, but wins Tre's respect for not charging him with assault. Later that night, Tre and his fellow Bloods gang members are attacked by a group of Sureños in a drive-by shooting and one of Tre's friends is killed. The next day, the officers respond to a noise complaint at a house party full of Sureños, where Taylor encounters a gang member named Big Evil, whose truck he later finds is filled with ornately-decorated firearms and a large amount of money.Taylor and Zavala are awarded the Medal of Valor after rescuing two children from a house fire. Upon further investigating a house, they arrest a man who is also in possession of several ornate firearms, and is guarding a cell full of human trafficking victims. When ICE agents arrive, one agent informs the officers that the house is tied to the Sinaloa Cartel, and strongly urges them to \"lay low\" due to possible reprisals. Unfortunately, the Sinaloa Cartel is not impressed by Taylor and Zavala´s constant interfering with their criminal activities so they orders their deaths... \n\nWriter/Director David Ayer is a master of \"realistic\" and gritty violent dramas often putting you more or less in the line of fire together with the actors. \"End Of Watch\" is another great example from Ayer shot in a Cinéma vérité style. The film was shot in a combination of found footage style and traditional photography. Most scenes were captured by four cameras simultaneously these included a handheld camera operated by Gyllenhaal, cameras clipped to Gyllenhaal and Peña's vests, and dashboard footage from their patrol car. Some scenes were shot entirely by Gyllenhaal. This creates such a dynamic and \"alive\" production with a feeling of a FPS game as well. The \"authenticity\" is for sure upgraded due to the fact that as part of their training, Jake Gyllenhaal and Michael Peña spent five months doing 12-hour ride-alongs with on-duty LAPD officers. Unlike many other cop dramas, \"End of Watch\" addresses the daily challenges of patrolling the mean streets of South Central and the comradery between the main characters. Initially the film is a bit disjointed and \"messy\" due to the conceptual camera work, but once you have gotten used to the this cinematic method, it truly fits this sort of film. The performances from all involved are strong and you truly believe in the bond and friendship between Taylor and Zavala. Roger Ebert of the Chicago Sun-Times gave the film 4 out of 4 stars, calling it \"one of the best police movies in recent years, a virtuoso fusion of performances and often startling action\", and went on to name the film the fourth best of 2012. Entertainment Weekly´s Lisa Schwarzbaum, who gave the film an A-, described it as \"one of the best American cop movies I've seen in a long time [and] also one of the few I've seen that pay serious attention to what cop life feels like, both on and off duty\". \"End Of Watch\" is dark, brutally violent, and carries strong emotional scenes with impact. The film has its flaws with some clichés and racially stereotypical characters, but that doesn´t create an unbalance in my point of view.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "Unfortunately police have a bad rap right now.  That's because there have been some bad police and even some down right racist police.  Even police who have committed murder.  That being said most police are good people who have one of the hardest jobs imaginable.  I thank and salute all the good police out there.  This film is one of the best films I've seen about police men patrolling a very tough area, in this case South Central Los Angeles.  Jake Gyllenhall and Michael Pena give great performance as two police men who never know what they will find and each day could be their last.  If you haven't seen this movie, you should.  Though it is quite violent and maybe not for all tastes.  It's worth a look.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "Gripping Police Drama..Great Acting between the 2 cops! Sad Ending However",
            "review_date": "2015-09-08",
            "source": "rt"
        },
        {
            "content": "One of the better cop movies of the year showcasing these men abilities",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "so good...almost cried :(",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "The main two actors did phenomenal and the movie was intriguing!",
            "review_date": "2015-08-04",
            "source": "rt"
        },
        {
            "content": "End of Watch is tough to watch, its brutal, gruelling and in some places poorly edited. It plays almost like a police documentary as it captures the difficulty of the LA police officers role. It seems realistic and testing this is down to some excellent writing but more so to the fantastic acting. Its a very gritty drama, its heartfelt and convincing. I can't say it will be to everyones taste, I certainly feel its not one for a rewatch as its very blunt and energetic so much so that its so realistic that once is enough. I enjoyed it yet feel they made a mistake with the hand held camera, I understand that much of the realism was captured via this method but it is difficult to appreciate due to its shaky ness and almost amateurish nature.",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "Great character development combined with emotional performances makes for an amazing film. I was kept on the edge of my seat throughout the movie. I laughed, cried, and rooted for these guys! I left with a new appreciation for the men and women in the police force who put their lives on the line each day.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Short and sweet: very good film. Nothing more.",
            "review_date": "2015-07-25",
            "source": "rt"
        },
        {
            "content": "One massive chunk of good action infused with good drama!. Be ready to have a rough love relationship with the law.",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "Amazing.   Funny, heart wrenching, depressing...",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "My #1 favorite cop movie!",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Energetic, powerful, and heartbreaking, End Of Watch highlights the courage and heroism of officers on duty.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "Kinda like an episode of cops but with a bromance in between cop stuff",
            "review_date": "2015-07-10",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Ayer delivers with this classic cop film following the lives of officers Taylor and Zavala as it takes you through the struggles of being an officer in California. Gyllenhaal and Pena provide masterful performances and ends in tumultuous fashion.",
            "review_date": "2015-07-08",
            "source": "rt"
        },
        {
            "content": "Great cop movie loved the ending.",
            "review_date": "2015-06-24",
            "source": "rt"
        },
        {
            "content": "Powerful....Great L.A. Movie",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "End of Watch's shaky camerawork will irritate and potentially nauseate a lot of viewers. In this case, I think it's necessary. Director David Ayer uses the shakiness to create the gritty, relentless, horrifying reality of police shootouts and chases. This is a film that commemorates the policemen who risk their lives to keep us safe. It's thrilling but emotionally poignant. Jake Gyllenhaal and Michael Peña are superb.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Better then most modern cop movies and a lot better then most \"handheld\" filmed movies.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "An enjoyable false documentary with great acting.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "I'll be honest, I've always been iffy on the whole \"caught on camera\" class of films, so when this movie started out as such, even though it is quite original and well done, it made me nervous as to how I'll like it. In the end, although not completely shot in \"on camera\" mode, this is one incredible film carried completely by Gyllenhaal and Pena's performances and on camera chemistry. They've got the kind of chemistry that makes it hard to believe they're not real-life best friends and thus makes the film that much more lovable and inevitably heartbreaking. (90%)",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "It will take time for me to find a found footage that I like. It tries to be really emotional, but just isn't. You may like it if you're a cop. Or a found footage fan.",
            "review_date": "2015-05-03",
            "source": "rt"
        },
        {
            "content": "Great acting and action.",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "The advertisements led me to believe there was more intense action....interesting movie, solid cast, overall enjoyable",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "The unusual perspective of narrative, makes this in fact rather formulaic police story, looking different & refreshing again.",
            "review_date": "2015-04-22",
            "source": "rt"
        },
        {
            "content": "This movie accurately portrays the life and work of a police officer. I assure you that if you go to a cop and ask how they do things, then compare what they told you to this movie, there will be little to no differences . This movie is also pretty entertaining. However I think the character of Van Houser is bland and the drug dealers could've been better casted . This movie was also shot well except for some of the action scenes because there's a little bit of shaky cam. Overall this movie was a blast.",
            "review_date": "2015-04-19",
            "source": "rt"
        },
        {
            "content": "Great underrated movie. Just amazing chemistry between the two leads and i guarantee the ending will have you in tears. Great movie!",
            "review_date": "2015-04-16",
            "source": "rt"
        },
        {
            "content": "When you make a hand held film and keep using other cameras with the same feel of a hand held when it is not the guy with the camera, it really takes away from the movie. Besides that, great film. Highly recommend.",
            "review_date": "2015-04-15",
            "source": "rt"
        },
        {
            "content": "The film seems to have been inspired from the television series: Cops. The style of cinematography is quite similar and annoying.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "Good movie just really really strong language. So much that it actually gets annoying",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "With great chemistry between the lead actors, End of Watch pays attention to cop life, on and off duty.",
            "review_date": "2015-04-06",
            "source": "rt"
        },
        {
            "content": "Te mantiene atento de principio a fin. No muy de acuerdo con las decisiones de camara pero su historia y actuaciones lo compensan muy bien. La quimica de los dos actores principales es muy buena, ademas del pilar para que la historia sea creible, tenga sentido, y te mantenga conectado.",
            "review_date": "2015-04-05",
            "source": "rt"
        },
        {
            "content": "The chemistry between the leads is undeniable and is definitely the key element that makes this film great.",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "Mocny, brutalny i prawdziwy obraz, ukazuj?cy codzienne ?ycie policjantów w USA. Mamy tu bohaterstwo, troch? brawury, momenty ?miechu jak i prawdziw? m?sk? przyja??, na szcz??cie bez zb?dnego patosu.",
            "review_date": "2015-04-01",
            "source": "rt"
        },
        {
            "content": "Best cop movie ever!",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "End Of Watch is a brutal, 3 act structured, intense Cops episode. But the heart of this movie lies within the brotherly chemistry of its two leads, Jake Gyllenhaal and Michael Pena. Imagine Maverick and Goose from Top Gun but cops. \na must see",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "I liked this a lot, it's not perfect but it's considerably better than it's terrible trailer would have you believe.  The first half hour it struggles to find it's feet, feeling like the TV shows 'Cops' and 'The Shield' but as you're drawn into the two main characters it really starts to take hold.  It's ultimately just a gritty cop bromance, but it's really done well.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "David Ayer's documentry-style revision of Dennis Hopper's Colors is dope and even has an equally questionable soundtrack to boot!",
            "review_date": "2015-03-16",
            "source": "rt"
        },
        {
            "content": "Done before and better by other movies.",
            "review_date": "2015-03-14",
            "source": "rt"
        },
        {
            "content": "bring back memories when I was LAPD",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "85%\nSaw this on 25/2/15\nEnd of Watch portrays it's leading men as human beings, not as superhero cops and Pena and Gyllenhaal share dazzling chemistry. It's abetter found footage film with a lot of emotional content. Anna Kendrick and Natalie Martinez also adds fuel to this film. The film's depiction of violence is rather exemplary and David Ayer scores for that.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Realistic, touching and well-acted drama about two L.A.P.D. cops (Jake Gyllenhaal and Michael Peña) who start to mess whit mexican drug and immigrants dealers.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Hardcore cop/gang realism and truly commendable acting. I'm sad I missed it on the big screen.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "The sincerity in the filmmaking is really what works here. Although, the engaging leads don't hurt either.",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "End of watch is a very realistic documentary style cop movie showing brutal reality and tender moments between cops. Gyllenhaal and Pena do some fine work here",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Top action movie great acting really good throughout especially liked the ending",
            "review_date": "2015-02-10",
            "source": "rt"
        },
        {
            "content": "An intense movie depicting the few days for 2 cops. Quite powerful in its depiction of the violence they have to face. Overall though as a movie it's straightforward with no major twists. Good performances and direction with good editing but falls short the storyline",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "This was a good movie that had my attention right from the start till the very end even though some of it was just way too real for me & painful to watch (Especially the final scenes) I almost wanted to turn the movie off but It's kinda like I wanted to get it over with because I knew after I watched it all, I never want to watch it again.It's a movie I'd tell anybody that was thinking about watching it to go see it.It's a good movie but after you watch it once, You might not want to ever watch it again, It's just way too real & painful at times",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "It's like an episode of \"Cops\", only 100 minutes long and actually entertaining. The chemistry between Gyllenhaal and Peña is basically as good as the one between Harrison Ford and Sean Connery in \"The Last Crusade\". Sure, the \"found footage\" style might piss some people off, but I think it works. And the ending is truly heartbreaking.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "There's a gritty authentic feel to this movie. The audience is treated as actual witnesses to what happens on screen. This was established early on with how cameras play into the story. Someone in the movie was almost always holding a camera, driving home the feeling that we are simply observing things. It's not a found-footage movie; most of the time, the perspective isn't from someone filming in the plot. This is good because it allowed much more creative cinematography and kept everything from appearing low-budget. It was nice from time to time to get a 1st-person view from a character.\n\nThe whole success of the movie relied on how good the relationship between the stars was. It was fortunately excellent, another aspect giving this a great authentic feel. They behaved exactly like a pair of best friends. They acted comfortably and natural around one another. They teased one another, got annoyed, got into deep conversations, and enjoyed each other's company. Peña and Gyllenhaal gave a couple star performances bringing these two to life. I get very invested in the well-being of them both.\n\nOne thing that I wish was a little less authentic is how some of the gang members spoke. It annoyed me how much they said \"fuck\". I'm sure there are people who talk like that in real life, especially criminals, but it got stale fast. It irritated me and it was used so much that I got numb to the vulgarity, making it essentially pointless. Not having characters drop the F-bomb every 3 words would not have ruined the experience in any way.\n\nThe story is told in a rather unconventional way. It felt like a highlight reel to me at points. This was actually good in my opinion. There was no unnecessary filler or fodder, still offering a complete and coherent story. The order of events and transitions between moments all make perfect sense without everything feeling as though they're put together too well, too cut and dry. I am a fan of this style. The ending is also very unconventional, even making a time jump backward, and it is a perfect final moment.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Essentially a buddy-cop movie but thanks to some cracking chemistry and visceral film making it's a fresh, exciting and humane one.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Funny and realistic with some great action scenes. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Thanks to its high content of realism , obtained with a really interesting technique of shooting and with a perfect cast , End of Watch is more than a classic film about cops.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "Great movie! The chemistry between pena and gylinhal is palpable!",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Inconsistent 'Found footage' multi-camera bullshit and some caricatural side characters bring down an otherwise enjoyable movie, turning it into just another stale genre cop movie. While it has some ambitions in its procedural, close to the ground approach to policemaking an uncritical gaze manages to dull those out as well. THe only good part of this movie is the Pena-Gyllenhaal relationship. Two good actors build out the relationship between their characters in a totally beleavable, almost improv manner. \n\nEnd of Watch is a stale movie using a stale narrative device but it might be worth watching for the two star performances.",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "Liked the movie, just didn't like the swearing, ending was unexpected.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "Great cop/action film. The handheld videos are a detriment to the movie. Also, the f*** bombs every other word are way overdone. A grim, seedy look at the dregs of LA.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "Amusing in patches but very basic action cop movie. Forgettable.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "End of Watch is a well made cop thriller. Jake & Michael gives great performances. The movie is shot like a documentary in order to give a realistic touch to it. There is nothing new about the film but the direction, acting and the format gives this a good thriller.",
            "review_date": "2015-01-07",
            "source": "rt"
        },
        {
            "content": "Riveting, documentary-like cop drama with great performances by Jake Gyllenhaal and Michael Pena, the perfect counterpoint to all the current bad press about police violence. Not for the faint of heart.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "The realist cop movie ever! I work the mean streets of Oakland California every day. I have seen some of the stuff they depicted in this movie, and I can honestly say it is very close if not as real as they come! A must watch.",
            "review_date": "2015-01-01",
            "source": "rt"
        },
        {
            "content": "/10\nActing - 8\nWriting - 7.5\nDialogue - 8\nPlot & Characterization - 7.5\nCinematography & Editing - 8\nSoundtrack/Score & Set Design - 8\nHow much I enjoyed it personally - 7",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Great Cop show! Realistic, and I would know!",
            "review_date": "2014-12-22",
            "source": "rt"
        },
        {
            "content": "I really liked this movie, most of the reviews were dead on, these are the kind of characters that give cops a good name.",
            "review_date": "2014-12-16",
            "source": "rt"
        },
        {
            "content": "The handheld style ads allot of realism to the film, but its characters didn't really affect me as much as the probably should have. Also it doesn't stay true to the mockumentary format and takes me out of it.",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "Phenomenal performances and outstanding cinematography. At times it was like watching a video game rather than a dull action movie. The drama and the thrilling turn of events is just enough to get you to sit through till the end.",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "Not another action film. This movie stands out with its intriguing plot and charismatic characters.",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "Fantastic film. I don't really like found footage movies but this one I really enjoyed. The acting was brilliant, the idea behind the film was good and the cast was fantastic plus the ending to the film was really good as well.",
            "review_date": "2014-12-03",
            "source": "rt"
        },
        {
            "content": "A really powerful film that makes really makes you engage and identity with the charters. The off beat filming style works really well in this face paced gritty thriller. It over comes the issues that often come with handheld format films.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "Not my type of movie. Didn't like the cinematography. I'd pass on watching this one.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Think i had a different movie in mind when i bought this one , also with Jake , this was kinda soft action , not a classical one . SOMDVD",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "beside the sad ending i didn't get any moral from this movie wondering what was the purpose of producing it.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "A fantastic movie with phenomenal acting and chemistry between the two main characters, possesses solid story telling and gives insight into the brotherhood that is formed between the two police officers.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Good cop movie. It is grounded in reality.  Story about partners kicking butt in LA. They kick so much butt they get a target on them. Graphic and violent (duh!) and am not sure it set the record for f-bombs in 2 hours. Highly recommended for all cops.",
            "review_date": "2014-11-19",
            "source": "rt"
        },
        {
            "content": "'End of Watch' has good intentions, but tries too hard to make the action feel real. But some of it just doesn't. Example being that the footage lands in the most obscure places.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "This is how found-footage films are meant to be. The lead performances are the foundation of End of Watch, enhanced by the plot device rather than obscured by it.",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "Went for a format that requires a camera to keep on moving between a found footage format or a found footage format with multiple questionings on the logic of its camerawork. But besides that, it's a smart, nicely paced and well-researched drama with devoted performances of its leads matching the reality of the topic's atmosphere expressing the roles in a small form of a documentary with a story to act out. (B+)\n\n(Full review coming soon)",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "very very bad directory style...",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "A very good police drama with wonderful acting. The characters seem real - they live and grow from day to day. Sadly, you know the way the movie will end just from the unfortunate title. Anna Kendrick, a favorite of mine, makes the movie better even in a smaller role. Recommended.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Riveting cop film with great character development, a good story line and lots of emotion.  Exceeded expectations.",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "'End of Watch' bodes well because of the fantastic chemistry between its leads plus the compelling and thrilling story line about two street cops caught up in drugs and gang violence.",
            "review_date": "2014-11-06",
            "source": "rt"
        },
        {
            "content": "(14%) \nA movie that wanted to cut right through the typical Hollywood cop movie cliches and show what life on the force is actually like, but boiled down to its basic components this is as generic and as Hollywood as every other movie this tries to one up. First and foremost the way this movie is shot just doesn't work. It's a part found footage movie, and part flat out poorly shot, because unlike the footage filmed in a horror found footage movie in which all the characters really have to do is film, scream, hide, run away etc, but if you're a cop there's quite a lot you can't film because you're way too busy doing your job, so who  films all that stuff? Well I'm guessing that a ghost of a dead amateur cameraman or something follows the two lead cops around, and occasionally a group of very poorly written street thugs, which partly explains some of the awful camera movements which lets be clear on this are only there to make this feel \"edgy\" and \"real\", despite the fact that the star of the show is an A-list Hollywood actor and this is no more of a real cop movie than say \"Die hard\", or \"Lethal weapon\". And lastly on the subject, no cop would be given permission to film themselves in this way, because it's dangerous, unlawful, and unprofessional, and why the gangs members are also filming themselves is even more nonsensical as there is zero reason behind them doing it. This really wanted to be an overall insight into police life, so there's aimless banter between characters, they bend the rules at times, there's paper work, shoot-outs, boring jobs to do, weddings, births, wives, etc but the fact is that we already know all this stuff, so there really is no insight to anything shown here. It's just a badly shot generic cop movie with a better cast than the material deserves.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Not bad but highly predictable.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "Superb acting, gritty action and a realism that surpasses most. Filming with a hand held camera brings a sharp edge to the action. a must see!",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "End of Watch was shaky at first but drew me into its atmosphere and I didn't want to leave. The performances by Gyllenhaal and Pena were great which worked well because the story relies heavily on their characters. End of Watch was an enjoyable ride that will leave you with a couple tears and a renewed sense of pride in your local police force.",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "???????????????????????? ????????????? ????????????????????????????????????? ???????????????????????????????????????? ??????????????????????? 5 ???????????????????? ??????? ???????????????????????????????????",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "There are only 3 handheld footage movies I like (Chronicle, and The Blair Witch Project). End of Watch, being the 3rd. So, lets jump into a quick 2 cent ride of my thoughts on this movie!\nFrom the very beginning, I was on the edge of my weird fold-up gamer chair thing I've had for many, many moons (very comfortable). The range of emotion this movie caused me to feel, went from the lowest lows to the highest highs, and everything in between. A nearly perfect blend of comedy/drama/suspense/thriller/action. The cruiser scenes brought back memories of driving around with friends in high school; bantering back and forth about life, laughing non-stop like a cult of cackling coons. Every action scene had my heart pounding louder then any movie I've seen before. It was intense. One last note, the finale had me choking back tears as best I could. (No, I did NOT cry, but the eyes were watery, and it took awhile to dislodge Kermit from the back of my throat). \nAnywhoozles, I just found a new favorite movie. Also, gained even more mad respect for Jake Gylidhenjalllas acting abilities. Well done mate! (Michael Pinata, I salute you as well)",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "The film provides a great take into the lives of police officers in Los Angeles it is also well written not surprisingly by David Ayer who wrote Training Day the film does everything it is well acted, good storyline and it is realistic",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Excellent gritty cop drama...fabulous acting...loved it!!",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "Can't fault it really. Only marked down because I wanted more!!",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "Best movie ever just picked it up on blu ray yesterday for 10 bucks",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Best cop movie I've seen. So far anyway...",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Great dynamic duo with these two actors.",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "A very good and powerful cop movie. The style is a little strange, mixing up footage and third person standard, but it worked well enough to do what it was doing, which was great.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Great performances from Jake Gyllenhaal and Michael Pena. I felt emotionally connected to their characters. Not a big fan of the handheld camera genre but it worked in this films favor.",
            "review_date": "2014-09-30",
            "source": "rt"
        },
        {
            "content": "Is being a cop in LA really a cool job? i think so !!",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "Picks up pace as it goes on, America seriously has a gun problem.  Cops need guns as the clientele do too.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "Strong acting, an innovative stye and a fantastic second half make for two hours well spent.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "A very good film with very good acting and some well written screenplay. It is very entertaining and the two leads have good chemistry. This  is a pretty enjoyable film which I recommend. \nGrade B+",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Exceptional Jake Gyllenhaal is superb. One of the best cop movies I've ever seen.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "Best movie about police partnership ever",
            "review_date": "2014-09-18",
            "source": "rt"
        },
        {
            "content": "This is an important film, and not your average police movie. Gritty, emotional, and surreal -- Ayer directs with fine precisions and the two lead actors portray a side of the forces that protect Americans on the home front with dedication and power.",
            "review_date": "2014-09-12",
            "source": "rt"
        },
        {
            "content": "Working off the chemistry between it's leads End Of Watch is a tightly directed, action packed and extremely intimate buddy cop film. \nGrade: B+",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "These two were great castings together, but what I really loved about them is their relationship together making the end so much harder to watch. My favorite stuff about this movie was two main things first was the camera angles how it was what I'd call \"free mode\" which is seeing it in first person, it made the movie and gun fights that much more intense. The second thing was the plot points is how the guys randomly found things that didn't move the plot or kill it, it was really cool to watch and of course a must see.",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "A movie about two cops Brian Taylor (Jake Gyllenhaal) and Mike Zavala (Michael Pena). Not only co-workers on the LAPD, but also best friends. The film is shot in a documentary like \"found footage\" kind of style at times, but it's not so noticeable as previous films shot in this style. When Brian and Mike bust a notoriously dangerous drug cartel they soon become the target of a hit and must survive. The movies plot is very well done and has an interesting story. Gyllenhaal and Pena interact so great that it doesn't even seem like they're acting it's like your watching a real conversation. Overall, a great little action crime drama that I recommend checking out!",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "Actually really really liked it. Good acting",
            "review_date": "2014-09-01",
            "source": "rt"
        },
        {
            "content": "Ummm. Final Shootout is awesome",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "The overlay that supposedly justifies the style of cinematography wears thin within the first act, and it may have been better to have simply scrapped it.  The plot often lacks the thematic connective tissue to tie each of the events together, and characters toss out cop film cliches with regularity but they are seldom given gravitas.  The ending almost lives up to the promise of the opening oration.  The strength of the film is the performance of Michael Peña.",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "Needs more stars! Sad!!",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "This movie was absolutely pointless. And infuriating. And powerful. Why build up love and compassion for characters that you really care about, only to have that happen at the end. And then ending the movie with a laughing scene?! VERY offensive if you ask me. I wanted to literally walk out of the room when it ended. Appalling. But I can't even begin to tell you how fantastic a job the story is... I haven't felt this connected to characters in a long time. I don't like how the movie ended but whatever.",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "Disjointed, yet still emotionally powerful, this all too familiar tale ends up being a tour de force, thanks two it's two strong leads and it's unique documentary style action.",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "This is the type of movie that puts all it's weight on the actors. Luckily it got the two perfect actors for the role.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "David Ayer certainly does love his cop films, as does Michael Peña because he has played quite a lot of cops in his career and with Peña paired up with Jake Gyllenhaal, these three do wonders.\n\nRight from the very start, the film is interesting and engaging. The film sets up how it means to go on with a camera in the windshield like you'd see on any given cop show, which is done incredibly well, and a majority of it filmed by a handheld camera and I thought it was filmed well actually. Seeing some comments about this being a found footage film moments before I was ready to watch it had me worried but it is done differently and definitely isn't what you think it will be when you hear the words 'found footage'. It looks absolutely beautiful and for what it is trying to do, it works, but it did feel a little strange as with some scenes you would see a character filming scenarios with a camera they are holding but in another scene they would just be walking around without using a camera but are still being filmed. Most of the time you'd hear a character say, 'hey, turn off that camera', so why even have that gimmick in there? It took me out of it for a little bit. But hey, experiment, because that is what film is all about. However, unlike Sabotage, the pov shots of the guns weren't terrible. The soundtrack is also fantastic, using mostly pre-existing songs, it fits the setting very well. \n\nThe key factor in making all of this work, even if the way it was filmed did put you off, is the acting. Like everyone else has already said, this is some of the best on screen chemistry between actors in a film for some time. You really do believe these two care about each other and have been friends long before the film ever started. I read somewhere that most of it was adlibbed and that would make sense just because of how natural all the conversations flow and how funny it all is, the film does have great sense of humor when it needs it, 'Go do your white boy shit', and it all helps to get to know them and follow their story. Some of the other actors here are some from Training Day and its nice to see them in something again and it also features a kick ass debut from Yahira Garcia.\n\nSpeaking of the story though, it isn't a typical three act structure. The film is a slow burner and just shows us their lives that has elements of what is to come in bits and pieces throughout and it flows into that ending so smoothly that it all just feels like one big experience. For its quite short length, it is a long film and not in a bad way, there is just quite a lot of content here for its running time and you get your moneys worth, I'll say that much. The only problem with the whole thing that I had was there was a very dark scene that happened and was a major point in the film, you could see that it was starting to get to one of the characters and it was affecting them quite a bit and the very next scene is a party and that just sort of took me out of it for a bit, again,  just a little bit though! But it just got my attention and made me think about the editor.\n\nThe general consensus on this film is clearly positive although I have heard some people say it is a little fake at parts but at least to me, from the way everything is filmed and how it all plays out, you'd think it was based on a true story. Given how unconventional the ending is, it seemed like it could only be based on a true story. I was loving the film quite a lot but when that ending happened, I loved it all the more, it'd have been more hard hitting if what happened did indeed happen to both but still, the fact that an ending like that is what we got, I'll happily take it, I'm glad it wasn't a 'cop out' as it were. With attention to detail to the paperwork side of being a cop coupled with excellent acting and an engaging story, End of Watch is a fantastic cop drama done right. I will be watching this again often in the future, it is quite excellent.",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "All the way hard man",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "A over-hyped generic action film. A retread of other cop thrillers. Sure the performances were good and the directing. But was predictable and fell short of surprises.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "One of the best portraits of men who execute and enforce the plans and rules of society. A glimpse into what some go through and sacrifice so we can have pretty things and complain about it.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies ever. Action packed, good acting, and a great plot. Makes you really appreciate our freedom and safety.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Great movie ... only problem is the cops bringing camera with them ... most of the shots are not from their cameras so ... But whatever, it doesn't really matter.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "What a great and really powerful film. The lead actors mixed well and the overall premise was intense.",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "The chemistry between the leads is what makes this movie work.  One of the better cop movies of the last 20 years.",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "Excellently played thriller.",
            "review_date": "2014-08-08",
            "source": "rt"
        },
        {
            "content": "It's a story of policemen. Audiences are absolutely amazed at the chase scene and the gunfight shot by a car-mounted camera at the beginning. Car mount cameras and camcorder? are frequently and effectively used. It makes the movie alive and thrilling. Passing between tension-filled duties and dirty talks, the story zips along. This is a first-class entertaining movie.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "A really great cop film two cops/buddies go through their daily lives together until they find something they were not suppose to.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "David Ayer, who also wrote the Antoine Fuqua directed 'Training Day', delivers another strong movie with 'End of Watch'. Ayer didn't just write this one, he was in the director's seat as well.\n\nThe story tells the tale of two So. Central L.A. cops, Brian (Jake Gyllenhaal) and Mike (Michael Pena), who are not just partners in the LAPD, but best friends as well. We get to meet them and their private live as well as see their work, which includes busting crime and navigating the gang landscape of South Central Los Angeles. As they progress in life and in their work, they get a little too close to cartel business and this brings a new set of problems. The movie shows a delicate balance between caring humanity and the edge of police brutality. The mix works well here in building believable characters.\n\nAyer paces the movie well and mixes 'found footage' techniques with standard camerawork and blends them in a way that seems natural. The story is told slowly, with enough attention to detail. It makes the characters come to life. Gyllenhaal and Pena have a really good chemistry, which makes this movie a breeze to watch. They portray friendship and fun in a bleak world.\n\nEven though there's enough comedy here to balance most of the drama, don't expect the movie to be your typical cop buddy film. It is much more than that.\n\nPros: Funny, sad, exciting, well-acted, good story. \nCons: None, really\nVerdict: Go See!",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Best cop movie I've ever seen. Michael Pena and Jake Gyllenhaal made there friendship seem completely true. I never related more to any other movie partnership as much as this one. I absolutely love this movie and it is incredibly powerful.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "While I admittedly have never been a fan of found footage movies, \"End of Watch\" definitely proves its potential in its following two police officers, Brian Taylor(Jake Gyllenhaal) and Mike Zavala(Michael Pena), on patrol after they have been cleared of a shooting.  But everybody is not crazy about Taylor bringing along digital cameras on patrol for his filmmaking elective.\r\n\r\nWhere \"End of Watch\" succeeds is in how it surprises the viewer about these characters.  This is Los Angeles.  These are police.  So, naturally after 87 movies about corrupt policemen in Los Angeles, there are certain preconceptions.  However, outside of Taylor and Zavala being a tad aggressive, they come off as reasonable, especially in Taylor seeking a mate who he can talk to which he possibly finds in Janet(Anna Kendrick).\r\n\r\nBut where \"End of Watch\" misses a valuable opportunity is that instead of the realistic laid back day to day routine of these characters, we instead get the episodic cartoonish version.  Basically, Zavala and Taylor stumble across every huge bust and rescue situation in Los Angeles over the period of a year.  Yes, the movie does sort of point out the ridiculousness of this but that's really not enough here.",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "Different, trilling, entertaining!",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "I never seen a cop drama film done this well in a long time. Davis Ayer really knows what the bad part of the streets are like, and used it for some great bad guys, even though some people might find their language to be off-putting. The brotherly chemistry between Jake Gyllenhaal and Michael Pena are fantastic and are the main highlight of the film. The found footage is well executed in the movie which can make the action scenes very tense, and feel like you are there. It has some funny moments, and it has a lot of serious moments that are well done. The plot gets you along with the ride as it looks like something cops would actually do in real life while having a bit of fun with it. End Of Watch is the first movie that made me took notice of David Ayer and I'm glad I saw this, Fury, and Sabotage.",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "Excellent movie shot POV style to look like we are the cops. Very good character building in this movie. The ending though :'(",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "Pena puts on a great performance that enhances an interesting story.  For someone who has lived in LA their whole life the story is all too real but End of Watch lays the stereotyping on so thick at times that you may be inclined to pass on it.  If you like action do yourself a favor and watch it through.",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "amazing amazing completely hooked on the believable relationship between the 2 characters. definitely watch few more times",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "So good. Very moving.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Though this movie doesn't offer anything new to the genre, this is by far the best cop movie I've ever seen. Tons of action, incredible chemistry between the two leads, entertaining and keeps you emotionally invested throughout. Would highly recommend.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "7/10\ngood but not that good",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "Gripping and brilliantly acted, End Of Watch is a one-of-a-kind action thriller in terms of delivering its audience on a higher level of immersion, suspense and bracing drama unlike the genre usually offers.",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "this movie is a good action movie ð~",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "A great action packed movie.",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "One of 2012's best movies. David Ayer makes \"End of Watch\" so much better than just another cop movie.",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "awsome but sad movie",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Incredibly intense. At it's best when PeÃ±a and Gyllenhaal are on screen. Slows down toward the end but has a great climax.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "A little slow but engaging to keep you wanting more.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "An action/bromance movie that efficiently portrays the gritty lives of cops with big performances by the 2 lead stars.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "it was a great movie except for the lady saying the f word every .1 seconds.",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "You'd be forgiven for failing to notice that End of Watch lacks a cohesive central narrative thread; its two main characters are portrayed so convincingly by its pair of perfectly matched leads that viewers are invested in their plight to an extent that is rare in cinema. An overlooked gem.",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "Sporting a lot of heart, hilarity, and emotion, this intense and thrilling ride doesn't seem to stop.",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "Muy recomendable, en Netflix México se llama \"Úiltimo Turno\".",
            "review_date": "2014-07-09",
            "source": "rt"
        },
        {
            "content": "This is Colors for a new generation. There's a difference between \"found footage\" movies and this, mostly handheld video cam movie. This movie has heart. You experience the personal and profession relationship between the main characters, flawless and human as it can be. It moves you and makes you experience a sense of danger and accomplishment.",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Great performances by Jake Gyllenhaal and Michael Peña. Definitely a film to check out!",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "PERFECTLY MADE MOVIE!!! SERIOUSLY KEEPS YOUR ATTENTION AND ADRENALINE FLOWING, THROUGHOUT!!! SEEMS PERFECTLY LEGIT!!! MWH",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "subpar movie, expected more from it, acting was just okay",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Brutalmente buena, la manera como filmaron la pelicula es unica y las actuaciones excelentes.",
            "review_date": "2014-07-04",
            "source": "rt"
        },
        {
            "content": "A very very intense thriller that works due to the remarkable chemistry and performances of Jake Gyllenhaal and Michael Peña. The visual hand held style works and Anna Kendrick and the rest of the supporting cast are excellent as expected. \n\nHowever this film features one of the most emotionally devastating endings I've ever seen that takes you off guard and leaves you silent long after the credits have rolled.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "A great movie, but hard ending.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "The actors, both excellent, get right into Ayer's groove. So by the time we arrive at the unsparing climax, we really know and care about these guys. I say SEE IT!!!",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "Good movie, worth the watch.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "A rather harrowing, grim fable that somehow, even in its most gut-twisting moments, provokes certain lines of thought that everybody could use. \nGyllenhaal and PeÃ±a portray their characters nothing more, nothing less than in reality.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "\"End of Watch\" is a well-made cop movie that is very grounded in reality. I respect this movie for not shying away from things that are hard to watch and brutally real. I felt the lead performances were great and the chemistry was genuine. I did feel the found footage elements the movie were a bit unnecessary and the story could have been told just as effectively without them. Nonetheless, this is a good movie that feels authentic and ultimately does pack a pretty emotional punch.",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "With Michael Pena and Jake Gyllenhaal front and center giving extremely effective performances that truly make us care about them and some wonderfully executed action scenes, \"End of Watch\" is one of the best, if not the best, cop films I have ever seen.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Filmed very differently to anything I have seen but fantastic performances by every major role, and an exciting sequence of events carried it through to the very end.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Really enjoyed it. Not a dull moment.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Solid acting, great story and surprisingly moving",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Thoroughly realistic",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "One of the best gritty, realistic crime dramas since 2001's Training Day and 1988's Colors. It even goes great with the T.V. series Southland.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "One of the best gritty, realistic crime dramas since 2001's Training Day and 1988's Colors. It even goes great with the T.V. series Southland.",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "Shaky cam gives me headache, but damn, it was so authentic that I almost forgot it's just a movie.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "Powerful, thought-provoking, excellent movie!",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "no one should ever make a shaky cam movie again. ever.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "It's incredibly simple and dumbed down, but it has very likable characters and enough good action to sustain its duration. I didn't love the way it was filmed as a found footage kind of movie, but it did it well enough for me to dismiss that fault.",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "Solid LA cop thriller if there ever was one.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "Absolutely fantastic movie. I was expecting a good movie, but I got a great one. Gyllenhaal and Pena are perfect together. Kendrick, although not in the film for all that often, is great when she's there. The filming style works great for the story, and I wouldn't have wanted it any other way. \n\nIf you haven't watched it yet, do yourself the favor.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "A very overrated movie but I can see why. The strong point of this movie was basically the acting. Other than that I watched it only because of jake. But this is passable.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "It is a cruel and brutal movie, but very well made. The performances are excellent, and the fact that it is shot in this documentary like style made me feel that the whole thing was too real. I liked it, though I won't be able to sleep anymore tonight.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "I love this movie. One of my favorites. It has great suspense, action, and a gripping final scene. Gyllenhaal really steps up his game and provides a great cop crime investigation scheme . Most critics wouldnt put this at 5 stars, but for me its great",
            "review_date": "2014-05-24",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen.",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Great cop drama. You're in it with them for the ride through this heart pounding ride along. One scene near the end was pretty unbelievable though but the rest appeared authentic",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Great movie. Good acting , I like the ending. Not a fan of police",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Watch it with my brother, his now into movies",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Ingredients:\n1 part scary found footage movie\n1 1/2 parts gritty cop thriller\n2 parts buddy film\n\nDirections:\n\n1) Take apart found footage movie\n2) Replace ghosts with Mexican cartel members in Los Angeles\n3) Mix in buddy film and gritty cop thriller, blending some elements completely and only roughly chopping others\n4) Serve with pro-law enforcement sentiments as garnish",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "I couldn't stand the villains! I hated every loathsome stereotypical, over the top, hyper, and aggravating moment with them. These villains soured the movie so much for me I could barely concentrate on Gyllenhaal and Pena's excellent screen chemistry and acting. Instead I focused on the motor mouth Mexican gang bangers spewing obscenities left and right. Rather than feeling like ruthless Mexican gangsters they felt like caricatures so ridiculous that they lose authenticity and menace as a result.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "Picking up where USA's critically acclaimed series 'SouthLAnd' left off, 'End of Watch' follows the lives of two LAPD officers (Jake Gyllenhaal and Michael Pena) who battle the danger-filled streets of Los Angeles together. The film, which was helmed by David Ayer, is unique in that it relies heavily on handheld camcorders used by the officers and others, and police cruiser dash cams. This gives 'Watch' a somewhat voyeuristic feel, but there's nothing creepy about it. While the plot is pretty benign (two officers stumble into a web of Mexican drug cartels that are bent on seeking revenge after some of their activities are thwarted), the film's main strengths lie in the chemistry between Gyllenhaal's and Pena's characters, as they refer to each other as \"brother\" on more than one occasion, and share a lot of life's major events, including weddings and the births of children. As expected, 'Watch' is chock-full of gritty elements, from disturbing, grisly images related to crimes committed to more F-words than one person could utter in six hours, but they make everything seem that much more real for the viewing experience. While 'End of Watch' is not a happy film by any stretch, it still does enough to make a semblance of a connection with the audience, and for that reason, it exceeds other police dramas that came before it, as well as a few that have followed it.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "Very strong performances, but the way too up close, jerkey camera work was too distracting for me to lose myself in the story, similar to \"Collateral\".",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "A buddy cop film that gets bonus points for the camera work, natural acting and (somewhat) realist plot.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "So real it leaves you at the end depressed, amazed, and possibly even changed.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "this was probably the beat movie of the year it was well done only one bad thing and I know it was part of the file but it makes me sick with the cameras moving around so much",
            "review_date": "2014-05-08",
            "source": "rt"
        },
        {
            "content": "Monday, April 5, 2014\n\n(2012) End Of Watch\nDRAMA\n\n At least 80% of the approach of this movie is the same as \"The Blair Witch Project\", \"Paranormal Activity\" and \"Chronicle\" to name a few, and I just want to say that I've never heard so much unnecessary babbling in a movie before, but that can be the result because the movie doesn't really have a plot per se.  Written and directed by David Ayer improvising his character with Jake Gyllenhaal as cop Brian Taylor wanting to do a film project of some sort without the viewers fully understanding for what.  With a considerable amount of footage focusing on his long time partner Mike Zavala played by Michael Peña showcasing what Brian does as an active police officer, and it's often by spouting out plenty of cursed words, particularly the \"f\" word.  And because I know a few cops myself, since some of them are people I physically went to high school with, it tends to lose credibility when majority of them speak with dirty filthy mouths.  Therefore, I'm unable to relate to any of the characters shown here.   I'm just saying that the cops that I know are mostly courteous, even when they do the wrong thing since it's also supposed to be part of their demeanor.  The other thing I had trouble with are the camera angles where the camera is supposed to be focusing on one person speaking, and then for some reason without any other cameras around shows the other guy talking as well on a rhythm like they're three to four cameras, and they're really supposed to be just two.  And the cartel thing is probably the most confusing, which centers on a planned hit planned by the cartels on officers Brian and Mike since they had a habit of stumbling onto their secret housing units, and viewers are never informed about other cops informing them of their lives can possibly be in danger.   Which that entire experience alone reminded me like a bunch of actual newspaper clippings with the worst ones put together using only the two main characters of Brian and Mike going through all of them in a spawn of a few months, and to me the odds of that happening is like when seeing pigs fly.  Natalie Martinez Anna Kendrick and America Ferrera also stars.\n\n2 out of 4 stars",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Very entertaining movie, I will give it 2.5 stars.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "Needs a little more plot!",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "Nice film loved the way they filmed this",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "GREAT movie, just the cursing was repetitive",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "Cautionary tale of violence in combating the cartels. Sheds light on the depth of the gang problems we face. Will acted by the leads, though hard to watch for dime violent/disturbing scenes.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "On the surface, End of Watch may seem like the average buddy cop movie. However, with very strong performances from Jake Gyllenhaal and Michael Peña, End of Watch is a very thrilling, and emotional film. The only complaint I have is that the found footage style can be a tad bit annoying, but that is only a minor flaw in an otherwise great movie.",
            "review_date": "2014-04-20",
            "source": "rt"
        },
        {
            "content": "If there is one movie I could recommend to watch right now on Netflix, this is it.  End of Watch is hands down the best cop movie I have ever seen and it is masterfully filmed and acted. The entire movie focuses on the relationship between 2 cops and it is all filmed from a handheld camera type view which makes everything very up close and personal.  There are so many tense scenes and the ending is incredible.  It is fun at times when the two cops banter back and fourth in the car and everything that happens just digs deeper into their close relationship inside and outside the force.  It is very gruesome and bloody at times and super realistic, you might even think these are true cop videos. All in all this was an amazing film and one of the best I have seen in awhile.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "This movie is one of the best buddy cop movies ever!!! It's so intense and suspenseful, great action, great drama, it seems like a found footage type of film like paranormal activity but it's way better, you feel for the cops, great chemistry, this movie is Awesometacular ð'?ð'?ð'?",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "Well made found footage drama.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "While End of Watch is full of immaturity, poor acting and loose ends, it is a perfect example of any 18 year old boys dream movie.  When you overlook a few minor details and allow yourself to enjoy the thrill ride, you will find that its a ride worth taking.  In one sentence this movie is: I'm young lets go in, guns blazing.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "I turned it off at the first 20 minutes because of the camera. I felt really dizzy because of it. Then I watched it again in parts. Good movie dispite of the moving camera that I can't stand.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Although formulaic, the undeniable chemistry between the leads makes this a treat. Pena especially - his pain is your pain.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Michael Pena really adds some charm to what could have been a really cliched character, and stands out the most in this.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "I was so surprising and inpressed when I watched End of Watch. I had no idea it was such a good movie. The trailer had me thinking it wasnt going to be that good, and that the style of filming was just going to drive me crazy. But I watched because it was a crime movie and I was blown away. It's intense or hard to watch at times, and some scenes surprised me at how cruel people can be. And the ending was amazing, I didn't expect it at all.  Movies don't end like that very often, and this one does a better job than all the rest.  The only things I didnt like where some of the lines, some of the jokes and obsessive swearing.  The filming style was different, not great, not bad, but some of it I didn't like.  Other than that amazing, best police movie I've seen.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "End of Watch surprised me. From what I thought would be just a dumb violent cop movie turned out to be a fun actiony thrill ride! The two main characters are cops that patrol the streets of Los Angeles busting out major crimes and criminals. I felt that using a camera as if it were a documentary was a good approach to show real violence and that this stuff really does happen. The characters were great the two main cops when together are fantastic! They are funny, entertaining, and very understanding of one another. The villains however I hate. They are boring and seriously annoying. Villains can be likable however this is not the case. You really felt for the cops because you just really got to know the characters. Great movie just hated the villains. B+",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Easily one of the best cop movies of all time !",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Unrelenting. Intense. Visceral. End of Watch is a blend of Training Day and The Hurt Locker so if you enjoyed those films, your interest should be piqued.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "It could have less f bombs in a row.",
            "review_date": "2014-03-31",
            "source": "rt"
        },
        {
            "content": "Similar to the late TV show Southland, which I found to be a more effective medium/vehicle for this setting and subject.",
            "review_date": "2014-03-31",
            "source": "rt"
        },
        {
            "content": "Solid film. This film literally takes you on a journey, as you follow two rising police officers through their everyday patrol. You know, I never really appreciated police officers until watching this film - seeing how they lay down their lives everyday just to protect us normal people. This film makes you laugh, cringe, and cry. WATCH THIS.",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "There is no better way to describe this movie than: Fu%*ing amazing.  The chemistry between Gylenhaal and Peña was captivating and the script was enticing.  A definite \"must watch\".  Be prepared for a roller coaster ride of emotions.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "the character development the director allowed in this film, gave the movie a personal touch which by the climax of the movie made you care and feel for these guys. great film and exhilarating performances by both micheal and jake!",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "Pretty raw footage film of LA cops and their routine life's on the force. Some decent character development and a shocking finale set this movie in one of the upper echelon of this genre.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Poor story, poor camera work, terrible ending.",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "incredibly powerful movie. great acting and directing",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "It started out good, but it took forever to get to the plot, which ended up lasting only about 15 minutes. The other 90 minutes was kinda like watching COPS.",
            "review_date": "2014-03-24",
            "source": "rt"
        },
        {
            "content": "Awesome flic, must see for anyone",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "I think that from the trailers you don't really grasp the sentiment and powerful emotion behind this film.The trailers mostly show you just another mindless cop movie that you'll forget as soon as you get to your theaters parking lot,but what the movie really is probably the best cop movie ever made showing you every day life of this two cops on the streets of L.A maybe even changing your general picture of cops that cops are this good guys that have to catch the bad guys and not give a crap they also feel and also make mistakes.A film I thought surely would be garbage,turned out to be one of my favorite action films of all time highly recommend it.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "It looks like the old tv series/documentary cops, but as it goes it feels like a movie. The duo is pretty cool, the ending is not great and a little obvious.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Hardcore cop/gang realism and truly commendable acting. I'm sad I missed it on the big screen.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "Impressive, mostly due to cinematography. It's a good plot, nice character description, and perfect way to end.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "I waited a long time for a movie like this to come out. Maybe all the build up and fantasizing set the bar to high. End of Watch isn't even shot that well, and that's about all it would have going for it. It's like a staged version of Cops, making it worse because you know its not real. Altogether, End of Watch is as shallow as a puddle on the sidewalk.",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "This was a movie that I really wanted to see when it was released back in 2012, but for some reason never did, and up until last week had pretty much forgotten about it. I wasn't sure how I would react to it because often times police type movies get twisted with a negative spin. Although this movie did have some odd parts to it, all in all I was glad that I took the time to watch it. I think sometimes that what police do may seem odd and maybe even insincere to the average civilian, but that is usually because the average person does not understand the intricacies and stresses of the job. Now I am not saying that this is how all police officers act, but I think it helps to understand just how stressful and dangerous this job really is; especially in certain areas. The movie does a really good job of portraying why some of these actions take place and I hope it helps us all understand a bit better what this job entails. This is certainly not a show for the light hearted, but some of the goriness is actually reality. Hiding from it doesn't change that fact of life. The main acting duo does a tremendous job of portraying both the on-duty times and the off-duty times. Police officers are normal people off duty just trying to have a normal life like us all, but when they are on duty they only have themselves and their partners and coworkers for survival. This is probably a movie everyone should watch just to get a better understanding of the people in blue. I know I will probably end up watching it again as well.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this movie a lot. It made me miss SouthLAnd. The ending was really sad, but realistic. I look forward to watching this movie again soon.",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "I really wasn't sure about this in the first half an hour but I started to warm to the characters and as the film went on it came into its own and ended up being an authentic feeling alternative take on 'the cop movie'. The concept behind the handheld cameras works relatively well and makes this feel like a 'ride along' through South Central, which appears to be a scary place.",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this film, Gyllenhall amazing as always! Deserved more plaudits for sure",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "Watching this film makes me tear up, just a little bit. Perhaps that has to do with the plot, but it most likely is because this movie boasts the best on-screen chemistry between leads I have ever seen. Gyllenhaal and Pena are gold, and their dialogue is so loose, so sharp, so genuine. With the interesting documentary style, the film looks real, as opposed to being, well, a cop movie. Anna Kendrick and the supporting cast are so good as well, but the leads make them look almost wooden in comparison. This is Ayer's crowning achievement.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "WIth End of Watch David Ayer once again delivers another hyper-kinetic paced and hard boiled drama. His protagonist are more lovable than his previous detectives, and they still deliver the addictive quick quips and rolling monologues we adore. Although Gyllenhaal and Pena were phenomenal, what made End of Watch stand out was his creative use of camera perspectives and editings. This made the movie feel like a punch in the guts dramatic reenactment of our favorite COPS episodes.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "A true win for David Ayer, End of Watch strikes with intense realism as well as incredible acting. A beautiful script keeps the piece light which causes harder blows when the time comes, as well as the chemistry between the two prominent stars Gyllenhaal and Pena. This film knows how to keep you attached to its every breath, with the documentary-style filming only bringing you closer to the story, characters and setting. An incredible film that truely exprsses that hardships endured by our heroic watchmen.",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "End of Watch is a phenomenal movie. The characters are very well developed, allowing for the audience to become attached to each one. The plot, while confusing at first and very gory, all ties together in the end perfectly. The acting is excellent and the handheld documentary-esque camera work adds to the realistic feel of the film. There is no single scene in the entire movie that felt unnecessary or over the top, each and every scene pertained to the story. End of Watch is a fantastic film, but not for the faint of heart.",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "I must be honest with myself... As much as I would like to say I didn't enjoy it... well I did to some degree. I think the objective was to show what it's like being a cop that handles cartels, gangs and messed up situations... and sooner or later cop or no cop gangs rule over authority... LAME! I better go back to watching COPS on television... why make it a movie? End Of Watch good for a one time enjoyment.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie. Every time I watch it, I always cry.",
            "review_date": "2014-02-21",
            "source": "rt"
        },
        {
            "content": "The camera angles were amazing and kept the excitement up. The acting was really good and realistic. Throughout the movie they show how in sync the two police officers are. It gives the viewers a chance to see how it really is to be an officer and the dangerous they face.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "just awesome. a must-see movie.",
            "review_date": "2014-02-19",
            "source": "rt"
        },
        {
            "content": "This movie \"End of Watch\" is full of intensity. It's extremely epic. The performances in this movie are really good. \"Jake Gyllenhaal and Michael Peña has \"outstanding chemistry!\" The directing and writer of the screenplay by David Ayer is great. The score and effects are perfect. The only part that I have a \"negative\" thing to say is for my opinion, the were some slow parts in this movie. \"I'm raving that,\"End of Watch\" is a powerful, gripping, and riveting.\" \"One the best cop movie!\"",
            "review_date": "2014-02-19",
            "source": "rt"
        },
        {
            "content": "I wasn't very keen on this film...I didn't like the format; too many 'cameras' and I feel they should have just stuck to one point of view.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Thrilling to the very end!!!",
            "review_date": "2014-02-16",
            "source": "rt"
        },
        {
            "content": "Os ângulos de câmara utilizados conseguem ser por vezes confusos e os diálogos têm uma pitada de cliché incluída.... Contudo recomendo este filme pois a luta entre a policia de Los Angeles e gangues de negros e hispânicos são temáticas bastante aliciantes e mexidas! \"End of Watch\" traz algo de novo que em muitos aspectos faz mais lembrar um First Person Shooter! 75-79% :D 13/02/2014",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "This movie exemplified phenomenal camera work - the documentary genre throughout the entire film allows the audience to have the feeling of being in the action and greatly intensifies reactions to climactic aspects. The actors had an incredible chemistry that came across consistently throughout the entirety of the movie. a",
            "review_date": "2014-02-12",
            "source": "rt"
        },
        {
            "content": "I hate that this movie was as sad as it was.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "one of the best cop movies of all time!",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "Earnest look at the lives of two cops on the beat on the mean streets of LA, where they constantly encounter the worst of the USA's failed multicultural society. It's very good in patches, but overall, it's hard to like a movie where the cops are almost as unpleasant as the assorted human scum they have to police. Oh, and this extremely foul-mouthed movie probably breaks records for the use of the F word.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "A masterpiece! Hollywood has shown countless times what they think happens to cops on a day to day basis, but David Ayer shows us the reality. The performances, the writing, the directing, the cinematography. What fascinated me so much about this film wasn't necessarily the plot, but it was actually the conversations between Gyllenhaal and Pena in the squad car. It feels so real and so natural. A really fascinating film that just put me on my ass! A really fantastic achievement!",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Go with it and you'll be rewarded with a visceral and tense 'real-life' police drama, but sometimes does just lack something. Maybe it's some of the cliches it throws in, but still the banter between the two actors is good and engaging!",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "Besides the fact that Jake Gyllenhaal and Michael Pena are cops I didn't get too much by way of plot from this. Plays out like the everyday adventures of an LA cop with added banter until they piss off a big cartel. As suspected this doesn't do anything  I haven't seen done better in The Shield (also based on LA Ghetto) which I couldn't help but liken it to as it shares same gritty shakes cam style. It does have a good ending though.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "Arggh. This is one of the most frustrating movies I have ever seen. On one hand you have the two lead actors who are absolutely marvelous in their roles. You buy who they are, their friendship, and their fear. The scenes where they banter back and forth in the cop car make this movie. On the other hand, the director has no sense of pacing or idea how to do a found footage movie. We don't need the scenes at the quinceanera, the wedding, or Jake Gyllenhal making out with a woman. They're boooring and really questionable to why some guy is filming JG getting his groove, other than, you know, obvious reasons.",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Really good and entertaining movie. Loved how it also felt like the show \"COPS\".",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "This is the best found footage film I ever seen",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "Love both theese actors great film.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Pretty good movie. I think the high tomatometer actually matches the movie on this one. It is artsy but I think it helps the movie. Being filmed with different cameras and documentary type style kept it interesting. The fact that they developed the bond and human nature of the 2 leads in this film made it so much more interesting. Pretty cool watch and certainly worth the time.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "Great! Lots of vulgar language, but appropriate for the film.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "MUST SEE!  looks wack at first glance but guess again",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "'End of Watch' poses as a video blog showing the experiences of two LA south central police officers. Its handheld camera style shooting gives it an authentic look, helping better capture the atmosphere of each scene. Bits where they are doing 'down n dirty' police work are good, with particular scenes actually quite shocking. However, the cocky duo aren't entirely likeable and the constant cop banter isn't that engaging. Definitely less gritty than expected; most of the focus is on the jokes and love interests of these bestest of buddies cops while the interesting street stuff, like the hint of a mexican-black turf war, amounted to nothing. It has its moments but this film is not as good as it thinks it is.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "Loved this film. It was emotional at times and a good watch. I thought this was down to the way the camera was set, following the main characters everywhere like a documentary.",
            "review_date": "2014-01-13",
            "source": "rt"
        },
        {
            "content": "An enjoyable film which employs a quasi raw camera approach and pieces a story together with seemingly everyday events. The plot centers around two cops who wander into criminal activity that is way over their head and soon have been marked for death by some very bad people. The characters are likeable and the stong suit of this film. The ending felt anticlimactic and the cgi enhanced blood was extremely irritating. This movie contains very harsh language and violence.",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "I actually really liked this one, I missed the beginning but still really liked it",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "Great chemistry and emotion in this meticulously researched cop buddy movie. Slightly marred by the \"found footage\" device -  finding more and more ridiculous and jarring  ways to explain why it is all being captured on handheld camera for absolutely no reason.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "Incredible dialogue, stupendous acting... It's a must see.",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "David Ayer is quickly becoming one of my favourite filmmakers. End of Watch is wickedly entertaining and intense. Jake Gyllenhaal and Michael Pena have amazing chemistry and I love the \"documentary\" type filmmaking. Feels like watch a super high-budget version of COPS",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Wat een goede film zeg! 1 van de beste politie films in jaren! Subliem acteerwerk, degelijk script met een fenomenale opbouw tot zijn aangrijpende climax! 5 stars..a must see!",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Very interesting and moving movie",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "Marcados para morrer tem a energia, a devoção a personagens e performances carismáticas para superar as armadilhas familiares de seu gênero e formato portátil",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "An emotionally gripping tale of two partners fighting crime together. End of watch is a unique spin on the Cop movie business, while delivering some great performances, gritty action as well as some great dialogue sequences. The end of watch may not appeal to some viewers, but it is a great film for those who enjoy it's content.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "An amazingly realistic portrayal of the foot soldiers that patrol the dangerous street of LA. The two leads make you care for them within minutes and the story's ultimately dark ending leaves you blown away. One of the top 5 films of 2012",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "great acting but the story was all over the place until the very end. Shot in documentary style, no movie should be shot that way.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "This is a formulaic cop film that is still watchable. It that feels a lot like Training Day (Also by Ayer). The plot itself gets ridiculous at times. At one point in the film the cops respond to a disturbance and happen upon something above their pay grade. Later on they respond to another random call that ends up being seemingly connected to the same thing. Yes, it's trying to move the plot along but that's just sloppy.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "OMFG I love this freaking movie . It is so interesting and action-packed .",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "Builds slowly but gets there in the end. The whole videocam thing didn't make much sense. Most of the film was clearly trying to look like handycam work but also clearly not Taylor's camera.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "So good and crazy sad.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Very emotional movie. A must see",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "The best cop movie of all time. It's entertaining but extremely powerful with an ending you won't forget",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Gritty...stick in there.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Great movie, good action and not a predictable plot line. Good movie for people who like police and gang films. Best cop / gang film since. Colors",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "A little unrealistic but overall a good movie.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "fast paced loved it.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Riveting and sad!! A look at the dangers of policing",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "A refreshing take on the cop movie.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Fucking one of the best.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "*spoiler* Only movie I cried in towards the end. The movie, although slow at times, keeps you wanting to know about the friendship between the two officers, and in the end, leaves you feeling like they were your friends as well.",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "Great damn film by David Ayer.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "End of Watch has been successfully overlooked and underrated thanks to its familiar premise but is anything but the generic buddy-cop action flick. Gyllenhaal and PeÃ±a have an incredible onscreen chemistry.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "Quality. Another must see.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "I was literally on the edge of the my seat for most of this movie. It could go a lot deeper if it had sequels and prequels and what not but the bottom line is that it doesn't go any deeper as a police on the job, and this movie gave that perspective excellently. A huge plus- the handheld camera gimmick didn't interfere with the movie for once. Intelligently switching between \"hand-filmed\" segments and actual camera shots really saves the film without sacrificing the narrative.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "great movie! shows what really goes on, and what your local news station doesn't report.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "This movie must hold the record for the number of times the word \"fuck\" or any of its derivatives is used...I mean it is like so fucking cool, man, and those cops are so badass in those mean streets with the hip-hopping, drug-popping Mexicans like it drowns in its own verbal diarrhoea - I mean like shit, man. Really shit....",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "A tough, gritty cop movie that although falls short on the technical aspects of movie making, succeeds in making these characters extremely likeable. \n\nThe movie almost falls into familiar genre tropes but manages to stay afloat mostly due to its stars, Gyllenhaal and Pena (whose character is the highlight of the film) and its consistent groove. This also marks a series of Gyllenhaal movies that got by almost unnoticed but proved to be excellent (refer to Zodiac, Brothers and Source Code.)\n\nThe movie falls short on its conventional mockumentary style shooting (which at times, feels gratuitous between still shots) and Anna Kendrick is hard to swallow in her role, but overall this is a haunting piece about the reality of law enforcers in drug-charged areas.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Good movie.  It's a cryer. keeps ur attention.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "really enjoyed this intense movie",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "Really interesting filming style, but amazing character chemistry combined with a realistic and heart pounding story. The only thing I wasn't a fan of was the ending and not only how it played out, but how it was shot.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "The filming of the filming gives this movie some interesting perspectives, the time line is a bit unclear to me, but the two characters work well together in this somewhat predictable cop movie.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "This movie totally changed the way I think about police. Such a powerful film 5/5",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "One of the best cop dramas I've seen. Not a feel good movie, very realistic.",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "EoW is a feature-length amazingly great episode of \"Cops\" with some great camera-work and dialog. Do not miss.",
            "review_date": "2013-12-04",
            "source": "rt"
        },
        {
            "content": "The best cast of acting this year! the whole cast brought it and then some.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "exciting and suspenceful story and action at every turn.",
            "review_date": "2013-11-30",
            "source": "rt"
        },
        {
            "content": "I think this is the best cops movie I've seen.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "One line summary: A good script tarnished by terrible camera work.\n\n-----------------------------------\n\n    The film is about LAPD cops, and mostly about the partners, ex-Marine Brian Taylor and Mike Zavala.  They make some lucky and high-profile arrests and get some notoriety.  They also attract the attention of a Mexican drug kingpin.\n\n    There are some great arrests, as well as significant arrests foiled by federal agencies, plus loss of colleagues.  Taylor's wedding to Janet was quite a talk fest, but was reasonably written and acted.  The rotten camera work, throughout, just put a damper on everything.\n\n    They find more horrible things during routine investigations.  They learn from an informant that there is a paid hit out with their names on it.\n\n    The Mexican gang lures them into a trap and attacks with heavy weaponry. They get a message out calling for backup, which seems dreadfully slow in coming.  Taylor takes one in the hand and later one in the chest.  While Zavala tries to revive Taylor, he is surrounded by gang members who unload dozens of rounds into him.\n\n    Backup arrives and a fire fight immediately ensues.  The assassins are mostly killed.  There is a huge police event afterward for Zavalos, whose body shielded Taylor.\n\n    The last segment, shown after Taylor struggles to say what he feels at Zavala's ceremony, was perhaps the best segment of the film.  This was not so much for the content of their conversation, but for the evident bond between brothers-in-arms.\n\n------Scores-------\n\n    Cinematography: 0/10 The film used button cams, security footage, and various hand-held cameras to give a deeply incompetent presentation.\n\n    Sound: 8/10 Fairly good considering the video.\n\n    Acting: 6/10 Who can tell what the actors are doing when the cameras are out of control?  Gyllenhaal and Pena were great, despite the director's contempt for the viewer; otherwise I would give this category a zero.\n\n    Screenplay: 5/10 Way, way, way too many abrupt cuts.  The thing looks like a quilt made from left over cloth pieces put together with duct tape.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "DAYUM!  That was a really intense ride.  Great cinematography for sure with some good writing, acting, direction and so on.  Sometimes it feels like a documentary film, but then we are drawn back into the personal stories of these two young LAPD officers working the streets.  It is a bit of a roller coaster going up and down and back and forth between deeper personal bonds formed by these two cops and then the intense hell they must confront together, which is the basis of their bond.  It's definitely a brother in arms type of story.  It's a tough film for certain, but I appreciate the grit of it, as it doesn't seem to pull any punches.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "Probably the most realistic cop movie I've ever seen. The acting by Gyllenhaal and Pena is amazing, and the tone along with the direction makes you feel like you're right in the middle of the action.",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "I didn't expect this to be a great movie, but I was wrong. it's a very good movie.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "Great police thriller...documentary style of shooting was great.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "Solid fun. Even though at times it just felt like meandering. The script was a little weird in that sense. Two cops running around. Sometimes having fun. Sometimes busting bad guys. There was no real, \"Break into 2\", nothing like that. Just more good times. They weren't even really trying that hard to catch the local cartels -- they just stumbled upon it by accident. The opening sequence was really cool though. The ending was also heart wrenching. I was entertained. Watch if you like good fun action cop dramas. Decent Concept Decent Execution.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "What an emotional roller coaster! Not many movies can pull off the first person view, but this movie is an exception. Gyllenhaal and Pena hit is out of the park. It's rare to see an on screen pair go together so well. I absolutely loved it!",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "wow fantastic simply fantastic",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "Im an ex gang member from a notorios gang in texas.this are reallife events that my neighborhood gave me..wen i first saw this movie, i had memories about my past. Not good!\nIts an awsome movie. Cops do go through rough times with gang members and drug cartels. If i wasnt a felon i would have become a cop to protect and serve my community....love this move!",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "best movie of all time!",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "watchable movie...patches of good action leading up to the final standoff The end...not worth a movie ticket",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "Very melodramatic for a cop movie",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "A decent cop movie, but there really was no point or message behind it, at least not one that I know of. I guess it was just showing what hardships they go through to get rid of crime. Anyway, it's nothing like Training Day, which is worth seeing much more.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "one of the best handheld movies. the performances form the leads were amazing and the story was great.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "Lost footage video camera BS. Should've ended at Blair Witch. Other than that, not very interesting or compelling characters.",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "Definitely worth watching! Love the two lead characters.",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "best cop movie of the year.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "Gylenhaal and PeÃ±a are great. Very heartfelt and it was a movie that made you really care about the characters. Well paced and filmed. Great movie.",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Not very into the live camera feel, but Ayer pulled it off with accuracy.",
            "review_date": "2013-11-06",
            "source": "rt"
        },
        {
            "content": "Every now and again, I manage to sort through the rubbish Netflix affords me to land a gem like End of Watch.  With several actors you've seen, including some of the finest chemistry I've seen between two characters since Psych, Officers Taylor and Zavala give us an often too graphic look at the life of an LAPD officer.  \n\nThis movie zips right along while making the viewer laugh, jump, and ultimately want more.  Even if it wasn't free to stream, I'd pay to watch it again.  Well done David Ayer!",
            "review_date": "2013-11-04",
            "source": "rt"
        },
        {
            "content": "Colors for the Grand Theft Auto generation. What it lacks in originality it more than makes up in energy and tremendous feeling of authenticity. Gyllenhaal and specially Pena are so believable you would swear they've done this before.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Decent. Had some compelling parts, and cool performances, but Training Day is a much better all-around \"L.A. Police\" film.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Despite the handheld/ found footage format being a little off putting, the movie shines with its character development and emotionally brutal ending.  Michael Pena knocks it out of the park in this one.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "Pulls at your heart strings.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "\"End of Watch\" could have been about two friends who occupy any dangerous profession and it would have been just as effective. In a sense, it is not your average buddy-cop movie it is disguised to be. Both leading men prove that acting in a film is realistically imitating a person. They do not overact, they look as if they were taken straight out of a documentary. If best ensemble cast can go to two people it should go to Gyllenhaal and Pena. The cinematography composed of found-footage sequences is effective, but look for no originality here. The true heart of the film actually lies in the direction and the screenplay. David Ayer knows how to use the camera effectively and also knows how to write practically. He squeezes depth out of every moment in the film. The film explores that dangers of the drug cartel, and a police officers born duty to protect the citizens. The film did not resonate with me as much as it did with some viewers, but \"End of Watch\" is a crisp representation of friendship and duty.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Gritty guerilla style action, anti Hollywood stripped down actioner, let down by run time and heavy handedness. Gyllenhaal thankfully giving us much better performances!",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "Until I saw End of Watch, there was only one film that mastered the hand-held camera effect, and that was Cloverfield.\nWell now, in my opinion there are two VERY WELL made hand-held camera films.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "One of the most realistic cop movies I've ever seen!",
            "review_date": "2013-10-28",
            "source": "rt"
        },
        {
            "content": "Most gritty, realistic, and best cop flick I've ever seen. Moving, thrilling, sad, enthralling and so informative about what almost no one realizes about the diifficulty, bravery, and ethics needed to be an excellent cop. If you're tired of the boilerplate corruption law enforcement blather of most other police dramas, this is special!",
            "review_date": "2013-10-26",
            "source": "rt"
        },
        {
            "content": "Street talk that doesn't sound a bit like street talk.  Cop talk that doesn't sound a bit like cop talk.  Gun moves that are absolutely stupid.  Physics defying action scenes.  For all the praise for \"realism\" I found this movie full of four letter words misplaced and misused.  I say them more convincingly than that.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "First time I've actually fallen IN LOVE with a movie, or television show, ever!!!",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "Action and comedy + bromance and tragedy",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "Despite all the things promised in the trailer 'End of Watch' is a pretty decent film.",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "Slightly cliched in places, but for the most part it's visceral, nerve shredding and a must see from the writer of Training Day",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "A really great action buddy cop film I loved it!",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "A really great action buddy cop film I loved it!",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Best cop movie ever made",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Watchable, great action.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Riveting and engrossing thrill ride.  It brought you into the characters lives and really made you root for the cops for a change.  Good movie",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Gritty and gripping. An emotional roller coaster. Fantastic acting and I appreciate the realism effort.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Exceptional movie making, you get so close into the action, you forget that it's fiction, the documentary style filming of some parts will jar with some people - but it felt right to me. The acting is top notch, an all round great movie.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "This film is a definite watch for any action junkie, and seemed all the more relevant after the recent release of the Xbox Game GTA V. This film gives you a brief (and over exaggerated) insight into the life of two LAPD cops, who are great friends and also very successful at what the day,\n\nThis film produced a few laughs, cringes and the occasional tears (not from myself) and is an all round enjoyment that I'd recommend strongly. A note to mention briefly is Jake Gyllenhaal's solid performance, an impressive actor in my eyes.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "From the writer of (the very very similar) Training Day which also features the lives of 2 cops driving around Hispanic suburbs of LA, this film takes a slightly different take as we no longer follow the lives of undercover detectives but see the daily goings-on of Jake Gyllenhaal and Michael Peña's LAPD boys in blue. Using some handheld camera footage, the film cleverly switches to an omniscient camera using the same style at specific points, we see the two swapping from the routine vehicle violations to the gruesome discovery of human trafficking as well as getting mixed up in gang violence and its aggressive repercussions. Gyllenhaal and Peña have a believable chemistry which is crucial in such a \"buddy\" movie and there are genuine moments of tension and friction all filmed with an authentic reality in the heat of Los Angeles. A few of the plot points are a bit convoluted but it could be argued that it reflects the haphazard nature of the policeman's job and it hits the obligatory home life signposts that are all too clichéd in this type of story (new born baby, conflict with girlfriend, job versus family occasion scene) but the film attempts to move forward quickly from these to get us back in the action as soon as it can. A shaky cam but unremarkable Fair Watch Project 7/10 Midlands Movies Mike",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "A very gripping drama that keeps you interested from start to finish.",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "Great performances except for the corny not so well acted gangsters. Wish the flick wasn't  shot with a handy cam half the time, but other than that a really solid film! :)",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "At the end of it all, it's utterly forgettable.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Finish watching it in man tears every time",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "While the verite-approach is never used to the fullest extent, it still makes occasional bouts of action seem more like a video game than real life. However, the film cares so much about its characters and takes so much ample time to let them breathe and inhabit their space, it earns its eventual pay-off.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Police version of ladder 49. Still great viewing.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "I concluded this was pretty good, after my end of watch.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Great vantage point of seeing things from different perspective literally.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "An edge of the seat, intense cop drama. Brutally honest and at times shocking. Not for the faint of heart.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "reallly awesome movie MUST WATCH",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Arguably one of the best police dramas to come out in the past decade.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "The movie starts off slow and is filmed in a not so typical fashion. But by the mid way point of the movie you feel like you know Gyllenhaal and Pena's characters. The ending only builds off this connection. Really enjoyed it.",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "Very entertaining but kind of inconsistent with the handheld camera thing.",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "Most heart wrenching movie about what street cops do and what can happen.Acting rates a 10. I thought they pulled two cops off the street. But the actors were too good. Best cop film since The Onion Field. Even stands up to The Wire",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "This grabs you by the balls and sings to your heart. A beautiful tale of loyalty and justice drenched in juvenile jokes and heartwarming sentiment. If you're a buddy cop fan this is a must see. Stellar performances from both Gyllenhaal and Pena.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "Brilliant police drama.  Certainly not your standard one and no Hollywood ending.  Gritty, real and emotional - explores the human side of cop life, the personal relationships, trials and tribulations, as well as police work.  No punches are pulled in engaging the viewer.\n\nGreat performances from Jake Gyllenhaal and Michael Pena in the lead roles.  The interactions and relationship between their characters are what makes this movie so great - it is spot-on.  Good support from Anna Kendrick and Natalie Martinez.\n\nOne of the best cop dramas you'll ever see.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "Gritty, realistic cop drama set in LA. Two cops who are also best friends traverse the dangerous streets of South Central. This film has a real honesty about it with fine performances from the two leads. Unfortunately it is let down by simplistic and directionless directing. The use of hand held is definitely a poor distraction.",
            "review_date": "2013-09-27",
            "source": "rt"
        },
        {
            "content": "great movie. Until the last few minutes.",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "Probably one of the best movies I ever saw! Enough said.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Familiar, yet involving and often funny \"pseudo-doc drama\" involving a pair of young cops with hero complexes on the beat in South Central Los Angeles.\nFrom the talent behind \"Training Day,\" this glimpse into those charged to \"Serve and Protect\" does manage to shed a human light on the men behind the badges.\nTerrific performances from its leads makes this intense police drama worth a look.\nGraphic violence and language should be noted. This \"Watch\" is for adult fans only.\n\nM Foster, Flixnerd.com",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Movie Review for \"End of Watch\"\nBeing a police officer is not an easy job, but being a police officer in the streets of Las Angeles, California can be even a tougher job. In the movie \"End of Watch\", two police officers named Brian Taylor (Jake Gyllenhaal) and Miguel Zavala (Michael Peña) are committed to keeping crime off the streets and making it safer. Jake Gyllenhaal and Michael Peña's acting not only allows you to relate to the movie, but it also keeps you on the edge of your seat the entire movie.\n\t\"End of Watch\" is not your typical action movie. The movie is mostly filmed by Officer Brian Taylors's video camera which allows you to feel more involved in the movie's plot. David Ayer does a good job of introducing us to the plot by starting the movie with the cops fighting crime, but then as the movie goes on showing the dangerous things that cops have to experience sometimes. The most dangerous thing in the movie that the officers have to face is the Mexican drug cartels. The plot of the movie keeps you interested throughout the movie because as time goes on, the two officers have closer encounters with the drug cartels. David Ayer uses the rivalry between the drug cartels and the police officers to not only develop the plot, but keep us interested on what's going to happen next. \n\tThe acting by Jake Gyllenhaal and Michael Peña as the two officers is phenomenal. The movie introduces the officers as partners, but throughout the movie you realize it is much more than just partners. The two officers throughout the movie develop a friendship that makes us wonder if these two actors are actual best friends. David Ayer does a good job throughout the movie showing us the friendship of the officers by having good dialogue and comedic conversations. For instance, the two officers would always talk about one another's life, family, and struggles while driving around the streets. Another way good acting is portrayed in the movie is when the two officers are being shot at by the drug cartels. The two actors make it seem believable that they are in actual danger by their emotions and dialogue. For example, Officer Taylor's emotions can be seen when he says to his partner in a brave but concerned voice, \"Look at me. On three, dude, you're gonna empty your mag and run.\" The overall acting in the movie is outstanding and Jake Gyllenhaal and Michael Peña do a superb job of presenting the challenges officers encounter every day.\n\tMost people can relate to the movie when it comes to trying to start or raising a family, but still having to go to your every day job. Officer Miguel Zavala says \"Marriage is forever, it's a promise before god.\" This quote represents society's outlook on marriage and marriage is also a stepping stone to starting a family. In the movie the officers are both married and trying to have kids, but at the same time working at the police station. People can relate to this because most people want to have a family and a descent job they are proud of doing. The two officers obviously know the dangers of being a police officer, which is also another reason some people can relate to the movie. For example, some people have jobs that don't always guarantee they will be home that night. \"End of Watch\" represents how some people can relate to the movie by showing the importance of friendship, relationships, or even the positives of raising a family.     \n\t\"End of Watch\" shows the struggles and benefits police officers face every day. David Ayer does an excellent job of not making this a typical cop movie. \"End of Watch\" is a must see movie that wont have you disappointed. Overall the movie is an action movie that will keep you on the edge of your seat throughout the entire movie.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "Holy moly this was a movie!! I was not at all prepared for the emotional roller coaster this put me through, but dang it was good. The acting was amazing and the story was even more. Truly TRULY one of the best movies I have seen.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "La dura realidad de nuestras ciudades vista desde el punto de vista de dos policías honestos. Una buena oportunidad para compenetrarse con las personas que a diario arriesgan su vida.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "Strong performances and great chemestry from Gyllenhaal and Peña, good dialogue and a well made realistic feel. It´s your typical cop vs. drug dealers story, but the movie relies on the relationship between the leads, and does a good job with their development. The found footage style works at times, but is distracting in some scenes. Overall this is an entertaing drama, with the right amount of emotion.",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "Much like Blood in Blood Out, this movie just pushes they stereotypical racist ideas that have been so overdone, they're funny.  Having worked with gangs in the past, as a cop,  none of this seemed realistic to me.  Training Day did better, and personally I think this movie tried to copy the success of Training Day, but did a horrible job in the process.",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "there were some technical issues but I liked it.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Truly riveting movie.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "I was not a fan of the abrubt ending, but it was a good movie overall.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Very Strong Performances by Gyllenhaal and Pena make this film worth seeing despite a handheld format that takes away more then it adds.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "Damn one of the best cop movies ive seen",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "The characters filming their selves didn't make much sense sometimes, but I just didn't care because the movie is very entertaining, funny and the performances by both Gylenhaal and Peña are very good and convincing.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "Shot documentary-style, this film follows the daily grind of two young police officers in LA who are partners and friends, and what happens when they meet criminal forces greater than themselves.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "This movie was crazy. Full of stuff you wish you could never see. Great performances by Pena and Gyllenhaal. Anna Kendrick's inclusion added to my delight. The ending was the best part.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies in 2012. Reverting story about two cops just doing there everyday lives while working the streets as LA cops. Anything can happen, anything goes.\nThe two main characters are one of the best buddy cops and even just couple in a long time. There chemistry is so good it actually feels like there best friends and you know they are how they joke and play around and have each other's back.\nThe story is pretty good as well, along with the directional effort from the man who wrote Training Day which at times, does feel like it and remind you of it. Especially the openin scene where the cops are on a car chase. \nGreat movie, recommend it to anyone",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "End of Watch has the energy, devotion to characters, and charismatic performances to overcome the familiar pitfalls of its genre and handheld format.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "The way it's filmed is really annoying...and inconsistent, but I think this allows you to create a closer connection to the characters as sometimes they speak directly to you/the camera and sometimes what you see seems to be content too personal and awkward to be put in a normal film.  Ultimately, you are put in a situation where you feel for these guys and feel your emotions up until the end.  \n\nStill not sure if making us sad and then getting us to laugh soon after was the best choice of scene placement.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "Fascinating and riveting. Filmwork hurt it, but it was still watchable.",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "too much cussing but besides that awesome",
            "review_date": "2013-09-17",
            "source": "rt"
        },
        {
            "content": "I thought a lot during this movie about how how accurate it is. Because if this is truly a representation of what's it like being a cop in L.A., then I have much respect for anyone who signs up. \nThis is done found footage style, and while I grow weary of it, it works really well here. \nWe follow our cops into some pretty scary situations, and almost always with unpleasant outcomes. \nThe only issue I had was the portrayal of the Mexican gang. They almost come off as a parody of themselves with how hardcore they play it. Once again, if there truly are people out there like this(and sadly, I know there are) then we all need to figure out what the hell is going wrong out there. \nThis ended up an unexpectedly  powerful movie.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "I originally had no intention of watching End of Watch, the trailers never sold it to me and the concept of \"found footage\" never appeals to me. That being said, End of Watch is the best police film I've seen since Training Day, which comes to no surprise that Training Day's writer is also End of Watch's writer/director. The chemistry between the two leads is what really sells this picture, without that it would be dead. Jake Gyllenhaal and Michael Pena should have been considered for an Oscar nomination last year and the found footage never really got in the way since the whole movie is handheld. Only two things annoyed me in this film: the high rate of dangerous situations these two self proclaimed ghetto cops get into, and that in certain crazy dangerous situations, the two cops and/or the gangsters chasing them are still holding a camcorder. Slightly idiotic. That aside, End of Watch is an emotionally charged, dark and powerful cop thriller with plenty of action. Wish I had seen this earlier.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "A dizzying tale shot in P.O.V. that will make you question how often lives are unnecessarily lost in the line of duty --peace officer and civilian alike. The human relationships will warm your heart while the violence will leave you feeling sick to your stomach by the end of watch.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "Great movie! Good story, good chemistry between the actors. I loved it.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "When the movie first came out I heard that it was supposed to be very realistic and the details in the movie were actually researched in order to reflect the actual officer's \neveryday life. In other words, I went to see the movie having pretty high expectations for actors as well as over all work of director. Usually movies don't really come close to the expectations (because trailers make movies seem so amazing, while in reality it may not even be worth watching), but \"The End of Watch\" exceeded my expectations. At first it was a little hard to get used to the portable camera and crooked movie shots, but at the same time, it made it seem more realistic that if the movie shots would have been positioned perfectly. Jake Gyllenhall and Michael Pena did a great job by embodying their roles as well as making the audience feel that they were actual cops. Film \"The End of Watch\" shows what a real friendship is, it also shows the dedication, and struggles that police officers face from all over the world. I would rate this movie 5 stars.",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Lead by the remarkable chemistry between Gyllenhaal and Peña, End Of Watch is a surprisingly good cop movie that is not only exciting, but also realistic and moving.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "What a movie!  I watch movies while I work at night, and let's just say I didn't get much work done.  Emotionally gripping and full of suspense.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "Several movies on netflix are usually crap.... but, I stumbled across this gem of a movie.... and was it a movie or what!? Really amazing suspense, thrill, drama, and action...... I would have watched this movie in a theater.....",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "Awesome, Best Cop Movie Ever, Love It",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "Despite, or rather because of, its often distracting handheld camerawork and found footage gimmicks, Ayer's buddy cop action drama feels immediate and authentic while Gyllenhaal and Pena's incredibly convincing bromance adds much-needed depth and emotion to the film's gritty realism.",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "thoroughly enjoyed this one. good performances. the camera gag is a bit tiring but not a big deal.",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "Three stars for the ending...the only part of the movie that was good.",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "A moving, powerful film about not only policemen but brothers - poignantly portrayed by Jake Gyllenhaal and Michael Pena.",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "Coulda done without the handheld. Still, pretty good due to Gyllenhaal and Pena's interaction, which sometimes felt overplayed, but after the climax, the ending scene caps it really well.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Police life and death not everyone will understand it.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Gyllenhaal and Pena get this police brotherhood story perfect. The first quarter of the movie requires some patience, but after that you are taken in by the believability and camera work which makes you feel like your on patrol with them.  An unexpected ending just adds to this work by Ayer. Would highly recommend watching",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "End of Watch was a great experience to watch. Of course my issue was it started out slow, but it progressively got better and they way it was filmed gives viewers a better feel about what it's really like out in Los Angeles and what the LAPD really have to go through, of course it's fictional, but it's more realistic. Gyllenhaal and PeÃ±a give a hell of a performance in the movie. Great job guys and of course David Ayer.",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "As a cop (keep in mind most of us veteran police officers don't watch cop movies. I did only because my trooper buddy mentioned I should) this is as realistic to the job as I've ever seen. Not the violence but the joking around camaraderie, soured PO3 Van Houser, mundane calls, and adrenaline spikes we get in a shift. Recommended to all that are looking to go on watch with us.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Highly recommended, didnt think they made good movies anymore",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "very intense movie actors did a good job!!!",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "I haven't been this tense watching a film since Dredd! Superbly cast, well directed, scripted and shot. I can't think of anything wrong with this film!",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "A buddy cop film where the two leads truly are \"buddies\". Although this film may lack a point outside of creating drama, the characters are done so effectively that it's almost easy to forgive. If only there was some sort of theme or message to tie everything together, this might have been Ayer's masterpiece. It's a reminder that characters are so important in making action scenes feel energetic, they make the danger feel real. If you don't care about the characters in a high-stake situation, then you don't care what happens to them. In the end, I'd take the genuine, raw emotion over any other complicated plotty cop film ANY day.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "I literally held my breath through many of the scenes! What a great movie.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Not a fan of Jake Gyllenhaal usually, but he gives a believable performance, along with Michael PeÃ±a. The editing is great, moving in and out of POVs with the movie within the movie cuts. All the supporting cast is impeccable.",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "The Blair Police Project. The film sees Jake gyhenllhal and Michael Pena play as buddy cops as shot through their own cameras. \n\nGood pace, keeps itself interesting and ranks up the tension nicely. Well worth watching but critics of shaky cams may find this frustrating.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Adding a docudrama feel to the genre of the crime drama from the POV of two young Los Angeles cops, this film stands out in every positive way. The presentation of the setting is so authentic, the story so engrossing, and the performances so strong, that the viewer is left wondering why the film wasn't a much bigger deal during awards season last year. You will laugh, you will look away from the screen in horror, and you will definitely cry. A viewing experience not to be missed.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "If you shoot at me I'll shoot back.\n\nTwo young police officers with either developing relationships or a family work together on the mean streets of Los Angeles.  They both have ambitions of doing the right things and saving people, even if it isn't always by the rules.  One day they step out beyond the rules too far and their lives in the police force may be short live due to their actions.\n\n\"Policing is all about comfortable footwear.\"\n\nDavid Ayer, director of Harsh Times, Street Kings, and the upcoming films Sabotage (Arnold Schwarzenegger) and Fury (Brad Pitt and Shia LaBeouf), delivers End of Watch.  The storyline for this picture is very unique and a nice mix of interesting premise with reality TV film style.  The script is very good and the acting is solid.  The cast includes Jake Gyllenhaal, Michael Pena, Anna Kendrick, Natalie Martinez, and America Ferrera.\n\n\"This may say Purell but it's really KY.\"\n\nEnd of Watch was a movie that interested me when the previews first aired and I recently watched off Netflix.  I found the film way better than I anticipated.  I was truly compelled by the characters and the script and stories were so well written.  This is a very entertaining picture that is worth your time.\n\n\"If you can live without her, then man-up and cut her off. Don't string her along.\"\n\nGrade: B",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Awesome film! Jake Gyllenhaal (great as always) and Michael Pena (never heard of him but I'll definitely be keeping an eye on this actor) deliver great performances and chemistry in this unique found footage, buddy-cop movie. It effectively uses the point of view shots that found footage type films are known for and features some really amusing and continuous banter from the two main characters. Not gonna say much more about this film, but if you're looking for a movie that shows how the police do their work (at least from the point of view of two best buds who are semi-serious about their job), I highly recommend it. So go hunt down a copy and watch it. NAO!",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "Very average and very disappointing.  Also very unlikely with a stupid end.  They'd have both been dead.  Simple",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "Next to L.A. Confidential; the best police drama ever!",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "Very interesting way to shoot a found footage film with this genre. I shed some tears.",
            "review_date": "2013-08-22",
            "source": "rt"
        },
        {
            "content": "Really good cop thriller, also makes me glad that I live in a country where the police are better armed than the criminals. How are first responders and Cops in the US supposed to walk away alive when faced with sociopaths armed with assault rifles and semi-automatics?!",
            "review_date": "2013-08-21",
            "source": "rt"
        },
        {
            "content": "Found it boring n switched off half way...",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "(If you haven't watched this movie yet and want to, this review contains major spoilers): Top critics have been rating this film in the four and five star boundaries and I simply do not understand why; it did not exceed my expectations. Immediately upon seeing what the movie was called, I knew that there had to be a death at the end of the movie and the character to die had to be a protagonist. So, no brownie points for David Ayer, the writer/director of this movie, as its ending at face value is pretty predictable. It's a cop-flick. \n\nFurthermore, I was confused whether or not this was a handheld movie or a fly-on-the-wall movie. I appreciate that Ayer was trying to be original and go with a \"found footage\" style, similar to Cloverfield, but there were so many camera angle pitfalls. Who was recording the Brian and Janet love scenes? Who was recording the prank that Brian and Mike pulled off in the police station? A \"found footage\" film should only be recorded with a handheld camera! I lost count at the amount of times I rolled my eyes. \n\nAnother bad thing about this movie was that it took so much time to get started and went with a very clichéd introduction. Brian introducing himself with a handheld camera in a locker room is somewhat similar to the Paranormal Activity introductions, am I right? \n\nAlso, I found that I got bored once I reached the middle of the movie. This was because the film shone too much light upon the protagonists' relationships with their partners and simply trailed off. It was only towards the end that things got exciting, thanks to some very suspenseful scenes. To name a few, Brian and Mike enter a bungalow to find dead bodies and also have to fight their way out of an apartment complex after being ambushed by Latino gang members. I know, it's very seen-it-all-before stuff, but these scenes make the film dramatically intense and cleverly show the dangers involved by being an LA police officer. \n\nFor the suspenseful scenes, I give one star. The other star I give to Gyllenhaal and Pena and their outstanding performances throughout the movie. They made their characters unutterably believable and didn't overdo it with the comedy, which the absolutely awful cop-flick Bad Boys does. Half a star goes to the dialogue, which wasn't too bad despite swearing being used where unnecessary. \n\nOverall, this is a watchable film but average. The villians could have been slightly more realistic and less cliché and the story could have been put together a little better. On the bright side, at least Ayer's story in End of Watch is far better than the tedious story he made up for Training Day.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Great script with well-defined, convincing characters. Strong ending. The use of different film stock when dealing with different individuals is a little intrusive but not overly so.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Buddy cop movie, period.  Well done and an excellent example of the genre, I could do with a bit less of the improvisational POV camera style but it is what it is.  In every other way this is an excellent film with character development that brings you to a peak as the film finds its own peak.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "brothers of black and white all the way. wicked storyline. truly is every day LA.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "i loved this movie but so sad",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "This is a love letter to the ordinary L.A. beat cop.  It's a virtually plotless movie that tracks a few months in the lives of two such guys using a documentary hand held camera style.  We see them confront bad guys, get into fist fights, act heroically, fuck up major operations, hang with each others' wives and girlfriends, joke around, and mostly put their lives and trust in each others' hands.\n\nGradually, these episodes do string together in a final climactic sequence.   Thank goodness.  The glory of the movie is its in your face realism, (there are more instances of the word \"fuck\" in the first 20 minutes than in three David Mamet plays)  and I found it to be very watchable.  The downside is its nearly entirely episodic nature.  Thirty minutes in I said: OK, here's the big event that sets the story going.\"  Nope.  No such thing, really. \n\nIn addition to solid work from Michael Pena and to a lesser degree Jake Gyllenhall, there is a supporting role played by Anna Kendrick who always adds life to whatever she's in.",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "Cant believe this one slipped by me, but I caught it on Netfilx last night. Solid movie if you havent seen it yet.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Got a little boring, the Gangsters were unbelievable, and ultimately it was them which were the ones they were facing... 2 stars for great acting by Jake Gyllenhaal and Michael Pena Though, the special effects were good also. the rest was Meh..",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "One of the best action/cop movies I have ever seen. A ton of language, but it is realistic language and not just useless swearing for the sake of being crude.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "The acting and the action was descent, but it took so long for it to get to a real story. It was just shaky camera, swearing, and violence. I am fine with that if it's entertaining and has meaning.. but the movie just wasn't very interesting or entertaining. There were also a punch of parts I found to be super unrealistic. 50/100",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "One of the best police films i've ever seen. Watch it now on Netflix.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "The sad look into the LA police department. It contains mostly thrills with a lot of tears.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "Character driven, cop glorification, with an ending that seems not to have the guts to pull out what it set itself up for.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "End of Watch seems to be another film that uses the found-footage style, but once again it's not a successful try. However, it still gets what it wants by being a true to life buddy cop film with a ridiculous amount of intensity. End of Watch looks pretty simple as a crime thriller, but everything is actually brilliant. The crimes are grim and the action is a load of thrills. But what really makes this film so appealing is the chemistry between Jake Gyllenhaul and Michael Peña. Their bromantic moments keeps the entire film so charming. The rest of End of Watch is intense and heart wrenching.",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "Great movie that shows a close friend ship between two cops. It also shows some of the difficulties that police officers endure every day. See this one it will make you cry!",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "If you haven't seen this yet, you're missing out. Bought this one on Blu-Ray",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "Great story, great acting and a great film.",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "This movie was crazyyyy",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "A real good movie which they film close to the reality of the LAPD world. The story is kinda expected but the way the director shot and illustrated sounds good!",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "The plot was too simple and at the end not interesting at all. A little dissapointed.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Brilliant. Absolutely gripping.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Damn good cop movie. Very emotional!",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Very riveting and powerfully performed, The found footage aspect really works with the film, Director David Ayer knows how to work with found footage and make more scenes intense and almost scary. Overall this film is pretty great though suffers minor flaws  - 9/10",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "Excellent Film from the perspective of LAPD cops and the brotherhood they share while dealing with the daily dangers of gang infested south central LA.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "Surprised by how enjoyable and complex this movie was. Highly recommend this, one of the best movies I saw in 2012.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "A great police movie.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "An excellent film with great acting. Gritty and yet still heart felt. \nThe relationship of the 2 main characters makes the film with excellent character development. \nA top film and well worth a watch",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "End of Watch is an excellently crafted cop drama. It features very powerful performances from Jake Gyllenhaal and Michael Pena and definitely didn't get the recognition it deserved.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "I'm not sure why, but going into this movie, I really didn't want to like it, and after the first twenty minutes, I didn't think I was going to. Once it picked up though, David Ayer's vision came into focus and the story picked up substantially, which is strange considering Ayer's track record in movies is poor to say the least. This movie is carried by Jake Gyllenhaal and Michael Pena's performances, which are both spectacular. The story, though interesting, is surface deep and the gang they face off against isn't exactly believable. In addition to that, half of the decisions Gyllenhaal and Pena make are pretty irrational and at times plain stupid. I genuinely hope that there performances are not factual representation of any police department. The half-and-half found footage/normal cinematography occasionally detracts from the drama and is confusing for the audience at times, but overall I thought they handled it well. I cannot stress enough how the two lead performances single handedly made this film what it is. Bottom line, this is an innovative, stylish look at an old story, and is a very solid movie. I would recommend this to everyone that likes crime flicks, and even to people who don't.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "This was much better than I was expecting.  Even though there are some serious pacing issues (as well as the most amount of swearing I've ever heard in a movie), this still managed to be intense enough to keep me watching.  The ending is crazy!",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "the gang members are so stupid that they're unrealistic. first of all gang members don't video-tape themselves committing murder. and second they start running after they kill somebody, especially if it's a cop. not only that, but none of the cops follow procedure at all. I'm surprised the main characters didn't die in the second act. you always call and wait for backup if there is a chance of danger. the worst part was the noise complaint scene. after not calling for backup, the cops walk into a house filled with gang members openly using drugs. the cops tell them to turn the music down, they don't comply, and then the cops just leave. none of the other cops even seem to care about the main characters. police officers always back each other up even if they don't like one another.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "Average story. More Street Kings than Training Day.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "great movie sad ending but could cop movie and like the  movie plot",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "Bottom line, both Gyllenhaal and Pena got snubbed at the Oscars as well as the whole film. End of Watch is the perfect cop film, and it's also one of the most realistic.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "I come from my place similar to wear those guys patrolled I believe they were realistic best movie ever.    michael wright",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "End of Watch is a very insightful look into the lives of LAPD servicemen. It's definitely gritty, and it's definitely gripping. It shows the true meaning of brotherhood.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "A film with allot of violence, blood, shootings perfectly portrays the suburbs of los Angeles with some very good acting by Jake & Michael",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Peña and Gyllenhaal have strong chemistry, and together they manage to bring some joy to, and transcend the overly familiar material. However, the distraction this film would call a romantic subplot is a less than riveting (and transparent) effort to give the film some semblance of direction, and the gratuitous profanity is occasionally groan-inducing.\r\n*2/4*",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "There is a good reason why not many movies are made this way. End of Watch disobeys the most fundamental rules regarding camera angles and editing, a veritable recipe for disaster. I don't recall a single establishing or long shot throughout the whole thing. There wasn't even a steady shot (I'd stay away from this movie if you get motion sickness). However, this blatant disregard for cinematic protocol comes with a major upside, which was taken advantage of to the fullest: Intimacy. The use of camcorders made the fourth wall seem like a thin layer of drywall that your neighbors can hear you whisper through. Intimacy breeds familiarity, making it much, much easier to love the characters. That is why this movie works. Characterization is the highest law in storytelling. Failure to produce good characters is irredeemable. Success excuses any other deficiency found on the screen.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "End Of Watch is great thats all i can say about it a very true and very surrea; cop film that felt like you were there in the action all films that do that usually keep up great action to and this film was lots of fun with the intemse gruesome acting and scenes that made this film feel so real.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Dark & Gripping.. Not a second wasted..",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Laugh out loud moments coupled with suspense and a tear-jerker ending. I loved this movie.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "A film that unfolds through a humorous and heartfelt relationship between two partners, ending in a predictable climax that still manages to feel like an emotional punch to your stomach.  The performances are astonishingly realistic, the cinematography and writing are honest, and the interaction between Pena and Gyllenhal (who I despise in every other role) is the most authentic I've seen in a long time.  This film wasn't given much attention..but trust me...it's a must watch.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Heavy film. Great acting from PeÃ±a and Gylenhall.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Another well done realistic-vibe film, this one being delivered from police perspective (as much as I can't stand cops, I admit I was on their side here) Gyllenhaal and Pena are both superb and worked excellently together in establishing a real partners-in-crime rapport (pun intended). Great suspense, and even the lesser roles played by those of the gangsters delivered a realistic bone-chilling demeanor with their hardcore ethics and dark nature. There was a moment that caught me by surprise and right towards the end the movie went from a solid 8.5 to a 10/10 for me.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "In my top 10 favorites movies of all time for sure. Great performances. Makes me look at police officers in a whole new light.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "A strong film about two partners on the L.A. police force who patrol some of the tougher streets in the city. The incorporation of handheld cameras throughout and from various characters was gimmicky and added nothing to the story. Most of all, the scenes shot with the handheld camera detract from the drama that develops. J. Gyllenhaal and Peña have great chemistry and the characters they portray are a unique blend of cocky and conscientious. I thought that the violence was overdone and an exaggerated version of the crime wave that the L.A. police would face. The idea wouldn't be original by any means, but I could have seen this story and characters working on television as a series, as well.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Sick movie! Very tense.  Can't fall asleep on this one!",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "Was way better than I expected.",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "very interesting!  worth watching!",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "'End of Watch' doesn't bring anything new when it comes to the genre. What it does is that it improves where other movies have faltered. Two cops, partners are on a role when it comes to hunting down bad guys. However, it's not long before they have a price on their heads. A basic plot which is elevated thanks to some wonderful screenplay and dialogue. The performances by Michael Pena and Jake Gyllenhaal are nothing short of brilliant. The climax, though predictable, is still heart-breaking. 'End of Watch' is under-rated!",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "How was this movie not nominated for an Oscar? This was a perfect movie!!!",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Best movie I've seen in a while.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "A good movie. Gylenhall and Pena give really good performances. Definitely worth checking out. Available now on Netflix streaming.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "End Of Watch hits and misses in equal measure. Good performances but a poor script that only sketches out many of its characters and situations.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "a movie you will want to watch over again",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "A very good, gritty look into the lives of L.A. cops.  Jake Gyllenhaal and Michael PeÃ±a are terrific.  The actual \"story\" elements that are forced into the film feel a bit out of place and the time jumping is jarring at certain moments.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Way too profane for my liking. I'm pretty sure real gangsters in South Central don't even swear like these people do. Beyond that, it's creative and very character-driven, which is always a plus.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "79% The documentary style really took away from the experience though.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "kind of slow but a good movie",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Wannabe Training Day.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "A great character study surrounded by a slightly generic story.\n\nGyllenhaal and Pena are great here, with some of the best chemistry I've seen in years. One of the strongest aspects of the film is it's realism, everything felt so genuine, especially within the relationships of the characters. And this is where the film thrives, in it's characters, and how they develop throughout time.\n\nBut there are problems. The story, although interesting, is slightly generic in some respects- as the villains are as cliche as they come. As with all the other characters you get such realism and interesting back stories etc. With the gang, there is no depth, but just aggressive people who like to shoot people... because they're aggressive.\n\nYou would think that this would lower the score more, but actually their particular story doesn't develop until that much later in the film, and it doesn't affect the film that much. They are just something that affects their relationship, to see an effect on the two cops- and to be honest I think the film would have been just as entertaining, without the threat and the different gangs, but just to see the day to day life of these characters.\n\nAn interesting watch and insight into how the L.A.P.D. works, but is let down slightly by some cliche characters.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Good movie. But I live in LA and it's hard for me to believe that these cops are that honorable. And why the hell did the Latino cop have to die?",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Gotta love a show were you can't predict the end!",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "End of Watch seems to be another film that uses the found-footage style, but once again it's not a successful try. However, it still gets what it wants by being a true to life buddy cop film with a ridiculous amount of intensity. End of Watch looks pretty simple as a crime thriller, but everything is actually brilliant. The crimes are grim and the action is a load of thrills. But what really makes this film so appealing is the chemistry between Jake Gyllenhaal and Michael Peña. Their bromantic moments keeps the entire film so charming. The rest of End of Watch is engaging and interestingly gripping.\n\nThe story is about the lives of the lead pair. As these police officers patrol around the streets, they spend their time talking and joking around until they see something going on. Jake Gyllenhaal and Michael Peña brings it to life. Their chemistry is the magic of this film. When it gets serious it becomes really intense, makes you wish both of them are safe on their dangerous jobs. The common elements of cop movies are explosions and stylish gunfights, but this film is all about tension and momentum.\n\nThe found-footage style is as messy as what the recent found-footage film, Chronicle, did. Which falls into being unnecessary. It sometimes gets shots that aren't filmed on any hand-held cameras. The camera-work is still well shot and serves a different experience, but it could have been something like what action directors, Mark Neveldine and Brian Taylor(strangely has the same name of the main character), do. Shaking the camera ridiculously without calling it a found-footage film. If you ignore the style, it would be cool. The quality of the film is being realistic and there it succeeds. They left the impossibly cool police movie stuff behind and instead make them simply scrutinize, arrest, and watch the streets.\n\nEnd of Watch doesn't have much of a concept but to depict the credible lives of these hero cops. While the lead stars shine on their beautiful down-to-earth bromance, there's a grim reality about to affect their lives thus makes this an indeed so compelling film. Still, it could have been a Crank like film than a found-footage. The crazy cam is a great effect, but not the characters holding the camera. Aside from that, it's a top notch thriller that is easy enough to enjoy. Worth a ride and recommended.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Pretty good movie. Well say that a bit edgy because of the camera action. The cameras were on the actors. Made me a bit dizzy.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Better than most we've seen worse movies",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Gyllenhaal and Pena are sensational together. The best cop movie I've seen in years.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Wow. If you haven't watched this, stop what you are doing, get the DVD and watch it.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Gripping, heartbreaking cop drama with fantastic dialogues and endearing characters.",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "Action packed, entertaining & captivating! The movie kept me interested the whole time. Two thumbs up!",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "Worth a watch, gyllenhall is always a presence. Very gritty. Can't help but compare films like this though to tvs the shield which will always be superior.",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "ok movie wouldn't watch it again.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "This movie knows how to keep suspense going",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Good movie but Training Day is better. Still worth the watch.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Intense, exciting and heart wrenching.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Great movie, shot like a real life kind of thing,  if you like cop movies this is a good one to buy.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Wow!! went into this film knowing nothing and expecting little. This film draws you in and kicks you in the teeth. A absolute roller coaster of emotions and strong performances all around. So much raw honest emotion and great development of characters. Such a emotional final scene that killed me inside. Plenty of laughs add to the overall brilliant film that mostly overcomes the drawback of handheld style that I hate. It works for the vast majority of the film and the addition of regular camera work helped but some scenes i would have preferred more stationary cameras to capture more performance, but this is a small defect in a otherwise incredibly moving film.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "It's so heart wrenching!",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "They deserve our respect.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "End of Watch is a gritty, thrilling cop drama with two outstanding performances from Jake Gyllenhaal and Michael Pena who demonstrated excellent chemistry throughout. Their constant banter showed the bond the two shared which places End of Watch above your typical cop thriller.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "awesome movie.....better than training day",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "End of Watch is law enforcement's answer to Ladder 49. Even knowing how it would end, we ate up every second of it. The conversations were real and hilarious connecting you whole-heartedly with the two leads. The villains earned every bit of your spite, showing \"gangsters\" for the poser punks they are while not making caricatures of them. The supporting characters supported without necessarily having a big plot tie-in. The law enforcement situations might not have been entirely typical (they only show the nerve-wracking calls), but I loved the fact that they didn't focus on ONE scenario. Kind of made it feel like 20 movies in one. I was never bored watching and I get sick to death of watching action movies with the same plot. Really does justice to the dangers those in law enforcement make. Overall, the film makers lived up to what they were aiming for - making it all seem REAL. Outstanding acting from entire cast. Still reminding myself those \"gangsters\" were just paid actors.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Good ass movie ....a must see",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "one of the best/funny\n cops movie, I seen.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Not my type of movie.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Michael Pena & Jake Gyllenhaal are great together and this movie left me to tears. End of Watch brings some used ideas but many new ones as well. David Ayer may not be the best writer but he still gets my respect.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "thiz movie go hard hella funny!!!",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "I like it a lot, really good way to show a movie",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Bad ass, awesome movie!!!!",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Excellent movie. One of the better \"found footage\" or \"first person\" video style movies Ive seen. The characters were very well developed, and I became personally invested in the officers portrayed by Pena and Gyllenhal. I recommend this movie to anyone looking for an action/comedy with a dash of drama. 5 stars.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "End of Watch doesn't do anything new, and what it does do has been done better. David Ayer supposedly spent only six days writing the script and it shows, merely creating the basic elements of a safe, cohesive, and marketable plot. Ayers, known for his shrill, marketable approach to filmmaking, chose the trendy documentary-style cinematography, which is supposed to increase the realism or believability of the \"footage.\" Here, it consistently does the opposite and ends up a jumbled mess of first-person and third-person perspectives. Ayers needed a reason why our protagonist cop is carrying a camera, and conveniently has him enrolled in a film class. Are the gang bangers in film class, too? One of the them films themselves and the crew in the car as they heatedly argue -- with guns pointed at each other -- over plans to kill police officers. The other kicker is that the gang's leader yells to get the camera out of his face, while little does he know there are at least 3 more in the car that none of them are even aware of. Yes, Ayers betrays his own movie, as not only does the \"amateur\" footage look produced, but the majority of the movie is in 3rd person with cameras not present in the story. All that is really accomplished here is 10 minutes of the movie filled with characters complaining about being filmed. Readers would be better served watching any two episodes of The Wire, even if they've already been seen.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "A must watch if you liked Training Day you will love this!!!!",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "Best cop movie i've ever seen. Exciting as well as funny",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "They dropped the F-bomb way too many times and that took away from the movie.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "Very good movie. The level of realism and the issues brought up was certainly more than what I expected, and this certainly wasn't a bad thing at all. Jake Gyllenhaal's performance and Michael's support were outstanding as they brought humanity to these characters and allowed for an intense amount of relation. Anna Kendrick is sweet, as always and although her role was under-used, she still made an impact. There were some graphic scenes as well, which I praise the director for using as it helped to really bring to light some of the issues faced. And the ending was a tear-jerker. Overall, 9/10.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "In a word, excellent.  While obviously this isn't fully realistic in what they choose to show (basically one scene of paperwork and a dozen high intensity scenes), it works and it's effective.  I'm not crazy about shaky cam, but again it feels right here.  \nThe characters (and these actors' wonderful performances) win you over so naturally that you don't realize it's happened.  They're not squeaky clean, but they're confident and maintain a levity that is refreshing, especially when things get heavy.  The climax is tough, but I so appreciate that the filmmakers decided not to simply beat us over the head and walk away.  They could have left us broken, but that wasn't the point of this film.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "This intense cop thriller is lead by excellent performances by Jake Gyllenhaal and Micheal Pena.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "Excellent movie and way sad even before the end",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Works best in the episodic bits, the overarching story is a little heavy-handed. Gyllenhall is doing good work, good character piece. Good look at the underside, the things cops have to see so we don't have to.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious! Most of us don't like police officers but if you see just how close partners really get and just how much they have to deal with... this movie will make you cry when you see what happens at the end. God bless the men in blue!",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "This movie had some great script writing.  Although most of the movie focuses on the two main characters and their day to day routine, I was completely engaged and in the end felt for these guys. Well done in that aspect.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "a very poignant movie. One of the better more realistic police movies I have seen.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "Very good movie with great performances from Jake Gyllenhaal and Michael PeÃÂ±a.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "End of watch is one of the best police movies of recent years & has a nice balanced story & Jake Gyllenhaal & Michael Pena are really good buddies they always look after for each other & smart, clever & sure make this a exciting experience to watch & enjoy.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "This movie had a perfect character study of both cops personal lives. It had great action scenes. The dialogue was realistic. The two cops should have had one direct case they were following that lead to their final encounter, but how the producers and writers shaped it as fine too. The ending fight did it for me. Other than the Dark Knight Rises, End of Watch was the best movie of 2012.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "great movie its as good as training day",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Due to some not so great editing the found footage format gets to feel a bit obnoxious,  but the great leads and the high stakes plot make End of Watch into a great tension filled cop drama.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Brutal and compelling...",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Everything about this film is good.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "This movie was intense! I didn't even feel like watching it when it was proposed but I'm so glad I did. Absolutely loved it, would recommend it to anyone.",
            "review_date": "2013-07-13",
            "source": "rt"
        },
        {
            "content": "the acting was awful, should have not been made a movie, no plot, villains were dumb, stupid ending",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Excellent.  THIS is how you make a movie.  there's not a note of lame dialogue anywhere in this riveting and highly entertaining film.  For those few reviewers who called the movie 'racist'-the race card is a lame hand....what do you think black and mexican gangbangers talk with a harvard accent and write theses???  get real",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "awesome. a great movie, pena and gyllenhall (i definitely spelled that wrong) have great chemistry and the pacing was excellent.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Kinda boring, nauseating camera work, but good story.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "WOAH YES!! so much yes!!! From start to end I was hooked and as cliche as it sounds I was DEFINITELY on the edge of my seat.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Highly entertaining and has a very interesting story. This \"documentary shot\" buddy cop movie is full of suspense and entertainment. The characters are good and acted very well. I have a soft spot for this movie and I will always love it. 9.5/10\nsex and nudity: 4/10 some kissing, implied sex and sex refences \nblood and gore: 9/10 Bloody and gorey corpses are seen. Bloody shootings, stabbings, fights,  and a gorey eye wound\nprofanity: 10/10 Constant use of the f-word, 326 times to be exact. Lots of other strong language.\ndrugs/ smoking/ drining: 9/10 This movie involves the mexican drug cartel. Cocaine and heroin is seen. Marijuana is smoked\nintense/ frightening scenes: 9/10 Many intense moments espically the end. *spoiler* The death of a main character is sad and intense. This is a pretty adult movie",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "my favorite movie of the year!!!  I'm still mad neither was nominated for an Oscar or a Golden Globe or that the movie wasn't nominated either! so compelling and comical and true all at the same time! best movie!!",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "a great movie, one of my favorites. its one of the few movies I can watch over and over again",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Stressful to watch ! Moving flick though",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "'End of Watch' is a brilliantly executed cop drama that is as enticing as it is unrelenting. A quick pace makes the film kinetic and never loses your attention. The real props however, go to the two leads in Gyllenhaal and Pena, who establish wonderful character development along the chaotic ride. Their banter and build up bring us to an unflinching climax that shows no remorse. In fact, nothing about the film is remorseful. This is pure, unadulterated chaos, shoveled into one to make one of the best cop films you'll see in recent years.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Quite simply, one of the best cop films ever made.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Great Movie! one of few I can watch over & over",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Great movie. liked it alot more than I expected. sad ending. only because the movie really contradict how the 2 were like brothers.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "Despite some flaws, End of Watch manages to rise near the top of a crowded genre due to the chemistry and charm resonating from its well-drawn leads.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "Awful, simply awful.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "A look at South Central LA like I haven't had since my South Gate days. When I went to school at USC, we were warned about the perils of the area but I don't quite remember them being this bad. I'm sure they were. Great portrayal of the daily police grind this beat must be. Probably ranks only second to the Rampart Division for shit assignments. Beautiful capture of the intertwined beauty that is South Central LA's landscape and its' seemingly hopeless reality on the streets. Nice.",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "Interesting look into a cops job but you have to get past the video camara shaking all the time since this is one of those movies home video movies.  Good action, good acting, good drama, some corny lines and predictable lines, and just not the greatest plot.",
            "review_date": "2013-07-06",
            "source": "rt"
        }
    ]
}