{
    "rating": 8.3,
    "release_date": "2012-12-14",
    "num_reviews": 250,
    "genres": [
        "Fantasy",
        "Adventure"
    ],
    "summary": "Bilbo Baggins (Martin Freeman) lives a simple life with his fellow hobbits in the shire, until the wizard Gandalf (Ian McKellen) arrives and convinces him to join a group of dwarves on a quest to reclaim the kingdom of Erebor. The journey takes Bilbo on a path through treacherous lands swarming with orcs, goblins and other dangers, not the least of which is an encounter with Gollum (Andy Serkis) and a simple gold ring that is tied to the fate of Middle Earth in ways Bilbo cannot even fathom.",
    "reviews": [
        {
            "content": "an incredible and epic odyssey",
            "review_date": "2023-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My dad really likes the Hobbit. He likes it so much he locks himself in his room to watch it! He even says things like \"Yes, this is so good!\" While watching it :) And even things like \"Yes, This is so amazing!\"",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen this movie twice now and...well...it's just ok. It looks cool and there is some interesting stuff. But, the story is just not that interesting. There's a hobbit and some dwarves and they have adventures. The end.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thats what bilbo baggins hates!!!",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good family movie. Loved it.",
            "review_date": "2023-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's good movie it has more action than the lord of the rings though.",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Producing an awful screenplay to make sure you can squeeze out every last dollar from three movies. Why why why would you play with an incredibly successful story and replace it with whatever that is. Another Peter Jackson cartoon failure.",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought was a very good take on the book and well done",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is not that bad. I was rather surprised that  - while very long - it was never really boring. A bit streched out. It should have been edited a bit better/tighter. Great visuals (except for the leading orc). The battle with the goblins was s bit over the top at times. Bilbo/Gollum scene was great. For me this was the best of the three movies. All in all: three movies for this story was a bit to much.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently re-watched this movie, since it first came out. All in all, all three of these movies are very well done. It is better that they had been made than not. My major gripe about all three of them is that they kind of \"over did it\" when they didn't need to...like the goblin mine scene in this one that looks like something out of a overdone video game...dwarves falling through what seemed like thousands of feet of endless rows of trestles and bridges, etc. boulders crashing around them without dying or getting hurt. I realize that this is fantasy, but the best fantasy has some elements of realism in it to keep it on the edge of believable.",
            "review_date": "2023-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great adventure and very fun to watch!\nCharacters are great and pacing is great as well!\nStory and writing are awesome!",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Writing : 8/10\nActing : 7/10\nCinematography : 9/10\nCostume design : 9/10\nSet design : 10/10\nCGI Effects 6/10\nArtistic vision 8/10\nAdaptation ranking : 8/10",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring, boring, boring....dear me i must have fell asleep several times watching it",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very underrated movie. I know that people expect alot from it but I think that its not supposed to be as good as the previous trilogy. Its a story about Bilbo and its very enjoyable.",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm happy director Peter Jackson brought us back to middle earth 9 years after the original trilogy ended Nobody was sure if this short book prequel would be made but it was more of a studio-rights issue than anything Even Guillermo del Toro was attached at one point but walked away But it was a chance to go back to Middle Earth and re-explore what JRR Tolkien created Taking place 60 years before the events of the ‘Lord of the Rings' trilogy it focuses on the merry band of Dwarves Bilbo traveled with along with Gandalf the Grey wizard to reclaim Erebor near the Lonely Mountain Smaug the dragon took over the Dwarf kingdom and coveted their gold but Thorin and the others are hoping Bilbo can act as their burglar to sneak in and take back Erebor This was my first real introduction to Martin Freeman as an actor and he does amiable job playing a younger version of Bilbo Baggins; he learns to gain courage, bravery, friendship, and learns the meaning of adventure being outside of his comfort zone He’s got the quiet confidence and tenderness down that the late Ian Holm established Really loved Richard Armitage as Thorin Oakenshield leading the rest of the Dwarves, he's a lot more dignified than Gimli Terrific seeing old cast members play their original roles Ian McKellan as Gandalf, Cate Blanchett as Galadriel, Hugo Weaving as Elrond, and the late Christopher Lee as Saruman Glad Andy Serkis came back as Gollum, like he never left and the scene of riddles in the dark is the best handled with Freeman as it stays very close to the book The stone giant battle was awesome bringing something new to the table Radaghast brings a silly quality although at times his presence can feel awkward and out of place Most of the Dwarves barely have any personality making them less memorable and much of the action is serviceable Odd they split this prequel in 3 parts but Jackson is able to allow audiences to immerse themselves in the world, take more inspiration from Tolkien's writing, and get back into the swing of things Even if this prequel trilogy is a mixed bag it still has many elements people loved the first time from Howard Shore’s music to the many new realms to the creatures ‘The Hobbit: An Unexpected Journey’ manages to reinvigorate the love and appreciation fans have known for years Full of humor, spectacle, and epic fantasy we’ve come to expect but then again this is only the first chapter ",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really wonderful movie and great cast. Great acting ",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rather enjoyed it. Not a classic nor a rewatch, but this is a fine family adventure.",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed The Hobbit movies. I thought they were great prequels to LOTR.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing!!   I am a lifelong fan of Tolkien and this is a 90%+ Wow!!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best makeup and hairstyling ever done in a movie!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a true and ardent fan of J.R.R. Tolkien and all of his works I was incredibly excited for this movie. While there were things missing or altered in Peter Jackson's Lord of the Rings series most were understandable given the need to bring it into the medium of film and it was so beautifully done that I had little problem forgiving them. The Hobbit, however, really needed little to no omissions or changes from the original and was really Peter Jackson's chance to give a faithful adaptation of Tolkien's work, perhaps even one Tolkien's son Christopher would have approved of. Instead there were changes and additions galore that did little but extend the run time of the movies and butcher Tolkien's vision. While still cinematically beautiful and so wonderful to see Tolkien's world brought to life again, the often ridiculous changes and completely unnecessary additions made it painful to watch and often honestly just pissed me off. Unfortunately Peter Jackson will now forever be my tarnished Hero for bringing the Lord of the Rings to live action film so beautifully but then so utterly betraying that vision with the Hobbit.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel stretched, like thin, like a novel adapted into three movies.",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " The film is a delight despite not just finishing the whole story with one movie. It is called “The Hobbit”, yet Peter Jackson threw in a lot of extra stuff.",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kinda caca bro idk. Gandalf in this movie sounds like Ian McKellen trying to play Gandalf trying to play Ian McKellen, whole movie feels lame especially when the vegan dude does weird stuff to his animals, I sat there the whole time wondering if I should go stress eat.",
            "review_date": "2022-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. A magical piece, like the book.",
            "review_date": "2022-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the original Lord of the Rings so much and for some reason didn't get around to watching the Hobbit Trilogy until just recently. It was actually quite good. I particularly loved Bilbo, Gandalf and the Dwarf King and thought their relationships were very touching.  I happen to be very fond of British actors — I think they are more nuanced than American actors. Martin Freeman did an excellent job as Bilbo Baggins; he has such wonderful facial expressions. Of course Ian McKellan did his wonderful job as Gandalf, full of wisdom. Richard Armitage was great as Thorin Oakenshield, King of the Dwarves, his mad scenes were very convincing. Thumbs up for Poldark Actor, Aidan Turner as a love-struck Dwarf and Evangeline Lilly (Lost) as his beloved Tauriel the Elf. I especially liked the Elf King (Lee Pace); very regal and arrogant and of course Legolas, his son (Orlando Bloom). \n\nI have a debt of gratitude to Peter Jackson for creating all six of these films. They are family-friendly, inspiring and heart-warming. They speak of eternal truths like friendship, and loyalty and bravery, among so many other things that I appreciate. \n\nThank you all for the wonderful legacy you have left us in these films!",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, despite everything that is not present in the movie.",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peter Jackson is trying to recapture the original LotR success, but the source material is a children's story....",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice to back the Middle-Earth again!",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cute and sweet. I was glad they decided to spread it across three movies, but it also didn't quite feel like the same quality as LotR.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a very bad idea to make one book into three movies, cause it makes alot of this movie extremely boring. Although i will say, i absoloutly loved almost everything about the goblin town and thats the only thing keeping this movie from being around 2 stars.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the movie runs through a snail pace and the beginning is really boring and uninspiring, the movie still has the fantasy film magic and great characters to keep you wholly enjoyed.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sprawling, plodding mess of a movie, exactly what you would expect when a thin book is stretched into 3 two-hour-plus movies.  Where as Peter Jackson had loads of material to work with for the Lord of the Rings trilogy, here he is forced to invent new characters and subplots and pull in some of the darkness of LotR into what was originally a more lightweight story.  And sadly, it shows.",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, if you need a palate cleanser from the abomination that is rings or power go back and re-watch the Hobbit. It places you back in Tolkien's world and is way more faithful to the lore!",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When great books are made into movies they never turn out good when the director is focused on money making. Good for Jackson, you made your money as for the movie, it's rubbish from the start to the end. Read the book and do not a adoption for 9 year olds ruin this great master piece for you",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just rewatched this after watching Prime's Rings of Power. The difference is astronomical, the Hobbit captures the true essence of Tolkien's work, and everything about it is loveable. Where Rings of Power failed, the Hobbit exceled in every aspect!",
            "review_date": "2022-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as LOTR but still pretty awesome.",
            "review_date": "2022-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much reliance on madcap (almost looney tunes-style) CGI-heavy action to pad out the run time. Furthermore, the tone of all this action felt at odds with the supposed gravitas of our heroes' quest. Consequently, I found myself frequently disengaged when watching this film; not much really happens if you remove all the CGI filler. Moreover, when our heroes get up without a scratch after falling 200 m down a pit, you know they aren't really in jeopardy; all the action feels like a theme-park ride.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is no LOTR trilogy, but it's not chopped liver either. It has lighter tone and feel than it's predecessor which makes sense since the Hobbit was more of a children's novel. Still after watching the 1st two episodes in the new Power of the Rings series I've gained a whole new respect for the Hobbit trilogy and An Unexpected Journey in particular, as I feel this is the weakest link in the 3 Hobbit movies. This movie looks like an Oscar contender compared to Amazon's new series.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, but they strayed too far from the book. \nHowever, I believe it was made in good faith, unlike the Rings of Prime/Power. Rings of Prime is a purposeful desecration of Tolkien's works.",
            "review_date": "2022-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This first Hobbit movie is undoubtedly the best of the three in my opinion. This movie and the entire trilogy has a lot of flaws, yes but overall I'd be lying if I said I didn't have a great time with this movie. The characters are charming, the storys intriguing and the cinematography is quite good. An enjoyable film for sure.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong opening half hour, then a gradual decline. \n\nPS, on a personal note, I find it hard to tolerate Aidan Turner and Dean O'Gorman's terrible northern accents lol.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I readily admit when I first watched this film at the cinema I left a bit disappointed, mainly because it didn't recapture the magic of the Lord of the Rings trilogy. Years later, I find that the movie has grown on me, or perhaps I have just learned to appreciate it for what is: Bilbo's story, not Frodo's. Definitely, there are cgi issues which I find annoying (My preference being LOTR's real sets over Hobbits cgi.), story lines which seem added just to lengthen run time, and characters who are a bit different than the book. Even with that said, I like this movie and find it the strongest of the Hobbit trilogy.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jackson's return to Middle Earth brings back the cast and proves to be a good sequel even if does take away a few key elements from the first three film.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mediocre movie at best.  While seeing Tolkien's master work of the same name made into a move and meeting the characters and discovering the places therein is cool, they story really suffers in this trilogy because it strays from the book.  Inventing characters, combining multiple characters into one, and inserting characters into sections of the story where they don't belong does quite a bit of harm.  Stretching the Hobbit into a trilogy also seems like a blatant money grab.  Making it appealing to kids with goofy, unrealistic action scenes takes the appeals away from this as well.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the hobbit movies. Starts of charming and balances the humor and adventurous spirit of the books with the more action oriented nature of the LotR movies up to this point. Bilbo, Gandalf, and the Dwarves are all a delight. Some get more screen time than others but I feel we get at least a taste for each one.\n\nA worthy adaption.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know people thought the movie was slow, but that is one reason why I loved it.  I enjoyed all the detail in The Hobbit and The Lord of the Rings novels.  I would have liked The Lord of the Rings trilogies had more details in the films.  The one draw back of the The Hobbit trilogy was the disgusting humor, and the silly relationship between Bilbo and Thorin.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CGI was off putting, added characters was problem not a good idea.\nlove triangle was just bad.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Back to rate this movie after watching the latest Amazon adaption… this is a classic by comparison!",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The casting was spot on and being back at Bag End for so long at the beginning was a real treat. Definitely my favorite of the trilogy.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasantly Surprised. The acting was excellent by returning veterans but uninspired at times by the newcomers which makes the acting decent overall but nothing stellar. The soundtrack was awesome. The cinematography was very good also with great intimate scenes and sweeping shots when needed seamlessly. The editing was well done also. The pacing suffered at points through the middle as it felt things were dragged out a lot at times. My biggest problem throughout this was how uneven the character development was outside of Bilbo & Thorin. Everyone else felt they just blended in which wouldn't be a big problem if not a lot of time was spent on them but a huge amount i. Also the special effects start to get a little too reliant on CGI and it feels oversaturated towards the ending. That being said though everything overall was solidly done despite the significant character problems, some pacing issues, some acting issues and special effects at the margins. A classic movie in the franchise for sure and a good start for sure.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "many dislike The hobbit but i don't, if anything i think Lotr was too short even with extended edition some parts from the story are still missing. The hobbit however took it's time building the story and characters, I've seen some fan made cuts but they all came too short, this was the beginning of a great story, maybe the second and third part had little problems here and there but this one was excellent.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it gets goofy and obviously throws in too much material compared to how big the book is, it's still a great movie. I actually forgot a few parts of the book that the movie showed, like the rock giants.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The world of Middle Earth is just so fascinating. This isn't quite as good as the Lord of the Rings movies but this was still pretty damn good. The soundtrack by Howard Shore is incredible. The cinematography is breathtaking and the story is great. The characters are all awesome. Very great start to the trilogy. What this movie lacked compared to the Lord of the Rings was that it felt so long, even though it's around the same length of the Lord of the Rings. The reason is that there isn't multiple storylines going on at once. It's just one story that we follow, whereas with Lord of the Rings we cut between Frodo and Sam to Aragorn and that crew and then to the hobbits. The many stories made the long length better. I don't think this movie should've been that long and definitely should've been trimmed down. Also because we have only one storyline with so many characters, so many of the dwarfs get excluded and we know nothing about them. Basically the only dwarf we know anything about is Thoran Oakenshield. Despite the flaws, this was a great movie.",
            "review_date": "2022-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The hearts of men are easily corrupted said Galadriel.  Sadly, it seems like the Hobbit-like Peter Jackson is actually a man after all. Unfortunately, the Peter Jackson, Fran Walsh team has given in to corporate greed of the movie studios - and it really shows on film. Tolkien's book was a fun, enjoyable fantasy story. Jackson film adaptation is Not. The irony of it all is that the horribleness of this film could have been avoided if Jackson had followed his guiding principle when he made the epic LOTR film trilogy. And what was that guiding principle?  Staying to faithful to the book as much as possible.",
            "review_date": "2022-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually appealing, but far too drawn out. Not everything needs to be a trilogy, especially not the shortest book. As with most, this first movie has plenty of table setting to do, but none of that should require almost 3 hours to accomplish.",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Listen. It's not as good as any of the Lord of the Rings movies but it's still somewhat good and has its moments. Seeing Bilbo's Story is exciting since it was highly talked about during the Lord of the Rings trilogy. Gandalf is good in this movie and it's honestly good. The reason it's not as great though is because this story can be resolved in 1 movie maybe even 2 at the most but they take 3 movies. Listen this story is not ad detailed as lord of the rings and it does not need 3 movies. So it moves at a slow pace and by the end of the movie not much has really happened. It's still good and I recommend for LOTR fans.",
            "review_date": "2022-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I can't contain my excitement for the new Hobbit films and Peter Jackson getting his Middle Earth back on the screen, I wasn't quite as impressed with this film as I was with the groundbreaking and amazing in every way LOTR trilogy. The film while shorter than the three LOTR films, still feels very long in places. Yes there are great action scenes and wonderful sets filled with all kinds of eye candy and the many scenes depicting Bilbo and the Dwarfs, especially the meeting at Bilbo's home, are amazing and add some truly touching and funny scenes to the film. There are some moments though that slog on a little longer than necessary and can stray and linger a tad too long. Having said this there is a lot to like here for Tolkien fans and most I'm sure have already seen it in theaters in the new 48 fps 3D version as I did.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie takes a long time to get going (almost 15 minutes before we see the main cast, 40 minutes before they start doing something other than talking/eating, & about an hour in before we see some action). The main characters are nowhere near as iconic as the LOR Trilogy minus the return characters and Bilbo. Smeagle brings a shot of excitement and nostalgia to the screen in his scenes. The CGI and the sound effects are jarring in several parts of the movie. That being said, it has enough LOR flavor to keep it interesting and the music is well done as well.",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 long movies so much less than 1 short book.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jackson does an excellent job of staying true to the source material, while adding a ton of value and interest based on hints in the novel and logical additions based on the world and lore of Middle Earth. While there is a good deal more (or more obvious) CGI, this movie still stands just below the Lord of the Rings in terms of quality. \n\nIt's great to be back in Middle Earth.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing first movie for the trilogy! Great start to it. I think it's well very done. Great storytelling and introducing characters. The score is amazing. I just wish they made the orcs look better. But it didn't change the movie for me. Martin Freeman and Andy Serkis were the standouts for me.",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A greedy cash grab that ignored the source material. Worse than that, the story was just not compelling and the movie was a boring slog. The subsequent films are wars.",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Praise on all fronts",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had seen this movie before and decided to re-watch it because I liked it. I like the books written by Tolkien and I also liked the movie adaptations of The Hobbit, even though they are very different. This film is an epic adventure drama. All actions take place in a fantasy world where many fictional creatures live: elves, hobbits, gnomes, magicians, goblins and even ordinary people. The main character, the hobbit Bilbo Baggins, goes on a big adventure with the dwarves to fight the big dragon Smaug and take back the dwarven castle. On their way there are many dangerous adventures, but they endure all difficulties and eventually win. Of course, I recommend other people to watch this movie. This will give them not only a way to pass the time and have fun, but also give them a \"roller coaster\" of emotions, immerse them in another world and cheer them up.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it extended the book, Jackson did an amazing job retelling this story on screen.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great obviously not on the level of LOTR masterpiece level trilogy not even close by a country mile or on the same level, but this movie has a solid story with great acting all around, very good CGI for it's time, builds and makes the lore of Lord Of The Rings and different factions and ideologies more interesting has good well written meaningful character arcs. The movie is long especially extended edition, but it has good action set pieces and the pace for me at least is pretty decent. \nThe biggest flaw for me is the humor does not always land and often comes off as forced for me and some of it is obviously targeted at a younger audience the atmosphere is a lot less dark than LOTR trilogy and more light adventure fantasy-style instead of a fantasy epic in this movie,but it works okay for this movie. Overall it's a very good addiction to LOTR lore and is pretty good well written fantasy movie with solid CGI and good acting while flawed if you are into LOTR lore and want to see more solid world-building it's worth watching atleast once. 10/10",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you thought the Lord of the Rings were bad enough, The Hobbit presents itself with new characters and a new story that still gets muddled up with Peter Jackson's wild imagination.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movies and series of all time.",
            "review_date": "2022-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing main character, amazing side characters, and the plot is paced perfectly.",
            "review_date": "2022-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original trilogy, if you compare it straight to that you'll be disappointed. That said it's very enjoyable with the dwarfs having compelling motivations considering they lost their home in Moria to Orcs. \n\nAzog is an amazing villain who killed Thorin Oakenshield's (main dwarf) father... they fought before and Thorin cut off Azog's hand... Thorin thought he left the Orc mortally wounded... now they are both in a collision path for conflict... which happens in the end of the movie \n\nGollum is there has the classic riddles with Bilbo, Gandalf obviously makes an appearance. I'm confident you'll like it but it's not a masterpiece or anything close to that.",
            "review_date": "2022-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Peter Jackson had a tough job following in the footsteps of his previous masterpiece trilogy, however this film and the rest of the Hobbit films are absolutely brilliant. A fantastic well chosen cast, a regular watch for me and my partner who love everything Tolkien.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After almost 9 years since The Return of the King, The Hobbit, an all be it decent adaptation of J.R.R. Tolkiens Lord of the Rings Prologue is a film that is difficult not to like. Although falling short of many peoples expectations with tensionless action and plot elements that go know where, The Unexpected Journey is as fun and entertaining as Martin Freemans pitch perfect portrayal of Bilbo Baggins.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The extended version of the hobbit is really feel like going back to middle earth and seeing Gandalf and some returning loveable returning characters from previous extended version lord of the rings trilogy.",
            "review_date": "2022-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE ITT !!!!!!!!!!!!!!!!",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the return to Middle Earth I wanted but I like this movie better than I did when I first saw it. It's not a good Lord of the Rings movie but it's a good Hobbit movie.",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit: An Unexpected Journey is such an underrated flick. I like it much more than any of the LOTR movies. Yes, it is too long, slow and meandering due to the decision to adapt this very short novel into three very long movies. With that being said, it's still a wildly entertaining movie that benefits from its charming cast of wonderful characters, endearing humor and stunning technical aspects. It's a high fantasy adventure spectacle that is particularly impressive for throwing so many different creatures and locations into the mix.",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many will criticize The Hobbit due to its many deviations from the source material.  While there may be some truth to these claims, the films do not deviate as many would like to believe.  In the years following the publication of The Lord of the Rings, Tolkien struggled with the idea of revising The Hobbit; many changes had already been made to the Riddles in the Dark chapter shortly before the release of LOTR, but he wanted to change it even more.  As is detailed in Tolkien's later drafts of The Hobbit, as well as a chapter in the Appendices of LOTR called \"The Quest of Erebor\", the author of the Middle-earth legendarium wanted to tie the stories of The Hobbit and The Lord of the Rings together, to make it darker and more adult.  Tolkien would sadly never get to create this new version of The Hobbit; it was either discarded out of necessity or left unfinished after his death, but Jackson saw in these unfinished tales (pun intended) the path to making a faithful (in theme and message, not always literally) but fresh story.\n\nJackson has tied the rise of Sauron into The Hobbit trilogy, making the story feel grander and more epic.  Additionally, the improvements in modern CGI have allowed for beautiful vistas complimented by the superb acting skills of Martin Freeman, Ian McKellan, and Richard Armitage, and... everyone else in the film.  Nobody phones in a performance, not even the extras or body doubles.  The action is fantastic, taking on a more whacky and hilarious air than the LOTR films; this feels like the perfect way to tie in children's book to a great story of epic adventures (LOTR), because The Hobbit always felt disconnected with the themes of the rest of Middle-earth.  With Jackson, that is not present.  Everything about this film feels like an homage to Tolkien.  It is not a cash-grab, but a letter of admiration to all the fans of Middle-earth.  Despite its poor reception by less understanding or diehard critics, I feel this film truly honors The Hobbit.  Adaptations should not just repeat a book, they should build on them.  That is what Jackson does.",
            "review_date": "2022-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extended Edition Rating: 6.5/10",
            "review_date": "2022-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 movies out of one small book...how did they do that...by padding the hell out of it.  Just make a ton of stuff up and add it to the movies to make the run time longer.  So it's basically about an adventure of dwarves reclaiming their home because they think the dragon has left.  Bilbo was needed as the group required a burglar...which doesn't make sense since the dragon was huge and didn't need to set up traps as it would just roast anyone that intruded since it spent most of it's time sleeping, also this is the dwarves home so shouldn't they know what and where all the traps are since they set them?  Hmmm...anyhow.  Then it's several things that happen on the way to reclaim the dwarven home and when things aren't looking good for them, Gandolf appears and saves them each time.  The thing that gets me is that they are travelling by land the entire movie and at the end they get picked up by eagles and flown to the next movie...so why don't they get picked up by the eagles at the beginning and flown to the dwarven home since they know where it is after all, oh I forgot the extra padding to make it 3 movies.",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was pretty decent. Overall, it stayed pretty loyal to the book (despite a few things).",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This honestly wasn't as bad as people said it was. I think the main problem was that the original LOTR movies were really good, so they expected this to be just as good and obviously it disappointed them. You also have to understand that the director was only able to work with just 1/3 of the whole entire book, so it can't exactly be amazing. But I did think that this had a lot of good elements, like the trolls, orcs, wargs, and Gollum! My favorite part was definitely the Riddles of the Dark (Gollum) scene, which I thought they nailed. Gollum was insanely true to the book and still super entertaining! Along with that, it had a pretty solid story and gave a pretty good intro with some good action, which was fun! I recommend it (mainly because of Gollum).",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have been looking forward to this since I was a child over 40 years ago, sadly after the brilliance of the LOTR films this is just a CGI mess I can't believe it's from the same director. Avoid",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Men are so easily corrupted\" - Galadriel.   The Hobbit book could easily have fit into 1 movie.  But somehow Peter Jackson found a way to make it into 3 movies. Why?? I would venture to say, it's for money...And it shows. This movie's production design, effects, cinematography are Nothing compared to the effects of the original LOTR trilogy. Even sadder to see Peter Jackson and Co. bend to corporate greed.  All the deviation from source material added so much stuffing to the story to the point of becoming boring. I watched all 3 of the LOTR trilogy movies and each time i kept thinking \"i wish this would never end\". I've re-watched all those movies and felt the same excitement every time. Not so with this hobbit film.  While watching THIS film, i kept thinking \"When will it end?\"  and when the end credits finally rolled, i felt relieved that the movie was over.",
            "review_date": "2022-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original LOTR Trilogy was absolutely amazing.  I loved all the characters, and the story was gripping from beginning to end.  One of the best trilogies of all time and lived up to all expectations.\n\nThe Hobbit Trilogy was horrible.  Plot was sacrificed for way too many unnecessary action sequences.  Also, there was too much cheap CGI vs practical affects that made it look cheap.\n\nIn conclusion, I hated these movies and I wish someone would make a single2-hour version of the Hobbit with the magnificence of the original LOTRs.",
            "review_date": "2022-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching the Lord of the Rings trilogy, I had really high expectations on the Hobbit trilogy. Sure, these are great movies and as they where filmed a few years later than the Ring movies, it has some really cool and powerful effects. I really love all the landscapes and big battles in this one, but you can't compare it to the Ring trilogy. But if you're into the world of Hobbits, wizards and orchs. It's a must see!",
            "review_date": "2022-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it's not on the LOTR level, it's still a great movie.",
            "review_date": "2022-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel a little that CGI was a new and exciting concept when the movie was made, unfortunately it has not done anything good for the movie.\nPractical Effekts was Way better.\nLord Of The Rings is the better choise.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow and way to much filler that's not from the book",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ive always been trying to get around to the hobbit/lord of the rings series but somehow only today i watched it and i regret watching it this late this film is incredible the ending looks amazing and the directing is just out of this world.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst in the trilogy but still good fun. Great PQ and AQ, this is the only hobbit film I don't prefer the extended over the theatrical due to the the added scenes feeling unnecessary and being dull. While it's the weakest movie in middle earth it still is a good movie and overall is very enjoyable!",
            "review_date": "2022-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic cast, a great introduction to the characters, and a great story and action make this a great watch.",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the riddles in the dark scene is why this movie is good",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since I'm only about fifteen, I can say that looking back on it, it was okay, but as a kid, I loved this movie. A world of monsters is fun to watch as a child. The cinematography and its characters gave the world a more enjoying and whimsical feeling. Especially since the book was definitely like that in every way; this movie was probably one of the reasons I had a big imagination as a kid (I still am). Overall, not very good, but it gives me a good dose of nostalgia. Also, the book is 100% better in every way.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though \"An Unexpected Journey\" gets off to a rough start, it still remains rather enjoyable to watch and is a welcome addition to the \"Middle Earth\" franchise. The story is good, though it feels stretched too far, adding in many unnecessary plot points and characters, which can be seen as either a good or bad thing. The acting is good as usual, and the costume design and world building is as good as ever. However, the overdone CGI and need to make this film 3D really bogs this film down and takes away from the environment that made \"Lord of the Rings\" seem extremely aesthetically pleasing. Still, the story does a good job explaining the background of what was rumoured in \"Lord of the Rings,\" with some great action sequences. The amped up goofiness and childish jokes also bog this film down much more, yet it doesn't feel as terrible as the CGI and some of the plotlines. Overall, this adds a more childish addition in the \"Middle Earth\" franchise, though I don't really view that as bad as others might view it. A good movie that I would recommend for any fans of this franchise or those who want to get into it.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great beginning of a whole franchise!",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The return to Middle-Earth is good looking but the film's pace robs the material of it's majesty.  \n\nOnce you get past the first hour and Bilbo is on his journey with the dwarves, things get much better.  There were video game like visual effects that made it look as though there were too many shots ruined.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This trilogy gets too much hate. Absolutely amazing. Unfortunately Peter Jackson didn't get a ton of time but a masterpiece nonetheless. The score is amazing as well!!",
            "review_date": "2021-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Return to the Tolkien Verse. The journey of Bilbo in this movie is a much lighthearted one compared to his nephew Frodo’s. Maybe not as epic or engaging as the LOTR movies were, and it does drag at parts, but I’m glad that Jackson and company had finally adopted the hobbit. However, I wish that Thorin looked more like a dwarf and not an midgit Aragorn. ",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully realized and with a strong score the movie has some things in its favor. The story is relatively barebones though, which isn't too surprising considering the limited source material adapted. This does hurt a little considering we spend so much time with such limited character work. The movie's biggest weakness is its toothless action. Despite how much time is spent on action scenes they accomplish very little narratively. While the action is technically well choreographed it is also so unrealistic that you lose any sense of danger after a while because none of the main characters really get hurt. All in all the movie is somewhat enjoyable despite its flaws yet people looking for a new Lord of the Rings are in for a big disappointment.",
            "review_date": "2021-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok for a one-time watch.",
            "review_date": "2021-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very excited to go see this in theaters when it first came out, but I actually dozed off in the theater when they were trying to cross the mountain and my enjoyment of the entire trilogy never truly recovered. I rewatched it with my wife and managed to enjoy it, but the decision to shoot in 48fps was even more jarring at home since we watched it only a couple days after finishing the LOTR trilogy. I actually loved the changes Peter made to flesh out the story into a trilogy; it did cause the runtime to bloat more than seemed necessary, but The Hobbit is actually one of the worst-written books I have ever read in my life and I've held that opinion since the first time I read it at age 12. If I hadn't read it myself I would have never believed that anyone, let alone a vaunted GOAT writer like Tolkien, had ever written a book whose entire purpose is building toward the excitement of the Dwarves' showdown with the dragon at the end, only to hastily cram in a different character in a single chapter and have him be the one to kill the dragon. My hatred of Bard the Bowman has colored my entire life since then, as I have a heightened sensitivity to perceived deus ex machina and I dislike Luke Evans as an actor because he played him. The only other gripe I have here is that Thorin was portrayed as rude, entitled and aggressive from the very beginning here, making his eventual heel turn completely unsurprising and his redemption arc ineffective at making me like the guy. Fuck Thorin. And Bard.",
            "review_date": "2021-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should've been one movie, two at the most.",
            "review_date": "2021-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Besides the song the dwarves sing in the start of the movie I didn't like much here. I don't like the characters, or the actors. I don't like the setting or the plot threads. I don't like the monsters or the poorly crafted CGI. This Hobbit movie stinks. Just like all the other hobbit movies. No depth. No heart. No relationships to care about.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Booooooooring. It wasn´t horrible, but the movie was so slow paced. It´s really not worth 3 hours of your time. Go watch the LOTR trilogy instead.",
            "review_date": "2021-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A favorite of mine. Better than the Ring trilogy. More entertaining, better pacing and way better acting.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is not LOTR but the film holds up and the majesty of the images is always fascinating",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a child I was obsessed with the novel, so naturally had always been eager to see a film adaptation. When this came out I watched it literally dozens of times, including every night for the first few weeks after I bought it on DVD. Back then, I thoroughly loved it. Now? It's a reasonably good fantasy flick, but The Hobbit franchise is not in the same universe as LOTR. The highlight is the riddles scene with Gollum. But I've gone off this particular movie since I found out about the appalling animal neglect associated with it.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good beginning to the trilogy and is very good even though it barely follows the book. Great movie👍👍👍👍👍👍",
            "review_date": "2021-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a kid, I was excited to see another Lord Of The Rings movie, but now I'm older, and my heart is filled with disappointment. The first half of the film is plagued with too much narration, boring action, and dialogue that is mostly exposition or terrible jokes. It is also quite disloyal to it's incredible source material. The movie tries too much to be a LOTR prequel rather then being its own thing. The second half of the feature is good though, as the action gets better and it sticks closer to the book.",
            "review_date": "2021-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very great and lighthearted film with a lot of action and characters to keep you interested. The scenery is so amazing and beautiful and it really captures the aesthetic of middle earth. The only flaws of this film come with the pacing.",
            "review_date": "2021-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brings you back into the immersive middle-earth with even more impressive CGI and an extremely intimidating villain. This time round making a little hobbit as strong as he should be… not strong at all which brings you to be actually scared for the main character. Love it!",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not going to say that it is lower than its predecessor (according to the film date), because The Hobbit 1 is an unappreciated movie. 7/10",
            "review_date": "2021-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my introduction to the middle earth and it hooked me. I saw the whole franchise because of this. I love this film.",
            "review_date": "2021-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unnecessary sequences and set pieces and lackluster characterization rob what is otherwise a pretty entertaining return to Middle Earth.",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Freeman is a great Bilbo Baggins, brings the character to live in a fun way.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "81/100. Other than the first hour or so of this movie, which felt too slow and uneventful, the first film of ‘The Hobbit' trilogy is a welcome addition to the ‘Lord of the Rings' franchise. However, it is not a movie without faults. Bilbo's encounter with Gollum is some of the best writing that the franchise has seen and really saves this movie from being a 70/100. There is a ton of setup in this movie that goes unsolved but it does not ruin the viewing experience. It is fun and enjoyable movie with a lot of good call backs to the original ‘Lord of the Rings' trilogy.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In all honesty, this movie isn't that bad. It fairly faithful to the part of the book it covers, and Martin Freeman is very enjoyable as Bilbo. It's still a far cry from the Lord of the Rings trilogy, though. Speaking of trilogies, it's ironic how the book's main message is warning against greed and yet greed is exactly what led them to stretch out that midsized book into an unnecessary trilogy.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To watch \"The Hobbit\" trilogy immediately after watching \"The Lord of the Rings\" is a great disservice to \"The Hobbit.\"",
            "review_date": "2021-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is good in my opinion, it is not the best film, either from the hobbit trilogy or from the lord of the rings trilogy, the film is 3 hours long to adapt only part of the book, but it is a very good and unfolding film. adapts phrases from the book but a negative point that several times they leave out the bilbo to focus more on the dwarfs so it is a film that I recommend",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first of the Hobbit films is fairly decent. It feels distinctly like a return to Middle Earth and the LOTR trilogy. The visuals are beautiful and the special effects are fantastic. Other than the terrible musical number at the beginning, it's free from most of the problems its sequels have.",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After reading the book, I was not expecting a movie like this. But not in a bad way. The Hobbit Trilogy is probably the best book-movie adaptation ive seen. The Special effects and Creature renders are amazing, very lifelike and unique, not as if the producers just hit Ctrl-V for all the goblins and orcs and whatnot for the entire film(s). Reading the first chapter of the book just makes me feel happy and relaxed every time, and the movie does the same. However, there are a few minor setbacks here and there, confusing at times, but overall, Peter Jackson's The Hobbit is a fantastic movie worth your time.",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit is a short book. Yet is was Peter Jackson managed to drag this out into three films. I am waiting for the director's cut version that takes the six hours of the three films and cuts it down into a rational 1 hour and 40 minute movie.",
            "review_date": "2021-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually, Peter Jackson's first instalment in The Hobbit trilogy is stunning. Almost every scene reveals new natural (or unnatural) delights. Martin Freeman is charming as the out-of-his-depth Mr Bilbo Baggins while Sir Ian sparkles as a less burdened, cheekier Gandalf. Devoted fans of the book will not enjoy the departures and inclusions, but for movie fans who did not ingest JRR Tolkien's  dense and sometimes slow-moving children's story in their pre-teenage years, this film version will entertain more than adequately for its entire (long) length.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid prequel to Lord of the Rings. It's nowhere near as good but that doesn't mean it's bad and expecting a movie as good as LOTR is basically you setting yourself up for disappointment. Every actor is amazing, especially Ian McKellen, Andy Serkis and I prefer Martin Freeman's Bilbo Baggin over Elijah Wood's Frodo Baggins. It has some well-choreographed action that makes creative use of the environment, it's visually dazzling and I know people have a problem with the overuse of CGI in these movies but this movie is innocent in that complaint and it's great seeing old locations like Rivendell and new locations as well as new creatures like goblins and it was a joy being back in middle earth, which is what I wanted. It can be funny and supenseful and a lot of amazing character moments like when Bilbo rescues Thorin and Howard Shore delivers an excellent score again. There's a lot of filler like the stuff with trolls and stone giants and it does drag in lots of places. There's no need for this to be nearly 3 hours long and it also lacks the suspense and stakes of the original series we're not 100% invested in the dwarves's journey as the consequences of failing won't be big. Plus, it has some tonal inconsistencies and a lot of moments where apparently physics doesn't exist but regardless, it's an enjoyable time and I'd definitely rewatch it.",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before there was the fight for Middle Earth, there was the hobbit. Before there was a war, there was an adventure. THE HOBBIT: AN UNEXPECTED JOURNEY is a fantastic start to J.R.R. Tolkien's origin story, with so many great characters big and small. The action is top notch and the surprises are out of this world.",
            "review_date": "2021-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit: An Unexpected Journey is a pretty good movie. But it does not mean that it has some problems. First of all, the first hour of the movie is pretty hard to watch. Also, the performances while good, do not mesh amazingly with the script. Still, the visuals are nice, the stakes well set, and the action is beautifully choreographed. This is a good adventure film, it is just that the movie is a bit of a slog sometimes. So 6/10, A beautiful thing to watch, besides the first hour.",
            "review_date": "2021-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good start to the series of Hobbit films. Quite long considering that the book is only a mere 300 pages long. Clearly a money grab for the creators. The casting of characters is good, but there is no need for it to be three films. Having said that, the extended editions are definitely the ones to get",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This might get me some hate but i enjoyed the Hobbit trilogy more then the lotr The hobbit flowed and moved where lotr could be flat and boring in some parts i was like did that scene have to be 20 mins long. to me the hobbit just works Thorin oakenshield is a much more believable hero as well more so then Aragorn lets face it no one is that nice i also felt i knew the characters on the hobbit far better then the lotr the goblin city is well just awesome no other words can describe it.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The weakest of the 3 Movies but a strong beginning for Bilbo Baggins! (I couldn't have picked a better actor, Martin Freeman is PERFECT as a young Bilbo)",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is REALLY HARD to follow Lord of the Rings, and I think that is this film's major flaw.  Yes, it is spectacular.  Yes, it does a great job with world building and cinematography.  Even the acting and plot is well done.  But the fatal flaw here is it is trying to set up something that has already happened (Star Wars prequels, anyone?)  LoTR was an expansive world-ending extravaganza, whereas the Hobbit (at least the book) was supposed to be one quiet hobbit's experience with the outside world.  The movie flips that all around and makes the Hobbit quite a big more expansive (and longer) than maybe it should have been.  Doing this movie first, and scoping it (for die hard fans) probably would have helped.  But still an excellent film.",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While containing many flaws, Peter Jackson takes us back to the beautiful Middle Earth and does the best he can with the source material.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course off the level of its 'The Lord of the Rings' predecessors, but I have to say I thoroughly enjoyed 'The Hobbit: An Unexpected Journey'.\n\nIt has good lure to it, the plot is more than interesting, it features pleasant callbacks and - like LOTR - looks exquisite. As for the casting, I like 'em. Martin Freeman (Bilbo) is, like Elijah Wood, an actor I've always found hit-and-miss, but I really did enjoy Freeman's performance here - the humour is his usual schtick, though the rest of his showing is strong.\n\nIan McKellen (Gandalf) returns and is as much a joy to watch as before. None of the others, though all good, stand out massively, James Nesbitt (Bofur) does bring decent comedic stuff.\n\nHopefully the two sequels to this are just as fantastic!",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "even though this trilogy is not as good as the Lord of the Rings Trilogy, I still enjoyed it. Martin Freeman makes an excellent young Bilbo and the storytelling told is fascinating. I also love the song that plays throughout called the song of the Lonely Mountain. The CGI is not great though.",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not an epic masterpiece, but is very fun and really enjoyable. It takes its source material and plugs in a more stylized narrative, but still keeping the humor and majesty of the book. It is very visually impressive (the Shire is still one of my favorite movie locations) and Martin Freeman is just splendid as Mr. Bilbo Baggins. This leaves me very excited for the next movie!",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit drags on for two and a half hours, constantly introducing new characters and taking the story no where. But then again, this is the case for every fantastic series' first installment. Lets just pray that the desolation of Smaug delivers more of the actual adventure.",
            "review_date": "2021-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit: An Unexpected Journey is a solid film in this saga, more than half wasn't in the book. It kind of bugged me. It's not Lord of the Rings but still a good movie.",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly an amazing film, and the second and third chapter are not bad either. From the music to the cinematography to the acting and directing, it's all wonderful and adds to the Amazing story that it the The Hobbit. An amazing visit back to Middle-Earth.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! will be watching it a third time, possibly in French again.",
            "review_date": "2021-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely stunning scenery and special effects/cgi.  Feel they skipped way too much of original story and characters",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of the actors are great, and did what they could with this. The costuming was lovely. Why did they have to make this film so horrible and stupid? The book is wonderful. The LotR films were excellent. They had everything they needed. Why did they ruin it?",
            "review_date": "2021-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extended Edition provides more richness. Soundtrack is awesome and provides a great return to Middle Earth. ",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie gets this trilogy off to a good start. While the movie did stretch on for a little longer than it should have, the visuals are great and still look good, the action was intense (for the most part), the adventure is very intriguing and I found myself interested in the storyline, even though I am not a big fan of the Fantasy genre. Plus, the ring falling onto Bilbo's finger was very satisfying to watch. Not to mention the cast did a very good job at portraying their characters'.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s no Lord of the Rings, but it’s still a nice return to Middle Earth.",
            "review_date": "2020-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weird entry into the LOTR universe. ",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The music was good.  The character development was great.  The acting was very good.  Great action and fighting scenes.  Incredible scenery.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like it nearly as much as any of the Lord of the Rings movies...  and I'm not even a big fan of any of the LotR movies.",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no where NEAR the book in anyway.",
            "review_date": "2020-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So I must admit that The Hobbit: An Unexpected Journey suffers from it's slow pacing in the 3rd act, Bilbo lacking some screen time in the 2nd act, and the lack of stakes in many of the action sequences. However, it has incredible production design for many of the locations in middle earth, interesting world building, another great score by Howard Shore, decent effects, an enjoyable adventure, some fun and cool characters, and probably the most visually pleasing Middle Earth film.\n\nRating: B-",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Been years since I watched these and I realized I never saw the extended editions. The additional scenes in Unexpected Journey real strengthen the tie between the two trilogies. I look forward to rewatching Smaug & Armies with fresh eyes.",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit: An Unexpected Journey is my personal favorite film of all time! The New Zealand scenery mixed with CGI is truly cinematography at its best. Although, I do agree that this film trilogy would have worked better as one or two movies, An Unexpected Journey is undoubtedly the most accurate to Tolkien's novel which everyone can appreciate. The actors and characters are in sync perfectly with a great cast and a lead actor for Bilbo. No film is ever perfect in my opinion but this movie is the one that comes the closest  But overall this film is truly great and has a good message of friendship. 9.9/10",
            "review_date": "2020-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming back to Middle Earth for another Trilogy, Peter Jackson (Director) takes on the prequels leading upto “The Lord Of The Rings”. This film in comparison is a lot more light hearted and family friendly. The cast is all well constructed but the lead played by Martin Freeman is the diamond in the rough. They rely too much on cartoony CGI vs practical effects this time around and it takes away that natural feel, but maybe that’s the look they were going for. The adventure starts out a bit slow but then takes us to familiar sites and some new ones as well. This is tolerable but it doesn’t grip us the same way the LOTR films entranced us.",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. After a slow beginning (slow does not mean bad) the movie is non stop fun. I like the score for the movie, especially the main theme. A little less dark/serious as the LOTR movies and a lot more CGI, but it works for me in this one. Overall, a really good movie.",
            "review_date": "2020-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tried but I just couldn't get into it. It's incredibly slow. There is no need for this movie to be 3 hours. It took about 45 minutes just to introduce what this movie was even going to be. Unless you're an intense LOTR or Tolkien fan, I wouldn't bother with these prequels. I get that it's mostly just about exploring the LOTR universe but it still doesn't even do that as well as LOTR did.",
            "review_date": "2020-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has nothing to do with \"The Hobbit\". That is defenetly not the story that John Ronald Reuel Tolkien wrote.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring long winded and repetitive. Such hard work.",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good trilogy beginning, very strong movie to start a series",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant and adventurous beginning to this prequel trilogy, combined with Jackson's direction, the script he co-wrote with Walsh, Boyens and Del Toro, the performances of the cast, Shore's score, Lesnie's cinematography, Olssen's editing, Hennah's production design, Vincent and Bright's set decoration, Taylor, Buck and Maskrey's costume design, action sequences, sound design and visual effects, An Unexpected Journey begins this trilogy with action-packed and visually stunning results!!!",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a great movie I recommend to everyone to watch all the hobbit and lord of the rings to pass time and have a good time watching it",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. awesome story, incredible music absolute beatiful. Underrated movie.",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good adaptation of Tolkien's book, but stretched to be a little too long considering the length of the book.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lovely adventure full of heart, immersive world building, camaraderie and humor. Problem - distractingly obvious and washed out CGI",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie like lord of the rings but even worser",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent prequel!Visually Stunning and beautiful.As The Adventure and Backstory of Bilbo the Hobbit it was good but as per a Lord of the rings contender it was average movie!the 1st half was boring and slow as hell the meeting of dwarfs at Bilbo's house and the stretched conversation it felt very long so does whole 1st half,the 2nd half was surprising and amazing the journey of dwarfs to mountain and then the obstacles and the Old enemy's eye it was engaging,the Rivendell scene was literally beautiful and amazing,Each and every fight scenes in this movie is literally awesome and work of art,the Goblins fight and the Gollum's and Bilbo story was amazingly showcased and the ending it was satisfying and amazing,Apart from 1st half and stretched plot it was a amazing Prequel and backstory to Bilbo!",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Urgh, I love the novel but this drawn out and self-endulgent CGI snorefest was painful. ",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie and all others in the hobbit series.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "81%. 7/15/22. Love the opening scene where they all assemble in Bilbo's house. Lots of great action scenes throughout. Really enjoy just watching their journey and the different settings from the mountains to the green hills. Love the imagery of the Elves' city. It doesn't have quite the drama to the plot but overall a good watch.",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, love the characters and chapters to screen are done well!",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only barely good enough to recommend.",
            "review_date": "2020-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story/Screenplay: (2.5/5) C'mon, what happened to Peter Jackson?  Action elements of this story are rip-offs from The Fellowship of the Ring.  I don't mind combining content from The Silmarillion with The Hobbit, but individual action scenes could have been unique and less like those already done in The Lord of the Rings.\n\nDuration/Tempo: (3.5/5) At 2 hours and 49 minutes, it's a very, very long movie that felt much, much shorter.  Pretty impressive.  Excellent direction.\n\nCast & Crew: (4/5) Martin Freeman was excellent, as was Ian McKellen.  Overall cast was very solid.\n\nSummary: (3.5/5) The story was a disappointment, but the cast was very good and the film didn't feel long.  A shaky thumbs up.",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the Lord of the Rings this is a most welcomed and pleasant visit back to the Shire. It's like revisiting an old friend. Martin Freeman's performance as the young Bilbo Baggins is not only believable but sheds new light on his Early Adventures a long time before The Fellowship of the Ring. This adventure mixes in a little Shire history, drama and humor. It explains how the dwarves became like traveling vagabonds and why they have such distaste for the elves in general. But no spoiler alerts, you must take this journey to see where it leads.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are going to make a classic work of litterateur into a movie you have to stick religiously to what is in the book. Adding a feminist propaganda turned it into a Saturday morning Dungeon's and Dragons  cartoon.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While overlong and having a few too many callbacks to the lord of the rings trilogy, Peter Jackson still has his touch when it comes to translating Tolkien to the silver screen",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first film in the Hobbit trilogy gives us the fun adventure we wanted from J.R.R Tolkien's novel. Lots of fun and great performances by the cast. It could have used a bit more action, but the sense of adventure the film gives shadows all of it. Great film overall.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie gandalf is the best",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good I'd recommend it.",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has interesting visuals, but with a slow pacing and an unnecessarily expanded story, it ultimately dissapoints as an adaptation of the classic novel, and it would be a film worth watching if the novel was adapted into a single movie instead of a full length trilogy.",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie seemingly gets better with multiple viewings. On its own, it starts a compelling-enough epic fantasy tale that's an obvious allegory for the First World War. There's a lot of whimsy and humor that's not in the later Lord of the Rings films, and that lets it be more true to the source material than the initial LoTR film trilogy was. That aside, it's a beautiful high budget movie with good acting and enough comically implied brutality that's become a Jackson staple in his action movies. It still feels too long and takes a long time to get its little feet moving. Also, what's up with Gandalf's makeup? I always liked that they include the singing.",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not worthy of LORG saga ",
            "review_date": "2020-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too long. Terrible action scenes. Atrocious CGI. Peter Jackson's going the way of George Lucas. Won't be watching the rest. What the hell was he thinking? I watched it at the cinemas and started day-dreaming halfway through. Martin Freeman was excellent as Bilbo, though, hence the one star.",
            "review_date": "2020-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie , visual effect charactersand action scenes",
            "review_date": "2020-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it as a kid back in 2012 and beyond, but after rewatching it as an adult, it is a disapointment.",
            "review_date": "2020-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it has promise, not enough happens in The Hobbit: An Unexpected Journey to warrant its existence.",
            "review_date": "2020-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie and the rest of the movies with all my heart! Has flaws but I can look over them and just enjoy it for what it is. ",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a vacuum, An Unexpected Journey is a perfectly fine film. However, it is preceded by the Excellence of the LOTR trilogy, and it is unable to live up to expectations. An Unexpected Journey trades the gravitas of the LOTR trilogy for a more cartoonish style, which is admittedly more fitting for its source material.",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While clearly suffering from the overstretched source material, An Unexpected Journey still remains the most enjoyable entry in Jackson's return to Middle Earth. (3.5/5)",
            "review_date": "2020-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely enchanting. A must watch classic.",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography, location work (both sets and extensions) and Martin Freeman's Bilbo save this wishy-washy, glassy-eyed, cut-and-shut and most often boring beginning of the new trilogy.\nIt doesn't seem as meandering as the second entry or as rushed as the third, but apart from a creative opening sequence, a solid middle stint at Rivendell, and satisfying riddles in the dark, the film is all contrivances and bland dialogue and swoopy, brain-off action sequences.\nEntirely too much time is spent slavishly recreating the worst parts of the slender Hobbit book and the rest is completely misguided, off-the-mark inventions that don't gel well with the universe thus far. The fairy-tale rendition that could have been, from Guillermo Del Toro's imagination, is lost forever. And while there are a handful of deleted/extended scenes here that serve to let us in to these characters a bit more, the overall film is a bad one, largely characterless and instead replacing the thrust and themes of LOTR with close-ups of Gandalf, boring battles, and stony ruins where CGI bad guys and wolves smoulder and do bad guy things and wolf things.\nA touch of good scoring and tremendous image quality can't polish this turd entirely.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big downfall from Return of the King,also regarding CGI and cast,but still enjoyable",
            "review_date": "2020-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being my second favorite in Peter Jackson's Middle Earth film saga, An Unexpected Journey I felt was a fantastic introduction into The Dwarves and of course Freemans Bilbo Baggins. Who absolutely stole the entire film in my eyes, the journey I think has been the most grand and fun ive had in a fantasy/adventure since The Return of the King.",
            "review_date": "2020-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Felt like a waste of time!",
            "review_date": "2020-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very surprised people liked this film. It was a joke compared to the Lord of the Rings films.",
            "review_date": "2020-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a really interesting and exciting watch, but the storyline did not perfectly follow the book. Many new scenes were invented and many parts of the film were over exaggerated.",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great start to an amazing saga if you watch it in the order you're supposed to.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's great! Because it's way better than Foodfight!",
            "review_date": "2020-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first hour was really enjoyable, but it was a lack of quirky Bilbo moments (which amounted to much of the charm of the original novel) that made the film a bit lengthy as soon as the group had left Bag End. In other words: The story did not seem majestic enough to justify the filmmaker's epic approach. Visually it was okay, except for the usual CGI shortcomings (most notably in neglible scenes).",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a largely disappointing (and unnecessary) trilogy, this first installment serves as the strongest of the three. Well acted, heartwarming and entertaining, An Unexpected Journey is a new twist on a classic story. Martin Freeman shines as the awkward yet plucky young Bilbo Baggins and delivers a fantastic speech in the third act. Ultimately, the production was doomed but the best of the project certainly lies in this films honest and intrepid investigation into it's ideals of home, adventure and friendship.\n\nOn reflection, it would have been better as one or two films, especially given the limited source material.",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most evil creation of entire humanity.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's what I'm Tolkien about!",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. Should have been only one movie.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is okay not like the LOTR trilogy and I think it’s because the chemistry isn’t here in the hobbit series. ",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie I lot, but they had to set up a lot for future movies so the film wasn't as engaging as the other two Hobbit movies.",
            "review_date": "2019-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good and interesting movie. Even though it's nearly 3 hours, it's not lengthy at any point. It's a different yet exciting universe and journey, that's really unique! A bit far from the book, but a great movie! You should really give it a try.",
            "review_date": "2019-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the three!! Perfect way to start off this epic trilogy!!",
            "review_date": "2019-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "simply the theme is not of my tastes, the type of movie that is not even understand, it is like fantasy and action, the truth I have no idea and I love fantasy but this time not, when I watched the movie for me it didn ' t make sense, I do not like the atmosphere either the plot, I do not think it is very special, surely the fans disagree but it is my opinion, I would give it a chance if your character designs were not so unpleasant for me, that film is not for me or I'm not for the movie",
            "review_date": "2019-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like this because it is a fun movie and it works with the LotR in a meaningful way. A must see for fans!",
            "review_date": "2019-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok lemme get this straight. this movie really made me bored to the point of falling asleep. the way they rush the filming to this is simply embarassing and lazy. i am and never was a lord of the rings/hobbit fan so i may have a bias YET, this did not change my opinion. im sure the books were better. this is my opinion",
            "review_date": "2019-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterpiece! I can't believe it has such a bad score!",
            "review_date": "2019-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blobbo love book which  can read faster than too many movie parts and like more.",
            "review_date": "2019-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the best of the Hobbit film trilogy. This movie brings a lot of the magic that the original Lord of the Rings films brought. However, at times it gets lengthy, childish, and a bit CGI heavy, which seems inconsistent and can bring one out of the escapism. Aside from a few scenes here and there though, much of this movie is perfect! (Especially the scenes in the Shire and the scene with Gollum!)",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as great as the lord of the rings trilogy but a great movie.",
            "review_date": "2019-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is probably my favorite of the Hobbit trilogy. That's because it seems to spend the most time focusing on the characters, which, for me, are the most important aspects of any story. I am especially pleased with the dwarf characters, and how their roles and personalities were expanded from the book. I also appreciate the emphasis on family, in that each dwarf has at least one other close family member along for the ride, and therefore more of a vested interest in the overall journey. It makes it that much easier to empathize with them, I think, since not all of us have close friends or significant others, but we all have families. Furthermore, none of the families are 100 percent perfect, but that makes them all the more relatable because come on, is there really such a thing as a perfect family? Having to leave these guys behind at the end of the third film broke my heart, and I would love to see them in another film, or maybe a TV series, if at all possible.",
            "review_date": "2019-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*snores* Wait the movies over? This movie was so boring. You may as well just watch a wall for 2 and a half hours and it would be more entertaining.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It definitely has a lot of enjoyable moments but it feels messy. Ian McKellen as Gandalf and especially Martin Freeman as Bilbo are perfect.",
            "review_date": "2019-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best film of 2012",
            "review_date": "2019-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can you call yourself a LOTR's fan and hate on this move? Blasphemy!",
            "review_date": "2019-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hobbit lacks the scale and refinement of its predecessor but with the bar set impossibly high, Peter Jackson and team have still managed to craft an inventive, visually stunning re-imaging of The slim source material delivering an epic new instalment which re-captures most of the magic of the original Rings trilogy. ",
            "review_date": "2019-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, but really long",
            "review_date": "2019-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie made sure to scrape every last word from the book and plop it into the script. And it did so in a dazzling way.",
            "review_date": "2019-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Hobbit feature was a breath of fresh air of seeing old faces in new environments. It was glad to be back in Middle Earth again. But where this is the first feature of three installments, it just barely crept in the water and got your feet wet. Namely it is only bothered by the slow pace. There was terrific action pieces in it, but they were so few and far between. Many of the old characters you liked how they were revealed. The new characters, there was only two of three of them that mattered. What's revealing is that you can't figure out who's who. What's their ability, and why are we rooting for them. Basically it's like the background characters only they aren't given much to deal with. You sort of figured you'd be rooting for them eventually, but after watching all three you didn't really care about them at all. Basically, it's the Dwarve characters. They were just there and that was it. The story is thinly brought out in an already short book. Nevertheless, it has real good moments in it and it should've been two movies instead of three. But, it is worth your time and I highly recommend it.",
            "review_date": "2019-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story doesn't flow as well as The Fellowship of the Ring and there's some pacing issues in the first half, but An Unexpected Journey is a pretty enjoyable first chapter in the Hobbit trilogy with impressive visuals, great performances by Martin Freeman as a young Bilbo Baggins and a welcoming return for Ian McKellen as Gandalf the Grey, and some exciting action scenes in the last hour.",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it cannot reach the heights of the original trilogy, this prequel offers a good enough story, though not interesting enough for its runtime.",
            "review_date": "2019-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had a good time watching it",
            "review_date": "2019-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Martin Freeman is a good hobbit, but there are better ones. I was actually excited to see Elijah Wood (Frodo) make a cameo.",
            "review_date": "2019-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apsolutely fantastic, underrated masterpiece. \nAlmost as good as LOTR",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not  a terrible movie but it didnt seem to have the same level of effort that went into lord of the rings.",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        }
    ]
}