{
    "rating": 9.3,
    "release_date": "2012-05-25",
    "num_reviews": 90,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "An unlikely friendship develops between a wealthy quadriplegic (François Cluzet) and his caretaker (Omar Sy), just released from prison.",
    "reviews": [
        {
            "content": "The two main characters make for a great dynamic duo, while different in almost every way they share just enough personality and values to hit it off. I was surprised the movie is based on actual events as it's so dramatically structured – props to the screenwriters. The film works because of its authenticity in both the characters' environments and their corresponding quirks and worldviews. For such a serious subject matter, the movie manages to be both funny and uplifting.",
            "review_date": "2023-03-22",
            "source": "rt"
        },
        {
            "content": "Heartwarming lovely film with a lot of humour",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "Word of advice: skip The Upside, a sloppy American remake, and check out the original, the French film The Intouchables.  When Philippe (Francois Cluzet), a wealthy quadriplegic in need of a personal assistance, hires Driss (Omar Sy), an ex-con struggling to get by after being released from prison, an unusual friendship is formed.  While it borders on being overly sentimental, it somehow manages to never cross the line.  The relationship between the two disparate men evolves naturally and feels genuine throughout, thanks to great performances from the two leads and a script that effectively taps into the themes of redemption and acceptance.  Filled with humor and more than its fair share of poignancy, it is one of those films that is truly difficult to dislike.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "Amazing movie about two completely different people with two completely different personalities and from two completely different backgrounds, yet they still able to connect emotionally and form an unusual, but still amazing friendship, where they help each other in different ways. It's also a movie about disabilities and how life can suck for those who struggle in everyday life in so many ways. Very moving film, better grab some tissues!",
            "review_date": "2023-01-29",
            "source": "rt"
        },
        {
            "content": "This is one of those movies which makes 2 hours feel like 30 minutes.",
            "review_date": "2023-01-07",
            "source": "rt"
        },
        {
            "content": "beautiful scenes and touching moment ever !!   absolutely perfect one!",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "One of the best. I work with in a daycare for elderly people and I loved to see something like this movie.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "clearly sweety french drama",
            "review_date": "2022-11-05",
            "source": "rt"
        },
        {
            "content": "A Huge title in the French \"Masterpiece\" Catalogue.",
            "review_date": "2022-08-18",
            "source": "rt"
        },
        {
            "content": "Une belle histoire touchante.",
            "review_date": "2022-07-11",
            "source": "rt"
        },
        {
            "content": "S't'un esti d'bon film",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "They don't make movies like this anymore. This was truly one of the best movies I've seen in awhile. It was heartwarming, hilarious and nothing like I have ever seen before.",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "The Intouchables is a Heartwarming and charmingly comedic story that uses the dark and sad circumstances of disabled Aristocrat Phillipe to build a strong bond between himself and Driss, an ex criminal. Driss makes light of Phillips inability to move but not showing so much pity. He treats him like a Normal human being unlike many others around him. The comedic moments between both are done incredibly well, but it's the dramatic story and character beats that are done even better. I would've possibly liked to see more of Drisses home life and more of the struggles with his brother. Aside From the small things, The Intouchables is such a fun time, great comedy and story bits to put a smile on anyone's face",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "This is a wonderful film. It shows that good people come in all shapes and sizes and that we should look outside our usual circle as we may find some great people.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "While not that much seems to happen in the film overall, there are a few good laughs and great music in it as well as the establishment of a quality friendship. It gets sidetracked in a few parts and I don't think it's one of the BEST movies out there, but it certainly showed off its beauty quite convincingly in a few parts. I liked the film for what it ended up being.",
            "review_date": "2022-04-09",
            "source": "rt"
        },
        {
            "content": "Absolutely outstanding. A great lesson in life. Fabulous interpretation of these two excellent actors.",
            "review_date": "2022-03-19",
            "source": "rt"
        },
        {
            "content": "The cast does a spectacular job of making every scene seem natural, and they manage to tell the story of a truly inspiring friendship in a comedic way without being disrespectful. I would say the R rating makes sense on paper, but should not hold anyone of 13/14 years old and up from watching it. If you are looking for a film that adequately addresses social issues involving disabilities, this may not be the film for you, as it focuses more on the story of two friends than the idea of functioning with a disability.",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "I have seen this movie several times and for me it's kind of a classic. Comedy, drama and great storytelling makes this a good movie.",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Tanto que me la recomendaron y que no quise verla, ahora es una de mis favoritas, puedo verla miles de veces sin nunca aburrirme. Creo que gran parte del éxito recae en el trabajo de Omar Sy, quién resulta ser el alma de la historia, muy carismático y con chistes muy buenos, la música también es fenomenal. La recomiendo ampliamente.",
            "review_date": "2022-01-10",
            "source": "rt"
        },
        {
            "content": "Based on real events. Emotional, human, beautiful story.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "Please watch. You will love it!",
            "review_date": "2021-12-07",
            "source": "rt"
        },
        {
            "content": "A true work of art. In and out, the story of this film is beautiful and heart-touching. The chemistry between the characters is another bonus, making it one of the most memorable movies I've watched to date. A tear always manages to well up in my eye. I highly recommend to all. -Fennett",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "Superb film! Totally moving. Brilliantly acted. Wonderfully written and directed. A must see!",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "Really funny. Worth watching.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "Well written, well acted and well produced.  Refreshing story, unique.  Humor, pathos.",
            "review_date": "2021-07-15",
            "source": "rt"
        },
        {
            "content": "The Intouchables is a decently handled story about the friendship between a quadriplegic and his caregiver, but it's lack of depth and originality leads to forgettability and at times- boredom. The humour and levity in The Intouchables is quite good, the dynamic and dialogue between the energetic caretaker, Driss, and his witty but ailing partner Philippe is enjoyable and real, but the film does not have much to offer beyond their relationship. Virtually every character in the film is a caricature, Philippe is the uptight french nobleman who needs a little fun in his life, and Driss the loose and refreshing outsider who's here to shake things up, beyond that, the film's attempt to humanize the characters is both limited and often falls flat. There's even a woman (minor spoilers) who Driss pursues, despite being repeatedly rebuffed, throughout the film, and at the very end it's revealed that the reason she rejects him is because she's a lesbian. That's it. Her entire character throughout a 2 hour long movie summed up in three words. There's no setup, no conflict, no backstory, no depth between her or anyone else. It's just rejection, rejection, rejection, 'Oh I'm a lesbian' - and fade to black. Even the pair of protagonists gets boring halfway through the film because their relationship never changes, there is zero conflict between them, every moment they are together they are happy and smiling and accepting, despite there being multiple points where I expected someone to get angry, or outraged at another for crossing the line, nothing happens. That's the core problem of The Intouchables, there's no deeper meaning, there's no originality, there's nothing in the film that pushes you to make you feel, to make you think, even though it has the perfect story to do so.",
            "review_date": "2021-06-22",
            "source": "rt"
        },
        {
            "content": "Though flawed and full of cliches, The Intouchables highlights the strength of the cast and bolsters some great humor and emotion. It’s a tad long and stumbles a bit along the way, but it’s definitely worth seeing if you enjoy a good character study",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies ever (helps me improve my french too)",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "Intouchables is a wonderful film that talks about an improbable but beautiful friendship, where the character Philippe, a wealthy quadriplegic and his assistant Magalie make an interview with candidates to choose their caregiver. One of the candidates, Driss, is only there to prove with a signature that he was interviewed and rejected and thus continue to receive his social security benefits. Driss is instructed to return the next day to retrieve his signed document, but when he returns he is told that he has received a job as a caregiver. Despite the lack of experience and not wanting the job, Driss takes good care of Philippe and accompanies him in everything, starting a beautiful friendship. However, a friend of Philippe warns him about Driss's criminal record, accused of theft, but Philippe doesn't care about Driss's past because he is the only one who doesn't treat him with pity, he even makes funny jokes throughout the film with the limitations that Philippe has ... transforming what was supposed to be sad into something light. The film has strong scenes, of great commotion, in addition to drawing attention, correctly, to the situation of a person with a lot of money, but who did not have friends, loves and happy moments. The film makes us conclude that having a lot of money is not synonymous with happiness.The film makes us conclude that having a lot of money is not synonymous with happiness, that the past can be left behind and that differences in class, color and race should not overlap relationships.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "A MASTERPIECE, and thats it. I dont like English version, to tell u the truth i never really get it why people keep making different versions of something that is already reached out as the best one, so i must say The upside was not the movie i was thrilled to watch,even tho actors made good job but something is missing. Something that french version have it, and that is- heart and warmth. AGAIN i would recomend this movie to everyone cause its so amazing.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "This is an uplifting film about two unlikely friends. The best thing is it is basically a true story. Wonderful actors and a great story.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "This film occupies a strange place. Some parts do not work in the slightest, but Omar Sy is so talented and charismatic that one also does not care in the slightest. He has a good chemistry with Cluzet, and the plot has a feelgood factor that transcends its rocky moments. Rocky moments aside, the experience never feels wasted and the final scene with a magnificent Einaudi piece makes everything worth the trouble.\n\nA few problems that I had involved the romance-related subplots. There are a juvenile level's worth of sexual references that clash with such a family-friendly tone occupying the rest of the film. The running gag of Driss trying to have sex with Audrey Fleurot's character is tired and similarly out of place. However, the dancing scene to Earth, Wind, and Fire, along with the opera scene and many other funny moments, balance out the missteps well.",
            "review_date": "2021-04-11",
            "source": "rt"
        },
        {
            "content": "I liked the movie very much. A fun social commentary.",
            "review_date": "2021-03-28",
            "source": "rt"
        },
        {
            "content": "The Intouchables is a buddy comedy featuring Omar Sy and Francois Cluzet playing, respectively, Driss, a Senagalese ex-con and Philippe, a wealthy paraplegic. After Driss shows up at an interview Philippe is holding for a new caretaker in an attempt to get someone to sign his welfare benefit papers to prove he's been looking for a job, Phillippe hires him on a whim, despite Driss having zero qualifications for the job and having zero actual interest in getting hired.\n\nOmar Sy is magnetic, and his chemistry with co-lead Francois Cluzet is excellent, but their performances are dragged down by a script full of tired tropes and problematic situations played off for laughs. Especially cringeworthy was Sy's Driss repeatedly hitting on Audrey Fleurot's character, Magalie, getting turned down and not taking the hint. When it's finally revealed why Magalie isn't interested and Driss backs off, we all breathe a little sigh of relief for her. \n\nThe problems with the script are numerous - the fore mentioned repeated sexual harassment in the workplace, a grown man bullying a child being played off for laughs, the lead fitting the \"magical negro\" trope to a T, the disabled character not being played by a disabled actor - but I found myself able to largely push this aside and enjoy the performances of the two lead actors as I watched the film, and came away from it hungry for more Omar Sy performances. Luckily for me, there's an entire season of Sy vehicle Lupin waiting for me on Netflix.",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "The actors made the movie.   Fantastic job",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "Awesome film, I enjoyed how it shows two people from two different types of life bring so much to each other.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "Thank god I am an engineer and not a critic by trade. This movie gave me a perfect time in the evening. Was this movie made for the viewer or for critics? Decide yourself. The revenue is over 400 million worldwide, doesn't it speak?",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Reviewers have got this one so wrong, 75% is a disgrace. I think that in order to love this film you have to understand that the juxtaposition of the upright aristocratic life in contrast with the more low brow slums works to demonstrate that one man with nothing can bring more positivity than those with privilege hanging out their arses. Most people who review this film will no doubt fall into the latter and not understand the fundamental humanistic quality that this film achieves, probably because a lot of people have forgotten what being humane means.",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "Philippe (François Cluzet), a wealthy quadriplegic who owns a luxurious hôtel particulier, and his assistant Magalie are interviewing candidates to be his live-in caregiver. Driss (Omar Sy), a candidate, has no ambitions to get hired. He is just there to get a signature on a document showing he was interviewed and rejected so that he can continue receiving his welfare benefits. He is told to come back the next morning to collect his signed document. The next day, Driss returns and is greeted by Yvonne, Philippe's aide, who tells him that he has been given the job of live-in caregiver on a trial basis. Despite being uninterested in the job and his lack of professional experience, Driss does well in caring for Philippe, even if his methods are sometimes unconventional. Driss learns the extent of Philippe's disability and accompanies Philippe in every moment of his life, assisting him in all the ways needed. A friend of Philippe's reveals Driss's criminal record which includes six months in jail for robbery. Philippe disregards the warnings, stating he does not care about Driss's past because he is the only one that does not treat him with pity. He says he will not fire him as long as he does his job properly...\n\nRotten Tomatoes consensus states, \"It handles its potentially prickly subject matter with kid gloves, but Intouchables gets by thanks to its strong cast and some remarkably sensitive direction.\" The film divided critics in the UK. Upon the film's 21 September 2012 UK release under the title Untouchable, The Independent called it \"a third-rate buddy movie that hardly understands its own condescension....Why has the world flipped for this movie? Maybe it's the fantasy it spins on racial/social/ cultural mores, much as Driving Miss Daisy did 20-odd years ago – uptight rich white employer learns to love through black employee's life-force. That was set in the segregationist America of the 1940s. What's this film's excuse?\" Robbie Collin of The Telegraph called it \"as broad, accessible and trombonishly unsubtle as a subtitled Driving Miss Daisy\"; according to Collin, the \"characters are conduits for charisma rather than great dramatic roles, but the horseplay between Sy and Cluzet is often very funny, and one joke bounces merrily into the next.\" Nigel Farndale, also of The Telegraph, said: \"The film, which is about to be released in Britain, has been breaking box-office records in France and Germany, and one of the reasons seems to be that it gives the audience permission to laugh with, not at, people with disabilities, and see their lives as they have never seen them before.\"\n\nThe story in \"Intouchables\" is there, which is inspired by a true story, but to me this film is so arranged and formulaic and not as engaging as I truly hoped it would be, compared to what many others seems to think. It simply didn´t touch me on a deeper level, nor did I feel interested in Philippe´s or Sy´s lifes. If you want to see a real touching film which carriers similarities to \"Intouchables\", see Julian Schnabel´s \"The Diving Bell and the Butterfly\". Now, that´s a good one. The film has received several award nominations. In France, the film won the César Award for Best Actor for Sy and garnered seven further nominations for the César Awards, including the César Award for Best Film.",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "This movie was so fun to watch. A real feel-good movie. It was full of laughter and hope and happiness despite a depressing situation. It really gives you a new outlook on life and a new perspective when analyzing your own life and what you have achieved. A definite must see for everyone.",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "Seen many times. I appreciate films with limited resources so the characters and dialogues move to the foreground - and in this film it worked very well.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "The Intouchables is film about a quadriplegic millionaire who hires a man who is not suited for the job to take care of him. The film is a masterpiece its funny and really makes you appreciate life more and more. I though if I ever was a quadriplegic I will want Omar Sy to be my assistant definitely. I always think that the worst feeling to have for someone is pity what ever the situation is. The scene most magical scene is at the party of Philippe's birthday -  that music by the orchestra was not to dance-to everyone thought that if the music is danceble is going to make Philippe uncomfortable but when Driss decides to dance everyone just started to dance with him and Philippe really was happy despite that he couldn't. The film was based on a true story and ITS A MUST SEE for everyone.",
            "review_date": "2021-01-16",
            "source": "rt"
        },
        {
            "content": "A beautiful storey with a strong bond of friendship.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "The name might be The Intouchables, but it is most certainly touchable and into your heart. Charming and moving, must see!",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "\"The Intouchables\" is one of those rare movies that had me smiling almost the whole time. This is the definition of a feel-good movie and I personally was very pleased with it. The movie has enough emotional weight and great characters that are just a joy to watch. The two main actors in this movie are outstanding and have an on-screen chemistry that just works very well. I haven't seen the American version of this movie yet, but I am glad I chose to watch the French original beforehand if I ever do see that version. Overall, this is a heartwarming and consistently engaging movie that I was very pleased with.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies. Makes me happy every time I watch it.",
            "review_date": "2020-10-29",
            "source": "rt"
        },
        {
            "content": "Watched a long time ago, but LOVED IT! A very touching story.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "Fantastic!  I enjoyed every twist and turn!",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "one of wonderful friendship story.",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "Incredible story, played very well and very funny as well.",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "The Intouchables is clearly one of those movies made to reach the widest audiences possible, which ended up happening as it was a mega hit internationally. While it is overly emotional and it lost a lot of momentum in its second half, the first one is great and there is no denying that its heart is in the right place. The performances from Francois Cluzet and Omar Sy are both amazing and the friendship between Philippe and Driss is the soul of the movie that is also quite funny in some of its dialogue.",
            "review_date": "2020-09-22",
            "source": "rt"
        },
        {
            "content": "La amistad que se forma en la película es genial y creible, es una película que todos deberían ver al menos una vez",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "I have watched this movie yesterday. I am on a French movie streak, as I want to keep contact with the language and so came across this story of a young \"banlieue\" man, living with his aunt amidst his cousins in a super packed abode. \nIn a job interview with a wealthy handicapped man living in a palace and surrounded by servants, this man, who is only there to obtain a signature to make him eligible for unemployment benefit, gets the opportunity to become a social worker with top benefits such as his own room in the palace and telling everyone around him how they should behave, misbehaving throughout; he chases after the female staff, he orders call girls for him and his master and he convinces the latter to straighten up his daughter who dares not like him and to have a boyfriend with hair. Ah, and he also steals a Fabergé egg. It is a muslim man's Cinderella story where the roles of women may make you feel uncomfortable, which seems to be becoming a trend with recent French movies (or maybe I was just unlucky with my recent picks, I'll leave it to the consideration of other female viewers to either confirm or refute).",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "I hope well and have well.\n\nAn accident can change a life, can change a man. The sadness and lack of hope... Wait wait wait.. It's not like that. The movie isn't about that.\n\nIt's about life, love, and friendship. It has so many life lessons that I don't know even how to begin. First of all, everyone deserves to find someone like Driss. A free spirit, big heart, sincere, and a real friend. Love comes if you are willing and you have the right people by your side.\n\nSometimes love can come from where you least expect, it will restore hope and can heal even the most damaged heart.\n\nOk, enough of this emotional part. The movie it's a huge comedy, clever and dark-humored. It's no time for sadness or pitty, just happiness.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "touching, great performance, good story",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "More candid and sincere than most feel-good cinema, with strong performances that treat its \"quality of life\" subject matter with a tone that is both strong and easily understood. (4/5)",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "Great representation from all! But Omar Sy was spectacular.\nThe movie is just perfect.\nIt takes us high making us laugh a lot and it brings us down to some very strong emotional moments.\nLoved it",
            "review_date": "2020-04-19",
            "source": "rt"
        },
        {
            "content": "That's how you make a biographical drama.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "amazing story and acting. the story is so beautiful and inspiring",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "This movie made me smile more than anything has done the past few weeks , it's really well made, great performances, fantastic score, and beautiful screenplay aside from some plot holes which I was more than glad to ignore them.",
            "review_date": "2020-04-02",
            "source": "rt"
        },
        {
            "content": "L'unico difetto di questo film è il non essere infinito.\nSemplicemente perfetto.",
            "review_date": "2020-04-01",
            "source": "rt"
        },
        {
            "content": "Great movies don't need to sacrifice the story to explore the director or producer or society's latest PC obsession.\n\nThis is a genuinely touching movie with phenomenal actors playing almost every role, and a story told with grace and humor.\n\nSee it if you haven't already.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "The Intouchables is about a rich man who is a quadriplegic, who hires an unlikely candidate to be his primary care-giver. I enjoyed the relationship dynamic between these two men, and how they learned to enjoy one-another’s company. They have such diverse personalities and yet because they have become so dependent on each other, they find common ground. The actors do a truly great job at portraying the journey they are taking emotionally, which is impressive considering they both seem somewhat closed off from their emotions. François Cluzet has the difficult task of making sure he doesn’t cheat and make movements that are impossible for someone in his condition. It’s one of those performances that is so convincing you completely forget that this is an actor who could stand up and walk around in real life. Omar Sy has that kind of charisma that you just want to be friends with him and hang out, so he is tailor-made for his role. As with many films that are based on a true story, The Intouchables can get a bit predictable and cliché. We kind of know where they’re going in some of the key moments, because it wouldn’t have been a story worth telling if the two men broke ties and never saw each other again. I liked some of the subplots, because those often had more unexpected outcomes that I couldn’t predict. The big danger in a story like this one is that it could fall into schmaltz, and overdo it with sentimentality. I think they reined that in well, and made an honest film that didn’t go out of its way to manipulate the audience emotionally. That’s not to say there were no emotional moments, because I certainly teared up once or twice. I also laughed many times with the characters, because they share some humorous moments, and I love how Driss speaks so honestly about the pretentious things in Philippe’s world. The Intouchables is a good film that I quite enjoyed, even if it wasn’t quite unique enough to become a favorite for me.",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "A real top favourite.",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "I normally don't watch any drama movies, but I watched this in French, and it surprised me how good it was. This movie was touching, engaging, funny, everything you need in a movie. It proved to me that a movie does not need to have action and fight scenes to be exciting.",
            "review_date": "2019-11-20",
            "source": "rt"
        },
        {
            "content": "Very sensitive movie.",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "This is the best French movie I've ever seen. I never would've thought that this flick would be so captivating. It skillfully mixes very funny comedy with heart-touching drama. It's a movie which deals with themes of deep friendship, humanity and also shows us the economical and social differences of the characters. And while Francois Cuzet is indeed very good, Omar Sy really killed it on the screen. The movie also has a memorable score. It's a pic that makes you feel good at the end and overall, I really recommend this film, it's one if the best I've seen in a really big while!!",
            "review_date": "2019-06-14",
            "source": "rt"
        },
        {
            "content": "It is a real great film, so rich of emotions: the characters are relatable, funny, sad, complex. The story is about this two different human that are one the opposite of the other and they come to interact. Thanks to this them and the viewers can grow during the film, enriching themselves with the best things of the two different worlds of the protagonist. One of the most outstanding aspect of the film is the score by Ludovico Einaudi, which is powerful and memorable. Near the end there is a part that is kind of lazy written and there are also some cliches that prevent it to reach the perfection. In conclusion: a spectacular movie I love, and I'm sure even other does.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "What a letdown. The storyline and plot were ok but the characters were all cliched and one-dimensional.  Very male - lots of corny jokes about hot babes and \"getting nooky\". Gah. It was like watching a teen movie with middle-aged characters. ",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Great story and an amazing moovie.",
            "review_date": "2019-05-15",
            "source": "rt"
        },
        {
            "content": "My absolute favorite and a must watch!!!",
            "review_date": "2019-04-05",
            "source": "rt"
        },
        {
            "content": "Amistades como esas son maravillosas",
            "review_date": "2019-04-04",
            "source": "rt"
        },
        {
            "content": "Shows us we can laugh of everything because life is too important to be taken seriously.",
            "review_date": "2019-04-02",
            "source": "rt"
        },
        {
            "content": "People who rated this bad movie are A: americans or B: stupid",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "I gave this movie a 4 out of 5 rating. This movie is great in delivering laughs and touches your hard strings without developing too deep into it. The sense of humor this movie has lightens the topic of this movie. It makes this movie doesnâ(TM)t have the heaviness other movies that may stumble over vexing questions of race, class, and disability. The heaviness these types of movies could have often can easily move the audiences but at the same time put an uncomfortable heaviness on the audience. In this movie, there are moments that moved me, but after watching it, there isnâ(TM)t any of the uncomfortableness in me, the only thing I feel is the delight after watching a great movie. I very enjoy easygoing and predictable movies, which is the reason I give this movie a 4 out of 5 rating.\nFrom about 1:30:00 in the movie the movie goes into a sad and depressed mood, this part is the only part of the movie that has a deeper feeling. The calm feeling when the two main characters reunited and the light comedy which came right after it immediately stops the deeper feeling at the right time. It gives the movie a perfect amount of deeper feeling which portraits this movie.\nThe casting of this movie is definitely a huge part of its success. The two actors both have played the characteristics of Phillipe and Driss perfectly. With the wrong emotions shown by the actors in the movie, the feeling of the movie could change. Especially for Phillipe, the strong facial expressions that Francois Cluzet was able to play were really able to show the completed feeling a man with a disability has.\nThe reason this move in my point of view can not get a full 5 out of 5 rating is that the main characters are a little too stereotyped. Philippe is an old, rich white man, likes classical music. On the other hand, Driss is a black man, fresh out of jail, have a huge family to support, going against the rules. These characteristics stumble over the vexing question of race, and class. The only reason why people have no huge reactions to this problem is that of the light and delighting theme of this movie, so people donâ(TM)t think too much into it. Other than that, this movie is pretty perfect for someone like me, who just want to watch some light comedy that I donâ(TM)t think too much into after a long day.",
            "review_date": "2019-02-12",
            "source": "rt"
        },
        {
            "content": "The story is well made, the jokes are spot on. Delivers a strong heartfelt message without being an over dramatic movie as most movies usually do. Tells the contrasting life of 2 men from different backgrounds really well. Easily hooked first time watching it.",
            "review_date": "2019-01-30",
            "source": "rt"
        },
        {
            "content": "It didn't grab me emotionally as much as I thought it could have, but Francois Cluzet and Omar Sy's performances and chemistry make the movie a pretty enjoyable time.",
            "review_date": "2019-01-11",
            "source": "rt"
        },
        {
            "content": "In the wake of the American adaptation coming out. This is one of my favorite movies all time. The contrasts in this movie personally gives me greater insight into society.",
            "review_date": "2019-01-09",
            "source": "rt"
        },
        {
            "content": "One of the top 25 movies ever.  So well done.  Entertaining and a great story.  Not sure why Hollywood is making a remake.  Everyone should see original.",
            "review_date": "2018-12-27",
            "source": "rt"
        },
        {
            "content": "Amazing movie, loved the sound track as well. The acting was superb and the only thing that would give it an R rating is the swear words. Very good movie with a good message ",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Uplifting and restoring faith in humanity.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "\"The Intouchables\" é um filme magnífico. A atuação de Omar Sy e François Cluzet é fenomenal e a história é genuinamente tocante e engraçada.",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "So good I wanted to turn round and go straight back in to see it again.",
            "review_date": "2018-11-03",
            "source": "rt"
        },
        {
            "content": "Refreshing and fun. Not to be viewed as a biography!",
            "review_date": "2018-09-29",
            "source": "rt"
        },
        {
            "content": "more physical than spiritual..\n\nThe Intouchables\n\nThe Intouchables is a character driven feature about a poised handicapped middle aged man that gets a fresher perspective in his life after he hires a living-the-life-to-the-full young man to take care of him. The structure of the premise is simple and familiar to the audience with an appealing details of the characteristics of the characters and the analysis of the relationship among them, which fortunately in here is in plethora of it. \n\nThe chemistry between the lead cast is the heart of the feature that keeps the audience tangled in its sensitive bubble despite of having ups and downs. It also is flawed and cheesy at times that shucks away the somewhat credibility it gains with tiny genuinely moving notions. It is short on technical aspects like background score, cinematography, sound department and editing although the camera work is appreciative as it manually handled that offers the viewers the aspiring personal experience. \n\nAs mentioned earlier, Cluzet and Sy has invested all their chips in, and it pays more than well enough to keep the audience rooting for their friendship. As much as compelling the storytelling is, in its primary track, the rest of the plot and characters are left undercooked and chalky that aches you till the last frame of the feature. \n\nTicking for almost two hours, it easily stretches its way down the road to offer a moot and expected point with a familiar zeal that actually ignited the whole concept. The husbandry gags that are imputed in order to make the relationship more rich that enhances it to a more sensible ground and the gripping screenplay that enfolds guilty pleasures for the viewers are the high points of the feature. \n\nThe Intouchables may not be accurately titled if considered its existence, that is more physical than spiritual, contrary to what makers claims it to be.",
            "review_date": "2018-09-17",
            "source": "rt"
        },
        {
            "content": "Joy deliver. Best at it too. Not trying to delve too deep which is actually a good thing in this case.",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "Very heart warming and funny ",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "The Intouchables' story could be familiar to anybody, even to those who haven't seen a lot of movies. Almost every phase, and every point in this movie is so conventional and unoriginal. However, this movie is very remarkable! That's because it surpasses all the feel-good movies of its kind.\n\nNeedless to mention the high-class direction from Olivier Nakache and Eric Toledano that made this movie exceptional. Thanks to this superb direction, The Intouchables delivers broad laughs and tugs at the heartstrings without delving too deep, or present anything new. Sometimes the movie becomes so hilarious, and other times you couldn't help shedding some tears, often, of joy! The best thing about this movie that it kept its lighter tone throughout its runtime. The tonal shift when the movie moves from its second to its third act wasn't smooth, though. That being said, you will never find any movie of this kind that has half its magical moments.\n\nThe friendship between Philippe and Driss is simply unparalleled. That's, of course, due to the insanely magnetic chemistry between Omar Sy and François Cluzet. I bet you can find such chemistry in any other movie of the same kind.\n\nThe soundtrack is perfectly utilized to match the movie's bright tone. And the cinematography is beautiful, but what I think made the movie looks spectacular is its fancy production design.\n\nThe third act is definitely a bit rushed but I feel like the ending more than makes up for it. This ending could be the sweetest and most charming ending ever. You couldn't decide if you should cry or laugh, but don't worry because you would do both.\n\n(8/10)",
            "review_date": "2018-08-18",
            "source": "rt"
        },
        {
            "content": "IM NOT CRYING. YOU'RE CRYING :w",
            "review_date": "2018-07-27",
            "source": "rt"
        }
    ]
}