{
    "rating": 6.2,
    "release_date": "2012-08-29",
    "num_reviews": 190,
    "genres": [
        "Kids&family",
        "Musical",
        "Adventure"
    ],
    "summary": "It's their friend Schluufy's birthday, and the Oogieloves -- Goobie, Zoozie and Toofie -- are planning a secret surprise party. But, when the last five magical balloons in LovelyLoveville are lost, Goobie, Zoozie and Toofie must find them, or the party will be a disaster. Along the way, the Oogieloves meet some interesting characters (Toni Braxton, Cloris Leachman, Christopher Lloyd) who help them in their quest, but will the three friends find the balloons in time to save the party?",
    "reviews": [
        {
            "content": "All this because the head of the American distributor of the Teletubbies wanted to make a Teletubby movie.  Somehow I doubt a the movie would be any better with the Teletubbies instead of the Oogiloves.  Speaking as someone who remembers his childhood pretty well, even as a 5 year old I still would have hated these terrible annoying condescending dorks.  And the whole idea of an interactive movie in theaters was a bad idea.  But other media for little-little kids like \"Sesame Street\", the \"Electric Company\" or hell, \"Mr. Rogers\" didn't feel like they were talking down to kids.  Kids media today, like this turd or \"Barney and Friends\" or \"Dora The Explorer\" really treat kids like morons.  But this turd isn't even educational.  How the hell did the Oogiloves get Christopher Lloyd, Cloris Leachman and Toni Braxton?  I really don't care if I'm not the target audience.  I don't care if this for basically toddlers. This is nothing but condescending pandering noise that no human being should see.  This is no passion project this is a cash in on annoying pop culture kiddie stuff.",
            "review_date": "2022-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a pretty fun movie to children who wants to see a Big Balloon adventure like this, and the adults would like it for trying so hard to have a great all star cast.",
            "review_date": "2021-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like I a just watched a David Lynch fever dream, but if it was a children's movie. I hope all the actors got well compensated, because they and I will need therapy!",
            "review_date": "2021-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What did I think of Oogieloves? Check out my review below:\nhttps://open.spotify.com/episode/1FuUFJfO1gbA9ZsFTXzcZR?si=_qOl1CNpTxSIY9YJ2hO3FQ",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too babyish! And the songs are annoying!",
            "review_date": "2019-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing in this movie is necessarily inappropriate for kids, but at the same time, it's incredibly stupid and offers nothing of real value.",
            "review_date": "2019-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This maybe the worst movie I’ve ever seen and just feels cheap for a $20 million dollar film!",
            "review_date": "2019-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing in this movie is necessarily inappropriate for kids, but at the same time, it's incredibly stupid and offers nothing of real value.\n\n0/10",
            "review_date": "2018-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bottom 10 of all time, but not w/out laughs at its expense",
            "review_date": "2018-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tis motion picture was downwrite decent,  as I found out by audience reviews when I had a town get-together at my house. Then juveniles thuoght it was fun, and they liked jumping up and down to help these acid trip creautres get there balloons back. My son, Becket felt. meh about it, as he once quoted \"I licked some parts, but I didn't like other parts\" or somethin like that. The adults didnt like this movie, because it got the kiddos wriled up. This was a downwrite average peice of cinema",
            "review_date": "2018-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do not know why people are hating on this since this is a kid show, you should only rate it if your kid likes it.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie ruined Back To The Future for me!",
            "review_date": "2016-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most puzzling kids' movies I've ever seen. It's clearly attempting to recreate a Barney-type experience for a movie theater (in all the worst ways). They also managed to get some surprisingly committed celebrity cameos that only come across as sad.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best kids movie I've ever seen! The story, the complex characters! Fabulous!",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no point of reference here. Not being a parent, the Oogieloves are a new experience for me, and at first glance they seem to be no more or less irritating then the stuff I pass by while flipping channels on my way to something else. My kneejerk reaction is to call their movie \"harmless\" yet something troubles me. At the very beginning of The Oogieloves in the Big Balloon Adventure the titular characters inform the kids in the audience that this movie requires an interactive response. When the movie signals you - by way of butterflies floating across the bottom of the screen - that you are to stand up and dance and sing. In other words, the movie is asking your kids to do the very thing that we have been taught all our lives not to do. It can only be hoped that this does not become a trend.\n\nIf you've heard of The Oogieloves in the Big Balloon Adventure then you've probably heard of it's now famous legacy, released on August 29th 2013 on 2000 screens it quickly became one of the worst selling movies of all time taking in around $500,000 on it's opening weekend on a $12,000,000 budget.\n\nNot knowing what I was in for, I did a quick internet search and discovered that the movie is based on a TV series called \"My Bedbugs\" featuring the adventures of three colorful child characters called Gooby, Toofy, and Woozy. To be honest, I have no idea which one is Gooby, which one is Toofy or which one is Woozy and I only finished the movie 20 minutes ago - not that I was struggling to keep up. I have no idea how this movie ties in with the show, but having seen the movie, I'm not exactly killing myself to investigate further. I can see from an IMDb search that \"My Bedbugs\" was only on two seasons and ended its run in 2005 which means that the intended audience for this movie probably wasn't even born when the show ended. Are the parents flying blind?\n\nThe story of the movie is basically a hanger on which to hang a bunch of musical numbers and songs and interactive bits for the kids in the audience. The journey follows the Oogies as they are preparing to celebrate the birthday of Schluufy, the pillow that sleeps on their couch. But the magic balloons they bought for Schluufy float away and we are told that they are the last magic balloons to be found. The rest of the movie is a song and dance journey to find the five balloons before Schluufy wakes up. The journey takes us through a malt shop, a travelling sombrero, a bubble truck etc. etc.\n\nThe world the kids live in is not a million miles removed from \"Pee Wee's Playhouse.\" Their guardian is a vacuum cleaner named J. Edgar (who bears a nearly litigious resemblance to The Rug Doctor) and a window named Wendy who is their view of the entire world. The look of the movie seems to be a distant cousin of the Sid and Marty Krofft style of the 1970s most notably \"The Banana Splits\" only without the zaniness or the aura of the 70s groovy time capsule. The characters are adult-sized costumed actors with big eyes that move and mouths that barely move when they talk. They look like lesser versions of The Muppets and inspire you to wonder why this movie wasn't animated.\n\nNaturally my own reaction was kind of indifferent, though I was surprised by an incredible amount of celebrity cameos, some of whom looked game but many of whom looked baffled and confused. There's Cloris Leachman, Toni Braxton, Christopher Lloyd, Jamie Pressley, Chazz Palminteri and Cary Elwes.  Elwes is the most baffling, playing a guy named Bobby Wobbly who looks and acts like Jim Carrey. None of these actors appear as themselves, and none is on-screen for more than a minute or two. They are there to sing a song and move along.\nWill the little ones enjoy it? Probably. It's bright and it's colorful and it has a lot of motion and music. But it's not anything you would need to see in a theater. It's a perfectly serviceable DVD where the kids can interact with it in their living room. Again, I'm not sure I am comfortable with the idea of a movie that requires children to sing and dance and act up in a movie theater. And again, I'm not a parent. I would be more comfortable putting a child in front of The Wizard of Oz or My Neighbor Totoro or Toy Story or Mary Poppins. Those movies will stay in your kid's mind for the rest of their lives. Oogieloves will stay with them as long as the DVD is still running.",
            "review_date": "2015-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The single worst movie I have ever witnessed. This movie is a blight on the face of film and cinema.",
            "review_date": "2015-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "25% on my Tomatometer.",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it just makes me shocked at how the guys in charge thought that kids would actually get up and dance to some of the worst songs in general history, let alone think that it could get a higher score than 1/5",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I pretty much lost my brain after watching this, but it is a guilty pleasure",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an awful kids film. Completely lacking in effort",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrendously unbearable in every definable way.",
            "review_date": "2014-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was bad. I saw it because I was reviewing films for a clubhouse in Hyannis. I wanted to gouge my eyes out of their sockets.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie EVER The creepiest thr most childish 4 year olds movie ever THIS IS THE WORST MOVIE EVER MADE",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Consider this the most dumbed-down kids movie you will ever lay your eyes on.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves may be the thing of dreams-an affordable broadway-esque adventure! My whole family is super excited",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves looks like it will be a fantastic night out for all involved!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film really is one-of-a-kind. Love the new words! Definitely something awesome! Just hope the kids don't think scientifieribic or whatever is a real word (:",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let the countdown begin!!!!!! We have it marked on our calendar (:",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is fabtastic!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These sets are so creative!!!!!!! Unbelievably good",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The talking fish is a beautiful thing!!!!! Old school Brooklyn to match the retro cow's cat eye glasses (:",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DO the oogieloves teach workouts to? They look like they could make anything fun",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! I want to get one of these films ASAP!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish the real world was like this-talking cows running a milkshake diner!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids keep asking when we can go see this!!!! Looks really fun. Even the trailer is fun!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is future for the children's film industry!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Musicals always make me wish that people really broke into song and dance spontaneously! Now I also wish we had talking fish and green people (:",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a spectacular spectacle!!!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hahahah the falling pants act is a classic!!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These guys are silly in the best way possible!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a movie like Oogieloves in the Big Balloon Adventure, even parents can dance the night away!!! Excited!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am also laughing out loud........maybe even rolling around on the floor",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laughing Out Loud... literally... just from the trailer.",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This looks like a great rainy day movie for when everyone has just a little too much energy!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am so tired of 3-d movies and those stupid glasses! Instead of something making it seem like we are participating, we actually get to participate!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who would have thunk they could make a movie this cool in a day and age where all kids movies are the same ideas over and over!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wowzers! This movie looks awesomely unreal",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally, a movie the whole family can agree on! Adventure, dance, song, retro vibes----- what an accomplishment!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves in the big balloon adventure looks amazing!!! I can't wait to take my kids exploring with them",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trying to learn the dancing from the trailer so I am ready to go when I see the movie in a few weeks!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My child is a little bit afraid of balloons (a balloon popped in her face) so hopefully this movie with help her and show her balloons are actually fun!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Me and my family are all excited for this movie to come out!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a wonderful concept!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't wait for the end of the month! This movie looks great",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "YAYYYYYYYYYY!!!Oogieloves are coming to theaters soon!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is going to rock!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even the trailer looks fun!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't help it, I love this music!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves promises to be a wonderful film!!!!!!!!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love singing and dancing so oogieloves looks perfect for me!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oggieloves remind me on that song ogachaca! I LOVE THAT SONG",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie looks like a great time!",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A musical adventure with dance lessons? I am in!!!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twist and shout!!!!!! I'm ready for Oogieloves to come to a town near me",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cha ChaCha! The blond lady salsaing is such a good dancer",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a zanie world the Oogieloves in! Totally awesome",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woaaaaaa. What a cool idea!!!!!! I love it.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Those oogieloves sure have rhythm! Impressive considering it is not easy to dance in a costume like that I would think",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love that the goldfish goes everywhere with the oogieloves!!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sounds like its gonna be the best movie ever",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a funny movie!!!!! I want to learn guitar so maybe the movie will teach me",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These guys are a riot!!!!!!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves are so cute!!!!! I want one!!!!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This guys really know their moves! Excited to learn!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves in the great balloon adventure has some awesome jamz",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love that the trailer has actual people (non-characters) dancing! Makes me feel like ill be able to keep up to all the awesome moves!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie! The oogieloves are actually big enough to see all their dance moves and expressions! I find kids' movies usually have characters that are TINY so you can't see ANYTHING",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves are a hoot!!!!!! I'm also a fan of talking animals",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am getting ready to rumble... for oogieloves!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where can I learn to sing like that?",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love musicals where people just start dancing! Oogieloves, you have fulfilled my summer movie dreams!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids love dancing with each other so this film is definitely a good choice for them!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So excited oogieloves is coming to theaters!!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves has everything! Music, science, sparkle and talking animals!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves looks so fun! I love the airport scene with the glow sticks and the plane!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The newborn pink oogielove is so adorable!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love that the movie has such a retro feel!!!!! I want the cow's glasses",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a musical where we can sing along!!!!!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would have loved to see this movie when I was little!!!!!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This looks so good that even the shyest child will want to sing along",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Omg so cute! The kids dancing in the theater are so adorable!!! Even the parents look like they are having fun (:",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is going to be so much fun!!!!!!!!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Toni Braxton really shines!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to learn how to salsa! Will the lady in red teach me? Lol",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to take my kids to see oogieloves if for only one reason: their pet is a totally low maintenance gold fish!!! Not a penguin, not a dog and not a walrus! Finally I can get my kids a pet!!!!",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish I could sing like the lady in pink! She is amazing",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Toni Braxton is looking lovely as ever! Man can she sing!!!!",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opening of the trailer is so funny!!!!!!! But not as funny as the cow in the milkshake place!!!",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opening of the trailer is so funny!!!!!!! But not as funny as the cow in the milkshake place!!!",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That pink keyboard is the best thing I have ever seen! I want one!!!",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to learn these dances!!!",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves, you complete me! I am getting on my dancing shoes right now!",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the dancing scene between the green oggielove and the man in the orange top!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film looks like so much fun! It has all my favorite things: bike rides, dancing and milkshakes!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do you think the puppets will give me dancing lessons?",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These puppets can get their groove on!!!!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These are some rocking puppets!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The yellow puppet has moves!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanna do the fist pump like these puppets!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the way the oggieloves dance!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These songs are catchy!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is that Toni Braxton? She is amazing and looks beautiful!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lol... I am literally laughing outloud! So cute!",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oggieloves is 2GOOD2BTRU!!! Dancing + singing + music + AC in the summer = I am totally there",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film looks great to take the kids to! Now no more having to ask (beg!) them to sit down and be quiet and not move!",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They speak so cool! I love all the new words and \"oogust\" at the end!!!!!!! So funny!!!!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves in the Big Balloon Adventures is short but sweet. It follows the adventures of three oogieloves, Toofie, Zoozie and Goobie, who are organizing a surprise party for another one of their BFFs. When another friend looses the special balloons that are needed for the party, the oogieloves are off on the adventure of their lifetime.\n\nIn 81 minutes, you and your kids can discover brightly colorful Lovelyloveville, dance with the Oogieloves, find the balloons that were lost earlier in the film, and then be on your merry way. One warning: you might not be able to stop singing the movie's catchy songs.\n\nThis is a fun summer film. See it with your kids on a rainy day.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love all the costumes in the trailer!!!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oogieloves in the Big Balloon Adventures is an easy summer film with some funny characters. My favorite are Ruffy, the goldfish with attitude who gets to kiss the lovely Toni Braxton (if only we could all be so lucky!) and Windy, the awesome mirror endowed with superpowers and a knack for window draping. All in all, and especially with these great characters, this film is fun and there is always something to look at!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man! I can't wait to see this movie!!!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The green guy with the classes is totally rad!!!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it when they mix real people and puppets/ cartoons! Like in the muppets or Sesame Street.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! This looks so good. I've never seen anything like this before! I already wanna dance.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why doesn't the fish have water? He's awesome but I don't get it. Maybe it will be explained in the movie?",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't wait to see this! It looks awesome!!!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fish is so cute!",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, it looks like you are supposed to dance along",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God, I hate this movie with a burning passion. It's just way too long and this film's to babyish. The worst film I have ever seen.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You have a brilliant movie when a vacuum falls in love with a window with a very, very, scary face.",
            "review_date": "2013-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DO NOT WATCH THIS MOVIE, THIS IS WORSTER THAN GOING TO BED WITH BENEDICT CUMBERBATCH IN A BIKINI!!!!!!!!!!     I HATE THAT FUCKING FLAPJACKS SONG THAT PUT ON THERE!!!!!!!!!!",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked and I have only seen some of it.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want your children to put you in a nursing home where they feed you dog food, show them this movie.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God help this movie for being real!",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 20 month old loves this movie. I find it a pain but it hit its target audience with him",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trashing something like this is cruel and usual punishment, too easy, and in its own way witless. However... \n\nWhy not investigate the 'movie's' backstory then?  Who wrote this piece of crap....how did it get financing (money laundering??)..why?... its producers and director and distributor...were there drug tests for any of them?..how many did they fail?... ... \n\nTruly, there's a story here, really is.....Nothing this stupendously horrific should go unexplored and ignored.\n\nAsking your presumed 'audience'.. 3-4-5 year olds..to get up and dance (where?.in the aisles?.. like in the 1950's or something?) ...in a pitch black movie theater.. is inviting anarchy, mayhem and law suit..... (younger than 3.. toddler won't be able to keep up with the story line, you know?..and why you would bring a toddler to a movie in the 1st place suggests an immediate need to call child protection...especially for THIS movie)\n\nI assume calling the vacuum cleaner \"J Edgar\" was inside humor intended for adults right?..Hmnn.. That's suspicious on its face...Was this thing actually meant to be seen absent like personally enhancing chemicals?..What do the balloons and the pillow represent? What exactly does \"Goofy Toofie pick up your pants\" mean?.. Is this another sly adult reference..to like PeeWee Herman??... Grandma.. Dotty?..why yes, she is...\"Milkshake Marvin\"?..oh what the hell.. another drug reference...Toni Braxton, in a slinky gown in an airport (?)  singing.. 'scratchy scratchy.. sniff, sniff (snort..a 'runny' nose...too obvious).\n\nIt should be obvious by now that there is far too much unexplained. There may be deep sub-conscious matters evidenced 'on screen' and even deeper ones, off it. Alongside too, are the hard facts of the movie business. If this was intended to lose money, which seems manifest, then who profited? Sadly, we'll never know.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrifyingly odd movie. It is like one long acid trip. If you want to see a really weird, awful movie watch this one.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Say what you want about this movie. I herd about how bad it was and I decided to watch it for laughs and I actually fell in love with this movie, dead ass",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was this suppose to be a reboot of Garbage Pail Kids movie? I mean what the heck is this?",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "zero stars. This could quite possibly be the worst kids movie ever made. I know the target audience is 3-5 year olds but my 9 year old daughter really wanted to see this. The movie is a laughable piece of garbage and Emelie while laughing at its stupidity. I hope stars like Cloris Leachmen, Christopher Lloyd, Chazz Palminteri, and Cary Elwes were well paid up front as this movie now has the distinction of being the lowest grossing U.S. box film to date. HInt: Erase from your acting resume now! In my opinion, it should be used in place of waterboarding during government interrogations although this mess might be too cruel.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the WORST Kids movie I've ever heard of in my entire life! It sucks heck! It suck kiwis! It just...SUCKS!!!",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids loved this movie - why all the haters?  Can't wait for it to be out on DVD.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should this junk even be on earth?",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this seems like another stupid and creepy kids show that will only last for a little while just like the tellitubies",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so bad. No character, pointless cameos, stupid songs and jokes, no story. And on top of it, IT MAKES NO SENSE!!! This movie makes Thomas and the Magic Railroad look like Frozen! Its that pitiful!",
            "review_date": "2012-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an huge waste of money right there. They used about 6 million dollars to make this movie, and by god, they really made the worse piece of crap ever made.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrible movie that you do not want to see. Do not waste you money on this terrible film .",
            "review_date": "2012-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Hate This Movie, Because Is Fails, Is The Worst Movie If Anything Ever Seen This Movie Will Be The Worst Of All The Time!",
            "review_date": "2012-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic. Nuanced. Just an amazing balance of storytelling and powerful metaphor about life. Yes, yes, YES!",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've seen, though Cary Elwes performance is ALMOST worth the price of admission.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My 4 year old absolutely loved the movie and kept asking when we could buy it. Then the rest of the day she spent dancing around making up songs that about balloons and adventures.\n\n So how was the movie in the eyes of the mom? I will be the first to admit that it is very silly, and yes--I'll say it--corny as well.\n\nBut you see--that is really the beauty of this movie. This movie wasn't designed to have \"something for the whole family\" in it--it was specifically targeted to 2-7 year olds--and what they find funny I just don't (or I hope I wouldn't, haha--though I thought J Edgard's name as the Vacuum was cute and clever--Hoover, get it??). So by being over the top crazy and goofy it made my 2 and 4 year old laugh, dance, and giggle--and I enjoyed it simply because they were enjoying it--not because it would be the kind of movie I'd watch alone with my hubby. (RatedGGG remember?!)\n\nThese days children's movies act like they have to be some Blockbuster thriller that you'd go on a date, sans kids, to otherwise they're no good. And while I'm the first one to love and watch movies like that--I really don't feel like every kids movie can or even should meet that.\n\nSo I recommend the The Oogieloves in the BIG Balloon Adventure as exactly what it is supposed to be--a super silly, funny, goofy 88 minutes that your preschooler will love and that you can all have fun at--not worrying about having to shush or tell anyone to stop wiggling during it.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is completely horrible.  Even the overt sexual references cannot save it.  When we went to see it, we were the only ones in the theatre...except for this one random adult male.  lol  There's no reason to watch this ever, no matter how young you are.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually pretty deep, and thrilling. That part when the kid gets stabbed was a real shocker. Actually that happened because he didn't want to sing in the theater. Also a rape scene/",
            "review_date": "2012-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i thought they were joking when they made this..... what a fucking disaster. it made me nervous watching this",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids really liked this movie!  They thought it was very fun, and since they're the target audience I was happy that they liked it so much (they keep quoting lines from the movie!)",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really... Y did this not just go to dvd",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wanna take my daughter to see this",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most aggressively stupid movies in I've seen in ages. This film follows the adventures of three bloated, felt-suit persons as they stagger from one location to the next looking for magic balloons. With repetitive songs, no plot, and suprisingly dull and dark colors for a childrens' film, this movie can't appeal to adults and won't appeal to children. I would advise avoiding this film, but considering its through-the-floor low box office numbers, chances are you you weren't going to see it anyway.",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a freak out! Not recommended, even my kids (ages 5 and 6) were only mildly entertained. The one truly redeeming scene was Lola and Lero Sombrero, played by Jaimie Pressley and Christopher Lloyd -- they were hilarious!",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great movie even my 1 year old grandson watched it.. Love it",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So what did I think of the movie? Well, it is not a movie that is made for grownups. It's all about the kids. But I don't see anything wrong with that. There is absolutely no violence, no adult themes that your kids will be asking you to explain after the movie. The most \"inappropriate\" event is that one character's pants are always falling down (and the kids are prompted to yell at him for it \"Goofy Toofie! Pick up your pants!\") The creators wanted to give the film a GGG rating, to show that it truly is a movie you can take your little ones to without any worry about what they my see on the screen.  And I think that is the key here.",
            "review_date": "2012-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best review I've heard of the Oogieloves was from the 18 month old niece of a friend of mine. I have no little ones of my own, and this little one loves to sing and dance, so we thought this might be fun. She had a riot! And her review? When the movie was over she sat through the credits bouncing in her seat along with the credits music, then when it was over she looked to us and said, \"More?\" After being told it was all done and there was no more, she frowned for a second, then brightened and happily exclaimed, \"AGAIN!\"  \n\nWhat else do you need to know. :) It was loads of fun to watch the kiddos laugh and sing and dance around. They were so into it! And Moms and Dads, if you're worried your little one won't be able to sit through a whole feature length movie, ours barely makes it through a half hour cartoon, but every time she started to get squirrely it was time to get up and dance again. Also, it was nice to have a kids movie with completely no agenda, it's not pushing anything. Enjoy!",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a must see! better than Titantic!! More laughs than Bridesmaids n Superbad n both Hangover's! More action than Expendables 1&2 and Avengers and last two Transformers!! will see this movie 4 more times before it hits blu-ray!!",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOVED THIS MOVIE SO MUCH!!! please go  see it everybody",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kids who watch this movie will one day work for my kids...",
            "review_date": "2012-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply the most boring kids movies ever!",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really not that bad, IMHO far better than the Teletubbies ever were.  http://frdennismoviereviews.blogspot.com/2012/09/the-oogieloves-in-big-balloon-adventure.html",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant example of an \"interactive film\" aimed for kids aged 2-5. It's like a preschool TV show, an hour and half too long. Every actor in it act like they were confused. Cloris Leachman, Christopher Lloyd, Cary Elwes and R n B singer Toni Braxton obviously wanted paychecks. Anybody with a brain will avoid this sugar-coated, drug-induced freakout.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great for kids ages 2-5 other than that wait for video.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Old fashioned style kids film for pre-schoolers.  No villains, which was very refreshing, and charming.   Real puppets and backgrounds, and barely any cgi.   Took a 2.5 yr old to the film, and she was engaged for the whole thing (it was her first movie).  The movie is not for adults at all, and I must admit it annoys me when critics don't get not every film needs to be for all ages.  This was a cute, simple film for very young people.  It worked perfectly, and was a great first movie for the intended age group.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My daughter loved it but I couldn't stand it.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No one showed up sooooo...best make out movie ever!",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film for little ones with an easy plot and fun adventure. It is geared toward kids who enjoy shows such as Sesame Street and the like. It was nice to not have to worry about hearing phrases that I find \"questionable.\" My two kids, ages 7 and 4, really enjoyed it and have asked to see it again. Refreshing!",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously HORRIBLE movie!  Even my 5 year old said \"Mom that was one weird movie\" as we were leaving.  Its about an hour too long and the songs are awful and not dance worthy.  I have sat through many Imagination Movers, Fresh Beat Band, and Yo Gaba Gaba episodes, all of which I would rather watch 2 hours of when compared to this",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Took my 3 grandchildren, ages 2,3 and 5 they loved the Oogieloves! It kept them entertained the entire time, I would recommend this movie to those with young children a must see.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I took my niece to see this movie, and she has not stopped talking about it!  It was fun to go see a movie and watch the children participate and get to be themselves without having to tell them to sit still and be quiet.  Fantastic idea of interactive movies!  There should be more like it!",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My kids really enjoyed this film.  It is a welcome change from the movies where death or villians have the spotlight.  There is a clear story line that makes it easy for the younger kids to follow and the repitition mirrors shows like \"Dora the Explorer\".  Best of all, you dont have to tell you kids to \"be quite\" or \"sit still\" as this movie expects kids and parents to dance and sing along.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an awesome kids movie. Dont listen to critics.. this was a geat movie",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my kids loved the movie not only my kids but i do too",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "TOOK MY KIDS TO SEE THE OOGIELOVES AND THEY KEEP ASKING ME TO BRING GOOBIE HERE TO DANCE!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not want to see this. My mother in law dragged me along when she took my 4 year old daughter. We were the only people so I didn't care that I had to dance every 5 minutes.  I did not like it but I am an adult. My daughter LOVED it. When we paid they gave her a glow stick to wave when the butterflies flew by. She got excited when she predicted the butterflies arrival correctly. Loved the turtle run across the screen that told you it was time to sit down. After it was over she was singing the songs and couldn't stop talking about the ooogies all afternoon. \nFrom an adult standpoint I could feel my brains rotting from all the terrible acting and the creepy big headed oogies. I think kids will love this movie but the parents are not going to subject themselves to this in a dark room with nothing to distract them from it.  It reminded me of h r pufnstuf. But my memory is fuzzy of what it's about.",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        }
    ]
}