{
  "title": "Barton Fink",
  "rating": 8.3,
  "release_date": "1991-08-21",
  "genre": [
    "Drama",
    "Thriller",
    "Comedy",
    "Crime"
  ],
  "summary": "The Coen brothers' apocalyptic masterpiece about the creative process.",
  "critic_reviews": [
    "What \"Raising Arizona\" was to baby lust, \"Barton Fink\" is to writer's block -- a rapturously funny, strangely bittersweet, moderately horrifying and, yes, truly apt description of the condition and its symptoms.",
    "Stimulating entertainment, as rigorously challenging and painfully funny as anything the Coens have done. But it's necessary to meet the Coens halfway. If you don't, Barton Fink is an empty exercise that will bore you breathless. If you do, it's a comic nightmare that will stir your imagination like no film in years.",
    "Scene after scene is filled with a ferocious strength and humor. Michael Lerner's performance as a Mayer-like studio overlord is sensational.",
    "This hip morality tale is by no means perfect - it's not the masterpiece \"Miller's Crossing\" was - but it is stylish, intelligent, witty and more than slightly creepy.",
    "A black comedy in the tradition of David Lynch, Luis Bunuel and the Coens themselves...an assured piece of comic filmmaking.",
    "Very competently mounted and acted (there are also juicy parts for Judy Davis, Tony Shalhoub, and Jon Polito), this is basically a midnight-movie gross-out in Sunday-afternoon art-house clothing--an intriguing novelty that revels in effect while oozing with cryptic signifiers.",
    "The allusions and illusions are just a treat until about two-thirds of the way in, when a genuinely shocking development takes the film off into psycho-horror that is almost as baffling as it is unsatisfying.",
    "For once, the Coen brothers' neurotic filmmaking style works to their advantage; it's giddily appropriate for a movie about a man who's losing his mind.",
    "Barton Fink has an atmosphere of languid comic anxiety (it's like a cross between \"Eraserhead\" and \"Angel Heart\"), and it's fun to watch, if only because you have no idea what's coming next.",
    "Ultimately, however, the look, sound and feel of this macabre comedy fail to support any coherent theme...Much is denigrated, but little affirmed.",
    "Like the mysterious, bound package Goodman gives Turturro (the contents are never revealed), the Coens isolate a small area of interest, bind it with psycho-atmospheric finesse, then wait for something significant to emerge. Even after a second viewing of this movie, it doesn't.",
    "It feels thin. It's an empty tour de force, and what's dismaying about the picture is that the filmmakers... seem inordinately pleased with its hermetic meaninglessness."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Barton Fink is arguably the Coen Brothers masterpiece. Not a single scene is wasted, and that includes the washed out backgrounds, the costumes worn by the characters, and every single bit of juicy dialogue. In a movie filled with awesome Barton Fink is arguably the Coen Brothers masterpiece. Not a single scene is wasted, and that includes the washed out backgrounds, the costumes worn by the characters, and every single bit of juicy dialogue. In a movie filled with awesome supporting performances by John Goodman, Judy Davis, a scene-stealing Michael Lerner and even Tony Shalhoub, John Turturro is the glue that holds this film together. Some actors fail in Coen Brothers movies because they seem too much like spectators...not in their skin and almost watching the movie with the rest of us. Turturro is perfect - an inhabitant of the insane world he's in but also an interloper at the same time. As mentioned above, the dialogue is all wonderful, crisp, sharp, funny, and meaningful all at once. Watch this movie twice if you don't quite get it the first time...the pay-off is simply incredible.",
      "review_date": "2006-12-01"
    },
    {
      "review_title": null,
      "content": "The Coen Brothers' most underrated film, by far, and one of the best films (maybe THE best) about the \"life of the mind,\" to use Barton's expression...",
      "review_date": "2017-04-30"
    },
    {
      "review_title": null,
      "content": "This is probably one of the most hermetic, personal and autobiographical films that the Coen Brothers have ever presented. Many people find it boring. I understand and I can even agree but I also believe that I understand, at least in part,This is probably one of the most hermetic, personal and autobiographical films that the Coen Brothers have ever presented. Many people find it boring. I understand and I can even agree but I also believe that I understand, at least in part, what the directors wanted to tell us.There is a lot of common between the Coen's and Barton Fink, an idealistic intellectual Jew who idolizes ordinary people and, therefore, cannot see how stupid they are (the Coen's can). Suddenly, Fink is hired to write the script for a mediocre B movie about pugilism. The kind of movie ordinary people pay to see even today. Of course the script, by an intellectual full of ideals, would never be useful in these kind of film because Fink didn't know how to adapt himself to the task. He is far above ordinary men to realize what they want to see and that is why he would never please them. This is not just with Fink: today, the majority of people don't like theatre or art because it has become too elitist and intellectual to appeal the masses (taking theatre and the arts as an example, we can still think of classical music or even cinema).From this point of view, this film is deeply intelligent: it starts out as a very intellectual and hermetic film which will make the most idiotic audience flee from the theater and, then, it gradually becomes more \"normal\" through action and violence. Even so, it always contains some intellectuality, through elements and moments that the film never bother to explain (the importance and content of the box that Fink receives near the end, for example, a thing that left me confused and curious). Its as if the film, even making an effort to adapt itself, never ceased to be what it really is. In the midst of it all, I enjoyed the work of Turturro, which gave life to the protagonist. He knew how to make his character naive and dreamy. Fink sometimes seems so oblivious to the world around him that he seems to be stoned. What counts for him is the world he has inside his head. Very interesting, but difficult to swallow for commercial audiences.",
      "review_date": "2018-08-24"
    },
    {
      "review_title": null,
      "content": "Just shows what amazing things the Coen Brothers can do even when they have writer's block. The performances are all top-notch and there's enough symbolic and surrealist glee to leave you scratching at your head for hours, yet everythingJust shows what amazing things the Coen Brothers can do even when they have writer's block. The performances are all top-notch and there's enough symbolic and surrealist glee to leave you scratching at your head for hours, yet everything seems fits nicely in place in the end.",
      "review_date": "2010-08-27"
    },
    {
      "review_title": null,
      "content": "This may be my favorite movie of all time, it is one of the Coen's best movies made. Even though this movie is very difficult to figure out, it works very well and is one of the cone's best. I love the Johns in this movie, they play theirThis may be my favorite movie of all time, it is one of the Coen's best movies made. Even though this movie is very difficult to figure out, it works very well and is one of the cone's best. I love the Johns in this movie, they play their role very well.  The more I watch this movie the more I fall in love with the movie. The cones are at their best here.",
      "review_date": "2012-05-05"
    },
    {
      "review_title": null,
      "content": "I love the Coen brothers. I will get that out of the way first off. While I didn't love this movie, I did like it quite a bit. This film is full of interesting characters and even more interesting imagery. Like most thoughtful movies it is aI love the Coen brothers. I will get that out of the way first off. While I didn't love this movie, I did like it quite a bit. This film is full of interesting characters and even more interesting imagery. Like most thoughtful movies it is a lot unravel in written word for wannabe critics like myself. The acting and writing in this movie is first rate, the scenes with Turturro and Goodman are especially entertaining and the highlight of the film. This movie does drag a bit through the first half, and can feel a little like a rip off of The Shining at times. But overall this movie is more than a little interesting, worth more than one viewing and will keep you thinking about its meanings probably for years.",
      "review_date": "2012-12-15"
    },
    {
      "review_title": null,
      "content": "This is most certainly an odd movie. The acting and directing are predictably good and the plot is interesting for sure. A very cerebral film, this one is most certainly unsettling. Not sure how to react to this one other than; it isThis is most certainly an odd movie. The acting and directing are predictably good and the plot is interesting for sure. A very cerebral film, this one is most certainly unsettling. Not sure how to react to this one other than; it is definitely a good film that will keep you intrigued throughout.",
      "review_date": "2013-08-01"
    },
    {
      "review_title": null,
      "content": "With some truly striking imagery camerawork from Roger Deakins, a characteristically bleak narrative from the Coens, and some thematically rich ideas all throughout, \"Barton Fink\" slides faultlessly across genres with surprising ease and grace.",
      "review_date": "2013-11-01"
    },
    {
      "review_title": null,
      "content": "I wouldn't call this a \"masterpiece.\"  I'd call it a quirky little film about an oddball writer who wants to write The Great American Novel and thinks he can do that by making a lot of money writing for Hollywood.  And I had to check myI wouldn't call this a \"masterpiece.\"  I'd call it a quirky little film about an oddball writer who wants to write The Great American Novel and thinks he can do that by making a lot of money writing for Hollywood.  And I had to check my records no less than three times while watching this film to convince myself that I had not seen it on some previous occasion.I'm not sure what it is but every time John Turturro speaks I'm hearing a youthful Al Pacino, which is odd since one dates back to Brooklyn and the other East Harlem.Includes serial oddball Steve Buscemi in an early minor role as a bellhop and John Goodman as a guy so friendly you know something's up.But, hey, if you like odd then this is probably a flick you should try.",
      "review_date": "2019-07-26"
    },
    {
      "review_title": null,
      "content": "Barton Fink is a smart, darkly comical satire with loads of memorable quotes and fine performances. John Turturro gives an effective lead performance, while John Goodman gives one of the best performances of his career (it's a mystery as toBarton Fink is a smart, darkly comical satire with loads of memorable quotes and fine performances. John Turturro gives an effective lead performance, while John Goodman gives one of the best performances of his career (it's a mystery as to why he didn't get an Oscar nomination) and Michael Lerner steals every scene he's in. The movie's only flaw is its unsatisfying final quarter, where it raises a lot of questions but fails to provide a satisfactory answer for them. Still, the rest of the movie is great, with superb production values and a brilliantly satirical (yet truthful) portrayal of Hollywood and writer's block. Overall, Barton Fink is a triumph for the Coen Brothers and one of the best movies about Hollywood ever made. 9/10.",
      "review_date": "2016-04-27"
    },
    {
      "review_title": null,
      "content": "What \"Raising Arizona\" was to baby lust, \"Barton Fink\" is to writer's block -- a rapturously funny, strangely bittersweet, moderately horrifying and, yes, truly apt description of the condition and its symptoms. Barton, whose last nameWhat \"Raising Arizona\" was to baby lust, \"Barton Fink\" is to writer's block -- a rapturously funny, strangely bittersweet, moderately horrifying and, yes, truly apt description of the condition and its symptoms. Barton, whose last name literally means blabbermouth, is an earnest young New York playwright whose widely praised new play, \"Bare Ruined Choirs,\" has drawn notice in Hollywood, the land where greater men than Fink have found their choirs silenced, their inspiration dried up faster than wet nylons under strong sun.\r A deco-period film by Ethan and Joel Coen, \"Barton Fink\" is in fact their own creative solution to the writer's block that plagued them during the making of \"Miller's Crossing.\" A triumph for the offbeat, grimly funny brothers, it reveals in its mythic fashion the vagaries of the creative process that plague every artist.\r The giving and gifted John Turturro stars as Fink, a self-absorbed and pompous naif who loses his bearings when he accepts a lucrative position with Capitol Pictures. Unwilling to give up all his snobbish principles, he checks into the threadbare Earle Hotel, a regal dump where he wrestles with his conscience, his assignment and his new next-door neighbor, Charlie Meadows.\r John Goodman plays this gregarious fellow, a traveling insurance salesman whose frequent intrusions give Fink a not unwelcome excuse for not writing. Meadows, who seems to embody the qualities of the common man whom Fink so arrogantly imagines he represents in his art, becomes the writer's closest confidant and eventually his wildly unpredictable muse.\r There is the decidedly rank smell of brimstone in the air at the Earle (its slogan is \"Stay a Night or a Lifetime\"), the primary setting for this latest version of the Mephistopheles story. It's 1941 in Los Angeles and a heat wave has settled over the city like a sticky gravy. It's so hot the wallpaper is peeling off in Fink's room, the paste running down the walls in gooey rivulets. That this is a leaky, living hell there is no doubt.\r The Earle is also alive with the sounds of night: the creaking of ceilings and the protests of bed springs, grunts, thumps, screams, wails and wheezing doors. Decorated in ghastly shades -- maroon, olive drab and bloodstain brown -- the Earle seems an organic being as crucial to this haunting tale as the spirit ship was to \"The Flying Dutchman.\" A gurgling, heaving purgatory, it seems a most likely place to teach understanding and punish arrogance.\r And Barton Fink is assuredly a smug whelp deserving of a lesson. He claims to be interested in the stories of the common man, in establishing a theater for the masses. Yet when Charlie says, \"I can tell you stories that would curl your hair,\" Barton, all wrapped up in how magnanimous he is, barely notices. Dire consequences await.\r The Coens have as much compassion as contempt for their hero, who looks vaguely like a cross between the brothers, a goofy intellectual at once shyly baffled and supercilious. Neither a talker nor a listener, Barton sometimes calls up visions of the kidnapped baby in \"Raising Arizona.\" Fink, Turturro shows us, is only a babe among the fast-talking big kids of Hollywood. Still, he's his own weird man, a victim less of the system than of his own unexamined leftist ideals.\r The movie takes an irreverent poke at the industry, setting the hero against such marvelous old-style blowhards as Capitol Pictures' studio boss, Jack Lipnick (Michael Lerner) and the slippery producer Ben Geisler (Tony Shalhoub), who has been assigned to supervise Barton's first film. Puzzled at Fink's reluctance to begin the script, Geisler loses patience: \"Wallace Beery, wrestling picture. What do ya need, a road map?\"\r Barton next turns to a fellow writer, W.P. Mayhew (John Mahoney), for advice. A Faulknerian novelist who drinks heavily and abuses his secretary, Audrey (Judy Davis), Mayhew also sees through the posturing of Fink. Audrey, part belle, part dame, tries to nurture the younger man's talent, but her efforts unfortunately come to a very bad end, which propels the tale to its obscurely symbolic but ultimately penetrable conclusion.\r The winner of an unprecedented three prizes at the Cannes Film Festival this year, \"Barton Fink\" is certainly one of the year's best and most intriguing films. Though it defies genre, it seems to work best as a tart self-portrait, a screwball film noir that expresses the Coens' own alienation from Hollywood. A cineaste's landmark on a par with \"Blue Velvet,\" this is an experience to savor over and over.",
      "review_date": "2016-04-03"
    },
    {
      "review_title": null,
      "content": "Barton Fink is a surreal black comedy by the Cohen brothers. You don't have to watch the authors of the film on the Internet, the handwriting of the Koen brothers is immediately visible. Just the best role of John Tuturro in his career.Barton Fink is a surreal black comedy by the Cohen brothers. You don't have to watch the authors of the film on the Internet, the handwriting of the Koen brothers is immediately visible. Just the best role of John Tuturro in his career. Barton Fink has a huge array of references to the Coen brothers' early films. An excellent black comedy, in which there is no low-grade humor, but there is a provocative surrealism of what is happening. The plot at the beginning seems quite typical, but it has a hectic ending in the last 15 minutes and a specially opened mysterious ending. And if you look at the film soberly Barton Fink ordinary comedy, if not for the magnificent dialogue of Barton Fink with the character John Goodman. Scenes with Goodman are the best thing about the film. In such chamber films, acting is shown.",
      "review_date": "2022-11-14"
    },
    {
      "review_title": null,
      "content": "This is a good movie that talks about Hollywood and talks about what a creative crisis is for an artist and it does it in a perfect Coen style, pregnant of thrilling and dark humour. This is an impressive four feature by one of my favouriteThis is a good movie that talks about Hollywood and talks about what a creative crisis is for an artist and it does it in a perfect Coen style, pregnant of thrilling and dark humour. This is an impressive four feature by one of my favourite directors.",
      "review_date": "2021-11-03"
    },
    {
      "review_title": null,
      "content": "The Coen Brothers did it again with Barton Fink and it's great how they did it.",
      "review_date": "2022-06-18"
    }
  ],
  "num_reviews": 26
}