{
  "title": "Boyz n the Hood",
  "rating": 8.6,
  "release_date": "1991-07-12",
  "genre": [
    "Drama",
    "Crime"
  ],
  "summary": "Tre Styles (Cuba Gooding Jr.), is a teen caught between the steady, forceful guidance of his father, Furious (Laurence Fishburne), and the inescapable violence of his South Central Los Angeles neighborhood.",
  "critic_reviews": [
    "Has maturity and emotional depth: There are no cheap shots, nothing is thrown in for effect, realism is placed ahead of easy dramatic payoffs, and the audience grows deeply involved.",
    "The film not only lives up to its \"Increase The Peace\" subtitle but by refusing to overtly moralise puts its concerns across with astonishing impact.",
    "Boyz n the Hood is a knockdown assault on the senses, a joltingly sad story told with power, dignity and humor. No mere studio genre piece preening as social significance because its characters are black, Boyz is straight from the neighborhood — Singleton grew up in South Central — and straight from the heart.",
    "The film's strength is that it sustains an intimate and realistic tone. Mr. Fishburne, who is called upon to deliver several lectures, manages to do so with enormous dignity and grace, and makes Furious a compelling role model, someone on whom the whole film easily pivots.",
    "The rage that fuels Singleton's film is harnessed to great effect, he shows the reality, and while it builds to a melodramatic conclusion, it depicts life at its most raw.",
    "If people here feel trapped, despairing of a way out, it is Singleton's gift to make us empathize with their hopelessness, and make us wonder, along with them, how long this must go on.",
    "Ultra socially responsible, sometimes to the point of playing like a laundry list of difficulties faced specifically by the urban black community.",
    "Positive figures--Furious, Tre, Brandi--are rendered perhaps too virtuous, and Singleton becomes a bit preachy in the closing scenes, but an overt \"message\" movie may be the only appropriate response to the ongoing social crisis addressed.",
    "All of the major players turn in powerhouse performances, and Fishburne nails his best role yet as Furious.",
    "It will often tear at the heart too -- at least, when it doesn't feel like the rap equivalent of a classroom lecture.",
    "With its energetic cast and insistent street score, it still manages to be poignant without becoming bathetic, and violent without being exploitative.",
    "Singleton shows some genuine talent in handling character and action, and equal amounts of confusion and attitude when it comes to matters of gender and ghetto politics.",
    "Singleton's plot is disappointingly conventional; it obeys screenwriting-class rules. The experience he's dealing with here deserves something more than the tidy dramatic structure that he has imposed on it."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Classic movie by John Singleton.  Urban story of just that...Boyz Growing up in the Hood.  Good kids mixed with bad kids, going through high school life with temptations outside.  Wonderful film",
      "review_date": "2013-06-20"
    },
    {
      "review_title": null,
      "content": "''passionatte heartfelt''\r ''this is a tue classic movie on what life was like growin up in the ghetto's of south centra LA i love this movie dearly its a film of violence drugs and trying to increase the peace this is probably the only''passionatte heartfelt''\r ''this is a tue classic movie on what life was like growin up in the ghetto's of south centra LA i love this movie dearly its a film of violence drugs and trying to increase the peace this is probably the only good movie ice cube has made next to barbershop 1.2 the cast is great the drama is perfect and the hole movie basically sais to us all lets all have just a little peace fer once and take a day off from evil''",
      "review_date": "2013-05-14"
    },
    {
      "review_title": null,
      "content": "Devastatingly realistic, but handled deftly. The characters aren't just devices used to propel some preachy, self-righteous message: they elicit true emotions in the viewer and provide faces to what a lot of people had ignored.",
      "review_date": "2010-11-07"
    },
    {
      "review_title": null,
      "content": "This is a very good representation of the hood, these actors must know a thing or two about it because they gave us an excellent performance, very good script, and location. It has its flaws but it delivers a decent movie but it's definitelyThis is a very good representation of the hood, these actors must know a thing or two about it because they gave us an excellent performance, very good script, and location. It has its flaws but it delivers a decent movie but it's definitely not a 10, maybe a 7.5 - 8.",
      "review_date": "2012-12-20"
    },
    {
      "review_title": null,
      "content": "Boyz n the Hood shows how African Americans to survive in the streets before any of the urban gangster films starting using the cliches of the streets. It is one of the best gangster films of all time.",
      "review_date": "2014-07-01"
    },
    {
      "review_title": null,
      "content": "Great film. A story which anyone (any race) can ID with. Wanting the best for your child, teaching the best you can while staying away from straying influences. Then flash forward to see the differences in the \"finished product.\" AlthoughGreat film. A story which anyone (any race) can ID with. Wanting the best for your child, teaching the best you can while staying away from straying influences. Then flash forward to see the differences in the \"finished product.\" Although watching the film now, it seems a little outdated. The only negative about this film is that the director (who has not really put anything together worth mentioning since this film) acts like he changed the world with this film.",
      "review_date": "2013-05-07"
    },
    {
      "review_title": null,
      "content": "Great acting with great directing helped produce this realistic depiction of life in the hood. It certainly has its flaws and is far from perfect (for example, the beginning is pretty slow), but regardless, it is definitely a movie thatGreat acting with great directing helped produce this realistic depiction of life in the hood. It certainly has its flaws and is far from perfect (for example, the beginning is pretty slow), but regardless, it is definitely a movie that people need to see if they haven't already.",
      "review_date": "2013-06-05"
    },
    {
      "review_title": null,
      "content": "A very funny but also very heartfelt and true inside look at the black culture of America in the early 90's. Brilliant performances, especially from Laurence Fishburne, and a gripping plot make Boyz In The Hood hugely enjoyable and one of theA very funny but also very heartfelt and true inside look at the black culture of America in the early 90's. Brilliant performances, especially from Laurence Fishburne, and a gripping plot make Boyz In The Hood hugely enjoyable and one of the most realistic comedies ever.",
      "review_date": "2014-02-14"
    },
    {
      "review_title": null,
      "content": "Boyz N The Hood is one of the best films of all time providing the audience with a story and characters that are easy to relate to all of the characters in the movie have fantastic chemistry its very much felt like they all have known eachBoyz N The Hood is one of the best films of all time providing the audience with a story and characters that are easy to relate to all of the characters in the movie have fantastic chemistry its very much felt like they all have known each other for a long time.\r10/10",
      "review_date": "2015-10-07"
    },
    {
      "review_title": null,
      "content": "Boyz n the Hood was released in 1991 and was directed by John Singleton. The movie is about three young men, Tre, Doughboy and Ricky who are trying to cope with the dangerous society that they live in and find a way to overcome it.One thingBoyz n the Hood was released in 1991 and was directed by John Singleton. The movie is about three young men, Tre, Doughboy and Ricky who are trying to cope with the dangerous society that they live in and find a way to overcome it.One thing I loved about this film was how honest it was. It wasn't afraid to display the reality of situations which were indeed happening in real life. I think a reason it was so realistic was the fact that much of it was based off the director's own life. Speaking of the director, this was his debut film and to say this was his first he did a great job. He was also the youngest person ever to be nominated for an Academy Award at the time too.All of the cast gave great peformances, the one who surprised me the most was Ice Cube. If you knew that Ice Cube was in the movie and your reaction was \"That isn't going to work any day\", then I take it you've only seen the Ride Along movies. I was surprised by how sincere his character and acting was and I think the conflicts he had to face with the N.W.A and the police in the past added to his character as his character is someone who has had many run-ins with the police in the past. Another peformance I was surprised by was Laurence Fisburne as the main character Tre's (Cuba Gooding Jr.) father. He displayed the qualities of a good father and someone who managed to connect with the character of Tre in multiple situations. It's probably my personal favourite peformance of his that I've seen.Like I mentioned earlier, this movie wasn't afraid to display the truth and it did it well, with many emotionally intense scenes and also many surprisingly relatable ones too. It displayed perfectly the difficulty of life for everyone living there and you felt for their characters. It also provides a good message of the right way to fight back against all of these bad things.I believe that the themes of this movie will likely stay relevant for quite a while and they can be applicable to just about anyone too and this is the reason why I think that this movie will remain important for many years to come. No wonder it's apart of the Sony Classics Collection.Overall, this was a much deeper film than I expected to see that wasn't afraid to show the realism of situations that were also going on in the real world and carried across a good and moving message. I would highly recommend this film.8.2/10",
      "review_date": "2017-01-15"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nGreat film! The guy who dies has a sexy wife, wooooah she's hot. Trey is a **** for not taking revenge with ice cube, where was dr dre though? 9/10 shots",
      "review_date": "2017-05-24"
    },
    {
      "review_title": null,
      "content": "but only a real man can raise his children..Boyz N The Hood\n\nAmong many heartfelt sequences, the key in here that binds it all is a father and son's relationship that is portrayed with equal innocence as it was written, which is clearlybut only a real man can raise his children..Boyz N The HoodAmong many heartfelt sequences, the key in here that binds it all is a father and son's relationship that is portrayed with equal innocence as it was written, which is clearly visible in here. John Singleton's amazing writing and brilliant execution skills brings out more from character's perspective that goes deep into it whilst still playing on surface. Cuba Gooding Jr. is doing some of his best work in here but the real game changer is Lawrence Fishburne as a soothing and resolved father in this convoluted world. Boyz N The Hood takes it lightly in its first half and builds up this character driven feature in its second one before the intensity increases and stakes grows bigger than usual (which is projected smartly) in its stunning final act.",
      "review_date": "2018-04-16"
    },
    {
      "review_title": null,
      "content": "This movie shows a good way of how life is in the hood! Good actors.",
      "review_date": "2006-01-10"
    },
    {
      "review_title": null,
      "content": "Very realistic to what goes on in other areas of real peoples lives that people take for grated and do not believe things like this really existent. \"but it does\" Very positive message!!!! Great film!!!",
      "review_date": "2005-09-09"
    },
    {
      "review_title": null,
      "content": "A great movie. One question though: is South Central LA still like this? I remember in Michael Moore's film \"Bowling for Columbine\" how he and another white man (a professor I think) basically pour scorn on the idea that Compton is some A great movie. One question though: is South Central LA still like this? I remember in Michael Moore's film \"Bowling for Columbine\" how he and another white man (a professor I think) basically pour scorn on the idea that Compton is some kind of war zone. I wonder what a modern day African American kid would say?",
      "review_date": "2006-07-07"
    },
    {
      "review_title": null,
      "content": "Life south of Los Angeles, and the efforts of its inhabitants to lead a normal life, and envision a better life away from the constant and inevitable violence. It is not to see with the whole family but it is worth it for the performances andLife south of Los Angeles, and the efforts of its inhabitants to lead a normal life, and envision a better life away from the constant and inevitable violence. It is not to see with the whole family but it is worth it for the performances and its attachment to real life.",
      "review_date": "2020-10-03"
    },
    {
      "review_title": null,
      "content": "Dramática, tensa y conmovedora, es una de las mejores películas de la década de 1990.",
      "review_date": "2020-09-05"
    },
    {
      "review_title": null,
      "content": "I was in the mood for a gangsta movie and so I'm quite satisfied with the final one. I was especially interested in the film because of the cast of Ice Cube. I was bored most of the time, but it got more interesting towards the end. Not thatI was in the mood for a gangsta movie and so I'm quite satisfied with the final one. I was especially interested in the film because of the cast of Ice Cube. I was bored most of the time, but it got more interesting towards the end. Not that it's any bad, I'm just saying I wasn't really interested. I did like the ending though, so I'd say it was a good movie. Nothing more. Nothing less. I'd probably recommend it to fans of gangster movies, but I have to point out again that other than the ending, there wasn't much of anything interesting going on for me.",
      "review_date": "2022-10-26"
    },
    {
      "review_title": null,
      "content": "----------------------------------8.0/10-----------------------------------",
      "review_date": "2021-12-30"
    }
  ],
  "num_reviews": 32
}