{
    "rating": 8.9,
    "release_date": "1968-05-02",
    "num_reviews": 70,
    "genres": [
        "Comedy"
    ],
    "summary": "When fussy Felix (Jack Lemmon) becomes suicidal over his impending divorce, he accepts an offer to move in with his best friend, messy Oscar (Walter Matthau). Felix drives Oscar crazy with his obsession over his soon-to-be ex. Oscar tries to get him out of his funk by arranging a double date with two wacky British neighbors, Cecily (Monica Evans) and Gwendolyn (Carole Shelley). When the plan backfires and Felix grows even more despondent, his friendship with Oscar is put to the test.",
    "reviews": [
        {
            "content": "Overall, this is an excellent film with snappy dialogue that feels real.  At no point was I ever bored while watching.  It's filled with amazing performances from Jack Lemmon and Walter Matthau.  I adored witnessing their chemistry, their funny line deliveries and dramatic moments as they bring a strong friendship to life.  I had a wonderful time watching this film, and as the credits rolled, I was ready to rewatch it instantly.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the film that defined Matthau and Lemon as a team. The writing is perfect.",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films you could watch a million times and still feel attached to every scene",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a fairly amusing comedy film from the 1960s. It is perhaps a bit un PC or stereotyped these days, in that it covers the risk of suicide from a guy who's marriage has just broken down but the awkward comedy did appeal to me never the less. The humour is pretty juvenile in nature but I didn't mind that too much. There's plenty of fast paced dialogue and some fairly memorable moments. The men are somewhat curmudgeonly and the ladies (well, some of them) somewhat 'dolly bird'-ish but I enjoyed the film and thought it was entertaining never the less. I wouldn't like to make fun of someone who was recently divorced but the comedy does come from other plot details - mainly the fact the 2 men have to share the same flat/apartment. The situations they find themselves in and how they defend their actions made me chuckle quite a bit. This isn't what I'd call a great film but its certainly good enough to be worth a watch - it has a bit of a farce type feel to it and I wasn't surprised its based on a play (by Neil Simon), as I did think it came across as a film that would be easy to stage as a play or theatrical production.\n\nAs I say, yes, I'd recommend this film.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a reason the Odd Couple is a classic comedy - it's as good as Neil Simon gets.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's sweet and funny even though a lot of jokes and scenes seem forced and unnatural. Still a great play by the two main 'buddies' living together in the same apartment.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film makes you laugh throughout due to its great writing, good performances, and fun chemistry between Lemmon and Matthau! A great comedy!",
            "review_date": "2021-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The directing and the performances are just constantly at the top of their game. Lemmon and Mattheau were seriously born to irritate each other on screen for our amusement and thank god.",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"YOU ASKED FOR IT. YOU'RE A WONDERFUL GUY, OSCAR.\"\n\nOne of the most well-known and successful comedies of the partnership between Jack Lemmon and Walter Matthau, The Odd Couple isn't as fast-paced as modern examples of the genre tend to be (and slower than the screwballs that preceded it) and requires a bit of adjusting as a result, but is suprisingly wholesome and entertaining for a buddy film that uses a collapsing marriage and a suicide attempt as its starting bell. The balance between Lemmon's jittery high-strung energy and Matthau's heavily accented sluggishness is still a winner, pairing well with their husband/wife roleplaying that you can manage would have been more endearing as a comedy of manners in the conservative '60s. The ending is pretty anticlimactic all things considered, but this is still a solid film despite showing some of its age. And at $1.50/hour, Lemmon's deep-cleaning services are a bargain. \n\nAs a side note, this might be the earliest film I can recall with an end-credits gag, intentionally mixing up and 'correcting' the actresses of the identical twin sisters that take in Felix in his hour of need. (3.5/5)",
            "review_date": "2021-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a good one for me",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on Neil Simon's 1965 play of the same name, Gene Saks's adaptation of \"The Odd Couple\" features a characteristically amusing pair of performances in the form of Jack Lemmon as Felix Ungar and Walter Matthau as Oscar Madison. However, beyond a few smile-inducing exchanges and a couple of clever sight gags, I just simply didn't find this to be all that funny. This isn't to say that the material at hand is chock-full of swings and misses or offensive subject matter or anything. I guess what I'm saying is, no one told me that this was more of a dramedy than a straight-up, straight-laced comedy. Indeed, Lemmon and Matthau are fun to watch together, with their onscreen chemistry comprising the key factor of enjoyment for me. There's just not really that much else here for my comedic tastes. Killer theme song, though.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you start talking about favorite acting duos I can't think of any I'd choose over Matthau and Lemmon.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected more action at the end, so not great, but it passed the time. Also very funny.",
            "review_date": "2020-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The stars have always worked well off each other and this is them at the best,",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very, very funny.  Love the Pigeon sisters.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious.. I have been addicted to the odd couple ever since..",
            "review_date": "2020-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hilarious and it's beautifully made as well.",
            "review_date": "2019-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love love LOVE THIS!  Can't believe it took me so long to see it!",
            "review_date": "2019-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This goes great with a sandwich.",
            "review_date": "2018-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jack Lemmon and Walter Matthau are comedy legends. While the concept of The Odd Couple was solid on its own, I’m still not convinced it would have been as much of a cultural phenomenon (even to the point of inspiring TV spin-offs and a movie sequel) if not for the talent of the two lead actors. These guys elevate the material to greatness because they have a perfect handle on the characters, and have great chemistry with one another. Matthau in particular was born to play the irascible slob who can’t put up with a lovelorn neat freak. Somehow he makes being aggravated hilarious, and normally I’d be annoyed by a likable guy dealing with constant frustration (it’s one of my least favorite plot devices in film.) The other actors in the film are also delightful, particularly Monica Evans and Carole Shelley as the ditzy girls next door. One of the problems I have with The Odd Couple (and this isn’t a flaw in the film, just a personal issue) is that the plot is lackluster and needed more going on. But I’m convinced it only felt that way to me because I saw many episodes of both the original TV series and the recent remake. Having all that familiarity with these characters before made this film feel like an extended episode of the show, instead of something wholly original. I know this isn’t the movie’s fault, since it came out before all of that other stuff, but when the movie was ending I couldn’t believe that was all we got for a story (a lot of things I already knew and not much resolution.) I still enjoyed the way the plot was presented, and the confrontations between Oscar and Felix are great in this version, I think I was just expecting something more. Along with the cast, the dialogue makes The Odd Couple shine. It was obvious early in the film that this script was witty and smart. It doesn’t settle for a bunch of slapstick or crude jokes, instead it has people delivering lines that are actually written funny. I sometimes wonder if they should have made Oscar a bit more of an obnoxious slob, though. For most of the movie it seems like Felix is always in the wrong. He’s the one overreacting, he’s the one who can’t stop nagging, he’s the one who obsesses over every little detail, so it feels natural to assume he’s the antagonist. I think the dynamic of the film would be a bit stronger if both guys were annoying, so they are both right and wrong at the same time. That being said, I forgave a lot with The Odd Couple because it made me laugh several times, plus Jack Lemmon and Walter Matthau are nearly perfect in every single scene. Ranking on my Flickchart Wins against Paul Wins against Manhunter Loses to Jumanji: Welcome to the Jungle Loses to Glengarry Glen Ross Loses to Ordet Wins against Safety Not Guaranteed Loses to Four Weddings and a Funeral Loses to Her Loses to Ruggles of Red Gap Loses to The Muppets Take Manhattan Loses to A Night to Remember The Odd Couple ranked 371 out of 1591",
            "review_date": "2018-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lemmon and Matthau are great!",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This comedy based on a stage play is fun and entertaining from start till end. Featuring solid performance all round, a witty script and perfect timing, this movie provides many laugh-out-loud moments. The scene with the Pigeon sisters is particularly funny.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Felix's (Jack Lemmon) wife has left him and he is contemplating suicide.  His friends sense his depression and one of them, Oscar (Walter Matthau), volunteers to take him in until he is fine again.  The two of them are like chalk and cheese - Oscar is fun-loving, gregarious and slovenly, Felix is a shy, stay-at-home, obsessive-compulsive neat-freak.  Being around Oscar brightens Felix up, but he quickly starts to irritate Oscar...\n\nAdapted by Neil Simon from a play he wrote, a movie that perfectly captures one of cinemas most enduring and prolific comedy duos - Jack Lemmon and Walter Matthau.  Though not their first movie together - that honour belongs to Billy Wilder's The Fortune Cookie from 1966 - this is the movie that ensured there'd be more Lemmon-Matthau collaborations.  \n\nBoth are in fine form here, and are perfectly cast for their roles.  Wonderful delivery and sense of timing on both their parts.\n\nGreat script too.  The dialogue is snappy and very funny, with some great one-liners.  Some great sight gags too.\n\nA comedy classic.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie I enjoyed it and thought it had some funny moments. The acting was very good and the movie also has a catchy theme tune.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7.0/10, my review: http://wp.me/p1eXom-2RH",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lemmon and Matthau are great in this classic comedy.  It's great watching these two together.  Definitely enjoyed watching these two legends together.  Recommended!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funniest movie of all time.",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty dialogues coupled with situational comedy and throw in a rye sense of humour, this movie is a winner. It is charming, laugh out loud and doesn't have a useless side plot of romance thrown in. A must watch!",
            "review_date": "2016-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very popular comedy that spawned many sequels, including a long running TV show, plays and various modernized alterations, as well as many other pairings for the main actors Lemmon and Mathau. Those two certainly played off each other extremely well and this might have been their best teaming up. The original film still works and now has a nostalgic snapshot of the past vibe which adds even more.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original opposite comedy/buddy comedy that has since become a very familiar TV and movie trope. Jack Lemmon and Walter Matthau are absolutely one of the best onscreen comedy teams of all time and are both wonderful in the film together, but at the same time this film should have been a whole lot funnier. I seem to remember reading that Billy Wilder was approach to write and direct the film adaptation of the Neil Simon play, and I am convinced that film would have been a classic. Instead, this story that answers the question, can two divorced men share an apartment without driving each other crazy? Wilder apparently did not take part in this film over the studio not wanting to pay his salary, but his touch of madcap comedy and sentimentality is what this film really needed. Neil Simon adapted his own play for the screen, but the film does still feel stagey and the film seemed oddly paced. Despite it's faults, Matthau and Lemmon shine and do make this film something of a minor classic.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i liked alot more when i first saw it but repeated viewings way too many repeated viewings has left a bad taste in my mouth that is hard to wash away",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my new favorites",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay I know I used for a lot of other reviews but This movie is very simple two complete opposite have to deal with living with each why does it work so much well it is written by the great Neil  Simon and second its jack lemon and Walter Matthau to actors that work perfectly it maybe be simple humour but I love it for the characters one of best comedy's I ever scene",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a delightful comedy of friendship, solidified in mutual affection yet explosive in domestic habits.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't seen this movie in ages. Cindy and laughed our rears off. Mathau and Lennon what more do you want.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie from this duo and just as entertaining and funny today as the first time I saw it  when I was but a pup.,,,,how many movies can you say that about?",
            "review_date": "2015-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Odd Couple is a wonderful comedy filled with many hilarious parts that bring a smile to your face, it is also very charming and heartwarming, the dialogue is excellent and the acting is just phenomenal with both Jack Lemmon and Walter Matthau giving powerhouse performances. The directing is nothing special and the beginning is slow, but this is still a superb film that benefits from excellent acting and really likable and well developed characters. It is also sweet and funny, but always engaging and just fun.",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite possibly the greatest comedy film of all time.",
            "review_date": "2015-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely funny comedy that modern Hollywood comedy owes all its stripes to. 8/10.",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric, funny classic. Another Jack Lemmon treat.",
            "review_date": "2015-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rich dark comedy with great chemistry between its leads.",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "80% on my Tomatometer.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While a funny idea, I wasn't rolling in the aisle laughing my butt off. It's very confusing to go see a comedic movie and the film opens with someone trying to commit suicide. Maybe in the 60's this was funny, but I don't know. I'm not saying it was bad. A few jokes did make me giggle. Story wise, it's a good idea. Maybe I'd enjoy it more if I didn't see a million cartoons that did the dysfunctional roommate story before seeing this film (Like Teenage Mutant Ninja Turtles,  My Little Pony: Friendship is Magic, Spongebob Squarepants, etc.) Overall, it's a good movie, and it's worth a watch, but if you don't want to see it, you aren't missing much.",
            "review_date": "2015-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring Jack Lemmon and Walter Matthau. If you don't know the story, then you're culturally illiterate. But this is the definitive film version of Neil Simon's story of two mismatched New Yorkers who share an apartment. Lemmon and Matthau, who were friends in real life, are simply one of the great screen comedy teams and their byplay is delightful to see. This was the second of ten films they made together between 1966's \"The Fortune Cookie\" and 1998's ill-fated \"The Odd Couple II\". Directed by Gene Saks, who does a good job opening up the confined apartment of the stage production.",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the heck was this?",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Odd Couple is a dramedy about Felix who got dumped by his wife and his best friend decides to let him live in his apartment. The story is an interesting one be chase of how different the two are from each other and how they slowly get more frustrated. Jack Lemmon and Walter Matthau play good opposites of each other and I thought they really pulled off good performances. There wasn't any way that I could get mad at the characters when they fought because they are simply just different people and that's understandable. The side characters were fun like the poker group and the pigeon twins even though they were a bit annoying at times. Their fights were pretty funny and enjoyable but as the movie got towards the end it got kinda bitter. I thought maybe that it was the falling action after their main argument. It never really did get any chipper than the first 3/4s of the movie. The ending was kinda bittersweet the way they joked with each other but I just wanted a bit of a happier ending. The Odd Couple was a funny dramedy. Lemmon and Matthau were great and had good chemistry. The ending was a bit of a disappointment but I liked the first half a lot. B",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the mature themes and awkward comedy situations enlivened by Lemmon and Matthau's terrific interplay that made The Odd Couple the enduring buddy comedy hit that it is.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before they were \"Grumpy Old Men,\" Lemmon and Matthau were \"The Odd Couple\" in one of their collaborations that brings the usual comics and some drama when being serious for a few times as that's probably a usual ingredient for a comedy to show that the point isn't a joke at the two-thirds point of the show. (B+)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Excellent comedy pairing. Strong supporting cast. Matthau and Lemon at their best. As funny today, as the day it was made.",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great classic, with some wonderful timeless banter. Such a good pairing  with Lemmon and Matthau, was a very enjoyable re-watch",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny but not fresh.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute. A lot of heart, but basically just one long extended joke.",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the slapstick may be a tad dated, the witty script remains as funny as ever!",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great screenplay and the main stars make this a comedy that still endures.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad for a 46 year old comedy.",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "propelled by the fantastic chemistry from the two leads the odd couple is an absolutely hilarious must-see 60s classic",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the wonderful origin of every terrible sitcom you've ever seen",
            "review_date": "2014-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pleasantly simple and funny, this works well on all accounts. The chemistry is so much fun to watch, and the acting is really great to watch unfold.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite comedies, and possibly the best pairing of Matthau and Lemmon onscreen. They bring Neil Simon's script to life so perfectly and effortlessly that it's hard to imagine anyone else playing Felix Unger and Oscar Madison, although Tony Randall and Jack Klugman did a fine job in the TV show as well.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best comedy I've seen in years.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An American classic!  Every male needs to watch this at least once in their lives.",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious. Not a better duo in cinema history than Jack Lemmon and Walter Matthau",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hahahahaha - hehaha.  Love these two actors.",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny film that suffers from some low energy direction.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        }
    ]
}