{
    "rating": 8.4,
    "release_date": "2010-12-17",
    "num_reviews": 570,
    "genres": [
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "Nina (Natalie Portman) is a ballerina whose passion for the dance rules every facet of her life. When the company's artistic director decides to replace his prima ballerina for their opening production of \"Swan Lake,\" Nina is his first choice. She has competition in newcomer Lily (Mila Kunis) however. While Nina is perfect for the role of the White Swan, Lily personifies the Black Swan. As rivalry between the two dancers transforms into a twisted friendship, Nina's dark side begins to emerge.",
    "reviews": [
        {
            "content": "the loss of innocence? or the fight between who you are and who you want to be? whatever this movie is about it is a wild ride. Aronofsky doing what he does best bringing a psychological drama to your screens, it will have you questioning your own sanity. an amazing cast breathes life into this wild ride. if like movies that make you say what the !$?@ did i just watch then you should love this.",
            "review_date": "2023-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A chilling story of a timid protagonist who slowly descends into an intense madness... Definitely worth a look if you're into psychological horror.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this I went to know more about the film and what inspired the story as I do with every film and with this by the time I realized where I am, I was learning about the Renaissance, this film is perfection, a great projection of the \"Swan Lake\" and shows how destructive desire and desperation can be.",
            "review_date": "2023-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "She made it look like real. Stunning performance by Natalie.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent performances by Natalie Portman and Mila Kunis.  However, the plot is so dark and, at times, perverse that I couldn't watch the entire film.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman. That's all I need to say.",
            "review_date": "2023-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark fairytale set in modern times and the deteriorating mind of a ballet dancer. Portman is brilliant, so are the rest of the cast.",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors elevated the whole movie. The story was impeccable, however the execution lacks in some parts.",
            "review_date": "2023-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "anyone who says this movie is bad is fucking insane, this movie had me feeling like I was the one having a breakdown. Portman fucking nailed the role and put her whole puthay into it. 10/10 had me crying screaming throwing up",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies i've ever seen",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God i love this movie this is my comfort movie btw",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a really good movie, very well written unreliable narrator. I think having someone telling the story of swan lake in the beginning, and their specific ending, would've been very helpful to explain the plot.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "confusing ahh woman - Decent 7/10 / Strong 7/10",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best acting performance from Natalie Portman! With the best makeup and hairstyling ever done in a movie!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure Genius Director.  Almost perfect Actress.  High Art in the shape of Film.",
            "review_date": "2022-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All time performance from Natalie Portman. Themes are relatively basic but are presented in an interesting and entertaining way.",
            "review_date": "2022-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favourite movies",
            "review_date": "2022-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as a dancer this resonated immensely. the self-hatred, comparison, striving endlessly for perfection, and technique is too real. will always love this film..",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is one of those movies where you just sit in silence staring at the credits once it's over. It takes some time to digest the piece and its message but once you do it's truly a masterpiece. The cast completely nailed it and the transformation Natalie Portman underwent to play her role was breathtaking. We watched as Nina went from a bright girl with her future ahead of her to this monster obsessed with being perfect. We watch Nina lose her mind in her pursuit of an ideal. From the costume to the set design. The choreography was gorgeous and we could be right there with her in all of the crucial moments. It broke my heart honestly. It was also a good metaphor for what it is like in the dance, more specifically ballet, world. What these women and men have to go through to make their dances look effortless and graceful is truly disturbing. I do recommend this movie.",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were times during the film where it didn't quite hook me or keep my attention...at first. As it progressed, it became increasingly horrifying and uncomfortable to watch which oddly made it much better. I really liked its style and the director of this movie (Darren A.) has made some impressive movies in the past using remarkably terrifying yet convincing delusional episodes for its characters to go through (like in Requiem for a Dream). Natalie Portman acted very well and I'm really glad that I chose to keep watching it and not turn it off. While there may have been some things I missed, I got enough of it to notice what it was meant to be!",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good classic movie",
            "review_date": "2022-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow absolutely wow. great acting, great story",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the perspectives of theme, mood, and style, Black Swan is clearly a Darren Aronofsky film, filled with unsettling images and unforgettable performances.  Nina (Natalie Portman) is a talented ballerina competing for the lead role in Swan Lake.  However, when the enigmatic Lily (Mila Kunis) arrives on the ballet stage, Nina begins to feel threatened and begins her descent into a world of madness. Portman gives what is arguably her finest performance and Kunis and Barbara Hershey, as Nina's mother, are both excellent, but what makes Black Swan so effective are the directorial decisions made by Aronofsky – the use of handheld cameras gives the film a dizzying feel, some of the editing is ingenious, and the dance sequences are beautifully shot.  It is a film about passion and dedication to an art, but quickly evolves into a horrifying examination of mental illness and obsession, similar in many ways to Aronofsky's earlier films, as well as Roman Polanski's Repulsion.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan was a really interesting character study on how the process of losing yourself to your work. This movie had some fantastic imagery that kept the viewer guessing if it was an illusion or fact. Natalie Portman's portrayal was fantastic, really solid work here. The dynamic between her and her mother was so taboo and uncomfortable, but so raw that it felt completely believable. The movie gets in to so very intense scenes that left me feeling slightly uncomfortable, but that is what the movie was trying to achieve. I was suppose to be uncomfortable and it made those scenes all the better for it. There are some pacing issues with the movie, as it did hit a few lulls for me, but overall I found myself engaged. \n\nScore: 85%\nVerdict: Great",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky could've gone several different directions after the acclaim and success he garnered for his Oscar-nominated 'The Wrestler' a few years back. Maybe he could've done something more commercial, a comic-book movie perhaps. But he has continued to prove he is a filmmaker of unique vision and bold direction, and solidifies this with his latest film. It's a brilliant, poetic exercise in genre-bending--a ballet melodrama with a psychosexual horror edge. It's an operatic, thrilling, arty, and highly entertaining thriller, absorbing in its visual elegance, deliciously wicked in its wit, and frightening in its chilling madness-as-art parable. The film is gloriously crafted on a technical level. Matthew Libatique's camera dances around its performers (often in revealing close-ups) with artful compositions, capturing raw emotions and catching those telling details. The film is also edited and scored to perfection. Natalie Portman breaks out as the front runner for Best Actress in her performance here. Her thorough commitment to the role is written on her frail body--rail thin, sharp and bony, and depleted of comfort and sensuality. She also does her own dancing, often to jaw-dropping effect. She perfectly embodies her character's brittle, paranoid naivete, yet also is believable as the sexy seductress her character becomes, an arc Portman delivers with unsettling verve. It's such a wholly devoted performance that she deserves any award they want to give her. Mila Kunis, given her meatiest role yet, sinks her teeth into playing Portman's opposite--dark, confident, exotic, and sexually aggressive. Winona Ryder does a fine job as a self-destructive dancer aging out of her glory. Barbara Hershey is equally touching and creepy in her Mommy Dearest role. Vincent Cassel oozes fierce sexuality and charismatic lechery as the theatre director. It's a superb cast, without one false note in it. But Aronofsky deserves most of the credit for giving us one deliriously hell of a ride, and one of the very best films of the year",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tough movie to watch that gives some intense insight into a super competitive and stressful environment. The movie's dedication to telling the story through POV gave it a lot of tension as well as mystery, in a very claustrophobic way. It succeeds in drawing the viewer into the paranoid state of mind the main character is experiencing. Natalie Portman delivers a fantastic multilayered performance that really make you feel for her character – it's hard to watch a person be so miserable for such a long time. The movie ends on a high note and looking at it as a whole, it's very thematically cohesive and impressively executed.",
            "review_date": "2022-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8.2 - great performance from Portman. albeit maybe slightly overrated ",
            "review_date": "2022-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very excited to finally watch this film after hearing so many great things about it, and it exceeded my expectations. Simply an amazing film. Natalie Portman gives one of the best performances of all time and the direction is incredible from Darren Aronofsky. The camerawork is unique and compliments the dark and tragic tone very well. It is extremely melodramatic, with the music playing a large part in this. It is also very intense, and the psychological horror was unexpected but done very well. Everything was incredibly visceral, including the disturbing imagery. Overall just an incredibly well-directed, dark, intense, melodramatic thriller with an outstanding performance from Portman.",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing work by Darren Aronofsky! An incredible trip in which everything is gorgeous and in which everyone will find something of their own!",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman gives one of the most committed and professional performances of this century and Aronofsky is always on point with his camera movements (especially in the ballets scenes, which are a genuine spectacle to watch). It's a shame the story is not of the most original.",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Erm... What do they call it again? A 'cinematic masterpiece'?",
            "review_date": "2022-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible and unintentional parody of all that you can call aesthetics. Rhetorical and childish vision of art",
            "review_date": "2022-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute masterpiece with brilliant acting from Natalie Portman and the direction from Darren Aronovsky makes this film what it is.",
            "review_date": "2022-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing acting, amazing directing, amazing production. This movie is a well-done mind-fuck thriller.",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a thrilling, disturbing, and expertly filmed freudian nightmare. I was on the edge of my seat the whole time. Not only is Natalie Portman the perfect casting choice, but she absolutely slays her role.",
            "review_date": "2022-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb, perfect, one of the best films I've seen in my whole life, everything's perfect about it, it's definitely a slow burner, but that doesn't make it boring or less interesting  for the first half, it keeps building up until the magic happens, you need all of that to finally get to that last half hour when everything comes together and it just explodes. Loved the ballet sequences, needless to say Natalie Portman was perfect. (Liked her black swan more than her white one actually), loved how Clint Mansell used Tchaikovsky's Swan Lake music, loved the Rodartes, loved everything. Mila Kunis did an excellent job, as well as Vincent Cassel. Darren Aronofsky is one of my favorite directors and he certainly nailed it once again.",
            "review_date": "2022-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is an incredibly beautiful film, where the scenography is brilliantly composed. What is missing is a believable story, with character development that is not so incredibly predictable that I figured out the whole movie after 15 minutes and spent the rest of the time hoping I was wrong.",
            "review_date": "2022-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky's Black Swan catches our attention because Natalie Portman's Nina Sayers grows feathers after she kills Mila Kunis's Lily backstage to perform the Black Swan role in the final act. You cannot just forget the film because of that.\n\nThis psychological thriller—featuring Natalie Portman's Nina Sayers, a ballerina haunted by some schizophrenic ambition—brims with magic realism, an aesthetic style in which \"magical elements are blended into a realistic atmosphere in order to access a deeper understanding of reality.\" The effects particularly in the final ballet scene where Nina grows more feathers than the previous times it appeared would surely remind us of the film.\n\nBecause of the device used, we are made to believe that \"magical elements are explained like normal occurrences that are presented in a straightforward manner\" allowing the \"real\" (Nina Sayers dream to be the Swan Queen) and the \"fantastic\" (she really becomes a Swan) to be accepted in the same stream of thought.\n\nThe obsession to become the Swan Queen later brings into the character graphic hallucinations that eventually cost Nina Sayers' life.\n\nNatalie's facial features being transformed into a swan—rouged eyes, aquiline nose and elongated neck—all compliment to a dramatic flourish—where at the end of the performance, even we the audience could be convinced that she very well looks as the best Swan Queen for Tchaikovsky's Swan Lake.\n\nWhile Nina Sayers' obsession for the Swan Queen role is enough persuasion, the horrific undertones notwithstanding, we the audience get the eerie feeling in Aronofsky's close-up shots of the lead character who dances her way to death as the ambition-obsessed ballerina who lived and was haunted by realities she herself created.",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favorite movies of all time",
            "review_date": "2022-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slayed, opened my eyes, changed my life",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was disturbing and creepy. I loved it. Darren Aronofsky set out to create a dark, psychological retelling of the classic ballet Swan Lake and this highbrow horror was achieved to masterful effect. The tight close-ups and shaky camera really unsettled me as a viewer and kept me on my toes, pulled into Natalie Portman's cutthroat world of New York City ballet and always kept me on my toes (like a ballerina, perhaps) wondering what was real and what was going on in Portman's head as the pressure overwhelmed her. A charming mystery box from start to finish, with a strong supporting nemesis in Mila Kunis and beautiful direction from Aronofsky.\n\nFor the squeamish viewers out there (like, admittedly, myself), there was quite a bit more bodily horror than I was expecting—though I will say, there absolutely is a reason it had to be included. Black Swan is a film so preoccupied with perfection and performance of the body, so the narrative would have lost something without it.",
            "review_date": "2022-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is literally my joker",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performance from Portman",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting more than enjoyable. Never quite as unsettling as it wants to be.",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The word dominating my thoughts as I watched this film... mania. But of course, as I was transported through the final performance sequence, I knew that it wasn't just madness, it was, in a sense, a beautiful obsession. This movie truly is a piece of art, and has easily made it to my top ten list. Portman was captivating. I yearn for both her work ethic, and that of her character Nina.",
            "review_date": "2021-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The balance between the performance of Natalie Portman and the directing of Darren Aronofsky are enough to get an incredible film. Everything else is gain for our feelings and give us goosebumps during the 108 short minutes.\nMy perception of the film is the metamorphosis of grow up, how do you transform from childhood to adolescence or even to the maturity, displayed in a visceral and violent metaphor.\nEverything in this film is a topic of conversation, but for me, the most remarkable of the film is the immaculate cinematography, is one of the best that I had ever seen.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true American tragedy that will be valued for decades to come.  Show stopping performances by the entire ensemble elevate the masterfully crafted story to a level above all else.  An absolute must watch for all fans of good cinema; I have no criticism to offer for this film, it is an unquestionable 10/10.",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly overrated all around",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, passionate, and melodramatic, the direction was great and Natalie Portman was even better. Not entirely satisfying but infused with a great dark gleaming look.  Both disturbing and exhilarating, Portman captures the confusion of a repressed young woman thrown into a world of danger and temptation with frightening veracity.",
            "review_date": "2021-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It starts good, with you expecting something different than is about to be offered. You however enjoy the first majority, then in the second half you start thinking the movie is becoming monotonous. You continue watching till the end, and now you're wondering what happened, and how a movie you thought was monotonous ended on such a high note. You're asking yourself the deep questions and thinking about life and love. And of course, you're thinking how a movie about Swan Lake, was able to incorporate Swan Lake in the production of Swan Lake.",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "genius and perhaps NP's best performance!",
            "review_date": "2021-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tragic, unsettling and darkly funny in equal measure, it's often bizarre but always interesting.",
            "review_date": "2021-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not one to write a review much and sit and write paragraphs upon paragraphs. I do think the movie was amazing, there's so much in the movie and I loved it. I wish it was longer.",
            "review_date": "2021-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story line excellent acting ❤️❤️❤️",
            "review_date": "2021-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this nightmarish and beautiful Aronofsky thriller, art begins to imitate life as a ballerina strives to reach perfection in playing both the antagonist and protagonist of the famed ballet, \"Swan Lake\". This supreme desire slowly begins to take control of her. Under the trance of her dance instructor, she is forced to fully embrace her dark side in order to give a memorable performance… Aronofsky is a keen master at attending to every minute detail. His style of storytelling fits flawlessly with his psychologically thrilling themes. So much can be said just by an actor's body language in this film. That's something that only great directors can capture and bring out of their great actors; when it comes to great actors, Natalie Portman is an exemplification. Her hard work and dedication shines onscreen; the award for best actress couldn't have gone to anyone else… \"Black Swan\" is the perfect balance of low fantasy, romantic drama, and psychological horror. Viewers that enjoy aesthetically pleasant, intensely suspenseful, dark, and spine-chilling films that play on their instincts and expectations were made for this film. 92%!",
            "review_date": "2021-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absorbiingly engrossing in its story of obsession, this restless dance of the most sublime and terrifying beauty is always masterfully carried by Natalie Portman.",
            "review_date": "2021-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After reading so much good about this movie, I decided to give it a try but after watching it I can say that it bit overrated. Movie is just like other psychological horror cliches. How can a girl, so childish and unconfident gets such a big role? In real life, this never happens.\n\nThere were so many things in the movie which never happens. Play director has decided to give role to other girl but changes his mind just before the performance. Person who was not 1% confident about her was confident about her just few seconds before the performance. If I talk about the performances, Portman's performance was too childish and irritating to me. I was literally not able to connect with her.\n\nAlso, there were so many hallucination scenes mixed with real scenes that you have to think if this scene is real or fake, while watching the movie. The direction was weak. The movie didn't had any peak except the last performance scene which tried it's best to keep the movie up.\n\nOverall, I was disappointed with this movie. There was nothing in the movie which impressed me.",
            "review_date": "2021-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very strange film that I want to get into, but I just can't. 4.2, C-",
            "review_date": "2021-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An awesome movie about a ballerina falling into mental incompetance!!!!!",
            "review_date": "2021-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lasts too long for the plot it offers: a lot of boring and predictable scenes could have been removed. The real problem though is that the ending does not answer clearly all the questions that are given to the audience by all the previous scenes, resulting in the sensation of an incomplete script.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great psychological thriller. However, like all art, not everybody is going to enjoy or understand the movie.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All art films must retain authenticity and singularity in their quests to shock viewers in some way, and Black Swan completely achieves this. Portman's performance is key to a protagonist transformation so raw and extending beyond the pitfalls of monstrous devolution to deliver something genuinely horrifying and somehow fluid in a jagged, frantic manner. Mila Kunis delivers a superb supporting performance, but Cassel and Ryder fly under the radar for stealing a few scenes for themselves. I also enjoyed Hershey as Nina's mother as a domineering figure bearing the same vulnerabilities as the main character. Black Swan is visually and technically near-perfect and worthy of all of its accolades, drawing from Tchaikovsky's work to create something more modern and a layered packing of sounds, sights, and sensations to trigger a grand reaction to one woman's quest for perfection.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Elegance at surface but deep down ulgy dark skeleton hidden in the closet & society sickness. May not good pace but guess drama's fan or ladies may like it, bit long winding getting boring.",
            "review_date": "2021-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love his films usually, aside from Noah, and I FINALLY got around to watching this last night. I must say that I was very frustrated by the ending (and most of the film). \nSPOILER\nI hate that it was basically an \"all in her head\" sort of thing reveal ending. I just think that is such a gimmick. The movie looks really good and had some intense moments, but overall just a silly waste of time once the end is revealed.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creepy, Interesting and well rounded character study that will keep you watching until the last scene. No complaints here.",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot, special effects and set design were all great, it was hyped up way too much!\nI found the ending to be confusing although, I liked that it has a \"doppelgänger\" feel to it, and you can see that Nina gets so consumed by her desire to be perfect, being repressed her whole life, she starts to embrace her dark side.",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one of our favorites and it still stands up. It's dreamy and real, a style we like that helps you feel into the lives of the characters and what they are going through. We went on a movie weekend binge, this one is heavy, though powerful, and very original.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gross exploitation of Natalie Portman by the Director. I was so angry watching this particular director's fantasy of Natalie Portman I couldn't make it through the whole thing. The masturbation scenes? Ugh. No. Pointless. I could hear the ghosts of the ballet screaming at this one...\n\nI was humiliated for Natalie Portman. You shouldn't feel humiliated watching an actress \"work\", although maybe that was the director's intention. I can't even imagine (nor am I gonna find out) what he did to his Mother.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is the spine of this film. It's got a good script but the execution was done by the actor. The psychological aspect in scripts such as this one makes it worth the watch.",
            "review_date": "2021-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So dark and twisted, there isn't anything quite like this movie. Natalie Portman is astounding.",
            "review_date": "2021-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few flaws aside, a disturbing look at obsession gone too far.",
            "review_date": "2021-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting story well portrayed by Natalie Portman, in one of her best performances, and Aronofsky, who wonderfully direct the movie, using mirrors and shadows to confuse the audience. In addition, a great score and stunning cinematography,",
            "review_date": "2021-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Melodramatic, captivating, and multilayered. This movie covers the themes of growing up, family, or work and intertwines them in a psychosexual thriller. The acting here from Natalie Portman is great and as strong as her ballet. Both as an actor in this film and performer on stage, she has the ability to subtly transition her performance maturity. The layers throughout every aspect of this film really resonate. The end of the film was satisfying enough, albeit a little confusing. Though we are perceiving events from Nina's reality broken perspective. However, I wish there was a bit more clarity in the events in the final act. Overall, this film conveys many relatable themes through the art of ballet, and it does so with a bold, passionate, and intense lead performance that mostly satisfies.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way metaphors are portrayed in this film is flawless. It's beautiful and has some of the best acting I've ever seen.",
            "review_date": "2021-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was strange, at times perplexing, and the ending was stunningly shocking. However, Portman's stellar performance was perfection. A thunderous round of applause!",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the strangest movie I've ever seen, and it's not a bad thing! Black Swan has an amazing cast and plot but it's not a movie you'll want to re watch again and again. It is a very well done movie, but in the end you'll find yourself asking \"what just happened\". Is it a thriller? Horror? Drama? It's hard to know but you'll surely feel uncomfortable while watching this movie!\nA must watch for sure!\nA must watch for sure!",
            "review_date": "2021-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As painful as elegant to watch, but Natalie Portman truly stole the show by herself in a perfect, exquisite and forever remembered performance, directed by Darren Aronofsky in a bold masterpiece.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense and beautifully acted by Natalie Portman, Black Swan takes the best out Aronofsky's bold and signature direction.",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece, a tour de force of cinematic genius. Everything about Black Swan comes together to create something far greater than the sum of its parts.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God this movie was a mind fuck. I got bored and found the DVD and popped it into my laptop. Extremely good decision.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorites and probably the second best film of 2010. Natalie Portman is fantastic, Mila Kunis is great in a supporting role, and this movie blends great drama with some unsettling scenes. Just masterfully done.",
            "review_date": "2021-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, expertly crafted, and deceptively dark, Black Swan is another masterclass from Aronofsky in film making and the ability to descend into madness (as in Requiem For Aaron Dream). The entire cast buys in and Natalie Portman specifically gives a career level performance and shows that she has the chops to do any roll, her sadness, anger, paranoia, and jealousy are all acted superbly. Mila Kunis is fantastic as well Kunis and Portman have a nice chemistry that plays into the film very well. Love this movie and love the final 25 minutes or so the most phenomenal ending!",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With breathtaking visuals added up to a great and confusing you moments plus amazing performances by Natalie Portman equals a huge yes in my book. Black Swan might be slow at times but it ends up with a great twists, a shocking ending and you don't know but you do know what you just saw. While it nowhere beats Whiplash, it offers a great ride and a good amount of re-watch value.",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RATING: A-  Director: Darren Aronofsky \nBlack Swan is a great Mindbanding Thriller about a young Ballerina ( played by the Astonishing Natalie Portman, for which she deserves all the Awards she got ). The Handheld Camerastyle is really well fitting for this Movie and the Screenwriting was utterly brilliant.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cinematography and storytelling.  Portman, Kunis, and Cassel were perfect in their roles.  My only knock on this would be the middle part of the movie was a little long.",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dang this movie is so much more than I thought it would be. I would've never thought that ending would've happened. And normally I hate this Oscar movies but this is on another level. Natalie Portman is fantastic and she 100 percent deserves the Oscar. She was perfect. If you saw the movie you'd get that hint. But she was and she transcended this movie from an average movie to that killer 3rd act in a snap. Her characters transition from a normal white swan to being the queen that she deserves to be aka the black swan. This is a great Oscar movie. Now I know what you're thinking . Why only 4 stars? And my answer is because in the middle aka that whole section where mila kunis tries to mess with Natalie Portman so she could mess up was pretty boring. And that was a pretty long 15 to 20 minute section. It's filler but I get why. It creates more build up. But besides that the 1st act was good because she was trying so hard to be the queen swan but she was just only good enough to be the white swan but she proved us wrong in a predictable fashion cause duh this is a movie, she has to win. But what intrigues me the most is how she won. The terrors and fears of failing and she did get the part but at what expense. She became more troubled and was turning into the queen black swan. It's a phenomenal performance by Natalie Portman. Everybody else was meh . Anyway I highly recommend this movie, go watch it.",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dang this movie is so much more than I thought it would be. I would've never thought that ending would've happened. And normally I hate this Oscar movies but this is on another level. Natalie Portman is fantastic and she 100 percent deserves the Oscar. She was perfect. If you saw the movie you'd get that hint. But she was and she transcended this movie from an average movie to that killer 3rd act in a snap. Her characters transition from a normal white swan to being the queen that she deserves to be aka the black swan. This is a great Oscar movie. Now I know what you're thinking . Why only 4 stars? And my answer is because in the middle aka that whole section where mila kunis tries to mess with Natalie Portman so she could mess up was pretty boring. And that was a pretty long 15 to 20 minute section. It's filler but I get why. It creates more build up. But besides that the 1st act was good because she was trying so hard to be the queen swan but she was just only good enough to be the white swan but she proved us wrong in a predictable fashion cause duh this is a movie, she has to win. But what intrigues me the most is how she won. The terrors and fears of failing and she did get the part but at what expense. She became more troubled and was turning into the queen black swan. It's a phenomenal performance by Natalie Portman. Everybody else was meh . Anyway I highly recommend this movie, go watch it.",
            "review_date": "2020-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was captivating in every sense of the word. We are drawn into Nina's world from the very beginning. This film is a commentary on the perfectionist. At the beginning of the film, we can vaguely start to see the origin of her perfectionism as an artist. This is obvious through her mother who clearly not only wants her to be a perfect dancer and daughter but to stay a child. This is so her mother can own and control her. Nina uses dance to control something in her own life. If she gets the dance moves perfectly that is her control doing it. It is how often people with mental illnesses use coping mechanisms to feel a sense of control in their life. But then throughout the film, we slowly start to see her turn into the cause of her own perfectionism, which in turn crushes herself. This is when the insanity starts to creep in. Her own obsession is the cause of her death. This need for control causes her to lose herself. What I found to be so compelling about this film is that it is an artist's obsession with being the greatest in their art that drives this insanity. This is something that everyone could relate to. Whether it is work, art, sports, people can find a way to relate to wanting to be perfect. There is a balance within the film or reality and insanity that portrays Nina's journey so well. It makes the audience question: how far is a person willing to crush themselves for the sake of art or acclaim or personal acceptance?",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although some of its imagery might can be a little aggressive, I personally love almost everything about this movie because how beautiful and elegant yet unnerving it is. Natalie Portman masterful acting skills in this movie as innocent young woman with darkness growing inside her is one to remember in movie history. I think I like it more if the pacing is a bit slower because of how fast the act come and goes in this movie sometimes the viewer could not fully grasp the scene between one another, but with that little issue aside I still think this a wonderful movie and definitely something that gonna goes on my re-watch list.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, it has great ending and also there are Ballet concert of the movie which I loved it so much But the thing which I hated this movie is there was a porn scene. Can you cut the porn scene? it wasn't friendly to watch with my parents ! Stop adding porn scene, you as a director destroy the nation !",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is black, it has a very impressive script, it has slightly boring characters.",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nina (Natalie Portman) is a ballerina who wins the lead role of Tchaikovsky's \"Swan Lake\", Nina suffers from multiple different psychological disorders that lead her to madness and losing control of her life.\n\nBlack Swan is one of the most amazing psychological horror films I have ever seen, the film is so strong and accurate in many different things.\n\nNatalie Portman's performance as Nina was unbelievable, she was able to express the madness, the innocence, and the loss of control of Nina in a shocking way, her facial expressions and eyes were saying it all in some way, great choice and for sure deserves an Oscar and a Golden Globe win. \nThe supporting cast was great too and it was there to kind of \"complete\" Portman's great performance, Vincent Cassel as Thomas Leroy was perfect and Vincent always put a great/powerful performance, Mila Kunis surprised me as Lily, she was able to give us that Black Swan (Evil) version in a perfect way. Winona Ryder as Beth Macintyre or \"The Dying Swan\" was good but unfortunately, her role was not big at all, really wished if we could've seen her more. \n\nThe movie used the colors Black & White, as its theme in such a creative way and to present good & evil or darkness & innocence, what I mean by using black & white as the movie's theme is for example the set design, the set design was in plain black & white sometimes to represent the environment of the movie and what is going on, and the custom designs too sometimes. Loved also how the movie seems so dark as if we (the audience) are Nina.\nThe movie used \"reflection\" in many different deep ways like in mirrors and sometimes in others. \n\nThe movie's runtime was perfect, usually psychological horror movies are more than 2 hours but this one was less than 1h 50m witch was a perfect thing, it made the movie full of powerful scenes and not boring at all, for me the movie was great from beginning to end although it was building the story and the transformation of Nina in a very slow way, but with all of that it was still great and not boring.\n\nThe music and dance moves in the film were entertaining, the ballet dances were so entertaining to watch, and the way that the movie represented them were absolutely pure and beautiful, especially that last scene when Nina was performing in \"Swan Lake\" I was so entertained and the way the movie ended and everything was so cool. \n\nBlack Swan is a must watch and a movie that will entertain you from beginning to end, highly recommend this great physiological horror film.\n\nMy rating is: 9/10",
            "review_date": "2020-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a excellent dark psychologically thriller that will keep you in your seat. Natalie Portman performance was great, same with the other actors, most noticeably Mila Kunis, she did a great job. Black swan is a story about a white swan that represents good turns into a black swan that represents evil, which by the way was a solid story. Overall a excellent film.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a very engaging film that is beautifully shot. The cinematography was excellent as well. Portman plays her strained character very well and really embraces the role. I also thought Vincent Cassel was excellent as well. To be honest, I saw the ending coming and most of the symbolism and hallucinations made sense ok the first watch. It is a good psychological drama for sure, but it was a bit predictable",
            "review_date": "2020-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portman's performance is superb and deserving of the Oscar she won.\nShe won that Oscar in spite of so many things going against her, including, ironically, questions regarding her performance.\n\nPortman wasn't the on-screen actress for some of her performance. Her producers and director did not own those facts or admit to the lengths they went to in covering up a poorly executed ruse. It even went to the extent of giving the Film Editor an Oscar nomination.\n\nWatch Black Swan for Portman's performance on one hand and then for contrast between her performance and the lackluster performances among the rest of the cast. It's an interesting study for just those two things alone.",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly captivating! The conflict between light and dark drew the audience to places of contemplation never ventured. The subtle mania and psychosis, mixed with her sensuality and purity, made 'Nina' one of the best and most fascinating characters to ever be analysed. Her mentor, 'Thomas', is again, a dark, one sided version of Nina, but with more certainty and confidence of his character. He teases out the almost satanic features of her personality, which reflect the normalised actions of 'Lily'. The cast did not for one second, ever act out of place or seem to be actively pursuing their characters in a way that has been done and known to be distracting. Another brilliant project by Darren Aronofsky.",
            "review_date": "2020-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky is one of the most important directors in the industry over the last decade or so, and this movie is why.  It's Inception-esque in how Art is commenting on Art.  Is it a dream?  Is it a hallucination?  Is it an allegory?  Is it insanity?  Its messages are universal, and both Portman and Kunis make this an easy watch.  Aronofsky often \"cheats\" by having characters who are unstable, so his movies can excuse their confusion; here, I think it worked, because the dancer's obsession is justified by her ultimate victory (or, was it a crashing failure)?",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, provoking, and captivating. One of the best psychological thrillers I've ever seen. I couldn't look away. Every scene was so immersive and meaningful.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan Pros: Great Acting Solid Directing Exceptional Writing (for the most part) Fantastic Cinematography Amazing Editing Brilliant Pacing Outstanding Musical Score Good Sound Design Strong Production Values (Sets, Costumes, Makeup/Hairstyling, etc.) Superb Storytelling and explorations of its themes surrounding ambition Cons: Some of the dialogue is a bit corny at times Overall Grade: A (9.5/10)",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performance by Natalie Portman and Mila Kunis.. It is a profoundly fantastic movie.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman gives the best performance of her career by far in this film. Unfortunately, that's all it had going for it. I never understood the acclaim.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An addictive psychosexual horror/thriller like a more sinister and violently Lynchian \"Birdman (or the Unexpected Virtue of Ignorance) \". 10/10! One of my favorite films! 2010 was mesmerizing!",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible movie, It's a crime to spoil. The ending was shocking.",
            "review_date": "2020-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most ludicrous and silly movies I've ever seen, pretentious, fake, shallow and ridiculous. The youtube mash-ups comparing this to Showgirls are worth watching to expose the silliness of this empty movie.",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cliches in the movie are overshadowed by good craftsmanship and performance. Still holds up ten years later.  An exciting joy to watch.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good. I liked the cinematography and of course Portman's performance. Without that fantastic performance, this movie honestly would've been pretty uninteresting. Worth seeing for Portman alone. \nAlso the ending dance scene, as well as the transformation into the black swan, were highlights of this film.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so disturbing and beautiful at the same time. A true Masterpiece, one of the finest pieces of art cinema has to offer. And Portmans performance in this movie is brilliant.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "o one in their right mind leaves home to do their holiday shopping anymore—except to shop for a holiday movie. In our ongoing effort to help you save your money formore important things (food, for instance), we've made our annual guide the most user-friendly ever. Just match the headline to your cinematic taste and you're done! (Extra credit for reading the entire review, too.)\n\nDirector Darren Aronofsky's darkly enthralling entertainment makes the perfect antidote to too many sugary holiday Nutcrackers. Nina (Natalie Portman), an obsessive ballerina newly made prima for Swan Lake, is endless grace onstage. Offstage she is as tightly wound as the dancer on her childish music box: she retches in the ladies' room, tends her bloodied toes, indulges in fantasies both sexual and paranoid, and is altogether psycho in a delirious Hitchcockian way. With sublime balance, the film combines its high-art subject with the jolt of a sexually charged thriller.\n\nYes, there is lovely Tchaikovsky music, and tutus. Boyishly thin Portman reportedly trained hard (although you rarely see her feet as she dances). But Black Swan's up-to-the-minute brilliance comes from its blatant use of sex and its Sixth Sense-informed narrative. Vincent Cassel is a manipulative Balanchine-inspired artistic director who seduces then dumps his stars; Winona Ryder plays his latest has-been. He goads Nina into exploring her sexuality—not with him, with herself—so she can inhabit her dual role. She's ideal as the goody-goody White Swan, but unless she can channel her sensuous, sinister inner Black Swan, she may forfeit the part to her free-spirited rival, Lily (Mila Kunis). Assuming Nina's point of view, Aronofsky deftly leads us to wonder, is Lily really stalking her? And does anyone else see Nina's overbearing, failed-ballerina mom (Barbara Hershey)? Portman and Kunis's sex scene is already infamous (although it's tame enough for an R rating), but that doesn't answer the film's wily question: does it really happen, or is Nina's imagination playing seductress? Anything for art!\n\nFilm review by VEENIT",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Each moment of thrilling is genuinely immersive. A masterpiece about obsession. The direction, the imagery, the performances, the classical musical score, and the cinematography is just absolutely amazing. And let's try not to forget Natalie's performance, her performance is just brilliant.",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I truly have no clue what to think.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark and tragic film that reminds me of Whiplash but with ballet and mental illness themes. The plot was interesting, the acting was strong, it had a good soundtrack, and the cinematography was decent besides some weird portions of hand held shaky cam.",
            "review_date": "2020-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If u have to think about it, u question why modern culture insists that art must be synonymous with depravation. Why cant we have art for art's sake, and depravation for depravation's sake?\n\nIf not, then the message is much clearer, and frankly more important. Kids, don't do drugs. And if u have a rash, see a doctor.",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Editing style and Natalie Portman's great acting are noteworthy. It's not an amazingly fun movie, but it's a quite fresh movie.",
            "review_date": "2020-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is the price of perfection? Kill yourself to get it.",
            "review_date": "2020-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ballet thriller where you don't know which events are hallucinations and which are really happening.  Some scenes are hard to watch, but it's definitely worth seeing at least once.  All of the acting is great.",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don’t let your ballerina child watch.",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a Dostoyevsky devotee this film immediately brought his work The Double, which explores the theme of psychological madness and the doppelganger as an exact opposite, to the forefront of my mind. Aronofsky does a laudable job of further exploring how sharp the edge is between the extreme dedication needed to achieve the pinnacle in a competitive craft or field, and how too much of that required obsession can cause some of our minds to begin malfunctioning in some pretty horrific ways.",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Character-driven exploration of obsession, ambition, and jealousy that sees Portman in a career-defining performance. (4/5)",
            "review_date": "2020-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timid, devoted ballerina experiences both sides of the hunt, having finally usurped the long-standing lead for her company's next major performance and then immediately spotted a crosshair upon her own back. Along the road to opening night, prodded by competition from a new dancer and a taxing, handsy show director, she reluctantly confronts the various psychoses and anxieties that have been brewing, unimpeded, in her psyche for years. Will she finally learn to cut loose and embrace her id, or fall apart en route?\n\nNatalie Portman is a nervous wreck in that leading role, finding comfort in the rigorous pursuit of perfection on-stage, but tumult and uncertainty everywhere else in her life. She's perfectly cast, petite and toned in a physical sense but versatile enough to dig deep and project the agonizing struggles that writhe within. Director Darren Aronofsky, no stranger to plumbing such depths, brings his usual grim, unflinching perspective to the scene. It's a good thematic marriage. Aronofsky's work is almost always oppressive and exhausting, which is why it took me ten years to get around to watching this one. In a very real way, I dread his films and what they'll put me through.\n\nPortman's performance (not to mention that of Mila Kunis, in an indispensable supporting role) and the gorgeous dance choreography saves it from being a total plod, but Black Swan is anything but a pleasant experience. Profound at times, pervasively uncomfortable at others, it digs until it hits the bone and then it digs some more.",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "possibly the best movie ever.",
            "review_date": "2020-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky's baroque manages to reach its peak in this incredible work. The metaphor for Dostoevsky who or script brings home perfectly with the director's care in leaving a clear antithesis between heaven and hell that involves a work. The excellent work of the cast gives the soundtrack, and a soundtrack, combined with photography and costumes that make the film incredible, a profound and disturbing masterpiece.",
            "review_date": "2020-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We are our own worst enemy. ",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a good thriller, but it's formula it's already dated.",
            "review_date": "2020-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a frequent watcher of horror films, and have found very few that truly strike me. This movie is one of them. Though I do grant that some of it was predictable, it is so visually stunning and well-acted (Portman is stunning) that it sets itself apart. The story is an inventive and dark twist on a classic tale of love and beauty, which drags captive audiences along as it descends into madness. Perhaps the most impressive part of all is the terrific score, which incorporates themes from the original ballet while adding a great deal ferocity, darkness, and intensity. If you watch this film in the universe it takes place in - one in which the line between reality and illusion is always blurred - you will have a wonderful and memorable watching experience.",
            "review_date": "2020-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very poetic. Has a \"life imitates art\" feel to it.",
            "review_date": "2019-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film delivers outstanding performances, outrageous twists and a slow decent into insanity.\nDarren Aronofsky's made a moving experience that will stick with you in a near perfect horror by delivering a prestige story effectively for all audiences. It's a serious feat. At no point in this movie do you know what's going to come next and it's no wonder it received several Oscar nominations.\nThis is an excellent film. It's no surprise that the outstandingly horrifying performance by Natalie Portman sent her home with an Oscar.",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark and haunting psychological drama/thriller that is one of Darren Aronofsky's best and has possibly a career-best performance by Natalie Portman, great direction by Aronofsky, and compelling themes on how far an artist will take themselves physically and psychologically to perfect their talent.",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is widely dramatic and chilling with many thrilling moments as well as a compelling performance from Natalie Portman as a ballet dancer falling into the dissent of madness.",
            "review_date": "2019-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mind Trip & Brilliant. Natalie Portman is an ICON in the making.",
            "review_date": "2019-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did like it, however, it was a difficult movie to follow and understand. I didn't know when she was hallucinating or when she wasn't.",
            "review_date": "2019-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the kind of movie that you can watch numerous times and notice something that you didn't before. It plays with your mind the further it progresses, essentially throwing you into Nina's shoes and making you questions what is real and what is not, exactly the way she does. This is arguably Natalie Portman's best performance in any film considering the work she put into the role, and it's no surprise she won an Oscar for it, which is especially impressive considering the infrequency of horror movies award nominations. It's likely the most artistic horror film out there as well, incorporating the beauty of Tchaikovsky's Swan Lake into something more sinister and nightmarish. Black Swan is an unforgettable film, and no doubt one of the best of the decade.",
            "review_date": "2019-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That beginning scene with the black creature could be a metaphor as her first encounter with evil and how easy it could be for evil to manipulate. Beautifully done. The audio is fantastic. It's kind of like The Shinning in the sense where it fucks with your head. I can tell already this is going to be a really good psychologically fucked up movie.\n\nColor plays an essential role in this movie almost like another character. Portman's character wears pink which is a light color signifying that she still is a nice person, she still has her good side intact within her.\n\nThe imagery and symbolism is great. There's great use of mirrors and seeing double. I think Nina might be a bit mentally unstable, maybe schizophrenic. She keeps hearing voices. Nina's mom looks like she could suck your soul from right out of your body. I think it's her features but also there's this dark uneasy undertone with her.\n\nThe play director is almost playing the part of the devil or a demon that's trying to get the bad and evil side of Nina to come out. Nina's mother seems over protective and seems like she's protecting her daughter's virginity almost like she doesn't want her to grow up and become an adult. Holy shit the last 30 minutes we're so good and I knew it was going to be like that.\n\nThis movie, more than anything, is about  becoming an adult, losing one's innocence, discovering yourself, and the desire for perfection. Aronofsky's twist on it all makes for a disturbing yet very interesting and entertaining watch. Amazing movie!",
            "review_date": "2019-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren is probably my top 5 directors right now; everything he touches, he turns to rubies and anthrax.  A f*****g masterpiece of a film",
            "review_date": "2019-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, descents into madness are almost always shown from the male perspective, seeing the female perspective was fresh.",
            "review_date": "2019-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A chilling performance by Natalie Portman",
            "review_date": "2019-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's unsettling. It's wild. It's everything Aronofsky does well, done to perfection ",
            "review_date": "2019-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dark, intense, erotic, fraught.",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark and dramatic with a spring in its step!",
            "review_date": "2019-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Aronofsky masterpiece!\nBeautiful direction and characters, movie making at it's best!!!\nNatalie Portman is a goddess!!!",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A project tailor-made for the likes of Darren Aronofsky, \"Black Swan\" dives deep into the depths of obsession, psychological dilapidation, and moral intrigue by tracking one woman's descent into madness, darkness, and Tchaikovskian ballet. Speaking frankly and honestly, I was only decently taken by the film for the first two-thirds or so. It's dark and compelling, but -- much like the qualms levied towards Natalie Portman's Nina Sayers throughout those portions of the film -- I felt as though something was missing. Some sort of shot of adrenaline to get things really moving forward. And by the time the third act rolls around, boy, do things get intense. Maybe that's the meta-structural brilliance of this film. Perhaps we, the audience, are all operating on a plane similar to that of Vincent Cassell's Thomas Leroy, constantly doubting the darkness and vigor within, only to be blown away by the utter potential we see fulfilled in the end. Or maybe it was just me who found the first two-thirds to be nowhere near as enthralling as the last few minutes. Either way, the overall product is great, featuring that committed, Oscar-winning performance from Natalie Portman and -- once again -- a truly fantastic finale.",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, I know this is so acclaimed...but, if it weren't for Mila Kunis I'd give it a lower rating. Natalie Portman just consistently ruins movies for me - her lack of chemistry with anyone (in my opinion, of course) is what does it, I believe. This is no exception.",
            "review_date": "2019-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the art of the true cinema! I've loved this movie since I first saw it",
            "review_date": "2019-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually found this movie very repetitive, which did somewhat bore me, since the whole point is to see this ballerina fall into madness again, and again and again. That aside, however, this psychological horror kept me glued to the screen, gasping at shocking moments, and most importantly, asked me to think about it again and again long after I finished. The highlight of all this was of course Natalie Portman, who gives the performance of the year, or if not, the decade, in a troublingly flawless performance. Aronofsky also elevates his film by using rich texture and symbolism throughout, perfectly complemented by Matthew Libatique's shaky cinematography which feels unstable yet calculated. Credits as well to Kunis, Cassel and Hershey for their great supporting performances. My big problem with this film though was the interpretation that the film is an allegory of transitioning from innocence into someone wild and sexualized. There are some things you cannot explain, and I just didn't buy it, though that's the only explanation that can link everything in the film. As a psychological horror though, this film breathtakingly reconsiders Swan Lake and capture the dynamics of perfection not only in art but beyond that: perfection as viewed by society, the view of perfection by our peers, and most importantly, the perfection we see in ourselves.",
            "review_date": "2019-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, definitely in my top movies list! Natalie Portman is awesome is this movie.",
            "review_date": "2019-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horror has never really been my genre but Black Swan kept me engaged because more than being a horror it's a film about the struggle of being an artist. I've been interested in Darren Aronofsky as a director since seeing Pi (1998) with my parents and this being one of his most popular films I expected something great. I really enjoyed elements of it and the performances of Barbara Hershey and Vincent Cassel were perfect but I felt it got too caught up in the Mila Kunis subplot and it ran a little too long for my liking. This is probably one of the better horror films I've seen but I wouldn't place it on the level of Carrie (1976) or The Shining (1980) because Natalie Portman's performance isn't as good as Sissy Spacek's and comparing it to something as intricately constructed as The Shining is just unfair.\n\nNina Sayers, Natalie Portman, is a technically gifted young ballerina who is extremely conscientious about her craft, a fact that lets her down when she asked to portrayed the sensual and free-moving black swan in a production of Swan Lake. She is given the lead role despite her difficulty with one half of it and she faces off against a lascivious ballet instructor, Vincent Cassel, the concerns of her mother, Barbara Hershey, a rival ballerina with a greater handle on the black swan role in Lily, Mila Kunis, and herself as her hysteria leads her to have visions of transforming into a black swan. She pushes herself to the limit as she strives to perfect her performance in the role and become what those around her want her to be causing a disturbing chain of events and a surreal climax.\n\nScenes of a woman tearing a strip of perfectly healthy flesh off of her body and then watching in awe as shockingly red blood cascades out from the wound is always going to be uncomfortable but it is the mental not physical horror that Sayers and the audience face that is more terrifying. Jealousy is an emotion that is universally relatable and seeing Lily through the eyes of Sayers we understand her envy, how could someone who seemingly tries so little be so effortlessly talented? When she listens to her mother berate her for scratching herself in stressful moments that anxiety is felt by all audience members, the disappointment and rage of your mother is a scary thing to contend with. All of these human obstacles are well conveyed and all of them put together ratchet up the stress level so that we understand why Sayers act out. Combining that with grotesquely beautiful body horror makes for a stressful experience. \n\nBarbara Hershey, one of the greatest living actresses, is almost too good as the mother living vicariously through her daughter who is caring and attentive but also infantilizes her daughter in a dangerous way. The scenes between herself and Portman are some of the best in the film as Hershey draws the best out of her fellow actress as she always does. Her laser focus on every word her daughter utters and the way that all of her words are spoken with a touch of annoyance as though she is directing her criticisms both at her daughter and herself add to the sinister aura that surrounds the character. Cassel is fantastic as a very creepy ballet instructor who has a habit of starting inappropriate relationships with his charges as his shifts from cold and professional to manipulative seduction are smooth. Barbara Hershey would have been a deserving Best Supporting Actress winner and her lack of nomination is shocking and disappointing but the Academy has a habit of not properly recognizing her.\n\nThe moments where the film loses me are when Sayers and Lily go out for a night of debauchery with a young Sebastian Stan and eventually one another. Aronofsky lingers on the lesbian â~lovemaking' a little too long for my liking and it feels like an expensive pornographic film for a while instead of a thinking man's horror movie. We also see Portman, clad only in pink underwear, writhing around with her hand down her knickers attempting to let loose, an idea that we only needed a few seconds of screen time to convey but instead we get a full minute of this. For a film that is largely critical of the male gaze with Vincent Cassel's character being seen as a negative force these scenes feel as though they're being shot by Paul Verhoeven.\n\nThis is a very good film that could do with a few unnecessarily long scenes being cut down but Hershey's wonderfulness and the close-to-home depiction of everyday stresses put the film well above the rest.",
            "review_date": "2019-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is exquisite, with great meaning.  Natalie Portman is spectacular, she does a great job!",
            "review_date": "2019-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan (2010)\n\nWhile Black Swan was highly stylized, it was also quite predictable. Most of the film's surreal \"scary\" and \"sexy\" action is happening in naive Nina's head as the result of burgeoning mental illness -- to which her mother was also prone.\n\nBlack Swan is a bizarre ride you take via a vulnerable, woman-child who is used by her dance director to continue HIS fame and glory; he pushes Nina over the edge in the hope of tapping into her primal desires, fears, and urges...the dark \"black swan\" side of things. \n\nSomehow, it's still not very compelling; seems oddly pretentious and self-aware. One view was enough.\n\nThe Wrestler, by the same director, was superior in comparison, imo.\n\n-April 2019",
            "review_date": "2019-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really amazing great Performances From Portman & Kuniz...Kept me on the Edge of my seat the Entire Movie!!!!!...",
            "review_date": "2019-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/5.  A beautiful, yet insane film with fantastic performances.",
            "review_date": "2019-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nina Sayers is a tragic heroine through and through. And by that I mean that besides that she possess a flaw that leads to her downfall, which she must accept with honour, we, the audience, shouldn't expect to be surprised by the ending; it's often kinda predictable. With that being said, we must know that Aronofsky's task is that of filling the movie with a sense of dread and macabre atmosphere in order to forebode the tragic ending, while pushing the envelope as much as he can in order to make everything seem original, and hence unexpected.\n\nThe first thing is actually what Darren Aronofsky excels at. And in Black Swan, Aronofsky created a nightmarish surrealistic ambiance; using some of the most effective, if not the most violent, graphic gory images he ever used in his movies, and utilizing the sound almost as perfect as he did in Requiem for a Dream, only this time not just to disturb, but also to scare and daunt. In doing so, Aronofsky went far beyond foreshadowing Nina's dreadful inevitable downfall, making us feel Nina's pain as if we became her; Aronofsky made my feathery skin crawls!\n\nAlas, Black Swan's visual imagery sadly lacks creativity. Most of the symbolic imagery I felt that they are quite familiar, and that I had seen many times before. That said, the visceral and bold direction of Aronofsky made up for that with genuine intensity.\n\nThe vague and mysterious nature of the characters and their actions adds up to the uniqueness of the movie, especially as they don't tarnish the drama, nor reject the logic for the sake of surrealism. I enjoyed interpreting the characters' motives, actions, and even purposes and roles in the story. The way they are represented can feel a bit messy sometimes, though. I think that what made me believe that the movie is a bit convoluted for its own good, and that Aronofsky tried too hard to give us as many reasons as he could to persuade us that Nina deserves her tragic fate while Nina's \"hamartia\" is crystal clear from hundred miles away in a most play-like way.\n\nThe performances are all truly outstanding. As for Natalie Portman, she delivered what is indisputably her fantastic career's best performance; she was simply Perfect!\n\n(8.5/10)",
            "review_date": "2019-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances from the cast. Amazing suspence and atmosphere.",
            "review_date": "2019-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky Is probably the most artistic and smartest director in the business right now and he doesnâ(TM)t know how to do ordinary . This movie in some way to me is a superhero movie about an anti hero and it is so well told ... it goes for the raw and shows you what you might want to see  but doesnâ(TM)t show you what you need to see . Itâ(TM)s a brilliant movie .",
            "review_date": "2019-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is incredible from Darren’s direction and an Oscar-winning performance from the lovable Natalie Portman",
            "review_date": "2019-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressive cinematography and use of music.",
            "review_date": "2018-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did I wait this long to see this? Epic depressive look at obsession",
            "review_date": "2018-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe people got sucked into this silliness. Fortman wasn't convincing and it seemed like it was written by 12-year-olds .",
            "review_date": "2018-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely bloody dull and boring. ",
            "review_date": "2018-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So beautiful yet intriguing. Make me wanna look away but keep my eyes on the screen at the same time. This is a really great psychological horror as we can felt its spookiness creeping under our skins",
            "review_date": "2018-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting but painful to watch.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was great!",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman gives this performance her all much like the main character in this horrifying psychological thriller.",
            "review_date": "2018-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring a phenomenal performance by Natalie Portman, Black Swan is an incredibly intense and disturbing drama enshrouded in dark imagery while also conveying the destructive insanity that is perfectionism.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure if Natalie Portman was made for the role or if the role was made for her, but stunning performance.",
            "review_date": "2018-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A haunting and mesmerizing thriller.",
            "review_date": "2018-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portrays mental health in the scariest way possible. Such a strong character development for Natalie Portman.",
            "review_date": "2018-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky is probably one of the best directors working today. He has made masterpieces, good movies, and not so good movies. But I think Black Swan is his best film, right next to Requiem For A Dream. Let's talk about Black Swan today, and I'll try not to spoil much. Black swan stars Natalie Portman, and she won an oscar for playing the character Nina Sayers in this movie. She completely deserved it because she did things in this movie that just made me say \"woah\". That's all I'm going to say about the absurd things she did in this movies, and she was amazing, probably her best performance. The conflict that Natalie Portman's character deals with is starring in a ballet performance and she becomes obsessed with this role. I won't tell you what happens to her in this movie to be spoiler free, but some stuff goes down. This movie even scared me at times. Her ballet director is kind of a creep but he completely cares about the performance and Natalie Portman's health and well being. She also has competition for this leading part and some stuff happens with that as well. Mila Kunis was also in this movie, and she actually acted really well. I don't really take her seriously as an actor, but she was really good in this movie. The ending is yet thrilling and terrifying, and the last shot in the movies says so much with so little. The script has a very good narrative and structure, and I don't think this movie gets enough praise for that. This movie definitely deserves my perfect score. 5/5",
            "review_date": "2018-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When obsession absorbs everything pure inside you, then your worst enemy stands in front of your mirror! An excellent approach to personality distortion and self-destruction\nresulting from uncontrollable passion.",
            "review_date": "2018-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is too weird for me. Once i watched is because a thought it ll be a good movie. I will never watch it again...",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman transcends the ballet and the film.\n\nDarren Aronofsky's magnus opus. Aronofsky has refined all of his film making knowledge and skill into this thrilling mind bender of a psychological drama. The ballet is hard, but the mindset of the dancer is the real stress inducer. Aronofsky is flexing his directorial prowess here in a magnificent display of psychological horror, drama, romance, and even the thriller genre. He uses long pans following Natalie Portman's character, close-ups, and sweeping shots to dazzle and thrill the spectator.\n\nIt is a harrowing tale of perseverance that leads perhaps all the way to insanity. Aronofsky is perhaps asking us how far will we go to achieve perfection? In art? In performance? In happiness? In love? Black Swan is a brilliant metaphor for the pursuit of artistry in a bleak and intense world. The final reveal completely shocked me. I was not expecting it at all. This movie captures so many feelings and ideas, while keeping a tight structure that propels the plot and themes. I am impressed. I think that Darren Aronofsky finally made a real masterpiece of film. Black Swan is a must see movie!\n\nClint Mansell composed the film's score as he did with Aronofsky's infamous Requiem for a Dream. He too has matured from the wild intensity of his previous sounds to the deeply moving romance and the truly epic swells with dramatic emphasis. There is a passion in the score that breaks through the sadness and the obsession to ignite a fiery finale in a wondrous sonic peak. Mansell's notes are mesmerizing in their dreamy grace.\n\nIn part, the genius of Black Swan is the captivating performances. Vincent Cassel is intense, sleazy, loving, passionate, hardcore, and desirable filled with lust all in one character. Mila Kunis is particularly enchanting as a ambitious, lustful, playful, sweet, wild, fun, powerful, and seducing foil. Barbara Hershey is striking and fearsome as Portman's overbearing and overprotective mother. The cast is excellently well chosen and deliver some of the best performances of their respective careers.\n\nAbove all, the main actress, Natalie Portman (who deservedly won the Oscar for Best Actress for Black Swan), is even more complex and engaging. She starts out a meek, yet sweet girl with big dreams of being the star ballerina. She must mature into both the good The White Swan who is graceful, elegant, sweet, and good, but also The Black Swan filled with intense passion, elegance, seduction, despair, and love. Portman plays the character of Nina beautifully, passionately, and with a mad dedication to her craft. Much like her character. She is impossible to stop looking at in Black Swan. By the finale, I was staring at her with my jaw open and tears in my eyes. Such a reaction is a rarity when I watch films. Black Swan is darkly radiant.\n\nI hope you love Black Swan as I did in all its resplendent striking aesthetic. The gorgeous make up and fantastical costumes are not the only visual delights that Black Swan have to offer. It's a dark fantasy with twisted beauty (thanks for that one, Kanye). I guarantee you have never seen any other film like Black Swan.",
            "review_date": "2018-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece , epic directing , music and cinematography, outstanding performance from NatalieP.",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best works ever made by Darren Aronofsky. Sure, the film also gained a lot of great appreciation when it first premiered. For me, this movie is not too heavy to be understood as other Aronofsky movies I've watched such as Requiem For A Dream and Pi. Not to depth but has a lot of effort so there is much to discuss. Black Swan is one of the self-destructive and obsessive films. Taking the premise of Satoshi Kon's Perfect Blue, Black Swan is one of the greatest psychological thriller movies I've ever seen. Natalie Portman is such a good actress in here, Clint Mansell with the perfect score, and has a pretty stunning choreography even though I don't fully understand ballet.",
            "review_date": "2018-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt it. Perfect. It was perfect.",
            "review_date": "2018-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing! It was so beautifully written! Natalie Portman is one of my favorite actress' She did everything in her power of will along with aronofsky giving so much work it was amazing ! I even bought it ! Wow !",
            "review_date": "2018-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6.3/10 — \"Okay\"/\"Decent\"/\"Watchable\"\n\n-(Seen on 2/13/21)",
            "review_date": "2018-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have ever seen!",
            "review_date": "2018-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan: This Bracingly powerful, thought provoking thriller is another Aronofsky’s masterpiece. Brillant prefroamances, melodramatic acting, intense imagrey and Aronofsky’s signature touch makes Black Swan one of the directors best.",
            "review_date": "2018-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is striking creative and watchable. It shows the horror and consumption of when you strive for something achievable.",
            "review_date": "2018-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie conveys a lot of messages through it's story, audio and visuals. It's one of the most complex films Aranofsky has made. Through this whole movie you can't seem to have time to breath. The whole fiasco just takes you like a strom.",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeous and unsettling portrait of an artist's decent into madness--blossoming out of their own selves.",
            "review_date": "2018-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to hand it to Darren Aronofsky, because he put a lot of thought into Black Swan. There are many sequences that are cut perfectly to increase the drama and tension. He also knows how to manipulate the minds of the audience, and to control some of their emotional responses. Not to mention he was able to make Natalie Portman seem like she could act by putting her in a role where she gets to use her natural clueless/confused expression almost the entire time. I’m not the biggest fan of movies that are so surreal that even the audience can’t clearly determine what is happening. I appreciate the attempt to put us into the mind of the main character, and making us experience the psychosis with her, but it is so aggressive that half the time you can’t trust anything you’re watching. One thing that I appreciated was, although they spelled out the entire story of the ballet for us, the movie wasn’t a direct one-to-one retelling of that same story. I thought for sure that setup was such an obvious ploy and it would be lazy foreshadowing, but they went a different way (only holding onto some of the bones of the story.) I think Black Swan is an artful film, and so I can see why it appeals to so many people. It’s not my kind of story, particularly since everyone starts or becomes evil and unsympathetic. While I can respect the movie a lot and recognize how well it was made, it’s not one that I expect to revisit.",
            "review_date": "2018-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan definitely succeeds as a psychological thriller, but also as a horror film. I can't help but think that the horror part was unintentional though.",
            "review_date": "2018-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie depicts a young aspiring ballerina who simply wants to be the best. She becomes insane in pursuit of her passion due to the expectations she puts on herself. Black Swan is a beautiful tale of the possibility of overworking and not losing yourself. Bravo Darren Aronofsky!",
            "review_date": "2018-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even when I thought Natalie Portman didn't get credit for V for vendetta, I was shown so much more by Aronofsky and wanting to see much more, this film really caught me by surprise.",
            "review_date": "2018-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "for me this movie is soooooooooooooooooo good and Natalie Portman  did her career performance and off curse as usually   Darren Aronofsky did it again",
            "review_date": "2018-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a fan of aronofsky direction style, but that was one of the best movies that I ever saw in my life.\nI really did not expected that last plot twist, the movi4e is well ambiented in the sick head of a schizophrenic, the last plot twist simply blow me away",
            "review_date": "2018-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic Film. Black Swan, in many regards, is an absolute masterpiece. Great films are ones that leave a lasting effect on the viewer long after the credits roll. Black Swan does this though its engaging screenplay, superb cinematography, underlying subtexts, and most importantly, fabulous acting from the whole cast, especially Natalie Portman's portrayal of Nina. After watching this, consider me a fan of Darren Aronofsky!",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually mesmerizing - but ultimately a shallow film about shallow characters by a shallow man. The characters are all flat. Portman's descent into madness reads disingenuous and her character's eating disorder, perhaps there because rape is too cliché. For a similar, and better work - try out Perfect Blue (1996) of which Aronofsky has the English rights to.",
            "review_date": "2018-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great but can't warrant a recommendation due to immorality in the film. It was extreme abit.",
            "review_date": "2017-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the White Swan in me will say of 'Black Swan' that's it is an interesting character study which serves as a suitcase for Portman, the Black Swan, on the other hand, will say that it is an ugly, exhausting and pretentious psychological thriller by Darren Aronofski which will make you want to stick to Scorsese's 'Taxi Driver'. Sadly, the Black Swan dominates.",
            "review_date": "2017-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is powered by Natalie Portman's mesmerizing performance, showing how far you have to go in order to become a perfect dancer.",
            "review_date": "2017-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought I knew what was going on but I'm not really sure. ",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "complete madness at times, literally. Gives you a few things to think about after, but that is what Darren aronofsky does best. Very well directed and a really good watch.",
            "review_date": "2017-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is my favorite Darren Aronofsky film and one of my favorite psychological thrillers of all time. Natalie Portman gives the best performance of her career as Nina Sayers, a virginal ballerina who descends into the rabbit hole as she tries to perfect her skills and become the Black Swan. Aronofsky, one of the most ingenious and ambitious filmmakers in the business, has crafted a twisted dark fantasy that pushes your boundaries. As Nina starts to loser her mind, the nightmarish imagery becomes even crazier and more insane. It had me on the edge from start to finish and I was riveted throughout. You won't be able to shake it off.",
            "review_date": "2017-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Engaging as a insanity laden character piece with a terrific score, Black Swan leaves too many questions unanswered. Style demands substance.",
            "review_date": "2017-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating film with great performances especially from Natalie Portman who definitely gives it her all and because of it you have a very good haunting film.",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky's Oscar winning supposed psychological horror that's central around a ballet dancer who is awarded the lead role in a production of Tchaikovsky's Swan Lake. It's not strictly suited to the horror genre and you could easily watch the entire film thinking otherwise. It's certainly thrilling, but as a whole, it's a dark, subjective drama of Nina's (Portman) metamorphosis from a naive, innocence girl into dangerous womanhood. \n\nAronofsky was originally inspired by Dostoyevsky's poem, The Double and wanted to delve into a duality of personality. With this in mind then followed by seeing Tchaikovsky's Swan Lake, Aronofsky spawned the story of Black Swan, having parallels to both the story and the dual role casting of Swan Lake, about a young and inexperienced girl thrown into a world of elite competitiveness, jealousy and the strive for perfection. \n\nThe narrative focuses entirely on Nina, who is chosen to play the dual lead by the manipulative, demanding and highly respected production director Thomas Leroy (Cassel). She's possibly chosen for her fragility, innocence and naivety, fitting the role of the Swan Queen, but it's her inability to play the darker psyche of the Black Swan that set her on a troublesome journey of self-exploration and sexual discovery. We witness her transition which sees her frustrations turn into fearful anger which in turn, increases her spiral into tangled paranoia and desperate madness. There's a constant battle between ambition, meticulous dedication and control versus obsession and creative fluidity in her pursuit of perfection. \n\nPortman is outstanding! Intoxicating, elegant yet stressed and is possibly her most challenging performance to date. She funded her own tough, ballet training for a year prior to the film even getting financed and lost 20lbs in the process. It won her, her first Oscar for Best Performance by an Actress in a Leading Role, and rightly deserves. \n\nCassel is brilliant as the manipulative, disapproving sexual predator who's dismissive, demanding demeanour is soul destroying, abusing his position of authority to get what he wants from his stars. Though because of the narrative, his full persona is only suggested leaving the audience to rightly assume what he's capable of. \n\nKunis is great as the alluring wild child, both alpha-female and subject of Nina's of paranoia. Is she really trying to befriend Nina or sabotage her opportunities so to make way for her own. It's hard to be sure as the story progresses, having difficulty trying to decided what is reality or imagination. Hershey was prefect as the overprotective, pampering mother who also becomes a victim of Nina's paranoia with again, the strong narrative only suggesting what could or might be real. \n\nAronofsky's style is astonishing, if not nauseating in parts. The sequences and shots are not what you might expect from a ballet performance that again only emphasises the narrative with what feels like hand held camera shots creates a fly-on-wall perspective sometimes causing that nauseous feeling that encapsulates Nina emotions. There's the added challenge of filming with so many mirrors present which must have been incredibly difficult and restrictive but also made way for some very creative shots. \n\nThe production of the film is of such a grand scale, or it certainly feels that way and it's hard to believe the film was completed on such a tight budget of a reported $13million as oppose to the hopefully $30million. The costumes, makeup and sets being much more than just that, they were very much apart of her evolution of character, especially the colour in her wardrobe throughout the film. And Clint Mansell's warped and reversed variation of Tchaikovsky's Swan Lake really increases the eeriness and tone of the story. \n\nOverall, the film is a grand thriller that's a little more than just stage frightening and many might assume it's going to be boring or not going to be to their liking. But it's a dark, beautiful and captivating, superbly shot and put together with an outstanding performance from Portman. \n\nRunning Time: 8\nThe Cast: 9\nPerformance: 10\nDirection: 9\nStory: 8\nScript: 8\nCreativity: 10\nSoundtrack: 8\nJob Description: 9\nThe Extra Bonus Points: 10 for an outstanding production, performance and original. \n\n89% 9/10\n\nwww.spoileralertreviews.co.uk",
            "review_date": "2017-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark and terrifyingly thrilling.",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a visionary classic which is groundbreaking in genre and film. great acting, pace and over all dark tone makes this film a memorable piece.",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely do you get to experience the psychosis through the character instead of an outside character looking in and knowing or at least has an idea of whats happening. This movie is different in the fact that you see things the way she does and suffer though the madness as it takes over the audience.",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hypnotic is the only word to describe this Darron Aronofsky film",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nail-bitting the whole way through, this drama thriller  never yielded. Left me saying, \"Excellent.\" And wow, was Portman fantastic or what.",
            "review_date": "2017-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brutaly engaiging performance by Natalie Portman! An amazing and well written story that made the audience be asking itself whats going to happen until the last second.\nIt's an 9,0 out of 10!",
            "review_date": "2017-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story about a dancer who is so desperate to be successful on stage that she has visions and nightmares. She also realizes that she has to grow sexually to become the swan. Just a joy and wonder to watch this movie. Natalie Portman is awesome. Aronofsky deserved his awards.",
            "review_date": "2017-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ham-fisted imagery and excessively male gaze aside, this is beautifully performed.",
            "review_date": "2017-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over the many years I've known this movie, I love it more each time I watch it. The hallucinative, trippy, and disturbed atmosphere this film has throughout its entirety is jaw dropping. The three leads bounce off of each other with flaming chemistry. But, as most of you know, the most intense and captivating performance was that by Natalie Portman as Nina. You sympathize with her character, and feel the same struggle she is as she spirals down into insanity. One of the best viewing experiences of my life. Darren Aronofsky delivered an amazing masterpiece of a film.",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very weird movie but I liked it! Crazy...good cast, interesting story. Has a start and an end...amazing characters. WELL MADE!",
            "review_date": "2017-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky flawlessly directs Black Swan. This film is handled with so much care and it really pays off. The cinematography is so beautiful. Natalie Portman gives no doubt the best performance of her career and possibly the greatest female performance of all time. Mila Kunis is fantastic as well and plays the perfect opposing character to Natalie Portman's. The score is also really well done. This is a great movie and no one is better at the psychological thriller than Darren Aronofsky!",
            "review_date": "2017-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificent and underrated film. It was far FAR better than the awful stately 'The King's Speech' that was the most lauded film of its respective academy year. Multi-layered concepts, chillingly good cinematography and editing, bold and beautiful performances from all the cast and a haunting finale. One of my favourite films ever. Even my dad LOVED it- a man of the 70s who says that ballet is for 'jessies'!!",
            "review_date": "2017-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, absorbing, disturbing and always wildly engaging. Cassel, Portman and Kunis are all fantastic.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic and passionate film of transformation",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my dad's favorite movies of the last ten years, and I've been eagerly wanting to see it for years now. I've heard nothing but great things about the film, and Darren Aronofsky is one of the most creative and brilliant directors out there. When I finished this film I didn't know what I just experienced. This is one of the darkest and most beautiful films I've ever seen in my life. Aronofsky perfectly captures inner demons, paranoia, and absolute beauty all in one film, and I believe this is one of his finest films he's ever made. The performances all-around are fantastic, but Natalie Portman gives a performance for the ages. One of my favorite performances; though, was that of Vincent Cassel, and I thought his performance was criminally underrated, but I digress. The first act wasn't as up to par as the final two acts, but other than that I have no other complaints about this fantastic film. The score was phenomenal, and the choreography was very pleasant as well. I never thought I'd see a perfect blend of horror and beauty in one film, but Aronofsky perfectly captures that in Black Swan.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerhouse film expertly made by all involved (including Ksenia Solo who will be a film star!) Wow, as with most of Aronofsky's films, this one packs a punch!",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great job by Portman, the movie was a little slow in the middle but the ending was captivating to watch.",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When we can see ourselves in the front & centre under the spotlight performing our dream job. When we can't bother to see anything go wrong, to see nothing but the competition to worry about. When what we see others see when we all perform the same that makes competing even more overwhelming. When we see what we must perform when we can see the story told through our eyes. When we see we are conditioned into a body to perform, we push ourselves through great limits to see it through to the end. When we see we have to be a person inside another thing that faces tremendous odds & pressure our body & mind is up for the challenge that makes selecting chosen performers to suit such classic performances. When what others see they need to believe when we submerge ourselves into performances that captivate us with its beauty, fragility, and emotional termoils we hope we pull through. When we see the pressures get the best of the best of performers when what others see & expect is the best. When what we don't see we know we need to see fast when we only our weakness is not keeping up with those whom are more composed then us. When we see we need more practice to see we will try all day and night until we get it when we are dedicated.\n\nWhen what others dont see over time, they see they have gotten better when we see some people want it more than others. When we see we need a little bit more coaching yo reach our fullest potential in what we aim to see. When we see our dreams come true when we are selected. When performing takes everything that we got when we need to make the audience see the honesty in us performing as if we were the original. When what we don't see we see what we lack to improve with the right coach, and right change. When we see all greats come and go when the demands for perfection requires those whom are capable. When we see we made many proud, hateful and others curious what we have in store. When we see whom we have see when we perform next to them to get to see whom they are really like in person. When what we do is part of something bigger when years of training, planning, and money makes this a big reputable business full of its extraordinary people, sponsors, socialites that it draws in when they like seeing the best of things. \n\nWhen we see that we need to offer the best tips we can to those whom are our stars and make sure they are alright. When we see we have been trusted into this adult lifestyle that we no longer see the need for nurturing from those whom others have always coddled. When we see the effects can do to those fallen stars to talespin into the darkness where they are no longer admired and seen. When we see we need minor adjustments when trying fit into a new life, new body, new feel, that we take things slowly when others demand we learn faster. When we see we are comfortable at our own pace to see we need a push. When we don't see we push ourselves too hard to see our body can't handle such pressures, but we block it out and don't see it matters. When we see we are the only ones whom brought us this far to not seek help. When we see we are big, and can take care if ourselves to only see it our way. When we don't see thst our way & our dreams is not what others want to see when we are not supposed to be ourselves but what is expected of us when their is a level of expectancy this organization wishes to see. \n\nWhen we see others have a cut at what we dont have to see what we can learn from. When we don't see what foreign influences will do to us, when we lived under a nurturing wing to fly away on our own. When we don't see what places we will go when we are influenced to do what is not like us to hang on for the ride and see where it takes us. \n\nWhen others don't like what they see in us,Â  but what we like seeing in others we take home to mother. When we see that we can't let our guard down agsin, to fall victim to our fragility and innocence to change our perspective in what we want that others can't take from us. When all we see is our strength in our wings growing to see we are transforming. When we see we are scared of transformingÂ  but see we must separate the two when it would be the death of us if we fail. When we see our wings grow stronger when we weather what fears us that propels us to break out of the grasps of what keeps us down. \n\nWhen we don't see why we were chosen when others are better. When we do see we are best suited for other roles when we see we our prince chose us and we see others need to go and die. When what we no longer see is that young girl, old talent, fear of not being chosen when they have already died and gave birth to the new us. When we don't see how we been acting when we are seen less like a queen to our royal subjects, nurturing them under our wing. When we see our worst fears come true when in reality we are not capable and others are, to live in a dream where we are.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think, whatever they were trying to do, it worked most of the time. Such a beautiful film.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best acting in years",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. An amazing, messed up dark film. Fantastic acting. Fantastic directing. This will stay with me for a looong time.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A women who has felt and been treated as a little girl loses her mind as she transcends in to the real women she wants to be. \nI thought the dancing was beautiful and Natalie Portman played her part well i also thought the creepy speckled turned out well. \nThe stage is set you get intrigued in the first half hour and after a while you start to think your seeing things, but i tell your not. Nina is.  \nCombing the beautiful dancing with the damaging mind of Nina was in word. Unique. I definitely think the overall effect was very Swan Lake and not just because thats the show there exacuting.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan, is a dark and creepy psychological thriller, that will leave excited for this amazingly directed movie...!",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nina is obsessive, threatened by fair competition, paranoid outside her knowledge base.  This is a film about that obsessive behavior, envy, and self-abuse to achieve fame and glory.  I parallel it to Aronofsky's The Wrestler, which explores similar ideas, exposing a depressing, deep in denial portrait of how individuals punish themselves to achieve stage glory and impress everyone else.\r\n\r\nAlso like The Wrestler, Aronofksy approaches the material rough, harsh, cinema-verite, though here I don't agree with it as it feels less reflective of the inner psychological portrait it's supposed to be.  The lighting style and film stock don't work with the kinds of angles, movements, and eventual edits.  It's awkward and too grainy.  It feels at times Aronofsky is hiding his points to make a more popular looking film in favor of one that's more interesting. \r\n\r\nBut the performances, expressions, and makeup are perfect.  It lends to the effect of Lily being natural for the role of Black Swan; she's a little darker, hotter, in touch with the necessary reality required to understand the role.  Nina can't depict this because she's a dramatist, a faker, an isolated compulsive dancer who only understands art outside the context of reality.  Makeup is key because it manipulates the faces to play these roles effectively.\r\n\r\nObsessive vanity has its rewards; Nina gets the part but is less liked by her peers.  The sadness is that Nina is deluding into the Black Swan character, a slow digression from obsession.  She sees herself becoming this Swan.\r\n\r\nLily in black, Nina in white, they fittingly meet in the bathroom and the dynamic is perfect.  Lily is sexually suggestive, seductive, friendly and inviting to Nina, a true angel vs devil story.  \r\n\r\nThe Director is the manipulator of the black/white, good/evil dynamic, and mediator trying to help Nina turn on her lifestyle to become the Black Swan, as suggested by his purely black and white apartment.  These colors (or lack of) are a dominant theme.  Nina's mother Erica wears black when cutting her nails.  Her bedroom is also black and white with just a hint of innocent pink, suggesting her mother's youthful treatment of her is a dangerous innocence sitting on the brink of becoming the absolutist black/white thinker Director is.  The overall palette has an interesting limit, some splashes of red added to the black, white, and pink.  Expressions of envy were captured, but where was the green to sour the obvious obsession scheme?  The problem was I didn't feel we explored beyond these obvious parameters.\r\n\r\nThe masturbation scene is terrific; as she explores this phenomenal feeling, she is inhibited by the disturbing sight of mother sleeping invasively nearby.\r\n\r\nIt seems as though this entire stage production is designed to manipulate Nina into broken innocence.  Director gropes her sexually, telling her she has to seduce him, not him to her.  Eventually, she sees him in an evil mask fucking a woman backstage.\r\n\r\nThere's some good and bad with the whole Black Swan metaphor.  The idea is beautiful, artistic for sure, but at times distracted by reaching, contrived methods.  After stabbing Lily to death and effectively becoming the Black Swan, I feel this film is best viewed as a glorified horror film, especially upon the delusion of metamorphosis.  Yet it's not that interesting, it's trite, used, not exactly a shocker.  It's more fun to believe Lily was killed and that Nina is so crazy as to have needed this to become the Black Swan.\r\n\r\nBy the time Nina throws herself off stage, it's a bit melodramatic, but a harsh stick to Director and everyone who exploited her being this way.  It cleverly fades to white, her darkness complete, now returned to the innocence with her point made.  The audience maybe deserves more, I'm not solely interested in her black and white life.  Why don't we get to see Erica, Director, and Lily react?  The perspective is narrow, the agendas of the supporting cast under-examined.  But then it is consistent with Aronofksy, ending Wrestler on a similar note, which didn't seem to need anymore than we saw.",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was personally one of the five best movies I have ever seen. It's so unique!",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a perfect title for a dark, tense, tragic movie of the ballet world. Living in the spotlight with all the glamour of Big City performing arts, and the dark side of competitive ballet industry with many more qualified ballerinas than shows the public can support. A typical style of the twisted imperfect plot,  Aronofsky proceeds to perfect into a thriller, that's troubling, yet moving.  The film is filled with the anxiety that plague his characters and produce a trademark Aronofsky film.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen this 4 times and never getting bored. This psychological drama is so well written, acted and directed that I don't really have anything bad to say. I find the shots quite beautiful, as I love the art if ballet. Natalie Portman did an amazing performance here, transforming physically and mentally to get into the character. This movies is about the passion and devotiin for something gone to the extreme in order to achieve perfection. Totally recommend it! Something quite different from what we see today in theatres.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film. The inner conflict and insanity of Natalie Portman's character is amazing to watch. The visuals were amazing, left questioning what is reality and what is illusion. Loved every minute!",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too dark for me...but I had wanted to see this for a long time! I just didn't realize what it was about!",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan 2k11 - WTF for the first hour and a bit, Good lesbian sex scene, Last 20 minutes \"oh yeah oh yeah i see wha this is all about\"... kind of like inception.",
            "review_date": "2017-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply put, this mindf@ck movie it's marvelous.",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie, especially for the psychotic aspect, and also who doesn't like a good ballet? Natalie Portman plays this role beautifully and makes it really believable. Be prepared to have some \"Whaaaaat\" moments!",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok so this movie was pretty boring yet fascinating too watch at times though the story made little sense.\n2/5",
            "review_date": "2016-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so stupid that it becomes a comedy, although i know that wasn't the director's intention...",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film slowly and insidiously ensnares the senses until the passionate intensity and dark melodrama becomes both visually irresistible and utterly transfixing. Is it possible to simultaneously say that I didn't like a film and that it was majestically terrifying, exhilarating, and brilliant? After this film, the answer is yes.",
            "review_date": "2016-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is the 2010 psychological drama film directed by Darren Aronofsky (\"The Wrestler\"), written by Andres Heinz, Mark Heyman, and John McLaughlin and starring Natalie Portman. The film's plot follows Nina (Portman) a New York Bailarina that gets cast to play both The White Sawn and The Black Swan in her ballet company's new adaptation of Swan Lake. Nina is perfect to play the fragile, innocent White Swan but struggles to play the darker more sensual Black Swan. As Nina finds herself trying to capture the essence of the challenging role, she discovers it to be harder than she thought. The supporting cast includes Mila Kunis as Lily, Vince Cassel as Thomas, Barbara Hershey as Nina's mom, Erica, and Winona Ryder as Beth.\n\n\"Black Swan\" is a beautiful film that delivers the thrills with one of the (if not the) best performance of 2010. The filmmakers explore deep into character, distancing itself from a plot that focuses more on the story to a plot that makes its main character the central piece, the plot. The film's main theme is the study of Nina's psychological and physical struggles, as she tries and achieves perfection in her role as The Black Swans. A metaphor of sorts, the film shows us Nina getting worst and worst, day by day, getting constant hallucinations, many times seeing a hostile, darker self (much like the Black Swan) trying to somehow take over her. This can be interpreted as simply Nina's obvious pressure for a difficult role. Nina being this fragile sweet girl, who's perfect for the role of White Swan, trying her hardest to become someone else. This other version of herself, in her dreams and hallucinations, is the Black Swan, slowly taking over Nina, Nina embraces this other self, aiming for perfection, which comes with its price. Her hallucinations in which Lily appears could represent the possible sexual attraction Nina had towards her, that would later transform into a feeling of anger and rivalry as Lily eventually becomes Nina's alternate in Swan Lake. It could be that Nina never had any hallucinations, it was simply the beauty of filmmaking, as Nina's humongous pressure is shown through visual imagery or hallucinations.\n\nAronofsky captures the film's scenes greatly, the ballet scenes being especially beautiful. Using Light, sound, fantastic music and amazing camera work to his favor, Aronofsky shoots beautiful scenes, that I wish lasted longer in the film. The film's music is beautiful with both Aronofsky and the film's original composer, Clint Mansell, basing the film's music on the ballet's original music composed by legendary composer Pyotr Ilyich Tchaikovsky. But none of these scenes would be so great without the inclusion of the beautiful ballet, with gorgeous choreography and beautiful costume designs with the camera playing a fundamental part in these scenes, as Aronofsky puts us up close to the actors making the scenes even better with that extra touch of directing.\n\nTough the one thing that overcomes all, the complicated, well putt together theme, the beautifully staged scenes, and everything else is, Natalie Portman. The actress is here, how no one has seen her before. Already growing up doing hard demanding roles since the beginning of her career with the likes of  \"Léon: the professional\" and \"Heat\" to then get older and act in even more complex features such as \"V for Vendetta\", \"Closer\" and \"Brothers\" to only then, get to what in my opinion is her best work to date in \"Black Swan\". Portman is simply fantastic in here, the actress is flawless playing the fragile, complex and great character of Nina, doing great in every scene including the beautiful ballet scenes for which the actress took lessons to perform. Opposite to Vicent Cassel, in some of the film's most memorable, character-driving and sensual scenes in the film, the actress does great, and the duo shines in some of the film's best scenes. Also opposite to Portman is Mila Kunis, the actress that usually puts her talents to work in comedy, surprises, too giving a great performance, with some scenes alongside Portman showing the actress' undoubtable talent for drama.\n\n\"Black Swan\" is, as said, a beautiful film with great character study, beautiful production design, fantastic directing of Darren Aronofsky, a stellar cast that does a fantastic job and Natalie Portman in her best performance yet, one that will be hard to be beaten, that only makes me even more excited for Portman's future work. 4.5/5.",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a perfectionist myself, this movie is reflecting me and telling me how I should cope with stress. This movie is exhilarating, dark and passionate.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story/Screenplay: (4.5/5) An interesting story line that follows a lead ballerina as she succumbs to the pressures of perfection.\n\nDuration/Tempo: (3.5/5) At 1 hour and 47 minutes, it's an average length movie that felt about the same.  Very well paced.\n\nCast & Crew: (4.5/5) Natalie Portman and Mila Kunis were paired well.  Good chemistry.\n\nSummary: (4/5) Well directed, well acted, with a well written screenplay.  A thumbs up.",
            "review_date": "2016-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black swan is a great film about self esteem, careers and despair! I love this film so much. the ending was the best creamy yet bumpy icing on the cake! it was fricking fantastic. Natalie Portman is the best committed actress of 20110",
            "review_date": "2016-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A crazy and envolving story.  Love it.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crazy, intense, and absorbing with brilliance, Darren Aronofsky's sharp direction and Natalie Portman's spectacular performance turn this psychological thriller into a near perfect art piece of cinema.",
            "review_date": "2016-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy shit this movie is amazing",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie will certainly leave an impact on you. Brilliantly directed by Aronofsky.",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is drama is suspense, is terror, is sound and danceable, it's ugly and terrifying, it's beautiful, is sober, Black Swan is a bedside movie to all who like film, he does not invent anything new, it does not changes cinephile scenario, they may not be among the I00 best American films ever made, because it is simple and perfect in everything you do, all choreographed around the central script is great, all the mirror game that has in virtually all movies scenes playing with Nina's personality Brilliantly incorporated by Natalie Portman who is lost in his role, the soundtrack, photography and especially the art direction and assemblies scene are absurd so good, Darren Aronofsky tells us everything with just their mounts scenes, to the costumes of the characters talk with the screenplay, script that is simple and duty observers also extremely complex piece, and even after a while, you understand and even provides events, but somehow it's surprising, even you know what will happen, all signs of the film are perfect, all the scenes have a link with the central plot, stay tuned, Darren explains the film at the same time that leaves subjective he wants to talk that has more thing you're seeing there, \"Black Swan\" to me is note I0 not because it is a work that will change the cinema or a magnificent work and everything, it is I0 because he is impeccable in all that it claims to do, and their minimum wrongs do not make me want to take it out of your note, watch \"Black Swan\" and even being very new, you will feel the inspiration he brought to other great films like \" whiplash \"and\" Birdman \".\n\nSPOILER: Nina is 28, it is apparently virgin or suffered from any sexual violence in the past, and her mother treats her like a child, putting it to sleep, changing their clothes and even her makeup Nina. During the film, the plot of \"Swan Lake\" is contact twice (which I found unnecessary), after the second time you draw the lake of cinemas has a relationship with nina life, as she begins to interpret \"Swan Lake\", before going on stage, the swans of Lake story is about a shy, pure girl (Nina), and who cast a spell on it that prevents it from freedom (his own psyche, note that the Gradually she is changing that, as the act of playing their bears out), this spell can only be broken by true love (in case here is a metaphor for that love for her is the very role in Swan lake), but this love is in danger, because the black swan that stealing (in the case here the black swan is Lilly) Note that Lilly is always black and Nina always white (with its transformation that will change over time), to the beauty of Natalie in this film is something beautiful, pure, delicate as the beauty Mila Kunis is something sensual and wild, even in Darren casting choice passes the messages, note also the character that was once the black swan and the white, Beth MacIntyre (Winona Ryder), which uses white and black clothes and shows clear signs of bipolarity finally Nina \"Lose\" purity, and to break the \"Spell\" she even turns the black swan, an internal fight alter egos that is brilliantly demostrada by Darren, even in Nina's hallucinations to where she even finds himself becoming the swan to the final act to which it is released completely.\nBlack Swan is a symbolic film that still talks about the entertainment limit, the obsession for perfection, and on our daily struggle and maintain good and honest society and deter acts of black swan within us.\n\"Perfection is not just control. It is also about letting go. Surprise yourself so you can surprise the audience. Transcendence. Few have it in them.\"\n\nForgive my English translator google",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerfully intense and hugely influenced by Stanley Kubrick. Black Swan is a psychological nightmare that rides on Darren Aronofsky's sleek direction and a grand performance from Natalie Portman",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We've seen movie about obsession before. This is however one of the few I can remember off the top of my head that the obsession isn't really over someone else, i.e. a stalker, but about yourself. The quest for perfection in yourself for a craft that you will do anything to achieve.  Often trying to blur the line between reality and disillusion the film does a good job at that. Maybe not as good as initial response, but still interesting.",
            "review_date": "2016-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very unique film that is appropriately eerie and compellingly daring.",
            "review_date": "2016-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman and Mila Kunis are paired up in this trippy and sometimes horrifying film about how something that one obsesses over can be very unhealthy for them. This film is nearly flawless in my opinion, every scene is beautifully shot, the acting is amazing, and there's almost never a dull moment, the ending is also quite impressive to behold. I took off half a star because of the nightclub scene. I understand why it's in the film, but I feel like it's a focus for far too long and is by far the weakest part of the movie as a whole, and I feel like the filmmakers could have made the same point in a much more effective way and been shorter than if they had focused on two friends getting drinks. However, this is a minor flaw in an otherwise flawless movie, and I would still highly recommend watching this to anyone who enjoys film",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved the dancing, wished there was more of it.  I had to close my eyes for some of the disturbing scenes.",
            "review_date": "2016-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman turns in a strong performance in this film as a ballet dancer that wants stardom but is slowly led down another path. Very artistically done by Aronofsky and the film won awards. The story is a little confusing toward the end and the film has to be watched again in order to piece everything together. It also ends a little abruptly.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully dark in its portrayal, \"Black Swan\" delivers a powerful and twisted tale of passion meeting obsession. Natalie Portman was born for the role.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thought provoking psychological thriller about the anxiety of being replaced. Portman stars as the titular character who is pushing herself to play both the white swan and the black swan in another adaptation of the Swan Lake, things took a dark turn when she slowly lost control of herself. Intense and beautiful, Black Swan is probably the best performance from Portman, Kunis was a good comic relief too.\n\nI think the writing and special effects deserve some praise too, the hallucination scene was rather eerie, the realism also worked really well to explore the psychology of the characters. A must watch.",
            "review_date": "2016-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Supposedly a psycho-drama, its transparency and superficiality make it funnier than it is dramatic. It's more bullshit from the director of Pi.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling, powerful and intense psychological thriller acting as a viceral metaphor for achieving perfection. Incredible performance from Natalie Portman, ably supported by Mila Kunis and Vincent Cassel, and directly in effortless boldness by the terrific Darren Aronofsky.",
            "review_date": "2016-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite good. Almost there.",
            "review_date": "2016-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the best psychological drama movie...also highly inspired from perfect blue..",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very symbolic and good film overall.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan (2010) ??? 1/2\nNatalie Portman won a well-deserved Oscar for her intense, no-holds-barred performance of a ballet dancer who's lead in \"Swan Lake\" causes her to slowly lose her sanity. Some felt this story was absurd, I thought it was exhilarating, with flamboyant, in-your-face style of filmmaking and Portman's powerful performance, which is indeed a tour de force. However, in spite of this film's blessings, it's tough going at times, and the script occasionally slides into conventional territory. Matthew Libatique's cinematography is simply extraordinary.",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why, but somehow this movie was touching. Black Swan is one of those movies that reaches out and touchs your heart.",
            "review_date": "2016-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fierce, passionate, mysterious, and captivating. Black Swan dives into the tough life of competitive ballet, and doesn't miss any details. The film held such an elegant tone throughout the entirety of the story as if it was a ballet itself. Darren Aronofsky truly showcased his unique and bold direction with the film's tone. The story is a work of art full of interpretation, symbols, and emotion. \n\nI feel Natalie Portman is underrated as an actress, and needs much more attention in artistic films such as Black Swan. Portman played an incredibly difficult role and owned her character on the big screen. She was complex, mysterious, and relatable.\n\nThe cast had chemistry that genuinely worked. Mila Kunis was a perfect rival for Portman and they contrasted very well. It was easy to see their passion for the art of ballet as they competed to be the best.\n\nOverall, Black Swan was refreshing and original. With a beautifully unique story and brilliant cast, Black Swan was a very enjoyable experience. \n\n4 Stars.",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! That's all I have to say for this movie. \nThere is a lot of symbolism and character development in this movie and in the end that's what makes this movie so GREAT! I would categorize this movie as an action/drama thriller.",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How far would you go to be perfect? Bravo to Natalie Portman who carried the movie with her brilliant performance as both white and black swan.  She really deserved her Best Actress Oscar for this complex character.  This is one of the most beautiful-scariest movies I've even seen.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As theatrical as it is thrilling, Darren Arofonofsky's Black Swan brings ballet to the big screen with vision and confidence. The film starts off calmly enough, but as the heat of the spotlight as the Swan Queen shines brighter on Nina - portrayed by an extraordinary Natalie Portman - her psychological demons begin to consume her, with strong echoes of Dostoevsky and Cronenberg. This all builds up to a thrilling climax that hits hard, and mostly compensates for the unevenness preceding. \n\nThat is to say that the Black Swan is not without its faults. The body horror, while successful in its shock value, does go a little too far in places. I also didn't care too much for the CGI near the end, serving only to beleaguer a point that  would have been better off subtler in line with the rest of the film. But these are relatively minor points in what is an intense and stirring film. With great supporting performances from my favorite Vincent Cassel and Mila Kunis as well as some great camerawork, Black Swan is a film that will not soon be forgotten.",
            "review_date": "2016-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is really an 8.5/10, a film between very good and great.  It is a psychological thriller about a ballet dancer with mental illness, likely schizophrenia, and the action in the plot teeters between what is fact and what is in her mind.  Unlike so many films incorporating this theme, there is nothing left vague by the end of the film, which is pleasant.  Unlike films such as \"Memento\", where you are intentionally left having to make your own conclusions, which can be frustrating.\n\nThe acting is top notch and the subtleties as the protagonist falls deeper into mental darkness despite her professional success are spectacular.  Note watch early on for eyes moving on the wall room, etc.  In retrospect, these signs indicate all is not as one sees, similar to Brad Pitt breaking through in split second lashes early in \"Fight Club\".\n\nA dark film overall, highly recommended but certainly not a \"feel good\" movie.",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was horrified after seeing this film, probably one of the worse I ever seen and i have seen many bad movies since this is the most common film type. This film is a glorification of sexual assault in the workplace which happens so often to women. its amazing how Misogyny and sexist this film is. The Ballet choreographer spends the whole movie sexually assaulting the main character without any consequences, in fact the whole movie suggests that these sexual assaults are for the good of this woman because according to who wrote and directed this movie, this is the way that women should learn and express their sexually...Men (including in film) can't help to prescribe to women what should we like, how should we behave, how sexual we should be etc. This planet is depressing!!!",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've put this one off for awhile and I did myself a disfavor. Black Swan is in my opinion Natalie Portmans crown jewel. Between her tense and dedicated performance teamed with the direction of Aronofsky, Black Swan is one of the most intriguing films I watched as of late. It isn't my cup tea but the intensity and emotional touch this movie has kept me interested until the very end. Its a bit of a mind trip as well. Black Swan surprised me, big time",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who enters this film believing it to be a 'feminine film' will be proven dead wrong. \"Black Swan\" is one of those films that successfully dives into the tragedy of schizophrenia as well as the harshness that is the world of ballet. With Portman constantly being told to be perfect, her mental state slowly deteriorates into a truly haunting persona that is the Swan Queen. Aronofsky's attention to the subtleties that make this a truly haunting tale is the closest I have seen to a true Kubrick-ian film since Kubrick's passing. That is what horror and suspense is to me. It's not about jump-scares and gore. It's about the build up of tension and the little details. A film that needs to be watched more than once.",
            "review_date": "2016-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is very good here, as is Mila Kunis, but unfortunately I just couldn't get into it. Just like ballet in real life, I just have no interest. I did really like the cinematography though.",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so much, it digs deep into our own struggles within the mind and how we can be our own worst enemies. To sum up this movie I'll use a quote: \"The mind is a wonderful servant but a terrible master.\"(Robin Sharma)",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Congratulations movie, you've turned something as pretty as a dance into nightmare fuel. Thanks for that.",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman was great but the film itself is missing something, i feel like it is a bad copy of perfect blue, watched again still some parts are strange, i guess most of the people love it cause of the same reason, since they dont actually know if they like it or not",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rebellion, jealousy, perfection, paranoia, obsession, masochism; embodying the French surrealist elements of which it was created, the intoxicating Black Swan speaks straight to the psyche.\n\nEmbracing Tchaikovsky's hauntingly powerful music, Director Darren Aronofsky (The Wrestler, Requiem for a Dream) digs deep under the skin to consume viewers. His simplistic use of special effects, extreme close ups and tight camera angles, plummets us into the deliriously dark reaches of the fragile mind. \n\nDedicated New York corps-de-ballet dancer Nina (Natalie Portman) lives a sheltered life. Fuelled by her retired overbearing stage-mother's (Barbara Hershey) obsessions, Nina's life is completely consumed by her profession and her ambitious dreams to be elevated to the companies lead prima-ballerina.\n\nWhen artistic director Thomas Leroy (Vincent Cassel) announces that the new seasons opening production will not only be his own new visceral version of Swan Lake, but also the launch of a fresh face, naïve Nina's dreams finally seem within reach. \n\nHis immediate first choice, Nina is a shoe in to replacing Leroy's 'little princes' previous protégé Beth (Winona Ryder). However, his reservations for Nina in the character as Swan Queen lie within her ability to transform in the duel role as required. \n\nA perfect fit as the fragile, innocent and graceful White Swan Odette, Nina is too reserved to embrace the guile and sensuality of its darker nemesis and convert into the mistress of deception Odile, the Black Swan. \n\nTaunting her as frigid, afraid to let herself go and confined by boundaries, Leroy attempts to bring out the inner Odile with an exercise in seduction. However her continuing internal conflict is amplified when Lily (Mila Kunis) joins the corps. \n\nDirect opposites; Lily is the personification of fun-loving, dramatic passion. Her naturally relaxed raunchiness and noticeable attraction to Leroy compounds Nina's obsession with the perfect performance.  Their need-to-impress rivalry blossoms into a twisted friendship with Lily temping Nina to loosen up with sex, drugs and booze. \n\nA savage triumph, Nina is finally able to tap into her dark-side. Her hallucinatory behaviour leads to a recklessness abandonment that threatens to destroy not only her career but her life.\n\nPerfectly cast this production is well deserving of its five Oscar nominations. The delicate, beautiful and vulnerable features of Natalie Portman are finally put to good use in the role of her career. Stunningly believable as a tortured soul, Natalie is a shock to the system to watch. \n\nBarbara Hershey is terrifyingly malevolent, Winona Ryder is chillingly anguished, Mila Kunis is full of every freedom-loving expression and Vincent Cassel oozes the required smarminess whilst still being able to deliver the depth of a nurturing mentor. \n\nThe verdict: Dark and disturbing, this striking film delves into the terrifying depths of the human mind. As life imitates art the lines between reality and fantasy often become blurred.\n\nPublished: The Queanbeyan Age\nDate of Publication: 04/02/2011",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful nightmare this movie is, it induces a state of dread and mesmerizes it with beauty, and that is for sure a paradoxical, rare and skilled achievement by Mr Aronofsky.\nThis movie has a theme, that i love, it is a recurring theme in many of my top 50 favorite movie's. (e.g The Game, The Truman Show, A Beautiful Mind, Shutter Island, The Prestige)\nIt's a movie that messes with you in a horrible way, it messes with your mind, and it changes you after you've witnessed the film, and it fantastic how this is achieved in this magnificent movie.\nTo create beauty with horror is a rare feit, but executed so well.\nThis movie is ambiguous, it has puke-inducing scenes, scenes where you're crying and where you're smiling.\n\nBlack Swan is a magnificent movie experience.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, that was intense! A great story and performance.",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cliche comes to mind. But also the phrase \"trying too hard.\" It's the kind of movie average people watch to feel smarter and more cultured.",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fuck it. It gets five stars. I'm just going to give it that. I wasn't bored in the slightest. It was really good. It was a creepy, disturbing, horrific, psychological, thriller, suspense, drama, horror. And I couldn't have asked or expected anything less from Darren Aronofsky. This man knows how to push all the right buttons in all the right ways, he didn't direct a lot of films. But when he does make a film, it's generally a smash and it's generally deep and mentally and psychologically disturbing. Very good cast, very good acting. Were you team Natalie or team Mila? Did you not care? Were you excited for the one scene? Yeah, he didn't disappoint. This film is nuts and will tear and pull you around in different directions, but it's simply fantastic and beautiful.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is my favorite movie ever. Natalie Portman is my favorite actress. The movie is a little scary in somehow, but it is really perfect.",
            "review_date": "2016-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky´s brilliant depiction of insanity and self destruction brings out the best of a disturbingly magnificent Natalie Portman in this intense and somber thriller.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, unsettling, and sometimes unexpectedly terrifying, \"Black Swan\" is a uniquely dark drama only Darren Aronofsky could make.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I have absolutely no connection or interest in ballet, I felt truly passionate about the story because of Aronofsky's ability to tell a story that shows the characters spiraling into madness and take you down with them. This film had me captivated from start to finish and I was genuinely surprised (though, not shocked) at the climax and finale of the film.",
            "review_date": "2016-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spoiler Alert: \nDid anyone really care that she offed herself at the end? I was happy the movie was over I could leave.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, is is trying to be a film about a girl going through a \"Linkin Park phase,\" of her life, or a ballet? There's never really any distinguishable features other than bland symbolism that relate the two together. Plus the weird, demon, horror movie it was including. Regarless of that, Natalie Portman does do an excellent job. Just wish the movie had more of a clear direction.",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "portman's character is eerie while kunis's is badass. a bit uncomfortable but great one",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. An amazing psychological thriller! I recommend it to anyone.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We are light and dark, rational and irrational, driven by love and hate, life and death, eros and thanatos.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mighty, intense, emotionally strong. And, to my opinion, much more than an inspiration for Inarritu Birdman ...",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie blew me away. Natalie Portman's performance in this was nothing short of phenomenal. This is the type of movie that leaves you thinking and love it even more after the credits roll. The acting and story are both amazing and definitely deserved the Oscar it won. If you have not seen this yet, I highly recommend that you do. It is definitely high up in the list of my favorite movies.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well known theme in Aronofskys movies in another approach. A good movie but we've seen better from Aronofsky",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and extremely well made. There are strong performances all around but what really got me was the special effects. They really seemed to help Natalie Portman tell the story of her psychosis. The movie lost a star for me because I didn't like how they filmed the ending. This is not a gory movie, despite a little blood. This movie, given the subject matter is best left to older audiences. It's definately worth seeing if you have an appreciation for the performing arts.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A psychological thriller that's both intense and elegant thanks to Aronofsky's ingenious directing, Clint Mansell's pulsating score, and Natalie Portman's thrilling performance.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portman is so hot and does a great job in this. Very creepy in a good way- in the same way as Requiem For A Dream. Her descent into insanity is depicted perfectly, which is what makes this such a good film.",
            "review_date": "2015-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can understand how people could see this as an \"artsy\" film, and it is, but in a good way. It is hard to use this type of art direction to make a film this interesting, and Darren Aronofsky did it perfectly. This film is dark, twisted, and yet so beautiful, and Natalie Portman gave the best performance of her career.",
            "review_date": "2015-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stepping into familiar territory, Aronofsky crafts, yet another wonderful psychological drama, which although split audience opinion, ultimately solidified itself, critically, as an essential genre piece. Nina is a fragile and tormented ballet dancer, who strikes it lucky when her dance company decides to drop its main star, in favor of a younger face, for its massive production of Swan Lake. Overwhelmed by her position, Nina soon buckles under the pressure and the production is thrown into turmoil, as Nina struggles to differentiate between reality and imagination. Black Swan is very much a character piece, with its success purely dependent on lead actress Natalie Portman, who thankfully does a wonderful job, bringing the character of Nina so perfectly to life, Portman actually vanishes as Nina takes the fore front. Its a stunning performance, that merges dangerous desperation, with a fragility that is heart braking to watch. That's  not to say the rest of the cast do a bad job, Cassell, Kunis and Hershey do a grand job, supplying a host of melodramatic, but essential characters for Nina to surround herself with, however Winona Ryder may actually be the best casting, in a long time, with her brief but wonderful performance as Beth, the washed up star who is dropped in favor of Nina, it's a genius decision to cast an actress who once had the world at her finger tips, and her performance steps Black Swan up a few notches. It's a wonderful, stylistic affair, with Aronofsky injecting a brilliant and invigorating sense of psychosis, Black Swan looks utterly stunning from start to finish, blurring the lines between reality with some bizarre visual effects and make up work. Impressive moments see Nina transform, as she glides through her performance, with shimmering wings and blood red eyes, it's visually arresting to witness her transformation, made even more powerful by Portman's ability to hammer home a sterling performance. Black Swan can at points feel like your stuck in a whirlwind and by the end, you will feel slightly thrown about and pretty disorientated, however upon multiple viewings, clarity will start to prevail. The script does at points feel rather forced, with some cringe worthy dialogue floating about from time to time, and although the film is well orchestrated, it does feel like a selection of scenes could have been added to strengthen its overall presentation. Overall, Black Swan is hardly ground braking, however Aronofsky's ability to craft a visually stunning and emotionally charged, psychological piece, with superb performances and a wonderful score, makes Black Swan a true accomplishment in film making.",
            "review_date": "2015-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't remember much of this movie now (2015) but I recall it impressing upon me and making me feel uncomfortable which is a good sign.  I recall I liked to see it, but there were some tough scenes.",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had goosebumps the entire time, I applauded during the end credits, what a triumph.",
            "review_date": "2015-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Black Swain' plunges audiences directly into the psyche of the film's protagonist, Nina - and what an unnerving, dark and magnificent descent it is.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping. Outstanding performance from Portman with an ending which will have you thinking for hours after.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Melodrama done right, Natalie Portman's performance of a ballerina struggling with an undiagnosed mental disorder is masterful, as is most of the movies production. The camerawork, score, pacing, and supporting cast all work together seamlessly around her performance to create a captivating piece of cinema. I personally like to watch it as a horror movie, for what could be more terrifying than losing your grip on reality?",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was very thrilling. It gets you right to the very end. It was downright frightening at times, but I had to keep watching to see how it would end. Natalie Portman is brilliant and always gives it her all, so that alone makes it worth seeing.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mix between dramatic and physcotic. Black Swan was an emotional thrilling ride. With great direction from Aronofsky, this movie was a hit. All the characters in this film are very believable and well developed. Natalie Portman gives probably her best performance ever and is truly great to watch. Black Swan is very chilling, creepy, and a little bit dark, Surrounded by a great score the elements of suspense and the whole psychological aspect of the film are memorizing. And how bout that Mila Kunis Natalie Portman scene eh? The pace is a little iffy and but is held together nicely by the plot. I liked Black Swan, did I love no but it had great thrilling scenes and was very intense at times. An overall solid film that I enjoyed throughout",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Black Swan, as a film, is finely crafted. I really enjoyed the way it was shot, and also the nice cuts and effects. The story is easy to follow and has strong pacing. Natalie Portman makes the lead work as this crazy yet sympathetic character. The film is as simple or as complex as you like, and I recommend it.",
            "review_date": "2015-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a beautiful relationship with Art. It has enriched my life, molded my views and my psyche. Well, basically, it is the same case with most of the people, the audience. Why? Because, we are viewers, from afar, not inside it. Because of what goes on behind it, how it makes or breaks lives? For, an Artist, the Art is his/her life and vice versa. The lines between the two are blurred, and your Art slowly consumes you. It can be great for some, destructive for some, and for some rare souls, both of it at once.\n\nIt is a pure relationship, the one between the Art and the Artist. And Darren Aronofsky has brilliantly explored this relationship, with the 2010 psychological drama Black Swan. The story of Nina Sayers, and her poetic relationship with her art, Ballet, is ever so subtlety portrayed on the silver screen by Aronofsky, the man behind poignant psychological drama like Pi and The Fountain. The movie opened to universal critical acclaim, and was nominated for five Academy Awards, and Natalie Portman went on to receive the Best Actress for her bold performance as Nina.\n\nA famous New York company is looking for a fresh ballerina for its production of Tchaikovsky's Swan Lake Ballet. The ballerina will have the challenging task of playing the contrasting characters of the Black Swan and the White Swan. Nina is the perfect pick for the beautiful and ethereal White Swan, but she is unable to grasp the dark and sensual Black Swan. Things take a turn for the worse when her role is threatened by the newly-arrived Lily (Mila Kunis). From there on, it is a downward spiral with Nina's hallucinations and the reality gets jumbled and she slowly loses grip of reality.\n\nThere is something uniquely magnetizing about how Aronofsky brings out his scenes. It is not a pretty picture, with its themes of horror, fear and desperation, but you just can't look away, because it is so tastefully done. Ballet, itself plays an important role here, and Aronofsky captures it with a sad elegance. You know how this is all going to end, but that is not the point. It is about how Nina's life is slowly unraveling and disintegrating herself and all we can do is helplessly sit and watch. It is a powerful emotion, despair, and Aronofsky plays that card with quite an effect. The cinematography is dark, yet beautifully done. There is so much emotional disintegration around, but it all feels so visually beautiful and that makes it scary. The music, too complements the tone and tenor the film adopts.\n\nOf course, you can't put it in words, but I will still talk about Natalie Portman. From the \"Damsel in Distress\" in the Star Wars flicks, she has really matured as an actress. And with Nina Sayers, she has produced an absolute gem, a character with so much pain in her eyes, it is heart wrenching. Her porcelain face is laced with a plethora of emotions and her character successfully depicts the behind-the-scenes pains and agony of any performing artist. It is by far the bets female performance of this decade! Brilliant.\n\nBlack Swan is brilliantly written, acted and directed. It is a haunting examination of life on a stage, which slowly rips apart your soul in the elusive quest for one unattainable prize -\n\n    Perfection!",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Aronofsky-style thriller. His first film I saw impressed me a lot. However two other his films feels more or less the same.",
            "review_date": "2015-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portman gives the performance of a lifetime in this guilty pleasure.",
            "review_date": "2015-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional acting. Difficult, but an incredible story. I like it.",
            "review_date": "2015-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captivating as the film narrates how neuroticism takes the front seat and slowly nudges a woman's descent into madness even as the frame maintains its grace and poise, Black Swan showcases Natalie Portman's acting skills at its finest.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as great as all the hype around it, but it does have great subtlety and layers if ur willing to look for them and notice what's going on beneath the surface..\n\n3 out of 5",
            "review_date": "2015-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fantastic movie. I've seen it a half dozen times, and it never gets old.",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10/10\nBlack Swan is a surreal film, with fantastic direction and the best performance of Natalie Portman's career. The first two acts were great, but the third act was one of the best finales I've ever seen! I loved Black Swan!",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is dark, thrilling, and at times frightening, all thanks to a revolutionary performance from Natalie Portman. It may be too twisted for some, but it stands out as one of the best films of the year, worthy of awards and praise.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best female performances of the 21 st century. Natalie Portman commands the screen with her presence and brings to life a beautiful yet disturb ballet dancer---truly worthy of the academy award for best actress.",
            "review_date": "2015-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly tense with an amazing performance from Portman, Black Swan is a terrific drama, even with a few flaws in the story.",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky delivered the most heart-grabbing and spine-tingling movie of all time with flawlessly dark and sexy elements. The way symbolism, reality, and psychology mushed in together was so beautiful and mesmerizing, but achieved only with the massive help of its intense cast with real life-like acting, creative mind-bending scenes, and stylish ballet dancing that made the original Swan Lake play even better. Completely eye-opening, just wow.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gorgeous and terrifying,",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viscerally beautiful, ambitious and visually uncomfortable, Black Swan is a brilliant psychological thriller from director Darren Aronofsky that serves as a magnificent acting showcase for star Natalie Portman -- and the unimaginable costs of following after one's dreams offers further testament that with punishing challenges often come rich rewards.",
            "review_date": "2015-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reminscant to Asian horror cinema this beautifully crafted psychological thriller keeps you hooked to the very end with disturbing imagery that's hard to forget and an Oscar winning performance by Natalie Portman that makes this dark and beautifully terrifying film all worth the while.",
            "review_date": "2015-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although compelling, there are too many moments embodying the philosophy of \"Batshit for the sake of batshit\" that do not add up to anything.",
            "review_date": "2015-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting story with Natalie Portman giving the best performance of her career. A very sad movie at the end if you look at the deeper meaning of it.\nB+",
            "review_date": "2015-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not for me.. gory and just strange",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of 2010. It's A.M.A.Z.I.N.G. Breathtaking. Gorgeous. Intense. Terrifying. Natalie Portman rocks. The music is incredible.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very misleading promotions labelled this a horror film when in reality it plays like a drawn out foreign/art psychological drama. I often caught myself asking \"damn, is this over yet?\" when it isn't even that long of a movie. Not much action or violence and certainly not scary.",
            "review_date": "2015-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wtf happened lol ;) super artistry lol I didn't quite understand if fully at first but then after completing the film it made sense, the only thing that bugged me throughout the film was the not knowing whether or not your in a dream or real life lol that was really weird but showed the development of Portmans character",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is a tour de force. It could've been about football, hockey, baking cookies, her commitment and release into the role is insane (no wonder her character does go mad). All other characters are irrelevant, especially Cassel, who is the epitome of the \"company director/owner french clichê\" with his yells and kisses and seductive moves, was very meh, which is a pity cuz he has the goods (and is sexy as hell). But her descent into madness together with her dancing and the blending of the black and white swan, and Mila Kunis really pushing forward Portman's performance (who knew Mila Kunis had so much \"acting\" in her? What a good surprise), this film is spectacular. I am not one of Aronofsky's biggest fans, I like Pi but think Requiem is one of the most over rated movies ever and would never rematch it, but this one hits the mark, all because of Natalie Portman. So I guess Aronofsky had something to do with it... Bravo Natalie!",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "incredible psycho horror epic. the climax, and most of the movie, is absolutely insane. perfectly insane",
            "review_date": "2015-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely intense and psychological film. \"Black Swan\" features Natalie Portman's absolutely riveting performance that truly takes the film to a whole different level. The intensity built up by the film is masterfully crafted and the overall spectacle is extraordinary. Well done, Aronofsky, well done!",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a beautiful nightmare, if there is such a thing.  Aranofsky returns to familiar territory with this decent into madness.  Natalie Portman's masterful turn as a ballet performer obsessed with perfection is only tempered by her unwilling transformation into the Black Swan as she destroys the relationships around her.  The beautiful Barbara Hershey turns in a chilling performance as the unbalanced, overprotective mother living vicariously through her daughters accomplishments.  Sadly , Mila Kunis, though not underutilized as an antagonist, receives little screen time as a dancer.  As always, Cassel shines as a villainous instructor.  The cinematography was balanced and the lighting was superb.  As one crew member put it, Swan Lake is the tragic story of a Wer-Swan.  For the first time, Aranofsky gives us a true glimpse into that horror story.  Highly recommended.",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan\nmy feeling is violated by this movie and guess what? it was the best part of this movie, the creepy ambience and mad delusions.. perfect",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although Aronofsky's directing can be annoyingly ambitious, almost to the point of arrogance, there can be no doubt that Black Swan is his greatest film and probably his only true great hit. While Requiem For A Dream was a bit to abstract for the average viewer and Noah went the way of many horrible blockbusters before it, Black Swan seems to balance the drama and the abstract nature of Aronofsky's directing, due no doubt, in large part to the magnetic and possibly career best performances from Portman and Kunis, who completely carry the film, drawing us in with their well developed and well acted characters. Portman in particular is excellent as the desperate Nina, whose psychological battles are gripping. A well crafted film in every department.",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect. That movie is a complete masterpiece. That performance of Natalie Portman was unique and amazing.",
            "review_date": "2015-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exquisite performance by Natalie Portman. Even though at times it becomes a horror movie, I was captivated by this amazing production. The best movie of 2010 for me.",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who knew that a movie about ballet could be so intense and creepy? Darren Aronofsky's \"Black Swan\" is a chilling and intense thriller elevated by a powerful performance from Natalie Portman.",
            "review_date": "2015-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performance by Portman. Kunis should have been nominated as a Supporting Actress. Such a dark film. Not for the faint of heart. The end sequence is well worth watching even with the slower moments through out the rest of the film.",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ð?\nA psychological drama that is eerie, haunting, and emotional all at the same time. Beautiful performance from Natalie Portman, and a beautiful ending.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky's twisted tale is beautiful and horrifying in its depiction of art and competition. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated. Oddly it reminded of Carrie (of Stephen King fame) if she practiced ballet instead of pyrokinesis.",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an excellent movie that has some extremely intense sequences, some of which are pretty creepy. Natalie Portman lives up to her reputation, and delivers an outstanding performance.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bart Simpson once declared that ballet was for sissies. But as Darren Aronofsky's skilful masterstroke demonstrates, the dance discipline is not for the faint-hearted. \n\nAs the mentally, emotionally and physically fragile ballerina Nina Sayers, Natalie Portman is heartbreakingly incredible. It is through her determination and crumbling grip on reality, that we see the lines between art and life blur. \n\nSolid supporting performances across the board, particularly from Mila Kunis, Vincent Cassel and Barbara Hershey, add a wonderful dynamic to our protagonist's world. And it is a world that is both painfully suffocating (her bedroom resembles that of a ten-year-old's) and exceptionally cruel; the texture of both the city and rehearsal space are purposely harsh. Recurring motifs of flesh (note the emphasis on Portman's perturbing ribs and small bust), nails, blood and mirrors reinforce this, and there's such care in the costume design that we are able to understand so much about the company, their personalities and their relationship with one another. \n\nComplimented by a stunning score and cinematography, 'Black Swan' is one of the most honest portrayals of mental illness in a very long time.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely Fantastic movie!!!",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was little about this movie that I enjoyed or connected with. Grey and stark, I found the atmosphere and settings reminiscent of a low-budget movie. Although the tension increases mildly in the second half, it wasn't enough to save it. AAN GGN 1001 AFI",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan was a crazy ass movie! Good tho!",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Afronosky direction  and the cast's acting are electrifying, though Black Swan does suffer some Ballet clichés.",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second time wathing ....still good ! Like Natalie...SOMDVD",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me the best movie of 2010. Even though i don't appreciate Ballet or dancing in general, as a movie its just so well done, and the performance from Portman is absolutely stunning!",
            "review_date": "2014-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The feel-yourself-good movie of the year.",
            "review_date": "2014-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a psychological drama about a ballerina who tries to escape her life's imprisonment.This movie is a thrilling journey to the viewer as you start empathizing with the main character immediately.",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's update this; rewatched it, and hated it even more. This is the literal definition of \"style over substance\". Everything was to be as expected from this Director, beautifully shot, great command of his actors, but the material was terrible to begin with. \n\nI don't mind allegorical stories or movies where the play they're putting on mirrors what's happening in reality, either. But you just do it without mentioning it. To literally have the actress turn into the Black Swan from Swan Lake is insulting to your audience. That's saying, \"You're probably too dumb to realise that the movie is actually exactly like the ballet they're performing it, so we'll spell it out for you at every turn.\" Thanks movie. Then don't make this film if you're going to insult your audience's intelligence like that. It's pompous. Could be one of the worst movies I've seen in a while, because of it's gross arrogance and the way they treated the audience.",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece! Darren Aronofsky has created a creepy, engaging, and unforgettable film for the ages. This is one of his best movies and probably his best in my opinion. Natalie Portman gives the best performance of her career. It's a performance that will be talked about forever. You feel her performance in every scene.",
            "review_date": "2014-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Potman's portrait will resonate forever !",
            "review_date": "2014-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique. Exceptional. Psychological. Erotic. Perfect!",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent character study of a young woman aspiring to be the best, featuering a compelling story and a fantastic performance from Natalie Portman.",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entirely unsettling piece of cinema, Darren Aronofsky's \"Black Swan\" hits all of the right notes and results in a memorable psychological thriller that will make the audience think.\n\nThe basic story (which parallels the classic ballet \"Swan Lake\") tells the story of Nina, a highly motivated ballerina who aspires to the role of the White Swan. When manages to land the part unexpectedly (and with allegations that she had to favour the director to get the job) Nina begins a shocking spiral into madness as the pressure of the situation begins to come down on her. Not helping the situation is the arrival of Lily, a new member of the company who aspires to Nina's role.\n\nThe role of Nina is played stunningly by Natalie Portman, and in a film filled with well-designed bits her acting is still the clear highlight. It is certainly no surprise that Portman took home the Oscar for this film. Among her supporting cast are such names as Mila Kunis, Vincent Cassel, Winona Ryder and Sebastian Shan, with every cast member bringing out memorable performances - as is often the case in an Aronofsky film.\n\nIt's a highly unsettling film, and it certainly isn't a film that you can just casually watch - something which I'm sure confused an entire demographic who was in the theatre to see THAT scene. But for anyone with the fortitude to sit through this emotional roller coaster, there's plenty of rewards at the end.\n\nIt isn't a perfect film. But it's damned close enough. 9/10.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is an unforgettable cinematic experience.All this from the sublime direction of Darren Aronofsky, the fantastic performance of Natalie Portman and sensitive script, however fleeting. All these elements are essential to transform \"Black Swan\" a stunning work of art.",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9/10 = perfect - a thrilling masterpiece, entertaining as well as artistic\n\nBlack Swan is an exceptional character portrait for everyone, both the\ncasual popcorn eating blockbuster watcher, who's going to the cinema\nfor pure entertainment and the cinephile, perceiving and judging a film\nby its artistic form - expressing the essence of being. Go watch it! \n\nThe film grabs you, taking you on a pulse increasing trip feeling Ninas\n(Natalie Portman) self-destructive compulsion to perfection, while\nnever loosening it's grip. \n\nAs a character portrait it's comparable to The American\" (2010), but\nuses swifter stylistic devices which fit perfectly to the pressure\nexperienced by Nina who never comes to rest, giving the film a much\nfaster tempo and is therefore more accessible for the mainstream\naudience. \n\nAnd holy cow, that performance of Natalie Portman! It's unbelievable!\nFrom start to end she couldn't make any better - absolutely perfect.\nYap, there you go, Oscar for Best Performance by an Actress in a\nLeading Role\". Mila Kunis does a surprisingly great job (usually she's\nnot that good) and is an excellent cast for Lilys role, but\ncompared to Natalie Portman everyone else falls off.\n\nThe second star besides Natalie Portman: Director Darren Aronofsky.\nRequiem for a Dream\" (2000) and The Fountain\" (2006) speak for\nitself, while going even one step further with Black Swan\". Incredible\nusage of mirrors enriching Ninas character and creating an outstanding\natmosphere with his placement of light and shadow.\n\nIllustrating the inner life of an artist loosing and damaging herself\nwhile trying to reach perfection (using ballet, but transferable to\nother art forms), this film itself achieves perfection and is a\npleasure to watch for everyone.\n\n================================\n\nmy rating scale \n\n10 over the top / 9 perfect / 8 must see / 7 extremely good / 6 very\ngood / 5 good / 4 OK / 3 so-so / 2 bad / 1 don't watch it",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a psychological drama about a ballerina who tries to escape her life's imprisonment.This movie is a thrilling journey to the viewer as you start empathizing with the main character immediately.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A disturbingly twisted yet powerful movie about the drunken haze that ensues from stress and the pursuit of perfection. Black Swan is a dark poem that becomes darker by the minute. It is great film for those who are willing to piece it together after the curtain closes.",
            "review_date": "2014-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very uneven - some really powerful moment mixed with cheaper and gratuitously shocking scenes. However great performance from Natalie Portman",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't expect it to captivate me the way it did, a refreshing surprise and every minute was enjoyable.",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pay the cost to be the BOSS!",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "84%\nBizarre but effective, Black Swan is a haunting portrait of psychology and fear.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is incredible, by far her best performance. Aside from that, Black Swan is beautifully directed and gracefully passionate yet intense in its storytelling.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(only) great performance of Natalie Portman, great plot but kitsch \"mise en scène\"",
            "review_date": "2014-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky's movies are like watching nightmares, they are fucked up beyond belief",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well made dark thriller that keeps your senses ticking. Enjoyed it.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a maddening, hypnotic, psycho-sexual dream of a movie. Natalie Portman is a revelation.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Toe-curling. And not in the balletic sense.",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haunting and incredibly disturbing, this dark psychological thriller tosses you back and forth while transitioning into a perfectly poetic, yet tragic ending.",
            "review_date": "2014-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This scared the sht outa me the first time I watched it. It's nightmare materials. But it's good.",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman and milla kunis deliver in this great thriller",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...this film makes perfectly insane! True masterpiece! :-)",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is directed by Darren Aronofsky, and it stars Natalie Portman, Vincent Cassel, and Mila Kunis in a psychological thriller about Nina (Natalie Portman) who got the part as the Swan Queen in a ballet musical called Swan Lake. However, tensions start rising up when Thomas (Vincent Cassel) wants Nina to give 100 percent even though she keeps trying to do that, and also when Lily (Mila Kunis) starts showing up to ballet. I've been a fan of Darren Aronofsky's work, and I remember loving this movie, but since it's been a long time that I've watched it, I don't remember much about why I love Black Swan. When I got to watching it, now I understand why. Natalie Portman is fantastic in acting like an innocent girl that gets more and more released out of herself as the film progresses, and she's also talented in dancing too that I'm glad that she won an Oscar for it. Vincent Cassel does a good job of acting like a total d-bag that only wanted the best out of the main performer. Mila Kunis is also great in it as a bit of a seductive girl that plays it in a way that the main character feels cautious around. The score by Clint Mansell is amazing that definitely fits with the tone of the film, and the musical Swan Lake itself. The plot is really good that there are still parts of the film that were unpredictable. The writing by Andres Heinz, Mark Heyman, and John McLaughlin is very well written that creates some memorably complex characters. The direction by Darren Aronofsky is well shotted, and when it got to the ending, it was very unexpected, but it's satisfying to know where it was going that it lead to an amazing ending. Black Swan is a masterpiece that it's one of the best films of 2010.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a entertaining, but I did not like the end.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are not enough words in the English language to describe the praise Darren Aronofsky deserves for Black Swan. It was one of the most talked about and sought after films at the 2010 Toronto International Film Festival, and for good reason - it is a masterpiece that is just as much beautiful as it is nightmarish. The film not only ended up as the best film at TIFF but the best film of the year. It also went onto win lots of awards, most notabally for Natalie Portman who actually won the Oscar for best perforance by an actress in a leading role. I must admit, this is the second Darren Aronofsky film I have seen, the other being this years 'Noah' which I thought was a very flawed film. This, however, is flawless and not only has semeneted Aronofsky as an extremly talented director, not only for his impeccable visual style but for the fact that he also does a brilliant job of creating the world that these characters inhabit.\n\nThis film reminded me of all the terrible parts of my theater days. The backstabbing, the trash talking, and the two faced nature of that world is portrayed with a deft and brilliant touch. There is a constant fear that you are one mistake away from losing not only your part, but your future parts as well. You feel like you are a part of this world, that he pressure of it is part of your world.\n\nThe camera work is great and very affective. The somewhat jittery, close hand-held shots are perfect and pull you deeper into this world than may be comfortable. He has definitley shown he confidence behind the camera with this picture and it's a very finly directed piece. He too seeks perfection in his work, finding the right camera angles, the right tempo, and the right composition. This film has some incrediable camera work, thanks to the cinematography of DP Matthew Libatique, whose fluid camera movements are the glue that hold the film together. It's a very stunning film to look at, a visual treat I would say. A",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breathtaking in almost every way.",
            "review_date": "2014-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best performance by any 'actress or actor' 'dead or alive'. Natalie Portman as Nina was intense, dark 'N shady, beautiful, bold and heart taking. Its a rare movie and performance by an actor in its own.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely entertaining, sexy, thrilling, and the best dramatic thriller ever",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very dark and a little portentous- but c'mon, it's about ballet dancers and Swan Lake, what did you expect?\n\nThe film stands on the foundation of Natalie Portman's haunting transformation from beginning to end, as well as the intensely emotional direction of Aronofsky and his DP Matthew Libatique. \n\nClint Mansell delivers again with stunning renditions of Tchaikovsky's score, and the finale includes a transformation that would put many werewolves to shame.\n\nBombastic and full of itself, but it's just done so, so well.",
            "review_date": "2014-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky crafts a creepy psychological tale filled with scenes that make you squirm in your seat.  The grainy 16mm look is fitting and helps capture Portman's frantic state.",
            "review_date": "2014-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Black Swan\" is an intensively frightening psychological thriller that manages to build suspension due to its suitably melodramatic representation of its protagonist's psyche and present honest scares thanks to the convincing performance by Natalie Portman.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofosky intense direction and Portman's staggering performance as the broken Nina makes Black Swan's metaphorical, eerie and swan songs makes it all worthwhile",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is really well done by director Darren Aronofsky it could have been easy for the film to just focus on the ballet but it didn't due to superb acting from Natalie Portman, Mila Kunis and Vincent Cassel and some excellent twists throughout the film",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Neither Portman nor Aronofsky put a foot wrong in this unsettling exploration into obsession and perfectionism.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every single scratch made me cringe and every single yelp made me shudder. Darren Aronofsky truly has a way with images.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is a revelation in her Academy Award-winning performance in 'Black Swan,' but it's in Darren Aronofsky's direction that the film truly succeeds. An incredibly successful psychological thriller, the film's symmetry will absolutely blow you away.\n___\ncertainlycinema.com\nfacebook.com/certainlycinema\nInstagram: certainlycinema",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "completely and utterly unmoving, basically a dancer has a nervous breakdown.",
            "review_date": "2014-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this for the first time. Pretty good.",
            "review_date": "2014-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok but not as good as hyped.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting direction, the film itself plays out like a ballet, with the very dramatic score and general melodrama. Great use of colour symbolism - especially costume -, and good - if not obvious - use of foreshadowing - \"I'd be losing my mind\". \n\nPortman is great and Cassel is pretty good too, any decent actress could've done Kunis' performance as well as she did. \n\nThe camerawork got nauseating after a while - SO MUCH SHAKY CAM -, however, I guess it fits Nina and her 'is she insane, is she not?' characteristic, but it's probably too much for most people.\n\nThis is a really good film when you think about it, and is one worth studying.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky places us in a seat of anxiety as we become trapped, seduced and entranced by the twisted mind of the main character, Nina, played to perfection by Natalie Portman.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words to describe how I felt after watching this film. You need to watch it for yourself. Portman is the definition of brilliance.",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan isn't just your typical ballet film. It is a dark and disturbing thriller which keeps you hooked until the end.\nIt starts off slow to get going but once the plot is explained it doesn't slow down. At times, scenes have the ability to confuse you as the story consists of Portman's character losing herself mentally and fails to distinguish fiction from reality, but you soon catch up with the storyline. \nEven if you are not a fan of ballet, you can not deny that work that was put in by Natalie Portman and the crew. Performances are to perfection as such a fast speed that you find yourself hooked into them.\nSpeaking of Portman, her performance is fantastic and nothing like she usually gives the audience. Mila Kunis is also impressive, as well as the underrated Vincent Cassel. It should be worth mentioning that Winona Ryder gives out a great character in the short screen time she has.\nThe film might not be for everyone, especially with the topic of Ballet involved, but it should surely be enjoyable for anyone into dark dramas. You also can't fault the impressive work to have gone into it by the entire cast and crew.",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is simply superb in this - well earned Oscar. Incredibly engrossing you need to watch this with no distractions. No laptop, no discussion, no cooking - you probably need to hold your breath for the entire movie. The build up is subtle and clever - the finale just perfect. Amazing and bold film.",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two disturbingly sensual performances from its two femme fatale leads combined with a consistently dark atmosphere makes for a dauntingly beautiful film.",
            "review_date": "2014-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I felt it.  It was perfect.\" Nina (Natalie Portman) whispers as she closes her performance as the Swan Queen in \"Swan Lake\".  After years of dancing with technical perfection rather than emotion, Nina loses both her mind and her life in an attempt to \"feel\" her performance instead of simply \"doing\" it.  At the beginning of the film, she is a reflection of the white swan - fragile, virginal, and naïve - but by the end, she succumbs to her inner destructive self, transforming into the sinful character that is the Black Swan.\n\tBallet is a beautiful dance from an outside perspective, with its glassy smooth delicacy and intricate direction.  \"Black Swan\" gives us a portrait of the inside, one that may be over-dramatized for film, but still manages to remind us that the beauty presented to us is shallow enough to crumble right beneath our fingertips.  We find that, in the world of ballet, there is more to it than just stunning atmosphere.  There is a great deal of torture, and through Nina, we live through it in the most extreme sense.\n\tNina has been dancing her entire life - it's hard to tell if she truly loves it, or if she is forced to do it because her domineering mother (Barbara Hershey) enforces it.  She is a grown woman, yet the two live together.  At first, it appears to be a happy relationship, but once we come to notice that Nina's room is painted pink and decked out with stuffed animals, and her mother doesn't seem to have any friends of her own, it's clear that Nina is living in a twisted sort of psychological prison that seems to be even more dangerous than a real one.\n\tAt the moment, her life revolves around the local production of \"Swan Lake\".  When she dances, we can see her veins twitching as she takes every precaution needed to move with flawlessness, but there is no true heart - she is unable to let loose from her mind, which seems to be controlled by the cage of pressure that her mother locks her in.  Her instructor, Tomas (Vincent Cassell), is intrigued, both wanting to sleep with her and unlock her self-conscious mindset - also fascinated is Lily (Mila Kunis), a newbie that walks on the wild side of life.  Nina is caught in the middle of a sick game of tug-of-war, unsure if she should listen to the temptation that lies within the bodies of Lily and Tomas, or stay the helpless child her mother wants her to be.  \t\n\tIn the process, she descends into a madness that would make Ingrid Bergman in \"Gaslight\" proud.\n\tVisually, \"Black Swan\" is a triumph in combining icy beauty with utter grotesqueness, reminiscent of Dario Argento's Technicolor horror stylings in the 1970s.  There are one too many close-ups of the feet of the dancers, close-ups that are so close-up that we can hear every snap, crackle, and pop they make, which takes away the feathery lightness we originally see and replaces it with something akin to a sick sort of torture.  Portman's bone-skinny frame is a reminder that the life of a ballerina is not an easy one, rather one that requires discipline seen by few.\n\tBut the discipline shown by Portman, Kunis, and Darren Aronofsky is tremendously impressive - Portman is a knockout as Nina, capturing her transition from, as her mother would say, a sweet girl to a girl who cannot get ahold of her mind.  Portman trained for months to look and act like a ballerina, and the results are game-changing - the dedication she shows on screen is something to applaud, as she becomes a soul so tortured by everything around her that we forget that this is the same actress who made her breakthrough as a tough-talking little girl in \"Léon: The Professional\", the same actress who achieved franchise fame in the resurrection of the \"Star Wars\" series.  \n\tKunis is a perfect foil for Portman, utilizing her dark looks and magnetic personality to mirror the bad-girl personality the Black Swan possesses.  We are just as easily seduced by her as Nina is - we want to take a stroll with her on the blackened side of the spectrum, without hesitation.  And Aronofsky, who for years has made films that harness the same sort of black magic \"Black Swan\" wears on its sleeve, lets Nina's self-destruction take its time, adding a constant unsettling aura that is unshakable.\n\t\"Black Swan\" is just disturbing enough to sit with us for days, making for an operatic, melodramatic film experience that is just as stunning as \"Swan Lake\" itself.",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captivating - worth watching",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bizarre psychological horror movie. My only complaint is that not knowing what was real and what wasn't interfered with the plot.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is an insane, sexy, and very entertaining that is anchored by Natalie Portmans marvelous performance. This really is one for the books",
            "review_date": "2014-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me four years to see this movie. I was amazed by it. One of of the best dance movies and possibly movies I've ever seen. Natalie Portman suited this role well and delivered a great performance. I love that they followed the story of  \"Swan Lake\" and incorporate it into another story line. It also projects the psychological stress and physicality of Ballet and dance in general.  Portman did a great job being a 28-year-old women living with her mom but is still is portrayed a s a 12-year-old girl but slowly develops a dark side. Overall, amazing!",
            "review_date": "2014-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good plot very tragic but if you're bothered by extreme gore and oral sex this isn't for you.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was just amazing (end of review)",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman at her absolute best. This film is creepy as all get out, wildly sexy, and ultimately grotesquely unsettling.",
            "review_date": "2014-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman did a phenomenal job as her role. The film was more than enjoyable.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly excellent thriller with inspired twists aplenty! Mila Kunis delivers a breakout performance in this Aronofsky masterpiece, however, the Swan throne belongs undoubtedly to the pitch perfect efforts of Natalie Portman in a well-deserved Oscar-winning portrayal of a deprived and desperate for perfection ballerina. Bravo!",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a great movie with a great cast and Natalie Portman gives a great performance and Mila Kunis is good too.\nA (2011)",
            "review_date": "2014-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Black Swan' was a defining moment in Natalie Portman's acting career but on its own it stands as a deeply psychological and excellent twisted film.  Darren Aronofsky not only does this by constructing the tale of a trouble dancer in a prestigious company but he also accentuates Nina Sayers' (Portman) psychosis with his chilling visual style.  This film really is not for the faint-hearted and there are moments where it will make you cringe, even if it is about rehearsing for \"Swan Lake,\" the beloved Tchaikovsky ballet.  Portman is great here and she really does take you down a troubled path.  She is innocent as Nina/White Swan but shows her aggressive/troubled side when playing the Black Swan.  Mila Kunis also makes an effective appearance as Lilly, who serves as a rival to Nina.  Visually entrancing yet disturbing, artful yet morbid, 'Black Swan' is a really good step for Aronofsky.",
            "review_date": "2014-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laid bare, broken, faced with her darkest self, then murdering inhibition, Natalie Portman masters this experience.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Nina was searching for perfection, the film found it. A wonderful picture with the fantastic acting skills of Natalie Portman.",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Beautiful (with a capital B) and tragic. Like the story of Swan lake",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been waiting to get around to watching this film for quite a long time, and what I finally saw was ultimately amazing! For me I would defiantly have to say that Natalie Portmans performance as Nina was the highlight of the entire film. She really is perfect in her role, and defiantly the Best Actress Oscar that she won for this movie. The other leads in this movie I thought were also very superb. The actual story itself here is also very interesting with one about transformation and how much it really takes to be professional. I would honestly tell anyone that this movie is a MUST see!!",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply devastating. The final act will leave you breathless!",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh this movie is one of my favorite movies of all time.  Its one of those movies that nails every single aspect in it, the score and the acting is just out of this world and I would dare to say that this movie is Daronofsky's best.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It messes with your head, the idea of perfection. It's quite intense, a film on the toes of Natalie Portman who channels her inner Black Swan.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A friend's recommendation. I'm so glad she recommended me to watch this. The movie follows Nina, a very hard-working and dedicated ballerina with a dream to be perfect and the best at what she does. Just in time as one of the best ballerinas in her studio is retiring, she gets a part as the Swan Queen in a new version of Swan Lake where she will have to play both the White and the Black Swan. The 'director' (I guess that's what you call him) thinks Nina is perfect for the White Swan, but that she needs to work a lot more if she wants to be perfect as both. The whole movie is basically Nina trying to accept her dark and mature side, the Black Swan. I won't spoil the ending, but it was very fitting and emotional. The acting was brilliant! Everyone, even Mila Kunis, did a great job portraying their characters. I do have to point out Natalie Portman's performance as she was amazing as Nina! The characters, on the other hand, are a bit unlikeable. I didn't find myself actually caring for any of the characters. The cinematography and the special effects used to make the Black Swan transformations were epic. The movie looks and feels dark and disturbing. While I still much more prefer Aronofsky's older movies (Pi, Requiem for a Dream), this movie was still brilliant and I highly recommend it!",
            "review_date": "2014-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A parody of Natalie Portman parodying herself.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie made me fall in love with Darren Aronofsky. I mean just wow.",
            "review_date": "2014-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a movie that isn't sure what it wants to be, but is competent enough to entertain on a thriller level, and character development is very well done.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creepy movie but really good",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who enters this film believing it to be a 'feminine film' will be proven dead wrong. \"Black Swan\" is one of those films that successfully dives into the tragedy of schizophrenia as well as the harshness that is the world of ballet. With Portman constantly being told to be perfect, her mental state slowly deteriorates into a truly haunting persona that is the Swan Queen. Aronofsky's attention to the subtleties that make this a truly haunting tale is the closest I have seen to a true Kubrick-ian film since Kubrick's passing. That is what horror and suspense is to me. It's not about jump-scares and gore. It's about the build up of tension and the little details. A film that needs to be watched more than once.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant & Awesome & Harvard Educated & The Professional Alice & Vendetta & Walmart baby Daughter Susan Dead Man Walking Sarandon Portman!!",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film, really gripping and quite freaky/scary sometimes- but it all fit. One of Natalie Portman's best!",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"It's my turn!\" Epic!!",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan (2010) - 8\n\nGood movie.\nGreat acting by Natalie Portman, competent directing.... I was expecting more from this movie but can't point any flaw, I feel that a slightly different and more interesting route could have been followed... It's fully exploited by a literal interpretation of moving pictures, does not lead to deeper thinking, no second meaning. It tries to grab the attention of the viewer and pull off some emotional reactions here and there in a simple and linear manner... does what's supposed to do I guess.... Entertaining while it lasted and managed to take a few emotional reactions from me but in the end I feel there's nothing special here and I'll eventually forget it.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is outstanding in this uneven, perfectly directed movie. Amazing cinematography.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wasn't able to finish watch this movie b/c it was scary. LOL",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically beyond reproach- Black Swan is a master class of psychological horror & melodrama. My original viewing was with my family on Christmas in 2010...you can guess how that went. In reality, though, this is a bold film pulled along by confident, meticulous direction, shocking/intricate imagery, and an incredible lead performance. In fact, her character arc is one of the most extreme yet believable in cinematic history, cementing Portman as an actress of the very highest caliber, and perhaps the best of her generation.",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breathtakingly beautiful and an absolute Must see!",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that leaves you breathless until its terrific final act.",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some disturbing scenes, but loved every minute of it.",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Portman deserved the Oscar like no other for this terrifying turn into madness",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman shines in this role as she develops from and insecure ballerina to the Insidious Black Swan. This movie will chill you to the very bone with it's dark beauty.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark fantasy tale that is both terrifying an darkly entrancing",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a fan of ballet at all so I was at first turned away from watching Black Swan but when I finally got round to watching it, two words: Blown away. This is an absolute masterpiece, unlike anything I've ever seen. It's wildly unpredictable, searingly intimate, shocking and terrifying and one of my all time favourite movies. Black Swan focuses on a dancer called Nina, whose psyche becomes corrupt as she undertakes the role of the black swan which takes over her life, taking her on an intense descent to a dark side that threatens to consume her. Natalie Portman's dedication to the role shows, her innocence is shattered as the Swan Lake show comes closer, and the way she changes from sweet girl to a frighteningly perfect incarnation of the Black Swan is incredible to watch. Barbara Hershey is amazing as Nina's over protective and zealous mother, Hershey is overbearing in such a pitch perfect way that she's actually terrifying, and Mila Kunis is a revelation as Nina's competition Lily. Surprisingly scary, intelligent and constantly atmospheric, Black Swan is one intense film with perfect scores in every department.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "72%\nThis film has never been a favourite of mine, but I like this for the performances of Natalie Portman and Mila Kunis. and Darren Aronofsky's direction was alright, but he was visually less impressive this time around.",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was afraid to watch it and now am afraid that i watched it! splendid! my heart was racing and escaping beats! Oscar performance without a doubt!",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great, simple masterpice from director Darren Aronofsky and a crazy as hell performance by Natalie Portman. An astounding piece of work.",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A haunting character study of one ballerina's descent into madness, Darren Aronofsky's Black Swan is anchored by its chilling visual flair and its absolutely stunning lead performance from Natalie Portman.",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with an abrupt conclusion this horror/drama of a film is incredibly dark, impressively directed, and boldly acted",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time!",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman ascends the scale of great actresses as she gives the best performance I've ever seen her in, and is accompanied by a story that plays on the mind during viewing and will twist your thoughts and perceptions of reality throughout. Even though I guessed the plot line for the finale of the film halfway through, it is still an incredibly clever and well-thought out concept that has been brought to life in an astonishing way, and I applaud Darren Aronofsky for his work in making this happen.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As this movie is classified as a psychological thriller, I just chose this undoubtedly after watching the flick 'The Machinist' which is on the other hand was a great psychological thriller. But the problem with Black Swan is that, the actual psychological effects does only come in effect lot late than expected and the ballet dances were indeed portrayed more rather than giving a glimpse of psychological situation which should be the main point of this genre. But couldn't complain about the plot as its beautifully crafted and the ballet sequences were done well and Natalie Portman did executed it wisely. But just wished those final thrill moments had a little bit effect or connected to the starting moments of the movie.",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That guy tried to grab her tits but she had no tits - that was the problem!",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disturbing, beautiful, and haunting all at once.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not even sure what to say about this movie.  It's awesome.  And it fits quite well into the Aronofsky canon as one of those depressing psychological dramas.  It is, however, hardly a horror film.  So don't watch it for scares.  It's a bit deeper and more disturbing than that.  It's a character sketch of innocence as it slowly becomes tainted, and, ultimately, overcome by darkness.  There's a few layers to this film, and demonstrates why Aronofsky is such a genius.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From Darren Aronofsky, the same director as The Wrestler, I expected this film to be an expose on the dark side of the ballet industry.  But Black Swan is a old school gothic horror film in new clothing.  Despite some interesting filming techniques, the plot and characters aren't engaging because the line between fantasy and reality are so blurred you can't invest in any of it.",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overblown, preposterous, yet an extra star for the humour which keeps it interesting.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Continuing my roast of Darren Aronofsky, we have Black Swan. This movie has become famous (or infamous) for its weird, surreal look inside the mind of a prima ballerina, and for a lesbian sex scene between Mila Kunis and Natalie Portman precisely 69 minutes into the movie. Yeah, I bet that was a coincidence. Anyway, although this movie has gotten widespread acclaim for its supposedly \"haunting\" visuals, it's really not that scary nor intelligent. All it does is show the audience a bunch of weirdly shot scenes, coupled with some spooky atmospherics, and expects the audience to read some meaning or emotion into it, despite the fact that the proceedings are incredibly vapid.\r\n\r\nBlack Swan's greatest asset (and the thing that sets it apart from other Aronofsky fails) is Natalie Portman, who proves herself to be a legitimately good actress here. She has great panicked facial expressions, delivers the lines with just the right amount of uncertainty and caution, and is all-around very likable. However, this is just because she's Natalie Portman, and she'll be likable in anything (except when her hair is a corkscrew and she's saying shit like \"I will not condone a course of action that will lead to war\"). The character herself is given very little to actually connect with the audience with, and Portman basically just rides her charm as best as she can. That is all that can really be done with a script as deliberately weird and shallow as this one. The movie focuses far more on developing a weird series of events than actually delving into the tortured main character, making this whole psychosexual freakout far less engaging than it should be.\r\n\r\nA lot of this movie makes no sense-- and no, not because I didn't understand it. Because Aronofsky throws completely random scenes in that have absolutely no bearing on the story. Some guy on the subway made a lewd gesture at Natalie Portman. Okay... cool. Why do we care? And when it comes down to it, her whole obsession with Mila Kunis's character is chaotic and makes no sense. There is very little intelligence in this movie, but it does have a lot of emotion, which I can't completely write off. But there is a totally random lesbian scene between Kunis and Portman. Not complaining... but why? It's totally random within the context of the story. Sure, Portman is becoming obsessed with her. We get that. But why would it manifest itself this way? Sexual tension, I suppose? The reasoning behind Portman's hallucinations is left open-ended far too many times for them to hold water.\r\n\r\nAs always, Aronofsky is a master at creating vivid and unnerving imagery, but he puts far too much effort into concocting the nightmarish world of the movie than actually putting some effort into its substance. There are some truly chilling shots, namely one in which Portman's reflection moves out of sync with her, and another in which she sprouts swan wings. But her whole \"transformation\" verges too far on the silly side sometimes. The scene where her legs buckle into the shape of a swan's legs is weird, but could also elicit some chuckles from the audience, mainly because the ludicrousness of the premise has caught up with the film's self-importance. Weirdness will only get you so far, but just being creepy for the sake of creepiness does not signify depth or meaning. It just means that you've made a somewhat above-average, soft horror movie masquerading as a psychological thriller.\r\n\r\nFinal Score for Black Swan: 5/10 stars. This film is actually not that bad, and certainly the most inherently watchable of the Aronofsky films I've seen. It has some very good qualities to it, and several scenes that actually start to approach the level of genius that Aronofsky thinks he possesses. Sadly though, the film is inevitably weighed down by a generic script, bland characterization, a pointlessly weird plot, and (of course) a sense of self-importance that forces the audience to put up with some exceedingly pretentious sequences. I'd love to give this a higher score, as I actually enjoyed watching it (no Cutler, not just the lesbian scene, we are not all pervs like you), but I understand that it's still not a very good film. It's just a mediocre exercise in atmospherics over story, and although the visuals (coupled with Natalie Portman's powerful performance) are worth seeing it for, it doesn't hold a candle to the other psychological thrillers it so desperately wants to imitate.",
            "review_date": "2014-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well not really sure what i made of this. Couldn't work out what was real and what wasn't and then it ended leaving me a little confused.  Plus I'm not really a fan of ballet so wasn't hugely entertaining.  However it was very well acted and produced it just didn't work for me",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the scariest movies I've ever seen.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't until the end that it really shone.",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has to the best psychological thriller ballet movie ever excellent performance of Natalie Portman and Oscar worthy award for Best Actress.",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great Darren Arronofsky directs this technical masterpiece, that is expertly produced and acted. Natalie Portman and Mila Kunis both deliver one of their best performances to date. The atmosphere is almost always spot on, and that is mainly attributed to the fantastic use of renditions of classical pieces as a score. The film takes some risky direction choices towards the end, some of which work and others not so much, but overall the film succeeds at making the viewer bleed into the psyche of this fragile and cracking mind. 4/5. Excellent",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense and even distressing story of a woman being driven to madness, 'Black Swan' features an incredible lead performance from Natalie Portman and is up there with director Darren Aronofsky's best work.",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is such an overrated movie! I don't understand the hype surrounding this film; it's really nothing to write home about. Black Swan is probably in my list of top 10 overrated movies. Black Swan is about a prima ballerina, Nina Sayer (played by Natalie Portman) whose biggest ambition is to get the lead role of both the black and white swan in Swan Lake. However she faces competition against Lily (Mila Kunis) who brings out Nina's dark side. At least one good thing about the film is that it portrays the harsh ballet industry and the drive for perfection. Nina strives to be perfect and devotes herself to ballet completely, but the pressure drives her insane to the point she self harms and throws up.\r\n\r\nHowever this really isn't my kind of film at all. I just found it too bleak and depressing and void of emotion. I just felt that I didn't connect with the film, I felt distant. I found Natalie Portman a little wooden, even though she's meant to be really frigid in her role as Nina who is really reserved and under the thumb of her controlling mother Erica (Barbara Hershey). Mila Kunis however was really outstanding; she's always so full of energy and sparkle. She really has such great presence; Mila Kunis is really a great actress much better than overrated Natalie Portman. Barbara Hershey was really strong too and portrayed the role as Nina's overbearing mother really well. Vincent Cassel is also really good as Nina's ballet coach, Thomas Leroy who tries to seduce her as he does to many of the girls. It shows than in those type of industries that shagging the boss is the way to go. One of Leroy's former students and prodigees Beth (Winona Ryder) is bitter that he discarded her and made her end her ballet career and tells Nina to \"enjoy it whilst it lasts.\" Winona Ryder was surprisingly really good in her role, I never had her down as a good actress.\r\n\r\nEven though the acting was good I just didn't really like the story. I just felt like it tried to portray too many meanings to the audience but actually lacked substance. A lot of it I found really confusing and it just leaves the audience guessing all the time; did she imagine that or was it real? It is suggested in the film that Nina is schizophrenic as she hallucinates a lot of the time. I do think that the film does portray mental illness really well though. I found some of the scenes a bit too disturbing. I remember seeing it in the cinema and it was much worse on the big screen; I had to cover my eyes through most of it. I saw this again this evening as it was on telly and I thought maybe I'd change my opinion as I last saw it like 3 years ago. I just found Black Swan too dark and dreary to sit through. I also felt the film tried too hard as well to convey some sort of meaning and be clever, but it's all been done before. I'm not a fan of ballet either if I'm being honest and plus I hate swans, they freak me out. If you like dark psychological thrillers/horrors or anything with Natalie Portman, you'll enjoy this. It's not a terrible film, but not my cup of tea. Then again each to their own, I just tend not to like overrated movies.\r\n\r\nGrade: C-/D+",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was actually a pretty good artistic, dark, metaphoric melodrama thriller, though not so subtle. Not a fan of ballet, nor do I really understand it, but I kind of enjoyed this.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strange film, but a well acted and directed one, too.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this film was phenomenal. The concept and direction was outstanding along with class acting from all stars, especially Natalie Portman who thoroughly deserved the oscar for her role as Nina, which she played perfectly. Black Swan had me hooked right from the beginning with its intensity and darkness. I highly recommend this film as it is brutal yet beautiful, that will leave you with chills right the way through. Absolutely unmissable. Black Swan is pure genius.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a true masterpiece.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw and it's really overrated.  Not sure why so many thought this was good.  Portman goes insane as she's chosen to be the lead role in the swan play.",
            "review_date": "2014-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't quite disturbed as I was uncomfortable - certain parts were hard to watch, but that's the point. A well made movie.",
            "review_date": "2014-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Araonofsky's Black Swan is a brilliant physiological thriller, that is shot magnificently and acted to perfection, thanks to Mila Kunis and Natalie Portman. Whilst the colour palette is dull, and the locations uninteresting, Black Swan deserves to be hailed as one of the greats in it's genre.",
            "review_date": "2014-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flawless performance by Portman in depicting her demise chasing the need to become the Black swan",
            "review_date": "2014-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*THE OFFICIAL BETTER THAN JUNO SEAL*\n\nWell, Natalie Portman took some advice from Christian Bale.  She lost 20 pounds and learned a few dance moves just to get this role.  Too bad she wasted he time, in my opinion.  Black Swan is directed by Darren Aronofsky, who did the atrocious Pi.  I have yet to decide whether that film was worse than Juno or not.  Yeah, it's that bad.  However, being the generous guy I am, I gave Aronofsky another shot with the Wrestler, and that film didn't disappoint.  It was a rather dark take on professional wrestling and it didn't try to add any weird special effects.  It was a pure drama.  Unfortunately, Darren went back to his roots with Black Swan.  If this were a simple random look at the stress of ballerinas, this film could have been great.  However, it goes for \"creepy\" visuals.  What a shame Aronofsky!  I liked the Wrestler.\n\nBlack Swan is about the tale of a ballerina (Natalie Portman), who is driven insane by all the things around her.  Her mother is stressing her to become a better ballerina.  And as soon as there is an opening spot in the new play Swan Lake, Nina has a shot.  However, she has competition as well in another ballerina (Mila Kunis).  In order to get the role, you have to be both innocent (Portman) and vicious (Kunis).  It soon leads to Nina going nuts and becoming twisted.  The cast, besides Winona Ryder, Mila Kunis, and Portman, are all no-names.  It's not like the no names can't act, but.....yeah, they can't act.\n\nThe point of the film is to shock and see what's inside the mind of Portman's character, but it fails on both accounts.  Yeah, Portman does see some \"creepy\" imagery, but it holds no weight because it's just so laughably acted and handled.  The little shocking moments left me straight face.  I didn't go \"OH MY GOD!\" like Aronofsky wanted the audience to do.  Portman's \"complex\" character is really one-note.  I was completely uninterested in her and for a moment, I literally forgot she was the main character.  Mila Kunis is a terrible actress, who made it in Hollywood cause of her good looks (Dare you to see her without makeup.  It's scary).  Here, she drives this point straight to the ground.  Throughout the entire film, all I saw was Meg (Family Guy) speaking.  She couldn't have changed her voice in the slightest?  She has this annoying voice that makes my ears bleed.  What was the casting director thinking?\n\nThen, there's the fact that the first 40-50 minutes of this film actually have no substance.  Matter of fact, the script is yet another hollow, boring, pretentious piece of garbage (Notice that I didn't cuss).  We were supposed to see how dark Portman's character was and feel for her.  However, she (as mentioned in paragraph 2) is just boring.  It doesn't help that she played the role exactly as how I said it.  Also, there is a classic mistake of underusing Winona Ryder.  It's also a melodrama.  I honestly don't understand what this movie was trying to be: a psychological thriller or a melodrama!  It leaves off on of those for the other.  Then, it comes back to the other.  It really makes me wonder whether that was the point or not.  However, when you go from trying to scare us to trying to make us feel sympathetic towards the character, it doesn't work.\n\nOverall, Aronofsky, you have disappointed me, again!  Whereas the Wrestler wasn't trying to be some creepy, edgy horror/drama, this film does.  It's basically Pi times 10 with ecstacy, only that ecstacy turns out to be poison.  It does nothing new, follows some cliches in the genre, and very pretentious.  It believed it was of some higher being that most other psychological thrillers yet it fails.  Oh, and like most, it attempted to confuse us with many scenes, but all those scenes only hurt the plot flow, making this film literally confusing.....on purpose.  The reason why it gets the better than Juno seal is very simple.  There's a nice lesbian scene thrown it, even though it holds no significance to the plot.  \n\n1/10",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More tailored to my tastes than I thought it ever could be. Mad and Brilliant",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Magnificent acting performance by Natalie Portman.  The tension, the fear, the stress, the anger, ... it grabs you by the throat.",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to Darren's great directing, and Natalie's realistic acting, this movie is so impressive movie.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest I don't know what I think of this movie. I like the psychological aspect of the movie. I like the acting yet.. well hm.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mature, graphic and also beautiful film which is more than intense. It also dives into the theme of insanity and pushing beyond the psychological limit. It is far from a pleasant watch, but it is still haunting, thought-provoking and well written, directed and acted. Especially Mila Kunis shines in this picture. \n\nThe film also takes a lot of twists and more than once keeps you guessing without getting a definitive answer.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really wasn't was I was expecting. Hard to explain how, but it's creepy as Hell, and highly recommended for fans of horror and psychological stuff.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nina's descent into madness is an engaging and haunting one. Its so well written and well directed, and everything comes together beautifully in the end. The dance choreography is beautifully put together, and Portman's commitment to that part of the role as well as her commitment to the character attests to her as an actress. The imagery is so visceral and the pacing adds to the atmosphere. Seeing how each of the principle supporting characters have their role in Nina's fall from sanity is so interesting and entertaining. The way Nina is portrayed is not only well developed enough to allow us to sympathize with her, but enough to feel like we're on this journey with her. That's the movie's strength, you're not just watching as this girl is being driven insane, you're on the journey with her, you feel like the world she's creating in her mind is real just like she does. THATS how well put together it is. I got so attached to this movie that my jaw dropped several times while watching this. If I have any complaint, I guess it would be that some of the camerawork is distracting, but this is just a nitpick. Other than that, bravo and bravo. \n9.6 out of 10",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is amazing you have to see it, Natalie Portman is my favourite actress and this film demonstrates why.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Psycho-sexual thriller is a good describer. Well done in most, if not all, aspects. Natalie, you have redeemed your performance in Star Wars, but that was due to playing off of Mr.  Christensen anyway.\n\nI'm interested in seeing \"Noah\" from this director's hands...",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very different freaky movie!wow!almost makes ya think Stephan king wrote the movie!",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the acting was good, was just too weird.",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an almost perfect depiction of the struggle of jealousy and desperation in the world of performing arts. Beautiful, shocking, and smart.",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting and provocative.",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply psychological film that is expertly presented through the intense setting of a ballet group, but the fact we get deep under the skin of Natalie Portman's paranoia in itself provides the movies depth.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exhilarating ride through art at it's most intense, melodramatic, and terrifying ever yet, and while it's viscerally harrowing images are startling, it's a movie that stays beautiful at all times thanks an enchanting score and a passionate transformation of Natalie Portman's Oscar winning (and well deserved) leading performance.",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cannot stop watching this piece of art. A masterpiece with a great acting performance of Natalie Portman and an exquisite work from the art direction.",
            "review_date": "2013-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow very dark. Didn't expect Winona Ryder to be in it.  didn't like the bone crunching, peeling off skin scenes...  Am Bit squeamish. Nevertheless a good drama. I remember Barbara Hershey from the film \"beaches\"... Her role in black swan was ok...she looks freaky and a bit of a control freak at first to me.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm actually amazed that this film would turn out this well. Why is this is good movie? Because it literally shatters your expectations of it as soon as you watch it. The characters have a level of life and flavour to them that makes you love or hate them. Either way, your emotions are stimulated. The story works very well, because it's littered with symbolism, and is basically a concoction of dark themes. One thing I've noticed is that the two most common themes are self-harm (the main character apparently having damaged her own body) and the pressure to succeed (where else could her hallucinations be coming from?). Whatever it is, it's a source of genuine horror, not like the fake horror you find in today's horror movies. Yes, even though it's technically a psychological thriller, I consider it a psychological horror movie because what you see is quite striking. Overall, it's really a brilliant example of horror done right, but it's the kind of film that after seeing it once, I wouldn't be too keen on seeing another time, just because I wouldn't like the idea of going through all that again. On the other hand, there is some real artistry in this film, and perhaps the repulsion is proof of its power.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely a cool movie to watch, but it falls flat from what the critics were making out to be. It left me wanting more but never receiving it.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman is brilliant in this film.",
            "review_date": "2013-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Fav movie of 2010 :D\nNatalie Portman played so damn well here. 6 Starts :P",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too cringe-inducing to enjoy.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is a twisted and complicated thriller which is full of thrills and skilled direction from Darren Aronofsky, but above all a magnificent performance from Natalie Portman and great supporting roles from Mila Kunis and Winona Ryder which assist the clever storytelling in developing.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot/Summary\nA psychological thriller set in the world of New York City ballet, BLACK SWAN stars Natalie Portman as Nina, a featured dancer who finds herself locked in a web of competitive intrigue with a new rival at the company (Mila Kunis). A Fox Searchlight Pictures release by visionary director Darren Aronofsky (THE WRESTLER), BLACK SWAN takes a thrilling and at times terrifying journey through the psyche of a young ballerina whose starring role as the duplicitous swan queen turns out to be a part for which she becomes frighteningly perfect. BLACK SWAN follows the story of Nina (Portman), a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica (Barbara Hershey) who zealously supports her daughter,s professional ambition. When artistic director Thomas Leroy (Vincent Cassel) decides to replace prima ballerina Beth MacIntyre (Winona Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side with a recklessness that threatens to destroy her. -- (C) Official Site\nMy Review\nA sumptuous, exhilarating and disturbing examination of the thin line between genius and madness and the lengths to which an artist will go to achieve perfection, Black Swan cements Darren Aronofsky's place as one of the most important filmmakers working in cinema today.\n\nSomething of a companion piece to his last release - The Wrestler - the film substitutes backwater wrestling rings for the New York ballet and the suplex for the pirouette, but retains the sense of desperation felt by the main character in their chosen profession.\n\n\n\n\nIn this case, that character is Nina, an ambitious dancer determined to win the lead role in a forthcoming reinvention of Swan Lake. But while her innocence and frailty make Nina favourite to play the white swan, those same traits make her a less likely candidate to play the flip-side of that character, the titular black swan.\n\nThe company's artistic director Thomas teases and goads her into unlocking that dark side, bullying Nina to stir her anger and making sexual advances that bring out her sensuality.\n\nShe duly wins the role, but Nina's efforts to craft the perfect performance see her losing herself in the part, fantasy and reality merging to create terrifying hallucinations that begin to threaten her sanity.\n\nMatters aren't helped by the arrival of Lily - a sexually uninhibited dancer from San Francisco who is the polar opposite to Nina, and who may or may not have designs on her role.\n\nTeetering on the edge of madness, lust, paranoia, frustration, and jealousy build as the pressure on Nina intensifies, culminating in a stunning finale which takes place on opening night, when the world is finally introduced to her black swan, and when all her worst fears are realised.\n\n\nMore Black Swan Videos\n\n\nIt's a flamboyant, grandstanding finale, Aronofsky creating a breathless waking nightmare that's as powerful and affecting as anything he has previously shot; high praise indeed when you consider what he achieved with Requiem for a Dream.\n\nIndeed everyone seems to be at the top of their game on this one. Cinematographer Matthew Libatique shoots proceedings with a real sense of urgency, brilliantly bringing out Nina's confused duality through a clever use of mirrors, and creating a genuine sense of claustrophobia by liberally employing the close-up.\n\nArt direction is similarly stunning, the colour scheme an effective combination of blacks, whites and greys, apart from the child-like Nina's bedroom, which is variations of pink.\n\nAnd long-time Aronofsky collaborator Clint Mansell hits one out of the park again with the score, taking Tchaikovsky's music and turning it into something quite disturbing. Credit should similarly go to the sound team's work with breaking bones and tearing skin; noises which perfectly complement the body-horror appearing on screen.\n\nIt's a slightly different tale in terms of performance however. Vincent Cassel has fun as the sexual predator Thomas, and while it feels like we've seen his character many times before, he's never less than watchable on screen.\n\n\n\n\nMila Kunis also seems to be enjoying herself as Lily, black swan to Nina's white. Her role is somewhat underwritten, but she certainly makes an impression, no-more-so than in the much-talked-about lesbian romp, the film's most low-brow, high-trash moment.\n\nBarbara Hershey fares less well as Nina's mother, the ultimate pushy parent. Initially intriguing, living out her dreams through her daughter and overprotective to the point that she even dresses her, Hershey's characterisation quickly turns into caricature, too over-the-top even for a movie this manic.\n\nBut Black Swan is Natalie Portman's film, and she delivers the performance of her career as Nina. It's no surprise that the camera loves her, but this may be her most subtle and nuanced work yet, perfectly capturing Nina's physical and mental meltdown.\n\nIt's a performance that burns with intensity, one that anchors the film in reality when it threatens to slip into melodrama, and one that will doubtless be rewarded come awards season in the same way that Mickey Rourke cleaned up with The Wrestler two years ago.\n\nCombined with Aronofsky's brilliance behind the camera, the result is a stunning assault on the senses that defies convention - an art film masquerading as horror; a Giallo with Best Picture aspirations.\n\nAnd if the first hour is an entertaining-if-hardly-groundbreaking examination of the struggle for perfection in art, it's elevated by the final half-hour, an astounding sequence that has to be seen to be believed; cinema of the very purest form that is, in-its-own way, pretty much perfect which is why I give Black Swan a 4.5 out of 5.",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you like a drama, thriller genre, this movie is a masterpiece of this era i think. stunning with huge and shocking twist. very good climax and performances by Mila Kunis and Natalie Portman. recommend movie if you love the genre.",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black Swan is perfect. Scary, Funny, Smart, Beautiful, Delicate. Portman played an impossible role, now she has done the impossible.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow stunnning. brilliant. what a movie.......i have just seen this movie 4 the 1st time n think that this is a brilliant movie 2 watch......its got a good cast of actors/actressess throughout this movie......i think that natalie portman, mila kunis (from the brilliant tv series family guy/ that 70s show), vincent cassel, barbara hershey, winona ryder, benjamin millepied, sebastian stan, toby hemingway, play good roles/parts throughout this movie.......i think that the director of this drama/mystery/suspense movie had done a great job of directing this movie because you never know what 2 expect throughout this movie......i think that this is a really well directed movie 2 watch.....its got good special effects throughout this movie......i think that natalie portman was brilliant throughout this movie......i think that this is such a really well written/directed/acted movie 2 watch.......its got a good soundtrack throughout this movie....i think that this is such a really well directed movie 2 watch its got a good soundtrack throughout this movie.....i think that this is such a really well directed movie i think that mila kunis was brilliant throughout this movie......i think that this is such a great movie 2 watch its got a good cast throughout this movie......i think that vincent cassel was brilliant throughout this movie i think that this is such a brilliant movie 2 watch it is so really well directed movie 2 watch its got a great cast throughout this movie.......i think that winona ryder was brilliant throughout this movie i think that this is such a brilliant movie 2 watch for 2010 its such a brilliant movie 2 watch its so really well directed its a brilliant movie 2 watch for 2010 with a great cast throughout this movie its got a good soundtrack throughout this movie its got a good special effects thorughout this movie i think that this is a brilliant movie 2 watch its a great movie for 2010 with a good cast thoruhgout this movie",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am going to reveal that there is something lacking in me.  I found the movie ugly and unpleasant.  Not only did I not get it but I couldn't even tell what it was I wasn't getting.  All I figured out is Portman is probably crazy but I'm not even sure of that.  The critical reviews tell me this movie has worth but  I'll be darned if know what it is.  Not recommended for those who lack a certain subtlety in their thinking.  Wish I knew what that subtlety is.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, psycologically amusing and very honest in the artistic matter, and Natalie Portman has a performance that never hesitates.",
            "review_date": "2013-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected a much better finish given the hype.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rather entertaining and well made movie",
            "review_date": "2013-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mental breakdowns can affect physical health.  Since no one else is really in your mind,  only you know for sure -possibly.  Beautifully shot, well paced, and insanely well cast.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "aughhh, the scratching!",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome story and really well acting  plus a shocking ending :)",
            "review_date": "2013-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so overrated and full of clichés",
            "review_date": "2013-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman stars in one of the most profoundly twisted \"psychological horrors\" in recent years (quotations implying that the film really has no specific genre), Black Swan has enough nightmarish sequences to have the ability to make the user feel as if they're in Portman's characters' ballet shoes.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure if anyone else caught this, but that Nina girl was a little unstable.",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aronofsky's Film Full Of Mystery & Thriller ... Natalie Portman Had Reached Her Best and Deserve Her Oscar For This Leading Role ... The Cinematography Is Really Interesting In This Movie.",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh.  Mostly I just found it weird. Had some fairly powerful parts to it, but to \"mysterious\" for my tastes.  I like movies where they make it clear whether or not she has a psychological disorder.",
            "review_date": "2013-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a natalie portman fan, but it's watchable and her performance was just impressing",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptionally dark, creepy, and eerie. Another masterpiece for Aronofsky, and Natalie Portman's finest performance.",
            "review_date": "2013-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first moment I watched this movie, I didn't know that this is a psychological thriller and horror film. Until Natalie bring Nina a deep and unstable character. Her dance was beautiful. I like when she turn into a Sensual Black Swan and I absolutely love when Nina did a famous 32 fouettés en tournant. Awesome!!!!!!!!!!!!!!!!!!",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman's performance is way beyond amazing! I seldom enjoy a one man show but I loved every moment of this one! \nBeautiful.. capturing.. and thrilling indeed",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And now to the movie. I honestly can't say I liked it as a whole because I didn't. Personally, I found it to be a little underwhelming but I guess I have all the hype surrounding it to thank for that. This is certainly a companion piece to Aronofsky's last film, The Wrestler, in that it unflinchingly presents the toils and rigors of a profession not too well known by today's masses. In both films it seems that in order to achieve desired effects and results one must primarily undergo extreme physical pain and bodily deformities that are hidden by costumes and not seen by audiences. Split fingernails, bruises, broken bones, steroids, bulimia, fucking your boss,  you name it, wrestlers and ballerinas will do it. I'm pretty sure you'd have to be a little nuts just to attempt doing either one on a professional level. Both professions are dog eat dog and just the psychological toll to get to the top and stay on top alone must be exhausting and I can see why it would make for interesting material for a movie. Such was the case with The Wrestler  and now presently the case with Black Swan. I deeply commend Aronofsky for not shying away from showing us some of what it apparently takes to be a professional ballerina although let us not forget the important fact that all films are nothing more than artifice so we must treat the physical deformities shown in Black Swan as such even if they do appear to scream a very brutal truth at our eyes and ears.\n\n\n   Moving on, as far as the characters were concerned, minus Natalie Portman's character Nina, I at first felt that all of them were very cardboard and one dimensional. That is until it was pointed out to me that the entire film is shown from Nina's perspective. That changed things up a bit. You see, Nina is a ballerina chasing after perfection. Dancing is her life. She is so focused on getting every little detail of every move right that she never spends time with other people. Her best friend is her mother. Her perception of her dancing comrades and teachers barely scratches the surface of who most of them are as people outside the studio. So they are more or less portrayed as such in the film. However despite that I also found them to be more or less cliched. Vincent Cassel plays Thomas Leroy, the head of the studio and a womanizing prick that reminded me of the previous characters he portrayed in Oceans 12 and Eastern Promises. He better be careful or he could become type cast for life. Barbara Hershey does her best to play Nina's overbearing and overprotective mother Erica but at times I couldn't help thinking of her performance as just a tame (thats right, tame) version of Faye Dunaway in Mommie Dearest. Mila Kunis plays Lily, the Black Swan to Nina's white. She is a bold, confident whore of a dancer from the West Coast and it seems Mila Kunis's performance was only effortless because she had effectively played this type of character for so many a year previously on the TV series That 70's Show. As for Winona Ryder, well, I honestly can't say why she was in the film at all, her character felt so lame and pointless. She has fallen a long way from her Edward Scissorhands days and now it seems she has resigned herself to taking a backseat to today's younger talent, ironically a lot like her character in the film.This film however belongs to Natalie Portman and its her show. Her portrayal of Nina I thought was so convincing and so well done that for her not to win Best Actress at the Oscars this year would be sacrilegious. I certainly felt for her and all that she went through in the film and that is a testament to Portmans acting.\n\n\n   As I said earlier Nina is a ballerina who lives alone with her overbearing/ protective mother. She is chosen to portray the coveted dual role of the White and Black Swans in an upcoming production of Swan Lake. However it appears Nina is so uptight, so perfectly innocent that she cannot emotionally free herself enough to also portray the dark, sensuous Black Swan. The pressure to achieve this combined with Nina's paranoia that Lily is trying to steal her role from her drives Nina over the edge and over the course of the film she realistically hallucinates she is painfully transforming more and more into a swan as she tries to free up the darker side of her personality. Repressed sexuality is definitely a major theme of the film and Nina's certainly gets really, really unleashed in a long night sequence I consider the low point of the film where Nina is seduced by Lily into going to a bar and picks up a couple boys and dance and screw them and others while being drugged up. Lily and Nina then proceed to go back to Nina's apartment and have sex in a scene that seemed to me straight out of a gay porno. More than anything  I can say I was offended by the apparent message that in order to live a little you have to essentially become white trash. But from this point on though the film becomes better and better. I personally thought the last third  was nothing short of an absolute tour de force in all areas. The dance sequences were extraordinarily breathtaking and the shot where Nina imagines she has grown feathers all over her body and stands before the audience in her final pose were some of the most beautiful frames of film produced this year.\n\n\n  A few last notes. The images were certainly beautiful, nightmarish, and horrific among others but I was a little put off by the use of hand held cameras. There is no doubt they were used to give the film a documentary feeling but having the frame continuously bob up and down made me feel a little bit queasy at times. I feel like if they had put the camera on a crane it would have smoothed out the motions with some of the dance sequences. The use of mirrors throughout the film to show Nina's dual personality was also great touch but they felt like something straight out of any number of films made by Orson Wells. The ending I felt was predictable since the film very broadly follows the story of Swan Lake itself so it didn't surprise me when it was shown that Nina did not stab Lily with a piece of glass but rather herself instead. Nina finally frees her darker side when she believes she has killed Lily and is able to deliver a stunning performance as the Black Swan. Only after this when she goes back to her dressing room to change back into the White Swan and Lily comes and congratulate Nina does Nina slowly realize what had actually happened. The fact that Nina does not call for help but instead goes through with the last act of the play shows just how tragic a character she really is. She was willing to forgo her own life in an effort to finish her performance and finally achieve perfection.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say? Not entertaining.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odette's evil sister, Odile, the Black Swan.\n\nstars Natalie Portman, Mila Kunis, Vincent Cassel, Barbara Hershey, Winona Ryder, Benjamin Millepied, Ksenia Solo, Kristina Anapau, Janet Montgomery , Sebastian Stan, Toby Hemingway, Sergio Torrado, Mark Margolis, Tina Sloan, Abe Aronofsky and Charlotte Aronofsky.\n\ndirected by Darren Aronofsky.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great psychological horror.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mad as a........ballerina! Beautiful. Intense. Freaky. Erotic.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even considering her painful script-citing in 'Star Wars', think twice about saying that Natalie Portman can't act.  Because in 'Black Swan', she is just amazing.  As is just about everything in this very-hard-to-categorize movie.  I guess the term \"horror\" would be most fitting for it, but I tend to lean more towards calling it \"an intense, psychological drama\".  It follows the inner-conflicts of the pressure-driven protagonist, through which the audience is taken on a bizarre and unsettling journey as this troubled girl slowly disintegrates into a living nightmare, striving to embrace her darker nature, and thus achieve perfection at the risk of everything else.  It's more disturbing than scary, but through the sheer beauty of its choreographed ballet scenes, the astutely-acted cast, and the commendable work of director, Darren Aronofsky, 'Black Swan' delves deeper than most other films, and as a result, turns out to be a very harrowing, and surprisingly moving tale, about the consequences of giving in to our competitive desires to be better than everyone else.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie! I thought it would be shitty, but no way! Blew me away",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i tried to like this movie but it's like mostly scenes of Nina staring with mouth open at stuff.  boring.",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intriguing and beautifully dark",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful performance by Portman, and surprisingly, Winona Ryder making a comeback to acting as an falling from grace Prima ballerina.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The White Swan becomes the Black Swan, and she must pay the price!",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting, dancing, psychosis!!! That's my kind of movie!",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 mins of good action, plenty of boredom watching a nutter being a nutter. Good acting, camera work and ending does not make up for the dross throughout.",
            "review_date": "2013-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, thrilling and erotic, with strong performances from the cast; \"Black Swan\" is a riveting drama about desire, passion, totality and rivalry.",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Believe that this movie is fucking amazing, the plot was really really good, the acting was incredible,l theres not much to say, absolutely terrific, natalie portman as always delivers an incredible performance. the soundtrack is obviously perfect.  thumbs up and i really really recommend it. it has it all. outstanding.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman gives the performance of a lifetime in this psycho sexual thriller helmed by acclaimed director Darren Aronofsky.",
            "review_date": "2013-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok...Indeed, White Swan/Black Swan dynamics almost work, but the horror-movie nonsense drags everything down the rabbit hole of preposterousness.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time I saw this movie I was in awe. It was so Original, creative, and just overall \n. Milla Kunis and Natalie Portman gave performances that were out of this world. And that ending, WOW!",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darren Aronofsky's \"Black Swan\" is an eerie, unsettling, and unforgettable movie that shows the good and evil inside of us. Natalie Portman's performance is very good and carries the movie for sure. The best way I can describe it is that it has many disturbing scenes but it has something about it that kept me engaged and watching. This is a unique movie that challenges the viewer and will keep you guessing on whats real and what isn't. The film isn't for everyone but it is one film lovers will enjoy experiencing and analyzing.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since this movie has come out, I've found myself discussing it with mainly women. Even though the movie revolves around Natalie Portman (White Swan) and Mila Kunis (Black Swan) it is by no means a women's movie. It's grown on me as I've seen it a few times since it's release and has become one of my favorite films and can be distilled down to its ballet structure. As with similar spirals into psychological darkness, the line between facade of the ballet, Portman's personal life, and Portman's hallucinations puts the viewer in the protagonist's shoes to advance the narrative. Tchaikovsky's musical motifs perfectly fit over the film's sequences and paint a stark mood which increases with intensity and velocity of the plot as fragmented as it may be.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When first viewed i was debating whether this was amazing or awful. After consideration i would go with it being a brilliant film. Natalie Portman and Mila Kunis are fantastic.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will be honest here, when this movie first came out I wasn't planning on seeing it, it seemed a bit drab to me, but then people kept telling me, \"Black Swan is definitely worth seeing, check it out!\" So naturally I did, and to be honest, it was better than I expected...but maybe not as good as most other people tend to find it.  And that probably has to lie in the fact that I didn't find Mila Kunis as a good actress and I still don't.  But Portman thankfully is and that manages to get the film on track for most of it.  So yeah, maybe they should have picked someone other than Kunis for the role but either way it's worth seeing.",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dark, tense, and haunting i was swept away by it's drama, it's fantastic acting, and the beautiful camera work. however, i can't help but feel like something is missing. the movie just doesn't feel complete. i dunno...call me crazy. i need to watch it again.",
            "review_date": "2013-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense psychological thriller and a fascinating examination of the trials and stresses of an artist.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Natalie Portman's performance haunted me. She was terrific.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, i really don't know what to say after watching this, nor what to rate it. Firstly i have to hand it to ballerinas, it seems what they put their bodies through is so tough. The acting here is brilliant and it was good to see Mila Kunis in something different. Writing this review is so difficult, i have to admit that I thought the psychological aspects would be a little more disturbing but i suppose the finale is just immense. Well, what can I say? The whole of it is very beautiful.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a fusion of horror and drama. it's dark, but very appealing. great cinematography. the characters feel like they're created in a circle. it always comes back to mental problems and obsession issues. but very nicely cooperated so it doesn't seem very boring as it should",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok so it's a movie about dancing, but I didn't expect *that* much dancing.  Also didn't expect that much craziness either!  And there certainly were a number of gross-out moments as well, and a couple of gratuitous make-you-jump orchestra hits.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}