{
    "rating": 4.3,
    "release_date": "2010-05-27",
    "num_reviews": 550,
    "genres": [
        "Romance",
        "Comedy"
    ],
    "summary": "Fun, fashion and friendship continue to define the lives of Carrie (Sarah Jessica Parker), Samantha (Kim Cattrall), Charlotte (Kristin Davis) and Miranda. They have more than they ever wished for, but when the combination of marriage and motherhood approach, the gals take an exotic vacation in Abu Dhabi. The sun-drenched paradise holds many surprises -- especially for Carrie, who faces temptation when she unexpectedly runs into Aidan.",
    "reviews": [
        {
            "content": "LOL, 02 and 27/60 hours!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Horrible movie Horrible writing. \n\nNothing but product placement and cliche.\n\nSteer clear if you loved the original franchise. Movie 2 swaps heart for cold hard cash and cringe.",
            "review_date": "2022-09-17",
            "source": "rt"
        },
        {
            "content": "A movie that's too long and boring and who really cares how the Girls turn out in this (and hopefully) last film.  Thus my *2* star rating!!",
            "review_date": "2022-06-25",
            "source": "rt"
        },
        {
            "content": "Never have a bunch of vain actresses been more irrelevant than in ANY of these films. Get a life  - men do not fantasize about you, specifically...",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Sonic I love the moon moon is the",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "Poor and lazy story writing",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "The only good thing about this movie was Samantha.",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "How did they get this so wrong! Mega fan of the series and also really liked the first film, but this! Not funny, nor warm, tha fashion OTT, and basically racist.",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "I am not a fan of politically correctness whatsoever but this was bad, bad bad. The only redeeming thing about this film is the stunning costumes because everything else about this was awful, pariticularlly the story and dialogue. I found it personally embarassing to watch the scene with Samantha behaving terribly after her purse explodes near the end of the film. Terrible and makes me afraid for the TV show reboot.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "This movie truly amazed me. Every single time I thought it couldn't be any worse or more stupid it somehow outdoes itself in every scene. It's a unique specimen in how to make a terrible movie",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "This one I only had to see to know I don't want to watch it ever again.",
            "review_date": "2021-03-26",
            "source": "rt"
        },
        {
            "content": "I enjoyed the first movie, it had just enough familiar but fun beats. This film, however, really missed the mark. It felt anti-woman, ageist, racially insensitive, and just plain basic, a downgrade from the forward thinking series that pushed the envelope. Watching a group of privileged white women constantly complain about their privileged lives is not fun viewing. The only thing I enjoyed was the cast chemistry and afew of the one liners by Samantha, otherwise, a let down on all fronts.",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Horrible representation of Abu Dhabi and women of the Middle East, Even though it wasn't shot in UAE they portrayed Abu Dhabi in a very ugly and shallow way, also this movie is full of stereotypes which is a BIG turn off, they failed with every aspect whoever is responsible of this shitty movie should be ashamed.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "This movie was utter garbage. If you wanna see 4 white privileged women shit on people of color and their culture and traditions for 2 hours straight, then watch this. The portrayal of UAE was very incorrect and this wasn't even filmed in Abu Dhabi or anywhere near it. Considering the fact that this was only filmed ten years ago, I am utterly astounded by the ignorance and blatant disrespect.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "This has to be the worse movie I ever saw in my life.  If this is any reflection on society, we are in a very sad state.  These actors should be embarrassed for being in this film.  It was stupidity on steroids-cringe worthy dialog and acting.",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "I regret every minute wasted on giving this movie a shot.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "Yah, nah. Don't bother.",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "What a hold up! What a waste of time! Shame on them for ripping us off.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "This sequel was totally unnecessary.",
            "review_date": "2020-02-11",
            "source": "rt"
        },
        {
            "content": "I love it! I like the way they talk about religion and women. I knew it wasn't clever to talk straight and too honest like this but do they have the film that brave enough to talk about SEX and RELIGION out in Hollywood? NONE and if they have, it's gonna be so drama and serious. This film represent in comedy and I laughs so hard.",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "The dialogue is cringeworthy.",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "Omg this movie was absolutely AWFUL!! Whoever wrote this script should never be allowed to write again! The storyline was extremely boring, the comedy (if you can call it that) was nonexistent, and the characters just didn't fit. Three of them are married and two have kids. Their lives are different and yet the characters don't ever evolve. Miranda is still uptight and a control freak, Charlotte still wants her life to be perfect, Samantha only cares about sex, and Carrie is still trying figure herself out. Completely boring and tiresome. You'd think they would have developed the characters better for the 2nd movie. So glad there won't be a 3rd film. Please do the world a favor SJP, let SATC die with this awful film and move on!",
            "review_date": "2019-09-19",
            "source": "rt"
        },
        {
            "content": "So happy this ‘movie’ is on hbo since it is a TV movie. It makes us realize how truly empty it all was. New York (the special New York) is made by talented people in the arts not these idiots nor this fake world of ‘upper class’ white trash that seems so aspirational to the other group of white trash idiots that’s into it. (So glad the careers of these subpar actors did not go anywhere.)",
            "review_date": "2019-05-09",
            "source": "rt"
        },
        {
            "content": "Great movie. Classic SatC plot and the characters are their wonderful selves. My only real dislike was the Kareoke which seemed really preachy, long and uncomfortable.\nBonus points if Kim Cattrall and SJP were actually on the outs during filming because they still have the same best friend chemistry that they always had in the show and first movie.",
            "review_date": "2019-04-22",
            "source": "rt"
        },
        {
            "content": "Itâ(TM)s a disgrace to the tv series. Itâ(TM)s so bad, I could slap the makers who are responsible for this sh*t. I wish it would not have ever happened.",
            "review_date": "2019-04-01",
            "source": "rt"
        },
        {
            "content": "This movie was terrible. Carrie is too too old to be pulling the little girl lost simperimg, giggling persona. The plot was weak. A disappointment.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "Sex and the City 2 is all set-up with no pay-off. It's bad soap opera, and every time it comes close to addressing an interesting issue - such as how the reality of a marriage differs from the idealized preconception of one - it quickly backtracks, apologizing along the way for getting serious. Fans will bathe in this sewer of materialistic excess because they appreciate any opportunity to spend time with their favorite characters. Everyone else will stare at the screen in a state of enhanced boredom if the sheer tedium of watching this production doesn't shut down the brain altogether. The first Sex and the City movie was marginally watchable. There was a narrative line, the characters weren't consistently reprehensible, and the humor wasn't quite as forced. Sex and the City 2 has taken all that was bad about its predecessor and amplified it.(Materialism, consumption and nothing more: Avoid with a capital A).",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "The worst. I wish there was a quarter of a star option. I beg you cable stations please stop playing this movie.",
            "review_date": "2018-08-26",
            "source": "rt"
        },
        {
            "content": "Call me crazy but shouldn't there be some sex and the city?",
            "review_date": "2018-05-01",
            "source": "rt"
        },
        {
            "content": "My problem with this film, that I was made to watch, was not the horrific materialism. I had been warned by other much better reviews. My problem wasn't the jaw dropping ungratefulness of these characters for their blessed lives. I expected that shortly after the initial dialogue. My problems even side stepped the cringe worthy stereotyping which mock both the integrity of women whilst mocking the rights of other cultures to be different, This I had been warned of by Mark Kermode's BBC review. My problem ended up in a simple elsewhere. I was warned and prepared for all of these things so that I could at least get through the ordeal by turning off my decency and enjoying the cheap laughs. There were no..... not one..... laughs.",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-01",
            "source": "rt"
        },
        {
            "content": "Kind'a glad I finally watched it.",
            "review_date": "2016-12-31",
            "source": "rt"
        },
        {
            "content": "A few minutes of Alice Eve is the only good part of this movie.",
            "review_date": "2016-11-09",
            "source": "rt"
        },
        {
            "content": "Call me biased but I love this movie. Give me all the Carrie, Samantha, Miranda and Charlotte that you want. Take my money. Take it all!\n\nIt was hilarious and it had everything you could want in it. What am I missing? Why did people not like it very much?",
            "review_date": "2016-07-20",
            "source": "rt"
        },
        {
            "content": "This movie angers me.",
            "review_date": "2016-06-09",
            "source": "rt"
        },
        {
            "content": "Something of a mess in its structure starting with one theme, then leaving it behind for a jolly up in what appears to be an unashamedly promotion for a country with a terrible human rights record.  It's a farcical last 20 minutes too before bringing it back around to the initial 'trouble and strife' theme.  It just feels stuck within its television series origins.",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "Presents the protagonists as materialistic shallow individuals who are apparently also racially insensitive, nothing alike to their television characterizations. An unfortunate take on what was once authentic character portrayals, now an over the top profit maker.",
            "review_date": "2015-08-04",
            "source": "rt"
        },
        {
            "content": "Not as great as the first film but still good. A Sex and the City movie can never be boring.",
            "review_date": "2015-06-19",
            "source": "rt"
        },
        {
            "content": "Even fans of the series will have a hard time getting through this one. What got me the most was how ethnocentric and disrespectful this film was to other cultures. What is empowering for women in one culture is not necessarily so in another. Pull your head out of your ass King.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "It carries (no pun intended) some laughs but Sex and the city 2 suffers from bad characters and a thin plot.",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "A bad movie with a terribly predictable plot....... This was a waste of money.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Disappointing sequel :(",
            "review_date": "2015-02-21",
            "source": "rt"
        },
        {
            "content": "I would have given this movie a half star, but it did start ok and seemed to have a reasonable plot. However--for some unknown reason--it deteriorated into a wildly stupid plot that inexplicably brought these funny and charming friends to the Middle East. As I watched them in nuns garb, I wondered how in the name of the deity they got to that! If you expect any of the unexpected and surprising finesse of the original Sex in the City....don't. Don't waste your time, even on TV if there is a network brave enough to show something so bad!",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "Could have really tackled the issues but didn't",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "Despite high production values, Sex and the City 2 is dull, overlong and borderline racist.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Such a Downfall!!! You, girls, have to know when to stop!!",
            "review_date": "2014-12-19",
            "source": "rt"
        },
        {
            "content": "Beautiful to look at, but still a major turd. Just awful.",
            "review_date": "2014-10-22",
            "source": "rt"
        },
        {
            "content": "Better that first film! Good screenplay, Sarah Jessica Parker had very good role and Kim Catrall was better that ever! Carrie is eternal! But a little predictable and nothing new on this genre.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "They don't get much worse than this.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Alice Eve is the only bright light in this awful long, long movie. Alice Eve is barely credited for bringing lively light to this awful movie.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Got to love it, even just for the over-the- top gay wedding scenes.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Better that first film! Good screenplay, Sarah Jessica Parker had very good role and Kim Catrall was better that ever! Carrie is eternal! But a little predictable and nothing new on this genre.",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Again like the first one.... Eww!! The last thing we need to see is cougars in action... eww!!",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "This second installment to the hit movie and show \"Sex And The City\" was kind of a disappointment. It lacks in a way that doesn't make sense. The only good thing about this movie was the beatiful view of the other country sides. The girls ate annoying they want to be younger and act young but they don't realize that, they are old. Etc.....that's what made this sequel annoying. So for this being an annoying film and failing it success to the first installment, I give \"Sex And The City 2\" a D.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "I did not hate it but didn't love it either. Had some major cheesy moments that were just unnecessary. Still hope they make another one though !",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "Sex and the Hollywood should be the sequels new title, as an extensive fan of the series, I cannot recognize these four materialistic, whiny characters who seem to bicker through out the film on the non satisfactory levels of their settled lives. Objectifies the means for women's rights but results in portraying it through conservative women in the Middle East leaving the realism into an over the top exaggeration more exaggerated than the outfit Sarah Jessica Parker is seen in during their market venture.",
            "review_date": "2014-03-14",
            "source": "rt"
        },
        {
            "content": "ahhhhhhhhh!!!!!!!!!!",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "Funnier than the first.",
            "review_date": "2014-02-16",
            "source": "rt"
        },
        {
            "content": "I'll probably get a lot of thumbs down but I'm a SATC fan! I think this is only something that Sex and the City fans will enjoy and understand. Guys steer clear and if you don't like SATC don't watch. It's just good seeing the girls reunite on screen again. The film is about the Sex and the City girls, well duh; Carrie (Sarah Jessica Parker), Miranda (Cynthia Nixon), Samantha (Kim Cattrall) and Charlotte (Kristin Davies) coming together again and discussing their relationship and family problems. To get away from all their troubles they go on a girlie holiday to Abu Dhabi where Samantha struggles to stick to the strict no sex laws, Carrie bumps into an ex, Miranda enjoys learning about the culture and Charlotte gets some well needed away time from the demands of motherhood. It's really like a longer and more adventurous SATC episode; as a fan I was satisfied. SATC always deal with problems that are real and like a lot of Hollywood films doesn't portray the perfect relationships and marriages and that they need working at. SATC is a lof of fun and something to watch with your mum and your girl pals. I found the film entertaining and sincere and it's nice to catch up with the SATC girls and see where they are after the series finished. I hope they make a third film. This film isn't for everyone, but its something SATC fans will appreciate only.\r\n\r\nGrade: A-",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "bad movie nothing to see with tv serie, at tv serie girls are more realistic, more fun, more real, at movie they are only well dressed manequin",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "It wasn't as good as the first but the inly problem I had with it involved the middle east plot lines. I found what was happening at home to be interesting and should have been focused on more. It felt like a commercial for Abu Dhabi, unlike the first film in which the trip to Mexico lasted no more than half an hour. The girls are just the same though and thats what makes me love it. The characters are who theyve always been and thats all i could ask for",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "Good old laugh. And good old Samantha and her taste in men + Australian rugby team in the swimming pool...;)",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "Una floja secuela que solo es disfrutable para los fanáticos de la serie, varios cameos muy divertidos y mucha modaaaa",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Well this was something. As much as I (surprisingly) loved the first movie, #2 was just plain offensive. It started off all right (except for the OTT gay wedding) we catch up with the girls and their significant others in NY; Carrie and Big are having growing (or couch/TV) pains, Charlotte is overwhelmed by her children and a braless (gorgeous) nanny, Miranda is working too much, and Samantha is going through the big M. This was all relatable stuff, but then Samantha gets an all expense paid trip (through Smith) and they end up in UAE. Where every scene requires another outrageous costume change, they stay in adjoining 22,000 dollar a night suites, personal butlers, etc. and its all just too, too much. And jeez the stereotyping and offensive behaviour towards middle eastern culture and travel outside America in general. It was just painful to watch. I suppose this is meant to be watched as escapism or fantasy, but still. All in -a nothing movie that had me cringing more than laughing. I will admit Big's \"sparkle\" and speech at the end almost had me forgiving him for his behaviour over the years. As much as I've been a fan of the girls/the entire series and the first movie I really hope this is the end. 01.06.14",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "Really nice I could say...",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "I thought about watching this all the way through, but that idea changed after about 10 minutes of horribleness. I skipped ahead to the part where the four travel to Abu Dabi. When this film was first released I had read in multiple places about its racist and anti-Muslim script (see: http://www.thewire.com/entertainment/2010/05/is-sex-and-the-city-2-racist/24251/) It wasn't as nearly as controversial as it was drummed up to be. I wish it were, because it had nothing else to offer.",
            "review_date": "2013-11-09",
            "source": "rt"
        },
        {
            "content": "Now, I love all things SATC. I own all 6 seasons on DVD and both movies. But admittedly, I mostly own this one to complete the collection. I feel like they really should've stopped the story after the movie. The first movie let us see how things turned out for the women and brought fantastic conclusions. This second film was overkill. I still watch it from time to time just to enjoy the characters I have always loved but I really hope this is it for the SATC franchise.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Preferred this over it's predecessor. Very entertaining.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "They should have kept this one locked in a vault.  Utter garbage and a waste of time.  Alice Eve was the only highlight.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Why is it that some western countries have no credibility toward the Arabic culture concerning the language, religion, norms or customs while Arabs are eager to mimic and even enlarge only the positive sides about some western cultures in every possible chance and especially in all kinds of media!?\nI can distinguish English from Irish accents way better than I do Saudi from Kuwaiti ones. i.e.; for me, I can understand most of English language dialects, but I gaze in wonder whenever two Saudis talk about the new James Bond movie.\nOh yeah, Arabs are terrorist and they don't know their own language.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "Bigger disappointment to women than a missed period.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "this movie is shit no it really is Shit.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Love this cast and movie and I must say it is better than the first movie.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Just as entertaining although not as good as the first movie.  Still fashionably great though!",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "My daughter: Loves this film! :)",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "The first one was so much better",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "When your cricket-hating girlfriend stops watching this movie to watch the final day's play in a cricket test match. It says more about this movie than anything else!",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Ok, Sex and the City (both films) was never intended to be a smart film about intelligent women taking charge of their own lives and living their lives to the fullest. Oh - wait, YES IT WAS! That's what the whole bs is about \"smart women, independent, blah blah blah\". Well, Sex and the City 2 is one of the most insulting films to women I've seen in a long time.\nAnd not just women, but also some specific cultural groups (of both men and women) such as Arabs! I just found it appalling and very annoying.\nThe storyline was decently bad, but the dialogue and the jokes - OMG. WORST FILM DIALOGUE i've seen in a long, long time (as bad as \"Crossroads,\" if not worse).\nLiterally, the only reason why I gave it a 2 and not a 0 is the fact that Samantha is as good as always and there are some really hot guys to look at. Otherwise, this is a headache. Horrible, horrible film.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "4 1/2 stars!\n\nThe second sex and the city was even better than the first and I loved the first! Great movie with great comedy!",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "only seen the beginning but I love what I saw.",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "Carrie (Sarah Jessica Parker), Samantha (Kim Cattrall), Charlotte (Kristin Davis) and Miranda (Cynthia Nixon) come together to take another bite out of The Big Apple - and beyond.. What happens after you say \"I do?\" Life is everything the ladies ever wished it would be, but it wouldn't be Sex in the City if life didn't hold a few more surprises. After all, sometimes you just have to get away with the girls.\n\nalso stars Chris Noth, John Corbett, David Eigenberg, Evan Handler and Jason Lewis. \n\ndirected by Michael Patrick King.",
            "review_date": "2013-07-03",
            "source": "rt"
        },
        {
            "content": "Just a lot\nBest scene: none",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Such an enjoyable movie. \nThe storyline isn't as good as the first movie, and it lacks some of the heart. \nYet I think that this movie makes up for that with it's use of humour.\nI really did enjoy this.",
            "review_date": "2013-06-21",
            "source": "rt"
        },
        {
            "content": "Not as good as first one for sure. Beat the series to a pulp by the end of this. Lots of cheesy bad jokes and lacks the series witty and smart humor. Also, serious plot gimmicks like seeing Aidan in the Middle East and even just going there. First 30 minutes were ok n then it just goes downhill real fast. The 2 gay guy getting married thAt hate eachother, big wanting his own place, the braless jokes etc... Seriously what were they thinking?",
            "review_date": "2013-06-06",
            "source": "rt"
        },
        {
            "content": "Definitely a film to be watched with only the girliest of your friends, preferably with a cocktail or two at hand. I'm not sure that I would have tolerated this movie if I had not followed the tv series. It does not measure up in wit or substance, and seems far more concerned with product placement and flashing its ridiculously large budget around than actually delivering a quality movie. Carrie, whose likability had been questionable in the series, is incredibly frustrating, though still an improvement on the first movie. Aidan makes a bizarre appearance, despite the film being set on the other side of the world, whether to add some adulterous conflict or to simply make Carrie's marriage to Big even less satisfying it is unclear. The film flirts with racism throughout, crossing over completely at the end with the insulting display of Islamic women drawing their garments to reveal haute couture. Correct me if I am wrong, but I am sure there aren't many Muslim women smuggling Prada underneath their hijabs around Abu Dhabi. The only redeeming factor was that the film did not shy away from the fact that the ladies have aged: Samantha hits menopause head on, something that the folks responsible for airbrushing the promotional posters into oblivion apparently missed. I don't think this movie should be discounted completely, it just would have been so much more pleasant cut down to one of the 25 minute segments that the writers once excelled at.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "Basically the same plot as the first with a few minor twists.",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "horrible movie just horrible",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "A horrid turd of a movie. Aside from one major gem of a scene (where Miranda and Charlotte drink and talk about the difficulties of motherhood), I hated just about every single moment in this misguided, awful movie.",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "was kinda ok although lot of \"arabic style\" mistakes. but what you would want from hollywood directors?!",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "This piece of crap could replace the lethal injection if only it didn't violate laws against inhumane execution.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "This is a movie nightmare!",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "No thanks. The first one was more than enough.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Is it a movie or fashion show?",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "This just goes to show that sometimes its better to quit when you're ahead and you've fumbled once.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "I liked it. Full stop.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "Basic chick flick with nothing overly exciting or special about it.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "I've sat through a couple of the Twilight movies and was able to understand, on a certain level, why some people enjoyed it.  The worst I can say about it is that it bored me, and I even enjoyed isolated moments.  I cannot say the same for this offensively, painfully stupid, unfunny, wretched cultural homicide of a motion picture.  Is this how women and film critics feel when they watch Adam Sandler movies?\n\nCome for the scene where a grown woman leaves her passport in the middle of a crowded market because she spots an old boyfriend, stay for the scene where a group of Middle Eastern women in burkas take them off to reveal the fashionable dresses from New York they have on underneath.  Then kill yourself.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Must say I enjoyed this more than the 1st one. :)",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "caught it on TBS...also may have caught hepatitis.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "OH. MY. GOD. This sequel is even WORSE than it's horrible predecessor! Like I've mentioned in a few other reviews of films I despise, this is one those cases where I wish I could give zero stars, but the rating system won't let me, so I have to award this cinematic abortion a half-star, even though that is being far too generous. Not since Gigli have I witnessed a comedy so utterly horrific and insanely unfunny, and while this film isn't quite as bad, it's not very far behind. This film takes everything that made the first film suck horribly and accenuates all those problems to a near-apocalyptic level of badness. This film was so awful, it felt like it raped and crushed my soul right from the get-go because everything about this film is beyond horrible. The storyline is even shittier than before, the acting is annoying and dull once again, the humor is even worse, nothing happens in this film like the first film, the characters are even bigger bitches than before, it's chock-full of stereotypes about women and gay people that are utterly offensive and horrifying, and it's even more boring despite being only a little bit longer. Now, I know there might be women who think that this film is all about women empowerment, but this film is a total insult to women because unless you prefer the depiction of women to be selfish, fashion-obsessed, air-headed whores who talk about nothing interesting whatsoever, then this is not empowerment. If you want to see a good film about women empowerement that features female friends going on a trip together, then I suggest you watch Thelma & Louise, which is a wonderful film that has everything the film doesn't have like a good story, characters you grow to care about, actual humor, genuine heartfelt moments, and it's also a film guys can get into as well. Watch that instead.",
            "review_date": "2013-01-17",
            "source": "rt"
        },
        {
            "content": "have you ever been reading a textbook, and then realize forgot everything you just read? that's kind of what watching this feels like. except you won't have missed anything. and it doesn't help that the four leads characters are spoiled, cocky boneheads disguised as relatable, funny people.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Watching it this weekend!!",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Their first walk through (what was supposed to be) the Abu Dhabi desert, dressed in those..garbs, is one of the most ridiculous, cringe-inducing things I've seen in my life. And not in a funny way, but in a what-the-heck, confusing way. Many other scenes produced the same reaction. I didn't completely dislike the first movie, but this was almost unbearable. It felt really long too. It was.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Watch the 'Morocco' episode from Season 2 of Absolutely Fabulous before you watch this movie. As MPK & SJP both said, this time round was about kicking off your heels & having an elaborate blast with your girlfriends - which is exactly what this film is.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Such a waste of time.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "I love this movie. Can't wait for it on blu Ray Tuesday.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "I am an avid Sex and the City fan.  I own all of the seasons and frequently re-watch the first movie, but this sequel was such a disappointment to me.  It was simply \"over the top\".  I realize that the series was always on the brink of the latest fashion and about women with money, but this just took it to another level.  The story-line isn't great, and it's just so materialistic-a sickness that our society is already suffering from today.  I would love to lie and say that I loved it, because I LOVE the gals, but I just can't.  :(",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "the first movie was so much better than this one. I honestly hoped this movie was over after the first 30 mins of it. this was a waste of money honestly. The only reason why I watched this movie was because of Sarah Jessica Parker and her girls.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "Girls must see.. Enjoy sex in the city series!",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "I love the show, loved the first movie but this is just terrible unfortunately",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "LOVED IT!! so many original characters, nut you have to be a fan to understand allot of the relationships, (or past) of each of the characters, ALL 2 AND HALF HOURS I WAS ON THE EDGE of my seat!!! was hilarious, about the $22,000 part a night and the scene with Samantha telling off the crowd toward the end, and all of the women who did not even know her supporting her like that, I see them at a whole different level (designer fashios under there robes) hilarious!!",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Watched 15 minutes and had to walk away. Couldn't do it! Reminded me of the Crypt keeper. ..",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "For a guy who has never watched a full episode of Sex and the City, the second film based on one of HBO's most famous comedy series is one of the most putrid and excruciating pieces of cinematic pigswill ever made. In a time of a continuing economic collapse, inequality and racial controversies, Sex and the City 2 is the completely wrong movie at the wrong time. Its water-thin narrative about four female travesties traveling to Abu Dhabi to basically do nothing but eat exotic food and spend money on worthless trash celebrates consumerism while creating abhorrent depictions of motherhood, marriages and womanhood in general. These women shriek, complain, consume, shriek, complain, shriek, complain some more, consume and consume and complain... WHILE EVERYTHING IS FINE. They have mountains of money, fancy clothes, extravagant apartments full of trendy furniture, giant televisions, irritating children, and loving husbands, but who must be a little empty-headed since one of them (who has to be an arms dealer or at least a crooked fundraiser for important politicians) buys a TV the size of a football field for an anniversary gift, while the wife had hoped some more jewelry. Oh, but she learns not to care about that little vexation, since in the magical consumption land of Abu Dhabi she has a spiritual awakening as she learns that everyone really can't afford that jewelry, because they just don't make enough money. This is two and a half hours of absolute torture. The only glimpse of light is the hope that this is meant to be just a really bad satire. But even if so, Sex and the City 2 is still cinematic consumption porn completely disconnected from real societal issuses, such as gender roles, motherhood and inequality, that it hopes to touch upon even slightly. Instead it wants its audience to sympathize with and relate to the most contemptible bunch of hysterical and materialistic imbeciles, and realize that money actually doesn't define everything, as long as you have an extravagant apartment, a TV the size of a football field, fancy clothes, jewelry, and a loving, if sometimes lazy, husband. This is a film that will make you both mentally and physically sick. It is a film to be burned at stake and buried deep into the ground, so its evil forces can never rise again.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "It kept my attention pretty much throughout the movie and I think it was way better than part 1",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "I give this one star because I love the cast but the movie was downright awful. NOT worth watching if you're feeling nostaligic just rewatch an episode of the series.",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "This movie could turn me into a misogynist if I took ti too seriously. CB is such a selfish bitch, bully and over the top with her clothes, shoes and accessories. These four women were once fun to watch in the TV series during their pre marital lives. Not fun any more to see them, especially CB, trying to hang on to girly things  when they are already menopausal.",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "sorry, but I'm a fan ;)",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "I love the characters and I love the storyline for this movie!",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "The first wasn't great, this was bad. It was far too long, ridiculous and over the top. Part of what made the show great was the city (New York). Why the movies fail to understand this is beyond me.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Love this movie so much!",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Some great moments and some disappointing story choices.",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "NOt nearly as good as an episode. Sad finale.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "i enjoyed the movie, it is all so tremendous. the custom on Middle East are so funny, hahaha , . only the ending before they left to airport was weird, just suddenly there are so girls wearing '''black clothes covered all the faces and bodies' rescued them from people. but overall it is funny... Carrie look strange with her faces, Samantha did very good at her age ,",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "As a fan of the series, I enjoyed having the girls back. Sadly, I have to be objective and as a film... it failed. Far worse than the first. This does not mean I don't advocate grabbing a cosmo and revisiting the girls when you're feeling down. It simply means that in stead of putting the extra effort in and making it good, MP King decided to rather just sit back and ride the wave, opting to not really even try. A weak script, lacking a central plot and any real drama, shallow and with acting that could only come from lazy directing. It's also rather loose, and loses itself most of the time. There are, however, isolated moments where you'll flashback in your head and relish in the splendour of a typical Mirandism or Samanthaism, and the wedding scene featuring Liza Minnelli is divine to say the least - reason alone to watch the film! Sadly, it's downhill from there. MPK also unfortunately tries to tie in a recession-focused plot - an idea that seems more like a last minute attempt to make the film appealing on a broader scale than a well-though through plot. Too many stories, too many loose ends, too little substance and no real weight. I hate to say it, but the naysayers were right.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "Loved it!  Yes, more than the first part.  In part 2, they really strayed true to the essence of the show.  I did not give it 5 stars because I still would have liked Samantha's ending to be different (I'm trying not to spoil it for those who haven't watched it yet).",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "I still don't know why I watched this",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "Love Sex and the City too much!",
            "review_date": "2012-09-25",
            "source": "rt"
        },
        {
            "content": "I want to see this movie.",
            "review_date": "2012-09-25",
            "source": "rt"
        },
        {
            "content": "Brutal! me he reido un montÃ³n.",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "I am a huge Sex and the City fan and I absolutely hated it.  it has no point and moves along like a bad 70's off location sit com.",
            "review_date": "2012-09-22",
            "source": "rt"
        },
        {
            "content": "so much fun! this girls never dissapoint =)",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Not as good as the first or the series but i love the cast and has some funny moments. X",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "Awful! I want it to be fun and entertaining but its cringe worthy and shallow.  Sad",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "All the money in the world will not buy these ladies a bit of class. No sophistication. Totally racist. No respect for culture. 5 negative stars. Not funny at all.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "I like the wedding in the rice place",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "This movie was made only for girls who loved the tv show, so if you're into these  fabulous girls  than you will definitely enjoy it",
            "review_date": "2012-08-28",
            "source": "rt"
        },
        {
            "content": "definitely a chick flick movie, but even so I really enjoyed it :D\n\nIt's like the other side of the coin for Hangover :))",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "Worst movie I have ever seen, and I used to like the show.",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "Sex and the City 2 isn't just bad, it's an offensive ode to the shallow materialism that dominates American culture and will probably just make terrorists hate us even more.",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "not as good at the first one",
            "review_date": "2012-08-07",
            "source": "rt"
        },
        {
            "content": "This movie really sucked as a sequel. It seemed like the writers rushed to make this movie!!!",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "A disaster movie which bores you to the core. Unfunny and regretful follow up to the first movie.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "So good! Loved it! Can't wait for it to come out on dvd!!!",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "This movie was bland and boring. As I liked the first movie, the second movie was paper thin. It's just a pain-in-the-ass plot or you know what, maybe I'm being too critical on this movie. Well guess what? This movie is a dull mess. For me to be honest, I could rarely keep track only for like two or three memorable scenes such as the intro, the vacation and when Mr.Big buys Carrie a present for her birthday at the beginning of the movie. Let's see if the third move can do any better. Sex and the City 2 gets a 4/10.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "My Mom Kelli Krajci Did Not Want To See This Movie At A Movie Theater Because She Would Waste Her Money, She Got This Film From Netflix On DVD Instead.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "WTF??? CARRIE LOOKS LIKE A DRAG QUEEN",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "Carrie Bradshaw: â??The minute I kissed Aiden, I remembered who I used to be. Someone just running around New York like a crazy person, trying to get the pme man I love to love me back. And now, he does love me, and he wants to sit on a couch in New York City with me. And I really hope my past hasnâ??t screwed up my future. And whats so bad about a couch anyway?â??\n\nIâ??m such an avid fan of the series. The four has been a part of me. I grew up with them. One thing I like about Sex and the City is that, I never get bored of watching them. â??Sex and the City 2â?? may not be as brilliant like the first one but still delivers sharp entertainment, beautiful sceneries, marvelous acting, hilarious one-liners and beyond belief scripting. 4.5 out of 5 stars! :)",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "I literally could not watch this entire film. It was agonizing. I'll admit, I'm not a fan of the 'Sex and the City' TV series. The character of Carrie Bradshaw is insufferable to me unlike any other character before her. That being said, I was somewhat pleasantly entertained by the first Sex and the City movie. Don't get me wrong, the characters, the issues and all the glaring social injustices in the plot still bothered me, but the movie was entertaining. But this piece of crap, wow. What an absolute train wreck. I was cringing so much through the first hour that I just couldn't watch anymore. Whether you're a fan of the TV series or not, this movie is not something I would recommend. How anyone can make it through the entire bloated 2 1/2 hr. running time, I really don't know.",
            "review_date": "2012-07-14",
            "source": "rt"
        },
        {
            "content": "Movie was sexually funny, but pointless",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Horrible, horrible film!!",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "Lightweight comedy full of style, fashion and the occasional soft porn. Don't expect much other than \"another wacky adventure\" from these girls. Look out for Omid Djalili being serious.\n\nI think I was the only bloke in the cinema. I laughed loudly at the funniest bits. Only once or twice was I the only person laughing.",
            "review_date": "2012-07-09",
            "source": "rt"
        },
        {
            "content": "I thought this movie was a little better than the other. I want to see a flashy, over the top spectacle.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "This is basically all of the things that were bad about the first film. I'll admit, I found it hard to watch this without Mark Kermode's famous ranty-review ringing in my ears. While he was outraged by the class, gender and race politics of Sex and the City 2 I simply found it to be a tired retread of material that this franchise has already 'explored' in the show and in the first film, in short it is boring. There's nothing new other than the setting, only this time the four leads are playing caricatures of their character, particularly Kim Catrall as Samantha. There is one scene towards the end in which she announces to the proverbial Arab world that she, simply put, 'has sex' whilst flailing her arms in the air grasping condoms. For me its a scene that sums up just how tired this franchise has become and really how lazy it is. What other conclusion could one reach when the great denouement is that the repressed women of Abu Dhabi are in fact as driven by consumerism as our four protagonists. Much like the first film this is way too long but really it's just tremendously insignificant.",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "I never watched the series when it was on TV and I still don't.  But I saw the movie on cable and I have to say I was very shocked at the amount of nudity there was.  Now, I'm no prude but there were some shots that were there for the sake of seeing somebody naked.   It was just gratuitous nudity.   The story was okay.  What I did like is that I was drawn into the love and friendship that the women had for each other.  I could feel it and flow with it and be in it.  One thing I would ask Sara is why wasn't anything done with her hands?  Her hands really tell her age so that distracted me somewhat.  But what do I know?  I only live in the real world and can only dream of having enough money to buy a pair of shoes from payless!",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Its jist an ansurdly long episode that take advantages of its loyal fanbase. The story is not intellegent nor witty like the series. And to top it off, neither sex nor the city have role in the movie.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "The problems in this movie would hardly be enough for a 20 minute  episode of Sex and the City",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "Yeeesss, I saw it...not great, but entertainingly mindless.  A lot of the lines/scenes seemed to be rehashing of lines/scenes from the show and the first movie, but that can be comforting if you're in the mood for the same City, different day.",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "It was not as fabulous as the first one but u have to see it cause its Sex in the City!",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "sometimes they should just leave it alone and stop when they are still ahead..",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "150 minutes of awful",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "146 minutes and I wanted more! Sex and the City 2 and cosmos!",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Best way to sum this movie up: Women get rewarded for being dumb bitches.  This was one of the most offensive two and a half hours I've ever seen in movies.  From the episodes I've seen of the show, it's pretty entertaining in 30 minutes.  I never saw the first movie, but based on what I've seen from the show and this movie, I'm sure I can fill in the gaps.  Anyway, I don't really even want to talk too much about this pile of trash, but if you want to see spoiled bitches who complain for TWO AND A HALF HOURS (seriously, they couldn't make a movie like this in 90 minutes?)  then by all means go ahead and check it out.\n\nThe worst part about this movie is how it is marketed towards women to be \"empowering\" and inspirational, but really any woman between the ages of 18-25 who wants to live like these women is setting them up for a life of disappointment and misery because no man will give a woman a ring after she bitches him out and attempts to cheat on him.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Estas mujeres ya deberian jubilarse",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "It was ok, kinda felt it was forced..I don't know.. Liked the first movie better",
            "review_date": "2012-05-26",
            "source": "rt"
        },
        {
            "content": "Very, VERY upset about this one.",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "They're back! The sparkling Sex and the City sequel sees Carrie, Samantha, Charlotte and Miranda take another bite out of the Big Apple - and beyond. It's been two years and just as the friends are getting a little too settled into marriage and motherhood, they are whisked away to one of the most exotic places on earth for a sun-drenched adventure. Get ready for the ultimate weekend away with the girls. So I've seen Sex and the City: The Movie and I thought it was below average (4/10) but does the second one improve from the first movie's flaws? No, it doesn't! If anything, it's added more flaws. The story was very basic and not in a good way, it was boring and not interesting in the slightest. The girls basically moaned about their lives so Samantha manages to bag the women a holiday to Abu Dhabi where they moaned even more about their lives (except for a couple of scenes). The characters were poorly written this time round as all of them did nothing but nag, moan and bitch about everything in their lives. If they weren't bitching to their families, the women would get together over lunch and have a good bitch about themselves.\r\n\r\nThe acting was so-so, there were a couple of okay moments when the actresses didn't do a bad job but there were a lot of moments when it was bad. The direction is rubbish, the writing is a joke and the script isn't fun at all. Sex and the City 2 tries to be something it's not: Fun, sexy and smart. The worst thing about the movie is, yet again, the runtime. Two and a half hours is simply too long for this movie and the plot was very thin. I could have very easily cut sixty minutes out of the movie and you wouldn't miss anything. The only reason why I saw this was because I saw the first and I very stupidly thought that it could improve, but it didn't. Another thing that bugged me was the stuff they were wearing. This movie is supposed to be all about glamorous fashion and things but half the stuff they were wearing looked horrible, I couldn't see any woman with a sane mind wearing half the stuff they displayed in the movie.\r\n\r\nThe characters were yet again stereotypical but this time, it was more blatant and in-your-face.  The acting wasn't very good at all, they did a better job in the first movie. The 'funny' scenes aren't funny at all, except for the parts with Erin the Irish Nanny who made Samantha jealous. Overall, one of the worst movies this year and possibly one of the worst chick flicks I have ever seen and in even worse news, if the rumours are true, it's possible that it could be a trilogy! God help the world of cinema! There were a couple of funny scenes but apart from that, Sex and the City 2 has no sparkle and it has to be one of the worst movies of 2010. It didn't improve from its flaws, it just made more. I still can't see why women love this...",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "Better than the first one. A funny film with some great locales.",
            "review_date": "2012-05-22",
            "source": "rt"
        },
        {
            "content": "End of saga in a cheesy way",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Just as lame as the first movie!  Loved the series but the movies are absolutely ridiculous.  Makeup is horrible & makes everyone look old & ugly.  Brings out the worst in everyone.  Please NO MORE!!",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "Feels like a marathon of the same episodes, which, well guilty here, I enjoyed thoroughly. This is as silly as my guilty pleasures go.",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "The movie is good and fun, but that is about it.  I actually enjoyed the first one much more.  I personally wanted a little more substance or drama behind it, but the movie is still worth watching and having fun with.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "Decent film, quite enjoyed it but not as good as the first",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "You have to like the tv show",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Ahhh.. yes I watched it. the first one was way better",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "The clothes are the only reason to see it.",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "The First one is so much better, this one was slow and boring",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "Yes, the ending is painful, but it does feature some of the good elements that made of the series what it is.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "it was good clothes were awful",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "terrible...took one for the team...",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "will she ever recover from her actions again? good dessert scenes",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "A bit too much with all the fashion and fakeness...not as good as the first movie.",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "1 Pkt Abzug, weil er nicht so lustig ist wie der letzte!",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "Gotta find tim in the busy next couple days to see it.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "Funnier and more exciting than the first !",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "great film probly 1 of my best movies xx",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Although it lost what the first Sex and the City had, but Sex and the City 2 was pretty good.",
            "review_date": "2012-03-25",
            "source": "rt"
        },
        {
            "content": "Okay, not as good as the original.",
            "review_date": "2012-03-24",
            "source": "rt"
        },
        {
            "content": "fantastic movie totally hilarious loved to see the girls again",
            "review_date": "2012-03-23",
            "source": "rt"
        },
        {
            "content": "these girls should have stayed in New York because they really sucked in Abu Dhabi",
            "review_date": "2012-03-19",
            "source": "rt"
        },
        {
            "content": "Obsessed with the series and obsessed with the films!",
            "review_date": "2012-03-19",
            "source": "rt"
        },
        {
            "content": "I hated the first film, and I think I hated this film just as much, if not more. Whoever made the \"Sex and the City\" show and films should be fired from filmmaking and TV show directing. Please avoid this trash. BTW my brother made me watch this god awful short lived film series.",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "errrrr, Shop-till-Drop-with-Sex part two?",
            "review_date": "2012-03-09",
            "source": "rt"
        },
        {
            "content": "What I do for love...lol",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "The girls are great as always (maybe except for Carrie).  2 Stars for them. The movie was.... not good.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "Completely unenjoyable -- and I say that as a relative fan of the first one.",
            "review_date": "2012-02-29",
            "source": "rt"
        },
        {
            "content": "Awsome comeback film, though makes you wonder about love abit more",
            "review_date": "2012-02-27",
            "source": "rt"
        },
        {
            "content": "Too long and boring.",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "If yo ulove Sex in the City you will find it at least entertaining.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "If the meaning of 'female power and liberation' means shoes, consumerism and idiocy, well this film nails it...Also it is patronising and unintentionally racist...",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Lejos mejor que la primera parte, y me hizo recordar la esencia de la serie. Muy buena",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "Another one I was forced to watch, that I actually enjoyed.",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "I enjoyed the 2nd movie very much.  Loved the Liza Minelli cameo in the beginning!",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "Second film made after the popular TV series that followed the sexual endeavours of 4 successful female new Yorkers. But I have to say that this film should have been called âRelationships and the Cityâ or even better âRelationships and the desertâ because half the movie is set in Abu Dhabi. I can tell that as sex goes there is very little here except for the antics of the very forward Samantha, and there arenâ(TM)t that many of those either. The other three girls are a bit quiet because they are married, so in this film we can see their struggles with work, fidelity and offspring; sex becomes something barely sketched in the background.\nThe film starts a bit slow but picks up once they are invited to Abu Dhabi. I confess that I didnâ(TM)t even pay that much attention to the dialogues nor to the story, I was far too busy looking at the luxury of the locations and to the exquisite wardrobe of these ladies, the shoes, the bags, the jewels, the designer outfits... The film seems like a perfect excuse to show us the sophisticated looks of the main characters, like if it was a cat walk. If someone out there doesnâ(TM)t know what to offer me on my birthday any of those dresses would do ;-)",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "Loved it . A huge production /",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "Amazingly pathetic. When I was watching this movie I almost felt like watching paint dry on water.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Amazingly pathetic. When I was watching this movie I almost felt like watching paint dry on water.",
            "review_date": "2012-02-01",
            "source": "rt"
        },
        {
            "content": "Though not as good as the first movie or television series, this movie is enjoyable to all of us girls who grew up wanting to be a fairy-tale princess with beautiful gowns, a large castle, courtiers and parties and a prince charming.  The plot is somewhat contrived and predictable, but the gorgeous clothes and jet-set experiences of the girls make the movie a fun watch.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "I love watching four complete fuck-wits squeeze themselves into garish dresses, kid themselves that they are at all attractive and racially and sexually stereotype their way to an early(ish) grave.  I can't wait for the sequel.",
            "review_date": "2012-01-30",
            "source": "rt"
        },
        {
            "content": "What a disgusting movie, I'm so freakin sick of Carrie Bradshaw, who has become the worst character to represent American women. She has become so shallow she makes real women like P. Hilton seem deep, I got as far as her fight with Mr. Big and het whining to go to a movie premiere and I felt so disgusted I turned it off and deleted it with a promise never to watch another movie in this franchise.",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "Thought it was better than the first",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "This sequel was disappointing.  It lacked the heart that was in the show and the first film.  It did touch upon issues that have been touched upon previously but more was needed.  The film really needed less time in Abu Dhabi, and more dealing with what is going on in each of these women's lives. I love the scene with Charolotte and Miranda discussing the stresses of being a mom.  I wanted the film to go more into similar issues.",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "gunaikia tainia me panemorfi omws eikona!!!!!",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "You have to be a fan to love it and I do!!!",
            "review_date": "2012-01-12",
            "source": "rt"
        },
        {
            "content": "Enjoyable but not as good as the 1st movie. I'd definitely see it again though.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "As far as equestrian films go, Sex and the City 2 is no National Velvet.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "Better than the first one.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "I happened to catch most of this travesty on HBO and in watching it turned away several times.  Like watching a train wreck.  I have never seen anything worse and more debasing to the female race.  Embarrassing at the least.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "loughed a lot at this :)",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "For the fashion!!! And half star for the glam setting!",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "It wasn't as good as I had anticipated it would be.",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "Why did they make a second one of these?",
            "review_date": "2011-12-26",
            "source": "rt"
        },
        {
            "content": "Loved it. Just like a 2 hr show.",
            "review_date": "2011-12-24",
            "source": "rt"
        },
        {
            "content": "Five things I learned while watching Sex & the City 2:\n1. Liza Minelli can apparently sing âAll The Single Ladiesâ\n2. Racism against Middle Easterners is funny!\n3. Samantha is like a fine wine, the older she gets the more of a slut she is...wait thatâ(TM)s not right...\n4. Arab women secretly wear the Fall line underneath their burkas\n5. This movie is the single-most reason why most of the world hates Americans.",
            "review_date": "2011-12-18",
            "source": "rt"
        },
        {
            "content": "I was so excited when this movie came out, it fell tragicially short of my expectations.  The only upside was Samanthas one liners \" Lawrence of my labia\". Other then that it was predictable & boring.",
            "review_date": "2011-12-16",
            "source": "rt"
        },
        {
            "content": "Straining under a thin plot stretched to its limit by a bloated running time.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "Oh damn. These girls did not age well...",
            "review_date": "2011-12-07",
            "source": "rt"
        },
        {
            "content": "Kim Cattrall is the only reason you should be watching this.",
            "review_date": "2011-12-05",
            "source": "rt"
        },
        {
            "content": "I'm sure I'll get a lot of flak from the lads for this,  but I'll give it a 6.  Definitely better than the 3.9 (out of 10) on IMDB.  I enjoyed it, but then again, I like watching fashion shows, flipping thru Architectural Digest and dreaming of exotic locations.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "The cultural insensitivity is appalling; adding on to the already heavily prevalent Ignorant American stereotype--and the less said about the gay men in the beginning, the better.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "If you liked the show then you will like the movie.Nothing much more can be said than that.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "In this pretty good sequel thats over long with little reason for existing manages still too be entertaining and engaging.If your a fan of SATC it's always a great thing to see these girls no matter where they end up.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "The first one is WAY BETTER than this one. Dissapointed!",
            "review_date": "2011-11-30",
            "source": "rt"
        },
        {
            "content": "abu dhabi doooo! not perfect, but better than the first one. not sure what's up with everyone else's reviews? i mean reeeally, these girls can do no wrong, right?",
            "review_date": "2011-11-25",
            "source": "rt"
        },
        {
            "content": "Nt as good as the first but still good girl fun.",
            "review_date": "2011-11-22",
            "source": "rt"
        },
        {
            "content": "i liked it but i can understand why i'm the only one",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "I think viewers who have traveled and lived abroad, or have been to some other far away place, whether mental or physical, can relate more to this movie. As a fan of Sex & the City, the television series, it was difficult for me at first to remove myself from that bind, of having the expectation that punch lines, life lessons, and themes were going to be packed neatly in a 40 minute segment. However, the script, for the most part, achieves the goals for this full-length movie format. The characters are who we expect them to be, we are taken on an adventure that's fun, and reflective. My only complaints, though, is that elements in the screenplay could have definitely been fine tuned. That Carrie-voiceover that fans of the TV series are so accustomed to hearing, where she neatly packages her lessons into a few words, doesn't function quite right in the movie. Also, the relationship the characters have with each other, what impact they make on each other, and how they urk/comfort each other and under what circumstances, could have been tighter. With that said, though, this movie is a fun adventure with no shortage of dramatic moments that encourage viewers to see that no matter how far away we look, how hard we look, sometimes, what we needed was right in front of us all along. Further, this movie (not unlike the television show), really pushed the envelope! I mean, it pushes the boundaries by including a gay wedding, signifying the transformation of the meaning of weddings and commitment in our modern society, and unlike most, no, ALL romantic comedies, it really makes a powerful commentary on modern marriage--the juggling the hustle and bustle of work, friends, and lovers.",
            "review_date": "2011-11-20",
            "source": "rt"
        },
        {
            "content": "All the statements about womanhood are trite and tired. It's almost embarrassing to admit finishing the movie.",
            "review_date": "2011-11-19",
            "source": "rt"
        },
        {
            "content": "Basic chick flick with nothing overly exciting or special about it.",
            "review_date": "2011-11-16",
            "source": "rt"
        },
        {
            "content": "Can't go wrong with SATC 2 if you're a true fan. Loved all my girls in this, especially my girl Samantha!",
            "review_date": "2011-11-13",
            "source": "rt"
        },
        {
            "content": "As girly as it's always been~\r\nLess glamorous NY, more (whatever it is) Abu Dhabi, but as long as we still have Carrie's one-liner and all those sparkling eye-catching things on the screen, who cares?",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "The only thing this has in common with the show is the name alone. The story was bat shit stupid and I found it to be low key offensive when it tried to tackle the subject on religion. Charlotte still continues to be that annoying high maintenance cunt that we call a friend for association purposes alone. How this got the green light is beyond me but its safe to say that this movie strayed too far from the mythos the show and first movie created and turned it into that one night stand we put up a paper bag on. The brand is now tarnished.",
            "review_date": "2011-11-10",
            "source": "rt"
        },
        {
            "content": "I actually really enjoyed the sequel more than the first one! Despite the hideous clothing worn by all...it's just like watching another episode of the show! I also love how they portray how much lifestyles change once married...",
            "review_date": "2011-11-08",
            "source": "rt"
        },
        {
            "content": "When the best scene in a movie features Liza Minnelli singing \"Single Ladies\" at a gay wedding, you know you're out of your comfort zone. However, so long as you're happy to suspend your sense of reality and turn a blind eye to the lack of depth in story, you'll still find some amusement amongst the Hollywood sparkle. Haters will continue to hate it, but it's not for them anyway: Sex and the City 2 gives fans what they want and for a mutual this second cinematic bite of the apple far exceeds expectations and is a significant improvement over the 2008 movie.",
            "review_date": "2011-11-06",
            "source": "rt"
        },
        {
            "content": "carrie on..not working",
            "review_date": "2011-10-21",
            "source": "rt"
        },
        {
            "content": "Worst movie I ever saw.",
            "review_date": "2011-10-08",
            "source": "rt"
        },
        {
            "content": "nowhere near as good as the first",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "best part the clothes and the shoes and THEEEEE closet",
            "review_date": "2011-09-25",
            "source": "rt"
        },
        {
            "content": "I was warned this would be terrible. Perhaps that's why I rated it so highly. I was expecting awful, and this wasn't that bad if you get past the tremendous amounts of makeup and frequent wardrobe changes.",
            "review_date": "2011-09-24",
            "source": "rt"
        },
        {
            "content": "I love my girls and an avid fan. You want to like it and want to enjoy it but it blows in your face. this movie completely destroy the essence  & magic of SATC. Ultimately, what made the TV show memorable and meaningful was the wonderful friendship between its four female leads. Instead I get four  ladies whining about their lives, so they decide to take a trip that completely had no point or heart. they made my adorable characters unlikeable. It was over the top, crass, plot-less, pointless, shallow, immature and a big disappointment. My SATC bubble has been burst.",
            "review_date": "2011-09-23",
            "source": "rt"
        },
        {
            "content": "This is one of the worst movies I've ever seen - and believe me: I have seen quite a lot. A movie that should never have been produced in the first place!",
            "review_date": "2011-09-22",
            "source": "rt"
        },
        {
            "content": "it uas cool as a tvs,  it lasc an apsod rili",
            "review_date": "2011-09-20",
            "source": "rt"
        },
        {
            "content": "Ihan hirveetÃ¤ sontaa...  jopa sunnuntaileffaksi... :/",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "I'm sorry, girls! But only 2 stars from me! And only because I love you so much! But the movie was just so trashy! There was no sense in the movie! No aim, nothing! No sex and no city! I'd better stick to series.",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "So, taking out the sex and the city, not such a great idea...",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "De film wordt fijn ingezet als vervolg op de serie en de eerste film. Het laatste deel van de film is wat minder.",
            "review_date": "2011-08-31",
            "source": "rt"
        },
        {
            "content": "The series was definitely better than either movie, but we liked it--how they touched on everything fr being an overwhelmed mother worried ab infidelity (charlotte) to going thru menopause but being a tough cookie (Samantha) to being an underappreciated working mother in a man's industry (Miranda) to settling in to marriage wo kids despite pressure to have them (carrie). There were some silly parts like the horrible karaoke but we still liked it.",
            "review_date": "2011-08-30",
            "source": "rt"
        },
        {
            "content": "worst ever! feeling shame that i love those girls once!",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "Two and a half hours of my life I will never get back. Carrie is still a nag and defines self-centred. Convoluted plot and inane dialogue.",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "rated R for a reason peeps.",
            "review_date": "2011-08-24",
            "source": "rt"
        },
        {
            "content": "It's over-produced, over-thought and over-done. Even die-hard fans will feel cheated.",
            "review_date": "2011-08-20",
            "source": "rt"
        },
        {
            "content": "This is, quite possibly, the worst movie I have ever seen.  And I've seen Brown Bunny.",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "Just ok...probably not my kind of movie...not sure if the target audience like very much though....",
            "review_date": "2011-08-15",
            "source": "rt"
        },
        {
            "content": "Is it posssible to make an even bigger piece of shit then the first???  Yes Yes it is",
            "review_date": "2011-08-13",
            "source": "rt"
        },
        {
            "content": "I liked it :) Charming, funny & dramtic. Very well acted.",
            "review_date": "2011-08-13",
            "source": "rt"
        },
        {
            "content": "Were they trying to make a bad movie?  Zero stars. Awful!  Terrible from the very first second î?? ...",
            "review_date": "2011-08-11",
            "source": "rt"
        },
        {
            "content": "having enjoyed the first film i was disappointed with this movie. it was just to long with a large amount of nothing going on. it was good when things like meeting aidan and the bedroom TV as a present but there wasn't enough of that. hit and miss this film was,",
            "review_date": "2011-08-10",
            "source": "rt"
        },
        {
            "content": "Genuinely could not give a damn what critics say about this film, I love it and think it's fabulous. Liza Minnelli doing Single Ladies will never ever stop being funny",
            "review_date": "2011-08-08",
            "source": "rt"
        },
        {
            "content": "Ce film a eu de très mauvaises critiques, mais Sexe à New York reste Sexe à New York, quand tu aimes les personnages tu ne peux pas ne pas aimer voir la suite de leur histoire! Sex and the City will stay a classic ! Those girls are amazing !",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "....Dubai looked amazing....",
            "review_date": "2011-08-06",
            "source": "rt"
        },
        {
            "content": "I kinda liked it a bit better than the original one, but not sure why...probably because I've never been a fan of the Mr Big character, and seeing them with issues made me happy.\r\n\r\nOther than that, it was pretty much what I expected...lots of fashion and little substance.",
            "review_date": "2011-08-06",
            "source": "rt"
        },
        {
            "content": "Kim Catrell great! SJP a horror :(",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "This is a travesty to America's victims of the Great Recession. I don't care what the original Sex & The City show was about, but this one seems to be filled with materialism. And if they're going to Dubai, why didn't they have to wear Burqas or something like that?",
            "review_date": "2011-08-05",
            "source": "rt"
        },
        {
            "content": "prob wud have been beta if id seen the first 1 b4 lol",
            "review_date": "2011-08-04",
            "source": "rt"
        },
        {
            "content": "This movie was so bad that I don't think I will be able to watch the series again for a looooong time.  Or perhaps I will sell the dvds off to some one else.  It's disappointing to find a movie filled with lude, obnoxious jokes fulfilled by tired looking women who have been over stretched and with too much make-up...hardly cutting edge anymore!  I thought it was prejudiced, classist, sexist (yes, that's right!), and down right disgusting.  Ick!!!  And shame on them for making this movie, as a mother, I would give them time out.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "Long, boring, just unnecessary sequel, don't bother making a third one. If you're a SATC-fan, it's a big disappointment.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "Overindulgent hedonistic melodrama which lasted far, far too long at two and a half hours! Not a patch on the original Sex and the City film. What a pity.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "Having been prepared for a shocker I absolutely LOVED this film. \nMaybe it was the fact I was overtired, a tad emotional and drinking vino.. either way it did the trick. Easy to watch, no brain power required and lots of pretty clothes and shoes to look at. Simples.",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "bout 2 hours to long :)",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "there was no need for this film, enjoyable but pointless",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "silly, foolish, idiotic, clumsy, lame, and most of all, unnecessary.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Nothing offends me... This offended me. The outfits, lack of respect for other cultures and the god awful story.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "Probably the worst film I have ever had to watch.",
            "review_date": "2011-07-30",
            "source": "rt"
        },
        {
            "content": "I can see how some people may have found this movie offensive, but as long as Samantha is in it, it's going to be pretty funny. Not even nearly as good as the television show, but still watchable.",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "I can't believe I watched this all the way to the end just to see if there were any redeeming features.\r\n\r\nThis movie gave me a terrible impression of Americans abroad and brought back some bad memories of travelling to the same locations as them which is a shame because I have met some amazing Americans on my travels and this sadly is the stereotype.\r\n\r\nThe best scene in the whole film is the gay wedding right at the start. Fabulous!! All downhill from there. By the end I felt like wringing their whiny little necks.",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "Adorava a sÃ (C)rie e gostei do 1Âº filme, mas a sequela nÃ£o faz sentido...quase 2h15m de filme em que nos mostram mais do mesmo...",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "ABSOLUTELY LOVED THIS FILM.\nBut ....not as good as the original.",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "Oh god.  Bitchy women talking about nasty sex.  Oooh, and Parker, who badly needs some sort of face work, the star.  And New York, where nasty is to the bone.",
            "review_date": "2011-07-24",
            "source": "rt"
        },
        {
            "content": "They must be trying to ruin it for everyone. Bad bad bad...",
            "review_date": "2011-07-24",
            "source": "rt"
        },
        {
            "content": "Not as good as the first one. over-the-top outfits and colour everywhere but so much included that wasn't necessary, like the offensive Muslim stuff and farce of their escape. They girls are all starting too look old, which makes pulling off the fake tan in Sarah Jessica Parker's case, so much more difficult. I wanted to see more of the other character. Great to see Aiden.... finally someone who aged well.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "Absolutely ruined Sex and the City for me, terrible movie!",
            "review_date": "2011-07-21",
            "source": "rt"
        },
        {
            "content": "HOW MUCH IS THEIR TO TALK ABOUT SEX, this movie is unfunny, goofy, and is really shallow with stupidity so bad, that its so scary. Sex And The City 2 is a waste of a movie and a sequel that it deserves a lot of razzie nominations.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "All I would say is this: before you bitch out about this movie, you better be sure you have seen all TV episodes and previous movie. Some people don't understand the whole TV program and yet they just lash it all out as if they're the experts of the message behind it all. I love the whole Sex and the City and was definitely sad that they're not making any more TV episodes. One can actually learn a whole lot of stuff through its seasons. Watchers are all different, some may get shocked into too much sexual content, but that's the reason why there are four different unique characters in this whole story. One can find himself/herself in each situation. Learn from it instead of thrashing it. Anyways, Samantha never fails me. She's the best darn character I've ever encountered in this broadcast industry. It's definitely a fun movie. All who think otherwise need to get laid. Nuff sed.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "I loved the SATC series on HBO but this movie was a turd.",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "so funny, keeps being original and fascinating",
            "review_date": "2011-07-18",
            "source": "rt"
        },
        {
            "content": "Horrific, offensive, poor, crass and stupid.",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "I loved this movie! I really don't understand all the negative reviews it has received.\nIt's full of fun and fashion and witty dialogue. I love the friendship between these 4 ladies and I really hope they make a 3rd movie.\nMy only negative is Kristen Davis who isn't a very good actor in my opinion but I still love Charlotte.",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "A bit disappointing. Especially the beginning of the movie. Just plain odd. I love the series so I still enjoyed it!",
            "review_date": "2011-07-10",
            "source": "rt"
        },
        {
            "content": "Even Kim catrall can't save this despicable excuse for a movie.",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "Almost as self-indulgent and backwards as \"The Boondock Saints\"",
            "review_date": "2011-07-03",
            "source": "rt"
        },
        {
            "content": "Enjoyed seeing the interesting fashion in the movie. The movie lacked direction of the original, but I guess the fun gets taken out when Carrie is no longer Bradshaw, but Preston.\n\nFelt very episodic with the situation the ladies get up to. Even now, watched this today, I already forgot what I watched, which is not a good sign.",
            "review_date": "2011-07-03",
            "source": "rt"
        },
        {
            "content": "Shallow, superficial and just not entertaining. My girls deserved better.",
            "review_date": "2011-06-30",
            "source": "rt"
        },
        {
            "content": "Oh my goodness, so funny!",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "FREE MOVIE WEEK REVIEW #2:  \"Sex in the City 2\" is the \"The Godfather: Part III\" of  \"Sex in the City\" movies.  It looks great, it entirely lacks substance, and it's all but betrayed it's core characters that made it so damn appealing in the first place.\r\n\r\nI love these girls.  But they are kind of grotesque and cartoonish here.  Especially Carrie Bradshaw.  I am used to ROOTING for Carrie... not wishing her ill will.  Samantha smears a lot of hummus on her face and porks a lot, as usual, and Miranda remains as affable as ever.  But what they've done to Charlotte is has to be (by now, and far and away) considered a sin.  In the first movie, Charlotte hardly-enjoyed a severe case of the shits.  In this one, they gave her a camel toe.  Nobody involved seems to really care much about these characters any more.  Burkas are even slapped upon them.  Michael Patrick King is almost like the mad surgeon in \"The Human Centipede: First Sequence\" to his once-beloved New York babes.  He cruelly sews them ass-to-mouth, ridding them of their once-appealing humanity.  They are now 4 annoying Betty Whites with orange-y spray tans.  Strutting obnoxiously in the Arab Emirates.\r\n\r\nWith all this money at stake, HBO coulda made a slammin' \"Sopranos\" epic.  Oh, well.  There's always \"Not Necessarily the News: The Motion Picture\", coming soon NEVER.",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Wife made me watch it!",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Lots of stereotypes and even more product placement.",
            "review_date": "2011-06-26",
            "source": "rt"
        },
        {
            "content": "Loved it! Had heard so many bad things about this film that I was expecting the worst, but me and the cat loved it. The first ten minutes is quite clearly ridiculous - but the rest of the film was great fun. I'd goes as far to say that out of the two movies; this is the more memorable and the one that I would choose to re-watch.",
            "review_date": "2011-06-26",
            "source": "rt"
        },
        {
            "content": "Not enjoying Carrie at all in this movie....Pretentious...Samantha remained true to form which was refreshing!",
            "review_date": "2011-06-26",
            "source": "rt"
        },
        {
            "content": "The concept is getting washed out.",
            "review_date": "2011-06-25",
            "source": "rt"
        },
        {
            "content": "Will say this if you have not seen the series or the film you will hate this with in the first 1/2 hour. But on the other other hand the film like first feels like a season pushed into 2 and 1/2 hrs  of raunchy comedy and drama",
            "review_date": "2011-06-24",
            "source": "rt"
        },
        {
            "content": "Sarah Jessica Parker is once again great is this role. The cast is also good in this second movie.",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "Even the poster looks ridiculously fake. Ugh! The girls appear as fabulous as usual (with all the perfect make up). They sure live for fashion and do worship them everywhere they go! However, the plot was a bit sort of sloppier than the first movie and poor my Samantha... No more movie pleaseeeeeeeee :(",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "Every copy of this film should be destroyed. No redeeming features whatsoever.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "This film is dreadfully overlong, talk about 146 minutes long, come on! This film has lost some of it's elements when the story goes to the 'new' Middle East. I wouldn't be surprised if The Middle East would actually ban this film for what it contains.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "This movie wasn't horrible, but I don't see it as a fitting conclusion to the series.  The first film ended the stories on a great note, and I really didn't see the need for this sequel.  That being said, it was fun to spend another couple hours with these characters.  I am completely guilty of not wanting to let them go, but this movie solidified that it's time to do just that.  However, the wedding scene was a ton of fun, especially the appearance of Liza Minelli.  Overall, worth watching for fans of the series, but don't get your hopes up.",
            "review_date": "2011-06-16",
            "source": "rt"
        },
        {
            "content": "Only watch this drivle if you are a die-hard fan, and have bought into the franchise. It is sappy, simplistic and oh so precitctable.  The girls' escapades from NYC to Abu Dhabi get a little old and cliched, as do they! In short, don't waste your time!",
            "review_date": "2011-06-14",
            "source": "rt"
        },
        {
            "content": "They don't get much worse than this.",
            "review_date": "2011-06-13",
            "source": "rt"
        },
        {
            "content": "There was something oddly watchable about it.",
            "review_date": "2011-06-13",
            "source": "rt"
        },
        {
            "content": "No need to look for depth, but the fashion and glamour made it a good movie.",
            "review_date": "2011-06-13",
            "source": "rt"
        },
        {
            "content": "nothing much to say....just wanna support them!",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "Enjoyed the ending and now makes me want to visit Abu Dabi in style like the girls!",
            "review_date": "2011-06-12",
            "source": "rt"
        },
        {
            "content": "Not as bad as I was told it was.  Not as good as it should have been.",
            "review_date": "2011-06-07",
            "source": "rt"
        },
        {
            "content": "Sex & the City: 2 ~ ARGH. No plot, no storyline, not funny except the nanny, it was one big fashion show with HORRIBLE clothing & even worse makeup. 4 beautiful women made up to look like Frankenstein characters.  WHAT A SHAME, as the FIRST movie was FABULOUS!!!",
            "review_date": "2011-06-06",
            "source": "rt"
        },
        {
            "content": "Had to see this as an avid Sex and the City fan of the series and the first movie, but everyone was trying too hard in this second movie. Except for the script, which was shallow and truly disappointing.",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "Not nearly as bad as I'd heard it would be.  However, I did have the advantage of watching it in 15 to 30 minute chunks over 3 or 4 days; if I'd watched the whole, long thing in the theater, I may have been bored and frustrated, too.\n\nAnyway, it's no different than any episode of the series, full of horrible puns (Charlotte's lingerie-challenged Irish nanny being referred to as \"Erin Go-Bra-less\" was just BAD.), fabulous fashions, pointless cameos, and glamorous scenery.  Before they leave for Abu Dhabi, all the \"girls\" have interesting problems:  Charlotte is frustrated with motherhood; Miranda has a stressful job and a sexist boss (Ron White!); Samantha is waging a futile battle against menopause, with a variety of pills and potions; Carrie is afraid Big just wants to lie on the couch, order in, watch tv, and never go out again.  When they get to the UAE, things get a little ridiculous (including a flimsy excuse to get them all in burkas, when really, Samantha probably would have been arrested and/or stoned), but the appearance of Aidan is interesting.\n\nIn conclusion, I didn't hate it, and I would watch another one if they made it.  What can I say?",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "Hideous! Lazy writing and tired jokes are no substitute for creativity and plotlines. And whatever happened to Samantha's character?! Poor Kim Cattrall is reduced to acting and lines that would not be out of place in a Carry On film. She deserved better and so do we. Still, worth a look to see Liza Minelli doing possibly the world's worstl cover of  Beyonce's 'Single Ladies'.",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "SATC2 isn't nearly as bad as everyone says it is. I think the critics were all biased by some seriously high expectations (what boundaries and taboos are left for these women to break??). In truth, the movie does push the limits of common sense and reality, and you might have to be a fan to like it, but in the end, it's a fun chick flick. Take it for what it is, and you might enjoy it.",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "i liked this movie but i do have to say the first one is better",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "It was funny,but disgusting sometime because of Samantha's behavior. Still, I laughed a lot, and I didn't look into a well-composed story, so it was just good!",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "Vous cherchez du bon goÃ»t et de la subtilitÃ (C) ? Ce n'est pas ici que vous trouverez Ã§a ! Je me demande encore pourquoi j'ai regardÃ (C) ce film de pÃ (C)tasses superficielles aux tenues de crÃ (C)ateurs les plus moches et ridicules les unes que les autres, on est bien bien loin de la sÃ (C)rie...",
            "review_date": "2011-06-02",
            "source": "rt"
        },
        {
            "content": "Not as good as the 1st one, but I'll still see it regularly to get my Fix",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "There really was no reason for this film to EVER be made! I'm not saying it was the worst film ever just simply self indulgent and pointless whilst marring characters that were once quite likeable.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "I was angry the first time I saw this. Why must good things always be taken too far? The first movie was okay, but this one had too many puns, not enough of New York and just a hint of racism. I think I will stick with watching the tv series.",
            "review_date": "2011-05-29",
            "source": "rt"
        },
        {
            "content": "There is NO excuse for how bad this movie was.  It's so out of touch with the world that it's actually offensive and not in a sexual like the title might lead you to believe.",
            "review_date": "2011-05-28",
            "source": "rt"
        },
        {
            "content": "While I am a huge SATC fan, I can't say I really enjoyed this sequel movie. It seemed disjointed, unnecessary and a little over-the-top, even for SATC. It didn't have the same vibe as the original series, or the first movie. Even the clothes were a little \"off.\" I think I may just pretend it was never made.",
            "review_date": "2011-05-23",
            "source": "rt"
        },
        {
            "content": "OK, not as good as the first film",
            "review_date": "2011-05-23",
            "source": "rt"
        },
        {
            "content": "Terrible as a movie, not so bad as a fashion and travel show.",
            "review_date": "2011-05-21",
            "source": "rt"
        },
        {
            "content": "This movie illustrates why there should be no sequels.  It was awful!",
            "review_date": "2011-05-20",
            "source": "rt"
        },
        {
            "content": "Me encanta la parte en donde las minas vestidas de fiesta y tacos altos camian por la arena del desierto... nos hace ver muy inteligentes y poco superficiales....Jesica Parker icono de la moda? Prefiero mis jeans y zapatillas...=)",
            "review_date": "2011-05-19",
            "source": "rt"
        },
        {
            "content": "The story line is pretty draggy. Just like the first one",
            "review_date": "2011-05-15",
            "source": "rt"
        },
        {
            "content": "I dont really understand why they made a second one. The first one ended so nicely. I just don't understand why a second one was needed. It was okay. It had a few funny lines, but it was nothing special.",
            "review_date": "2011-05-08",
            "source": "rt"
        },
        {
            "content": "Very disappointing :-(",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "Great chick flix!! :)",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "Cliche-ridden camp. I liked it!",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "I love the series (don't judge me on that). This was not the quality of the series. The best part was the intro where we get to hear how they met each other. I just cringed so many times in this movie. I was like embarrassed for it. Horrible writing in a series that I think had fantastic writing. I just cannot get over how bad bad BAD it was. To me this is not Sex and the City.",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "well, to say that this was the worst movie i've seen in a while would be quite the understatement. this movie offended every single sensibility inside of me. how are they making me a third one?!",
            "review_date": "2011-05-03",
            "source": "rt"
        },
        {
            "content": "I love Carrie Bradshaw.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "Worst film I've ever seen. Even worse than disaster movie. The is NO story in this film.. It's just like a holiday video",
            "review_date": "2011-04-30",
            "source": "rt"
        },
        {
            "content": "Filme perfeito da noite. Este eu super Ã?ndico ;-)",
            "review_date": "2011-04-28",
            "source": "rt"
        },
        {
            "content": "The trailer made it look like another Ishtar - to be honest, it didn't do much more than stir up old stereotypes to give the girls something to bounce off of - but Carrie and Charlotte's new angst in wedlock, Samantha's frustration as an aging vixen, and Miranda's new role as the fountainhead of positivity kept the engine going full throttle. And it was thrilling to see how Carrie's married life turned out just the way I thought it would: a complete bore!",
            "review_date": "2011-04-25",
            "source": "rt"
        },
        {
            "content": "O figurino vale o filme! De resto e' muito fraco!",
            "review_date": "2011-04-24",
            "source": "rt"
        },
        {
            "content": "possibly the stupidest movie ever.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "It wasn't near as nice as the first one! Kinda of silly actually and the outfits were horrible!!",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "They should have stopped with the first movie which was awesome with lots of class.  This movie sucked.  Terrible acting, no connections, terrible....so sad!",
            "review_date": "2011-04-22",
            "source": "rt"
        },
        {
            "content": "Not funny at all, and a pale shadow of the tv series.  I was hopeful when this came up on the airplane, despite the bad reviews, but that was a mistake.  Just goes to show you, you should always trust the Tomatometer.",
            "review_date": "2011-04-20",
            "source": "rt"
        },
        {
            "content": "Watched 15 minutes and had to walk away. Couldn't do it! Reminded me of the Crypt keeper. ..",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "not as bad as I expected. nice to see the characters again. I think I actually liked it better than the,first in the sense that the characters acted as we expected. at least this time Steve & Big didn't come out as asses.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "It seems like the whole movie was filmed just to show off the over the top, sometimes seriously aweful fashions these ladies wear. If you really want to kill 2 hours, go ahead and see it.",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "I liked it more the 1st one. I think thats because of the Middle East ! Its Beautiful!!!",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "It might be the best movie ever for SATC fans, but for the rest of us... a two star is very, very generous.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "they were wrong for this movie. but i did like all of miranda's clothes & accessories.",
            "review_date": "2011-04-16",
            "source": "rt"
        },
        {
            "content": "SATC2 = Horribly Unlikable People and the Desert. Awful awful awful. \n\nAWFUL!",
            "review_date": "2011-04-16",
            "source": "rt"
        },
        {
            "content": "As a fan of the Sex and the City franchise and seeing that both the series and the first movie were so well crafted, expectations were high for Sex and the City 2.  But writers Michael Patrick King and Candace Bushnell dropped their martini glasses and the end result was a borish flop that insulted legions of SATC fans and did no justice to the charactetrs.\r\n\r\nThe story begins two years after Carrie wed Mr. Big, Charlotte has two children to take care of, Miranda is having trouble with her boss, and Samantha is doing what she does best.  None of these plot lines were interesting nor expanded on the major players' lives.  There was no growth and it seems that the sole purpose of the movie was to remind us of how fabulous these four women are.  The problem is that we already know they are fabulous and don't need that fact rammed down our throats.  \r\n\r\nBut the major insult was that these characters came across as stupid which is something they never were portrayed as in the past.  They may have done stupid things from time to time but never did we the audience think them frivolous.  For example, Charlotte (Kristin Davis) bakes cupcakes with two small daughters wearing a Valentino skirt and heels? Miranda (Cynthia Nixon) can't handle her chauvinistic male boss?  Samantha (Kim Cattrall) blows a very lucrative international PR deal?  Carrie (Sarah Jessica Parker) has trouble being faithful to Mr. Big (Chris Noth)?  No.  No.  No.  And no.  None of these plots lines are believable given the context into which these characters have previously been placed.\r\n\r\nShame on the writers for doing such a disservice to loyal fans and to the beloved characters!  We can only hope that if the producers deign to do a SATC3 they think long and hard about returning the franchise to its rightful place of intelligent comedy.",
            "review_date": "2011-04-14",
            "source": "rt"
        },
        {
            "content": "Don't get me wrong I LOVE sex and the city but too many movies might kill it",
            "review_date": "2011-04-12",
            "source": "rt"
        },
        {
            "content": "Horrific! No real plot and not very well acted.",
            "review_date": "2011-04-11",
            "source": "rt"
        },
        {
            "content": "Not enough conflict and drama.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "Just horrible.  I LOVED the series but this was such a waste of my time.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "It's okay, but the plot is a bit off track.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "One of the most repulsive movies I have ever seen.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "I don't even know where to start...it is just embarrassing.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "First let me say that I love this show (and own the entire series & first movie) and the last film, however, this movie made me wish out loud that this was the final sequel. The beginning was awesome. I absolutely LOVED the wedding scene. It was fun and just plain wonderful. After that, my excitement for this movie went downhill quickly. Carrie Bradshaw is in one of her spoiled, self-absorbed moods. Of course, she gets her way in the end. Did she really learn a lesson?  Miranda barely has a storyline and Charlotte's was the most identifiable for most women and it seems quickly shown and quickly resolved. Samantha, whom I love, was obnoxious. I found myself a little offended that they would have her character in a country where she is old enough and mature enough to respect their cultures and she blatantly defies it. That may have been meant for comedic effect but it wasn't. It was really in bad taste. They should have kept the girls in the City. That would have saved this film.",
            "review_date": "2011-04-09",
            "source": "rt"
        },
        {
            "content": "Only because I couldn't rate this any lower. I really wish I hadn't spent two hours of my life watching this movie.",
            "review_date": "2011-04-07",
            "source": "rt"
        },
        {
            "content": "This movie was an insult to the entire series, and to Islamic people. It made the assumption that Arab women want to be ridiculous oversexed, horny menopausal white American women in Gucci over adhering to their culture and faith. And I'm not Islamic or religious for that matter. HATEDDDDDD IT!",
            "review_date": "2011-04-07",
            "source": "rt"
        },
        {
            "content": "The worst movie I have ever seen and I loved the TV series.",
            "review_date": "2011-04-06",
            "source": "rt"
        },
        {
            "content": "Disappointed, fashion was great but that's not all that makes a good movie...",
            "review_date": "2011-04-05",
            "source": "rt"
        },
        {
            "content": "Okay, I was a fan of the series. I even liked the first movie. This sequel, however, crosses the line between wistful fantasy and total disconnect from reality. Not to mention there are some massive culturally insensitive moments. Underneath their burqa women all across the world want to be fashionistas, really? What a terribly solipsistic, Westnocentric idea. Ugh. This gets one star for a redeeming moment when Charlotte and Miranda discuss motherhood. Period.",
            "review_date": "2011-04-04",
            "source": "rt"
        },
        {
            "content": "This was bad but I didn't think it was much worse than the previous movie or the series. WAY too long though.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "Not the worst movie i've ever seen but close.  For some reason I liked the part where Liza performed Single Ladies but that was about it.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "The really remarkable thing about SITC2 is that something about it is, in fact, good.  The conflict between Carrie and Big in their nascent marriage is presented in complex and multi-layered manner that allows the characters to develop.  Until the end, when the entire movie devolves into the big pile of crap that you've heard and read about.  Other than the central conflict, this movie is a big mess of missed opportunities, muddled plots and consumerist porn, and it's all shot as if it's a TV show, only on a really big screen.  There's a good story in here, but perhaps they lacked the courage to make it.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "I kind of knew deep down that this wasn't going to be great, but thought I'd give it a go. I would say that the first 70% of the film was awful! It was full of meaningless moments and lots (and I do mean LOTS) of cheesy one liners. It just about pulls it back together again towards the end when the girls get together to help solve problems of the heart - which is what made the show such a success AND the reason why it gets an extra half a star in my rating. I wish they'd skip this movie all together and just make another season, based on the formula that got us all hooked on it in the first place.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "Still missing the edge that made the TV series.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "I was a huge fan of the tv show and liked the first movie, but didn't go to see the sequel in the theater because the reviews were so bad. I finally watched it on cable today. Way too few scenes had any heart and everything else could have been written by a bunch of monkeys, or your average network sitcom writer, locked in a room with typewriters. When it wasn't making a stereotypical gay joke or another one of Samantha's sexual quips (few of which were funny), it was just downright offensive towards Muslim culture. \"I am woman, hear me roar\" karaoke, really? I really hope this was the end. I love these characters and this was a sad, sad note to leave them on.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "I watched Sex & City 2 for the first time last nite on HBO.  I am sooooooooooo glad I didn't spend any money on this crap(I started to call it a movie, but that just doesn't seem to apply here). No wonder so many Muslim countries hate us. If this is what the film makers think an American audience, especially women, want to see, then they don't know the first thing about us or have any idea how ignorant and rasist they are.",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "not as good as the first but still enjoyable for a fan!",
            "review_date": "2011-04-02",
            "source": "rt"
        },
        {
            "content": "Seniors pretending to be young....PATHETIC!",
            "review_date": "2011-04-02",
            "source": "rt"
        },
        {
            "content": "As I watched this torturous epilogue to ironically successful television series, I kept asking myself one question: Is this OVER yet? At more than two and a half hours, I couldn't help but feel pain for real movie critics who were forced to watch this. To begin with, no movie needs 40 minutes of exposition, and they certainly don't need as many subplots, which by the way, only doubled the damage of the already thin and dull script. This film could have been half the time and told the same story, but instead, it had to be dragged on, and on, and on,...\r\nGone are the days of the hilarious HBO series, instead, we open at a gay wedding hosted by Liza Minelli, and eventually we progress to Samantha meeting with an old client of hers, and is invited by one of his friends to visit his new resort in Dubai, in hopes she can make it huge in the USA, drawing thousands to it. As an added incentive, he pays for her and the gal pals to go visit for a week. Things get complicated when both old and new faces show up, and Samantha predictably sleeps with every guy at the resort.\r\nThis film was a nightmare to watch, and I feel pity for everyone who suffered with me. You wanna see the girls at their best? Rent some of the TV show, and save yourself two and a half hours of cheesy, filthy, thin story I cannot get back.",
            "review_date": "2011-04-02",
            "source": "rt"
        },
        {
            "content": "This wasn't my choice of film to watch but it was much better than I thought it was going to be. I actually laughed out loud a couple of times! Really long though.",
            "review_date": "2011-04-01",
            "source": "rt"
        },
        {
            "content": "It was much much better than what I thought and it was so so so funny.\n:P",
            "review_date": "2011-03-31",
            "source": "rt"
        },
        {
            "content": "Well, the movie is about 2 hours and 26 minutes if I recall and I gotta say I found it quite funny.  Kim Cattrall made this movie funny to me as her character is so much into sex, you'd swear she was a guy dressed up as a woman. :)  There are times this movie was extravagant but going along with the whole theme of the film, it kind of made sense.  And you get to see how disfunctional Carrie Bradshaw really is.\n\nAll I can say is that it is a funny movie and it can show how some people are and how some people, even when they have all that they want, truly aren't happy still.  But in the end I think she grows up at least a little bit more.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "I love both the HBO series and the first movie - this steaming pile of garbage partially defaces their legacy. So I hate it on multiple levels.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "Full of awkward moments and tired jokes; it's time to let SATC go already.  Check out my full review at http://www.gettingreel.blogspot.com/",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "It shoulda been retitled 'The Boring Housewives of a Formerly Brilliant TV show',  as SATC2 plays like an R rated cartoon of the series. The characters 'sorta' act like themselves, however, 'a- nothing new-watered down, over the top version' of who we thought we knew. MPK writes and directs (for SATC3, let's allow him to direct only) a mostly flashy, substanceless, meaningless and hence, no care for what happens at all to Carrie and the gals. Whoever said opulence has to be superficial ONLY is wrong. There could be an understanding of the importance of glamour in this post (?) recession world and elevate these characters to a new place without sacrificing their inner core. This film does neither. Other than the ridiculous costumes and 'what will they do next' curiosity, what kept me going was my anger at the offensive lack of story (most scenes are stretched out 'set pieces' meant to entertain at the lowest level), and trying to figure out why this film was made other than a guaranteed paycheck. I'm shocked that Sarah Jessica Parker and Kim Cattrall would agree to this script. Except for a few good lines, and an ending that picked up 'a bit' (if not enough) of steam, SATC2 makes the girls look like one of the Housewives on Bravo with very little impulse control. It's as if they've learned nothing in 10 years and have regressed to childlike behavior...and it's not funny. This may be the death nail in the series unless I take a stab at the threequel.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "Having loved the first movie and been a fan of the series for years i was initially very excited to see Sex and the City 2, i had high hopes and even higher expectations but unfortunately the characters id learned to love took a turn for the worst.\nFirst off the movie starts in a paralell universe where Stanford marries his nemises Anthony. I found this to be a horribly stupid unrealistic idea, oh sure the two token gay guys get married even though they cant stand eachother. How convenient.\nCarrie (whom ive always loathed) is more unrealisticly self obsessed than ever, she finally married the man of her dreams and he is a wonderful husband to her, but she obviously hates being married and acts as if the whole thing was a horrible mistake. I honestly thought they would have a baby and be happy but they pride themselves in chosing to never start a family, which i understand because someone as self obsessed as Carrie could never care for a baby.\nCharolette's dreams of getting married and having babies is crushed when motherhood becomes too hard for her as her parenting skills deteriorate and her focus is 100% on the nannies boobs and her husbands interest in a woman who isnt crying in the closet hiding from her children all day. \nMiranda finally decides that she likes her son enough to acknowlege he exists and quits her job to take responsibility for her kid. (SNORE) Samantha (now officially an elderly spinster) is more sexualy reckless than ever, and here i was hoping she would find and marry Mr.Right and grow up like the rest of us. \ni honestly think this movie is insulting and outrageously offensive to wealthy middle aged new york women. I mean the series made women look bad from the start but this movie is the climactic trainwreck of idiotic rich women with no real problems. \nThe climax of the movie being Aiden kissing Carrie (which never would have happened in the series after he got married and had kids) and Big's reaction to Carries childish shameful behavior is buying her a huge amazing diamond ring. But of coarse he was already in trouble with Carrie for buying her a flat screen for the bed room, which makes sense if you abandon all thought and logic.\nThis movie takes the cake for cinematic disasters, and from now on will be the refference for disappointing women everywhere, sorry men with small penises, your role has been stolen.",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "I really loved it!! The scenery is amazing, as well as the fashion as always!!!!!",
            "review_date": "2011-03-23",
            "source": "rt"
        },
        {
            "content": "awesome like the TV Series and the film are just as good",
            "review_date": "2011-03-21",
            "source": "rt"
        },
        {
            "content": "omg loved this movie. Sooo much better than the first one!!",
            "review_date": "2011-03-20",
            "source": "rt"
        },
        {
            "content": "Fashion disaster, sex obsessed failure! Less laughs than the first one along with a boring and pointless plot. I wanted zombies to come in and kill them all!!  June 3, 2010",
            "review_date": "2011-03-20",
            "source": "rt"
        },
        {
            "content": "Living in the ME...this movie has a multitude of reactions in my brain that I can not collect into one thoughtful expression...but I liked it. :)",
            "review_date": "2011-03-19",
            "source": "rt"
        },
        {
            "content": "6/10: Word of advise, watch this without getting serious. It is a great escape and if you're looking for facts rather than fiction, go see a documentary. Seriously (pun intended), it's all fun and funny - just relax, sit back and enjoy the movie. It's a lot better than the first part, which I find it rather depressing .",
            "review_date": "2011-03-16",
            "source": "rt"
        },
        {
            "content": "If you are a SATC fan you will love this movie as it is not disimilar to the nature of the first movie, but those who don't can't expect any more from this film. Sure the plot is a bit far fetched and of course full of drama but really how many of us really watch it to see what actually happens to our gals? Give us the goods!! You still get the flash and bling of new york but now with the absolutely astonishing scenery of Abu Dabi! It did highlight many sensitive topics in relations to women's rights in the world today and a comparison was seen between the norms of the U.S. and that of the Middle East.\r\nOverall I enjoyed the fashion and background beauty- which is why I love these films to begin with.",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "Very good! Better than the first!",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "Self indulgent and redundant. What is the whole fuss about an unexpected kiss when the title is much hardcore?  Obviously our 4 New York girls have become grandmas.",
            "review_date": "2011-03-14",
            "source": "rt"
        },
        {
            "content": "Ridiculous! Slutty around in somewhere the local culture doesn't allow to? Do they respect the rest of the world? Or maybe the screen writer is that low educated? And if a wife cheats behind her husband, what the husband should do is buying a big diamond ring??? Gosh! Then I would love to marry to a guy and mess around every HOUR!",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "I heard so many bad things about this movie that my expectations were quite low. Maybe for that reason I didn't think it was awful as many fans of the series had said. It was an ok movie. I missed the show and the girls so it was nice to see them again. Lots of irreal situations, some really stupid, but still, I thought it would be worse. As usual Samantha is the character with who I laugh the most. Although there wasn't much happening in this movie it wasn't a horrible thing to watch.",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "Another pointless movie outing from the show that will not die. Saved from total mediocrity by the hilarious Kim Cattrall, the gorgeous clothes, the beautiful to-die-for shoes and a selection of hot men. Please god don't make another one tho!",
            "review_date": "2011-03-11",
            "source": "rt"
        },
        {
            "content": "Well, it looks like Horse Face, Menopausing Blonde, ditzy brunnette and the ginger are back, unfortunatley for me.\n\nI gave the show several chances, but it just really wasn't for me. But when they decided to make a movie about it, I said \"no thanks.\" then they made a sequel and I said \"Oh hell no.\" \n\nBut on one horrid evening, while babysitting an out of control 17 year old to make a quick buck, she decided to pop in this trainwreck of a movie. It was a big mistake to think that this wouldn't be that bad of a film. Because it is undescribably bad, here is a quick wrap up.\n\nHorse face. Liza Minelli singing Beyonce. Gay wedding. Sad attempt for punchlines. Sex. Menopause refrence. More horse face. Glamour. Glitter. Sex. Really? More Horse face? Heartfelt montage. Everybody makes up. Happy ending. End credits. Yay! No more horse face!",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "One big commercial for fashion, jewelry, food and drink, and Abu Dhabi as a holiday destination. The rest of the story is just for show.",
            "review_date": "2011-03-04",
            "source": "rt"
        },
        {
            "content": "I loved the first movie, but this one is painful to watch from start to finish. I am bummed I wasted $10 on it! I gave it 10% because there was one or two funny parts but it was so bad I can't even think of what they were.",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "I don't care what anyone says, I loved this movie! It was't as good as the first one ok but it was still great. It was funny and beautiful. I do wish Charlotte and Miranda had more screen time and family time. I was kind of hoping to know more about their lives after they came back. Samantha is Samantha and Carrie stole the show.",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "Just thought that I have finished one TV episode, it's just NOT a movie..no plot and has actually no 'tension' at all.....I guess all focus went to the fashion which is actually not very stunning. Lucky that I was not watching this in a theater.",
            "review_date": "2011-03-02",
            "source": "rt"
        },
        {
            "content": "This was horrible. I should have stopped it halfway through because it never improved.",
            "review_date": "2011-03-01",
            "source": "rt"
        },
        {
            "content": "Their story continues although not as good as the first movie I felt, but still entertaining enough to watch on a airplane to pass the time.",
            "review_date": "2011-03-01",
            "source": "rt"
        },
        {
            "content": "Nice A380 First Class, Nice Maybach...",
            "review_date": "2011-02-28",
            "source": "rt"
        },
        {
            "content": "WTF? crass is the word. [dvd 2011-02]",
            "review_date": "2011-02-27",
            "source": "rt"
        },
        {
            "content": "Was it as EPIC as the first movie? No. But being an avid SATC Fan i really enjoyed the movie,just not point on with the first movie...but Miley Cyrus makes a cameo which was awesome. Run time is a little lonh but still a good movie",
            "review_date": "2011-02-27",
            "source": "rt"
        },
        {
            "content": "horrible and hilarious!",
            "review_date": "2011-02-26",
            "source": "rt"
        },
        {
            "content": "Awsome comeback film, though makes you wonder about love abit more",
            "review_date": "2011-02-26",
            "source": "rt"
        },
        {
            "content": "Sex And The City 2 is a monstrosity. The humor is flat, the acting is terrible and so is the script. Hopefully the girls don't come back for another 'Adventure'.",
            "review_date": "2011-02-26",
            "source": "rt"
        },
        {
            "content": "Is it going too far to call a movie a hate crime? Yes? Okay, fair enough.\n\nSex and the City 2 is a hate crime. It's a film which hates women. It features four shrieking, over privileged banshees who whine and complain that they have such horrific inconveniences as two apartments, a full time nanny or a high paying career job. And I'm meant to feel sorry for these people? I don't think so.\n\nPerhaps, though, the awful indulgences mean that they will learn to find solace in little things? Oh no. Wrong again. The Sex and the City women get solace from the following things: first class flying, luxury cars, butler service, sex with strangers and shoe shopping. And that's it.\n\nThe message of Sex and the City 2, therefore, is that to be a woman is to acquire enough status to buy things or people. And if you cannot buy things or people; you must find what peace you can in watching other women doing the same thing to remove yourself from the destitute life you are currently living. Sounds pretty gross, right? Yes, thats right. Sex and the City 2 is a hate crime. Its a crime against you. If you have the misfortune to watch it; please report it to the police.",
            "review_date": "2011-02-24",
            "source": "rt"
        },
        {
            "content": "The best bit: Carrie confessed her kissing accident through a distance. Loves the excitement marriage life of Charlotte & Harry ; The marriage life of  Carrie & Mr.Big seems too romantic, weary and implausible.",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "Not even fun! BlÃ¶Ã¶rgh! SÃ¤msta pÃ¥ lÃ¤nge!",
            "review_date": "2011-02-21",
            "source": "rt"
        },
        {
            "content": "It was too much about the clothes. Should be about relationships...",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "Pretty awful. Way too long. Lots of bad one liners. Terrible acting too.",
            "review_date": "2011-02-19",
            "source": "rt"
        },
        {
            "content": "Over the top in places but typically sex and the city. Storyline was a bit flakey but worth a watch",
            "review_date": "2011-02-18",
            "source": "rt"
        },
        {
            "content": "the reason i chose to see sex and the city 2 was because i felt like bitching about chic flicks...my primary target is \"eat, prayer and love\" but the dvd-rental is more expensive because it's just released! yeah, there's an option of internet free-download but what's more miserable than watching a movie in your computer is to watch a bad movie in your computer (when the movie is good, it's easier to endure sitting in front of a computer for it)...get the logics? so the more practical and economic decision is to rent sex and the city 2 in a somehow cheaper price then watch it in your living room and get numb. haha.\r\n\r\nand, it also pleases me that  there's one person in my friend-list \"want to see it.\" (ps) i do have a sense of cinephile morality that don't bitch a movie before you watch it even when it's obviously bad. if you wanna bitch about something, name your reason articulately (i definitely try my best).  perhaps it's just the way i am, i prefer not to call you an asshole crudely, but when i do, i name all the reasons why you're an asshole without using the word asshole.\r\n\r\ni'm no agist, but i do expect maturity from people (even from myself, but i try to manage it with struggles, for sure, just like everyone!) after a certain age, but the controversy here is: what's the right age for a person to be sophisticated? for the \"girls\" in sex and the city 2, 60?! 70?! maybe the right age for them is when botox stops working on their faces. (do i sound mean?) quite often, i feel they're living in disneyland, but come on, they're all over 40! everything about this movie is absolutely artificial and far from common senses. i did mention quite often about the idea of camp, a celebration of artifice, such as my praise over knight and day...but there's a sense of sincerity in camp, yeah, a naive self-love devoid of pretentiousness. (so it's not everything bad and fake is camp)..but sex and the city IS pretentious, encapsulated within the so called avant-garde third-wave feminism, and it has great deal to do with pop-culture ideologies in women, or let's be more specific, upper-middle class white women who have nothing to do but whine about life......and their vaginas!\r\n\r\ni'd like to focus on three specific details (if you really care about synopsis, check imdb). i point them out because i consider them crucial for character-portrayals, this movie has involved a trip for these four \"fabulous\" women in \"new middle-east\" (ali abu). FIRSTLY, they emphasize in details on all the materialistic products they carry in their luggages, for example, samantha mentions about the books she carries: suzanne somers' \"breakthrough to wellness\" (serious reading to her), and she mentions something for relaxation: THE US MAGZINE. then four of them scream in hysteria. and i was thinking, what, you're over 40, and you're in a sort of exquisite society which tends to value taste (they emphasize that) and class..and the entertainment for your mind is THE US MAGZINE. are you just 16? what's so different between your mind and the mind of a high-school teenager with raging hermones? except the later doesn't need botox to look young. and, one of them is a supposedly well-reputed columnist. another one of them is allegedly a harvard-graduate. isn't it a bit too un-classy? kinda un-believable, isn't it?\r\n\r\nSECONDLY, in this trip, samantha claims to her girlfriends that it's free due to her association with some tycoon in arabian world, and she keeps saying dubai is history and abu dahbi is the new fabulous middle-east. anyway, this movie poses a counterfeit attitude about their liberal welcome to the arabian exotica but somehow it keeps its superficial bombardments on the arabian culture, stereotyped racist remarks about the veiling obligation in arabian women and how sexually uptight those arabian men are. i'm not really familar with the arabian world and i might also be infected with that bias that arabian men are terrible sexists due to media presentation, but there's one part in this movie that is really hypocritical: samantha annoys the crowd of arabian men for showing off her cleaverage, then four of them escape into a secret room full of arabian housewives who actively offer helps for these four \"fabulous\" new-yorkers, then they take off their conventional arabian costumes and reveal themselves in the dresses from the latest catalogues of louis vutton, dior and gucci, and they're holding a book-party on the same god-damned book samantha mentions earlier: suzanna somer's \"breakthru: eight stages to wellness\"...it's like announcing that you third-world arabian women, under your conventional appearance, you all wanna emulate us by buying off those commodities of luxuries, we, rich american women, feel complacent to be copied and emulated while we're taking a plane to get away from your land of gender-inequalities. the only solace left for you is the commodities from the latest catagues of louis vutton, channel..you shall continue to contribute your money to our corporations even your life still stinks as hell. but we don't care as long as you continue to vent your discontentment through consummerism!\r\n\r\nTHIRDLY, the character of mr. BIG is depicted as a partially conventional man who favors old black-and-white movies, and the story keeps emphasizing his love of nostalgia. his favorite thing in the world is to watch clark gable and claudette colbert's \"it happened one night\" in bed and he prefers to stay home on his couch eating and relaxing with those nostalgic movies. i wonder the screenwriter's choice of describing mr. big as fan of nostalgia is because women all secrely wish their men to be cultured, conventional and sophisticated (nostalgia is a reference of all those qualities.) in the mean time, woman behaves like a spoilt 40-something fashion-princess who disregards her man's frustration over the fall of stock-market, insists on her man's companionship after one laborious day. carrie even tries to pay homage to claudette colbert by showing off her leg in arabian street for taxi. the movie even features one scene of mr. big talking to penelop cruz, who is a hot spanish bank-manager in the movie, and she discusses their shared concern for the stock market in the cocktail party while carrie remains in her girl-friend circle. and i thought he's going to cheat with penelope but i almost wish it to happen..think about it, if you were a rich not-bad-looking man who's worth billions, what kind of wife you would want? you would want a wife who shares some concerns of your work-labors, instead of picking on your faults all the time, showing her non-appreciation for your interests in nostalgia and expecting to be liberated like a signle woman while you generously provide every possible luxurious item for her? if i were him, i would think: why not just court and marry peneloppe cruz?! that's common sense. \r\n\r\ngee, i'm tired of complaining about it..my point is: i could understand why some men have prejudices about chick flicks, especially sex and the city, because those women just won't step out of their enclosed circle of life! so narcissistically self-absorbed as if the world only whirls around her, and worse of all, chick flicks now degenerate into a genre for narcissistic females who think the meaning of life is the expensive clothes you wear, the travelling catalogues (third-world nations are all on the map for such consumption of exotica) and the so-called \"sparkle\" with their significant the other. and what the \"sparkle\" is made of? MONEY! everything is about money. yes, money is important in this world. but please have the decency to bare it all instead of granting it a beautified name of love! \r\n\r\nsometimes, i have an indignant sentiment why women are still so narrow-minded and short-sighted after so many decades of revolutions? i mean, when i watch movies like sex and the city 2. (of course, not all women are like that, i'm not. but the movie is popular, supposedly its popularity reflects something in its patroning audience) in conclusion, the only achievement feminism revolutions have accomplished is that women wear less clothes, spend more money, and certainly much much more fuckable than they used to be. (profanity intended for my anguish)...come to think about it, men should be grateful to movies like sex and the city, it opens millions of gates for you fellows to have gratuitous sex! (conspiracy from men)\r\n\r\n(as a matter of fact, sex and the city 2 is DIRECTED BY A MAN indeed. ha)",
            "review_date": "2011-02-17",
            "source": "rt"
        },
        {
            "content": "Gorgeous Outfits, Gorgeous Shoes... and more of Aiden Happy Days",
            "review_date": "2011-02-17",
            "source": "rt"
        },
        {
            "content": "Riktigt riktigt usel! \r\nKÃ¤cka ordvitsar kÃ¤nns lÃ¥ngt ifrÃ¥n SATC...och Abu Dhabi? Why liksom?\r\nBesvikelse.",
            "review_date": "2011-02-16",
            "source": "rt"
        },
        {
            "content": "Funny moments mixed in with boring cliche over a seamlessly endless runtime.",
            "review_date": "2011-02-15",
            "source": "rt"
        },
        {
            "content": "Long and boring with none of the spark that made the TV series interesting. Sorry to say but the girls are looking really old and they still haven't grown up with the issues they were having.",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "colorful. U r whatever u r rejecting.  U will come to that point one day",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "Neither sex nor the city plays any role in this film.",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "Mr. Big loves Deadliest Catch, too!!",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "in all the places ahai dabi aiden had to be there lol, the ladies still seek to amase me, love it. never gets old. :)",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "A very big disappointment. Kim Catrall is the ONLY reason to even think about watching this.",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "Awful. I actually liked the series, and the first\nmovie wasn't too bad, but this is terrible. Totally crass, and scraping the bottom of the barrel in nearly every scene.  \n\n2 and a half hours? How the Feck did they drag it out to that?\n\nHalf a star as it wouldnt let me leave zero!",
            "review_date": "2011-02-13",
            "source": "rt"
        },
        {
            "content": "If the world were truly as fabulous as this film would have us believe, it certainly wouldn't need the help of any of my stars to make it shine - therefore I intend to provide it with as little of them as I possibly can. It even fails as comedy, or high camp. It's basically an empty jewelry box - and, trust me, this film is the all-encompassing emptiness inside of of the box, not the exquisite exterior.",
            "review_date": "2011-02-09",
            "source": "rt"
        },
        {
            "content": "Wasn't nearly as entertaining as the first one...no big storylines.",
            "review_date": "2011-02-08",
            "source": "rt"
        },
        {
            "content": "I guess there's an investment in the characters after following them for so many years but this movie is quite awful. But in an acceptable TV-show kinda way. The gals sure look old and hideous though...",
            "review_date": "2011-02-07",
            "source": "rt"
        },
        {
            "content": "Americans are stupid, women are vain and the horse is ugly.",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "I Actually Preferred This Over The First Foray Of Fashion, Faux-par & Frilly Bits.. It Ends Well, Which Is All That counts In The Finale.",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "No, no and no. Horribly kitchy and shallow. And I was a real fan.",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "these girls and their stories, are always fun :)",
            "review_date": "2011-02-05",
            "source": "rt"
        },
        {
            "content": "Lets have a vocabulary lesson. Remember those from high school? First up, is Orientalism. Many definitions, but is characterized by a subtle and persistent Eurocentric prejudice against Arabo-Islamic peoples and their culture. Not that I am a terrorist sympathizer or anything, but they could seriously have some more class and composure.\n\nNext, is the word Fan Service. This is art and entertainment that caters specifically to the viewer, their fans, and gives them exactly what they want. By definition, pornography is a kind of fan service.",
            "review_date": "2011-02-05",
            "source": "rt"
        },
        {
            "content": "i liked it but i can understand why i'm the only one",
            "review_date": "2011-02-04",
            "source": "rt"
        },
        {
            "content": "dekleta odpotujejo v Abu Dabi, kjer se zopet vse zapleta, probllemi itd ...",
            "review_date": "2011-02-03",
            "source": "rt"
        },
        {
            "content": "Insane amounts of padding and way too many costume changes. Thats pretty much this movie in a nutshell.",
            "review_date": "2011-02-02",
            "source": "rt"
        },
        {
            "content": "Definitely spoiled the series flow, disappointing in that respect however still lighthearted and enjoyable especially that of Liza Minellis cameos.",
            "review_date": "2011-02-01",
            "source": "rt"
        },
        {
            "content": "Awful. One of the worst films I have ever seen, and I am a fan of the series. Just say no.",
            "review_date": "2011-02-01",
            "source": "rt"
        },
        {
            "content": "by Kaja Gilje Sekse for remotegoat on 28/05/10\t\r\n\r\nThe long-awaited second film based on every girl over 20's favourite TV series is here. But are we still getting carried away?\r\n\r\nThe first Sex and the City film showed us how the girls had moved on and settled down with their husbands and children. The second film picks up two years later and the former single ladies are even more settled in their married lives. The story revolves around Carrie and Big who are encountering a two-year itch in their marriage, Charlotte who is struggling with two children and a braless nanny, Miranda who comes to a halt in her career and Samantha who is reluctantly reaching menopause. The girls escape to Abu Dhabi for a week and we don't get to see much of New York City which has had a very central part in the series in the past.\r\n\r\nIt's a rather thin plot compared to the first film, but it thickens somewhat when Carrie's ex-boyfriend Aiden shows up in Abu Dhabi and stirs it up. Samantha provides most of the laughter as the only single one left in the group and the one who is still mostly like the character she was in the series; adventurous, brutally honest and delightfully promiscuous.\r\n\r\nThere's not much of a storyline this time around and the characters are starting to feel a little bit like a parody of the series. However if you're a SATC fan you will most likely enjoy the film as it will satisfy your curiosity and you will love the \"fabulous\" fashion - but if you're not you're likely to get bored half-way through and might consider sitting this one out.",
            "review_date": "2011-02-01",
            "source": "rt"
        },
        {
            "content": "i enjoyed it more than the first!",
            "review_date": "2011-02-01",
            "source": "rt"
        },
        {
            "content": "By far one of the most offensive movies I've EVER seen.  Racist, self-absorbed and a big fuck you to not only the Middle East, but the middle class.  Shame on everyone involved in this film",
            "review_date": "2011-01-31",
            "source": "rt"
        },
        {
            "content": "one hell of a \"man hating\" mess - i hope they don't make a 3rd....  I did enjoy Mr Big's idea of having 2 days a week off from marriage so he can \"watch tv and do all my shit.\"  Too bad that doesn't fly in most marriages/relationships.  Carrie Bradshaw is one of the most annoying characters EVER in all of film/tv!!  The best thing about this piece of wet shite is the irish nanny - GOOD GOD!!",
            "review_date": "2011-01-30",
            "source": "rt"
        },
        {
            "content": "It's easy for film fans to bash Sex and the City 2 for its obvious faults. This second big-screen outing for Carrie and co. played up the TV show's weaknesses and all but ignored its many strengths, placing the characters in increasingly more idiotic scenarios and leaving behind the great city that for more than a decade has been the beating heart of the show. However no matter how badly they missed the mark, for a die hard fan, bashing this movie is a painful task.\r\n\r\nEveryone has those TV shows and movies that hold a special place in their hearts. Well for me HBO's Sex and the City has been a glittering, stiletto-shaped crutch since I was thirteen years old. As a gay teenager there was no one in the world I wanted to be more than Carrie Bradshaw, her internal monologues and eventful sex-life have taught me more about relationships than any number of sex-ed classes ever could, and let me tell you those six fabulous seasons have set in me good stead. Therefore when it was announced the fab-four would be reuniting for a movie I was naturally excited. The first film was a clear step down from the TV show but my sparkly crutch was back so I didn't care. However Sex and the City 2 is the first really disappointing blip on what has been twelve years of Manolo-loving greatness.\r\n\r\nThe problems are myriad. The writing is incredibly poor, glossing over any real character-driven issues in favour of eye-rolling one-liners and a ridiculous subplot revolving around a trip to Abu Dhabi. This storyline is so misguided it beggars belief that it was ever approved; there's a reason it's called Sex and the CITY! Add to this the ongoing culture clash between Samantha's sexually liberated Western woman and the strict Muslim rules of the Middle East and the movie is pretty much dead and buried. Then you factor in the preposterous runtime and realise things somehow just got worse.\r\n\r\nAnother problem is that the characters, who were once carefully written pioneers of female independence and sexual freedom, are now little more than caricatures of their former selves. Furthermore the dumbing down of these women appears to have translated to the actresses who do little to rescue their characters from the appalling writing. Even bringing back beloved characters like Aiden, and featuring a host of celebrity cameos including Penelope Cruz and Liza Minelli, does little to distract from Michael Patrick King's terrible screenplay.\r\n\r\nBelieve it or not, there are some areas where the film lives up to its reputation. Most notably the costumes and clothing feature the best contemporary styling I've ever seen in a movie. The legendary Patricia Field has done an incredible job of dressing these women of a certain age in a way that reflects their character and cutting edge style perfectly. Also it should be noted that there are glimpses, albeit brief ones, of the celebration of friendship that made the show what it is, and it's during these moments that the film does work.\r\n\r\nDespite what most critics and moviegoers will tell you (many of whom had clearly made up their minds before they even saw the film), there is still enough here for some fans to enjoy. It isn't a patch on the TV show, and is undoubtedly a disappointing way to continue the franchise, but if you love Carrie and her girls as much as I do, you'll take what you can get.",
            "review_date": "2011-01-30",
            "source": "rt"
        },
        {
            "content": "Not as good as the first one. The only good thing about this one is the fashion.",
            "review_date": "2011-01-30",
            "source": "rt"
        },
        {
            "content": "Really bad film, Such a lack of real acting....its just over the top, silly and missing a real plot or follow up from the first film and even more so from the original hit TV version, a poor effort and a good show of actresses getting paid way too much in the name of continuing a brand..",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "I was so excited to see this movie...but there was so much wrong with it. 1) The running time was too long. 2)  Carrie and Big's marraige was painful to watch. 3)  Many of the scenes were so cheezy and just meant to try and save the movie, when I had already given up on it about an hour ago.  4) My favorite part of the movie was Stanford and Anthony's wedding.  But that is literally it.  Other than that it was just sad and everyone was old.  If the series had stopped at the first movie, it would have done the show so much more justice.  Nuff said.",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "Watched this twice and still enjoyed every bit of it. Nice to see a very feminine movies sometimes when you can just watch the mind of women... good looking women!",
            "review_date": "2011-01-28",
            "source": "rt"
        },
        {
            "content": "I love the girls, I liked the first movie so of course I had to watch the second.  Really this movie is probably only appreciated by its fan base or maybe women who are going through the same things.  I liked the first movie better but this was fun to watch especially Samantha's big hormonal, sex driven meltdown in front of middle eastern men.  That's right sister, you get your freak on but pushing the boundaries in their country isn't smart, lol.  Oh well.  Wink*",
            "review_date": "2011-01-26",
            "source": "rt"
        },
        {
            "content": "A bit long winded and not as good as first one but i enjoyed it for what it was. I think they have outplayed it now, enough is enough.",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "I need whiskey, bleach and some weapons grade crystal meth, because this is the worst 2010 has to offer.  I would like to preface these angry words by saying that I am a dude.  I haven't seen any episodes of the show or the first movie, and I don't have a cosmo addiction or a shoe-shopping problem.  This OBVIOUSLY wasn't made for me, but JESUS CHRIST.  The plot is so thinly veiled...  you know what, I'm not going to even pretend that there's a plot; it's just these four intolerable women, each dealing with their own midlife crisis, going on vacation in Abu Dhabi and deciding that indulgence is the solution to all their problems.  This is why countries hate America, and I honestly can't blame them.  It's offensive at every turn, and it shamelessly flaunts materialistic ideals with pride like it's a good thing.  It sometimes presents itself in such a poor light that my eyes widened and my jaw dropped, an automatic reaction to my brain trying to eat itself.  Maybe if you've spent six seasons and a previous movie with these ladies, you'd find their comedy and mannerisms endearing, but I didn't find it funny in the slightest.  It didn't make me laugh at all, it just me roll my eyes so much, I'm surprised I didn't give myself a nosebleed.  And putting up with that for two and a half hours, it's a goddamn endurance test that I feel somewhat accomplished that I made it through.  I hate the horrible sense of humor, I hate all four of these annoying harpies, but what I despise the most is what this movie stands for.  Sincerely, from the bottom of my heart, fuck this movie.",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "waste of time.  Mr Big looks great",
            "review_date": "2011-01-24",
            "source": "rt"
        },
        {
            "content": "love this film its fun girly. and they get better...",
            "review_date": "2011-01-24",
            "source": "rt"
        },
        {
            "content": "Worst movie of 2010!",
            "review_date": "2011-01-24",
            "source": "rt"
        },
        {
            "content": "LOVE of course! I didn't expect anything less from the Sex and the City ladies.  The fashion as usual was so gorgeous.",
            "review_date": "2011-01-23",
            "source": "rt"
        },
        {
            "content": "Way too long, but otherwise not as bad as I thought it would be.  It took itself too seriously, like the first movie.  The characters are great though...I enjoyed the show on HBO when I watched it occasionally and likewise enjoyed both movies because of them.",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "Cheesiness at it's best",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "This movie was good but I am not a girl and I am also not gay so I found it hard to get involved in it",
            "review_date": "2011-01-21",
            "source": "rt"
        },
        {
            "content": "hmmm.. a huge part of this movie is just a showcase of the beautiful Abu Dhabi (is this a national geographic feature film???)... still, there were some nice relationship message conveyed...",
            "review_date": "2011-01-21",
            "source": "rt"
        },
        {
            "content": "A sequel that fails terribly. Don't know why, but it feels much more like a tourist advert more than a movie. If you just want to have fun and not looking forward to actually watch a movie with quality, you can watch this movie. But the sequel was lack the good story since it looks like the good ones already been used for the first one. Sorry, Michael Patrick King. But we are not going to watch Sex and the City 3 if there is one.",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "Could possibly be the most pointless movie of all time...",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "Xenophobic, American superiority rubbish... I want my money back.",
            "review_date": "2011-01-18",
            "source": "rt"
        },
        {
            "content": "Sex and the City is one of my guilty pleasures, and this movie just made me feel more of the guilt than the pleasure.  The exploration of relationships and character development was set aside, and instead, all that was left was a shallow plot with mindless characters and a dazzling parade of designer's clothing and shoes.  Hard to feel any sympathy for these girls when the bigger of their issues is having to fly coach. Ugh.",
            "review_date": "2011-01-17",
            "source": "rt"
        },
        {
            "content": "crazy ladies, but they're MY crazy ladies!",
            "review_date": "2011-01-16",
            "source": "rt"
        },
        {
            "content": "not as good as the first but still good",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Certainly not worth the wait, witch is such a shame. No where near as good as the first one.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Too superficial and couldn't find any sense-making story in there. Most importantly, not that fabulous.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Mildly amusing, but way too long, preposterous story lines, lazy writing.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "I'm being generous giving it half a star. I fell asleep in the cinema watching this. My wife loves satc but hated this.",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I ever saw but a blast to make fun of!",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "OMG, are they serious?  I finally watched it last night & boy, I just have one thing to say.. YUCK!  Overacting, horrible clothes, an unfeasable storyline (if you can even call it that).  Kim Cattrell looked like a middle-aged line backer & SJP looked more like a horse than ever.  So cliche, so boring.. beginning, middle, end.. I just wanted to smack 'Samantha' in the head!  'Charlotte' acted like an idiot & what's with 'Miranda's' teeth?  To say this movie was a disappointment is an understatement.. don't bother. I gave it half a star just for getting to see spunky Aidan again.  Even though older & a little pudgier, gosh he's cute!! He would've NEVER kissed Carrie again in real life in a million years!",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Carrie complains and nags for no apparent reason other than its another day in her perfect life. Charlotte cries because kids are hard to handle? Samantha cant keep quiet, apparently she likes being rude and cant understand when others try to keep her quiet. You know the movie is bad when you like Miranda the most.",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "Some of these people make my skin crawl. The characters of Sex and the City 2 are flyweight bubbleheads living in a world which rarely requires three sentences in a row. Bad puns, fashion porn, domestic handwringing, contrived plot points, idiotic dialogue and offensive stereotypes. What's not to loathe?",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "Heed the warning of the 1-Star. \nThis one can stand next to GODFATHER 3. \n\nPart of the fun of the SATC series was watching the characters' intuitive ways in which they continuously messed up their love lives. Imagine that dimension gone and replaced with condescending, whining shrews who trot around consuming with a shameless sense of entitlement. Yes, even more so.\n\nClueless, lazy writing dominates the movie. For instance, a commonly cited example is Charlotte's mothering \"dilemma\". Charlotte is a wealthy mother who does not have to work for a living. Fortunate enough to have time home, she still requires the help of a full-time nanny, who whisks her children out of the room at any moment the children become too active. \n\nOver a pity party drinking session, Charlotte whines to Miranda how difficult it is to be a mother. She laments: how do \"the others\" do it without help? Miranda, states blankly, \"I have no idea.\" She then lifts her large cocktail and toasts, \"to them.\" A truly insulting moment to any one, any woman, armed with dignity and a brain. Perhaps King read somewhere that mothering can be tough. \n\nSATC2 is nonsensical and inconsistent. In Abu Dhabi, Miranda scolds Samantha for dressing too revealing at the hotel, although Carrie goes unnoticed sitting next to Miranda in a similar, sleeveless outfit. The script probably looked better on paper. Or, is the audience considered that stupid by Michael Patrick King?\n\nLater, Samantha makes herself readily available on a date. The series-Samantha would have probably reminded herself that she was on a high profile business trip and to take it upstairs. This SATC2 Samantha fellates a hookah for all to see, much to the dismay of the locals. A savvy business woman, series-Samantha would have composed herself with even a little integrity.  But, if even the writer of SATC2 can't compose himself with integrity, how on earth could Samantha?",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "Not as good as the first or the series but i love the cast and has some funny moments. X",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "Sex and city 2 plot has been chewed and spitted by fantasy driven writers and then test screened to cliched gays and lonely secretaries. It's overlong, provides no new insight in women power and makes Americans look like they are full of common misconceptions. \nFurther solidifies that the series should never have made it to the big screen.",
            "review_date": "2011-01-12",
            "source": "rt"
        },
        {
            "content": "This movie is literally painful to watch! I loved the TV series so much...hopefully, I can get the visuals in this movie out of my head so I can still enjoy re-runs of the TV show again!!!",
            "review_date": "2011-01-11",
            "source": "rt"
        },
        {
            "content": "Hard to rate when you don't know the backstories and what not..but I thought it had it's moments.   Fans of the series, cougars and women going through menopause should enjoy.  Some jokes are good but there's some misses as well.  A highlight is a Liza cameo.  One of the big problems in this film is the two and a half hour run time....way too long for this type of film.  For guys who will have to sit through it with wives or gfs, it's tolerable.\r\nGets A-List Rating of: MEH\r\n\r\nFor my full video review of Sex and The City 2, visit the following link: http://www.youtube.com/watch?v=j6sdrTLBKVA",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "I gave the 1st movie 3 stars but this sequel is just bad. Really bad. Fashion disaster, political faux pas, lacking in direction kind of bad. I'm glad I didn't see this in the theaters..",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "This movie didn't add anything to the \"Sex in the City\" tale. Same old thing, same old setup, same old jokes, same (nowadays) _OLD_ women. I have to say that the bluray on 46\" fullhd screen didn't do good for the actors. Extra 1/2 * for the Irish nanny. That was hilarious and extra nice on bluray ;)",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "Uuuuuhhhmmmm. Liza Minnelli singing Beyonce's Single Ladies. Irish bra-less nanny. Kim Cattrall being the epitome of mutton dressed as lamb. Mr Big is now Mr Big Bore. \nBlah.",
            "review_date": "2011-01-10",
            "source": "rt"
        },
        {
            "content": "I heard this movie was awful compared to the first one (which I thought destroyed the series), and was pleasantly surprised! This sequel was a lot truer to the series than the first one. And Aiden was in it!",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "gia kwmwdia kalo htane......",
            "review_date": "2011-01-09",
            "source": "rt"
        },
        {
            "content": "I didn't think this movie could be as bad as I'd heard and I was right, IT WAS WORSE.",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "Nothing to do with the original Sex and City series, can't seriously have been written by the same writers...",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I have ever seen",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "This time around, the unnerving shallowness without witty observations nor a plot one can actually relate to.",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "The worst part (and that's saying a lot) is the totally disjointed plot - this movie has no central theme. In fact, I have no idea what it was about...",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "3 estrellitas porque salio el hombre de mis suenos:  \"Aidan\".",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "I am a huge fan, so I loved it. I never get sick of my 4 girls.",
            "review_date": "2011-01-07",
            "source": "rt"
        },
        {
            "content": "Love it. Best one so far. I hope there is more to come.",
            "review_date": "2011-01-05",
            "source": "rt"
        },
        {
            "content": "Compared to the First Movie and the Series this is just so been there done that *sigh* could have been soooo much better....",
            "review_date": "2011-01-04",
            "source": "rt"
        },
        {
            "content": "Cheesy story, cheesy one liners, and cheesy clothes actually make this an entertaining movie.",
            "review_date": "2011-01-04",
            "source": "rt"
        },
        {
            "content": "The most ridiculous tosh I've ever seen, particularly the generalisation of gender, religion and culture.",
            "review_date": "2011-01-03",
            "source": "rt"
        },
        {
            "content": "obligatory viewing out of loyalty to when the show was good. kinda like a mercy* &=%",
            "review_date": "2011-01-03",
            "source": "rt"
        },
        {
            "content": "S got to pick tonights movie, even she rated it at half star. An embarrassing movie for all involved.",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "Three prostitutes and their mum",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "AWFUL, TERRIBLE, RUBBISH STUFF.  Give this one a pass.",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "Just finished seeing Sex and the City 2, as my first DVD on Netflix.  I can't believe how bad it was!  I'm a gal who's supposed to be paying attention to the drama and the comedy, and all I can think about is forgotten passport and cultural insensitivity.  Travel 101!",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "what a disapointment. cant believe i watched the entire movie.",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "nice but still like better the tv show!",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "Better than the 1st, although there were too many awkward moments in Abu Dhabi with poor cultural references",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "Sexless City...\r\nor Cougars are us... come on its time to move on the eighties have past us by it is the autumn of your lives ladies. You can't shop at la chateau anymore.\r\nI think Cher, Melanie Griffith,Demi Moore and Jistin Bieber should have been cast for this one...\r\nTime to hang up the skates and listen to mama mia...\r\nI know SAW VIII will have an opening sequence with a victims' eye wired open to watch Sexless City III as its first torture scene.\r\n\r\nThe horror..the horror..",
            "review_date": "2011-01-01",
            "source": "rt"
        },
        {
            "content": "Not as good as the first sequel, but for SaTC huge fans like me, it's 'must-watched'",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "loved it lol and yes im gay",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "Complete train wreck.",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "The editor was busy taking a nap for this one....boy did it drag on and on....disappointed because I love my girls.  Also, Carrie needs some SERIOUS therapy.  True meaning to the song \"I am only happy when it is complicated\".",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "The editor was busy taking a nap for this one....boy did it drag on and on....disappointed because I love my girls.  Also, Carrie needs some SERIOUS therapy.  True meaning to the song \"I am only happy when it is complicated\".",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "Jesus, God no. Liza Minnelli showing leg!?! Singing \"Single Ladies!?!\"  Carrie is now (I guess she was before but it could pass in her 30s) an unlikable, spoiled bitch!?! Samantha is an old whore? OMG stop the madness now. ONE BALL POINT PEN for dialogue that sounds like 4 gay men running around rather than 4 strong women. So-so-so unfunny. And note to Michael Patrick King, the king of this film cuisinart... no SATC movie should rival the length of Harry Potter! So says the Geek.",
            "review_date": "2010-12-30",
            "source": "rt"
        },
        {
            "content": "not as good as first not a good storyline once you've seen it you don't rush to see it again",
            "review_date": "2010-12-30",
            "source": "rt"
        },
        {
            "content": "the first one was great, but def disappointed with this one",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "Love the scene when Kim's character gets her pursr ripped open!",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "It gets half a star for trying! Don't waste your time!",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "As predicted, very disappointing after \"1\".  It was more like a farce - or a \"Carry On\" movie - excuse the pun!!",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "Hated the first one, this one was worse!",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "nice refreshment for the eyes",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "so boring, i turned it off halfway through",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "I had to watch it. It was horrifying and offensive. Although, I did learn that the burka'd women wear Louis Vitton (sp??) under their robes. Great promoting of LV.",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "Haven't seen it. One word can describe this movie...trash.",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "Treated to a hot flash of the divine. 'Her best gay friend is marrying my best gay friend!'",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "Slightly far fetched, but loved every minute. What I'd do to be a SATC girl",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "PLEASE let it be a 3rd one!!!!!!!!!",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "interesting story line. loved it but not more then part 1",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "truly painful, it's like they didn't even bother trying to make a movie.  It just makes me think about that Heineken commercial where the girls are screaming about the huge closet full of shoes and the guys are screaming about the closet full of beer.  The core fanbase should be offended that the filmmakers thought so little of them that they could just make a movie where the girls change outfits every five minutes and that would be enough.",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "Funnier than the first movie, but that wouldn't be difficult!  The movies are never going to live up to the series, that said, Samantha has the best lines 'He's the Lawrence of my Labia' and 'So, your name is Dick Spurt'...and there's plenty of eye candy for the girls!",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "I didn't watch the first movie or the tv series, so I can't compare.  However, on its own, it's entertaining enough.",
            "review_date": "2010-12-27",
            "source": "rt"
        },
        {
            "content": "I am an avid Sex and the City fan.  I own all of the seasons and frequently re-watch the first movie, but this sequel was such a disappointment to me.  It was simply \"over the top\".  I realize that the series was always on the brink of the latest fashion and about women with money, but this just took it to another level.  The story-line isn't great, and it's just so materialistic-a sickness that our society is already suffering from today.  I would love to lie and say that I loved it, because I LOVE the gals, but I just can't.  :(",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Way to be stereotypical to the extreme, culturally insensitive AND almost ruin the goodness of the entire TV series for me. Will you just stop already. Please.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "The first one was better!",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Fair one, traditional elements sames as in the TV series, luxury brands, NY style, and etc. But it is a good one for me to review my trouble three. People get into marriage and always struggle between couple world and freedom. Sometimes I did want freedom badly. I think two days off a week for a couple is a healthy action to make marriage better and stronger.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "After half an hour of boring set up Foot-face and the other nans head over to the middle east for a jolly nice holiday. Later there's a bit where they have to pack quite quickly. That is all. \n\nWhat's that you say? Aren't there some valuable life lessons to be learned along the way? Glad you asked. Here are the conclusions I drew from the 140 minute travel documentary. \n\n1) USA No.1!!!! All other cultures are no.2 or lower. \n2) When your wife cheats on you just get her some diamonds.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Patricia Field must be booked for the next 10 yrs! Stunning cinematography - very Hollywood GLOSS.",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Good movie, even though it was not as good as the first one...it was still a very good movie",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "well.  movie made in uae  some parts.....Girls was crazy in Arab world...Girls all the time crazy...)) and when Arabian desert and  pretty ones for sure around will be trouble! go have dvd. maybe can post for  me in Dubai))",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "Have not seen it ,and don't want to but ,they said it was one of the Worst movies of the YEAR",
            "review_date": "2010-12-25",
            "source": "rt"
        },
        {
            "content": "Nothing like the first flick.",
            "review_date": "2010-12-24",
            "source": "rt"
        },
        {
            "content": "Thought it was much better than the 1st one!",
            "review_date": "2010-12-23",
            "source": "rt"
        },
        {
            "content": "Decent writing but too boring.",
            "review_date": "2010-12-23",
            "source": "rt"
        },
        {
            "content": "Funnier than I was expecting!",
            "review_date": "2010-12-22",
            "source": "rt"
        },
        {
            "content": "I love SATC. I hate this movie.",
            "review_date": "2010-12-22",
            "source": "rt"
        },
        {
            "content": "First one was wayyyy better!",
            "review_date": "2010-12-22",
            "source": "rt"
        },
        {
            "content": "I didn't like it at all.",
            "review_date": "2010-12-21",
            "source": "rt"
        }
    ]
}