{
    "rating": 1.8,
    "release_date": "2010-11-12",
    "num_reviews": 710,
    "genres": [
        "Sci-fi",
        "Mystery&thriller"
    ],
    "summary": "Jarrod (Eric Balfour) and Elaine (Scottie Thompson) take a trip to Southern California to visit his friend, Terry (Donald Faison), for a fun getaway, but it turns into a weekend of terror. During the night a cluster of strange, mesmerizing lights signals the arrival of an alien invasion. As thousands of terrified people are pulled into the maws of giant alien ships, Jarrod and his companions must use every skill they have to survive global genocide.",
    "reviews": [
        {
            "content": "Strange creatures appearing in the skies, unexplained. (Put me in mind of John Wyndham's 'The Midwich Cuckoos'.)",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The kinda movie that you end up thinking  `what's for dinner?' Rather than thinking about the movie….nope. \nIt's the kinda movie you would want to hand yourself into death row and skip the last meal so you can get put out of your misery. A truly awful movie. It's so good at being bad that it should be considered the Michael Jordan of terrible movies, that's how good at being awful it is.\nTime from my life I will never get back .",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the only movie in my life that I left the theater and asked for my money back after 30 minutes in. I hated myself for staying the 30 minutes so much I gave the money to my date even though I paid simply as reparations for picking the film.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just watched this movie for the 3rd time & I REALLY don't know why it gets such bad reviews!! It's like this movie got deemed \"The Nerd\" and everyone picks on it, regardless. \nThis is a SOLID Sci-Fi movie! It's got a lot of decent actor's. A good basic plot. Great special effects! Not to mention...Brittany Daniel!!😍\nI've definitely seen A LOT WORSE movies get a lot better reviews than this one. If you like \"alien invasion\" movies...you'll like this one!!",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite a decent premise and good special effects this is a thriller where it's not interesting and the ending is a cop out",
            "review_date": "2022-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is what happens when a promising premise is subject to an all night pot bender where the writers dove head first down the \"duuuuude ... wouldn't it be cool if ...\" rabbit hole ... And then actually followed through with their \"genius\". \n\nSkyline is holy-mother-of-what-the-batshit terrible.",
            "review_date": "2022-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the worst movie I have ever seen. Ever. ",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie and was so blown away by the terrible plot that I immediately scrubbed it away after watching.",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look it's a fun and dumb popcorn flick, it's actually got some pretty cool ideas and I think that's why it got 2 sequels. I do know this.. love it or hate it, it's got one of the best endings ive ever seen in a Sci-Fi movie and makes me very interested in what happens next. \n\nTurn your brain off, make some popcorn, have some fun. 6.5/10",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the worst alien invasion story put on film, but with nothing new or groundbreaking it's just... there, never to be enjoyed for there is never anything close to a suspension of disbelief at any point.",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical b movie, feels cheap.",
            "review_date": "2021-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lame or actually a devoid script backed with low brow acting take Skyline from high above the LA city to the depths of a parking garage...Spoiler Alert:  Black guy gets it early on in the movie...I want my hour and a half back again...",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't waste your time.  unless all you want are special effects.  and unimpressive ones.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first half felt very juvenile and really uninteresting.  The 2nd half got me hooked with the impressive CGI and killer ending.  Barebones alien sci-fi but still fun",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is 100% the worst movie I've ever seen.  It's laughably bad, which ironically makes it an enjoyable watch.  Can't believe this movie was made.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it. Not sure why the rating is low. Storyline was cool. Characters made realistic choices. Action was legit. It was an entertaining movie with possibility of sequels. The plot was survival and escaping. Its from the POV of a small group of people that woke up to an invasion. Seems like the Critics weren't paid enough to give it a fair shake. Typical of most movies that feature a white woman in a relationship with a black man. Hollywood seems ok with interracial ...AS LONG AS its not a white woman with a black man. That's a Hollywood No-No. Grow up.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 0,5/Sound Effects: 0,0/Acting: 0,0/Story: 0,5",
            "review_date": "2021-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are parts that are particularly poor, lacking both rationale and conviction but overall an interesting concept well illustrated.",
            "review_date": "2021-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An alien disaster invasion from the perspective in a high hotel resort condominium surprisingly works in setting construct in spite of the loose interplay",
            "review_date": "2021-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a B action/horror movie when I rented it, but it was awesome! Greatly enjoyed it - very innovative.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline has the special effects of a big budget blockbuster, but features the dialogue & acting of a Syfy original soap opera. The plot is also lacking, with a story that literally goes nowhere and an abrupt ending that will leave you scratching your head. Aside from a few creepy moments, this is one science fiction flick that you should shield your eyes from.",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than expected. From movies about alien invasion, this is nowhere near the worst.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked so bad, Outer space got jealous. Whoever wrote this, should put the original script back together and rebuild the tree it came from. THEN they should kneel before the tree and apologize for wasting the air that it made for us to breath.",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was such a boring movie that tried to rush itself sometimes that works but this is not one of those times the only character we could Like was Eric Balfour's character Jarrod but the 1027 sequal is way better then this i say skip this movie and watch Beyond Skyline",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie was much better than the squel but the visual effect looks the same",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending was great, not only because it had a cool and interesting way of ending, but also because the film ended. Save some time and just watch the last 30 minutes or so. The rest is dumb action and a laser light show.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the top 10 worst movies I've ever seen. Don't waste your time watching this terrible sci-fi movie, you will regret just like I did. \nI know I should do a better and we'll detailed review, but this movie is so bad that the only thing I can say is, don't watch this movie.",
            "review_date": "2019-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd give it zero stars if I could.  So bad.  Hey, there's something attacking us from the sky as it flies by- should we go to the basement or the penthouse full of windows?  Yep, penthouse.  Here comes a jet, but no worries, I'll just duck.  'Cause my reflexes are faster than a jet.  Characters were not developed so we didn't really care if they lived or died.  Just so bad it is almost funny but not. Not funny.  Not fun.",
            "review_date": "2019-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie i have ever seen... well this and Mandy, dont watch that either. Terrible acting, nothing happens, and SPOILER they all die in the end in their apartment. You dont know who these aliens are, why they came down, what they want, etc etc. how they made a second one blows My mind",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Loves this movie! Its 1 of those movies where maybe you gotta Love scifi! All i know is ive tried many times to see it free on youtube to no avail. Its 1 that Should be in the Vault of cult classics! ",
            "review_date": "2019-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just dont. Cool concept gone wrong.",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time. Straight garbage ",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline was a bit lacking, but special effect is 3 thumbs up. The amount of details, and the realistic monsters, lives up to the top notch standards, even with the valuation in 2019. ",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slowly slowly alien invasion movies are going right down the drain. Starting with District 9 and now this. ",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cgi effect and great movie",
            "review_date": "2019-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a real bummer this movie had so many drawbacks. It is a really cool take on an alien invasion and has some really looking looking aliens. It has a very interesting dynamic with the what the aliens do to the humans. Its just a bummer that is has that early 2000's vibe. There is a sequel that I am going to check out, hopefully it is better than the first one but still plays on what the first one built.  Long story short. This movie will pass the time and has some cool effects but the story falls flat on its face, however it has soo much potential. ",
            "review_date": "2019-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I reference this movie every time I talk about how some people think movies are good because of CGI and not a decent...anything else. Worst movie I've ever seen! B films are better than this.",
            "review_date": "2019-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is either a sci-fi drama, action epic, or college party film. None of which are interesting and the ending makes zero sense. ",
            "review_date": "2019-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest comedy si-fis I've seen. If you want a good laugh...",
            "review_date": "2019-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as cheesy and as bad as it is; somehow i keep watching it when I'm High af, and in that case it is an AMAZING movie haha",
            "review_date": "2019-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was entertaining enough to watch the whole thing which is more than you can say for a lot of the crap on Netflix.",
            "review_date": "2019-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A typical beginning with party people no one has any reason to care about. Then gruesomely monstrous aliens show up and it's not so bad. Then a crazy ending, but nothing can save the movie from being devoid of a story.",
            "review_date": "2019-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unmotivated sci-fi flick.\n\nAfter a late night party, a group of friends is awakened in the dead of the night by an eerie light beaming through the window. Like moths to a flame, people outside are being drawn to strange lights, which have descended upon Los Angeles, and then suddenly vanishing into the air. Survivors must fight for their lives as the extraterrestrial force threatens to swallow the entire human population off the face of the Earth.\n\nIs it weird that I've watched this film like 3 times? Is it even weirder that there's a sequel to this film? Well I hadn't watched it in years but I saw that Netflix put it back in their lineup, so I decided it'd be nice if I could review this film - especially since I heard the sequel was interesting. Anyways...yeah.\n\nThe screenplay - don't even get me started on the screenplay behind this film. It's just not good. The dialogue is cringe worthy, the stakes feel non-existent, the characters are bland and unlikable, the setting is uninteresting, everything is just lackluster. In terms of execution, this film was just bland.\n\nLook, there's no real point in going through and dissecting every detail in this film. However, one thing this film DID do well was world building. Yeah, kinda weird right? This film did manage to set up a world where this scenario exists and it's actually kind of interesting. God knows it wasn't executed well but it wasn't too shabby. There's a world within this film that could be really interesting, but it's not.\n\nIn the end, I really don't want to spend time or effort dissecting this. It was a mess. It was a Grade-B sci-fi film that did not execute well. Anyways, let's see how the sequel goes!",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it even though the acting and film had a B movie feel to it. ",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad movie with no context",
            "review_date": "2019-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible film, stilted dialog, ridiculous decisions (\"let's go to the top [of the building] that's the safest place I can think of.\") stupid fights. Great creepy aliens though, and wow special effects.",
            "review_date": "2019-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the only good thing about this movie is that everyone dies",
            "review_date": "2019-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was rooting for the aliens; Donald Faison humor would have went a long way; Scottie Thompson is superb but cannot save the silly film",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, exciting, and interesting. What more could you ask for?",
            "review_date": "2019-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't know why everybody says it's a rubbish film, but having just watched it I really enjoyed the story and the acting and for me it was very good! I'm wondering if everybody else watched a different film.",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite solid special effects, this one is definitely up there in my top 10 worst films I have ever seen. A truly special kind of bad.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay. Nothing special",
            "review_date": "2018-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible don't waist your time",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is  honestly really, really bad. The story is thinner than my bankaccount, and I've seen new born babies acting better than most of the actors in this film. The film also just ends in what feels to be in the middle of the film, and it does that in a very bad way. If you'd compare this film to the emoji movie, the emoji movie is a great film, with an amazing plot and over all great characters... and that says a lot",
            "review_date": "2018-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a fun watch and the ending was one hell of a twist. The acting could have been WAY better for the situation but still a fun concept.",
            "review_date": "2018-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An alien invasion flick that regurgitates all the tropes the genre has seen before, but with a bright blue tint.",
            "review_date": "2018-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No idea why this movie has such a bad score. It's well acted. It's well directed. The effects are fantastic. Most of all, the storyline is exceptional. This is an entirely new take on the alien invasion genre with an ending you don't see coming. I've seen this movie twice and it was just as good the second time. If you haven't already seen this movie, I HIGHLY recommend you watch it.",
            "review_date": "2018-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending could maybe have been engaging if it made sense, but even putting the best possible spin on Skyline, it still repeatedly commits the cardinal sin of the entertainment industry: Being boring.",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is pretty bad. but i still enjoy it. guilty pleasure. i loved it when it first came out. the sci-fi aspects are pretty cool, some decent action/excitement/suspense. and some cool ideas. it also had really bad acting, especially by the lead actor and actress, both horrible choices. bad dialogues, characters you don't care about, and lots of dumb stuff. (about 3 viewings)\n\n\nSPOILERS\n\n\nthe ending is the best part, and what made me really love it when i first saw it. harvesting human brains is awesome, and then the dude becoming one of them. could be seen as dumb, i think it's pretty cool",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad and slow start.  Cheap.    Couldn't help laughing when an alien survived a nuke blast but killed by a brick in bare hands.  Not too bad CGI and fun to watch the last 30 minutes.  Weird ending for a sequel to come.",
            "review_date": "2018-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All that's missing is zombie bikers",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie stinks, if you make it to the end...oh my God!\n\nFor those that did you know what I am talking about!",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me, this movie was a bit of a slow burn. The first half was a bit boring, but it built up nicely; to an ending that had me wanting more. I think the pacing issues could have been solved if the cutting of the movie was more harsh in the 1st half.",
            "review_date": "2017-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun but dumb popcorn flick!",
            "review_date": "2017-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie was absolutely captivating, and epic. Most people don't realize the time and effort these actors and actresses put into making this extraordinary movie. I applaud the actors and actresses for doing the best the can to showcase this movie to the world. I cannot fathom how much criticism people can create based on how they feel things should be, but to those people I want to let them know that things will never go as they plan in life, they have to learn to deal with it. Thank you for this movie, and I hope to see a part 2.",
            "review_date": "2017-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One the most stupid and inconsistent Sci-Fi movies i have ever seen. A pure waste of time watching it.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suffering from a bad script, so-so acting, and a story that's just decent, Skyline is a mostly bad movie. That being said, the special effects still hold up today, and the Drones vs Aliens dogfight scene is spectacular.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total garbage. Even the special effects were lackluster by 2010 standards, which was the only thing that this movie could have possibly had going for it. The acting was bad, the story was bad, the plot was bad, the character development was bad, the foreshadowing was bad, it was bad, bad, bad. Even Plan 9 From Outer Space was better than this.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this film. The effects were great. The premise of the film was fine. The critics panned the dialogue and the lack of character development. Seriously? How scintillating do they think the dialogue would be if they were couped up with their neighbours during an alien invasion? In fact I found the very idea of being barricaded up with my neighbours not only claustrophobic but utterly horrifying. It was also refreshingly different that the aliens were omnipresent, all seeing and all powerful and that mankind's cause was seen to be utterly futile and its fate inescapable. Frankly I can't wait for the sequel. I hope it includes a scene where a gang of film critics are heaavily engaged in witty repartee before having what brains they have being sucked out.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting concept. Awful movie but worth a watch.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story is terrible and the ending is trash",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie acts like it's the sequel to Aliens vs. Predator: Requiem. The godawful sequel to that godawful Alien vs. Predator picture.",
            "review_date": "2016-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Average Sci fi movie. Worth a watch if your into this genre.",
            "review_date": "2016-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumbest plot casm of all, aliens get killed by small missiles and beaten to death with anything from a brick to an axe; but withstand the heart of thermonuclear explosion.    riiiight....",
            "review_date": "2016-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do not walk into this movie expecting greatness.  Walk into this one with an open mind.  You will not be disappointed as the action and mystique continue to grow and blossom into an incredible sci-fi movie!",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There wasn't much of a story, but i still enjoyed Skyline for some reason. Cool Aliens maybe.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a waste of time and money. If the sequel's bound to be better than the first if that's what they might say, then I accept the challenge.",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not *that* bad actually. I kinda like the ending, and the music is surprisingly nice.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly acted and packed with genre clichés, Skyline is a chore to watch. It just feels boring and eventless throughout.",
            "review_date": "2016-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so horrible. It has no plot and its very boring. (Spoilers) This is the whole movie. Aliens invade, Abduct all the humans, Earth strikes back even launching a nuke at the mothership. You think the humans may have won but the mothership puts itself back the together the humans lose the rest of them are abducted the end. This is probably one of the worst movies ever made.",
            "review_date": "2016-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I've ever seem, not sure how give 0 starts, so I am giving 0,5",
            "review_date": "2016-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is this a movie?",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Skyline\" provides one or two frightening moments. However. predictable plot devices and familiar elements that tries to couple with illogical characters, doesn't substitute for a greater story.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not a bad movie. Though it is not amazing it stands as a decent alien movie that I enjoyed. The effects were good and the acting was alright but the thing that crushes it is the horribly stupid ending. I ain't gonna spoil anything but it just doesn't make sense and ruins one of the most tense my moments in the movie.",
            "review_date": "2016-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly liked this movie a lot. I know that's a super rare opinion but honestly I always come to see a movie with low expectations no matter what so that I don't get disappointed and I really wasn't disappointed. Sure the dialogue is a little rough but come on now. That's not much of an issue at least in my opinion. At least it wasn't super cringey! The effects were great and I love the ending.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes Skyline is cheap with a cast of unknown's (though Eric Balfour is the spitting image of V from vendetta) the acting is poor, the dialogue is basic and the whole plot is revealed after 30 minutes, but there's a certain charm to this much hated B-movie.\nIf you watch this expecting shit then maybe it will surprise you but don't be under the illusion that it's a good film.\nAlso note that this from the strause bros is a much better effort than there previous AVP Requiem skidmark..",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering this film got really slated, I wasn't expecting to enjoy it and just put it on as back ground whilst I took the Xmas decs down . .... Ended up watching and enjoying the film. Maybe take the decs down tomorrow then lol",
            "review_date": "2016-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By now anybody knows that special effects alone cannot make a movie, and that is an old movie making lesson that's more than explained in Skyline, A pretty but empty, derivative and badly acted sci-fi invasion flick that deserves more to be on SyFy than in big theaters.",
            "review_date": "2015-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes there are movies so different, that both critics and audience don't grasp it . Even a critic who liked it, didn't quite get the points or the \"mysterious\" ending, which - to me - is amazingly beautyfull !\n\nBut that's why You'll see people feeling strange about this story and dialogues - the funny thing is that though this movie indeed is visual, You have to add Your imagination like when You read a book .\nBUT people have forgotten that extra sense because a \"plausible and humanistic\" story is all that matters .\nWell, sorry, \"Donnie Darko\", sorry \"Jacob's ladder\", sorry \"Cube\", sorry \"Dark City\" sorry \"Matrix\" ... oh, wait there's one easy to digest for all !\n\nSO because these Strause-guys are responsible for SFX in Avatar and 2012 You believe they make this movie a DEMO-reel of SFX - that they need to PROVE their skills ?!?\nNo, I'm sorry to say this, You people are deaf and blind just because they generously spoil You with SFX ..., but believe me, there's much more going on !!!\nSome people are just not accepted by the contemporary society, like famous painters they must die or give a shit like Brett Leonard ;-)\n\nPeople are only beginning now to realise that movies like \"the lawnmowerman\"(over 20 years ago) were real gems like this : DIFFERENT or STRANGE . \"When you're strange\" or different, an \"ugly duckling\", You get mocked - and JM could testify this too !\n\nBut I guess that when You're American You see a lot of movies and may get to be too quick on the draw ... I find this movie is sophisticated in subtle ways that escape \"worn eyes\" and I'm a European who happen to like Polanski, Bergman, Fincher, Kubrick, Boyle, Von Trier, Lang, Lynch, Fellini, Kazan, Tarkovsky, Peckinpah, Jarmusch, Bertolucci, Almodovar, Cronenberg, Soderberg, Scott, Gilliam and many more ...\n\nEverybody - both critics and audience - trips them selves up over a really bad movie (even Roger Ebert - though he tried to stop himself) like : \"Burn After Reading\" as long as it's made by the Coen Brothers . Well, THAT movie is crap even as parody on comedy and if You open Your mind to think (!) You would wellcome the Strause Brothers \"Skyline\" which has a surprising and suggestive way to look at large concepts we miss out today like LOVE, PROGRESS, HUMANITY, SPIRITUALITY & CORRUPTION !\n\nBesides that it's bloody entertaining and a well made action horror sci-fi, enjoy it with popcorns and a romantic red wine ...\nYou could argue that I over-interpret this movie, yes, I might be wrong, but the REAL REASON people hate this movie is that they think humanity loses to the aliens - HA !  ;-)",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, this is a question for the passionate haters of this film....  What exactly do you go into a movie of this type expecting?\n\nTrue, the cast isn't gonna win any awards for their performances....  that also includes the razzie award.  They were adequate...  Like a generic singer, they carried their tune without knocking any dramatic socks off.\n\nThe story is thin and the premise isn't original of course, and hell it isn't even fully thought out since the film doesn't give much background as to what the hell these aliens are and how they function...  They need brains to power up or to give themselves consciousness...  but why?  How were they born?  What are they like in their most natural state?  Everything begins from somewhere, but their existence lacks logic.  The ending although cool and actually more interesting than the rest of the movie still just created more questions.\n\nThe highlight and only real reason to see this movie is the alien invasion and at a very modest 10 million dollar budget, it delivers 100 million dollars worth of spectacle.  I was amazed at what the filmmakers accomplished with so little using their own backyard and visual fx house Hydraul'x Inc..\n\nOverall, it's low brow fun, not particularly great... but fun.  See Skyline for the right reason.",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea why I liked this movie so much. It's dumb, there are really no likable characters and it all just feels a little cheap, but damnit those are the MAIN reasons why I enjoyed it so much! I felt like I was watching a super cheesy Saturday matinee movie at the theater while munching on my popcorn and raisinettes and just enjoying myself. I wasn't looking for a smart plot or the best acting around, I was just looking to be entertained and Skyline did just that for me!",
            "review_date": "2015-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The immense amount of hate and disdain towards Skyline probably lead me to not dislike it as much as I could have.  That isn't to say the film is good, it's lightyears from being so with it's stale characters, lack of suspense given its genre, unengaging story and overall boring execution.  In fact, the last two statements are what truly made Skyline a bad movie in my opinion: boring and uninteresting.  Its visuals aren't bad but are very much typical CG I aliens with generic bright blue lights.  In the end Skyline is nothing more than a generic and forgettable alien invasion flick.",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My dad put on this movie which I didn't wanna see in the first place. Even He Hated it.\nThe Ending and Acting was Truly Atrocious, And Yes It's worse than Legion, It's probably even worse than prometheus,\nIt's That Bad!\n\nScore: 1/10,\nBut since There are no good actors: 0.5/10,\nAnd That It's Worse Than Prometheus It's Less,\nOh Yes It's 0/10",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there was an LA party, with chocolate Bear, and then aliens, and then chocolate bear got ate, then the army nuked LA -  t\nI saw pretty blue lights, I didn't understand why the girl was flying, thought the movie looked like garbage worst ending I've seen in a while too. people paid money to see this :/",
            "review_date": "2015-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been a while since I've seen Skyline, but I remember being bored out of my mind with them being trapped in that condo. They also drew out the ending waaaayyyyy too long. Nothing in terms of plot or dialogue.\n\nThis is a lousy excuse of a film.",
            "review_date": "2015-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many things left unexplained in a bid to secure a sequel, good special effects, average acting, poor flowing plotline and various things that don't make sense or sit well with reality.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the hell was that ending about?",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a late night action flick, no question about it, but for that very fact.. I really enjoyed it, I have seen much worse in my life, and I totally think this would outstrip many a late nighter on Sci-Fi channel of my twenties.\n\nThe acting, as others have commented, both pro and con movie, was pretty bad, and only the sexiness of the ladies carried the excitement in percolation scenes.\n\nI don't think this was worthy of box office or dvd.. but as a pilot for a series, I know I would watch, the plot is basically the Matrix with Jarred fighting back against the unstoppable horde with their own power, it's been done before, but that doesn't mean it couldn't be done again.\n\nOut of the cast surprisingly Brittany Daniel did quite well, her anger at her husbands pictures had *some* conviction. I am also a Gotham fan, and noticed David Zayas, his skills are now much improved. Donald Faison, being simply the worst in show.\n\nThe CGI was great, the direction of the action, medium.. but remember I am looking at this as a pilot for a series, if you want to run with the big boy sci-fi office box these days, you gotta come to the party with more than just a bottle of pepsi and a noise maker!\n\nI'd like to see the re-telling of inner rebellion, told from this world's POV. If you just accept this a late nighter slash TV movie, it brings the hype down to a comfortable level so you can just slip into it.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very dismal effort towards alien invasion movies.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline, the movie with aliens resembling the Collectors from Mass Effect 2. That's the only thing I can say about this without getting enraged over how bad it is. The effects are good, but everything else, from acting to story, and especially the ending, were awful. Avoid",
            "review_date": "2015-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall I thought the film was okay although there are moments where I felt I was watching a poor mans version of Independence Day plus I found that the film dragged in places which for a 90 minute film it shouldn't do that and I found the ending very cheesy and coming a mile away",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is absolute dump wasting time at the movies is nothing about saving the world it's just nothingness.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horribly acted, appallingly written, terribly shot, strangely directed, devastatingly boring, absurdly mindless, extremely uneven, unbearably unwatchable, headache inducing, wildly illogical, lacking intelligence, lacking charm, lacking style, lacking plot, lacking relevance, lacking character, lacking action, lacking intrigue, lacking passion. Just lacking.",
            "review_date": "2014-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had such potential, but everything about this film just did not work.",
            "review_date": "2014-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't that bad neither that good, the ending was wierd,, which makes me think..if the aliens used humans, to use their brains to build themselves or rebuild themselves, how in the first place did the aliens appear? wouldn't they need human brains in the first place? I feel the story about the aliens showing up and wanting to get humans could have been more developed.",
            "review_date": "2014-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of these films that looks good on paper, until you realise it has a standard of one of those terrible SyFy direct to TV movies that you would normally skip",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst movie I have ever seen... No originality... Stole ideas from like multiple movies...",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked this movie don't understand the low scoring but this movie made my leg hairs stand up and if it's something that can creep me out then I say it's a good movie.",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9%\nThere is nothing redemptive about Skyline, which may very well be the most miserable sci-fi hokum since Battlefield Earth, and at least Battlefield Earth was laughably bad.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I picked this up from a DVD rental shop I was unaware of its reputation. The box art looked good, but you should never judge a book by its cover. The film started good, but then a flashback killed it.  It cut away from the action to introduce us to a set of B list actors. Prepare to watch 90 minutes of people trying and failing to escape from a hotel. The film tries to reinvent the wheel by letting the aliens win, but this just makes it boring.  There is no plot to this film as at no point do you believe that the main character has a chance of saving the world.  He should focus his efforts into keeping his friends onside because he comes across as a massive tool.The CGI is good, but you only see the air battles from a hotel window. I later found out that this film was made for only 10 million which is an achievement. However, all is not forgiven, however as Hot Fuzz was made for much less and that film had a good cast, humour and a plot.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7/10\nWas in the cinema, good effects back then, the end is as retarded as it can be but who gives a fuck",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely Brilliant special effects. Complete lack of coherent story",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an ultimate failure. Storyline is flat. Nearly an hour is spent on describing the characters relationship, which is irrelevant to the main plot. It is a story with a worse end - an opened bad end. Opened end or bad end may be not acceptable by some viewers but both of them together makes the story looks like unfinished. Maybe the makers just think the viewers not sad enough? Don't try this. Don't even try to download it from Pi**** B**. It just simply a waste of time.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too scary even for me",
            "review_date": "2014-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst Science Fiction movies ever.",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst Science Fiction  movies ever.",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"DON'T LOOK INTO THE LIGHT\" \n\n- 'Skyline' is a 2010 sci-fi-thriller directed and produced by the brothers Strause (Alien vs Predator: Requiem). The film deals with LA being invaded by very deadly aliens. The special effects are good and the creatures are intriguing, but the plot has many mistakes and no real backbone to it. Along the way I even got a bit annoyed by how the story was progressing. It had potential. Starring Eric Balfour (24, ), Scottie Thompson (NCIS, Star Trek 2009), Brittany Daniel (Club Dread, White Chicks), David Zayas (13, 16 Blocks) and Donald Faison (Remember the Titans, Kick-Ass 2). \n\nJarrod (Balfour) and his girlfriend Elaine (Thompson) are visiting Jarrod's best friend Terry (Faison)and his sexy wife Candice (Daniel) in LA to celebrate his birthday. The party is held in Terry's penthouse. During the night, when everyone has fallen asleep, blue lights come falling from the sky. Anyone who looks right into it, gets drawn to it. Waking up to the screams of thousands of people, Jarrod and his friends realize that aliens have come to earth to abduct the human race. Who will survive the alien apocalypse?",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even close; just stuff happens. Not worth it; watch Battle: Los Angeles",
            "review_date": "2014-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there's a message in this movie, it's to be very careful how you spend your time. For example, I wasted an hour and a half of my time watching this movie.",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good B movie. Entertaining. Not the best  Science Fiction of the year, nor will be neither, but I liked. It si a low-budget movie, but the movie has very good visual effects. The script does nothing, not good, but the film tries to cover it with some good scenes.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrifying, creative and cool. Good plot, cool characters, and quite the ending. I enjoyed it.",
            "review_date": "2014-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not going spend a huge amount of time on this one, because it came out four years ago, and honestly, it's really not worth it. But it's not often that I'd rate a film so low. I've seen a lot of films that would be easy to criticise, but I always salvage some kind of entertainment value. At the very least, you're along for the ride. With Skyline, I can't even say that.\n\nThis film just happened to be on TV this month; I'd heard of it, and I saw that it had Donald Faison in it, who was always funny as Turk in Scrubs. Skyline isn't a comedy, and he's wasted, although he's clearly the most engaging member of the cast. As if to rub salt in the wound, he disappears fairly early on, but not before setting up a trite soap-opera love triangle, the tension of which is completely destroyed when all the parties are unceremoniously offed. The rest of the cast is even more forgettable.\n\nThe film opens with a mysterious blue light filtering through the window as our characters wake up in a penthouse apartment. Just as something interesting might be about to happen, we flash back to the previous day for some character exposition. We have to sit through everyone partying in the penthouse the night before, meeting each other and even more unnecessary extras that will vanish completely come morning.\n\nI understand why they wanted to have an intriguing credits sequence. Nobody would sit through twenty minutes of inconsequential partying if they film started that with without any other explanation. We'd have no idea where it was going or what the film was even about. The problem is that we still have to sit through the inconsequential partying in order to find out what it's all about.\n\nThe answer is that it's an alien invasion film. The blue light has a kind of enticing beauty that causes anyone who stares into it to walk willingly into the aliens' death machines. I do think this is an interesting idea. The concept that the aliens possess intelligence so superior to our own that they can manipulate us as easily as we draw moths to a deadly electric lamp (or how deep-sea fish lure their play with a glowing lure) is truly chilling.\n\nThe effects are good, as they should be considering that the directors are really visual effects artists by trade. The visuals cost $10 million of the film's budget, while the live-action stuff was done on the cheap, shot in the directors' apartment building for half a million, almost as an afterthought. There are big monsters, alien spaceships swooping around, tentacles grabbing people and all the rest.\n\nThe film just falls down completely on any kind of convincing plot or characters. You simply do not care about anyone. They behave unpleasantly towards each other and formulate ludicrous plans, such as making for a boat to escape the flying aliens, or driving across town in loud, high-powered sports cars. You spend more time questioning the stupidity of these half-baked choices than invested in the story. But this is just talk: the characters barely leave their apartment, and don't even die as the result of their bad decisions. They seem to be dispatched at random, as if nothing matters.\n\nConceptually, everything's incredibly derivative. Some aliens fly around trailing tentacles like the machines from The Matrix (1999), the large monsters stumble around and crush cars like in Jurassic Park (1993) and climb buildings like King Kong (1933), and the government unsuccessfully tries to nuke the mother ship like in Independence Day (1996).\n\nSimilarly, it can be no coincidence that the film came out around the same time as Battle: Los Angeles (2011), a higher profile LA-set invasion film. I haven't seen that one, but the effects for both were done by Hydraulx Entertainment - the visual effects company owned by Greg and Colin Strause: the directors of Skyline.\n\nIf the characters blandness wasn't egregious enough, you even question the logic or motivation of the aliens. They possess invincible ships with regenerative abilities and lights with the ability to utterly entice humanity. They can suck billions from the streets of a city in minutes, but need to devote resources to sending scouts door to door to pick off every last individual human, and they feel the need to supplement this with a pack of gigantic monsters whose motivation is to wreck up the place. Finally, they want to harvest our brains, which for some reason can perfectly interface with their technology.\n\nThe simplicity of the name 'Skyline' carries a certain amount of elegant gravitas which it utterly fails to capitalise on. It may have some merits as a special effects exercise, but nothing more. There's nothing here that isn't done much more successfully in other movies. If you want tune out your brain (before the aliens abduct it) and watch an overblown invasion, do yourself a favour: go back and watch Independence Day (1996).",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an awful plot and predictable, emotionless characters, there are many apocalypse movies you can see that would be a better movie night than seeing this one.",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow.....DREADFUL.....POINTLESS.....I DID NOT ENJOY THIS MOVIE AT ALL......i think that eric balfoure (from the brilliant tv series 6 feet under, the brilliant tv series 24), scottie thompson (from the tv series nikita), brittany daniel (from the brilliant tv series that 70s show), crystal reed (from the tv series teen wolf), neil hopkins (from the brilliant tv series my name is earl), were good thorughout this movie but i was really disapointed with this movie......WARNING THIS MOVIE CONTAINS STROBE LIGHTNING EFFECTS THROUGHOUT THIS MOVIE.....I THOUGHT THAT THE SCRIPT WAS REALLY WEAK ITS AN ABSOLUTLEY DREADFUL MOVIE......I THINK THAT THE BEST THING ABOUT THIS MOVIE IS PROBABLY THE SOUNDTRACK........I THINK THAT THIS IS SUCH A REALLY AWFUL, DREADFUL MOVIE 2 WATCH ITS SUCH A MESS OF A MOVIE ITS NOT WORTH WATCHING THIS IS SUCH A DREADFUL MOVIE 2 WATCH.......",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gives humanity no chance no hope and undercuts itself with low budget CGI . The only good part of this film is the question that we might not be able to survive alien contact.",
            "review_date": "2014-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only \"good\" thing about this \"movie\" is when it ended. Horrid story. Horrid cast and even worse acting. 2 hours of life I'll never get back.",
            "review_date": "2014-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scottie Thompson is the brightest star in this sci-fi feature, her performance stays solid, believeable and consistent, whereas other cast members don't act well, or they over do it to the point that you're unintentionally laughing. Skyline simply tells the story of an invasion, from a high-rise viewpoint, nothing more and nothing less.\r\n\r\nThe Brothers Strause cake the film in lens flares and stylish camerawork to try and keep you oblivious from the lack of story and decent writing, but with the pace slacking in numerous parts and stilted acting the visuals can't compensate. However, this film isn't without it's merits and they are the action sequences.\r\n\r\nThe UAV drone attack is excellent, boasting the best of what you can do on a limited budget, the effects look spectacular, especially when the alien ship rebuilds itself, it's a marvel to look at! There are some tremendous action shots, I loved the shot of the destroyed fighter jet tumbling over Jared and Elaine, then it smashes into an alien. Suspend your ideas of realism and you'll be amazed. I think three stars is fair, the story and everything involved frankly sucks, it's heavily underdeveloped, but the special effects and one actress make it watchable, just.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies  where people are embarrassed  to say they liked or enjoyed it because misplaced bad reviews. If you're a visual person this movie is for you. Unique and clever looking aliens.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved all the Royce Da 5'9\" songs in this movie",
            "review_date": "2014-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What ever you do don't look up",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good effects and alien concepts. Unfortunately these are ruined by a horrid plot backed up by characters who couldn't die soon enough. Not to mention that this film holds the award for the worst ending ever.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave this more than 1 star just because of the ridiculous ending.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew this was terrible, but still wanted to see it anyways. I just confirmed how terrible it is. Basically it is Independence Day with about half the plot, almost no dialogue and no characters worth being interested in. This has almost no charm whereas ID had tons. One to avoid.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Is literally one of the worst I have ever seen. When I saw this in theaters not one Person left happy.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5%\nReally, really bad.",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies ever, and I mean E V E R !!!!!",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could have been so much better, but the latter half of the movie sucked.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just saw this and I love it. The graphics, the CGI, and Jarrod! THIS IS AWESOME, no really. The ending left me \"IS THERE GOING TO BE A SEQUEL? I WANT ONE NOwww! I want to know what happens to them!\" The aliens were so well done. The Character development is/was cool. I have seen many Syfy Movies but this one sticks out. This movie is so good why would there be negative reviews? The bigginng can aw-inspire science fiction viewers and may as well win their hearts with the cast down towards the ending. This.is. good. Every actor put their effort into this. It's really, just really a good movie. I just really like it. LOOOVE it! But it did make me think \"why not utelize the internet for the people who are still around in this movie?...\" at some points. I am eager for the second movie. Kudos!",
            "review_date": "2014-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was much more enjoyable than the loathsome Cloverfield.\n\nOne line summary: Humans are killed or absorbed by tremendously more powerful aliens.\n\n---------------------\n\nJarrod and Elaine visit Jarrod's friend Terry in Los Angeles.  Terry is fabulously rich, and feels a debt to Jarrod for work they did earlier in life, so he's arranged a sweet new gig for Jarrod if he wants it.  Complicating this is Elaine's very recently discovered pregnancy.  There's quite a party where the new realities are awkwardly announced.\n\nAll this goes down the tubes during the next night.  Aliens arrive in giant starships that hover over the city.  The emissaries from the ships try mind control experiments on our heroes with mixed success.\n\nThe next morning, many have already died from the onslaught, and more die trying to leave the highrise.   Soon the story narrows down to Jarrod, Elaine, Oliver, and Candice and their attempts to survive.\n\nAmerican armed forces fight back with limited success. \n\n------Scores------\n\n\n    Cinematography: 9/10 Rather good.  Some of the CGI was a tad hokey.\n\n    Sound: 9/10 Occasionally hard to hear, but mostly fine.\n\n    Acting: 6/10 Eric Balfour, Scottie Thompson, Donald Faison, and David Zayas gave reasonable performances.  Many of the others were less competent.\n\n    Screenplay: 6/10 Exposition of motivation is more than a bit murky for most of the film, but the end redeems this.  The lack of clear intention by the humans is explained by the mind-control abilities of the aliens.  The presence of the aliens on earth is also explained.  I would think that most viewers would not care for the fact that one needs the last five minutes to make sense out of the rest of the film.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent special effects aside, this alien invasion film bumbles around sporting a weak generic script that's too predictable to be interesting, and superficial characters that don't do it any favors.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending gives promise to a great sequel, but the film leaves a lot to be desired.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first time I have seen a film where the director's just took a dump in the camera then released the smeared turd  for the world to see.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is a very good sci-fi action movie about a couple of people stuck at a hotel during the alien invasion what a great special effects. A good low budget cast what Eric Balfour, Donald Fasion. B+(2010).",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of  the silliest sc-fi movies that ive ever scene.i would have given it zero if not for the effects",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressive visuals cannot overcome the feeling that Skyline has borrowed heavily from the likes of Independence Day, and the remake of War of the Worlds.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't even know what to say!! It's not a great movie about aliens, but it's not so bad either.",
            "review_date": "2013-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atrociously acted with a bland alien story that simply isn't interesting, even if it's really, really, blue.",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have nothing to say. This film made no sense. Why the fuck did I even watch this?! This movie never explains anything but rips off other science fiction movies. This is the District 9 of 2010 and it even rips off that film. If you've seen that, Alien Nation, Starship Troopers, Independence Day or War Of The Worlds, then you have definitely seen this movie. This film was directed by The Brothers Strause who before this had directed Alien Vs Predator: Requiem. The reason why they had directed this was to show they are good directors which they are clearly not and must die! This is the worst film of 2010! Skyline gets a 0/10.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun movie!!  It was intense and interesting!!  The visual effects were amazing!!  The ending was jaw-dropping and a great twist!!  The cast was good!!",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rented this movie....Absolute waste of money!  This movie goes beyond dumb, boring and may I add a complete waste of money!",
            "review_date": "2013-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are retarded movies and there are retarded movies, but it takes a special kind of stupid to make a movie as retarded as Skyline. When your movie's advertising campaign centers around the fact that some of your special effects technicians worked on Avatar, that should be a pretty big sign that it's going to suck. Unsurprisingly, Skyline is a loud, colorful, and technically absorbing film with a bland premise that sadly has absolutely not one lick of creativity, acting, directing, or scriptwriting talent on display.\r\n\r\nIt's hard to believe that a movie can be based and sold to audiences solely on special effects-- I mean, even Michael \"The Pyromaniac\" Bay puts some effort, although halfhearted, into crafting likable characters. But wow, Skyline doesn't even try. Its characters aren't even one-dimensional. THEY HAVE NO DIMENSIONS. A one-dimensional or one-note character will have only one stereotyped part to fill in, like the \"Generic Screaming Woman in Horror Movies\" or the \"Stuck-Up Federal Agent Who Gets His Comeuppance.\" But there wasn't even THAT kind of straightforward and depthless characterization in Skyline. None of the characters had emotion, none of them made logical decisions, and I couldn't even tell you who the hero was supposed to be. I've felt more attachment to video game characters.\r\n\r\nThe special effects (AKA the only reason people watched this movie) are shoddy at best, and certainly sub-par for a movie that actually went to theaters. Remind me how that happened again? Seriously, this thing smacks of a straight-to-DVD piece of shit in the same league as Sharknado. And when the CGI is serving a story as boring and straightforward as this one, you can't really give it any points for effects. \r\n\r\nFinal Score for Skyline: 1/10 stars. This is the Room of sci-fi movies, and can actually really be appreciated as a so-bad-it's-good, over-the-top piece of shit with literally no redeeming values. The only thing saving it from a 0/10 is the lack of self-importance it has. It doesn't pull an EL&IC or The Lovely Bones and pretend to be anything more than a moronic, frenetic, and poorly done (even by b-sci-fi movie standards) story with more bad dialogue and explosions than a Paul W.S. Anderson movie. It's the anus of cinema.",
            "review_date": "2013-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What did you expect? Kubrick? It's an alien invasion movie and it delivers just that.",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the people who made the special effects for Alien vs Predator comes a movie, so stupefyingly stupid that it made me want to smash my head through a wall. Regardless of whether it might give me permanent brain damage or a concussion... Or potential death.\n\nThe special effects are good for a movie that cost $10 million, but is that where all the money went? No money to fix that script which was probably written by one of those \"aspiring\" 12 year-old writers who badly want to be the next Hollywood legends by writing something which makes no sense.\n\nThe acting is very, very bad. I can easily say that I have never heard of any of the actors involved in the movie and they all did a terrible bloody job. I could've played ALL of the characters and I would still do a better bloody job.\n\nIf you can fit a truck through all the plot holes in Iron Man 3 - You can fit two hundred Death Stars in the plot holes in this piece of ass. \n\nThe dialogue is movie-destroying to say the least. The dialogue is worse than what you hear in \"The Odd life of Timothy Green\". I literally cannot describe the awful dialogue, it has to be heard to be believed. \n\nFrom this point, I will be listing the plot issues and holes that demolish the movie. But to summarise - This is one of the worst movies ever made. Ever. It's shallow, incredibly stupid, badly written and filled with unnatural dialogue. If you have to have suicidal tendencies to watch Brother Bear 2; you have to be ready to shoot yourself in the face to watch this because that's the only way it will end.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n*SPOILER TALK TIME*\n\n\n\nAt one point; the mothership gets nuked. The main characters watch it get nuked. The blast radius was only several blocks, why wasn't anyone blinded by the blast? And why didn't they die of radiation poisoning? Also, the mothership survives with no shielding whatsoever.\n\nAt some point in the movie, they reveal that LA is the last surviving city on Earth. If this was the case; how could they nuke the mothership in the first place? The human population is very, very little and no one has resources. \n\nRemember how in 50's sci-fi they used to tell you that the aliens want your brains? Well, same case here. It took us quite some time to move past this cliche and in return we got more realistic scenarios like \"The aliens want resources\" or \"World domination\" or \"Universal conquest\". Why go back to it?\n\nSome time in the credits when the main characters are all eaten, they start to set up a sequel by implying that a character who was turned into an alien would remember his eaten girlfriend and starts flipping shit at other aliens. What's the point of the conquest? They have eaten all the brains in the world.\n\nThe aliens attract people with a glowing blue light which cracks people's faces. If someone saw another person stare at the light; wouldn't they know not to stare at it and as a result; not be abducted?!\n\nIf the abduction requires someone to stare at the blue light; why doesn't everyone pry their eyes away from the light? They can't be abducted if they don't stare at the light.",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "never been so bored in my life",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was actually pleasantly surprised by this, especially after reading some very negative reviews, but I don't think this movie has been treated fairly at all.\nSure, it's another Armageddon/ Independence Day alien takeover movie, in fact, I'd say it's a straight cross between War Of The Worlds & Cloverfield (minus the found footage style), the acting is quite wooden, the characters are quite one-dimensional and the dialogue is minimalistic, but this succeeds in one place where Independence Day fails... It's realistic!! Okay, it's about an alien takeover, which may be unlikely, but it doesn't go through the movie ticking off all the usual clichÃÂ (C)s and actually has a surprising and refreshing ending. The alien machines were terrifying and I was left scratching my head halfway through how humanity was going to defeat them... \nThe visual effects aren't the best I've ever seen but they're by no means terrible & all the action scenes are handled very well.\nIf you like run-of-the-mill, over-patriotic and stereotyped commercial crap like Independence Day, you probably won't enjoy this, but if you're simply a fan of sci-fi and B-movies, give this a chance, you may be as pleasantly surprised as I was.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just awful, at least it was short. Even Nadege disliked.1/2",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haha, this movie made no sense, but had good visual effects as well as Turk from Scrubs.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the least enjoyable thing in the world after waterboarding.",
            "review_date": "2013-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very surprised by this movie , after seeing a lot of ordinary reviews, it took me a year later to finally watch this, and to be honest I loved it !!!!!!!! Yes the script dialogue could have been better, yes even better actors . But for any real sci fi fan this was a very entertaining movie . Special effects great, and the ending for me was perfect !",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good digital effects, but that's it.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know why, but I liked this movie. The ending blows bad though. eeesshh.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seemed as if even the actors knew it was shit so they put nothing into it",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly I actually like this movie.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The F117 Scene was inspirational....the one and only meaningful scene in the movie where the bomber actually makes it through the blockade and delivers the payload! I almost cried.... :P",
            "review_date": "2013-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is about an alien ship that appear over a gient city and sucks up people. If I told you why, I would be giving the story away. But I assure you, it's not worth wathing the whole for. This film is so badly made that I would vote this as the worst sci fi flick ever. DONT WATCH THIS MOVIE!!!!!!!!!!!!!!!!!!!",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie fails to build that intensity/drama.",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some occasionally inspired effects, but everything else is utter garbage.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film I have seen in a long time.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ZZZZZZZZZZZZZZZZZZZZZZZZZZZZZZ.... Oh sorry this movie is boring",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not really sure what the producers were trying to accomplish here.",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Although the film benefits from a strong cast, it can't help but be a half-baked alien invasion movie. Good acting, horrible writing.\"",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certified as one of the biggest pieces of crap I've ever seen. Skyline has an abysmal set of characters, uninspiring dialogue, a boringly orchestrated alien invasion and seems to think that we will get really thrilled at the special effects of this invasion as we join the characters staring at it through their apartment window for ninety minutes. They attempt to leave their apartment building, but they don't even get as far as ten feet before they retreat to watch television and engage in so called 'character development.' Good special effects, but they don't even use them well because it seems to be relishing in it's own 'character driven' story. The aliens purpose for invading Earth sum up the film in a nutshell: it sucks out your brain.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie so bad that not even Turk can save this movie (even if he dies in the middle or beginning).",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the scenes in this movie, don't miss the one where Scottie Thompson is noisily sick in a toilet.\n\nThis happens in the first 5 minutes, and is easily the highlight of the movie.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid and cheap action sci-fi War of the Worlds knock off. With extra lens flare.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utterly dull alien invasion movie which wastes the few interesting ideas it has with a terrible screenplay, hateful two dimensional characters and turgid dialogue. The plot devices are obvious and often illogical and the ending is downright preposterous.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i gave it half a star for donald faison and half a star for special effects but thats all its getting from me i thought it was drivel",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great special effects and good actors, so the elements were there... Shame it turned out to be utter tosh.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing about this movie is makes it worth seeing in the theatre. That must be said up front so that any compliment I give will be tempered. Here's the deal...the characters are dynamicly flat, the dialogue is poor to middling, and one is left wondering \"should I have just watched Independence Day again?\" The answer to that is, of course, No. Skyline's only redeeming quality is the special effects. Big, bright, and loud...they make for the spectacle that should be a summer blockbuster. Even so, this movie proves that great CGI can't make up for a lack of characters, story, plot, and general care for the genre.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where do I begin? The only reason I didn't give this terrible movie a half a star was because of the ending. The dazzling special effects don't overcompensate for the god-awful acting and premise. This movie tries to be funny when it's not. The ending was kind of cool where the (SPOILER ALERT) main character turns into an alien himself and you don't know if he takes over the ship he's in, in order to save humanity.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loud, obnoxious and flashy. Nothing but a big cup of stupid writing, focus solely on subpar special FX, mediocre acting and cringeworthy padding. Definitely one of the worst movies I've saw this DECADE, even when it tries to give a suspenseful atmosphere, it completely fails to deliver due to overall subpar acting and direction. Unengaging, unorignal, followed by a stupid, STUPID ending, that makes you question the sole purpose of this movies existence, it literally feels like a 7 year old took a hold of the material and did whatever the f*** he wanted with it. The movies DRAAAAGS itself at mid sections to try to establish a sense of dread and impending doom and it completely falls flat on it's face due to the fact that none of the characters are relatable, in other words, you couldn't give two sh*** about this movie, it's like waving keys in front of a child in hope to grab their attention, only here we get subpar acting and sloppy FX to try and keep you interested. It has nothing going for it, it tried NOTHING new, I don't even know why this movie exists when this alien invasion subgenre has been done to DEATH and still you can find mediocre movies out there that do it a million times better even when following the same guidelines. The action is boring, the effects are boring, the characters are bland... Just stay away from this garbage.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The special effects is the ONLY good thing here, the rest (characters, performances, excitement, story, progression, consistency, plot and music) is just bad, really REALLY bad, this is one of the worst sci-fi films and one of the most boring too.",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An alien invasion sci-fi film that is like Independence Day with machines that collect humans.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I own this on DVD and Blu-Ray",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so shockingly bad that it has ALMOST tied for the number one spot on my list of worst movies EVER, with the number one movie being 'Battlefield Earth'. Whoever green-lighted this movie should be taken out to the desert, shot in the back, and buried in a shallow grave. Is it possible to request that we be able to post a rating of less than half a star? That would be great in this situation, but since we can't I will give you my 'Regular Dude's Movie Review' rating: Don't go watch it, don't rent it, when it's on TV, change the channel, and if someone offers it to you on bootleg, politely decline. It's not even worth wasting your FREE time on.",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of like \"2012\". Nice visuals, but just plain stupid.",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seriously, the worst movie I have ever seen.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst sci fi movies i have ever seen.You don't care for the characters at all.They don't explain why the aliens want to come.The script is lazy and the ending is STUPID.I'll give it something.The effects ain't that bad...",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "90 min to explain that love makes the diference ... after death\n.  -.-'\n\nmaybe, if the final scene happened early,  the movie could be diferent and could be a little better (depeding on the script)",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think the words of Vincent Vega could best describe my reaction to seeing this movie: \"Oh Jesus fucking Christ. Oh, fuck me! FUCK ME!!\"",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First movie I ever thought was HORRIBLE! Worse of all it was anticipated and so well portrayed in the trailer but it sucked.",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given that The Brothers Strause were the men responsible for inflicting the Hollyoaks Vs. Aliens Vs. Predator unpleasantness that was AVP: Requiem upon the world, you'd be forgive for approaching Skyline with the usual amount of carefulness you'd reserve for using the words \"please castrate me.\"\nThankfully Skyline is better than their previous effort. Not much mind, but at least it has a couple of redeeming features. In a bizarre mix of Cloverfield and Independence Day, the film follows a bunch of well to do 20-something's as aliens arrive over Los Angeles and start sucking everyone up into their big spaceships. Your skin sort of burns first for reasons that we're never really told.......the Strause siblings must have just thought it looked cool.\nThere's some nice jump scares from time to time and a real sense that no character is actually safe which gives the film a slightly refreshing tone. Some of the infighting between the cast of US TV stars isn't bad, Eric Balfour and that guy who was Turk in Scrubs and one of them off Sweet Valley High are amongst them. You sadly don't feel much sympathy for them as they're the kind of people you automatically hate but it is fun seeing them become alien dinner.\nSkyline unfortunately, for most of it's run time, doesn't have an original bone in it's body. This is not always a problem as long as you're doing things right but Skyline isn't. The film seems to go round in circles until the final five minutes when it actually dares to do something different, only to roll it's credits a few seconds later. This, rather than leaving us begging to see what happens next, just makes the whole thing seem a little pointless. If you've got an interesting idea, then use it....don't dangle it at your audience after making them suffer through Close Encounters of the Real World Kind!!\nSkyline is a step in the right direction for Greg and Colin Strause. They've managed to prove that they can concoct a decent scare sequence or two and not have to totally rely on shock tactics - there's no sign of aliens invading a maternity ward here, thank god!. They've still a long way to go as Skyline is far from a good film.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish I could unsee this",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script is mostly void, worthless to be precise. This, being a film is such a drag I'm sure no one will endure.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WATCH FOR THE FX... Not the greatest piece of Sci-fi... it rips of ind' day & war of the worlds for most parts... but when you consider it 10.5m to make it makes you wonder why there are so many trashy big budget sci-fi movies out there...",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underrated fun invasion movie that obviously wasn't made for the chin stroking critics that jump on the band wagon who love to hate the Bothers Strause's spectacularly fun film.\n They managed to make an expensive looking alien invading earth film for peanuts compared to others. The acting is okay and the script acceptable enough, what did you guys expect...every film to be a 2001 or Ridley Scott epic.\nThey tried something daring and took a low budget risk and I really enjoyed myself  at the cinema....and now with the Bluray.\nAnd it's in no way on par with a Sy Fy Channel  film, that's just and insult. They are really crap.,",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few clever twists on the usual alien invasion movie but not enough to sustain an otherwise mediocre effort smothered in special effects. The ending was a bit too weird. I can understand how audiences would have been turned off by it.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alien movie, take two hours out of your life if you can spare the time",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weird confusing movie from directors of Aliens vs Predator: Requiem. What was going on exactly? Group of friends vs invading aliens in LA. Humans lost. Aliens won. The end?",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(7%)\nMakes even the poorer 1950's nuclear scare munger sci-fi B-movies look like masterpieces. The alien invasion stars from the off, only for the plot to then decide to go back and show the \"events\" leading up to it, the only problem is that nothing happens. We see the hip young cast go to the pool, sunbathe, chat and go to a party, it could not be more dull, not one single thing of any real interest happens until the invasion takes place once again, and then you realise \"why did we need to see any of that?\" The rest of the film is better, but it would kind of have to be. Avoid.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has a loose ending to allow a sequel, but all the film is loose and unexplained so there's no appeal for a second film.  It's mostly action of avoiding aliens seeking human prey, and there's not a great deal of dialogue either despite looking the part.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way good movie! I thought it was entertaining. Too bad it bombed, a sequel would have been cool!",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of the worst movies ever! evrything about this movie is bad. its a stupid piece of garbage and a waste of time. stay away from this movie",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a sucker for alien flicks.",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "But it looked so cool in the trailer! :(",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid bloody film with vaginas-on-legs as aliens. Terrible.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not suprised this is on 15% at here. A complete waste of time and lacking in any wit or imagination. One of the worst films I've seen in a while. Anyone work out why Jarrod had abilty to control aliens when brain was inserted? Mystery to me.\n\nFull review: http://neonmessiah.blogspot.co.uk/2013/03/exploding-helicopter-review-skyline-2010.html",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A waste of 1.5 hours of my life... A very weak story, pretty good cgi but that is it. The most entertaining part was naming the tv shows the the cast members were from... Dexter, sweet valley high, scrubs.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Self-indulgent tripe at it's best... Unfortunately this movie blew the budget on the effects that make it just about watchable, but other than that & the fact I want to marry Eric Balfour I wasn't entertained. It just feels like a science fiction film that is trying to show off, but completely failing. Brain harvesting? Lovely.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good special effects, terrible everything else. Acceptable performance from David  Zayas but everyone else is so bad that it seems like he is overacting. Sorry, Turk. \n\nI'd usually give more just for the good effects but this got laughably bad so I had to deduct because of that. Sorry, everyone involved in this bad movie.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aliens do the world a favour by eating rich American cretins.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking. Truly shocking.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it had great special effects it had a poor plot line and wasn't a good movie.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "use rt as my Bible and had this marked as not interested, haven't a clue how it made it onto my pvr. After a dreary flashback, the alien invasion set piece was perfectly fine. It then just went slowly downhill through the second and third acts, and had a stupid ending that lived down to what had proceeded in the previous hour.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Worst Movie I Have Ever Seen.\n\nThis is also one of the very rare times that I actually wanted for the aliens, who were nothing but just visual effects, to actually take over the world and wipe out every person on the screen as they were that annoyingly-bad. I wanted for this movie to end quickly after starting it and only held-up for the sake of a \"fair review\".",
            "review_date": "2013-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unmotivated, simple minded and just plain weird. Skyline is worth nothing more than a 10 second glance at when you're channel surfing and you just happen to run into it.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not even worth watching for free. golden girls is much better",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "how did we ever go from Close Encounters to this? did the alien genre take meth or something? it seems like the people who make skyline got most of their inspiration from Destroy All Humans.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A god awful movie. This was terrible from beginning to end. I don't know why but today I felt like watching a bad movie. At one point today I just had this wierd feeling that I wanted to watch a movie that I knew was bad and I wanted to just watch it. I regret the decision to watch this. I saw it on Spike and I was like, I could watch that. I know it's bad and I may actually enjoy it. I like alien invasion movies. One of the worst decisions of my life and frankly, I want my 90 minutes back. It has a terrible plot, below average acting, horrible writing that it was funny at times, and some of the special effects weren't even up to par. There were some scenes and stylistic choices that I did enjoy in a way, but that's not enough to get past the many flaws in this movie, and there are a lot of those. The bright spots are few and far between. Don't check this movie out, it's not worth your while.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the shittiest movies I've ever encountered...the acting is horrible, the cast sucks, the script and storyline are just stupid...don't see this movie",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I quite enjoyed this film the special effects were brilliant! Wasn't sure about the acting and storyline in some parts (abit cheesy) and the ending was horrible.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Balfour and Faison.  The acting was really good.  The effects were great.  The movie had me feeling as if I was hiding with the characters in an alien invasion.  The problem with that is, people don't watch these movies to be the one hiding.  Most of the time I want to be the hero or heroine.  We want to be the one that saves the day.  If this movie were condensed to ten minutes and the rest of the movie picked up right at the end...it could really be something.   The hero part happens over the final credits.  I'm left with a decidedly unfinished feeling.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really wanna see this movie, heard its off the hook..!",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "eric balfour was better than expected",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw Skyline yesterday. The movie was living proof that very good special effects do not alone make a movie. This clunker had a weak plot involving characters I didn't care about, except maybe Donald Fasion. I got the feeling this was written by a couple of 19-year-old social misfits in their parent's basement, saying things like \"Oooo, you know what else would be cool?!\"\r\nThe movie did leave me with a burning question; We can fire a cruise missle from the Gulf of Oman and hit a specific window of a building in Bagdad or shoot an ICBM from Iowa and hit a chosen city block in Moscow on the other side of the planet at 6000 miles an hour. But we have to fly a fighter plane within half a mile to hit a city-sized hovering target. Really? That's a bit too much artistic license.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have yet to see another film even half as bad as this one.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utter kak.  No other way to describe it.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched 10 mins and knew this was going to be a horrible movie.  Horrible acting but if you like SyFy stuff you can probably handle this.  Should of been straight to DVD or TV.",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not your standard feel good movie but closer to what will happen of Earth was invaded.",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is my favorite alien movie!",
            "review_date": "2013-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline hits the deck. \n\nColin and Greg Strause direct skyline and make an improvement on the terrible AVPR however slight. The movie starts in peculiar fashion by threatening to thrust straight into action only to lead into a pointless flashback in time pre alien attack. The acting is ok but storyline pretty non existent and character building terrible. The special effects are what make the movie mildly viewable and the directors at some points show why they were involved with movies such as Avatar and Iron Man 2 but even this at times goes too far which leads to awfully constructed ending. Ultimately it's a glossed over stinker of a flick that steals ideas from Cloverfield, district 9, war of the worlds, and even artwork from Halo (convent ships) and Gears Of War (the reavers) the list could go on but it fails in all attempts. Looks good but it's hollow and disappoints! Watch district 9 instead or the upcoming Monsters which promises much more.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Will watch again and again. Want to see a sequel.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie until the end.  I like the aliens in this movie.  They were well created and something new that has yet to be seen.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, so i went in this movie thinking to myself \"Not as good as i thought, but it don't hurt to watch\". Then, the 3 minutes past and i realized i was wrong, just dead wrong! Honestly, Skyline looked like they trying to make a Human Centipede emerging of, District 9 meets Independence Day meets generic brain-eating zombies. Okay, so Brothers Strause directed this movie, and just to let you know, i'm not a fan of them at all. The only thing these guys are actually good at is making special effects. That's all! Also, Skyline has like the worst ending ever, cause the whole time i was thinking \"This crap can't get any worse, it can NOT get any worse. Cause it's so bad and awful\". Then, the ending happen, i realized i was dead wrong, again!. So overall, this movie has a shit script, filled with awful acting and bad direction. I can only the movie this: it did have some good special effects. That's it. Other than that, NOTHING!",
            "review_date": "2013-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit of a mix of war of the worlds/cloverfield and the matrix, bits of this were ok and other bits really cheesy, still not sure what the ending was all about",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a different kind of alien abduction movie.  has some good parts to it.  The ending was different than expected.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "weird and totally unexpected ending!!! not very original, but kinda cool...",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that actually aimed away from the cliches of other alien movies. The reality that was created, was made in a more believable state and portrayed other alien characteristics in a balanced, enjoyable state.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So good and then.....not so good",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't finish it..",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Storyline was pretty crappy and what a weird ending.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never understood why this movie got such bad reviews. I thought it was one of the best sci-fi movies in a long while, but perhaps my perception was colored by the fact that I knew in advance that this was an independent movie on a very small budget - I don't think anything this epic and huge has ever been done on such a small budget before. Granted, it is a humble and somewhat simple story without a lot of depth, and it requires humble acting skills, but this movie didn't promise to be deep or philosophical in any way, just a good action-blast and mind-blowing special effects, and in my opinion, it delivered!",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stale popcorn with flat coke. No plot, no point.....",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not everything has to make sense but it has to at least be relatable and Skyline lacks any kind of relatability. It is not creative, interesting or smart; it is stupid, predictable and, worst of all, boring.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hmmmm, that is all. and i hated the ending haha.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Call me an iconoclast but i thought this little film was well done and had an interesting finale.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mediocre at best. Few decent visuals but that's about all this film can muster...",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What story? It was not merely uninspired, but nonexistent. Great special effects, but somehow they managed to 'borrow' and screw up elements from much better sources(Independence Day, War of the Worlds, The Matrix, HP Lovecraft, etc). Without spoilers, it has to be one of the most contrived, ridiculous journeys only to get to a pointless, absurd, and totally unsatisfying ending.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even in the realm of \"so bad it's good.\" Who keeps giving the Strause brothers money?",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie isnt for everyone, if you like apoctalyptic, what would happen sortof movies then this is for you. Some of the things in it are kindof dumb, but the plot is overall good.",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the film features an excellent premise and some truly impressive special effects, \"Skyline\" has several flaws which prevent it from becoming anything more than an above average sci-fi thriller.\nThe cardboard characters never really come to life while their wealth, affluence, and shallow personalities makes it hard for the viewer to connect with them; it's \"Independence Day\" meets \"90210.\" The story is little more than a series of action scenes with the main characters running from one location to the next, and instead of acting are merely reacting to the events around them. Although the premise is interesting and the aliens are both frightening and fascinating, the ending of the film is too abrupt, extremely unsatisfying, and too depressing to truly be enjoyable. The film is unable to move beyond its basic premise, and in the end is little more than a popcorn movie that is all style and very little substance.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it wasn't box office hot but it was interesting to watch.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the worst directing I've ever seen, but the story was interesting in my opinion. I enjoyed the love story between the two main characters, but the ending was extremely stupid. It should have ended with them vanishing within the beam. 3/5",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It ended really weird and kind of icky, but it had some hope.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies ever made. It was bad...really bad. Everything about this movie just frustrated me to no end. It was only about an hour and twenty minutes, but it felt like three hours of utter crap. The characters are among the most generic I've ever seen, so when one of them dies and I'm supposed to feel sad, I just didn't care. Nothing that happens to these characters even matters. They do nothing the whole time except hide in a building. This invasion is happening worldwide, so there must have been something exciting somewhere, just not in the story of these pointless characters. And, these aliens are invading for no reason, and if there is a reason, we are never told what it is. All in all, this movie is a complete waste of time. Grade: F-",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful, the only film I have ever seen where I wanted the hour and a half of my life back!",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the bad reviews I enjoyed this film, great special effects and action.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great effects and cgi but wasted in in this lacklustre movie. Wait for TV",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you make an alien invasion this boring?",
            "review_date": "2012-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie rocked!! i can't wait for the sequel.",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want a good special effects disaster movie then this is it. Other than that, get ready to laugh. Just like the production company that made this movie.... it sure went \"Rogue\"! The ending of the movie leaves you with the most ridiculous cliffhangers in cinema history. \"Don't take my word for it!\" -Reading Rainbow",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible acting, but still somewhat enjoyable.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels like one of those films you get on Scyfy at 10pm. So bad, that at times it's funny.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very flawed movie, shoddy script, z-list casting, and a few too many fake endings. Still entertaining enough, though kind of ruined by a silly, gotta end the movie with some kind of hope, ending.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Skyline\" is so outrageously absurd because the whole structure of the film's story and execution is aggressively frustrating. The audience is forced to sit back and witness an hour and a half of non-existent characterization and flawed special effects, only to realize that everything that could be potentially interesting to see takes place outside the boundaries that have been created by the movie's writers. The result is an intense feeling of claustrophobic nausea that remains prevalent throughout the duration of the picture, and will only end once it comes to a close. The horrible performances and atrocious cinematography further bury the film into a hole of predictability. The Strause family has successfully created a total and complete mess.  \n\nAliens start to take over and they have this special power that locks people in their visual grip until all of their energy is taken away. A bunch of people that the audience has no interest in must stick together and try to survive the onslaught of the extra terrestrials. This idea would have been fine if literally everything was executed differently. Unfortunately it wasn't, and the result is complete chaos from start to finish. Joshua Cordes and Liam O'Donnell have created a terrible script that has no qualities in it whatsoever. Most of the film takes place inside buildings, where the audience is forced to watch horrible characters decide how they are going to go about surviving. All the audience can do is think about all of the things that are outside; hoping that at some moment the screenwriters will actually allow you to have a good time. It's truly baffling to think that a script as bad as this would get the go ahead from a major distribution company, but it did. The movie feels as if it is teasing the viewer, making them aware that their is cool stuff happening in the world around them, but the viewer is not allow to see it. Instead, the film presents the viewer with terrible dialogue from terrible actors, who contain no chemistry with one another. It's a truly  horrible concept. \n\nMaybe the writers had no interest in showing their audience anything interesting because they had foreseen the immensely horrible special effects that would follow their terrible writing. \"Skyline\" looks like a video game cut scene from 2001. The visuals are so insanely horrible that I had a hard time believing that this movie was taking itself seriously. Everything looked like a B movie, and that's not a good thing. The movie almost feels like an unpolished blueprint of a movie that could have possibly been created ten years down the road. The visuals feel as if they are a pre-production shoot for camera testing. To have special effects in this day and age that are this terrible is truly disconcerting. \n\nAs stated earlier, the acting is absolutely horrible. The motley of unknown actors give terrible performances, thanks in part to the utterly flawed script that was mentioned before. Eric Balfour and others seem to be almost completely disconnected to what ever substance this movie may have had at some point during its production. The terrible actors recite terrible dialogue in terribly structured sets, filmed with terrible cinematography, surrounded by terrible special effects. \n\n\"Skyline\" swings and misses in literally every department of film. The atrocious direction, terrible acting, insanely dimwitted script, and terribly offensive special effects don't help the movie clime out of the damnation that it creates for itself in its first five minutes. Rogue Pictures and Universal Studios, for some reason, decided to present its audience with a movie that progresses in literally no way at all. Its a movie that goes nowhere, and literally stays nowhere. The movie itself almost feels like its in the perspective of the extras, and the main characters are somewhere else off screen, where the real plot is taking place. When the film comes to a close, you'll find yourself wondering how something like this could have been released.",
            "review_date": "2012-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can 10% of critcs like the movie, and 75% of people who seen like it?  I wish snobby movie critics would stop reviewing movies that they aren't interested in.  If yoy son't like sci fi movies why are you reviewing them?  I always look reviews from people who went to see the movie.  If I rated a love story it would get 1 star that doean't mean it stinks, alot of people probably would love it, thats why I don't review movies from a genre I don't care for.  Critics hated Transformers 2 and it made over 400 million in USA alone, somebody doesn't know jack there And money talks baby!",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't the best movie I have watched but my curiosity got to me and like the old say curiosity killed the cat, good thing I didnt own one cause it would be 1 life short.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not brilliant but quite entertaining. Better than Battle:LA easily.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This reminds me too much of cloverfield. It pretty much sucked. I hated the ending. I just kept waiting for something exciting to happen.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was pretty cool! i mean its no masterpiece, but i have no idea why it has such a low rating!!! its certainly 10 times better that any of the transformers garbage.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must confess - my favorite part of the movie was the ending credits.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies i have ever seen in my life! The trailers were decent making the movie look like it was going to be good. i saw it and it bored me the whole way. its so bad! The last 15-20 mintues made it worse just how it ended. i warn anyone to not watch this. this is truly bad!",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "horrible.....just no other way to describe this movie.",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible. They had a great idea for a movie, but the story and the script are awful. The conclusion is very confusing and seems unfinished. Don't recommend at all.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kissing while an alien ship is just sucking up? Really? All I can say is that I liked the blue.",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. Why did I watch this?",
            "review_date": "2012-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a good movie but the fact that they only stood in da hotel n there wasnt much action it could of been better hopefully they do a 2 part of the movie n hopefully it be alot more action if they decide to make a 2 part",
            "review_date": "2012-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ehh what? Ending was kind of weird",
            "review_date": "2012-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The effects are stunning, but sadly, alot of this movie comes off as more of a prequel to a video game then as a movie on its own merit.",
            "review_date": "2012-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was such a good movie. But the end of the movie was like a scene from the movie face-off. With Nicholas Cage when he touched his wife face to let her know that he was her husband.",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film could have been so much better. But the combination of poor acting, plot holes, and an overall sense of lacking, this film fell completely short.",
            "review_date": "2012-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why they would release this in theaters and not go directly to DVD is beyond me. This one of the worst movies I have ever seen. There is not one original plot segment, there is not interest in the characters, there aren't even any special effects that we haven't seen before. i only gave it a half star because I accidentally clicked it and don't care enough about this film or anyone who would purposely defile themselves by paying money that no doubt was acquired from loose change found under the front seat of their 77 Pinto to rent this.",
            "review_date": "2012-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only giving this a full 1 star due to the special effects, otherwise it would have got half a star...don't watch this unless there's nothing else on and you can't read...",
            "review_date": "2012-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best part about this movie was reading the reviews afterwards, finding myself relieved I wasn't crazy for thinking this was one of the worst movies I had ever seen. Two thumbs ten toes DOWN!!",
            "review_date": "2012-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "disappointment, special effects are not everything in a film even a sci-fi.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want my time back. What a pointless and poorly made film. Do yourself a favour and do not watch this film. Truly, truly awful.",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total waste of time!",
            "review_date": "2012-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the worst film I have ever seen.",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not gonna even beat around the bush. I'm gonna get straight to the point. This movie was craaaaaaaappppppp. I mean, is this really what Hollywood has come to? Geez, I would have walked out on this movie on an airplane!! I thought this movie would mostly suffer from being too predictable and following too much in the plot steps of an average disaster movie. What I didn't PREDICT was how AWFUL it would be. This movie makes 2012 look like a masterpiece! I'm pretty sure everyone has talked about how much the plot (or lack of one rather) sucked so big, so I'm not gonna waste any more time with this movie than I already have by talking about it. So here is my thought of the movie in a nut shell. Take my word for it, and don't waste your time.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was like 40 minutes in, hated it, and turned it off.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline focuses too much on its special effects, rather than creating a purpose",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie struggles to find direction.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I lovws this film loads, is was confusing but sooo good x",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great visual effects, but the worst screenplay and acting I've seen...!",
            "review_date": "2012-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I avoided this movie for quite some time because of all the negative reviews. The acting is sub-par, and so is the script. I hardly need to point out that the special effects are awesome. What makes Skyline entertaining is the action, gruesome aliens, and great ending to this fair to middling movie.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ummmmm...I guess it was a different take on the type of alien invasion movies.\nNot so much how the common man becomes and hero and beats the incoming threat, no this is kind of about the others guys, except the end but I would have liked more of a follow through.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually, this movie is pretty impressive. Too bad there's no plot to back it up. And, I mean, obviously a movie about aliens is going to be unrealistic, but this just crosses way too many lines. I almost felt like I was watching a cartoon. I like Eric Balfour, but this is just wholly unimpressive.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie inspired other movies like The Darkest Hour to be so terrible.\n\nF",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of worst movies ever. horrible,,,and a WTH/ 'thank goodness it's finally over' ending",
            "review_date": "2012-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest special effects Z movie in history. I'd watch it again just for the nuke scene",
            "review_date": "2012-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is a terrible film. It opens with you seeing 5 different production houses putting their name all over this piece of garage. Then we get a wide shot of the CGI city. Only to be teased with a 10 min opening of some crap that didn't really matter. Then we flashback in order to be introduced to our characters and let them develop, because god knows there won't be any development, or character story arcs after this flashback sequence. However, the whole sequence fails to produce any likable characters. You have the cheating husband, the slutty photographer girl (not really sure her role in everything), the LA princess, the moron boyfriend, and the bland/pregnant girlfriend. Then its followed by action beats, with long draw out parts where they argue about what to do.\n\nOverall the special effects/CGI was not terrible. The aliens and explosions I guess were decent enough, but this film had a terrible script. With terrible dialogue, and terrible characters, and overall a bland story without any purpose or resolution. 1 star, never see this film.",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually thought I was watching a spoof for awhile, how bad is it? Very...",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not so bad! not too good either! but different",
            "review_date": "2012-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most impressive thing about this film is the budget and the way the Strause Brothers made the film. The effects are just as expected since they are the ones responsible for many top box office effects driven blockbusters. The acting is decent, as it should be for an action science fiction film. But, the  story is very B movie like. Big props to the Strause Brothers for putting their necks out there and showing Hollywood that films like this can be made easier and with way less internal politics getting involved.",
            "review_date": "2012-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sucks very bad. Don't watch it",
            "review_date": "2012-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie doesnt even deserve half a star. My god was this terrible. Just when you think it is over it continues to torture you. This movie has led to many divorces and suicides. Watcher beware",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst invaders movie ever made.",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very creative and well done special effects, but the acting and storyline was definitely lacking. I felt like I was watching a loop for most of the movie. Let's stay here, let's go downstairs, let's go back up, let's stay here, let's go down again, get back upstairs quick, we forgot how dangerous it was down there, let's stay here, let's go again. And who the hell would think that the water is like an automatic safe zone?? The constant push from Jarrod to get to a boat was stupid. There are so many smarter options they could have come up with. The ending was cool except for that fact that why in the hell is he still basically himself when noone else seems to be?",
            "review_date": "2012-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a pretty ok movie. It may rip-off \"War of the Worlds\" and \"Cloverfield\" a bit but it's still good. The story is not carries too slow,just right. The score was brilliant. The acting was ok. The effects weren't as stunning as I expected,but some were still pretty good. I loved how the light took control of them and turned them into freaky-looking zombies,as you could say. The romance behind it was so sweet,but in the end it just got cheesy. Shocking,but cheesy. Overall,ok.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful movie based on alien invasions. The ending is far from the old happy ending we're used to. But it's also very disappointing",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute train wreck that offers no entertainment except for the last few minutes.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not entirely sure why this movie has scored so low. It's not great, but I was expecting something much, much worse. Apparently made on a mere $10 million, the budget was spent well. The effects lean closer to summer blockbuster than, say, what you'd see on a tv episode. The performances are also pretty solid and the concept, for sci-fi, is quite interesting.",
            "review_date": "2012-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would give this heap of $h!t a -5 Star rating if that was possible.\n\nAll I can say it wow! I saw this movie for free and want to be paid for having seen it. That was just a pathetic attempt at a film. The makers of this film should never be allowed to work in Hollywood again. \n\nThe story was non-existent, the characters were just pointless, and the ending (or lack of) was terrible. The main hero is just a whining bitch through the whole thing.\n\nThis was a SciFi Original Picture on steroids at best and that insults SciFi Original Pictures.\n\nDon't contribute your time or money to this terrible mistake.\n\nVIEWER BEWARE!!!!!!",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as critics were making out, Ok they did use every alien invasion film and put it into one, The action (What we had) was ok, The effects looked good 90% of the time, The acting really was a killer not by the men but the women they couldn't act at all, Even after a very weird ending it's not bad at all, Having said that it should of ended 5 minutes earlier, But for what was on offer for the size of the budget it's worth a look and it will end up being allot of peoples guilty pleasure.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting this movie to be horrible, but to my surprise, I actually watched it all the way through.  Don't get me wrong, the whole thing was amateurish in every respect, but interesting enough to drink a few beers and watch the thing.",
            "review_date": "2012-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie started out really good - it had hints of Cloverfield all over it.  Then it seems about halfway through filming they fired all the writers, and didn't know what to do with the rest of the movie.  The second half was awkward, and the ending was horrible.  Very disappointed, as the trailers looked incredible.  It could of been awesome with a few major changes.",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me a second to realize that this was just a B movie in disguise. Once I came to this realization I just sat back and watched, not really enjoying anything , but just staring at my TV. Scottie Thompson was very good looking, unlike the usually gorgeous Brittany Daniel, letdown. Other than the hotties, the flick was filled with poor special effects and a pointless storyline... (Spoiler Alert) a f'ing alien race that wants our brains?! Shit is weak!",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline features meaningless characters, horrible dialogue and absurd plot holes that pure and simply waste your time.",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful script, story, acting.  Awful movie.",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "besides ripping off every alien-invasion film (ie; war of worlds, independence day, etc) the acting and story lIne Is so bad it's painful. I honestly don't know how some movie executives get jobs.....skip it!",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So very less annoying the second time around. Cast full of unlikable characters I was pleased to see most of them die. Crazy twisted silly ending.",
            "review_date": "2012-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A complete waste of time.",
            "review_date": "2012-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a thriller with no BS",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great special effects.  Could have used more plot",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to give it 0. No development of characters. You're thrown into a storyline that looks like it was written in 5 minutes. The ending was soooooo dumb! I'm still mad I watched it for the 1hr and 30min!!",
            "review_date": "2012-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline\n\nOh, it's a movie alright. It has characters, a setting, dialogue... Plot? I'm kinda fuzzy on that one.\n\nMain Character Jarrod and Co were all partying hard in a lofty Los Angeles Apartment with automatic drapes that seem quite conevient, until a slight quiver arrives to send them falling to the ground. Cue Flashback!\n\nThey're flashback doesn't explain who the \"shy, uncharismatic\" lead character is or what his does, but his friend apparently is an actor! hey that's great. And it's also filmed in Star Trek-vision letting every actor on screen repeatedly get overshadowed by miniscule lights in the background to the point where my brain feels like it has to swat a fly or move my head. \"Look, the lights are futury!\" I can forgive Abrams and friends as the Enterprise yes is a shiny, lit up environment but this sort of glare has no place in a cocktail party. \n\nAlso at one point he walks away from his actor friend to have a quiet conversation with his girl who turns out to be Prego! Mid conversation their actor friend mysteriously emerges from their private bathroom, which made me wonder how he got in that bathroom in the firstplace, seeing as how our Main left him to end up in this room in the first place. Either there's two of him, or he teleported his fling into the bathroom to avoid being seen in the first place! OR, and maybe I haven't given this enough credit, but maybe the bathroom was connected to the hall. i dunno, It seemed distracting, but I should focus.\n\nThey're all in Los Angeles after a near pointless flashback of how our stars* ended up there in the first place. Bright pretty lights from the sky shine down and- Oh- They're lights that kill people! Luckily our Hero, after being lightly tugged on at the arm by a supporting role, gets knocked over just in the nick of time so that he doesn't die, no, but he's still doomed to sit around the rest of the movie watching stuff happen outside his window. \n\nIt's almost as if the production spent all it's money on cool cgi-er mostly cool, but didn't have enough for anything else.\n\nThese aliens, it is unclear whether they are biological, mechanical, or a bit of both. They're also telepathic, or something... well they can rebuild their ship withtheir minds, and they can make people go towards lights kinds with their minds.. They seem to be harvesting humans for their brains, which they eventually pop into their heads after discarding whatever other brain was in there. Was that my brain? I don't know.\n\nAfter some running back and forth around the building our Mains run back in with the Hotel worker who seems now to be acting as though he walked off the set of a [bad] John Carpenter movie. Helping our hero 'be a man' will do no good, but I wont tell him if you wont.\n\nLater, after some more action and lame characterization our main Hero and Heroine end up on the roof attempting to elude an Alien chasing them when it, as anticipated, comes down behind him! Maybe he shouldn't have been so focused on that empty space he was gazing at. Yet in a moment of pseudo-heroism, our Hero does what comes natural; he picks up a Cinder Block and beats the alien mech with it before [too soon] dropping it, and fake attacking it ith his bare hands. Add some cgi to make it look like he's interacting with it, aimlessly animate a brain flying slippperishly off to the side, and he's done! Man I had to pause and rewind, it was unspeakably hilarious that cinder block scene, and then seeing that animated brain just slip away quickly off frame against the seeing laws of film physics, i didn't know I was in for such a treat tonight. I should give this movie 9 Plan 9's JUST for that alone!\n\n\nAfter it resurrects itself, naturally,  some troops help them escape. They almost get hit by the plane from Die Hard 4 (well it might have been a helecopter, but it doesn't make a difference at this point) and we get our moneyshots in the form of extremely slow pans of - you guessed it - the Skyline! *gasp!*\n\nAfter that they get sucked into the Alien ship where I found myself hoping the two of them would get sucked into whatever Hive Mind was running things since I thought the movie would have ended 15 minutes ago. Jarrod does indeed get his head ripped off, his brain floats around and gets inserted into a mech, but -here's the catch- because he looked at the bright pretty killer alien lights(or whatever) and was pulled away before he either succumbed or got harvested for brains, he's now The One, so he can control the Alien tech with his mind alone! Now the excitement bubble will inflate forever, and we'll get to finally see him take down the aliens-wait, no? We don't get to actually see that? Oh hell, here's one lase look at that pretty blue light before we go to credits. Now you have one last chance to have YOUR brain sucked out TOO!! :D\n\nThroughout the movie I found myself thinking about the Rollerball remake, which is starting to look good about now, and Battleship, which admittedly I didn't see (I might watch it just for Liam Neeson he's badaz)but don't need to to realize that it's  more Transformers than District 9. But Skyline, to me, was worse than that. It was Battleship by way of Dragon Wars. Just awful awful bland bland awful. \n\nBecause Rotten Tomatoes only gives the illusion of a 1-100 film score(it's really more like 1-10) and I sometimes find myself somewhat indecisive about rating, I'm gonna go ahead and give Skyline a half a star out of 5. I could rate this higher but it would be like asking \"What's worse? Hellraiser: Hellworld or Highlander: Endgame?\"",
            "review_date": "2012-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again, I seem to be out of kilter with critical and popular opinion on this movie.  While it's certainly no classic, and riffs on Cloverfield in a big way, it's a perfectly enjoyable 90 minutes of invading brain eating aliens in the best Sci-Fi B-movie tradition.  The production values presented on screen belie the limited budget.",
            "review_date": "2012-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great FX (for CG), some original alien designs, break neck pacing and that's pretty much the end of the good things. Much like the Strause brothers previous film, AVP: Requiem, the film is all about the FX and monsters with no originality or development given to the plot or its characters. And there's the abrupt ending which leaves much to be desired.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just found this as a recommendation but watched this movie 2 years ago and still remembers that how lame this movie is...",
            "review_date": "2012-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh dear. Great special effects and ship/creature design but pants script and awful acting. Very badly miscast. \n\nAs for the ending... Bonkers. In a bad way.",
            "review_date": "2012-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute crap. The acting is disgustingly bad, but the writing is much worse. None of the action had me rooting for them to survive, and I kept questioning how these people are still alive. \r\nSome of the visuals are okay, but they get repeated over and over and over again to the point of boring.",
            "review_date": "2012-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i seen the movie and I'm really into movies, but their story line sucked! i mean i loved the effect of the movie and all, but dude! Where is the end of the story? what's the moral of the story? Was the whole movie just for some dude to turn into an alien? in my opinion, this movie sucked! it deserved a better storyline based on the special effects. i could of written a better story. sorry!",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cannot believe that movies like this exist. Are there no sensed human beings to stop producers from making these ridiculous, pointless movies? The worst part? They make millions of dollars for a piece of garbage.",
            "review_date": "2012-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't completely hate this movie but I wasn't in love with it either.  It wasn't a bad time killer, I saw it on a rainy day.  I wouldn't see it again, but I don't regret watching it.",
            "review_date": "2012-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an awesome movie all the way up until it's final moments. But it's final moments weren't what you would want. There was no tying up of major storyline! But the final moments were awesome in themselves but the movie as a whole could've definitely been better. Although if they do make a sequel it won't be so bad. But overall it was atrocious",
            "review_date": "2012-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In all honesty after about 5 to 10 minutes into this film I just stopped the movie and sent it back in the mail. The entire storyline fails, and the cast were all forgettable. The only good quality about this film is the special effects. I only wasted at most 10 minutes on this film; don't make the same mistake I made and instead just act like this film doesn't exist and go watch a different film. You have been warn.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sucked. Plain and simple. Terrible acting, decant visual effects, and an ending that made me confused and angry.",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special effects were great, but the story left me wanting. Writing was bland. Characters were boring. Nothing in the storyline grabbed me. A few suspenseful moments and good effects are the only reason I didn't give it a lower rating.",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is filled with awful, awful dialogue and campy characters, but at the end of the day, that's all part of the fun.",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a movie that was nothing-but-hated on, I thought it was decent.  Great special effects.  Suspenseful.  Poor script and acting.",
            "review_date": "2012-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good visual effect's but crappy movie",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible! spare yourself!!! I gave it a single star simply because the special effects were pretty good. other than that, it was just BAD.",
            "review_date": "2012-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Glad I didn't pay to see this. It's as bad as everyone says.",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just watched this movie online. Visual effects are great, but the plot sucked, and the ending is dumb.  At one point, I started cracking up  laughing when Jarrod (Eric Balfour) starts punching the alien with his fists over and over again.  During this time, there was dramatic music blaring in the background.  So I know the scene wasn't supposed to be funny, but it really was! LOL!",
            "review_date": "2012-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where do you even begin with a movie so poorly put together? While the special effects are exceptional, 'Skyline' fails to deliver any real thrills as the movie is shot to hell with uninteresting characters, boring story and crappy dialogue not to mention pent up momentum that is quickly deflated without reason by end credits. Skip.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think that if they chose a better cast then the film could have been slightly better because the acting was just crap. It was so boring for like the first 30 mins then you expect something good but it was just horrible. The plot is basically aliens wants brains. Just horrible. Never watch this but it isn't the worst fim ever.",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Worst Film I Have Ever Seen",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good but i think the ending could had been way better",
            "review_date": "2012-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not including the ending it was alright. Not including the ending I'd give it a C but the ending was so stupid I give it a D 65",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a lot better than people made it out to be. It's a decent sci-fi movie that is a great movie to rent.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad that it should be banned!!!",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film so derivative the proposed sequel may cause ripples in the time space continuum, the brothers Strause prove once more they know a lot more about special effects than plot, characterisation or script. Barely passable as something to look at, but about as emotionally engaging as a paper clip.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good enough.  The ending was like WTF though.  Lol",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't expecting it too be this good! Hope theirs a 2nd part.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hour and a half of my life wasted, this is shockingly bad. AVOID",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This had such potential to be awesome. The highlight were the fx and the interesting plot, I was intrigued from start through the non-traditional Hollywood ending. The cast full of has-been's and tv folk I can usually live with, except that this hodgepodge crew had zero chemistry... honestly, I really didn't care if they all died or not... and damn, the dialog was just nonsensical, it would have been better on mute.",
            "review_date": "2012-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that has good special effects but nothing else which tires most viewers easily.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely on my list of worst movies I've ever seen. I want that hour and a half of my life back!!",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline starts out with a pointless intro extended by turning back the timeline, and within the intro you will witness crap acting and a terrible script. By 30 minutes, you will want to turn it off cause they manage to go through EVERY cliche element in film history without a redeeming moment. In the end,  They advertised an alien invasion film, and thats what I expected. What I got was even Dumber and more boring than AVP: Requiem, another terrible film from the Strause brothers. Skyline relies on the quality of its visuals which are so rarely half-decent and buried under all kinds of poor filmmaking that it becomes the most minor thing in the film. If they had been used more and in a better way, then maybe Skyline wouldn't turn into one of the worst films I've ever seen, but the potential this film had was take and just shoved straight up the filmmakers ass. And they were dumb enough to leave the film open for a sequel after absolutely nothing happened in this one.",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this for free Saturday after seeing Unstopable right before. This movie was horrible except for the CG. The dialogue sucked which made for shitty acting. But the idea was cool and the CG & effects is where it shined.... To bad everything else looked cheesy and the way they shot the film sucked.",
            "review_date": "2012-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the ending was impossible and made no sense, nothing can survive a nuclear bomb, even if it rebuilds itself in 45 seconds, and the whole let's take you to Tue start of the action and then back it up a few hours is way over done already and it didn't even work in here. The acting was bearable ill give it that much, unlike battle: LA, which was actually really good, there is no hope for humanity and they show it by making situations that even extraterrestrials can't survive and blowing of the real science and physics behind it. This doesn't normally bother me because I am not a science nerd and do not know much physics but it was so obvious here! I almost never do this  it I do not recommend this movie to anybody, not even to the die hard scifi fans.",
            "review_date": "2012-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It isn't as bad as most people claim it is. This is no more and no less than an average sci fi flick and I'm really surprised that it got so much negative rating especially since there a lot more worse sci fi films out there, who got a much better rating. Even the much crappier \"Battleship\" is better rated and I might be going too far but this here is MUCH better than \"Battleship\" (high rating there is probably due to the debut of Rihanna and all her fanatic fans). The character development although it too like half an hour wasn't solid enough (and frankly - not needed). I haven't seen an invasion of brain-eating aliens in a long time so this was something 'new'. The final was really cool and tells us there might be \"Skyline 2\". A genuinely clever spectacle was *SPOILER STARTS* the massive usage of unmanned drones escorting a bunch of stealth bombers *SPOILER ENDS*, which shows that the writers did do their homework.\r\n\r\nOverall it's not an incredibly bad film.",
            "review_date": "2012-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know why no one seems to have liked this. I wasn't fully on board with the movie, until the very end.......now I want to see what happens in the second.",
            "review_date": "2012-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I have ever seen. Just please, don't ever see it. So many things went wrong.",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films ever made. The directions obviously have the mental age of a two year old, because some of the logic in that film makes no sense. I did like the ending, but what did it prove? Why do the aliens need brains? That's ridiculous.",
            "review_date": "2012-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i wanted to watch this movie because of the trailer because i thought it would have a good story but i was dissapointed, the only thing good in this movie was the effects and the aliens..it looked good and you can't tell that it's just a B movie, the lines are old and boring it could've had better lines, the acting was ok. It's still worth watching though because of the detail of the effects and the ALIENS!!.",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good concept just not a good cast?!",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline ~ Do not watch even if ur life depends on it.  On my WORST movies of all time.  Want to file class action lawsuit against everyone involved in creating this movie.",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So BAD! \nTo save you from this nightmare of a movie: In the end, his pregnant girlfriend goes into the Alien spaceship and her boyfriend becomes this, this 'thing' in order to save her. So he basically destroys everything on the space ship. No to mention this but every supporting character dies.",
            "review_date": "2012-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unbelievable special effects that are as beautiful as they are frightening, but this alone cannot carry a film. The scenes in-between the sci-fi images are lifeless and boring or have little to do with the story.",
            "review_date": "2012-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not well put together bit of a mess",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the story and the telling of it were just so weak it couldn't be ignored. there were parts that were pointless and meant nothing. at one point you are watching people watching the army doing it's thing. The of the effects were really good and the director clearly had certain shots that he wanted because they were framed very well. just not so good over all.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most boring apocalyptic film. Ever.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline was sadly and horribly predictable, and felt it was nothing more than Independence Day meets War of the Worlds.  The aliens reminded me of the Sentinel machines from the Matrix trilogy as well as their modus operandi for the humans.  Eric Balfour even tried a Keanu Reeves/Neo rendition and failed.  I would only give 1 star but gave 2 for some decent effects and for decent action sequences when the actors were actually running from the aliens.",
            "review_date": "2012-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an awesome movie all the way up until it's final moments. But it's final moments weren't what you would want. There was no tying up of major storyline! But the final moments were awesome in themselves but the movie as a whole could've definitely been better. Although if they do make a sequel it won't be so bad. But overall it was atrocious",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually had a riot watching this with my brother. It's hilariously bad which is why it gets two stars instead of one.",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG!! it grabs you holds you there and then you find your self asking where is this movie taking me? the affects were good, it teases you of a sub story which is really the story and then doesnt give you anymore about it how, why? But it did hold my attention so i give it credit. will catch it on the \"superstation\"",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome visual effects are totally undermined by bad writing and acting. I saw this several months ago, but I don't recall liking a single character in the whole film. After this and their debut pic \"Aliens Vs. Predator: Requiem\", it would be surprising if the Strause Bros. continued directing.",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a waste of time. The acting was a joke and the story was all over the place. The only thing good about this film was the CGI and special effects.",
            "review_date": "2012-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Is A Good Movie. ¿How says that is The worse movie ever? . It entertains and has cool special effects and weird kind of cool ending. I want the sequel  :-)",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The price the world has to pay for having the major studios in Hollywood is that you can Monopolise the Alien Genre & pretty much have the attack solely on American soil! Yet again aliens attack Earth & yet again it's an American city, Los Angeles this time (again!). There is a token gesture at the end of the film with further attacks on other cities across the world. This film is a mixture of Cloverfield, based around a group of friends at a party, & Independence Day. Even Face/Off gets thrown in with John Travolta's loving face stroke making an appearance for goodness sake! \nDavid Zayas, from Dexter, & Donald Faison, Turk from Scrubs, along with Eric Balfour star in this alien abduction film. A group of friends are woken after a late night party to find strange lights across the city which suddenly take any person staring at it. Soon alien spacecraft appear over the city & our group of friends then fight for their survival while trying to remain undetected to escape the city.",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effects are great! But the stupid acting and the cliched plot makes this movie UNBEARABLE! But, its worth watching if you're in just for the effects and the death scenes.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a scene towards the end of the movie where the main character says something like this: \"What are you going to do when all the blinds fall down? It's not exactly like we have a lot more bed sheets!\" It was in the moment where I began shaking my head in complete dismay as to what the hell I was watching. The screenplay, the cast, the acting, everything was just terrible. The effects were the only thing going for this film, but even those were either blurry or hidden by bright lights. Skyline is horrible and one of the worst of 2010.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a film that while it does have good direction, great visual effects and a good performance by David Zayas, the rest of it just falls flat. It's leads are bad, it's story is just messy. I'm left with more questions than answers by the end. Needless to say, it just wasn't good. Nothing terrible, but nothing too spectacular and leaves more to be desired.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible don't bother, acting is terrible and the movie is just as bad!.... it only had a $10m budget and you can tell.  Get new script writers!",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gives new meaning to the word \"horror\" applied to a film. The real horror comes when, late at night, I reflect that someone invested all that money and time and the acting talents of Eric Balfour, whom I think is quite a good performer, on such a piece of doggy do-do. I wish that there was a rating below 1 star and I wish that i could take back that lost hour and a halfI spent in awe of this ever having been made!",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst 8 dollars spent in my life and I saw \"All about Steve\"",
            "review_date": "2012-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've seen in awhile",
            "review_date": "2012-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A massive piece of crap just made for the money.",
            "review_date": "2012-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent effects cant save this terrible film.",
            "review_date": "2012-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really felt like I lost 90 precious minutes of my life watching Skyline.  Good acting but terrible execution of the story.",
            "review_date": "2012-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really hard to decide what to think. It seemed like this owuld have been better on SyFy as saturday movie. Than it would have been worth more a lot more. But as a full on movie yeah just cant cut it.",
            "review_date": "2012-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trust me there are worse alien movies out there, just take a look at Gareth Edwards' Monsters and you may have to reconsider your stand on this movie.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is a monster thriller with some cool sci-fi subplot.\n\nThe alien invasion formula goes something like this:\n1) Aliens kick some butt\n2) Hero realizes a way to fight back that only he can accomplish\n3) Hero starts kicking butt\n4) Hero takes on harrowing adventure against insurmountable odds to save the human race.\n\nSkyline offers a unique sci-fi concept of the origin of a hero.  So, it basically covers only part 1 of 4 the story formula, barely getting into part 2.  As such, this movie could be described as a prologue to a great sci-fi epic.  Nonetheless, instead of being a 30 minute prologue into the rest of a possibly spectacular and novel movie concept, the story of extra-terrestrial invasion is drug out for 100 minutes.  \n\nThis means Skyline is your basic alien invasion or monster thriller.  This follows the traditional archetype.  The monsters cannot be defeated, can travel interstellar distances, yet have some pretty simple failings and limitations.  The monsters can hypnotize you by looking into your eyes, even over hundred of yards of distance.  They will chase you mercilessly.  However, they cannot hear you breathing around the corner of a wall, and they can't see through walls (even though our modern military has such technology), or for that matter, they can't see through window blinds.  There may actually be an explanation for why this is the case (wink wink), but you are likely to feel tempted to feel the movie undelivers.\n\nSo I say, see this movie for what it is ... a popcorn, \"get the monster as close to the hero without killing the hero\" thriller.\n\nI think the sci-fi concepts behind this alien invasion make this movie unique, and according to my 'prologue' description, could possibly lead to exploring a rich new universe of truly alien extraterrestrials.  Or it could lead to a great video game, or dare I say it, comic book.  Sadly, it probably will not lead to a sequel movie, because I think the movie doesn't deliver the trailer's promises and the critic's expectations, meaning this may fall the way of the unappreciated cult classic.\n\nThe trailer lures people in promising some science fiction goodness, and in comparison, the \"unrealistic\" monster movie rules seems to be a hateful impersonation of what we want from science fiction: believable, it-could-be-true fantasy.  Although I must point out again that as you peel the onion layers back, there are explanations for the aliens' failings.\n\nNevertheless, I think if you realize from this review what Skyline is, you will enjoy the pretty awesome special effects and the roller coaster ride it has to offer.  The extra-terrestrial design is very detailed, and reminds me of the art of the great graphic novels.  All you have to do to enjoy the movie is to suspend your disbelief.  That can be tough for us Sci-fi junkies, I know.\n\nThere are some cool surprises in the film relating to the origin of the aliens and how their technology works, if you are looking for it.  I'm intentionally being vague as not to spoil it for you.  (Once you see the film, you may have fun chatting it up on the internet about all the subtle clues in the film.)  The viewer may be frustrated, because the mysteries are only fully defined by the movie, and little is revealed by the end, paving the way for more adventure.  (I feel that I did piece a lot of clues together, and so I appreciate the artistry of the mystery.)  In this way, there is a lot more of the alien's world to learn about.  If you are the movie goer who wants an onscreen character to explain the science behind the science fiction, you may leave feeling cheated by the movie's subtlety in revealing the inner workings of the alien menace.\n\nSo in short, Skyline has tremendous potential, and I am sure the sequel will rock.  The movie will leave science fiction fans wanting more... and probably not in a good way.  Judging by the popular vote, we the people recognize this movie as a good time, even if it is not oscar material.  It's a monster thriller with some cool sci-fi subplot.  If you don't mind thinking carefully about the movie as you watch, there is a second, deeper level to the film.  I say this in the most positive way: you can appreciate this movie as a monster smash em or subtle sci-fi piece, making the film versatile for the audience.",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I believe only Commander Shepard knows the way to stop them... but even that didn't have a complete ending",
            "review_date": "2012-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a bad play off Independence Day with a worse ending. Waste of an hour and a half of my life.",
            "review_date": "2012-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprisingly entertaining and inspired sci-fi film that surely deserves some recognition.",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film seem like half an idea, similar to District 9 without the intelligence, wit, forethought or charm. Overall lacks any originality seems to have homaged (ripped off) any number of higher quality sci-fi from the last 50 years",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "scary alien stuff!!!",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely love this film.  I think it's brilliant.  Sci Fi doesn't need inspired dialogue.  It should be all about the special effects.  But Eric Balfour is so gorgeous I'd watch him opening a paper bag.",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Words cannot express the utter failure of this movie. A prime case for the argument that effects are not everything. The only thing they did right, was that we would lose a battle with aliens. That's it. Literally.",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another stupid alien invasion movie with poor actors' skills...",
            "review_date": "2012-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this movie way too slow. Besides the main couple, all other characters are completely throw-away and I could not attach myself to anyone else.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hope they make a sequel.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is just terrible. The acting is horrible, and it is just another pointless alien invasion film. Expected garbage like this to go straight to the television sy-fy channel.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pathetic, if I could give it no stars I would have.  If you want to be depressed and bored at the same time, watch this.",
            "review_date": "2012-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "November 18, 2010 - This past weekend, I had planned on seeing Unstoppable, the new flick directed by Tony Scott and starring Chris âStar Trekâ? Pine and Denzel âEverythingâ? Washington. But my girlfriend and I went to visit her family in Kingman, AZ this weekend, and Unstoppable just wasnâ(TM)t in the cards. See, Kingman is a bit of a one-horse, four-theater screen town, and the only new release within the city limits was Skyline.\n\nI know youâ(TM)re probably thinking, âWhatâ(TM)s that?â? Skyline is the very definition of âthat one movie,â? but more specifically, itâ(TM)s âthat alien invasion movie.â? There were trailers on TV with bright blue lights and blurry spaceships; you know, that movie that looked like Independence Day meets District 9.\n\nNow you remember what Skyline is, and youâ(TM)re thinking, âWhy would you even see that?â? Answer: Itâ(TM)s my job, and ainâ(TM)t always sunshine and roses. And even though you have no interest in seeing it, let me confirm your suspicions: Skyline is a sucky movie, and you shouldnâ(TM)t watch it.\n\nThe premise is simple: Aliens invade, and the protagonists stand by Cloverfield-sans-handicam style as they are trapped in their apartment, waiting to get taken. Sure, they try to escape, but the drones that suck brains and the giants that suck people (and not in an awesome way) thwart our heroes at every given turn.\n\nBut letâ(TM)s be fair: These people donâ(TM)t challenge these aliens all that much. Yes, they are trapped in a hotel, but their attempts at escape are few and obvious, and they quickly give up and sit inside the apartment, waiting to die. In their attempts to escape, the concept of escaping in the sewers never occurred to them. From all I could tell, these aliens seem to be akin to a child picking off ants â\" they never dig underground.\n\nBut this hopelessness, which Skyline is chuck-full of, wouldnâ(TM)t be so unforgivable were the heroes even remotely more than clichÃ (C)s. These are not characters, but rather cardboard cutouts, played by actors we frequently recognize from television or as âthat one guy/girl.â? This is a flick written and directed by former special effects artists, and one canâ(TM)t help but think all that time dealing with manufactured moments made them forget the importance of the little things, like character development.\n\nThe same goes for originality. The situations in Skyline are all recycled from the aforementioned Independence Day, District 9, and Cloverfield, as well as Close Encounters of the Third Kind, Invasion of the Body Snatchers, The Thing, Starship Troopers, and every other sci-fi movie you can think of. In short, you have literally seen everything in this movie before, and youâ(TM)ve seen it done better. That the most original idea in Skyline comes in the form of an epilogue, and it comes off like an obvious, half-baked video game concept, should indicate the very most that a potential audience has in store.\n\nHowever, if there is one good thing about Skyline, it comes in the form of aspiration. The movieâ(TM)s budget is reported to be roughly $10 million, but the CGI certainly doesnâ(TM)t indicate as much. From the perspective of just looking at good special effects, Iâ(TM)d sooner watch Skyline than, say, similarly bad flicks like Clash of the Titans or Percy Jackson. Years from now, Skyline will be remembered in the same vein as The Last Starfighter (1984) â\" a bad movie that proved how much we could do with special effects on a limited budget.\n\nBut it will only be movie nerds, or the occasional grown-up who was subjected to repeated viewings as a child to the point of unflinching and necessary affection, who will remember it. Why? Because Skyline sucked.\n\nhttp://garysundt.wordpress.com",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont know why i watch this stupid movie..the acting is sooo bad..and dont bother the stupid plot..literally so stupid that it will make you regret to watch this..even the special effect is not that good..stay away from this movie..!",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good special effects, but the storyline is so 'War Of The Worlds'.",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "movie started good and was meeting up to its hype but it took some wrong turns and sank fast. wait for it on dvd.",
            "review_date": "2012-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This move has received some pretty crummy reviews but I quite enjoyed it.  The alien invasion of Los Angeles gets underway immediately and it soon becomes apparent they are harvesting humans for their brains.  What do our small group of survivors do, hide? run?  Meet War of the Worlds and Independence Day on a low budget.   The characters are bland and the acting marginal although the special effects are impressive.  Silly escapism.",
            "review_date": "2012-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could not even finish it, atleast I could finish jack and Jill",
            "review_date": "2012-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time, I have lot two hours of my life",
            "review_date": "2012-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! I can't believe I just wasted two hours of my life watching this. Absolutely horrible film. At least it was with a free Redbox code, but still, what a waste of time.",
            "review_date": "2012-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a complete piece of CRAP. There is nothing good in this movie. I gave it half a star for the well done VFX relative to the budget of the movie, although the designs were mostly stollen from various SF like Independence Day. Other than that, the plot, writing, character development, acting etc were non-existent. There are some bad movies out there where you can just turn off your brain and still semi-enjoy them, but this was absolutely unbearable. And to top that off, they want to make a sequel.",
            "review_date": "2012-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's hear it for Skyline. Okay, the script is less than average and the characters refuse to rate much in the sympathy stakes, but apart from that what is there to dislike? The film is obviously a hybrid of Aliens, Independence Day, The War of the Worlds and Cloverfield but it delivers on the promises of all four and some. This includes the resolutely dark ending which is better than that usually contrived by other equally absurd but entertaining alien-invasion Sci Fi movies.",
            "review_date": "2012-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than the somewhat over the top special effects this movie lacks everything credible characters, dialog, substance, an ending,etc.\nI mean for this kind of effort you may as well throw in some boobs and some bad jokes and make it into a durky comedy this country is famous for, lame at best and the end was incredibly bad, I mean it was horrendous!",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only redeeming quality of this movie is that its accurate about the chances we stand against any alien that has the ability to travel across galaxies to conquer us",
            "review_date": "2012-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good but a pointless ending but over all good",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dumb and just another alien film.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even half start I fast forward many parts don't waste your time terrible acting story line doesn't go anywhere.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "everything was cool in the movie but the end was BAD BAD BAD!!! -.-",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was ok, bad ending, they cut it out when a somewhat district 9 story kicks in, acting wasn't great and the movie was short and took a while to kick off into the action within the film",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh, I hated this movie! The plot is pointless and it's really depressing. The good thing about this movie is the special effects. D+",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucked, period. From beginning to the end. Don't waste your time unless you're stoned or something.",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as horrible as the reviews I saw made it out to be, but when the best thing you can say about a movie is \"wow, cool special effects\", you know something ain't quite right either.  Direct-to-video sequel anyone?",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved it. Had some romance too it.",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand that this was a bad movie, but it entertained me well enough.",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I forced myself to finish this flick, despite the difficulty... I've got a short, not so sweet review that tells ya exactly what you might be in store for if you'd like to check it out....\nhttp://theramblinreviewer.blogspot.com/2012/04/skyline-2010-does-view-match.html",
            "review_date": "2012-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this isnt the worst movie ive seen, trust me, ive seen alot worst, but its definatly a sci-fi cheese and baloni sandwich, with way to much cheese and a huge overdose of baloni! how to sum this movie up is that its simply a feeling of a collage direct to video type of movie, cheap, unoriginal and just plain silly. ill admit the visual effects are pretty cool and their was an awesome death scene, but the movie has way too much issues of its own, especially the visual effects. the plot has a hole in it and it must be explained, like whats with the characters and why are these aliens here? the kind of questions this movie makes me think is why is this movie so incomplete? also the characters are unexplained nor interesting, same thing with the aliens, which happened to be the green brain alien from billy and mandy that came back with an army and changed their apperance as robots. and whats worst is thw ending, which happens to be the worst ending in a movie in years, its so idiotic, unexplained, unexcusable, unacceptable, and incomplete, like this entire movie! so if you want to save your brain, i suggest avoiding this sci-fi crap. D-",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A laughably bad sci-fi mash-up with some above-average special effects. The actors go through the motions, the visual-effects team try making the alien invasion look awesome but with a wafer-thin script the film just doesn't know how to end ans so it just abruptly stops. Please don't make a sequel.",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why does this exist?",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie tries to be an epic alien/apocalypse film, but ultimately it ends up being incredibly dull and lame. The CGI is about on par with Pixar animation which is used to create aliens that look like flying, black vaginas, and one that is a rip-off of the Cloverfield monster. The dialogue and actors are really bad with the exception of David Zayas who actually turned in a genuine performance. However, it's not like I had high expectations from the guys that made Alien vs. Predator: Requiem.",
            "review_date": "2012-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely rates in the top 2 worst movies I've ever seen.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good premise that never really took off.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't wait to see Skyline 2, so that this won't be the worse movie I've ever seen.",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a very fast action kind of movie  the ending was different its like it doesn't end",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good special effects and that's about the only positive thing. One of the worst plots ever and a terrible script and bad acting. Big letdown",
            "review_date": "2012-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What would happen if Independence Day and Snakes on a Plane had sex. I have low standards for movies if the special effects are good...but this was just plain horrible. Trite. It's not even deserving of the 1/2 star.",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not what I thought it was going to be, I went in expecting a cool action movie.  What I got was some indie movie that tried to be an introspective movie disguised as an action flick.",
            "review_date": "2012-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "TERRIBLE. the films story makes no sense. I like most movies & I am a sci fan, but this movie was just awful. Don't see it. I saw it at our city's value cinema & I'm still upset I wasted a $1.75 on this piece of crap",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of action, but many scenes seemed to be taken from other sci-fi movies.",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the exception of the last few minutes this movie is a total disaster. Just because you can create amazing visual effects doesn't mean you can competently director a film. Why create a cast of worthless characters only to see them picked off one by one in a film that offers no explanations. I do think the ending was bold and different and even set up for an interesting sequel.. BUT if it follows the same waste my time path as this crap-fest goes why would I even bother. Without the last Matrix ripped off 2 minutes of the film this would be an out and out BOMB for me. Yes, amazing FX on a small budget. For this major props are given but again, pretty visuals doesn't make you a writer or a Director of actors. Go back to school Brothers Strause and learn a few things.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've ever seen in my life, Skyline has nothing good to offer... and whoever decided to cast Eric Balfour as the lead actor should be fired.",
            "review_date": "2012-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie seriously pissed me off, wasting my damn time like that. First, what's the damn plot? Why are the aliens here? First movie where the aliens actually win, or do they? The end was so vague on if Jarrod's character was gonna save humanity. Also, what makes him so special that his brain can fight the alien body that it's inhabiting...HORRIBLE DO NOT WATCH IT!!!!!!!!",
            "review_date": "2012-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it,but then the end was really weird and left you guessing.",
            "review_date": "2012-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of a movie. Typical alien invasion plot, but can we get an ending? Don't waste your time or money with this one.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From my review site:\n\nhttp://grimmfilms.blogspot.com/2010/11/skyline-2010.html",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I have ever seen. In fact I recommend everyone to watch it if just for the laughter.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has almost every mistake in a production, with a little budget has excessive cgi set pieces and looks cheap and shaky, the performances are painfully bad and the script is pure trash, Skyline doesn't offer anything in substance to the viewer and it leaves with a hole and a memorable ending just for its ridiculous scope and laughable pretended sequel.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie ended right as it was getting good",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh cool an alien invasion movie, wait who's directing it? The same guys who directed \"Aliens vs. Predator: Requiem?\" Damn...this movie's going to suck.\n\nI hate the AVP movies and the second one is worse then the first just because they ripped off all the famous moments from those two series. So I was not looking forward to this movie at all. The only thing that is better here then in AVP:R is the lighting, they had a better lighting crew for this film, but that's about it.\n\nThis movie is pretty boring a half the time and when it isn't boring, it either rips off \"Independence Day\" and some other sci-fi movies, or it unintentionally funny with the stupid dialogue and the dumbass characters. The biggest insult to the movie is that the ending actually gets really interesting, but then it just cuts to credits and we see what appears to be stills of the aliens and characters represented by action figures. I could not stop laughing when the credits rolled because it was so stupid and kind of sad.\n\nThis movie is actually better then I thought and definitely better then AVP:R, but that's not saying much. If you want to watch something that you will laugh at with your friends, then \"Skyline\" will do just fine, just remember to bring beer.",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only good things were the aliens and the special effects, although the last five minutes raised a bit the level, creating the possibility of a sequel, that could be sonething completely new also for the sci-fi panorama.",
            "review_date": "2012-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One uninspired, boring, useless movie. And it's not fault of having tried to be one good experiment.",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline was just plain terrible. Half way through the movie I was yelling 'get out of the freaking apartment!'. I am still wondering how this movie was ever made.",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excelen effects, old story retold with nothing new or interesting added, but some scenes are vissually astonishing. It does have some entertainment value, but script and actng are mediocre at best.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't be fooled by what other people say this is a very very good movie with fantastic visuals",
            "review_date": "2012-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The opinions I've heard of \"Skyline\" from friends and critics has been overwhelmingly negative.  I disagree, having just watched it, I found it a very entertaining, tense piece of popcorn entertainment. There are moments of real beauty during the destruction, some strong ideas, an attractive cast, including a memorable turn by David Zayas of \"Dexter\" and, most importantly, the aliens, with their tentacles, insectoid look and glowing blue light, are very cool. An underrated entertainer.",
            "review_date": "2012-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imagine biblical 'Rature' mixed with alien invasion except that the humans caught up in mid air were unwilling to be sucked up the mother ship.",
            "review_date": "2012-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The good and bad parts of the film go on to weigh out the sane, with CGI used well but the acting is not, the plot seems to running wild but the action seems fine.",
            "review_date": "2012-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is just not the type for a person interested in. in my taste of movies, colin and greg strause does a good job on only keeping the characters in contact of plot. the movie is just to garish to watch and believe that it is happening. if rebooted, i would recommend a lot work needed to be done. the movie just makes itself so stupid. nuff said",
            "review_date": "2012-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending is soooo not fun... did they run out of money or something and just said... oh well, lets show it anyways???",
            "review_date": "2012-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it was nice to see a new idea in the alien invasion genre it still falls short of being a good movie",
            "review_date": "2012-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utter garbage. Do not watch for your own sake.",
            "review_date": "2012-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img] \r\n\r\nThe ending was probably the only part of the film that was open minded and not a rip off of something else that was better. A movie that came just out of nowhere much like the aliens in the film itself, Skyline is a cheesy, badly scripted, mediocre performance infected, confusingly plotted B movie. But the thing is me, Mark Kermode, Kim Newman and 2 other people in the world kinda liked it. Most of the B movies of the 21st century never follow the rule \"it's so bad it's good\" like the cult movies of earlier years. While it's nothing worth remembering, and anything but decent, imaginative and ambitious. Skyline falls into that category. It's not entirely satisfactory, but it's significant proof that low budget films can have amazing special effects and most of the time it's never entirely boring.",
            "review_date": "2012-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Skyline does have some neat special effects and some moments of cool action, that is easily overpowered by it's corny dialogue, mediocre acting, choppy editing and directing, massive plotholes, lackluster pace, disappointing payoff, and just a plain stupid ending. A lot of people like to say that this movie rips off other, much better sci-fi films like Independence Day or District 9, and while that is technically true, it's not much my style to compare and contrast between films. I like to just think about the movie I see on it's own. But with that said, I'll just say that some decent special effects and a few nice action scenes are not enough to save Skyline from becoming a forgettable science-fiction shitfest.",
            "review_date": "2012-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst films I've ever seen...",
            "review_date": "2012-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting and dialogue in \"Skyline\" are so abhorrent that most viewers will find themselves begging for the movie to end.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent effects but the story line was rather bland and the entire film takes place in or around a apartment building. The characters were uninteresting and there was a lot of bad moments. The worst thing was the ending which took a horrible turn and was just awful.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just didnt care at all but some of it was cool",
            "review_date": "2012-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shit of epic proportions",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imagine an invasion movie made with the same production values of AVP:R.. this is that film. No logic, no likable characters, nonsensical plot, unrealistic reactions, awkward script: \" We don't exactly have enough bed sheets.\". On the plus side there is 1 cool monster you see briefly twice and the human harvesting looks fantastic. So that's 1m 20s of neat stuff in 1h 25mins of movie.",
            "review_date": "2012-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible special effects. However I do not believe the movie had a script.",
            "review_date": "2012-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this could of been a great movie until u get 2 the end of it . u will say what the frakk happened",
            "review_date": "2012-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The special effects were the ONLY attribute that warranted even the one star rating. If it weren't for that, then I would've rated it 0 stars, if I could.",
            "review_date": "2012-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually impressive, though lacking in the story. Gives a hop, skip, and go style plot with shock developments that don't really seem to fit in any way other than a means to an end.",
            "review_date": "2012-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad movie. Cuts off when things between main characters expands (think District 9). Other than that the plot was awesome.",
            "review_date": "2012-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was not a bad movie. That said it was not a great movie. The alien scenes were nice and the over all idea and concept had potential. The acting was made for a tv series.",
            "review_date": "2012-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imagine being fed laxatives, chickpeas and dried chilli-beans and then being captured by the Dr from human centipede then you know that you've eaten 2x the shit before it's even clears of your body. \n\nThis movie achieves low end expectation meets shit mind violation without trying too hard. \n\nThis movie is a double dose regurgitated sh**, penned by blind illiterate chimps of the predictable, funded probably by some money laundering chump, and the only use I can see for this movie is one can use the  DVD case as an emergency pooper scooper and the DVD as a coaster. The movie shamelessly sets itself up for a sequel. If you want to make some money quick you may set up a euthanasia clinic at every box office this movie features at. You'll be a millionaire by the second night!",
            "review_date": "2012-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad scifi alien invasion movie  then the ending makes you want more... should have cut the first half down some and extend the ending....",
            "review_date": "2012-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie a while ago but I had to express just how disappointed I am in the shoddy story, crummy characters and weak plot in this waste of money.  All hell breaks loose outside, the army is fighting for their lives and we're forced to watch from a shuttered apartment, where a bunch of hollow characters cower in fear.  Nice premise eh?   There's some crap about light and mind control and an illogical alien abduction plan.  In the end, after they FINNALY get outside, the writers decide to spring one huge plot twist on us before cutting their losses and ending the movie early.",
            "review_date": "2012-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable special effects.",
            "review_date": "2012-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "why this guy are still make movie?",
            "review_date": "2012-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't think this movie was that bad at all and am pretty surprised by how low it's rating on here.  It's a great sci-fi b-movie with a budget, and the acting's pretty good.  Definitely a great afternoon/late night sci-fi special effects fest.",
            "review_date": "2012-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a good movie here waiting to break out but sadly the ending will have you laughing at its stupidity, far too loud to notice!",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eric Balfour is a regular bit** I hate characters like that!!! This movie is ok would not buy it.",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movie  of 2010. slow  idiotic suspense or should i say no suspense at all .  only  CGI is very good  but has no story .",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the worst movie  of 2010. slow  idiotic suspense or should i say no suspense at all .  only  CGI is very good  but has no story .",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The CGI is beautiful but the acting is horrible and the ending is rushed",
            "review_date": "2012-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ooh, scary alien abduction! Its about a bunch of people watching alien abduction happening live through their living room curtain! Blahhhh!",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of 90 minutes. Not a bad film; it's harmless enough. However everything about it is unoriginal. Be it plot, scenes, creature or tech designs, this is filled with ripoffs of Starship Troopers, The Matrix, War of the Worlds, Cloverfield and Independence Day. There is nothing new here. Oh, and the characters are wholly uninteresting. Avoid.",
            "review_date": "2012-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seemed like a different director for each scene. This movie was sooo horrible, nothing made sense at all. Bad Acting, Bad Script, Bad Editing, Bad Story = Save Your Money and Don't even waste it on renting this film",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely dreadful, hands down the worst movie ever",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a world where Monsters, Cloverfield and War of the Worlds have already been made, there is absolutely no need for this derivative b-movie schlock nonsense to exist. Towards the end it almost enters so-bad-it's-good territory - with classic lines of dialogue like \"something is happening\", a priceless slow-motion \"nooooooo!!!!\" and an escape plan that involves a bed-sheet covering a window. They clearly ran out of money at the end of the film - there is no other explanation for the worst movie ending in living memory. Disturbing.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was surprised this wasn't as bad as it's made out to be. However, that's probably its biggest failing - the action & effects are better than b-grade, & they highlight the inadequacies in plot, story, characters, etc, depriving it of true b-movie status. If you're in to sci-fi it's perfectly watchable, even enjoyable, just don't expect an incredible twist & an awesome ending.",
            "review_date": "2012-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all of them die except the girl not very good acting creepy aliens icky brain stuff not much of a story line so much jarrod eric perlman okay lots of heavy breathing fighting planes",
            "review_date": "2012-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is 90 minutes of my life I wish I had spent watching paint dry which would have been more exciting than this film. The effects are awesome however the storyline is shockingly bad with an ending that leaves you scratching your head. Giving it 1 star is perhaps one too many.",
            "review_date": "2012-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is absolutely terrible. One of the most god awful films I have come across.",
            "review_date": "2012-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was bad. I had NO ending at all, and if it did it made no sense. Acting was bad and really it seemed like a character couldn't stay on the screen long enough for you to get to like them. (SPOLIER- every real character died) It was hard to understand the plot, had no ending, and an undetailed beginning. Awful movie.",
            "review_date": "2012-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not add bad as everyone said it was. Worth watching!",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good movie. But i didnt like the way it ended. It ended like it is a to be continued tv show. So i hope this movie has a part 2 to it. If not, make one because it should really have one since it ended the way it did.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My least favorite alien invasion movie of all time... so far. The only thing good about this movie was the special effects. Everything else was terrible. Awful movie.",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find it hard to believe that the only thing they take are brains",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly bad movie.  Started weakly, and just got worse.  Plot was standard alien-invasion stuff: unoriginal, predictable, filled with vivid explosions and about nothing else.  Then to crown it all off, this movie has one of the worst endings in history.  \n\nDespite its craptacularity, I sense a sequel...\n\nAvoid at all costs.",
            "review_date": "2012-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film was aspiring to \"generic eye-candy alien invasion movie\" heights until the incomprehensible ending came along and ruined everything.",
            "review_date": "2012-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Skyline\" 10 Scale Rating: 4.0 (Bad) ...\n\nGreat effects ... poor storyline and execution. To top it off, the aliens were ripped right out of several sci-fi movies that we have already seen.\n\nAliens show up in L.A. one night and start plucking people off the streets and sucking them into their mother ships. A group of survivors attempt to escape the skyscraper they are staying in and figure out what is going on ...\n\n... and they never really figure out what is going on. In fact, I don't think the writer or directors knew what was going on either. We never find out why these aliens came to our planet or why they do the odd things that they do. Which makes you wonder why they made them do odd things to begin with.\n\nThe aliens were one part \"Independence Day\", one part \"The Matrix\", and one part \"Transformers\". There was nothing special or unique about them at all.\n\nThe same can be said for the human characters as well. Hint: You can't make a survival flick when the viewer doesn't care who lives or dies ...\n\nLastly, the ending was confusing and absurd. It made no sense and takes an odd turn that wasn't in line with the rest of the film. I hear they are doing a sequel ... why?",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice effects, but the rest was just crap",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film fails on all levels. Hammy acting, no soul, utter garbage.",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was very awesome, with a good ending. I recommend seeing it.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh god this movie is crap. There's nothing even to laugh at.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just when you think it couldn't get any lamer...the ending arrives",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The visual effects and the ending were anything but the average (made by the guy who did Avatar special effects) and thus deserve the extra stars, but the generic plot and characters exhausted me. Elaine looked like the generic Olivia Wilde and if this is the best thing Turk can do since Scrubs, the acting world be damned. It was an alien movie like every other alien movie. The plot and characters are interchangeable with Battle: Los Angeles, Darkest Hour, and anything else that involves bright, glowing aliens that are undefeatable and a couple of partiers interrupted by the whole ordeal.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The effects were good, but the film as a whole was not great. Take the ending a little further and maybe get another star.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Up until the scene where they put the window covers up, it was coasting towards around a 5/10.  Then it absolutely lost the plot - again and again.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I was about to sit down and watch this movie, I found out there is a squel being released in 2012, I still wondered how it was going to end....even right up to the moment the credits appeared. \nA great SFX laden movie, but after a while you start the think what movie has it copied. The story is poor, but alteast for the entire movie the story focuses on just the main characters, there is no underlying story. The acting debatable and the only saving grace was the SFX. \nThis is the movie the War Of The Worlds rehash would have been had the aliens not been prone to the common cold and it's as equally bad. I'm still stunned by the shocking and absolutely farcical end, but hey, it's got a sequel...it beggars belief how, but it has!",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's like the Matrix and ID4 had an ugly depressed baby.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Make no mistake, this is a bad movie. Yet at no point when I was watching it did I think \"this is an unbearable piece of sh#t\". It's just that it's so bland, so trite, predictable and forgettable that it literally has no reason to exist. It's just Cloverfield minus the terrifying monster, creative talent and tension, plus aliens. That's it. Move along now",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly executed, poorly acted, poorly a movie.",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome aliens, like nothing you've seen before. If the movie 'War of the Worlds' occurred in LA, this is what it would have looked like. But the fact that I'm typing this as I watch the movie indicates it's nothing worth putting much attention. However, this would have made an awesome video game!",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've seen. Right down there with Suckerpunch.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is watching the cast of any boring reality TV show watch an alien invasion.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A toss between the part where I was falling asleep or analyzing the scattered screams of the audience. I started realizing this movie is so terrible when I found myself stretching limbs. Then I got a better confirmation when I was more preoccupied understanding the possible reasons for the I-am-in-so-into-this-movie screams of some women. God forbid that last night was their movie dates. Too much of a deal breaker. Their special someones just lack taste for films. Is it too hard for them to visit Rotten Tomatoes? There is no harm for believing in reviews. Skyline is so bad that I was thinking of these things instead of finding something positive out of it. I have the perfect excuse watching this horrible science-fiction endeavor â\" am just curious how it received a pathetic score from Rotten Tomatoes. Plus I do not have a movie date to torture for a couple hours. A few scenes into this special effects mess is all I need to understand the deplorable rating.\n\nOne element this Brothers Strause film venture lacks â\" aside from a compassionate friend to tell them stop making this movie vehicle â\" is a hero. If the lead stars are the last chance of human race from total alien annihilation then say goodbye to your loved ones because we do not stand a chance. There is no stand up and cheer moment that seems to be a de rigueur in all end of the world scenarios. In its place is a succession of clueless decision-making from a bunch of idiots. The brain-snatching aliens must be scratching their tentacles in total disbelief. So much for intelligent life in the outer space.\n\nDo not file this under Films so Bad It is Good. Hell no. This goes under the Just Bad Call the Guinness because It has to be a Record file. I guess the Brothers Strause still had a terrible hangover after a vodka binge while conceiving this movie. A sober person will not come up with this garbage. There is no point discussing the plot if there is even one to mention. There is no point mentioning the acting merits of the cast. Filmmakers should learn that a solid special effects effort does not cover up the fact a movie sucks.  This film has no point at all.\n\nThis is a harsh review. I think. Though the film is harsher. I find it quite difficult to call it a film. For the love of life do not even think of watching this movie. Save that cash for the future  or donate it to good cause. Trailers of Monsters and I am Number Four is so promising that I felt science fiction is going several notches up from the usual. This movie serves as a caveat to that promise.\n\nRATING: C-",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh..... It had a good concept but the acting was WEAK at best!!!!",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I spent 4 dollars on some insipid movie. The movie didn't even have a starting point, or if it did, I hope they made it a little bit more relevant.",
            "review_date": "2012-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best acting but I thought the special effects were really gr8 had me wowing a few times.",
            "review_date": "2012-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's rare to find a movie that's so bad and has 0 redeeming qualities. The characters are all terrible, the lighting is amateur, and the plot makes no sense whatsoever. I like watching bad movies, but this is complete shit!",
            "review_date": "2012-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe I loose my time watching it. the story is really boring, the ending is terrible, it sucks\nit was just about a war between humans and aliens, nothing more... id does not have a story!",
            "review_date": "2012-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline doesn't live up to its promises. The stunning visual effects save it for the lack a of true compelling story. Not too much explanations are given for the invasion or the reasons why Eric Balfour's character is half possessed. The story is very thin, but again, if you are a fan of F/X, is it still worth to watch.",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie with spaceships and aliens and firefights, but all that takes place outside.  Most of this movie takes place inside a guy's condo where the actors argue and engage in painful dialogue.  This supposedly was a similar movie to Battle: LA, but the latter was much better.",
            "review_date": "2012-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dude this movie like built up and built up and then the last two minutes of the movie i was like \"SWEEEEEEEEEEEEET THIS IS AWESOME OMG!!!!\" then it was over...wtf?",
            "review_date": "2012-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending was stupid. I don't think it was worth the Redbox dollar I paid to see it.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst sci fi movie of 2010!!!",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, I dared to watch this movie that I was told countless times was horrible. Why? -simply for the curiosity of 'How bad it could really be?'. It's honestly quite laughable- but, of course, not meant to be. Especially the ending (without ruining it) - I was awestruck by the crazy attempt to lead into a sequel. If you love sci-fi movies you'll probably get a kick out of watching it - BUT your girlfriend won't and your family will probably disown you. Fortunately, the plot followed a near predictable storyline and I was able to narrate the action before it happened. Rating: 5/10",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good visuals very poorly thought out plot.",
            "review_date": "2012-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst movie I have seen for along time.. No depth in characters, very much copying the plot and scenes from War of the Worlds and very bad ending.",
            "review_date": "2012-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a stupid fucking movie...seriously, that shit was boring...they better not make a sequel after that stupid ass ending to an overall lame movie...",
            "review_date": "2012-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie barely earns the 1 star. At first it started off ok, but then it progressively gets worse and worse as it goes on. The ending is one of the biggest LOLWTFs of all-time. I never thought I'd say this, but I'd rather watch \"Battle: L.A.\" again over this one.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite all the bad reviews, this movie thrilled me.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice looking, but empty inside...",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you hate someone, recommend this movie for them.",
            "review_date": "2012-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very dragged, the film is boring throughout its duration, bad script and actors who are average. More than a disposable alien invasion movie.",
            "review_date": "2012-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Someone played a little too much Gears of War",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You'll like it if you like cheap SyFy films with terrible effects.",
            "review_date": "2012-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A standard sci fi genre film, fun though lacking any true suspense or originality since it borrows from countless sci fi films before it",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The trailer was one of the best I've seen in years, which really makes this even worse. I go in being led to believe that this movie is about alien invasions. What I see is three blonde morons, two sensible dudes, and a complete tool hiding in a hotel room from giant glowing blue beetles. The critic is unhappy.",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to give the movie credit,.It wasnt BORING,.Ive seen alott of sci-fi movies that make you wait forever for something to happen,.That being said it is basically an Independance Day rip-off except that the characters are much less likeable in this,.You almost want the aliens to win if these people are the best society has to offer,.The special effects were more impressive than most movies ive seen and the aliens were big and cool,.This movie definatly could have been alott worse,.Im glad i saw it,.FOR FREE!,.heheh :)",
            "review_date": "2012-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was down right awful. The 30 second preview was better than the entire film. What happens to the people in this film should happen to whoever thought this up!  \n\nFirst of all, when the crisis hits, why two whole days before the military even shows up?  Then, to make things more disappointing, the aliens can't be destroyed, they regenerate!  Even their machines regenerate.  Come on!  That fact combined with all of the really bad acting main characters, especially the concierge, and you just know humanity is doomed.  They couldn't think of a better way to show the effects partial exposure to the aliens has on humans?  I also thought the job of a concierge was to serve the tenants, not treat them like captives during a crisis. \n\nNear the end, (which doesn't come soon enough) when the last two \"survivors\" are taken up into the alien ship, stop the movie right there. What happens inside the ship is the very definition of the term inconceivable. \n\nIn the end there are no winners, only losers, including the films makers. Not to mention a lot of lose ends.  The title didn't even make sense.  Most of the view was of the Los Angeles \"skyline\" but it had nothing to do with what happened.  What's next, a movie about a war at sea called \"Water\".",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty impressive i must say. A very interesting and weird out movie. Will they bring a second out? Well they better because i need to know what happens.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline, if not always successful, refashions the modern alien invasion motif as the hopeless siege that it should be.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could not sit though this garbage for long, before turning it off and watching a better film. The plot is absolute drivel, something about Aliens harvesting humans, which does not sound bad if you have not seen the actual film itself. You can't help feeling unsympathetic for the characters, which are just a plain unlikable; they are a bunch of idiotic party animals and dumb college freshmen who are having an invasion of hormones. The bizarre thing is most of the film is set in an apartment building, whist an alien invasion goes on outside. In the film, a strange blue light shines though the apartment window, someone get's scared, then later on someone hears a noise, another person get's scared. Then horrible looking CGI aliens fly out of the sky and absorb people. Do not watch this rubbish, it is badly written and made on a budget, you will regret it. Watch a decent alien invasion film like The Faculty or Mars Attack, there are plenty others out there.",
            "review_date": "2012-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Depends on what you're expecting, but if you're expecting pop-sci-fi then this delivers. And I appreciate that it doesn't waste time pretending to be deep and gets right to the fun. The ending takes what could be considered a far-fetched or silly angle, but I like the comic-book quality to it.",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mmmm can't wait for the sequel.....",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God Awful! wouldn't recommend it to my worst enemy! So much promise so little in script story line or substance! stay well clear if you have any like for movies!",
            "review_date": "2012-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oddly engaging but it does feel like we're trapped with the wrong set of characters whilst a far more interesting film takes place outside. However, the indoor setting does add an interesting small scale element to world changing events but I would have preferred more likeable characters within this confined setting.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was like Cloverfield, District 9 and a little like ID4. Wait till it comes to DVD.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad ending. Good effects. They've spent a whole of money for no reason.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has no plot and is unoriginal. The only reason for giving this movie such high rating is because some of the action and effects included in this movie were not bad. This movie was too long and quite boring.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit 'Cloverfield'. a bit 'War Of The Worlds', a bit 'Independance Day' and a bit 'Crap'. Mediocre acting with nothing new plot or direction-wise mean this relatively low budget sci-fi flick plays like a TV series rather than a movie. Indeed, if it had been chopped into episodes and shown on the small screen I might have enjoyed it more. The ending is ill conceived, what the aliens do with the captive humans makes no sense at all. Some scenes do build tension and there are some decent enough effects - although when a nuked alien spaceship magically rebuilds itself it looks silly rather than scary. Only bother seeing this if there's nothing else playing you like the look of better.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning is very interesting, but the it get boring. Less action and the effects is great! But the end kinda confusing.",
            "review_date": "2012-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My grandma can film something better than this crap of a movie.",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In fact.....i don't know what does it meant and  let me felt like times unable to presenting this story...:(",
            "review_date": "2012-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as bad if not worse than 2011's \"Battle: Los Angeles\"!",
            "review_date": "2012-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Syfy channel movie with better effects. Terrible writing and acting but decent effects. Only watch if you really want to see it.\n\n~ Average Movie Guy",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great effects, but a forgettable film",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of, if not the, worst movie(s) I've ever seen.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good visual effects, but story wasn't that spectacular.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tuesday, January 3, 2012\r\n\r\n(2010) Skyline\r\nSCIENCE- FICTION\r\n\r\n  Big budgeted version of \"Cloverfield\" centering on a group of fortunate growned up teens staying at a LA suite who conveniently weren't yet affected by the aliens invasion as opposed to the rest of the city of LA. The film is also predictable and stupid, with some overactive performances.  Special effects similar to the ones done on the more superior \"District 9\" released in 2009 which is why this film gets 1 star.  One of the aliens weapons was a special blue light which if looked at long enough can end up being a victim as well and can be avoided if one were to stay at a stairwell or a locked room which the film fails to address!  And for some reason curtains, shutters and drapes don't either work or apply!\r\n\r\n1 star out of 4",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline tries to prove that presenting a film of only special effects and a weak story can overcome the box office.",
            "review_date": "2012-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CGI specialists the Strause Brothers prove that whilst ambition is good, sometimes it's best to stick ith what you know in their directorial effort with the sci-fi Skyline. A lot of time and effort clearly went into the effects sequences and they do put many more \"prestigious\" big budget efforts to shame. Sadly this seems to be where all their energy was focused as otherwise this is poor to average derivative scifi, with unimaginative and unengaging characters, an overambitious mishmash of both alien invasion and Cloverfield-type monster genres with a central concept straight out of the trashiest 50s sci-fi horror which is just unintentionally hilarious when played straight as it seems to be here. And the less said about the \"twist\" the better.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie got some bad ratings overall - I didn't think it was that bad ... makes you wonder what is out there.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I heard little more than negative reviews about this movie so perhaps my expectations going in were low, but I was none-the-less left thinking that this is something, if not great, at least original.\n\nLike Cloverfield it's very boxed in, with the majority of the alien invasion viewed by bystanders. I usually don't take to that limited perspective, but it somehow worked here. I even began to sympathize with their having to choose between staying and trying to escape--the condo building began to make me feel safe, too, despite knowing the inevitability of them dying there. To that end, it drew me in more than I expected it to.\n\nWhile it could be said the good guy won (sort of), the good guys (humans) certainly don't. I found that refreshing. No computer virus victories or weak immune systems or [insert clever idea] to win the day or leave us with hope of winning--we definitely lost. I'd have to dub it \"The More Realistic Independence Day\", and without the distraction named Will Smith.\n\nWhat finally made me go \"Huh\" and edged it to the positive is that cost only $20M or less to make--less than a third of what Battle: Los Angeles cost. And I consider it at least 70% as entertaining as B:LA, so it has a pretty good bang for the buck.\n\nSo I give it 3 stars. It's not great and I might not watch it over and over, but it did entertain me for an hour and a half and made me wonder what the outcome would be.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didnt like Coverfield and this was worse\nNot much acting and shameful special effects\nAlthough the movie offers some cute alien design this movie is overall empty",
            "review_date": "2012-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so horrible that it makes the Tom Cruise version of WAR OF THE WORLDS seem like its the greatest alien invasion masterpiece ever made. Maybe The Brothers Strause were trying to prove that they could make an even worse movie than AVP REQUIEM. I do think its hilarious that the effects supervisor for BATTLE L.A. hired the Brothers Strause to work on that film not knowing that they were making SKYLINE.",
            "review_date": "2011-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "appalling waste of good special effects , no  plot no story, truly crap",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Frankly it's rubbish. When a movies best feature is the fact that the, often magnificent, special effects were done for peanuts says it all.",
            "review_date": "2011-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had awesome special effects and a decent story. Anyone going in to see this movie with the expectation of anything other than mindless entertainment need not apply. Just sit back and enjoy.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a stupid movie. Stupid characters, stupid dialogue, stupid plot turns. But that doesn't mean its not entertaining. At times.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It does give good effects but no storyline to go with it.So in one word it's boring sci-fy movie.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although I quite liked the unconventional ending, it's a shame that it came just when things looked like they might be getting interesting. Far too much time is wasted with interactions between the characters, especially in the early going. However once the feeble attempts at acting are dispensed with, the action and special effects provide some respite, with a couple of stand out scenes. Ultimately though this film just proves that most TV actors aren't cut out for the big screen.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies of 2010, bad acting, bad script, retarded plot.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Skyline\" = 1/4 stars\nSpecial effects were great. Story was eh. Plot, their wasn't one. Their isn't an explanation to why the aliens invade our planet. They're just apparently here to \"Take our brains! Muahaahahha\" (Mad scientist voice). The aliens are impossible to kill. According to \"Skyline\" a gas explosion, multiple Barrette 50cal snipers, and several rounds of incoming fire from F-14 fighter jets cannot kill an alien, but, a man can beat one death. I don't recommend anyone to see this movie. It's like \"Independence Day\" meets \"Cloverfield\" meets \"War of the Worlds\" minus all of the things that made those films great. Don't go see this 'film'.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What happened to the old good sci-fy movies",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this film eyes and faces boiled up as people stared at the alien space craft. This is how I felt watching this film, I'm amazed I made it to the end.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just liked the end .. and I thought it was beginning of a good sifi movie ;)",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had really good special effects, and that was it.  the plot, bad.  the acting, bad.  the movie even had some foreshadowing in it and i usually like that, but it was bad too.",
            "review_date": "2011-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie took a simple plot and made it interesting.",
            "review_date": "2011-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Can't believe how ridiculous the premise of this film was. I held in there till the end but now I just wish I could have my hour & 40 mins. back! OoooFffff! Skip this one. Seriously. It's that bad. >:(",
            "review_date": "2011-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feels more like a bad video game than a movie, all of the characters absolutely suck and what was up with that ending?",
            "review_date": "2011-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie of 2010!",
            "review_date": "2011-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good beginning. Ending was horrible!",
            "review_date": "2011-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a great movie but the ending was confusing and it wasn't as exciting as i thought.",
            "review_date": "2011-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible... don't even know why I finished watching it.",
            "review_date": "2011-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a cheap version of War of the Worlds.\nNot very good at all.",
            "review_date": "2011-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't bother. Unless special effects are all that matters to you. Horrible.",
            "review_date": "2011-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aliens who attack Earth for absolutely no reason versus a bunch of Jersey Shore rejects.  While the effects are pretty fantastic for such a low budget production its storyline is an idiotic mess full of pointless flashy nonsense directed at characters we don't care about",
            "review_date": "2011-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seems like these aliens are a mixture of creatures from different movies.  They seemed to use things from The Matrix, Transformers, Independence Day, World of the Wars, etc.  An alien that looks like the Sentinal from the Matrix was funny.  jetplanes blowing up alien spaceships reminded me of Independence Day.  The Giant Aliens looked like Transformers.  This movie focused highly on more special effects than making the story connect.  The sound effects were seemed distorted or the volume was low.  Overall, even though the movie was focused alot on the 5 main characters looking out the windows of the aliens and the bright light, it was a lot of action and special effects that keep this movie exciting.  By the ending, you can tell there's going to be a sequel and they have it planned for 2012.   Hopefully, it will be even better and explain more!",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies I've ever seen.  I loved 28 Days, District 9 and other great sci-fi style movies.  The acting is awful, bickering, fake performances.The action scenes make no sense.  And are completely over-done.The enemy is invincible.The movie draws out for too long before a real plot develops.  The ending should be the beginning or half way through the movie.  Just read the reviews and don't make a mistake of seeing this film.A substitute which at least has a plot and coherent ending is \"Battle for LA\" or \"War of the Worlds\".",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great special effects - but the story is really sucks ..... too bad.",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alien Miami Vice, surprisingly not completely bad.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effects like \"SAW 3D\".",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting. But that ending.....hell why.....??? Hate it.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great visuals, but that's about it. Terrible acting, story, and execution.",
            "review_date": "2011-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film have not really received very good critics and I can understand it to some extent. Given that it was advertised as \"special effects made by the people who made Avatar\" I assume people assumed some kind of masterpiece monster invasion movie. This it is clearly not. It is a seventies style B-movie set in modern day with modern special effects. \n\nThe plot details are not very well thought out and sometimes ridiculous and so is the characters. A silly bitch that cares more about whether her boyfriend kissed another girl at last nights party than the impending doom of the planet for instance is just so...well...unnecessary. \n\nA lot of people complained about the ending as well but I thought it was rather fitting to the rest of the movie. The Brothers Strause claims that there will be at least one more film. Given the reception and the general B-movie quality I really doubt that. The special effects where quite okay though which really saved the movie.",
            "review_date": "2011-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wtf is this crap, its a BAD and i mean BAD ripoff of Battle: Los Angeles...anyways the only part worth watching is the last 10 mins.",
            "review_date": "2011-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh. So very terrible, for all the reasons stated by other reviewers.",
            "review_date": "2011-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely horrible movie.  I watched it because I usually like Donald Faison and David Zayas but this movie had no real plot or dialogue at all.",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say about Skyline other than I hated it, the visual effects were decent but then again what movies effects (besides The Last Airbender) aren't good these day.  The acting and plot were awful.  Music was just plain music in this movie, it doesn't bring anything to the table.  It was hard to enjoy this bad movie.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The previews make it look so much better than it actually is.An alright way to kill an hour and a half.",
            "review_date": "2011-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "75% of Skyline is a good alien attack movie. The ending is just terrible & the ending will destroy the whole movie, but I might buy it when it comes out, Skyline will look beautiful on Blu ray. If you like sci fi aliens or giant monster movies you'll be fine until in end.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is one of the worst sci-fi alien movies ever made and possibly the worst made right now. Skyline is about this couple who goes out to LA to visit their friends but when they get there aliens start to invade that  go around the city and if you see their blue light you get sucked into them our their ship. Now the the friends just camp out in their apartment but they also have to find a way out of the city. When I first saw the trailer of Skyline I thought this had potential of being a really good sci-fi movie but when I watched it I got 90 minutes of crap. The story was good enough to make a good alien movie but with the characters they had in this movie I just couldn't believe it. The characters in this movie were absolutely stupid and they thought they could out smart the aliens which made me laugh. The only thing that could have saved this movie was the action scenes and when it looked like something good was about to happen it just stopped within five seconds which made me pretty made. The only action scene that I thought was decent enough to entertain me was all the way in the credits. The acting in this movie was pretty terrible to since most of the actors are on TV shows and the others are actors who have no future what soever for acting. Skyline is a terrible movie that should have just been better of as a TV movie that no one would ever watch.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is a short, entertaining movie. The end could've been better!",
            "review_date": "2011-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All done already in Cloverfield and War of the Worlds. Don't waste your time.",
            "review_date": "2011-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/10 - very dissapointed :(",
            "review_date": "2011-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad that it's terrible.",
            "review_date": "2011-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's the storyline we've seen a million times before. Aliens invade earth and a few survivors have to do what they can to make it to the credits. The film is about as cliché-ridden as they come, but  I can't deny that it was an awful lot of fun. Switch off your brain and enjoy the spectacle. Also, look out for the \"the world is over but put out that cigarette\" moment - brilliant.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No head no tail no hero. Characters appeared for no reason (and of course always exit by getting killed). Lopsided story.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No head no tail no hero. Characters appeared for no reason (and of course always exit by getting killed). Lopsided story.",
            "review_date": "2011-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was ok, well it depends the price. I got this movie for six bucks. Don't buy a DVD of this movie for over ten bucks. That would be a waste of money. Also, the ending sucks. It doesn't really end the story of Skyline. But the action and the SGI is awesome.",
            "review_date": "2011-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good til damn jarrod got them stuck on the roof!",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was awful. While having cast some decent actors, the writing was awful, not one character made me feel for them and most were just terrible. The plot could have been amazing, but they just did not deliver on it. Overall it was a waste of a studio funds and $1 red box rental.",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "almost as bad as avatar \nthe effects give you a headache \nthe acting is wooden\nand the story is like a flatline",
            "review_date": "2011-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's get this out the way: it is bad. The acting is terrible, the direction unfocused, the plot very uneven and the premise worn. However, it isn't completely bad - the solid special effects, and alright action, do draw you in and, in the end, if you're just looking for a mind-numbing alien invasion film, you'll be happy. The character development is anything but subtle - take the pregnant woman, for example - and narrative doesn't really make much sense, so I wouldn't recommend it for anyone who watches films for that reason, but I do think that if you, like me, occasionally want a movie you don't have to think about, don't have to pick apart and just want to enjoy for the popcorn entertainment it is, \"Skyline\" is probably your best bet.",
            "review_date": "2011-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nonsensical mish-mash of other alien movies, filled with idiotic characters and a terrible story.",
            "review_date": "2011-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good special effects and a good ending canâ(TM)t save the film from the problem that it starts to slow and has forgettable and/or annoying characters across the board that for budget reasons spend most of the film hiding in one room away from the action....if you go in thinking sci-fi epic you will be disappointed but if you skip the first half-hour of \"character development\" and view it as horror it is an ok watch.",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At least everyone dies in the end...",
            "review_date": "2011-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Skyline is a decent film, with great CG effects. It can be resembled in many ways to some of the video games out now. The ending I felt was pretty strong with becoming an alien from his brain, I thought that was a unique ending, definitely not one I originally suspected. The actors, well stop complaining, they dont really matter. Whether they are people to root for or not, we really just care about the aliens and what they do. If a sequel happens, I hope they can possibly dip into some sort of origin.",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice going, \"Brothers Strause\".",
            "review_date": "2011-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So this time around The Brothers Strause decided to fuck up an original alien movie instead of going up against a franchise that has been a milestone in sci-fi cult. And yes dear god they succeeded. So you are locked inside of an apartment building with hottie never was Brittany Daniels and TV actors while tentacle brain stealing aliens are swarming around L.A. All the action and emotion is happening outside but we are stuck inside with these douche bags. Then we only get bits of the story really. Don't know exactly what the aliens intent is except to steal our brains and shove them up their ass. Then the \"hero\" gets infected with power but really doesn't use it because he's to busy arguing with the building attendant. Then we are left with one of the biggest open endings for a sequel that I've ever seen. It was like they just had no idea where else to go with it and figure they'll come up with the rest in a few years. This tried to be like one of those reality shaky cam movies but without anybody running around with a camera. So we don't even feel we are involved. We are audience to the audience of the alien invasion. Sure there are a few cool special effect scenes but who the fuck cares. This movie is worthless and fuck the Strause brothers for making me hate an Alien and Predator movie.",
            "review_date": "2011-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Begin interesting (very little) and then it becomes very bad, exaggerated and boring, do not exploit the place ends up being a movie to see only once and not see her again",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe if I was blackout drunk like the producers of this film it would have been okay. I am excessively stupid when drunk",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow the makers of this b-movie managed to get their hands on a pretty big special effects budget which ensured a cinema release and tricked many of us into watching it.  At best, it's an above average b-movie but a similar story was done a lot better in the far superior Monsters.",
            "review_date": "2011-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i liked it except the ending was the most ridiculous thing ive ever seen blahhh",
            "review_date": "2011-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting and script was very nice but the movie was not so good. The end was so bad I couldn't resist to say \"I regret the moment I wanted to see it\". Its a waste of time. I think the directors wanted to show off with graphics and stuff, but let me tell you that graphics are not all that people are looking for. Maybe he wanted the movie to be like 'Cloferfield' or something like 'Quarantine', but they were not successful.",
            "review_date": "2011-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utter rubbish, possibly the worst movie ever!",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy crap,I'm scared.Scared about the fact that there is a sequel being made for this crap. Yes,it was crap.At one point I was rooting for the aliens to rip out the brains of the uninteresting characters. This movie wasn't even fun.10% for the cool mother ship, that is all this movie gets from me. This movie was just the longest visual effects reel ever.",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those films that I actually thought I wouldn't like for some reason.  I actually thought it was good, and it reminded me of a more stable Cloverfield type film, though not as good.   The story is pretty simple and the special effects are pretty good.   The best part of this movie is the sci-fi aspects of it and how the movie wraps-up at the end.   If you liked Cloverfield or War of the Worlds, you probably will like this movie.",
            "review_date": "2011-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I had gone to the movies to see this, i would have felt like someone had gone into my pocketbook and stolen my money---it's THAT bad. :(",
            "review_date": "2011-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie I have ever seen... it went down hill when the leads were kissing when the mothership was taking them away to steal their brains.",
            "review_date": "2011-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am being generous with my rating of this.  Sure this film has little to no characterization in place for the leads, however, for a budget of only $10 million dollars...this movie has quite a few decent effects.  The ending is questionable...but I give it points for being so far out there that I didn't see it coming.  Hope they make another one.",
            "review_date": "2011-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "possible one of the worst movies Ive ever seen. From cast, storyline, acting, it was just terrible. Skip this one if possible.",
            "review_date": "2011-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visuals alone are not enough to redeem the poor acting and weak plot.",
            "review_date": "2011-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best thing about it was Eric Balfour.crap ending!",
            "review_date": "2011-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much cliched sci-fi",
            "review_date": "2011-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brain eating space aliens",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When a film stars Milo from 24 and Turk from Scrubs you know they've spent 2 mins on the script and all their money on the effects, and Skyline is no different. Written in an afternoon the script is laughable. At one point Turk states they need to get up to the roof for a better look. You live in a penthouse mate, you are on the roof, you idiot!\n\nSo the script is awful, the plot of aliens invading to harvest humans is just old hat now, so you'd expect the money they saved on getting proper actors would be spent on fantastically impressive CGI, well you're wrong. I've seen better effects from an Alan Sugar Amstrad. Rubber aliens and ropey cartoon effects, a film do not make. Avoid like the plague.",
            "review_date": "2011-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Identical rip off's on classic moments from Independence Day, Cloverfield, War Of The Worlds & Starship Troopers, really made me go, come on, be a little original, Almost looked like their movie reenacted poorly by Skyline. The special effects are of course amazing, but these days anybody can do that, there where two amazing moments that lasted 10 seconds, which could have really saved this movie. It's like they spent thousands of dollars on special effects they didn't even bother to write a script for it, did they think that would make many fans? With such high hopes, This movie was a big kick in the balls right next to Battle LA.",
            "review_date": "2011-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd just like to start with a good point of the movie before i point out it's bad aspects. the only thing that this movie has going for it, is it's special effects. Nothing else. the story is terrible. It's a good concept for a movie idea, but shown in a completely wrong way. The acting is even worse than the story (apart from Donald Faison). I do think this was one of the things which made this movie have bad press, that none of the actors are well known for being in movies. For the budget it was made on, yes it looks great with the alien invasion, but its docked for its awful story. i found it a complete waste of my time when i was told it was a sci-fi epic, when there was hardly any action and too much boring dialogue. i think the writers thought they would try and make a sequel out of it with the ending which i found abrupt and stupid. none of it worked. In my opinion, it should of been shown on TV and not the cinema, it might have worked better on there.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A low budget b-movie, that depicts the end of the world through alien invasion. I thought the directing was very good, along with the cinemotography and special effects. However, the acting and story are absolutely terrible. If you like end-of-the-world movies, skip this one. Trust me.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "special effects were great, script and storyline were so bad they were funny :) makes for a good B movie...",
            "review_date": "2011-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did that alien have a giant vagina?",
            "review_date": "2011-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm going to stick my neck out and say that this movie is in no way as bad as everybody made it out to be. In fact, it's actually a pretty good effort. The special effects are impressive when you consider the small budget that the movie had but its the dialogue and some of the directing that drags this movie down. It's still an interesting experience, though, with some fairly original alien designs and some brilliant action set pieces that are best viewed on the big screen. I went into this movie expecting exactly what I got, which was a fairly basic movie with some spectacular effects and some good actions scenes. And by and large that was what I was presented with. \n\nAlso worthy of note is the effort at an ending that not only does away with the usual Hollywood cheese, with humans looking very defeated, but even tried to add a new dimension to the movie and possibly set up a sequel. Whilst it's unlikely that the aforementioned sequel will ever occur due to the poor rating for this movie, it was nonetheless an impressive effort, although poorly executed.. You'll have a good time with this movie and its at least three times better than the Strause Brothers previous effort, Aliens vs Predator: Requiem. \n\nLook out for:- the aerial battles and one spinning, exploding slow motion plane scene.",
            "review_date": "2011-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie could have been so much more than it is. A storyline that is War of the Worlds meets The Matrix. A vaguely good cast and some cash to throw at effects etc.. The overall issue is that this is not a good movie. it is a string of horror movie clichÃ (C)s strung together to keep the humans moving about to provide a showcase for the effects . Which though excellent are pointless because there is no story what so ever to latch onto. My advice if you have to watch this movie make sure its free.",
            "review_date": "2011-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Featuring dialogue a five year old would be ashamed of and an abject plot makes for one of the dullest sci-fi thrillers on record.",
            "review_date": "2011-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suspense fizzled at every moment, any emotive scenes were disillusioned by weak story line.",
            "review_date": "2011-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freaking awful\nThe trailers for this movie made it seem like something worth seeing, when in reality it was a complete waste of time. Imagine Independence Day with characters you can't root for and no REAL plot progression. Do yourself a favor and avoid this movie like the plague.",
            "review_date": "2011-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I gave it a star because of the cgi, everything else in this movie was just awful",
            "review_date": "2011-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film just doesn't work. No originality. Utterly no explanation or motive to storyline. Why pretend at a bad ending, then change your mind only to leave us with something cheap and cheesy? I would vote this higher if everybody just died in the end, to say that is bad. The film is that terrible. I literally could have written it better...",
            "review_date": "2011-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nice trailer. waiting for the real movie ;)",
            "review_date": "2011-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wanted to like this, but it wasn't really anything special. They cut it too short in terms of story, but I suppose the action was alright.",
            "review_date": "2011-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mish mash of War Of The Worlds, Matrix and Cloverfield and basically an F/X wank fest.",
            "review_date": "2011-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Similar to Starship Troopers and Showgirls, the critics will come to later reflect upon this movie and realize their mistake in providing such a poor review.  So many action/sci fi/thrillers leave you unconcerned about the fate of the protagonists, but this movie has you believing that they're up against an insurmountable foe and that they, with the rest of the world will meet with suffering followed by doom.",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two words - don't bother!",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, shame about the naff ending!",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Find it hard to give it a rating at all. Just very angry that I wasted 90 mins of my life watching it. Not worth it , even if it was free!",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brain eating space octopus invasion. Well I've seen worse.",
            "review_date": "2011-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the worst film I've EVER seen; up there with District 9 it's so shite..........\nWhy is it not possible to give it negative stars???",
            "review_date": "2011-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the worst frappin film I've ever seen!...turned it off after 40 mins..can't believe it ever made the Cinema...absolute dog sh*#~!",
            "review_date": "2011-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice looking film with brilliant special effects but almost everything else was rubbish.",
            "review_date": "2011-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A contender for the worst film I've ever watched!",
            "review_date": "2011-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good effects, but that's about it.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the special effects and action are decent the rest of the film is far from that. It has a severe lack of originality (nicking ideas from Independence Day, Cloverfield and War of the Worlds) to name just a few and the dialogue is mundane and the plot is predictable.",
            "review_date": "2011-10-12",
            "source": "rt",
            "lang": "en"
        }
    ]
}