{
    "rating": 2.6,
    "release_date": "2010-04-30",
    "num_reviews": 610,
    "genres": [
        "Horror"
    ],
    "summary": "A deranged surgeon (Dieter Laser) plans to make his morbid fantasy come true by suturing three people together through their gastric systems.",
    "reviews": [
        {
            "content": "It was okay. Going into it you have a lot of expectations of body horror but it really wasn't. It was slightly disturbing but not meeting the expectations of a body horror movie. It was disappointing to see Katsuro just switch from fighting to live to killing himself just out of the blue at the end when they had a chance to escape.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "Great family-friendly film I watched with my kids (6 and 11).  They loved it and are always reenacting scenes from it.  Its kind of cute.  Definitely recommend to families with young kids as wholesome entertainment.",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "fucked my girlfriend during this and she came as soon as the centipede came on the screen then grabbed the sewing kit.",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "Contrary to what most would tell you, there is some artistic value in place here and while the initial horror here can at times be seen exaggerated, it is far bearable compared to the others in it's ‘league.'",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "8.6/10\n\nThe concept for this movie was absolutely brilliant for a horror movie. The concept is absolutely disturbing and grotesque but that's the whole point.  I thought it was a executed very well.",
            "review_date": "2023-03-16",
            "source": "rt"
        },
        {
            "content": "Este thriller es algo fuera de lo convencional y bastante entretenido. No es una película fuerte, pero puede desagradar a quienes son algo delicados. Muchas de las actuaciones son buenas, la historia tiene originalidad y su desarrollo de producción la convierten en una especie de película independiente deleitable para los curiosos o para los que quieren ver algo inusual. No perturba tanto, pero es entretenida. Mi calificación para esta película es un 8/10.",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "It is so nice i love it, so family friendly my kids loved it.",
            "review_date": "2023-03-04",
            "source": "rt"
        },
        {
            "content": "it's a must-see if you're a horror fan, people say it's gross but I enjoyed it.",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "This isn't even as crazy as my last Friday night. *do not drink jaager *do not mix liquors",
            "review_date": "2023-02-01",
            "source": "rt"
        },
        {
            "content": "Reading the reviews truly got me enthusiastic in watching such a spectacular and elaborate film. Boy were they right! The execution, the attention the detail - it all exceeded my expectations to conclude this as an all time favourite. If you're considering watching this, I highly recommend it, it's an experience everyone should enjoy.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "Dude. This movie is a masterpiece. It's literally a piece of art. People say it's gross and bad, but it's actually an amazing film and the best one in the HC series.",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "What is das! Love this movie defo watch if u want a good laugh!! #swagatron #dilf #shadeson #smut",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "if you're a fan of horror movies it's an absolute must-see. i really enjoyed it, plot twists are fun",
            "review_date": "2022-11-09",
            "source": "rt"
        },
        {
            "content": "reminded me of the time me and the boys went to cabo and got a lil drunky wunky but anyways my daughter is getting married and im so happy to here that and i definay doont waannt jill myelf",
            "review_date": "2022-10-31",
            "source": "rt"
        },
        {
            "content": "my gooood, whoever made this film deserves a damn award the writing and story telling of this movie is one of the best of the 2000s, however my only complaint is i cannot watch it with my children a pg or 12 rated version of this movie however would break the records for the greatest movie realised in the 21st century",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "I only read the Wikipedia synopsis of this movie and I still had nightmares for a week",
            "review_date": "2022-09-28",
            "source": "rt"
        },
        {
            "content": "It's artless and repulsive. I've seen many other films that are grotesque or disturbing and even plain disgusting but when the whole film is this way just for that sole purpose it becomes worthless.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Sick movie.\nNot for weak heart.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "How is it possible that there are still people who pay to see this?",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "The worst movie ever. This movie is not even horror. It is very disgusting. Pathological.",
            "review_date": "2022-02-14",
            "source": "rt"
        },
        {
            "content": "Paul Rudd was not in this movie.",
            "review_date": "2022-02-12",
            "source": "rt"
        },
        {
            "content": "what a movie great great i wachted 2 time amzing ! 🦵💪🥼",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Perhaps The Human Centipede is a picture to watch when one just wants to vomit continuously.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "One of the best films I've ever seen, top five family films for me definitely. Watched with my nan, she brought a clip of this into her sewing club for inspiration. The cinematography was out of this world, definitely saving some stills from my photo alBUM. My only critique was that my Nan said the stitches could be tighter, she recommends a chain stitch for future reference.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "Overall terrible acting. Definitely a twisted movie, nothing like I've ever seen before...",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "si te gusta el cine gore...esto es lo mas gore que encontraras hablando descentemente",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "A touching story of courage and inspiration. Oscar worthy performances all around. A modern gem.",
            "review_date": "2021-10-23",
            "source": "rt"
        },
        {
            "content": "nada a declarar.....",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "What a disgusting movie, when three people are *ahem* stitched together!",
            "review_date": "2021-09-02",
            "source": "rt"
        },
        {
            "content": "just straight up disgusting with a horrible script and some of the worst crime telling ever",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "Hilarious!  Original concept, but not at all scary.",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "As disgusting as this film is, it's so over the top that it reaches a certain level of absurdity that it makes it more of an endurance test than anything else--a prank to spring on an unassuming friend who came over to watch a horror movie.",
            "review_date": "2021-06-09",
            "source": "rt"
        },
        {
            "content": "I hate to admit I watched maybe 30 minutes. ugh. And oddly, the big problem is that the concept sounds horrifying. But not so much seeing it. Disgusting.",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "Apart from the grotesque idea of sewing people together, everything else is a lame cliché, and the acting is quite horrible.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "At least 7 plot holes, but story, visuals, and pace were good.",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "The ending was disappointing I expected much more but it's good overall",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "the movie isnt scary its just disgusting",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "This Movie had Such a Dumb plot, A Mad Scientist with a dumb fantasy kidnapps 3 People Just to turn them into a Centipede, so many gags in this movie, The acting was okay, and im never Watching the sequels NEVER, I couldnt eat for 3 Days i stayed at home from school, what was Tom Six thinking? Dumb Psycho.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "Such a sick and twisted film but it's awesome at the same time! The acting isn't ace in the human centipede but it's an enjoyable flick to leave you sitting there like \"what the fuck\". The torture crap isn't needed but apart from that, a ace movie.",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "Disgusting and repulsive, yes. That is the point, yet there is no artistry in this film. Little to no character development, real storytelling, it exists only to show us humans shitting into each other's mouths, and to gross us the fuck out. Sure, I know that other films, i.e. The Thing, are also gross-out films to an extent, but at least they have artistry; real characters to root for, real drama. This movie is just pointless. The premise is scary, but the movie [for lack of a better word] is shit.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "If The Last of Us Part 2 is the most shit in the game,\nAmong the movies, The Human Centipede is probably the most shit..",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "Genuinely I think that this movie is pretty okay! Though if you have a weak stomach you should definitely skip this one. People tend to say this movie is unsettling to say the least and that's 100% the truth but if you aren't to phased by gore a lot of things behind the scenes are done very well! The actors imo are very convincing especially the girl in the middle her facial expression are very convincing at times I even felt very sad for her. The makeup and cinematography is impressive and the house it's shot in really made my skin crawl. This movie is pretty good and I recommend if you're not super effected by gore and horror that you check it out.",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "Its repulsive premise and hard to swallow content make it truly stand out, but not in a good way. It focuses too much on disturbing that it ultimately dissapoints because of its campy acting and a lack of artistic value and integrity and social commentary, which doesn't make it worth rewatching.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "If you like being disturbed, watch this. This film is not for the faint hearted.",
            "review_date": "2020-03-10",
            "source": "rt"
        },
        {
            "content": "A one trick pony. If you know the premise then no need to actually watch it. The second star is just because I think it's rise to infamy is quite hilarious.",
            "review_date": "2020-01-23",
            "source": "rt"
        },
        {
            "content": "I can't decide whether the level of grossness here is what gives The Human Centipede its merits or if it's the reason the film could never resonate with audiences. Regardless, it's a generally unpleasant movie to sit through so I can't recommend it. (D+)",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "A great example of how an original story doesn't mean it's a good story. Probably the most boring movie I've ever seen. Never stops trying to shock you. Never succeeds.",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Hey, for what it is it's good. Best movie about people being sown together by a mad scientist. ",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "I can't see how this abomination of a movie ever got any hype. Shock and awe is not enough to sell this horrible movie. I think hostile was the movie that inspired this s*** show... no pun intended ",
            "review_date": "2019-10-01",
            "source": "rt"
        },
        {
            "content": "If a friend of yours told you that you have to see The Human Centipede, then you should re-think your choice of friends. The only reason this movie warranted a sequel in the eyes of this studio is because it was widely discussed and viewed by the public. The only reason for this is simply shock value. There is nothing in this movie to enjoy.",
            "review_date": "2019-09-30",
            "source": "rt"
        },
        {
            "content": "The most disgusting movie I have ever watched. I could not finish it! Horrible!",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "I just submitted reviews for Martyrs and Irreversible, and used this film as a comparative marker to describe \"what's nasty,and what's not\".  Thought I better come back to this film and review, as it is the marker I used. (\"What is worse than this film?\") Not much.\n Most folks would throw up watching this film. It is pretty damned disgusting.   Having just watched Martyrs and Irreversible, which both have a theme at least, this film does resonate as extremely disgusting.  If you want to watch it to \" cross it off your list\", go right ahead. Just be aware,i it will leave some nasty images in your mind.cUgh. Been there, done it.  so watch with caution. - beware! You were warned! :-)",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "If I could possibly rate lower, I would. The first and only time a movie made me sick to my stomach without even the plot to justify it. A sick mind and horrible decision making made this movie possible. Time I will never get back. ",
            "review_date": "2019-07-30",
            "source": "rt"
        },
        {
            "content": "Although this movie is insanely inhumane, it is a very well made movie with very many thrills and very deep (almost vomit worthy) chills",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "3/5.  The gross-out stuff is surprisingly restrained, but could have been more subdued to make the film better.  Dieter Laser is fantastic and there are some genuinely interesting aspects and scenes in the film, but parts of this movie don't work at all.",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is everything you wouldn't want to dream about. I first heard of this movie when I was in high school, and I was always curious to see the results but never really got to it until now. The only thing this film really offer is a disturbing and sickening concept that will attract the curious one. From the start you know you didn't watch the movie of the year, the acting is bad, the dialogues are something you would see in a school play, and they're not a lot of action. But you don't really care because you want to see what you were promised, the human centipede, right? Yes, it was grotesque, but I was expecting something way more extreme, and I am glad that they didn't go too far with it. To conclude, I think this movie is boring, but still worth a watch for its concept and audacity.",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "This film actually gave me nightmares. I guess as a horror film it totally delivered. I did wonder if this film went too far on the shock effects. At points I did find it disgusting and vile, not for the faint hearted.",
            "review_date": "2019-05-13",
            "source": "rt"
        },
        {
            "content": "A definite surprise, this movie takes an eerie thought of connecting the human race and takes it literally, bringing it to a morbid reality. The ending drops off at a horrifying situation, where sometimes dead is better compared to the monstrosities humans can afflict on each other for the name of science and inane curiosity.",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "It's kinda stupid \nVery eww",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "While this film is definitely torture porn schlock, it is at least entertaining in that regard, but ultimately falls victim to flimsy writing and trying too hard to shock the viewer to the point where they are desensitized.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "ð¤ (R)ð¤ (R)ð¤ (R)ð¤ (R)ð¤ (R)ð¤ (R)",
            "review_date": "2019-02-25",
            "source": "rt"
        },
        {
            "content": "Weird movie. Kinda messed up",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "the victim had anal contusions",
            "review_date": "2019-01-22",
            "source": "rt"
        },
        {
            "content": "who the fuck want to see a movie like this, its completely horrible. i like nasty movies but this is shit please stop making TORTURE PORN\n\nreally please stop making stuff like this i wish i had never seen it. i dont want to think about eating shit, i dont want to hear about eating shit, the idea of this movie is now in my permanent memory and i dont want it to be!\n\nThis is one of the ones i watched before i realized what torture porn was and i understand they are cranking out 100s of shitty torture porn movies although its slowing down i hope",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "Bizarre concept works better than it should.",
            "review_date": "2018-11-30",
            "source": "rt"
        },
        {
            "content": "\"The Human Centipede\" mostrou bem o horror sentido pelas duas personagens durante a história, mas ficou por aí.",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "One of the dumbest movies I've ever seen, just plain awful",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "Naaaaaasty so gross and disturbing but good acting ",
            "review_date": "2018-09-18",
            "source": "rt"
        },
        {
            "content": "Certainly, this is not the first film in the universe of the trilogy. This is part 2 and to understand the whole story, first you have to see part 3.",
            "review_date": "2018-09-11",
            "source": "rt"
        },
        {
            "content": "The Human centipide llega al tope del Gore de manera acertada, clara mente no deja de ser Gore y es bastante incomodo ver, pero para su concepto es funcional ,logra crear una historia  interesante pero sin mucho impacto asi que es positiva mas no increíble.",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "Why does this film even exist ? Very grotesque. It's like no film you've ever seen before. Nasty , disgustingly nasty.",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "If you're going to make a movie as grotesque as this, you might as well do it well. The biggest surprise here is how genuinely well-crafted Tom Six's film is - the camera prowls and glides, the horror is mostly implied, the performances are far better than your average Hollywood shocker. And it's clear that Six retains a sense of humour too. It's no surprise to learn that the Japanese think it's hilarious. If you enjoyed Hostel, you'll love this.",
            "review_date": "2018-07-29",
            "source": "rt"
        },
        {
            "content": "Sure it was made for shock value and I have no problem with that, but it can't even convey whatever its message is to the audience, it's pure trash.",
            "review_date": "2018-07-27",
            "source": "rt"
        },
        {
            "content": "was it good? no.\nwas it better than plenty of other movies that pretended they weren't terrible? yeah. \nit's awful, sure. but if you go into this with the belief that you're going to see a stellar film, you probably deserve this movie.",
            "review_date": "2018-07-21",
            "source": "rt"
        },
        {
            "content": "I made the mistake of eating cake while watching this movie",
            "review_date": "2018-07-17",
            "source": "rt"
        },
        {
            "content": "I gave in, finally watched it. Let me just say, The Human Centipede: First Sequence is just a bad movie. While the idea is fascinating, yet repulsive, that's all the movie has going for it, other than that, its a painfully conventional horror movie w/o any fun or charm to it. After the idea of the human centipede wears off after the 1st hour mark, the movie is just boring after.",
            "review_date": "2018-06-24",
            "source": "rt"
        },
        {
            "content": "If you were unaware of this movie's existence until now, you're most likely living under a rock, and believe me, that is a rock worth living under. This movie is rotten to the core and forces audiences to dig very deep to find any redeeming qualities of the movie. One that I was able to find was that the film was original and had decent acting. Aside from that, this movie is just malicious and nearly impossible to watch. For one, all of the characters and either bland and one-dimensional, or just unlikable. On top of that, nothing of substance even occurs for at least half of the movie; it just shows the scientist living out his dream of owning a demented pet. Tie all of that together with some extremely disturbing imagery, and you get a movie that has the ability to scar and put the audience to sleep simultaneously. In brief, this is a movie that should be avoided at all costs. The worst part is, this is the \"best\" of The Human Centipede trilogy.",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "Such a unique film with great acting. Like deiter being a method actor and great cinamantography",
            "review_date": "2018-06-09",
            "source": "rt"
        },
        {
            "content": "With how truly disturbing it is to watch, it may very well land its spot as the worst film of all time.",
            "review_date": "2018-06-05",
            "source": "rt"
        },
        {
            "content": "If I could give this movie a lower rating, I would. Fuck this movie, fuck this movie, fuck this movie, FUCK.THIS.MOVIE. If you watch this movie, whatever sorry son of bitch that thought this was a good idea and made it will have shat directly into YOUR mouth. Whoever made this movie needs to be force fed FECES, for all the poor hapless souls who have actually sat through this fucking atrocity. One more time: FUCK THIS MOVIE",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "I'm gonna fuckin throw up",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "Creepy, but not really a horror movie. The doctor was the best part of the movie",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "I’ll admit, it kept me on my toes through pretty much the entire movie, but the director and writer of this movie must be pretty messed up to actually make a movie this disgusting. And the ending is awful",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "This movie is not as bad as people would tell you.It's competently filmed the acting is ok and it's fun to wach.I'm tierd of sensitive \"critic's\" who judge this film harshly on the plot alone.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "Not scary, not enjoyable, what is this? The premise is so stupid where did Tom Six get this idea from? I quess we should be grateful he expressed himself by making a movie about this as opposed to him actually doing this in real life. But still, he should get himself looked at. Honestly the movie is nothing but gross, and has no suspense, mystery, terror, or payoff like a real horror movie should have. Simply gross and not worth watching.",
            "review_date": "2017-12-20",
            "source": "rt"
        },
        {
            "content": "Going in, I had assumed that this was going to be a story of a scientist who looked like a centipede and wanted to make others look like him. Lol I was so wrong. But, honestly, the vulgar and disgust of this movie isnt whats terrible about it. Despite the lack of human connection in this movie, this movie is unwatchable because of the horrendous acting, the lame dialogue and the dissatisfying ending.",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "a great idea, well relized!",
            "review_date": "2017-10-18",
            "source": "rt"
        },
        {
            "content": "THIS MOVIE IS ABSOLUTELY TRASH. I was definitely disgusted by the entire movie. This wasn't scary just plain nasty. No point to this film. I almost threw up. This movie fills me up with regret. Whoever directed and scripted this film is a real psychopath. This is a disgrace to the film industry. Netflix should reconsider what their movie selections are!!!!!!",
            "review_date": "2017-10-17",
            "source": "rt"
        },
        {
            "content": "As disgusting and grotesque as this film may look, it's actually not all that good. The execution is pretty bad, and, although Dieter Laser gives a pretty strong performance, the acting is dull, just like the overall tone of this movie. It's one that will surely shock anyone, it is disturbing, but it's heavily flawed and overall, I didn't really like this movie. It's just another torture porn film, that only hard core horror fans, who aren't looking for quality, would enjoy. And I, unfortunately, don't think the sequels won't be any better.",
            "review_date": "2017-09-27",
            "source": "rt"
        },
        {
            "content": "What the fu*k did i just watched...",
            "review_date": "2017-09-07",
            "source": "rt"
        },
        {
            "content": "if u luv watchin buttholes lik me than defnitly watch this movie. i lik the part where they shit in eachothers mouths 10/10 quality movvie and also il ike the part where they cut openn eachuthers butholse its relly goood yay.",
            "review_date": "2017-08-29",
            "source": "rt"
        },
        {
            "content": "This movie is called the most \"disgustingly disturbing movie ever made\" but I don't really agree with that, I actually quite enjoy this movie it's the best out of the three.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Sadomasochistic torture porn masquerading as a horror film.Â  I felt dirty afterwards.Â ",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "The movie is interesting in the sense that it raises fundamental questions, such as: is it acceptable to give a camera to untalented, demented people? No, it's not. This is why I've never watched this movie, and of course never will.",
            "review_date": "2017-07-18",
            "source": "rt"
        },
        {
            "content": "This was the worst movie I have ever seen. It did nothing but gross me out and make me bored. I would never recommend this movie!!!!",
            "review_date": "2017-06-06",
            "source": "rt"
        },
        {
            "content": "The Human Centipede truly pushes the boundaries of cinema; the sheer grotesqueness of both the premise and actual delivery are certainly enough to put off even the most strong-willed of viewers from ever eating (or excreting, in some cases) again. The film - in my eyes - is a total anomaly. With 99% of horror films, a solid script is required for being investment into characters; THC lacks any degree of a decent script, however the pure brutality of the events onscreen simply does nothing other than draw in sympathy: for both the actors onscreen and the helpless viewer.\nVerdict: C-",
            "review_date": "2017-05-14",
            "source": "rt"
        },
        {
            "content": "Fairly good horror movie. Not great. Deserves a much higher tomatometer score.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "I Love Blood, Guts And Gore In Movies.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "Love, love, love this movie!! Seriously Dieter Laser is so perfectly cast that he really makes the movie! Then to see him again in the third is EPIC!",
            "review_date": "2017-04-15",
            "source": "rt"
        },
        {
            "content": "I'm not usually a horror fan, but this one had just the right amount of everything.  Bravo to the doctor!",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "0 Estrellas. The Human Centipede hace el esfuerzo de ser tan aterradora y tan asquerosa pero al final no lo logra; en cambio, tenemos una película increíblemente aburrida, ridícula y terrible.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "Ridiculous premise but actually a reasonably decent horror film compared to some out there! It keeps its tense atmosphere and is pretty engaging. I didnt expect to be able to sit thru it, not because of gore but because i assumed it would be too ridiculous to be scary, however it did keep me gripped enough to see it thru.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "It's something I definitely would not want to see again. A heavy load of disturbing and chilling scenes were used and whose mission to horrify someone was fulfilled peacefully. Why? Managing a proposal whose intended effect is to give disgust is as easy as making a love story but as difficult as making a great love story. \nAfter all, the film loses credibility and simply shoots a wave of chaos inside the house of the crazy doctor whose personality is as little complex as the performance of the rest of the actors. This disorder ruined the film and the director does not give the support that a maniac so requires, that is, that the film's plot was poor and not because it was grotesque, but that it had to have a very good background.",
            "review_date": "2017-01-11",
            "source": "rt"
        },
        {
            "content": "The human centipede is a surgical. Horror that is not for the weak of stomachs it gets to be gross but sometimes there are gross scenes that just drag on  and become less gross and. More of ha  are you disgusted by this while I can't recommend this. Movie I think you should watch it once just to say hi I saw a movie about. A doctor who surgically attached three people into a human centipede",
            "review_date": "2016-12-15",
            "source": "rt"
        },
        {
            "content": "That one star Netflix rating is well-deserved.",
            "review_date": "2016-11-30",
            "source": "rt"
        },
        {
            "content": "I rewatched it today just to get it fresh in my mind so I can understand it. I have to admit its not as boring as I remembered. But its still not a good film. Its too fucked up to really make you enjoy unless you're into that sort of thing.",
            "review_date": "2016-11-19",
            "source": "rt"
        },
        {
            "content": "muy exagerada con el cuento del doctor nazi loco! cae en lo ridiculo. El afiche promete más de lo que realmente es en realidad la película. \nMala muy mala",
            "review_date": "2016-10-20",
            "source": "rt"
        },
        {
            "content": "I'm sure Tom Six was hoping to make the next \"Saw\" or \"Texas Chainsaw Massacre,\" but the slow, unengaging pace and exploitational set-up leaves little chance of that.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "This is more of an internet dare than it is a real film. Like the gallon of milk challenge or the cinnamon challenge. How long can you stand to watch this without turning it off? If nothing else, you can at least say, it will have a place in infamy for years to come.",
            "review_date": "2016-09-26",
            "source": "rt"
        },
        {
            "content": "Terrifying concept but poor delivery. After so much anticipation and talk about this film, I expected it to be more shocking or more horrifying. I didn't experience either.",
            "review_date": "2016-09-07",
            "source": "rt"
        },
        {
            "content": "Very disturbing. I had to see it tho.",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "it was kinda tamed to be a horror movie and I wished they showed the surgery happening when he stitched them together and the ending was kinda dumb, but nothing less it was an interesting and intriguing piece of filmography",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "This movie isn't for everyone. It appeals to horror on many ways: a grotesque idea, a maniac and some dumb characters, but, also making references to reality and history, and making you feel uncomfortable every second. Maybe those are the reasons to say that it is a bad movie, but it accomplishes what horror is with no fear of critics and puritans.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "It is so bad and boring. The main characters(?) were so stupid. In fact it was the most scary with this movie. HOW dumb someone can be. Very Very boring. The idea of the movie wasn't bad, i'll at least give them that- but seriously, i had a urge to write a review after seeing this movie. A review of how bad it was, but ey, if you gory torture porn this may be for you. No offense for those who liked it. Good for you.",
            "review_date": "2016-07-14",
            "source": "rt"
        },
        {
            "content": "The worst horror film of all time.",
            "review_date": "2016-06-28",
            "source": "rt"
        },
        {
            "content": "Adding a great,gross,thrilling plot and nastily grisly scenes The Human Centipede was enjoyable when my friend asked me if i wanted to see it i agreed to and i liked the film because as gross as it may be it was enjoyable but what was really good were the looks of terror of these people once they knew their faiths and waking up just to know they were the mascot of a insane doctor who won't let them go.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "Border Line disgusting and just weird.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "Quite shocking but well done even though the subject may be over-the-top.",
            "review_date": "2016-06-02",
            "source": "rt"
        },
        {
            "content": "_REWATCH REVIEW_\nThe Human Centipede is a movie that gets hated very oftenly online. Everybody thinks it's not a good movie due to the fact that it has a truly sick plot, but I cannot say that it's a bad movie just because it's sick. Just like A Serbian Film, this movie is sickly great. The story follows two best friends who, after getting a flat tire in the middle of the woods, find a house where doctor Heiter lives and does his... Experiments. Just when they thought that they were going to be saved, it all goes south when the doctor drugs them and starts preparing them for his \"human centipede\" experiment. The story does have quite a lot of cliches in it, mostly in the beginning, but as the movie goes on, you start to realise how different this movie actually is. The characters consist of a very sick, but clever, doctor Heiter who doesn't care at all for human beings and just wants to make his own creature, two best friends who aren't really developed really well and they also don't get much dialogue due to the fact that half of the movie they're in the centipede, and a Japanese man who's the head of the centipede and he's actually quite well thought of, I really loved his monologue at the end. The acting was decent, the girls I didn't find very convincing at the beginning, but as soon as the 'preparations' started, it's like they suddenly got talent for acting (maybe the fact that they didn't talk helped me in liking their acting, anyways, I liked their performance better in the second half). Dieter Laser as the horrifying doctor Heiter was the best part of the movie. He is haunting! His acting doesn't even look like acting at some points and he really seemed like a true psychopath by the end of the movie. Very believable performance. The Japanese man was also good. Again, I really liked his character and the ending monologue. The effects were great and the surgery and consquences were terrifying! It made me feel very uneasy and whenever succeeds in doing that, it has to be good. The ending of the movie is very depressing and tragic. The way things are left is eerie and just makes you think of what happened next. It was very well executed. All in all, The Human Centipede is a great horror movie that succeeds in shocking the viewer while also delivering a haunting and tragic story with a very interesting main villain and even though some of the characters make some stupid decision and the acting isn't always good, I would highly recommend checking this movie out to all horror fans.",
            "review_date": "2016-05-02",
            "source": "rt"
        },
        {
            "content": "Two very well done scenes of suspense but there are too many plot holes and inconsistencies to ignore.",
            "review_date": "2016-04-26",
            "source": "rt"
        },
        {
            "content": "This was strange......total understatement.\nThing is that horror films these days are clichÃ©, same story, same gags, same sequence, it's not even shocking anymore\nThis, however was shocking.  which earns it it's two and a half stars.  otherwise it was just disgusting",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "This movie was a waste of my time. No scary at all, and no suspense. There are also no sound effects to build up tension.  When the surgeon finally confronts the detectives, there were no good fights, they died not because of how good the villain was, but how bad the heros are. And of course, everyone had horrific acting skills! In all, all this movie does is degrading women without moving the plot forward, or provide any insight, it is disgusting. Worst movie ever!! Never watch!",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "A silly and creative bit of schlock that managed to become a cultural meme, thus working its way to people who would never appreciate it in any way. It's not to be taken seriously. In fact, it's quite hilarious at times. Worth a watch for serious horror fans, but not really for anyone else.",
            "review_date": "2016-03-22",
            "source": "rt"
        },
        {
            "content": "Filme horrivel, nojento, sem mais...",
            "review_date": "2016-02-22",
            "source": "rt"
        },
        {
            "content": "Well...this happened.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "Watching The Human Centipede I continually kept finding the same question cropping up, that question wasn't why am I watching this, it was what is the point behind all of this? The hilariously named Tom Six, crafts a horror, which he claims is influence by Pasolini and other film makers of that era and ilk, the problem is that unlike a director who can take gratuitous violence and use it in an ingenious way to portray the horror of a smart subject matter, Six takes the route of glorified sadist, with a film that has no reason, no message and makes no sense what so ever. When American friends Lindsay and Jenny brake down in the German wilderness, they happen to stumble upon an insane retired surgeon, who drugs them and decides to use the girls as part of a project to connect 3 people together, ass to mouth, in order to create a centipede. There you go folks, that's your film, that is the story, nothing else, there is no higher meaning, no subtext, no meat on this bone. The script is hilariously shallow, with horrendous dialogue, made worse by subtitles, but then again what were you expecting from a man who comes up with a story quite like this? What pains the most here is the fact that not only does the film look pretty impressive visually at times, not only is the lead character actually outstanding, not only does Six craft occasional moments of tension, the biggest criminal of all rests in the fact that The Human Centipede is neither scary nor the most revolting film that exists. The only thing that Six wants to strive for and he cant manage it, leaving causal viewers disgusted but anyone who actually witnessed say Salo: 120 Day Of Sodom, slightly bored by proceedings. Centipede doesnt offend on moral terms, more on outright stupidity and its existence based solely to shock. There are occasional flurries of something sound here, however their inclusion only pains knowing that if Six could get away from being an idiot, he might actually be able to craft an acceptable horror film. It's by no means the most vile or disturbing film you will ever watch, its by no means good and it really has little to offer, which is a shame because Dieter Laser's performance and the cinematography are what horror films were made for.",
            "review_date": "2016-01-17",
            "source": "rt"
        },
        {
            "content": "If you can get around the rather sick premise to the movie, it's actually fairly well made.",
            "review_date": "2016-01-13",
            "source": "rt"
        },
        {
            "content": "Para bien o para mal, \"The Human Centipede\" dejará su huella indeleble en la historia del cine de terror. El director holandés Tom Six confeccionó una película clase B sucia y depravada en la que un científico loco (interpretado de manera memorable por Dieter Laser) secuestra a 3 jóvenes para armar quirúrgicamente un cienpiés humano uniendo bocas con anos. Si usted no tiene el estómago, no la vea.  Pero si usted está en busca de una emoción cinematográfica fuerte, esta es su película.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "Well, that was an ordeal. I have to say, I can't remember ever feeling like that watching a film before. I was genuinely completely uncomfortable and I'm just glad they didn't show too much gore and it was more suggestive. The suspense was incredible. There wasn't much to a storyline though and my discomfort did mean for lack of enjoyment. Plus, some character's actions were just stupid and it could've been written better with the same outcome and it wouldn't have bugged me so much. I wouldn't watch it again. I'm super scared to watch the sequel as that's meant to be on another level.",
            "review_date": "2015-12-28",
            "source": "rt"
        },
        {
            "content": "The only thing that this movie proves is that if you have drams of becoming a filmmaker maybe you should actually try and pursue it, because apparently they are letting anyone make movies.  My question is, were they just all sitting around one day and though , you know what would make a great movie ? A guy who sews people together and makes them eat each others feces and walk around on their hands and knees, yeah that is what we are going to go with.  As soon as the cut of this movie was shown to the people who were \" in charge\" they should have fired everyone involved with the film and honestly reported them to the police.  There is gory and twisted and then there is this garbage.",
            "review_date": "2015-12-09",
            "source": "rt"
        },
        {
            "content": "HOrrible mOvie!!! Yuk!!",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "I'll give it one thing, it's made pretty darn well. However, I could not look past the grotesque and evil procedure that followed...",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "This movie is not scary at all, its just gross and sickening. Stay away from this atrocious picture.",
            "review_date": "2015-11-28",
            "source": "rt"
        },
        {
            "content": "Pros:\n-Bloody and gory\n-Pretty unique horror concept\n-Acceptable story\n-The German surgeon\n\nCons:\n-You don't really care about the victims\n-Not nearly as gross as it's hyped\n\nConclusion:\nThe Human Centipede is an average horror film worth at least one watch.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "Who thought this was a good idea, and then to make 2 more movies?",
            "review_date": "2015-11-04",
            "source": "rt"
        },
        {
            "content": "very disturbing film with way too many plot holes.  Does no one look for a phone?",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "Hello everyone! I am officially desensitized! I can't believe I saw what I just saw. My whole life I thought I was crazy because I could sit through movies like \"Hell Raiser\" \"Hostel\" \"A clockwork orange\" \"The Exorcist\" any Rob Zombie movies. But this movie was pretty disturbing for me.\nI also want to say that this movie is advertised as being 100% medically inaccurate. So it's pretty much a waist of time to even watch this, I'll admit it'd only be pretty scary if it could actually be done because there are sick people in this world that will mimic this like James Holmes copying the massive insanity of the Joker. What the Japanese character says at the very end sort of gives the movie a conscience but I just don't have the mentality to give the movie any praise.",
            "review_date": "2015-10-03",
            "source": "rt"
        },
        {
            "content": "This is the sharknado of horror movies. It was terrible awful but you can follow the story all the way through but there is alot of senseless mindlessness in the movie rest assured. The actors choices are pretty bad in this film and all the characters seem to make amazingly stupid errors in the movie. I have learned to simply not follow critic reviews because the critics seem to give the worst movies the best reviews and vice versa. listen to the audience and not the critics and even then depending on the following a crowd might bring it might skew the reviews. Anyway i avoided this movie for years just to finally watch it to give in into the hype. It was just weird not really anything really amazing and underlying sense that whoever made this movie likes sick porn and wanted to express that in this trash somehow, the acting is Ok its gets the job done in the film but their arent any academy award winning performances here, the cops in the film are easily the worst actors in the film, running around the house all goofy not acting anything like cops instead more like too newly hired mafia members would have been a better fit for these guys. You can watch this movie for the sheer hilarity of such a ridiculous sharknadeo in your face 2000's mindlessness era of trash movies. But Dont get me wrong in terms of trash movies I put this above alot of other trash movies sharknedo was unwatchable this movie you can watch all the way through. In terms of trash movies i give this a solid B if not A- but dont get me wrong this still is a trash movie not one that i will ever watch again but for the hiliarty of it i will watch the 2nd and 3rd sequel proving that once again trash movies can have their place in the world because of sheer boredom",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "A modern day B-movie that works quite well if it is in extreme taste but at the same time it has humour and I think that's why it works in a way, it doesn't take itself too seriously and yet keeps the horror. The ending though is not very good with the two police officers a bit of a cop out.",
            "review_date": "2015-09-28",
            "source": "rt"
        },
        {
            "content": "Horrifying, sick and unsettling.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "Creative concept experiment",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "Having watched several massively disturbing films lately, I figured I was as prepared for The Human Centipede as I could possibly be. The thing is though, as undeniably horrible as this movie is at times, the hype surrounding it far exceeds its actual content. Yes, it has a ludicrous premise. Yes, the acting is standard horror-flick fare. Yes some of the scenes are nausea-inducing. But there's 1 or 2 elements of this film that, for better or worse, actually work. I'd even go as far as to say that parts of it feel like a relatively suspenseful horror movie. Nothing fantastic, but credit where it's due, it does at least try. It tries to get us to sympathise with the characters, it tries to make the scenario seem eerily plausible, and it tries to make us see things through the eyes of the bad guy. It's far more unintentionally hilarious than it probably realises, and while the villain is downright cartoonish in his crazier moments, he's pretty intimidating when he need to be. Unfortunately things go awry around the halfway point, when the director clearly said to himself 'Right, that's enough *cough* subtlety, let's give the audience what they REALLY want!' That's when this movies reputation starts to ring true, and all the things it attempted to create and develop in the first half are diminished and even washed away altogether by a tidal wave of blood, gore and abject misery.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is not as graphic as everybody says it is, but it is surely disgusting and will make you not want to eat after for a while. I was curious about it so I gave it a shot, and I was hoping for way more. The only thing I saw was blood, snot, and boobs.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "Gross. And very disturbing.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "I hate this film.  It has nothing to do with it's concept.  The concept is half-baked, but I can imagine a decent film being based on it.  This isn't it.  No thought or care was put into writing this film.  After the basic concept occurred to Tom Six and he got a freaky actor to play his doctor, no effort appears to have been put into constructing a plot.  All of the protagonists behave unrealistically stupid pretty much just to advance the action to whatever scene Six wants to do next.  The result is that nobody could conceivably care about these victims, and the film pretty much sympathizes only with the cruelty committed by its mad doctor.  That's reprehensible, and worthy only of scorn.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Pretty creepy and the stars are on the torture porn scale.",
            "review_date": "2015-07-14",
            "source": "rt"
        },
        {
            "content": "The story itself is creepy and gross...so it did execute its purpose. But ewww not something I'd own.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "http://letterboxd.com/zbender/film/the-human-centipede-first-sequence/\n\n\n\nI finally got a look at the infamous human centipede! I remember in high school when there were mentions of this film, and how the idea of a human centipede in and of itself was absurd. Fast forward to today and I'll admit that I was a bit surprised.\n\nThe story at the beginning is generic. Two women who annoy you with their idiocy and their \"we're in a horror movie iq\" have a flat tire and basically stumble upon Siamese twin surgeon Josef Heiter's home. Heiter, who has an unhealthy ass to face obsession, has the expertise in which to complete the experiment of creating the human centipede. \n\nAt first I liked the performance that Dieter Laser gives as Heiter the mad scientist. He has the chance to make this sick dream a reality and his sickening grin is a feature that made me uncomfortable looking at the screen (disturbing faces are perhaps my biggest fear probably because I have a hard time making eye contact with others in general).\n\nAs Heiter gathers the victims and prepares them, a psychological dread looms. This obscene and unreal experiment is taking place, and as humans we're curious of things outside the norm. We may feel bad for our protagonists, but the doctor is reveling in his magnum opus of an experiment that as an audience member I couldn't help , but yearn to see what this all was going to look like (I'm a very sick person, I know).\n\nAs the centipede awakens in its fetal position like an infant would look, it also signified a new outlook of the film for me. All of the fascination of wanting to see this freak of nature had faded and now I wanted the movie to end. It carried though and I started to take issue. Laser seemed like he was over-acting now, there at a point was no distinguishable plot, and what ended up being the climatic payoff was underwhelming. This film took a bit of a nose-dive. I may sound a little demented, but the first half was Dr. Josef Heiter's film. Then in the second half: \"oh yeah I was supposed to care about these unlikeable protagonists.\" \n\nAs the film carried, it was in my head that this film was supposedly disgusting, and at times it seemed like it. It was something that was also prominent in the 2nd half which also dragged this film. \n\nOverall, this film started to let down by the time the human centipede was created. The film became horror genre generic again in the 2nd half, and it doesn't stand out amongst horror films I've seen in the past. However, it's decent to the point that I may or may not watch its sequels in the future. We'll see.",
            "review_date": "2015-07-05",
            "source": "rt"
        },
        {
            "content": "Skipped through it to see how it could be so successful to make 3 of this?!! I still don't know, this movie pissed me off!",
            "review_date": "2015-06-24",
            "source": "rt"
        },
        {
            "content": "stupidest movie ever",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "I must admit that I had heard and read quite a bit about this film before actually committing myself to watching it.  The premise is indeed shocking and truly horrifying, but as said by many other's it ends up being little more than torture porn.  There are some truly infuriating instances in this film where characters make horrible, albeit completely predictable, decisions. It's also rife with horror tropes: For instance, the two girls blow a tire while driving through the middle of nowhere in a foreign country.  It's a rental, mind you, so it's reasonable to assume there is a spare tire.  Both girls admit to not knowing how to change a tire, thus all but saying \"there's a spare\".  So instead of actively *trying* to change the tire they decide to try to walk to find help.  This is after they discover that OF COURSE there is no cell service.  To be fair one of the girls explains \"there's always a signal!\" So, no one can change a tire, their cell phones are not connecting and they are in the middle of nowhere in a strange land where they don't even speak the language. Now bear in mind they're in the woods, but currently on a road.  What would you do in this circumstance?  That's right, wander off into the woods!  They do just that, become hopelessly lost and then stumble upon the mad doctor's house.  Thus begins the horror.\n\nWhat saves this movie from B-rate absurdity however is the brilliant performance of Dieter Laser who plays the deranged doctor who is the villain of the film.  He pulls off creepy insanity superbly. \n\nUltimately a rather cliched film, riddled with predictable behavior and poor decisions upon the part of the characters, Human Centipede is saved from banality by one of the most sincerely disturbing villains I've ever seen.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "Thought it would be worse, graphically, than it was. In the end, it's just simply not a good movie.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Nothing positive in this \"The Human Centipede\", bad story, bad acting. It's a waste of time watch this film. This shouldn't be classified as Horror, there's nothing of horror in it. It's a very disgusting film.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Tamed compared to other gross-out horror films. It doesn't seem like it wants to accomplish anything besides appealing to gore-hounds. Tom Six's strategy is admirable, but aims low in dark places to entertain anyone.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Honestly, it's the closest thing we've gotten to a horror classic lately.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "in terms of getting me horrified this movie blew up the score, but overall movie as a whole...not impressed",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "Absolutely disgusting",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "Horrendous idea with outright bleak and uncompromisingly negative plot. Takes the worst bits of Saw and Hostel genre, adding very little.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "Wow....this was one crazy movie, but something that could really happen, that's why I won't EVER travel out of the U.S.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "A horribly sickening, gruesome and disgusting concept of a film that leaves the viewer to question their own sanity after watching it. This movie should have never been made in the first place.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "Well, if the goal of this movie was to set out to make watchers feel disgusted, creeped out and ill to their stomach(s) then you accomplished the task at hand.",
            "review_date": "2015-05-07",
            "source": "rt"
        },
        {
            "content": "I did my best to find purpose... or any kind of metaphor... but this is just utterly vile shit.",
            "review_date": "2015-05-06",
            "source": "rt"
        },
        {
            "content": "This movie...is gross. That's all I can say about it",
            "review_date": "2015-05-04",
            "source": "rt"
        },
        {
            "content": "Human Centipede is a movie that tries to be different and creative, but just ends up falling back on the same old cliches, and though Mr Laser is menacing as the crazy surgeon, the rest of the cast can't rise above mediocre resulting in a movie that fails to be believable and in turn eliminates any tension. The filmmakers here seem to be relying solely on the creativeness of their premise and expect that  that will carry the whole film. Well I'm sorry, that is a fatal mistake.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "I just don't understand the \"entertainment\" of The Human Centipede. What's entertaining about watching three innocent people get tortured and cry and scream and be sewed ass to mouth for an hour and a half? I love horror movies, but this one is too ugly.",
            "review_date": "2015-04-08",
            "source": "rt"
        },
        {
            "content": "I only rate it as high as I do because obviously this is meant to be a well-known surgeon, and he waits the appropriate amount of time for healing before he wakes them.. F that. F this. Nope, worst idea watching it.",
            "review_date": "2015-03-08",
            "source": "rt"
        },
        {
            "content": "almost completely pointless but I'll give credit where credit is due... an original idea\n\ncame back to add 1/2 a star for not being the 2nd movie",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "Gross and difficult to watch. The human centipede is almost hindered by it's intentionally crazy execution and absurdity.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "One of the mist twisted movies I've seen. Hard to watch at times but definately different!",
            "review_date": "2015-02-10",
            "source": "rt"
        },
        {
            "content": "Wants to be disturbing but ends up being unintentionally comical.",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "This is certainly a \"Take it or Leave it\" kind of movie. If you're into this sort of thing or can stomach it's grotesque premise, then knock yourself out. As for me, I have a strong stomach when it comes to horror movies like this. There really isn't too much shown to gross you out either. It's what's implied that will scar you! Watch the \"Feeding\" scene and you'll know what I'm getting at. This movie just isn't very good with or without all of the disturbing stuff. Enjoy at your own risk!",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Really? Like really?",
            "review_date": "2015-01-21",
            "source": "rt"
        },
        {
            "content": "Watched it mostly on fast-forward and that was more than enough for me.",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "this and snowpiercer may be the two dumbest movies ever created",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "I loved this when I first saw xxx",
            "review_date": "2015-01-01",
            "source": "rt"
        },
        {
            "content": "Not sure why this is considered a scary movie. Kind of a gross idea, sure. But other than that, meh.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Like doggy-style , but not good before breakfast this way ...but finally something you can call shocking SOMDVD",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "I actually found this movie smart, intriguing, and charming in sick and weird way.",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "The Human Centipede (First Sequence) Movie Review!\n\nWell this was certainly an interesting movie. The premise is that this doctor fellow performs a surgery that creates...well, a human centipede. Hi-jinks ensue.\n\nWhat I dislike about this movie is that this plot goes...rather nowhere. As in, it's pointless. After the surgery, it becomes rather pointless. There's not enough story to say most of anything; other than the fact that the doc is demented.\n\nIt does look rather realistic, so visuals are nice. The gross factor is rather high, and it can be a bit disturbing. But the many outweigh the few. And this was more boring and pointless than it was gross and frightening.\n\nFor that, this deserves a 5 out of 10 (2.5 stars). Quite average. Let us see what awaits us in the sequel.",
            "review_date": "2014-12-08",
            "source": "rt"
        },
        {
            "content": "Talking about \"The Human Centipede\" is much more fun than actually watching it, and it's not very grotesque as you would first imagine. Dieter Laser's performance as the mad doctor is terrific, unlike the other characters which made the film more comedy than horror especially the final suicide scene done by Katsuro.",
            "review_date": "2014-11-29",
            "source": "rt"
        },
        {
            "content": "When the doors of gore-porn horror were opened with the Saw and Hostel movies, it was only a matter of time before something truly sick hit the screens, and here it is...\nTwo thick-as-shit female American tourists get lost in the woods while looking for a nightclub (go figure) and instead of attempting to change the blown out tyre on their car, they delve deeper into the woods and end up knocking on the door of a German doctor who drugs them. They later wake up as the crazy surgeon unveils his plans to make a human centipede out of them and another kidnapped Japanese tourist because, well, why the fuck not?\nThe film just gets more and more stupid as it crawls (literally) to a wholly unsatisfying ending. It's not scary, and lacks the necessary atmosphere to achieve anything truly frightening, it's simply unpleasant. Weirdos might like it though.",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "This film is very original in a disgusting, off putting way. When was the last time you saw a horror film that was unlike ANY horror film you had seen before? I can't remember. Tom Six clearly has a twisted mind. The acting from Dieter Laser is insane, a truly believable villain. The acting from the two girls however is terrible, as is their scripting. Now I know what you're thinking, how would you have find decent actors for a film entitled \"The Human Centipede\"? Well if they found A-listers for Basic Instinct and A Serbian Film then with some hunting around they can find good actors for this. Next, this film has an original concept that it does nothing with. Once the human centipede is formed the film literally goes nowhere and the pace becomes unbearably slow. A movie entitled \"The Human Centipede\" should never be boring, but at times, once the shock of the idea has worn off, it is. What's most frustrating is with better production values, a better script, and decent acting this film could be a much needed welcome addition to the horror genre but unfortunately it is not.",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "What kind of childhood did Tom Six have to write and direct this sicko???",
            "review_date": "2014-11-08",
            "source": "rt"
        },
        {
            "content": "Complete, yet surprisingly self-assured, garbage. If you're not turned off by the disgustingly bankrupt premise, you'll definitely wonder how the movie could be so boring despite it. Easily one of the worst movies I've ever seen, and definitely the best way you can kiss your free time good-bye. Heck, I wouldn't have finished it if I didn't have a bro to help!",
            "review_date": "2014-10-30",
            "source": "rt"
        },
        {
            "content": "The last thing you'd expect from a movie like this is that it's boring. But that's exactly what it is. And I don't mean oscar bait boring by the way, I mean that you're 50 minutes into the movie and this is what happened so far.\nMeet dumb girls\nDumb girls are driving\nCar breaks down\nGirls decide to get out of car and walk\nGirls come to house\nCreepy German guy\nLet's call him Cgg for short\nCgg gets dumb girls drink\nDumb girls pass out\nWake up\nCgg kills the guy next to them because he \"didn't fit\"\nCgg explains that he's gonna turn them into a human centipede.\nDumb girl 1 escapes\nLocks herself in room because reasons\nCgg tries to open door\nH",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Disturbing and grotesque, this movie, while original and unique in premise, fails to deliver any feeling other than revulsion and shock.",
            "review_date": "2014-10-17",
            "source": "rt"
        },
        {
            "content": "Certainly not what I would call a good film.  The acting is pretty horrendous, and the story is just plain silly, but somehow it genuinely held my attention for the duration of the viewing.  This movie has something going for it, and I'm not exactly sure what it is.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "This movie's evil, I tells ya! EVIL!!!!",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "This movie is surprisingly very good and effective. The acting is very good, especially by Dieter Laser, who's sensational, creepy performance has to be seen to be believed and makes you want to keep watching... The concept is simple, disgusting and very interesting, and the story is handled very well by Tom Six onto the screen and his directing is very good. Additionally, all the way through the movie there was a creepy atmosphere and a strong sense of dread; and all the way throughout the movie I felt intrigued and never got bored. In conclusion, I think this is an effective, original horror movie, which is definitely worth a watch. 7/10.\n\nP.S. Please avoid The Human Centipede 2!!! It is the worst, most boring movie I have seen (really, just avoid it).",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "This film, with its choppy acting and uninspired direction, fails to do its job which is to gross me out, because I don't care about any of the characters that become the victims of this horrific experiment. When I don't care about the people, I in-turn don't feel scared.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "um.....what? Ok, so I gotta say, this horror movie suffers from the worst of cliches: ridiculously stupid people. Pro tip: don't drink water from as stranger's house, especially when he gives you the creeps. Laser plays a pretty good villain, but the acting otherwise was terrible at best. I feel like it's impossible to like this movie, since it doesn't feel like there was anything I was supposed to \"get\". Is there supposed to be hidden commentary or did you expect me to sit through a 97 minute torture porn expecting something better? Also Heiter sounds so dangerously close to Hitler that I'm pretty sure this movie would have been more effective as a WWII historical film about the horrors of experimental doctors during the Holocaust, which is where Six apparently got his influence. I'm very unsettled by that to be honest, as with the rest of the movie.",
            "review_date": "2014-10-04",
            "source": "rt"
        },
        {
            "content": "Note quite as utterly shocking and dreadful as some make it out to be, The Human Centipede (First Sequence) mostly relies on its grim and inventive concepts and its delightfully over-the-top performance from Dieter Laser to help it out of typical cliched horror territory, but with lackluster scriptwriting and poor pacing, it only occasionally offers up anything truly ambitious.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "If the outlandish concept doesn't scare you off, \"The Human Centipede\" just may hold your attention long enough to find some enjoyable moments.  It definitely seems like something that belongs on SyFy Channel, and doesn't deliver the level of terror that its premise is capable of.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "It left me indifferent. I've seen worse and I've seen better. The acting was mediocre except for the actor playing the role of the doctor. I wouldn't recommend this to anybody. The concept is gross and its supposed to be. At least, they didn't try to cover the absence of a plot disgusting us during the whole movie.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "Cheap and boring, there's nothing in the entire movie to justify this amount of sadism and gore.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "The  Human Centipede (First Sequence) is so grotesque and exploitive that you feel like you have to take a shower after watching it. Although this is the point of the movie, it doesn't try to connect its disturbing ideas to the real world in any way, which would've made the movie work. Instead, it relies on shock value to make it good. It tries to scream \"cult classic\", but it will never get there.",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "Fucking gross movie. Literally the worst waste of 1:30 I've ever spent. It is trying super hard to be disturbing and while it occasionally succeeds, it's not in the way the director wanted and tends to come off as boring. Not only that but the ending is a total copout. The movie was a complete and utter waste of time and I have no clue how anyone can find it entertaining.",
            "review_date": "2014-07-20",
            "source": "rt"
        },
        {
            "content": "I find it hard to rate this film badly base on the subject matter alone. Simply because it was one of the most original ideas for a horror film I have ever heard of. On top of that, the film took multiple stabs at its own genre! The film began as any other generic horror film would: with two seemingly dense girls becoming lost in the woods in an area they are not familiar with.From there on, the film becomes a very special one. One that isn't afraid to cross boundaries and sever previously established genre ties. The cinematography was also quite impressive, especially when it came to color usage an saturation. Overall, the film was not as much of a gross out than a psychological thriller.",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "One sickening piece of garbage.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "I think this is known as genre defiling",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "YUCK! YUCK! YUCK! YUCK! YUCK!",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "I just finished watching part one of The Human Centipede and the one thing I can say is... Holy Mother of God, what kind of person enjoys this? It's disgusting and I have no intention to watch the sequels.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "Never seen, and never want to.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "How someone could make such a disturbing movie is beyond me.  I hated everything about this movie",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "The Human Centipede (First Sequence) is grotesque, overly-earnest and stocked with more stupidity within their characters than imaginable. Since its release, the film has developed a cult-status, and I'm sure there will be many that feel I missed the point here. Dyed-in-the-wool torture horror fanatics that have been longing for a Dr. Frankenstein meets anal fetish will eat this up (See what I did there?), and hail it as inventive and subversive, while most others will simply find it hard to swallow. Oh my - see there? I made two puns. Excuse me, while I pat myself on the back.\n\nFull review at http://silverscreenfanatic.com/2014/06/02/what-the-hell-were-they-thinking-22/",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "Finally had the courage to watch it: nasty",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Wow this movie was poorly done. The plot itself was bland. The surgeon however did a great job as a psycho. Overall this movie was  amazingly bad if that is a word.\nF",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "It tries to be something more than the average torture porn, which it somewhat does well. There is some suspense and beautiful cinematography, yet the surreal atmosphere and sick premise may turn people off.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "I watched this movie with an open mind. It did have a plot so props for that. The acting wasn't unwatchable, but it wasn't Oscar worthy. It did have shock value, I have to admit I'm glad it wasn't outrageously disgusting. overall it's OK, I wouldn't add it to my DVD library.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "Disturbing but awesome, the idea is just incredible and well executed.",
            "review_date": "2014-05-09",
            "source": "rt"
        },
        {
            "content": "This movie is shit on so many levels.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Stupid, disgusting, and pointless. I forbid anybody who wants to see it. Now if you have bad taste in movies, and you enjoy watching people being tortured go for it.",
            "review_date": "2014-04-17",
            "source": "rt"
        },
        {
            "content": "If you are debating whether or not to watch The Human Centipede, stop, don't do it! The Human Centipede has so many flaws and disturbances, that is surprises me that it even became a movie. It is not just a sickening movie that makes you want to wash your memory clean, but it is also very boring. For instance, the less than star studded cast doesn't seem thrilled to be apart of such a horrible movie. They seem to walk through the basics with their acting which results in a less than mediocre movie. You can tell a movie isn't going to be successful when your entire plot is about a mad scientist kidnapping people and torturing them by surgically joining them mouth to anus. When the people finally make an attempt to escape and fail miserably resulting in their deaths, the ending leaves you frustrated, nauseous, and questioning why you just wasted an hour and a half of your life on such a horrible movie.  I have read multiple reviews and have yet to see a review where the person enjoyed the movie. What kind of person thinks of such a horrific story? This was absolutely the worst and most disturbing movie that I have ever seen and I want to spread the word so that nobody else has their brain stained with the disgusting plot of this movie.",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "The first half is dreadful, but the second half is original and gross and sickening, and yet it feels right.",
            "review_date": "2014-04-07",
            "source": "rt"
        },
        {
            "content": "I haven't watched a horror movie in a while, and for good reason; they suck. Although I got a few awkward laughs out of this from the horrible dialogue and gore, it's not worth watching.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "I saw this for free and still want my money back, lmao.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Extremely Boring Movie & Don't See How It's So Hyped IMO Not Even As Gross As I Heard It Was!!!!",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "I really don't usually watch films like The Human Centipede: First Sequence because I prefer my horror films to rely more on suspense than shocking visuals as a source of thrills. Also, the story in The Human Centipede: First Sequence sounds more like a joke than a legitimate film. But one day I decided to watch it for some reason. \n\nThe Human Centipede: First Sequence made for very uncomfortable viewing. As I've avoided watching any of the films in the Saw series because I am not an avid fan of torture porn which was what The Human Centipede: First Sequence was said to be. But in certain areas, I was somewhat impressed by The Human Centipede: First Sequence.\nSurprisingly, The Human Centipede: First Sequence succeeds at building tension without excessive blood and gore. Before the film reaches its midpoint and begins using all the grotesque visuals it has been recognised for, it builds up a lot of intensity by using a tense and low musical score lightly while it allows viewers to adjust to its atmosphere of empty fear which is controlled all by Dieter Laser and how Tom Six directs the film. Honestly, I'll admit it is convincing because the cinematography is very slow moving and intense, allowing the film to have thrills gradually seep into it instead of throwing them in the viewers face like with many other horror films of modern day. So at least in that area, Tom Six makes some achievement.\nHowever, once The Human Centipede: First Sequence turns into a film which rests all of its horror on visual elements, I lost the feeling of all the tension that had been built up. I had been chilled waiting for something to happen, but once it did it had become just a series of loosely jointed story dynamics relating to a sick creation in the film title and not to the insane nature of the character that created it, Dr. Josef Heiter. I know that the film is supposed to be more focused on the titular Human Centipede, but the most horror success in the film comes from that one character. Once he creates his pet, the story goes back and forth between them as well as with the investigation attempting to find the missing tourists Lindsay and Jenny, and the focus proves to constantly be shifting. The pace of the film speeds up and the story takes place in quick scenes which move somewhat speedily between each other in contrast to the earlier slow pace of the film, and so the second half is where the film lost all its potential and quality. I didn't feel thrilled anymore, I felt sick. And films that make me sick without having a good reason why annoy me, so I found myself somewhat annoyed at The Human Centipede: First Sequence. The film shows off potential in the first half but turns directionless, sickening and repetitive in its second act and loses sight of true horror cinema. And this boils down to Tom Six who wrote and directed the feature.\nTom Six succeeds at creating a sickening film by making it a realistic feature which is shocking from a visual perspective, but all the chills and thrills I felt in the first half of the film descended into disgust and a lack of entertainment. The skilful way he built the tension of the first half is gone in the second and is replaced by the torture porn qualities that many critics condemned it for. Tom Six proves that he can build an atmosphere and shock viewers, but he also proves that he cannot carry a film to the end on his own knowledge and instead turns his feature into a boring and unappealing joke. While it is convincing and clear that Tom Six has done quite a bit on a low budget, whatever psychological thrills that there could have been are replaced by a lot of screaming and scattered disgusting story dynamics which go in circles with the rare surprise until the end. Tom Six would have to actually be a pretty sadistic man to write and direct such a disgusting film, so I think there is some of him in the central antagonist Dr. Josef Heiter which is Tom Six's own creation and the real source of horror. If he had come to his senses and made the film a mix of character study of Dr. Josef Heiter and his creation then it would be smarter. But no, we are left with a film about people sewn together and ingesting each other's sh*t. Brilliant.\nAt least some benefit comes from the performance of Dieter Laser.\nDieter Laser's lead performance is a very freaky one. He is like a German Hannibal Lector who roams freely about his own compound and looks like a German Armand Assante, and frankly he himself is more scary than The Human Centipede: First Sequence itself. The film is chilling for its grotesque visual qualities, but the real fear is created by the nature of Dieter Laser's character. His performance is an intimidating one which is fearless, but I can't say the same for myself watching him. I was very fearful of him because he is the true heart of all the horror in The Human Centipede: First Sequence and his performance was actually excellent. He is the true haunting image I will take away from the film.\nAnd even though the performances of Ashlynn Yennie, Ashley C. Williams, and Akihiro Kitamura don't require much from them except a lot of screams, they still all contribute their own part to the success of The Human Centipede: First Sequence, even if it doesn't succeed in the end.\n\nBut despite a thoroughly dedicated performance from Dieter Laser which is haunting and unforgettable, Tom Six squanders the potential of The Human Centipede: First Sequence and his ability to create a strong horror atmosphere on a lot of repetitive torture porn and an indifferent ability to focus on the best aspects of the horror he has created.",
            "review_date": "2014-03-18",
            "source": "rt"
        },
        {
            "content": "Great film if you have a strong stomach.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "mucho morbo poca pelicula",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Received instant cult status! When it first reared its ugly head I couldn't find a program that wasn't referencing it or doing a parody of it! It became a huge part of American culture!\n\nWhen all has been said or done like it or not it is a legend in cinema history! The film's concept was not only original it was pure genius! Reminded me of Cronenberg's earlier work!",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "First of all, there should be a new genre for this type of movie and it should be called THE FU**ED UP GENRE.  This film is sick, nasty, disturbing and it makes you very uncomfortable watching some scenes (and I'm no wimp!).  The Dr. Character is very well played and you can truly see how evil, twisted, and sick he truly is!  The other actors do a decent job and you root for them during the second half of the movie.  The pacing is good and it's not boring at all.  Some people may not get through it though since it's disturbing to watch.  If I'm feeling brave enough one day I may watch part 2.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "I give it a rating for originality, but only to a point where it starts to get stuck in horror cliche. You know, college girls car gets a flat tire in the middle of the woods, they get lost, then they find a house with a creepy German guy. The ENTER the house with the creepy German guy, etc., etc. The film was far less gory then what I thought by everyone's reaction to it. You certainly don't need to see anything else because you really do get the point, regardless.",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "Very hard to rate. Original though but not particularly good and not particularly bad.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "pretty good. sick yes but worth a go if you've got the time",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "You'll be grossed out and disgusted, but it is what it is.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "What should be shocking is sometimes funny in this movie.  It's a good bad movie.  Sick but a good watch.",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "What should be shocking is sometimes funny in this movie.  It's a good bad movie.  Sick but a good watch.",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "Not as brutal as it looks...",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "Terrible. Disgusting. Ridiculous. Those are the first three words that comes to mind. This whole damn thing is just a sick-minded mess.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Doesn't push it as far as you might think but that's not necessarily a bad thing",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Definately not for the faint of heart. If you like horror and gore- this movie is for you.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "With a title like \"Human Centipede,\" you already know what you're getting into. You're in for a yucky good time, and a surprisingly intense second half keeps the momentum up if you can put up with the cliches and bad acting from the two female protagonists in the first half.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "However sick, obnoxious & disgusting it is, original & creative simultaneously .",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "There are sick movies and there are loathsome movies. And then there's The Human Centipede.\nSick fuckers will be delighted.",
            "review_date": "2013-12-23",
            "source": "rt"
        },
        {
            "content": "The Verdict: 1 Star/ 5 Stars \nNo thrills, no character, no message. Absolutely meaningless, it has nothing new to offer other than a very under-cooked disturbing idea.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "The only parts of the movie that were actually \"good\" were the shock value and the doctor's portrayal/character. Other than that it's just a great time for testing your stomach and checking your friend's reactions every 30 seconds.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "One of those \"must see at least once in a lifetime movies\" I bought this movie so I could see the reactions on my friends faces when I told them this was a really good horror movie. But its really only truly enjoyable if you watch Tosh.0's half hour spoiler alert video for this movie. Makes it 10 times as funny.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "If you want to watch a weird film this has to be the one. Two New York woman are trying to find a club in Germany and when they care develops a flat tyre they stumble across a house and thinking the man will help. Little do they know he is a crazy doctor with more than crazy ideas",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "The Human Centipede tried to be ... well that's the main problem, I don't know if it tried to be an artistic film, or a summer high-grossing film. Whatever, there've been many movies that are very nasty, equaly or more than this movie, but, those movies are enjoyable, they are scary, they have a point, but The Human Centipede, does not have a point, it is simply about a mad doctor making nasty experiments with humans, we had had seen things like that, the only new thing is the girl eating the poop of that kamikaze guy, nevertheless the performances, especially Laser's, are outstanding, sometimes annoying, but that is th eonly good thing that the movie had, my suggestion is to avoid watching this movie, even if you have curiosity, please, PLEASE DON'T WATCH IT!",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "1 star! \n\n\nWatched this with friends and thought it was the sickest film I've ever seen and not in a good way!",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "a failure movie, I found it boring and I can't understand all the hype around his piece of crap... I gave it a half star because there is worse!",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "I liked it, I found it very interesting and creepy.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "Definitely the worst film I've ever seen. It's just unnecessarily disturbing and completely stupid. The creators of this film just makes me lose hope in humanity",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "It won't let me give it zero stars",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "Much to my surprise, the Human Centipede is never as disgusting as it can be, and is surprisingly conventional. Though the film will never win any awards, it deserves some credit for rising above the expectations set.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Yes, I've watched it. It honestly isn't terrible, just painfully disgusting. It will keep you interested if you like anything extremely gross.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "I'm gonna keep the review short because this movie sucked hard! There's no plot at all and no resolution!!! What the heck! The nudity and just everything was just pure garbage! Only half a star because of intensity. F---",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "A real novelty film, its kinda gross in places but that is about it. One of the problems is the generally weak cast who don't really convince, the other being the actual depiction of the acts in question didn't seem that horrific. It was creepier having the steps being described rather than actually seeing them. Good try but ultimately it didn't work for me",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "masterpiece. a disturbing masterpeice.",
            "review_date": "2013-11-11",
            "source": "rt"
        },
        {
            "content": "What's The Big Fuss. I Was Told Not To Watch It As It Was Disturbing. The Thought Of It Had Put Me Off It. When I Finally Got Round To Viewing Though Its Nothing. For Me It Was The Thought Of What Was Happening, Reminding Me Of The Original Texas Chain Saw Massacre. & That's What This Is A Film In The Style Of Chain Saw, But This s However Falls Flat On Its Face.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "Worst shit even, don't ever watch this",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "It wasn't as bad as people said it was. The premise was interesting but the execution was poor and got very boring near the end. The ending fit the movie.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "worse movie I've ever seen",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "This is one messed up movie. Before you watch it, remember that it cannot be unseen.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "fuck this..what kind of fucked up..I..I don't even..god damnit",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "The only thing worth saying is Dieter Laser is disturbingly fantastic in his role. But that's never a good enough reason to see one of humans more disgusting creations. Reading the back of the DVD cover is enough as then the plot is explained and appetites won't be lost.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "Tom Six either has a very creative mind, or a very disturbed one....",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "its awrite. nowhere near as gorey or frightening people make it out to be. manup for fucksake. makes a change though for everybugger to die or do they? i aint seen second one yet.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "A really moving film. The love felt between a man and his human centipede is inseparable. Best movie 2009!",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Unique, but it isn't what were interested in.",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "The Human Centipede comes to you with characters that don't develop, but their performances convince you of their horror and humiliation. Disturbingly good I would say.",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "If you're into twisted Cult movies, like me, then you might find this entertaining. Not sure if I really want to see Pt. 2, though.",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "SPOILER ALERT The main issue I have with this film is that it is repetitive and boring, and worst of all implausible in that the victims and detectives miss countless chances to escape from, apprehend or kill the surgeon. And that is unforgivable in a horror film.",
            "review_date": "2013-09-24",
            "source": "rt"
        },
        {
            "content": "Disturbing and not entertaining...",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "Having watched this crap, i feel like Im the chick at the back of the 'centipede' being forced to eat double digested poo. I guess the director would have been the Japanese dude and the cast would be the middle chick.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Although tense at times and shockingly disgusting, The Human Centipede may be well directed and not terribly acted, but in the end it's just a bit too dull. Although it does linger in your mind and is good to be talking about",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "While not as gruesome as I thought it would be, proves that a plot based off one gross-out idea can get tedious. Earns it's stars for superb acting. Also, I won't be going to Germany any time soon.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "warning: cannot unsee. please do yourself a favor and avoid this mockery of a film",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "The Human Cenitpede was the most disturbing movies I have ever seen. I decided to watch a scary movie with my mother and my little sister. we decided to watch something we've never seen or even heard of and well somehow The Human Centipede was the lucky number one that I happen to choice. This movie is full of disturbing creepy acts such as an older doctor taking young men and women into his home to sew them up into one human centipede. Creepy huh? \n\tApparently I'm not the only one who was totally mortified by this disturbing film. Cridicts and reviews from www.CinemaBlend.com and Rottentotmatoes would support my idea on this film. CinemaBlend.com states that The Human Cenitpede was \"to be one of the most disguisting, cringe worthy pieces of film..\" that year. www.rottentomatoes.com audience of 15,262 ratings only 26% of them liked it. Also people says it was \"..more interesting to talk about than to watch or experience..\" This film is really creepy and I would not recommend this film to anyone, unless I really wanted to creep them out or scare them.",
            "review_date": "2013-09-11",
            "source": "rt"
        },
        {
            "content": "It hard to rate this. Probably the most disturbing movie I have ever seen. Who finances something like this? It was interesting how the story concluded, I don't think their should be a sequel, one is enough!",
            "review_date": "2013-09-11",
            "source": "rt"
        },
        {
            "content": "It Legend of Horror Film !!!",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "A silly and creative bit of schlock that managed to become a cultural meme, thus working its way to people who would never appreciate it in any way. It's not to be taken seriously. In fact, it's quite hilarious at times. Worth a watch for serious horror fans, but not really for anyone else.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "I was disgusted by this movie, but if your a horror movie fan you will appreciate this movie.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "didn't really work as a horror movie because there was no fight in it - you never really thought anyone was going to escape but horrors and thrillers are only scary if you don't know what's going to happen. It wasn't very exciting, it wasn't even gory and the villain was so 1 dimensional even he wasn't interesting or compelling. the whole thing was just boring really and I only finished it because it was famous",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "I am actually a huge fan of the second film. It's a well done creative film that is overlooked by almost everyone... This film however, gets all the attention for some reason. It's a generic shock flick with a stupid concept that is just there to gross out audiences. 'The Human Centipede' really serves no purpose other than to make audiences wince at the screen, and it even fails at that. I'll give it some credit where credit is due. The acting is okay and the cinematography is good. That is all this movie has going for it. Pass on this one unless you are drunk.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "More disturbing in concept than anything the movie delivers.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Beyond reviewing in any conventional way. The premise is so disgusting that I fast forwarded some surgical scenes but in most other ways its extremely conventional. Tom Six actualy delivers a crisp style and the film bats above its weight in terms of editing and horror set ups. The acting is pretty bad but Dieter Laser as Dr. Heiter is amazing...he might just be crazy in real life....",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "Idiotic. Extremely bad acting. Dull. Nothing is shown in graphic detail, but it's kinda gross tho... Anyway, it's definitely not a film for every audience, probably just for genre freaks. I didn't really like it...",
            "review_date": "2013-08-25",
            "source": "rt"
        },
        {
            "content": "Okay, let's get a few things out of the way here. I like this movie... for what it's worth. For example, I do not like the acting from everyone other than Laser. I also do not like the moments in this film when its primary goal is to shock the audience. These scenes are often ridiculous and overbearing. However, I cannot deny the fact that The Human Centipede (First Sequence) was shot beautifully and often had me entertained, even if some moments were off-putting. Tom Six seemingly knows what he wants to convey through his films and there's no doubt in my mind that he accomplishes what he wants. If you are still undecided as to whether or not you want to view this film, see it for Laser's chilling and truly disturbing performance.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Not as disgusting as I thought it would be.  Yes, the central plot is probably the grossest one you'll ever encounter, but the movie itself is not as graphic.  \n\nAs a thriller it is not too bad.  Direction is good and performances are OK.",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "With a strong performance from both Dieter Laser and Akihiro Kitamura, and a rather grotesque concept, THC entertains and disgusts.",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "Can't say I liked it, but it was strangely entertaining...",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Utterly revolting and a seriously pointless film.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "For all it's attention grabbing controversy, the Human Centipede is a really dull unoriginal film derivative of Clive Barker and the like, and quite unimaginative in terms of body horror. Certainly, the premise is disgusting; but the film is so poorly made there's no repulsion only boredom. It's a Syfy movie, but more amateurish.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "There's too much torture-porn out these days. There's no redeeming qualities to this movie what so ever. None of the characters are particular likeable or unlikeable. The visuals are about as interesting as bland soap. The concept is disgusting. The only reason this movie would make money is because the concept draws people in, they become curious - just how bad or horrific is this movie? The answer is very, very.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "It's gross and its quite disturbing to watch.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Disturbing, to say the least.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "The purpose was to scare. I only watched the trailer and I had nightmares of weeks. So mission accomplished.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "So, I knew going into it that something called The Human Centipede wasn't going to be a quality film. But there are limits to human stupidity, come on now. Your car gets a flat on a lonely stretch of road surrounded by woods. You get out and start walking to find someone to help. And you do this by... walking through the woods?? Why the hell would you even consider leaving the road? And these girls just have the worst luck on the planet. Flat tire, disgusting pervert, lost in the woods, heavy rain, and now crazy doctor guy. Who they tell they're alone. (The correct answer to the \"are you alone?\" question posed by a creepy stranger, kids, is \"no, 2 friends stayed with the car in case someone else drives by\".) And unfortunately, this was the best part of the film. Disgusting and stupid, 0.5/10 is being generous.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "So, I knew going into it that something called The Human Centipede wasn't going to be a quality film. But there are limits to human stupidity, come on now. Your car gets a flat on a lonely stretch of road surrounded by woods. You get out and start walking to find someone to help. And you do this by... walking through the woods?? Why the hell would you even consider leaving the road? And these girls just have the worst luck on the planet. Flat tire, disgusting pervert, lost in the woods, heavy rain, and now crazy doctor guy. Who they tell they're alone. (The correct answer to the \"are you alone?\" question posed by a creepy stranger, kids, is \"no, 2 friends stayed with the car in case someone else drives by\".) And unfortunately, this was the best part of the film. Disgusting and stupid, 0.5/10 is being generous.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Well that was something different and interesting.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Weird movie, not the worst horror movie i've seen its pretty creepy, but its not a good movie either, the plot was a little too stupid as well.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "It had a great horrific idea, but lacked story. More explanation and background of the crazy doctor could have made this better.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "I only have one word ...naaawwwaaattssss!!!",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "once you get past how creative and gross the plot is, everything about this movie is absolutely terrible. bad acting, bad script, annoying/stupid characters, corny dialogue, plot holes, etc. and its boring as hell",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "Pure fucking bullshit! I expected a great movie, and was very disappointed. No plot, no horror or gore, nothing. What a waste of time.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "I'm giving this a whole star more than I would like, because its production quality is actually pretty good. However, all the worthy effort is overshadowed by the sickness of the story. It is grotesque. NO ONE should see this! It made me uncomfortable in an unredeeming way. Only those who enjoy the darkest, sickest, most sadistic and twisted of movies and stories would find this even remotely worthwhile.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Cringe-worthy concept handled exceedingly well. I haven't felt so creeped out in quite a while. The acting is not so great, especially by Dieter Laser. The creepy feeling was not brought about with tons of blood or gore, but merely with the grotesqueness of the surgery and the successful completion of same. Got to give credit where due, this is truly a horror movie that works.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Not as bad as i first remember... quite good actually :P",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "The Human Centipede isn't the strongest horror film, but its not the worst either. Its creepy horror is unique, but still isn't good enough to be great. Some problems that are included in this film are weak dialogue, strange moments, and undeveloped characters. It's good to watch it at least once cause you don't wanna be like the main character in its sequel.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "The most degrading and inhumane thing I've seen to date.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Basic. Not scary. Terrible writing. \nThis is shock garbage? Please. I've seen worse things portrayed better.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is defiantly one of the most disguisting movies you will ever watch. The idea of it is simply too much for many people, so I would tell anyone not interested in something disguisting to forget about ever watching this film. For me personally I would tell you that the actual idea of this movie would actually make sense for a horror movie. What we ultimately get however Is a very offensive film that will surely be remembered as one of the most controversial films of all time. If movies like that appeal to you, then you can check this one out. Otherwise, I would stay away from it.",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "So I finally watched it. I think it's a mediocre horror movie with a standout performance from Dieter Laser.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "A truly gross film, but no scares or true tension, other than the one your guts is going thorugh trying not to return the food you just ate.",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "I find the concept interesting, and you cannot say it isn't unique. That said, the story is awful, and the acting is far from good. I think the concept is all that makes this film, it is rubbish apart from that.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "Made me want to puke",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "The concept is gross and disgusting..I mean how could Tom Six think of such an inhumane, grotesque torture and horrific imagery...Beware,  it might just puke you out!",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "Probably the weirdest movie I have ever watched!  It was perverse and demented...gross and suspenseful with a dash of WTF...shock value at a high...kept me interested enough to see where they were going with it! Can't believe there is two sequels to this!",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "\"The Human Centipede First Sequence\" es una tortura degenerada que va en contra de todo derecho humano y gusto cinematográfico, pero logra captar la atención de la audiencia de forma única al añadir drama y pena a las pobres víctimas de tan torcido experimento.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "Feed Carrie!\nFeed Samantha!",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "Not much to look at, but the experiment on this film is intriguing. It's stupid film yet it's disturbing. Mouth to anal connection to form a centipede? Who does that? Though the story is that lame and no interesting plot to go by, the crazy doctor in the film delivered a wild and outstanding performance to keep the movie alive.",
            "review_date": "2013-06-02",
            "source": "rt"
        },
        {
            "content": "This was a very creepy and disturbing film. It had one of the creepiest horror villain a horror movie can offer and Dieter Laser played his character perfect. The second you see Dr. Heiter you can tell there is something totally wrong with him. I really liked the scene when he's explaining the surgery but doesn't care everyone is flipping out and continues to lector. This had a lot of time waster scenes which annoyed me. Many of them were very obvious and you could just tell they had to add something to reach the 90 minutes mark. I even thought the ending dragged on for a little too long. It's not great but it is very disturbing and disgusting, with a great villain and very original idea which couldn't cut a few scenes out that weren't necessary.",
            "review_date": "2013-05-30",
            "source": "rt"
        },
        {
            "content": "The 'squeamish factor' is really all the film has going for it. Once it wears off, it's a long. slow fall to nothing.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "Horrible movie, and incredibly fucked up",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "This film was supposed to exceed all of my wildest expectations of what a horror slash gore film could be. Hah. This film was lacking in those aspects entirely; however, contained acting and writing that far passed all of my expectations. Dieter Laser's performance in particular was extraordinary in every regard. Bottom line, it may have had solid acting, but it is what it is. Nothing more, nothing less.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "There are no words that describe my distaste for this first main stream snuff film there piece of trash  makes Michael Bay seem classy enough said",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "This film sums up the horror genre in the 21st century; gory, stupid, and no story what so ever.  Human Centipede  is easily on of the most fucked up movies I've ever seen, which is the only thing is does good I'd suppose, but everything else is wrong and awful.  The characters are copy and paste clichéd characters, but in the films mind with some twist.  The story is laughable the entire film, it truly doesn't make any sense and is really just there to show some pretty messed up imagery on the screen.  The writing and direction is trash and pretty void throughout the film.  Human Centipede is good for gross out moments and a pretty laughable storyline, but for those wanting true horror, you're very out of luck here.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Apart from the very thin plot, and a handful of queezy moments, wrapped in a horror-like-scenario, this isn't much of a movie. Watch it if you must.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Triumphant in all it's disgusting glory.  If you must watch...don't eat milk duds.",
            "review_date": "2013-05-17",
            "source": "rt"
        },
        {
            "content": "Stupid, unscary and gross there is no reason to watch this film.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "very bizarre underrated horror film.. disturbing but somewhere effective...",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "Very boring and unoriginal film. Not worth wasting ur time.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "wow, sooooooo boring not even scary",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "shit film and propa dirty",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "I read that this movie was really scary and one of the most disgusting movies people had seen.I just have to say LOL. I wasen't scary,it was a fucking comedy. The acting was so bad and not beliveable at all. You must be a very sensitive person if you think that this is scary.....",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Sick. Twisted. Loved it.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "Ok, esta pelicula es de lo mas asqueroso que se pueda ver, aunque tenia buen concepto.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "A horrible, sick, twisted movie with terrible acting and an extremely laughable script.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Whoever made this needs to be locked up in a MENTAL institution! UGLY film!",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "horrifying and sick movie...",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Was horrible & it doesn't make sense. The 2nd & 3rd person in the chain would die choking on their vomit.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "I think Tom Six had the intention to shock the audience as much as he possibly could, and he succeeded. The film did have its moments, and the originality was refreshing, but what the film has in originality and style, lacks in acting and subtext. The doctor had no motive in his actions. He was just a sick and disturbing human being who wanted to create a human centipede. The film had no meaning and was predictable. Very few elements of surprises, and extremely uncomfortable for audience members to sit through the full movie due to the over extreme and disturbing scenes. It's still an ok film which deserves 3 stars for originality and uniqueness.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "Very sick and twisted movie not for the faint hearted!!!!!!!",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Finally saw this and its actually pretty damn funny",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "A pretty half baked concept that has some amusing moments thrown in every now and then but in the end felt very lacking. I will give credit to the main German actor who should be in more stuff because he is one of the most creepy looking bastards ever put on film.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "It needs a laugh track.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "Sick. Very sick. Coming from me. That's serious.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "It's an original concept.  I'll give ol' Tom that!  But a good movie?!  Not even close.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "Shock value for the sake of shock value. While the concept is revolting, fresh and unique..the execution is horrible. If you want audiences to be afraid of a villain how about making him a little bit more cunning and scarier than Udo Kier's lookalike cousin. While I thought there could be suspense in this, there really wasn't any. It was a total bonehead romp that really just has the concept of a German doctor making a human centipede and that is really it. I'm sure people will love this specifically for the shock value but I am afraid there were no real shocks or terror. The score does work at times with the dark ambiance but it is really nothing that we haven't heard before. Once the big climax came with the scalpel and a beyond idiotic choice by the front of the human centipede I really felt that the director, Tom Six, was taking a giant dump in my mouth.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "It seems like Six had an interesting medical-horror idea but then got lazy and didn't know what to do with it after. And so we are left with a film that is both incredibly boring and trashy.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "I love horror films and I like gore but a decent horror will have bit of gore but mixed in with lots on tension and let you play on your imagination. All this film does is make you want to through up rather than scare you. Could have been better",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "Absolutely terrifying.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "One of the most disturbing\\disgusting films probably ever made in horror history.This filmed has earned three stars in my book due to its clever horrifying ideas.A madman,proffesional doctor known for seperating Siamese twins decides to create one of his own projects:A human centipede,where he sows the end of one person to another.I promise you it's one of the weirdest films ever,but if you've seen lots of gross fims and are horror die hard fan this one will probably not come across as bad as you think it will be.The film is so sick and messed up that its a disgrace to the horror genre and comes off as a sick comedy.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Stuff like this kind of disappoints you, but I thought it was somewhat good.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "What the fuck did I just watch.\n\nNot that I expected to have a different reaction. But I naÃ¯vely hoped that this sad picture would hold to its credit some meager semi-redeeming quality, *something* decent to grasp as I was dragged through those ninety filthy minutes. I hoped for too much.\n\nBut hey, at least I can now brag that I've actually watched it...",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "A very, very, very creepy and gory take on a horror movie.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "I don't even know what you're supposed to say about a movie like this. I'll let the scar it left on my heart speak for itself.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Not in the least bit offensive, gory, disgusting or repulsive.  Just dumb.\n\nThe women are just awful, terrible actresses that do nothing to win our sympathy in the first place, so a big fat let down from the right off.\n\n1.5 stars as there was something that made me laugh, I forget what it was now, and the fact that it's amusing that poor lass is stuck between a Japanese man what's offed himself, and another American girl that's died of septicaemia.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "I don't wanna watch it again, but it'll keep you on the edge of your seat",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "With it's disgusting premise and exploitative nature, Human Centipede probably does not warrant much being said about it. For what it is and what it wants to be, it is successful in that it creates a truly menacing villain, Dieter Laser, and puts characters in situations that are shocking to even modern standards. The 'acting' and dialogue is rough at first, but seems to find it's stride towards the mid and latter portions of the 'film'.  It would be hard to argue that it rises much above torture porn, but director Tom Six does seem to have a knack for tension building, with one specific scene involving two detectives having a particularly well crafted sense of pace and build-up. That, and an unpredictable last act, make it a step above a B movie, while still being a novelty by and large. Recommended only faintly for those with the sensibilities. \n\n3/5 Stars",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "One sick twisted movie",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "pretty gruesome shit lol the doctor is a sick and twisted guy. all in all a so so movie. it was a good idea for a movie",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Ive never seen it pple keep talkin bout it I want to see it",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "Bafflingly perverse, disturbing, and outrageous medical horror. I don't know how many stars to give it. Roger Ebert refused to rate it rather than give it zero, and I can understand why. Like Martyrs, this film cannot be unseen. Yet, unlike the majority of torture-porn schlock, this film is ridiculously well-crafted in the vein of Cronenberg.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "A very poorly made horror movie. The acting is terrible (even for horror movie standards), the characters beyond moronic, and the story is a complete bore. Don't bother.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "The idea presented in the film is enormously original, as it is disgusting. In fact, it is so disgusting and disagreeable that it made me get worry about the director's mental health.\nApart from that, the script is unable to create any suspense and the ending is clrearly the work of an inexperienced director.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Loved it and if u like sick and twisted, I think it is definitely sick and fucking twisted!!",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "1 étoile pour le film, 2 étoiles pour la photo des chiens du début, le très mauvais acting et les décisions stupides haha! I cringed all the way!",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Not the horror it was meant to be interestingly sick but like a car accident",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Ashley C. Williams was sweet",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Just imagine the stuff that comes out of C.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Wouldn't even wanna give it that but I can't go any less. It is a sick and demented film that causes me to worry for the minds that created it. I wish I could wipe it from my memory but sadly my mind has no erase feature.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "that's one sick movie, but strangely enjoyable. the evil guy reminds me of a German Jeremy Brett. he looks and sounds like him, albeit German lol. very Weird film.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "A quite unneccesary video nasty which somehow was given a cinematic release. What, they've made a sequal?!? And are doing another one?!? Grim.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "This is one messed up movie that, like a car wreck, you cannot help but watch. Not for the weak-stomached, just a forewarning.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "I dont really know what to say about this movie other than whats already been said. Disgusting, ridiculous concept. The guy who came up with the idea for this film is a maniac and needs psychiatric help. The actors are terrible with the German doctor being the only highlight. You've heard peoples opinions on this and you'll be tempted to watch it, by the end you'll wish you never did.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "Seeing that the horror genre these days is a contest of gross out gags, I guess you can call this ass-to-mouth experiment effective.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "I feel like this movie destroyed a little piece of my soul. Like Rogert Ebert said, \"It comes from a world where the stars don't shine\", and parts of it is more tragedy than horror. I give one point for originality. I don't know how to rate it, honestly.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "It is what it is and what it is is terrible, but in a way that you can make fun of.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "A whole new level of disgusting!",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "The only 'good' thing about this movie is the ending, that's it.",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "Thought it wasn't to bad, no more sick and twisted then\" Saw, Tortured, Hostle\" it was a little slow, but i found it intense. The second one was awful, didn't like it at ALL.",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Sin comentarios, lo unico bueno es el final...",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Why did I watch this?...I shouldn't have watched it.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "Just so impossible to ever do. Will watch the second one when it's available free.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "If I had to describe this movie with only one word, I surely would choose \"SICK\". I am not suprised to see that  only a few more than 30% of the Users here liked the movie, since, although I rated it very well, I did not like to watch too.\nThis movie is sick, strong and gruesome. Things you could imagine in the very beginning they would not show, they show.\nIt is a good production and a different film.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "That Film Shocked me",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Oh come one... no one likes this?  Everyone should see it.  The way I think about it is no matter how bad things get at least you can say to your self well at least my mouth isn't attached to someone's bottom.  Makes you realize how lucky you are!  LOL",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Disgusting movie about a man's disgusting dreams",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "I wish I could say that it was at least unintentionally funny but ultimately it was just annoying.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Bizzare movie so different hard not to watch.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "had no storyline what so ever",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "Oh... Oh... God... Double Flaps... All the way....",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Possibly the most disturbing piece of fiction I've ever experienced, and for that, it ought to get some props.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Surprisingly moving.....weird too",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Sick sick sick\nAbsolutely brilliant\nBest horror in years",
            "review_date": "2012-12-18",
            "source": "rt"
        },
        {
            "content": "really you have to look at it not from the whole \"God\" aspect but think about the theme of communication and the theme of violence and horrific images in media.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "Hooooo boy that was gross. Not scary at all, mostly just a gross out flick. Definitely see the South Park parody, Human CentiPad.... which is much more palatable.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "Sick and twisted! Tom six invented a new level of twisted horror!",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "I hate that this has gained such a reputation when movies like Inside or The Loved Ones go unnoticed; this isn't half as shocking or impressive as Tom Six seems to think it is. I'm glad that Six found a way to keep the actors from delivering more horrendous dialogue, because the first few scenes feature some of the most unbeareable overacting I've ever seen. Normally, I'm more than willing to suspend disbelief for characters' behaviors, especially in horror movies, but this one stands out as a shitstorm of stupidity that just makes me think I wasted my time. I wouldn't have watched this if not for a paper, and I'm starting to think that avoiding it entirely would have been the right decision. I love gory horror films and appreciate well-done nastiness, but this is just gimmickry with zero rewarding factors.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Give it a chance. Don't listen to any hype. If you can get past the disgusting concept, the acting is solid after the first ten minutes, the cinematics are very professional and the plot flows well with some high tension scenes that keep you on your seat. A very decent film.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "Tries to be a little more ambitious that it actually is but minus some very silly moments and the jokes that'll be made afterwards, surprisingly has some good tension and a very memorable villain.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "Pretty boring, The japanese guy & his climax could have been interesting but it ended up being just dumb",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "This movie is just sick,dont waste your time.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Depraved, twisted and I loved it. Best watched after a reasonable amount of alcohol if you don't want it doing things to your head that you'd rather didn't linger around for too long. \n\nCan we please have more surgery in the sequel?",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "My sweet three-dog\r\n\r\nTwo girls traveling across Europe get a flat tire on the way to the club.  They run to the nearest house that happens to be owned by a mad scientist in the process of executing a science experiment and he just so happens to need two human lab rats.  The girls will work perfectly as he tries to create his own pet by attaching three human beings together...ass to mouth.\r\n\r\n\"You're always wet between the legs, right?\"\r\n\r\nTom Six, director of Centipede 2, Gay in Amsterdam, and the upcoming Human Centipede 3.  The storyline for this picture is very intense and fairly well thought out.  The concept and operation scenes are very intense and the mad scientist is portrayed perfectly.  The cast delivers mediocre performances (outside of the scientist) and includes Dieter Laser, Ashley Williams, Ashlynn Yennie, Akihiro Kitamura, and Peter Blankenstein.   \r\n\r\n\"My friend, you don't match.\"\r\n\r\nWell, this was my first experience watching movies on Netflix and I found this movie better than I anticipated.  The reviews for this picture are fairly mixed but I will say Laser was awesome as the villain and his body language and facial expressions were perfect.  This isn't a perfect horror movie but it is better than you may anticipate and I will say the operation scenes made me light headed.  I'd give this a shot if you haven't seen it.\r\n\r\n\"I don't like human beings.\"\r\n\r\nGrade: C+",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "Not as gross as I was expecting. If this is truly gross to many of you I must be desensitized. My main problem with the movie was how dumb some of the characters acted. The girl manages to escape but returns to try to drag her friend out and thus gets caught again.. she should have ran away anyway and got help. Not to mention they manage to knock down the doctor but don't finish him off.. and when he does crawl at them face to face with a small scalpel.. the Japanese man is armed with a longer weapon - a lamp that he could have easily used to kill the doctor. What does he do? He then grabs a shard of glass and kills himself... he could have easily killed the doctor and ended their nightmare!!",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "Despicable, abhorrent and worthless.",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "First off.. I give this film ZERO STARS.. This film is highly disturbing, twisted, goes against nature on every level.. Complete garbage.. I regret ever laying eyes on this film",
            "review_date": "2012-11-23",
            "source": "rt"
        },
        {
            "content": "Almost unrateable as it, strangely, looks good, a lot of the time, but the film is extremely odd, and definitely a hard watch, but the ending is just a bit of a let down... and this isn't a film that makes you want to desperately see the sequel.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "So I've heard from many that this film is sick and most can not bare to finish the film. So that's a challenge for me as I always have to finish a movie to properly rate it.  So here we go, this film creates curiosity as to what is that dr. In opening scene thinking as he's looking at a few pics of his dogs while stop along a side street. Then the dr starts to explain once he has 3 bodies that are the perfect match. And this is when it gets gruesome, disturbing, and not a movie to digest. Even though there wasn't much detailed gore it leaves a lot to your imagination which makes your stomach turn. Be ready for it if your gonna watch!",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "This whole movie could've been avoided if they taught how to change tires in college.",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "If you like you're torture porn ie Saw, etc then you'll love this... One extremely messed up film!",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "Not scary, edgy, or well done by any means. The Human Centipede is a failed attempt to shock its viewers with a distasteful take on horror.",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "The concept is disgusting and there was a lot of talk (within the horror circuit) that it was way too much or pushing boundaries. Well I finally saw the film and I found it as disgusting as the imagination will let you. There was some blood, but not more than you get in a CSI episode. I guess all is in the concept and imagination of the viewer. This is not garbage but I wouldn't even consider it groundbreaking. It is just unique and bizarre.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "I was disappointed for not get THAT shocked like I was told I was going to. Okay. The movie is nasty, but let's adimit that there is worse things out there.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "The human Centipede has originality in the macabre details, however, it lacks in just about every other department. The acting is silly, the two main female protagonists have such annoying personalities that the viewer can't help but feel grateful when their mouths are sown shut. The stupidity of the police, or of the characters in certain situations is so high, that the movie loses any believability or sympathy towards the victims. This film is simply a creation to shock and push boundaries, and it is only because of the unconventional methods of torture that will make people flock to see this cliché ridden horror movie.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "I thought I'd seen it all, but clearly I hadn't. This film takes repulsion to another level, and I'm not sure whether I've been entertained or mentally disturbed. I'm just praying that this wasn't one of those films inspired by true events, otherwise I really worry what this world is coming to. It's all set in a remote area of Germany where two student girls are setting out on a regular night of drinking and clubbing before moving on to Italy a day or so later. Unfortunately for them, the only drink that passes their lips that evening is a glass of water laced with date rape, as they go seeking help for their broken down car. Their captor, albeit a seemingly successful surgeon judging by his mansion home, has one last operation to perform - his own human centipede creation. Despite several screams and escape attempts late, the girls along with a fellow captor are all pieced together in one digestive flow which does leave us cringing at the thought of the inevitable as we see the hostages connected via mouth to anus. Although this film is not particularly graphic, it doesn't leave a lot to the imagination and the simple thought of someone excreting into another's mouth is enough to make one gag. It's not a particularly action packed film, but will have a growing reputation simply due to its willingness to stretch the boundaries of grossing out its audience. It's a case of seeing is believing, and god knows what we'll be subjected to in the sequels?!",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "After all the hype I finally watched this gem. This film should be watched by all. It is one of the darkest, bizarre and still somewhat realistic horror films I have ever seen.",
            "review_date": "2012-11-08",
            "source": "rt"
        },
        {
            "content": "This movie was trash. I dont see how this is gruesome. The acting was pretty terrible. The ending was dumb. Wish i could have my 90 minutes back.",
            "review_date": "2012-11-08",
            "source": "rt"
        },
        {
            "content": "El personaje principal es increíble. La foto es muy bonita también.",
            "review_date": "2012-11-07",
            "source": "rt"
        },
        {
            "content": "As a quality piece of film-making, The Human Centipede is a terrible film. However, as an unintentional comedy, I laughed quite a bit while watching it and had fun. Despite some critics saying there are deeper meanings in this film, this film is really just dumb as fuck. When the Asian guy shat in the girl's mouth, I laughed harder during that scene than I have at most actual comedies. There are also  plot holes such as how the girls don't die of starvation or dehydration (I'm pretty sure diarrhea doesn't count as food or drink), or how the middle girl doesn't suffer from an infection, unlike her friend who is sewn to her (The infection should spread). There is no logic, to say the least. This film's only real purpose is to gross out the viewer, and for that purpose, it works. I definitely don't recommend this film to most people, because it is justifiably hated. I had fun with it, but most will not.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "I wanted the movie to work so much better and had hope for it.  Good acting, yet wish it could've been more interesting for the subject and idea of the movie.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "I watched the entire thing. Had a naked chicks (plural) for 70% of the movie and not one shot of a single tit. NOT ONE!!! Such a waste 0.5/5 Don't watch this shit!",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "I have seen many horror films in my lifetime, and this one stands out in its own right. This movie takes horror to a whole new level, and shows things most film makers wouldn't even begin to think about. Some people think that this movie has taken horror too far, and many were offended by its disgusting, gruesome content. I am fairly tolerant to strong movies, but with this one, I almost turned it off and didn't even watch the whole thing. But I chose to stick with it, because I just felt like I had to see it at least once. And with that, I don't plan to see it again. One sequel was released last year, and another will follow in 2013. According to the director, Tom Six, the third film will make the second one look like a Disney movie. That in mind, I don't intend to see either sequel. Just the thought of the first one makes me sick, so I'm more than certain I won't be able to survive even 10 seconds of the sequels. But there is nothing wrong with seeing films like this once in a while. If you like disgusting horror, I recommend you watch it at least once, but be prepared to turn it off, you may even throw up. But one thing is for sure, this movie is NOT for kids. This movie is unrated for obvious reasons, and was initally released in the UK, but if it were releaed here, I have no doubt it would get an R rating.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "--HALLOWEEN MOVIE OVERLOAD #21--\n\nIf you're looking to get grossed out, then this is definitely the place for you.  As far as scares go, you most likely won't find them here.  However, I can't help but think, hey, I can recommend this, right?",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "What a piece of shit.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "You know what you're in for if you go to watch this. It could've been better, but it's still done very well and is genuinely creepy, despite the gross parts being stretched-out and overdone.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Tasteless in every way. Dieter Laser is the only redeeming quality in an otherwise useless masturbation on screen.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "NOT FOR THE SQUEAMISH!!!!",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "One of the most disturbing movies I've ever seen. Period.",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "ONE OF THE GREATEST MOVIES TO WATCH EITHER DRUNK OR WIRED",
            "review_date": "2012-10-25",
            "source": "rt"
        },
        {
            "content": "This is a film in class by it self. Ether You hate this or like it.  Warning this is not for faint of heart. This another case  where science  takes a dark turn. With all the sickness it dose have  have a certain Irony to it as well. I felt this that was well drawn out.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "I will admit, I love sick films. I'm totally into them. I love the gore, the gruesomeness and all that goes with them. I saw the trailer for this and immediately wanted to watch it. I was hoping this was going to be one of the sickest films I had ever seen... To be honest, I was greatly disappointed with it. Ok, the idea of the film is pretty sick. But I didn't feel it throughout the film. Although it's a film, and it can be unrealistic, I felt certain parts of the film was not realistic enough for me. I won't say what part as to not ruin it. I will say that it isn't a bad film, but it just wasn't as good and as sick I had hoped(I guess that just makes me one sick individual lol). But if you are into this sort if film, I do reccommend it.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "I think the title (implying a sequel will be coming) is more horrifying than the movie itself.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "I actually liked this a lot. Most of the gore and gross stuff is implied, not shown, and you do get why this guy went looney tunes.\nI really liked the two girls as well....especially Ashley.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Inhumane but completely original in my opinion. Plus the mad scientist character is rarely seen in horror films these days, and I think Dieter Laser does a great job portraying that kind of role.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "not as gross as expected but don't watch it!",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "My stomach is in knots!",
            "review_date": "2012-10-17",
            "source": "rt"
        },
        {
            "content": "i just watched the trailer and i LITERALLY feel sick and ....EW. EWEWEW THAT IS LITERALLY ALL ICAN SAY. I CAN FEEL MY VOMIT COMMING UP JUST FROM WATCHING THIS TRAILER THIS IS SICK. AND WRONG AND CRUEL.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Euh... Franchement ultra malsain mais wouaw, quel film de taré !!!",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "It's... interesting.  There's a serious amount of annoying and/or disgusting, but Dieter Laser does a phenomenal job with his character and is a lot of fun to watch.  To add more value to the experience, follow the film with Daniel Tosh's \"Spoiler Alert\" thereof.",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "Para bien o para mal, \"The Human Centipede\" dejará su huella indeleble en la historia del cine de terror. El director holandés Tom Six confeccionó una película clase B sucia y depravada en la que un científico loco (interpretado de manera memorable por Dieter Laser) secuestra a 3 jóvenes para armar quirúrgicamente un cienpiés humano uniendo bocas con anos. Si usted no tiene el estómago, no la vea.  Pero si usted está en busca de una emoción cinematográfica fuerte, esta es su película.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Come for the disgusting premise, stay for the memorable villain.",
            "review_date": "2012-10-09",
            "source": "rt"
        },
        {
            "content": "horrible movie begining to end",
            "review_date": "2012-10-09",
            "source": "rt"
        },
        {
            "content": "Takes a certain type of fan to appreciate this one",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "The world would keep on turning just fine if this movie never existed",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "2010's chainsaw massacre....... Yes the director has lost the plot a bit but brings horror to a new level brings back the cant watch effect to horror films",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "This is one of the worst movies I have ever seen. It more than crosses the line and results in a movie that is sick rather than scary. It has a truly repulsive concept and the movie takes things way too far. It has very little story or sense of characters and offers no redeeming qualities. There is no attempt to understand the doctor, his psychotic obsession or get into his mind which is where the true horror lies. The format is actually nothing more than a cliché scary murder movie the only difference is the extremely gross actions of the villain. It is resorts to tasteless physical scenes and merely plays out a series of truly grotesque actions. This is a nightmare to sit through, even nauseating at times, and is nothing but a true disgrace. The goal was gross out shock value and it certainly achieved it, but the thought that anyone would enjoy it is the scariest thing of all.",
            "review_date": "2012-10-03",
            "source": "rt"
        },
        {
            "content": "The only good thing about this film is Dieter Laser's performance as Dr Heiter. The rest of the film is so bad, I would never recommend it to anyone, ever.",
            "review_date": "2012-10-03",
            "source": "rt"
        },
        {
            "content": "I wish I could say this movie was self aware of how bad it was executed, sadly I truly think Tom Six is not only proud of this but finds it revolutionary...\n\nHere is A quote from Mr.Six himself paraphrased \"Why make movies unless they are original.\" and i respect that quote on a lot of levels...now lets review this movie.\n\nA mad doctor is kidnapping people (Totally original), in his house thats in the middle of nowhere and apparently never checked on unless of course you are a lost tourist (UNDENIABLY ORIGINAL), so he can experiment on them and make his mad vision come to life. (Most original concept ever amirite?) So generally speaking this movie kicks Tom Six's own quote in the balls, put thats fine why cant there be a good movie about a mad scientist and his whacked out brutal experiments the answer there is none, but there is a reason why it didn't work here.\n\nSix seems to have problems moving his characters out of the first dimension and this starts to show almost immediately instead of a proper prologue of some sort the film just simply begins, we are almost expected to know why this scientist is a mad scientist, and why he wants to make this human centipede.\n\nAt this point we met our (loosely put) protagonist 2 American tourists who get lost on the way to the club...apparently there are no highways in Germany, so their car gets stranded in the woods (Tom's originality once again shines in such a plot device) after not being able to get help because their cell phones aren't getting reception (there goes that loss end) they stumble into the doctors house where we begin our last 75 minutes of useless shenanigans another tourist is kidnapped off screen and brought in then seriously it plays out like every movie involving A kidnapped person ever has...and to top it off there is some Tommy Wiseau quality acting in this baby, that comparison being made there is a lot of similarities between this and Wiseau's work, id go as far as to call it, \"The Room of Horror Movies\".\n\nIts badly acted, written, directed, and just plain annoying to sit through, it doesn't even have the camp value movies like Troll 2 or Plan 9 have its just all around bad film creating...but then again Tom Six did make it.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "This film left me with life-long mental scars. It will never be forgotten.",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "Happy? Encouraged? Hopeful? Amused? Horny? Watch this movie to kill all of those positive emotions forever.",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Grotesque and everything else is just terrifying to watch, don't know if getting kicked in the balls is better than watching this \"horror\" movie. Who came up with the idea of swallowing...what's inside?...don't ask, just avoid this (umh) crap.",
            "review_date": "2012-09-25",
            "source": "rt"
        },
        {
            "content": "I really don't know what to think about this movie except \"did I really just see that?\"",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Pretty morbid and a fresh concept. Hard to watch.",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Remember when horror movies actually used to be scary instead of just disgusting? Those were the days...",
            "review_date": "2012-09-22",
            "source": "rt"
        },
        {
            "content": "Though it is disgusting for the sake of it The Human Centipede is an original film with a premise no-one could of thought up except for Tom Six apparently.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "i found this movie boring, lacking horror and a sad attempt at trying to shock people.",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Nauseating, gross and yet it's sick. The Human Centipede is one of the most disgusting movies ever made and it's really exploitative due to it's graphic content. This is a great film and the plot is about two girls who finds they're selves stranded in the middle of nowhere after having a flat tire and when the girls seek shelter from a man who lives in the woods the two girls soon discovered that he is creating the unspeakable Human Centipede and soon the girls must escape before the man name Dr. Heiter uses them both for his Human Centipede experiment. This is a great film so far although if you have a weak stomach I seriously do not recommend this movie for anyone because this movie seriously will give most movie watchers a stinky smell in the cinema due to it's graphic content and it will leave any audience a bad odor in the room and no one could possibly resist watching movies like this if anyone has a weak stomach and I seriously do not recommend this for anyone. What's great about The Human Centipede is that the film has a lot of disturbing content and the film's concept is just great and it has an exploitation feel and the whole movie feels like some weird 70's/80's exploitation movie due to it's concept and graphic sequences. There are lots of disgusting scenes in this movie and I seriously mean a lot of it. The development of the Human Centipede is just sick and disgusting and seriously from what I can tell this movie really is an exploitation Horror movie because there's a lot of disgusting scenes in this movie and seriously I think it's just great. What I also like about The Human Centipede is the film's disturbing content and there are lots of disturbing scenes in this movie. The death of the Japanese guy is sick. The scene where Jenny dies is just gross and nasty because of the three of them connected together  in the form of the Human Centipede is just plain gross and it seriously creates a bad odor in the room so far. Though the death scenes are just a few and not so gory it's still a great movie due to it's sick and disturbing content and I like the idea so far. What I also like about this film is that the movie also has a lot of tense parts. The scene where Lindsay gets chased by Dr. Heiter after escaping from her bed is really tense and I like how that scene was used a lot to create the suspense of this movie so far. The other things that fascinated me about this movie is mainly the villain's behavior and Dr. Heither is just creepy and yet he's sick and insane and thanks to Dieter Laser's performance the movie really ended becoming a success and I like how he played the role of Dr. Heiter so far and I'm hoping to see more of Dieter Laser's future films in the future as well. Now the acting is great the performances of all the new casts in this film is just great and the two girls did a good job with they're roles in the film even the Japanese guy did a good job with his role in the film as well. While the person who had the best performance in the film is Dieter Laser and I'm hoping he will have more future works in the future as well. Director and Writer Tom Six did a good job in creating his first Surgical Horror movie and I like how he handled the directing really well so far and I'm sure he will do a good job on the sequel to The Human Centipede so far. Overall The Human Centipede(First Sequence)gets a 10/10 because this movie has all of the disgusting and gross out sequences and it also has the exploitation feel as well. This movie is not for everyone it will seriously leave a bad odor in the room.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "Don't watch this. You're welcome.",
            "review_date": "2012-09-11",
            "source": "rt"
        },
        {
            "content": "One of the Worst Ten movies of all time",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "A classic cult horror film with an almost perfect villain. Be ready to cringe.",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "I couldn't stop watching it once I started. You can never un-see it! This movie defines getting shit faced. What a great Hallowe'en Costume. Anyone wanna join me? I recommend never watching this movie. ATM-ATM-ATM",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "An attempt at grossing out the audience sacrifices narrative and virtually any character development and is more campy and goofy than disturbing. [D+]",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "It's incredibly disgusting and really hard to sit through, and that's exactly what gross out horror should do.",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "What the hell did I just watch?",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "I can't shake the feeling that the people who made this movie are going to hell, so am I for watching it.",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "I can't unsee this and I can't believe I saw the whole movie..why..why?!",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "An ATM fetish film gone horribly awry this softcore torture porn will either leave you laughing at its darkly humorous premise or disgusted by it. I fit in the middle--I found the first 85 minutes to be disgustingly funny but the last 6 minutes left me feeling cold and cheated.\r\nOn a side note, Dieter Laser gets two thumbs up for two reasons: One is that he reminds me of a cross between Udo Kier and Lance Henriksen and two, his name just kicks all kinds of ass.",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "....Sickly awesome.... This is definetely an original plot... Very disturbing, gruesome, nasty, vile, and just YUCK. But I loved it!",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "The very definition of a bad movie.  What makes this even worse is that it doesn't even know how awful it is.  Clunky dialogue, terrible acting, slow story.  I made it 15 minutes, due in part to wanting to see the two horrible acting, but hot, leads offed.",
            "review_date": "2012-08-18",
            "source": "rt"
        },
        {
            "content": "About as grotesque/shocking as a car commercial.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "Pretty unique idea.  Good use of imagination terror.",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "A genuinely disturbing concept is turned into a silly and highly enjoyable horror flick.",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "El Ciempies Humano son de esas cintas no aptas para todo publico, que tiene una propuesta original y una interesante actuacion de Dieter Laser pero que como cinta de Terror deja mucho que desear. Es una pelicula extrañana que a ganado seguidores por su trama original y hasta cierto punto morbosa.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Tom SIx derives an unexpected and grotesque feel to the horror/gore cinematic genre. Human Centipede is overshadowed by its devious creation of an 'actual' human centipede as well as its diabolical creator. Not for all audience, the film's execution doesn't hit well but does leave a sour mark on the not-so-strong-stomach-filled audience. 3/5",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "A totally disturbing and sordid affair",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "Utterly stupid.. If you're human and have a functioning brain then don't insult yourself by watching.",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "This is really over the top. I could only watch it once. I will commend the film for being so grizzly and doing something never done before in horror films. But other than that it is garbage.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Niet het bekijken waard!!!",
            "review_date": "2012-08-08",
            "source": "rt"
        },
        {
            "content": "I thought it had a bad story. They could have made it go on for a little more as it didn't go for long and u don't know what happens after all of it.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Dear god - the centipede is made only halfway into the film. The rest of the film, you are left watching dying captives writhing for life.",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "Where were the tail-end girl's feces supposed to go if there was no one's mouth to receive them? It's the philosophical questions like this that make this movie great.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "There is nothing to recommend in this pretentious and obnoxiously vile trash of a movie.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "this movie had me mortified, grossed out and nauseous all at the same time! awesome story line just a small warning though don't eat anything before watching!",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "If you can stomach any of the SAW movies, this is actually much less horrific.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "I admit, it's pretty disturbing, but nothing is really shown in graphic detail. The acting is bad but the film does manage to squeeze in some sort of story, I guess. I did not like \"The Human Centipede\", but it succeeds in grossing you out.",
            "review_date": "2012-07-27",
            "source": "rt"
        },
        {
            "content": "Do NOT see it! Disgusting!",
            "review_date": "2012-07-27",
            "source": "rt"
        },
        {
            "content": "Has hearing all the bad and disgusting things about this movie, I really wanted to see it and put it to the test. The Human Centipede (First Sequence) is a B movie that really should have been given more credit, its crazy, kinda disturbing, and amazingly original which I love in movies. Now the movie could have been better in so many ways but I guess thats what you get when it's your first big movie (Thats for you Mr. Six) I enjoyed this movie yes I actually did though not as disgusting and disturbing as everyone said it was I think (Full Sequence) is the one that focused on the disturbing images everyone wanted. Anyway (First Sequence) is a good movie for anyone that likes a original story I think horror fans will enjoy this movie and it will make everyone think twice about going in the middle of the forest in Germany.",
            "review_date": "2012-07-27",
            "source": "rt"
        },
        {
            "content": "The Human Centipede lacks decent acting and decency. There are just somethings in a movie that should be left to imagination. Nonetheless, it has a strange but suspenseful, original plot.",
            "review_date": "2012-07-26",
            "source": "rt"
        },
        {
            "content": "Whoever wrote this is seriously twisted.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "I saw this movie for the first time last night, and I was amazed! Tom Six is an absolute genius and yes, I consider this movie a masterpiece. The acting, especially by Dieter Laser is just awesome and with that chilling ending, I think that makes the movie pretty real for me. Now I just can't wait to watch The Human Centipede 2 (Full Sequence)! :D",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "This type of movie isn't meant to have great dialogue, or camera angles. It's only purpose is to gross you out, and it does that well. If your looking for a great snuff film then this is it. The Human Centipede is vile, wretched, and disgusting...perfect for somebody with a sadistic personality like mine.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "Very interesting lol..",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "I am surprised to see that I seem to be in the minority of people who were impressed by this movie. I figured that I would not like it and I did. Quite a bit. Whether it lives up to its reputation or not does not even really concern me right now as, after seeing it, I do not believe that its \"reputation\" was necessarily its intention. I would love to recommend this movie to someone and have them NOT consider its reputation or what they may have heard or believe as I believe that it might be more effective if seen under minimal pretenses. In its principles, it may not be anything new but it is in effect timeless. It is horror of the human psyche; of human potential for anti-social depravity. Therefore it is the horror movie that is like the love songs . . . both are timeless and will never go away. Nor should they! Recommended viewing for those that enjoy or even derived meaning from: A Serbian Film, Salo or the 120 Days in Sodom, Cannibal Holocaust, Flower of Flesh and Blood.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "Disturbing. Gross. There is no real story line here. Who envisions movies like this and then writes it!? Why!?",
            "review_date": "2012-07-23",
            "source": "rt"
        },
        {
            "content": "I found this to be a surprisingly well rounded horror movie.  I feel that director Tom Six has some chops and I can't wait to see the trip he takes us on the next time he decides to helm a studio pic.  Despite the low rating I suggest giving this movie a chance.......   Get over the formulaic horror movie BS and treat yourself to a vile, and ultimately disgusting pic that you just might enjoy",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "Hard to rate this once. An interesting, though disturbing premise that resulted in a ok movie that was less gratuitously gory than expected. Definitely not for everyone, but sickly though-provoking in a way.",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "After falsely advertising that it is super gory and that it's scary The Human Centipede is just another gross, visceral movie that thinks it's scary but is rather full of its self.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "Decent movie. Wasn't exactly scary though, more just gruesome.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "This movie hit an all time low!  In a sickening funny way though.  The notion of the human centipede and the operation that created it was a disgusting display.  \"I have to shit.  I'm so sorry!\" line was the highlight of this gross movie.  It was just plain NASTY and if you don't have a stomach for NASTY than I wouldn't recommend this movie.  There is a part 2 that I have to see purely out of curiosity.  LMAO!",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "Despite the hype it really wasn't *that* disgusting; at least no more than any other horror/gore flick. That said, the acting and storyline are atrocious, and the sheer level of stupidity on the part of the girls is truly astounding. I also know that no bad this movie is rated, you're still going to watch it ... *grin*",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "The acting was horrible but the movie itself was quite disturbing as a horror movie should be.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "a prime example of \"gore\" that is far too stupid and intense to enjoy watching. it becomes borderline dumb about ten minutes in; although there are some chills, they are much too scarce to make the film worth anything. it would have made a more interesting short, if it was done the right way.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "watch the second one and it will redefine the word \"gross\".",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "Discusting. Horrible. Discusting. Stupid. Discusting.",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "It was kind of boring actually. . .",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "At first I thought it's going to be very sinister, but... Seems like I have lost all humane feelings...",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "While I understand that many people hate this movie because it really is just a gross disgusting filthy thing but it is beautifully shot, great angles. The writing is so bad I actually laughed through the whole thing. It is so bad it's good. And it might be because I went into it not expecting much because they really go out and tell you what it's about the second you hear people sown anus to mouth. This movie is a must watch as it needs to be seen to believe.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "By far the worst movie of all time.",
            "review_date": "2012-07-09",
            "source": "rt"
        },
        {
            "content": "Pretty disgusting, but interesting none-the-less.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is a ground-breaking film that pushes the limits of the grotesque and challenges the viewer to enjoy such a nonsensical plot. The film was not bad, but it was not great. It had sort of a Hostel type feeling to it, and it tried to keep you on the edge of your seat, which is some cases it succeeded, but in other it fell short. All together this film tried to hard to gross you out and shock you, and in doing so it overwhelmed everything else. Overall I give the film a 2.5 out of 5 because the story itself was exceedingly average while everything else blew past the limits of film.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "I can't unsee this. I still say the film makers thought of the grossest thing the possibly could and then tried to construct a story around it. It doesn't work. What you remember this for is not what you should remember a film for...",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "I had heard so many gruesome things about this movie but it actually wasn't hard to watch. It was disturbing but I really felt like I was watching a new age 70s type horror movie. I was convinced that this was a remake but to my surprise their are still 70s brains lingering around in the cinema. I want more of these types of films.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "It had alot of potential to be a better movie.",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "Sometimes, in the heat of the moment, its okay to go ass to mouth. But seriously this was just bad.",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "I do not have a week stomach. Movies do not make me feel sick. I've sat thru every saw movie without flinching. But this made me sick to my stomach. Props for being the most sick and demented movie obviously created by a complete lunatic.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Tom Six brings sadism to a different level altogether here. It's no frills from the beginning, and that's just as well considering Six is less interested in narrative development and more devoted to exploring the audience's threshold for witnessing pain.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Putrid, vile, and made me want to vomit. I am unable to even appreciate this film as a horror film due to the fact that Human Centipede is just sheer revolting. This is not to mention the fact that I could sum up the storyline in one short  and not so sweet sentence.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "Fucked up movie. Wasn't even CLOSE to good.",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is full of \"why's\" and precariously short on answers.  Why does Heiter want to create a single being?  Why do the two girls who fall into his trap exhibit all the intelligence of a box of rocks?  Why does the person in \"first position\" go on his monologue near the end of the picture?  Why does Heiter get such a boner over torturing people?  Why does he allow them the decency of keeping their genitals covered if he gets off on being sadistic?  See, if The Human Centipede actually answered any of these questions, the mythology around the picture would be lost.  Instead, by not answering and being as grotesque as it can, THC falls below most other horror/thrillers films.  The big bad has no articulated reason for being the big bad, aside from the generic \"because.\"  The plot is flimsy (where do you go after the humans are connected?), the actual story stretched beyond its breaking point and the acting-aside from Laser-non-existent.  Cliched and entirely too concerned with grossing out the audience, give me Saw any day.  At least Jigsaw knew why he did what he did.",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "one star simply for the concept.",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "One of the sickest and most disturbing movies ever made. Very thrilling but also estranging to the mind.",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "I watched this movie with some friends, not expecting it to be good. All we expected was something shocking. It was indeed shocking, but not to the degree that we had anticipated. I do not mean this as an insult, quite the contrary. Considering the disturbing subject matter, very little is actually seen. There are some parts that sort of make you cringe, but they are few and far between. The movie is actually rather well-formulated as a horror film, and Dieter Laser's portrayal of Dr. Heiter was actually quite creepy. Is this the type of horror film I would watch on a regular basis? No, but it really isn't all that bad. Actually, in terms of what is seen, this movie isn't as graphic as the Saw sequels, Hostel, High Tension, or even The Devil's Rejects. The Human Centipede, despite what you may think, was not a total waste of a movie.",
            "review_date": "2012-06-25",
            "source": "rt"
        },
        {
            "content": "Though a very strange and twisted story, the film is on par with others of the genre. No big surprises, but suspense keeps you entertained. Nothing over the top in terms of excessive gore and violence; it is pretty much what I expected.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "If you take away the disgusting grotesque gut twisting parts then it's a good psychological horror movie. I was completely shocked and couldn't even believe how someone could think of a movie so cruel. I got sick after watching this movie it's grotesque genius just isn't for me.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Funny to watch when drunk with friends, but the film itself is shit ... pun intended",
            "review_date": "2012-06-21",
            "source": "rt"
        },
        {
            "content": "What a fucked up film",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "This had the potential to be a modern horror classic. The concept is just horrific. Unfortunately, so is the film.",
            "review_date": "2012-06-19",
            "source": "rt"
        },
        {
            "content": "The movie made me scream, cringe and close my eyes. I consider that a job well done for a horror movie. Half of me loved it, half of me hated it.",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "In general, I have a serious problem with gross. I covered my eyes during certain scenes in the Saw series of films, fast forwarded through the worst Jackass segments... That sort of thing.  I was fully prepared to react similarly at Human Centipede... and I would have... Except for the fact that this film's concept is so totally wrong, so completely disturbing that I simply could not... look... away.  Many times when watching a movie or television show, I've found myself asking, \"Who thought of that?\" During this movie I thought the same thing... Out of genuine concern. \nCinematically? Beautiful scene work, great use of space and shadows... Creepy as all get out. And the main actor? The doctor? Genius!",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyable crap.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "Totally fucking mad!!! Almost vomited the first time i saw this.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "I like controverse movies. They make me feel deliciously amibivalent about them. This movie is quite challenging, from so many points of view. But it surely lingers within your memory and makes you wonder about the human psyche and it's 'far beyond every definition of dark' corners. I heart the sequel is unimaginable worse. I can't wait to see it. :)",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "why watch the movie when you can live it by sewing your mouth to some asian guy's asshole",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "Once you get past the gross premise and the very good performance from Dieter Laser as the mad scientist, there's not a lot to it, really. Not as gross as you'd think, particularly if you came into it knowing the premise and let your mind wander about the possibilities...",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "despite the concept, i found it boring.",
            "review_date": "2012-06-11",
            "source": "rt"
        },
        {
            "content": "This is the sickest, most twisted film I have ever seen. Do not watch it as you will find it hard to get the twisted ideas out your head forever! The only good thing about the film is the bit where the horrible bastard of a scientist got shot in the head. DO NOT WATCH THIS FILM! WORST FILM OF ALL TIME!!!!!",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "Great idea but not very well carried out. Poor acting. Herr Laser is suitably camp and creepy as the crazed surgeon who misses his 3 headed dog!",
            "review_date": "2012-06-05",
            "source": "rt"
        },
        {
            "content": "Dieter Laser makes the whole film, otherwise, just completely boring.",
            "review_date": "2012-06-05",
            "source": "rt"
        },
        {
            "content": "This movie is so incredibly awful on so many levels. At first it's just funny how bad it is. Neither of the female actresses could handle dialogue. They were just really good at crying. The story is just... I mean I knew what I was getting into, but I thought it would have some redeeming qualities, but it just swung for the fences with disturbing tastelessness. The crazy doctor was the only one I wanted to watch because that actor was really scary. Other than that... Ugh. Train wreck. [1/5 STARS] [060212]",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "the acting was horrible on the girls part and overall the movie made me cringe..",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "Wow, had to give it three stars for the original story and the insanely disturbing villain! Can't give it the other 2 stars because its just too messed up. Cool ending though.",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "After discussing this with the neighbors we watched it. My time could have been much better spent. At least I multitasked or I would have just walked away. Not cheesy fun, just dumb.",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "When this movie came out evrybody said the movie suckd I kinda liked it it wasn't disturbing as the 2nd but it was disturbing. The disturbing part was who in this right mind would do this. Its good",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "I finally sat down and watched this and what can I say? It's just like what people have said it was like. If I didn't know so much about what was going to happen I wonder how much different I would be feeling now. I don't very much different. It is what it is and I think me giving it 2 out of 5 is rather generous.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "Sadistic. Unique. Hard to watch at times.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "This has to be the most disgusting and horrifying, in fact terrifying, movie I have ever watched. It is not scary in the traditional horror film way, but more in the 'Dear God, I would rather die than have that happen to me' way. The Human Centipede pretty much pushes the boundaries of just how much gross you can take in one sitting. It will definitely not be to everyones tastes, it was not exactly a show stopper for me, but it will certainly leave an exceedingly disturbed memory in my brain. Not for the squeamish!",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "After hearing so much about The Human Centipede: First Sequence, I decided to watch it and see what the fuss is all about. I've heard that it's quite disturbing and it's one of the most scariest and most sickening movies ever to have been made and I have to say, I've seen worse. There's no denying that The Human Centipede: First Sequence's idea is a tad sickening, what with the crazy doctor and the experiments he does but other than that, but it doesn't show on screen. It's the classic cliché horror story of two women who have trouble when their car breaks down and so knocks on a stranger's door to make a phone call and they're drugged and knocked out. They wake up only to find this stranger is a crazy surgeon who dreams of creating creatures, he's used three Rottweilers and wants to move a step up by using humans. The plot is short and very stretched, even for a movie lasting just over the ninety-minute mark. As soon as you get past thirty minutes, it becomes rather tedious and quite slow from then on. There's not much to this movie except for the reputation it has of being a sick and twisted movie and, as I have said above, there's worse movies out there than this. The Human Centipede: First Sequence grabbed your attention at first with the first scene of the doctor kidnapping a truck driver but as soon as the two women enter the doctor's house, that was when your attention slowly started to fade and from then on, the movie started to get a little boring and even repetitive at times.\r\n\r\nThe acting is below mediocre. Dieter Laser was average as the crazed Doctor Heiter and there were a couple of good moments from him but his performance wasn't enough to save this movie from being boring. Ashley C. Williams, Ashlynn Yennie and Akihiro Kitamura, who played the three captives, were quite bad and they weren't convincing, especially before they went to the house. The writing was terrible for the characters considering you didn't care what happened to them. The two American girls were bad at acting and unconvincing of their characters. The quality of acting in this movie is something I would expect in a no-budget movie. The direction was okay but the writing was bad considering there's almost twenty minutes of unnecessary scenes  in the movie that you could easily cut out and you wouldn't miss anything. Director and writer Tom Six did create something that has quite a scary and some original thought, I'll give him that, but alas, it was the thought itself that was the only thing scary. Unfortunately, The Human Centipede: First Sequence is quite a disappointment and is not scary at all as yet again, following the trend of horror movies of today, it's in the gross-out department rather than the scare department. So, it's gross which means plenty of blood, guts and gore, right? Wrong! There's hardly any of that either. I've also heard that it's quite gory and very violent but it's not exactly that either. The violence, maybe, but it's hardly gory . The main problem with The Human Centipede: First Sequence is that it's ridiculous. Okay, the plot does sound like it was going to be completely bonkers from the beginning but it gets even more so later on in the movie and not in a good way. The idea isn't really very original except for the obvious but if you take that away, all it really is is a scientist who wants to create creatures and there's movies like that everywhere.\r\n\r\nThere's honestly nothing scary about The Human Centipede: First Sequence, it's just a gross-you-out movie that is quite disgusting. It doesn't make you jump and you won't lose any sleep over it but it will most likely gross you out, which is quite sad because you could see the potential of this being one of the scariest movies of today. True that the idea of a mad doctor creating creatures from humans by sewing them together in a vile way is quite a scary thought but the movie itself is not scary and is more disturbing with a couple of violent scenes. I think The Human Centipede: First Sequence would have been a major improvement if it was a short film, making it ninety minutes long stretched the story and plot and you could see where they made some scenes longer than they should have been because of that. I would recommend this to anybody who likes gross-out horror movies but if you're looking for something that will have you scared, this isn't the one for you. It's neither good nor bad but it's something that I couldn't watch again. This isn't because it's disgusting but because I wouldn't call it one of those movies you could watch again in time, mainly because it's too long and some of the scenes drag as well as the obvious. I thought this was enough but Tom Six has now revealed there is a sequel in the works which will be ready for 2011 and is supposed to be more disgusting than this. I didn't really think this needs a sequel, I see it being pointless but I'll wait until I've seen it. I would recommend you watch something else other than this but if you're curious about it, rent it.",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "It's a well made movie with an original concept and an interesting evil madman, too bad he doesn't have any backstory it would've made for a better villian. Oh well the film is disgusting and horrible just like it promised.",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "Interesting concept, nothing I have quite seen or heard of before.  Some of the torturous operations I had to turn my head.  Almost like a train wreck, I wanted to turn it off at times, but couldn't.  I just had to see what was coming next.  That was enough for me to give it an average rating.",
            "review_date": "2012-05-22",
            "source": "rt"
        },
        {
            "content": "This movie is like a car wreck.  I just had to take a look.  Very disturbing as expected.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Con esta pelÃ­cula te pasa lo mismo que cuando vez un perro pisado en la autopista, sabes que es malo y asqueroso pero no puedes dejar de verlo. Mucha gente dice que el argumento es absurdo, pero no lo es tambiÃ (C)n un muÃ±eco empuÃ±ando un cuchillo de carnicero o gente grabando muebles que se mueven en sus casas. VÃ (C)anla y se reirÃ¡n y les darÃ¡n ganas de vomitar a la vez.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "this film has guts!!! hollywood films wished the could make and produce films like this",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "this film is perfect for someone who enjoys sadistic mad scientist style torture. However, if you are willing to look past the gore and madness, the sub-plot and the context of the film is interesting to look into. I agree that this film is much more entertaining to discuss rather than to actually watch.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "Can't hardly wait the full sequence.",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Weird but pretty hood :)",
            "review_date": "2012-05-14",
            "source": "rt"
        },
        {
            "content": "There's a potentially interesting body horror concept at the heart of it, but no, let's just leer over young women getting tortured.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "I honestly donâ(TM)t see why everybody is grossed out. Yes, the premise is disgusting, but beyond that, is the execution any horrifying? The quick answer, is no. Itâ(TM)s a tad generic, and, dare I say it, kind ofâ¦ hilarious. Yes, hilarious, mostly done because of a couple elements. The first is the doctor, who is so ridiculously camp, it is actually really funny. The second is how unbelievably dumb all of the people in the movie are, and it makes for some of the stupidest decisions and trains of logic ever put on film. And the third is the subtitlesâ¦ oh my God, the subtitles. It. Is. Hilarious. So, really, I like this movieâ¦ so then why the low rating? Because it tried to be horror. Itâ(TM)s not like The Room, where it almost seems like they all knew it was going to be bad, this actually tried. When you try one thing and fail, it is a bad movie in that right. In another right, it could work really well, but there was thought (and I use that term very loosely) put into this. If there is one thing the film does right though is that the doctor, while camp, does genuinely seem insane. But yeah, it is not horrifying or disgusting at all; at least not to me, anyway, and winds up being a hilarious, bordering sit-com territory, film at some points.",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "The story is about two American female tourists who get stuck in a road trip across Europe as their car tyre gets punctured. they come across a house where a retired first-class surgeon lives and is planning the most sadistic horrifying surgical experiment yet to create a centipede-like test subject in human form by joining them from mouth-to-anus and then taking out their knee-cap ligaments so that they would only crawl. The surgeon kidnaps a third tourist this time a man for the front part of the centipede and is ready for his surgery. Two detectives come into his house to believe that something fishy is going on as they figured on people are missing and they arrive into his house. When they find out that he is guilty of those disappearances and one of them spots the experiment, He kills the surgeon before the surgeon kills them both. Meanwhile for the human centipede, the front body suicides believing that this is his punishment for living a selfish life and the back dies naturally as she was unable to cope with the experiment leaving the middle one alone. All of  this movie's ideas were unique, and it's one of the only films I can call it original without without cliche-ing the movie or my speech so much. If you want so see good modern horror this is a good example. The Human Centipede gets a good 10/10.",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "ok,this movie was never going to win any oscars...but if this is the genre you like,then i think you will think it's an ok movie...a bit on the sick side,but i have to say,i can't recall any other movie where  the storyline is to join 3 humans together from mouth to anus!! so 10/10 for originality for me. The doctor is one sick sick sick man!!!",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "this movie was more disappointing in the fact that it wasn't nearly as gruseome and grotesque as I thought it would be.  Well the premise is grotesque, the movie isn't as disgusting as I thought it should have been.  It was quite tame compared to what the hype had it out to be.  Why anyone would think up this crap or even produce, direct, or star in it is beyond me.  the only reason why I am giving it 1/2 star is because it kept my interest long enough to finish watching it.  It's a pretty pointless movie.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "As disgusting and hard-to-sit-through this movie was, I found it strangely entertaining. Yes, the acting is very bad but the menacing Dr. Heiter proved to be particularly creepy and just pure insane. I think if the premise wasn't so original, this movie would be terrible. Surgically connecting three people from end to end. Who else has thought of that? Even though it's painfully disgusting, that's what makes this movie what it is. You really can't compare The Human Centipede to anything else because it's probably the nastiest concept for a movie ever made, and I give Tom Six credit for that.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "This was completely rubbish! I heard so many good things about it, being disgustingly gory and stuff, but I managed to eat my dinner whilst watching this and thought the Saw films were way gorier than this, what a let down!",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "Twizzzted!...but fun.  ; )",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "Wow! Whoa! Pleasingly disturbing! Gruesome! Loved it. Can't wait until I watch the 2md one",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "Ahh, the human centipede...\n\nI actually found this movie to be rather interesting, and I definetely loved the idea of this.\n\nIf you like Martyrs, or films very similar to it, you should check this one out. It's definetely a cult classic.",
            "review_date": "2012-04-30",
            "source": "rt"
        },
        {
            "content": "If you had a bad churrizo and need to puke but just can't quite bring it up on your own, this film will give your stomach the boost it needs. It's also kinda good. Deiter Laser is fantastic.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "This was a damn fine film.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "Such a shit film, could point out so many things that didnt even make sense!",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "Coming from someone that has watched hundreds of horror movies from the 1980s to present day I must say this movie was downright disturbing and grotesque.  Some of the scenes don't really suprise me being that the director is Dutch and I guess the culture of Europe is different.  Distasteful in so many ways.",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Ya what in gods name was this wow very much disturbing for sure and sick for sure I felt alittle sick watching this I haven't seen anything like this before I telll ya that wow is all I can say",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "Was dared to watch this movie, the repulsiveness of this movie is probably what intrigued me most",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "Ok, so the story is really stupid, but the comedy and shock value makes this a cult classic! I know it's trying to be a Japanese horror movie, but the acting is pretty bad.  Still, it will keep you talking about it for weeks!",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "One trick pony. Admittedly an interesting trick and one that got us all talking but yeah the characters are thin and the plot goes nowhere interesting.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "This movie will be stuck with me for my entire life. The horrible images are impossible to forget.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "Thought it would be much worse than it was. Surprisingly caught my attention and really wanted to see them get out alive somehow, but this film was nothing special.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "One thing I can say about \"The Human Centipede (First Sequence) \" is that it made me feel guilty to use the restroom for about a week. Another thing I can say about it is that I will NEVER watch it again, because I wasted 1.5 hrs of my life the first time around. Going on to the sequel is also completely out of the question.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "Seriously Disturbing",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "It surely is like nothing you have ever seen before. The story is grotesque & the visuals are hard to take in. The acting & dialogue is sub-par at best. For a moment, you feel a sense of artistic gloss over the film but ultimately it's dull & boring. Mad scientist? Torture Porn? Tom Six is trying to channel David Cronenberg but ends up just making an awkward horror film that doesn't execute where it's supposed to.",
            "review_date": "2012-04-20",
            "source": "rt"
        },
        {
            "content": "This movie was an absolute dumpster fire. The Saw movies at least had a little bit of tact. This one is just a shabby attempt at the grouse factor. Horror movies used to have standards. What the hell happened?",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "loved the sick idea to it, but it's an awfully boring movie.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "Very hard to watch, but a pretty good horror film all in all.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "Despite the very gruesome concept and idea, this movie was boring and not thrilling at all. Even the shock gore was about Saw level and, while it did disturb me, it was a Ho-hum horror compared to other \"torture\" horror films.",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "Sick and very twisted. Quite disturbing but good if you do like a thriller.",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "A pretty dyer film that had my gag reflects inmotion!! A pretty horrid concept but other then that, it doesn't set itself apart from other horrors! Although i want to check out the new one!\n\n17/04/2012",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "After watching this movie I can safely say that Tom six the director just wanted to make money by creating a movie which many people will think is sick so They will go watch it But the movie is not even sick it's just the idea that's sick. The movie has no plot whatsoever just a mad doctor doing an experiment on 3 ppl. This movie is also very boring and the director has a sick mind that's all. I have no idea why critics give this a 50 percent when they give action movies which have okay stories very low ratings. Losing faith in critics these days.",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "worst movie ever. it doesn't even make sence since a centipead has 100 legs and them kneeling would need a total of 25 people not 3! and its so gross",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "people are just sick. how do you think this shit up?",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "Crazy idea but not the best acting. A good one time watch.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Really gross. I was curious about this film and so I gave it a shot. That's really the only reason I'd recommend it to anyone. Besides that, the acting is dreadful, the writing is weak, and nothing happens except naked people screaming and crying.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Awful, unintentionally funny, but very watchable. It's a rite of passage. You don't want to miss out.",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Really messed up but still really awesome!",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "The Award for Most Fncked Up Horror Flick goes to The Human Centipede hands down....",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "Decent horror movie. I really like how Mr. Six fools the spectators into thinking they are about to watch a B rated slasher movie. Cinema is meant to provoque reactions and this film delivers in that specific aspect. Not for weak stomachs though.",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "This movie is beyond fucked up...not for all people",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "This movie will give you nightmares!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "Just.... Asquerosoooooooooooo!!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "This movie was awful. I would imagine it was primarily because of the disgusting plot, and perhaps through that aspect there was some brilliance, but I was just not happy with it. Dieter Laser reminded me of Lance Heriksen, but evil and twisted. I could not believe the things they showed in this movie. If you are looking to be completely grossed out, watch this, otherwise, never, never, never watch this movie. Oh, it gets better though...I watched the sequel...",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "You gotta take it for what it is. I was pleasantly surprised that this movie even had a  budget. Extremely well shot and great special effects. I found myself saying \"What the fuck!\" while laughing every couple of seconds. Besides the plot being as fucked up as it is, it's the fact that the movie takes itself so seriously that made it funny to me. For me, it's a \"view one time only\" type of movie. Watch it once and....yeah. No real need for repeat viewings.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "It is a truly horrifying and plausible concept but I feel like this idea sustains the film more than the actual story.",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "Everyone who thinks this is the dogshit at the bottom of the barrel of awful movies is just being overly reactionary for whatever reason. At the end of the day this film has millions of people testifying that this is the most gross film they have ever seen. They think it's because of the mindlessly horrible concept of 3 people being sown together. No it isn't. Think about it: \"3 people sown together\"; anyone who says that's the most gross thing ever is just lying. Or, they're saying that because the director successfully gets them to think that way. The film leading up to the surgery is basically a decent horror film. But after the surgery, the director thought he could just show the human centipede coping with everyday life for the rest of the film (which mainly involved crying), which became pretty boring fairly quickly.",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "VIOLENCE & GORE: 7/10 Creepiness, chases, some frightening images and  violence.  Quite a lot of graphical/bloody scenes.   SEX & NUDITY: 2/10 No sex or nudity, just some sexual references.   LANGUAGE & PROFANITY: 8/10 High profanity.   AGE: 15+",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "'The Human Centipede' is disgusting, stupid and just down right gross torture porn... right I already said disgusting. However, I have seen worse and of course I've seen better. I did want to know how the three victims played by Ashley Williams, Ashlynn Yenni and Akihiro Kitamura would get out of this predicament. And the ending is quite frankly, fucked up... the way a horror film should be. Thus, I am forced to give it 2.5 Ball Point Pens. So says the geek.",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "Yeah, it's gross, but I actually thought it was gonna go further. If you're going to base an entire movie off of one disgusting/insane idea (sewing people up ass to mouth) then I expect it really to deliver on the outrageousness. But aside from all that it's really just not a good movie.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "I don't even know why I gave it a half star..",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "One idea with a movie created to enable it. Frankly I was disappointed at how little screen time the creature had or was spent on its creation scenes. Two grim scenes are the pay off for your time; 15minutes of material in and hour and a half of drawn-out nothingness was a lot to ask. If more attention to the plot and characters had been given it might have raised its head above the initial shock value but it just doesn't. Even the cover shot is a Psycho rip-off. Worth a look to say you've seen it but certainly no rewatch value at all.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "While the concept is shocking, dont expect gobs of gore or you will be disappointed ! This is more of a psychological thriller. Dieter Laser is spot on as the demented doctor. Lots of moaning and screaming. Its a test a patience to sit through, but major kudos on materializing the idea. I just would have done it differently.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "The Human Centipede is a prime example of the midnight exploitation films  that were made famous in the 1970s. A story about a mad doctor who connects three human beings together to form one  digestive system (just use your imagination) is as disturbing as it sounds. The actors are amateurish and the story just as disturbing as it sounds but it seems like its focus is more on shock value and less on substance which was fine in the 70s but in today's cinema market just doesn't translate.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "The Human Centipede succeeds where most horror films fail -- it produces a sense of utter despair.",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "this movie trully sucks..",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "Original film that keeps you interested. However, I find it funny subtitles are not needed for this film even though it's a third in German and a third in Japanese. Guess dialogue really was not neasacey for 2/3rds of the film huh.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "This is a stunning work of art. Never have I had such a wonderful, uplifting, breathtaking experience at the movies. The film's writer-director, Tom Six, leaps directly to the forefront of world cinema with this masterpiece. Years from now, when people list the great geniuses of film, they will name Griffith, Chaplin, Keaton, Welles, Hitchcock, Kubrick, Kurosawa, Fellini, Bergman, and Tom Six.\n\nThe story, adapted from the novel by Henry James, follows the life lessons learned by two young American girls travelling in Europe, where they encounter a handsome and mysterious but brooding surgeon. The deep conversations and meditations on love, art, and philosophy that ensue are stunning.\n\nTom Six demonstrates that he is a master of subtlety and restraint with his impeccably tasteful direction. The soundtrack by John Williams adds almost unfathomable layers of deep emotion to the already incredibly involving and poignant scenes. Henry James would be so proud of the sensitive and literate work Six put into adapting the screenplay from his novel. This is truly cinema at its finest and most artistic.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Took me a long time to see this. Yes, certain movie ideas make me squeamish, even me, Surprisingly not as graphic as I though, even in the famous \"feed her\" sequence. Has corny sections that make you slap your head, and makes you want to grab the characters by the throat. Does have genuine moments of horror for the characters involved, especially the middle part. If you know this movie, you know what I mean by the middle part. That character you feel genuine pity for. If a director can conjure up that emotion, guess he deserves a little cred. What is frustrating, though, is how stupid he wrote her that put her in that situation. By the way, if you have a chance to escape, leave your friend. Sound mean? Trust me, see the movie, THEN judge me. Getting to the cops insures your survival a lot more. This is another \"not for everyone\" movie...",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "One of the few horror films to truly disturb and disgust me.  I have to give it a lot of credit for this because I am not easily affected.  On the one hand, it's not a very well-made film.  On the other hand, it is.  It's altogether a different kind of beast and one that you have to be incredibly prepared and open-minded to see.  It will stay with you for days after seeing it.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "I'm not really sure what the big deal is. It's not really all that disgusting and it's not a completely terrible movie. Makes me think of something Eli Roth would've directed 10 years ago. People have overreacted.",
            "review_date": "2012-03-31",
            "source": "rt"
        }
    ]
}