{
    "rating": 9.3,
    "release_date": "1984-11-18",
    "num_reviews": 410,
    "genres": [
        "Drama"
    ],
    "summary": "A disheveled man who wanders out of the desert, Travis Henderson (Harry Dean Stanton) seems to have no idea who he is. When a stranger manages to contact his brother, Walt (Dean Stockwell), Travis is awkwardly reunited with his sibling. Travis has been missing for years, and his presence unsettles Walt and his family, which also includes Travis's own son, Hunter (Hunter Carson). Soon Travis must confront his wife, Jane (Nastassja Kinski), and try to put his life back together.",
    "reviews": [
        {
            "content": "Lethargic and unassertive venture into a dreamy Texas with fluorescent lamps giving off a green tint and a display of an unreachable American dream trapped in an old faded picture of an old lot that Travis Henderson could not fulfill or had any tenacity to even hold onto for that matter. All this is accompanied by an extraordinary guitar score. \nHarry Dean Stanton gives a divine performance of an emotionally stunted man, whose experience of heartbreak and dejection might have whiplashed him so far from humanity that it takes up to 30 minutes to even hear him talk for the first time. \nThe movie demands a lot of investment on viewers' part before this story of loss and redemption starts to unwind, but the reward for your time is one of the greatest monologues ever put to film and an ending that is so incredibly bittersweet it will make you ache and smile.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "Una captura increible del dolor de un hombre, con el que se identifican las personas sencibles, crudas y cursis ante la vida.",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "This is one of those films that, without them, cinema or life would be inconceivable. What supports that is his story of search, introspection and reunion, although not necessarily with a happy ending. Its development makes the 145 minutes of footage hardly felt.",
            "review_date": "2023-03-24",
            "source": "rt"
        },
        {
            "content": "Not a lot of dialogue in this movie but when words are spoken they mean something. Heartbreaking beautiful imagery, cinematography and outstanding performances.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "Wim and writers never been to Texas before? Walking 4 years in 100+ degree weather 6 months of year, not realistic.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "The actor's performance is quite good. But it doesn't make up for a very long movie, that is a real slog. This is one of those films that really grips you in the first half, gives you a bunch of questions you want answered, and then by the time the questions are answered in a unsatisfying way, you don't anymore. The 2nd act is so weird, and off the rails and boring that i was begging for this to end. Also he just is so reckless with the child in the 2nd half of the movie, that it undoes all the good rapport/bonding they did earlier in the film, to me at least. \n\nUltimately it's got some really beautiful shots, with a good performance from the actors involved....but the pacing is really rough, and this movie could have easily been an hour shorter, and I still dont think i'd recommend it to anyone. The fact that this movie has such a high score, makes little sense to me.",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "Family reunion.  So this is about a drifter (Harry Dean Stanton) who is wandering the desert of western Texas.  He collapses in a next-to-deserted town, and while the town doctor revives him, the drifter doesn't speak.  With a business card in his pocket being the only lead to go on, the doctor calls the man's brother (Dean Stockwell), who must retrieve his kin who upped and vanished four years ago.  Now I recognize this in name only because it is catchy.  Most people aren't aware that this is a city named Paris in Texas, so the title stands out.  I once again randomized the Letterboxd Top 250 Narrative Feature Films and got yet another one that is readily available on HBO Max, and with the rate that they are cutting their library, I figured that it is probably better to watch their selections sooner rather than later.  I didn't know what to expect out of Paris, Texas, but I am here for it.  I spent most of the beginning of this just trying to figure out what kind of movie I was watching.  It could be more of a modern Western where it is missing the tropes, but the setting is accurate a la Bad Day at Black Rock.  That's not really what this movie is.  For about the entirety of the first act, you have a protagonist who doesn't speak.  It makes it so that the actors playing off Harry Dean Stanton have to do most of the heavy lifting, namely Dean Stockwell.  It's such an odd situation that it slowly pulls you in, and that's when this movie reveals what it's all about.  Paris, Texas is a family drama, and the focus is on this broken man coming to terms with the actions of his past.  It's a drama through and through, and I thought it is very effective.  It is a bit of a slow burn to be sure, and I can see a few people out there being turned off by the pacing.  That never bothered me, and I felt this allowed for the more poignant moments to carry the proper amount of weight.  I do have to touch upon how terrific the cinematography is in this.  I mean yes, it is one thing to encapsulate how big and empty rural Texas can be, but on the other hand, there is some terrific filmmaking happening in tight spaces.  When everything is getting tied up at the end, and you finally get a full grasp on what happened in this man's past, you are in a 4' x 8' room that is split down the middle by a two-way mirror.  It is amazing what they can pull off in such a small space with some hard-hitting monologues.  I quite enjoyed this movie, although I don't know how many rewatches I will get out of it.  I give this an enthusiastic recommendation.",
            "review_date": "2022-09-14",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece.  Director Wim Wenders best film.  Dean Stockwell and Harry Dean Stanton, as brothers, are both excellent, as is Nastassja Kinski.  Very moving script and performances.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "It's a very boring movie with a weak story.",
            "review_date": "2022-07-31",
            "source": "rt"
        },
        {
            "content": "This film feels very like the 70's even thou this came out in the 80's. It's a patient film as it handles the themes of love, family and trauma. I never thought a character could say so much without talking, which Harry Dean Stanton portrayed perfectly. That made his final monologue at the end all the more meaningful.",
            "review_date": "2022-05-26",
            "source": "rt"
        },
        {
            "content": "With beautiful cinematography, contemplative pace, impactful narrative, masterful filmmaking, emotional soundtrack, talented cast, and a career-best lead performance from Harry Dean Stanton, it's a great examination of loneliness and identity, and the most sincere and authentic depiction of American life -- a more impressive achievement considering it's helmed by German filmmaker Wim Wenders -- , as it offers a deft criticism of the American dream and an affectionate homage to American places and people without being too patriotic, making it one of the greatest modern Westerns of all time and the greatest film about America. It's emotional resonance has never been seen before and may never be fully replicated.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "In my all-time Top Ten. Slow and deliberate, but a welcome change, even more so in our ever-increasing short-attention-span world. Magnificent performances, painterly cinematography, and a Ry Cooder soundtrack that itself becomes a main character in this classic Wim Wenders film.",
            "review_date": "2022-02-06",
            "source": "rt"
        },
        {
            "content": "German director Wim Wenders paints Paris, Texas in bold hues of red, white and blue as characters seem to come to terms with their disillusion of the American Dream.  It is a film about the family unit and the fragility of relationships.  It is about hope and despair and obligation and responsibility.  Travis (Harry Dean Stanton) wanders out of the Texas wilderness after disappearing for four years and is reunited with his brother and son.  To say much more would run the risk of spoiling the movie, especially the emotionally devastating final forty minutes.  Paris, Texas is a miracle of filmmaking featuring beautiful cinematography, fine performances, brilliant writing, subdued but effective editing, some ingenious direction (check out the two-shot of Stanton's reflected face super-imposed on his wife's image towards the end), a melancholy score by Ry Cooder, and some emotional scenes that have the staggering impact of a gut-punch.",
            "review_date": "2022-01-04",
            "source": "rt"
        },
        {
            "content": "影片用了相当长的段落，让男女主分别叙述导致出走的那场暴力。隔着一块不透明玻璃，男主说出\"有些事情是不能重现的\"。他把这一切作为过去的事情讲述，说出以后这一切也成为了过去，而这使团圆成为不可能。观众感到痛苦，并不是因为家庭的崩溃，而是由于双方处事的草率。两段路程，两个团队，一个奖品，非典型公路片。",
            "review_date": "2021-12-09",
            "source": "rt"
        },
        {
            "content": "The most melancholic movie most beautifully shot. Many people believe it is or very good or very bad, I am going to choose the middle term, \"Paris, Texas\" is irregular and bland. 5/10",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "I just watched this movie again years after having seen it for the first time. I didn't much care for the main character, but I did like his rapport with his child. I liked the film mostly for its scenic value, the red rock, scenes from the road, the dying Texas towns, and some interesting views in and around Houston. \n\nDo you suppose there was ever a time when an average person could rent a normal hotel room on the 15th floor of a downtown building with dramatic views out over the city? I would have loved to stay in a place like that. I don't think you can get that anymore without paying an arm and a leg for it.",
            "review_date": "2021-09-05",
            "source": "rt"
        },
        {
            "content": "I was recently picking random movies to stream, based on critic and audience reviews. I never made it past the first ten minutes of any of them. All three were idiotic, contrived, and mindless. (No, I won't give the titles).\nSo I decided to re-watch a film that I knew wouldn't insult my intelligence. I came across \"Paris, Texas.\" As good as I remembered it being, I must say, it was better the second time around. \nSo much has been written about this film. It's rightfully on Roger Ebert's Great Movies list. Its running time is about two hours and 20 minutes, but it never seems long. It just grabs you and keeps you watching.\nOf course, Harry Dean Stanton's performance is the main attraction. The man is a marvel, a totally natural actor, and this part is custom made for him. He plays Travis, whom we first see traipsing alone across the Texas desert in a rumpled suit and a red baseball cap. He stumbles into a sun-baked roadside store, looking for water, and passes out. A strange German doctor is summoned to help him. The doctor contacts Travis's brother Walt (Dean Stockwell, in his best movie performance) in Los Angeles. Walt is amazed to hear anything about Travis, who mysteriously disappeared four years before, leaving Walt and his wife Anne (Aurore Clement) to raise his young son Hunter (Hunter Carson). The mother, Jane (Nastassja Kinski) disappeared also. But the three will eventually reunite in the strangest way.\nTravis is near-catatonic and mute in the beginning, but he loosens up when he arrives in L.A. and meets his son, who is now seven years old. No more synopsis is necessary. Let's just say that the ensuing events are incredible, and the final act  includes two of the best scenes in cinema history.\nSam Shepherd's screenplay is perfectly brought to life on the screen by German director Wim Wenders. The silent, barren Texas landscape seems to stretch forever, while Los Angeles is contrasted as a noisy, smog-drenched labyrinth. Ry Cooder's lonely slide guitar is the perfect soundtrack accompaniment. \nI can't think of a movie with better dialogue. I can't think of a movie with better characters. And I can't think of a movie that does a better job of involving us, to the point where it's personal. We get to know these people so well that they seem like friends. \nIt's also interesting to note the film's color symbolism. Red and green are themes, especially red. What they mean is open to interpretation. \nIt's great that we have the ability to stream countless movies today. But so many of them are not memorable, or even worth watching. Thank God for the occasional masterpiece like this one.",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "One of my all time favourites, just absolutely gorgeous in every department and found myself welling up towards the end. One of the best films to look at ever and the acting is top notch.",
            "review_date": "2021-08-17",
            "source": "rt"
        },
        {
            "content": "Visually stunning, Paris, Texas showcases the beautiful glory of the American Southwest while letting drip-out a story of dissociation or abuse or grief or all of the above. Harry Dean Stanton plays Travis, a disheveled man aimlessly wandering the desert. How Travis is even alive is astounding, what happened to him to make him wander the desert is at both the forefront of both viewer's and his brother's (Dean Stockwell) mind. At first, it's difficult to tell if Travis has a disability or is just feeling a little… off. As Travis' layers peel back, the performance shines through even more, and you root for him to find his wife, Jane (Nastassja Kinski) even though maybe he shouldn't considering it was whatever happened with his wife that has caused him to wander Texas for four years! Travis' degeneration not only affected his own life, but that of his son, Hunter (Hunter Carson), whom his brother had taken in as his own. Child actors appearing in films in 1984 make me nervous, but Carson was actually excellently ascended from the typical plot-device to an interesting character. Most notable about the film are the couple of \"peep show\" scenes in a seedy section of Houston. It pulverizes Travis to find Jane working there, but instead of immediately disclosing his identity through the one-way glass, he speaks with his wife — oftentimes turned around in his chair — and we discovered \"what happened\". These scenes were powerful, no doubt — \"I hear your voice all the time. Every man has your voice\" captures Jane's last 4 years — but were also a bit of a letdown given the build-up. Yes, tying Jane to a radiator and Jane setting their trailer on fire still didn't feel like a satisfying pay-off. Nevertheless, Paris, Texas offers gorgeous shots of Southwest desert, the Los Angeles skyline, and a red sun setting over Houston.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "5 stars for cinematography. Beauty filming.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "A man wandering in the desert with melancholy. We don't know who he is or why he is wandering for half the movie. The story slowly unfolds. We find out he has a son he abandoned. We discover even later that he had an extremely hot wife who left him to work at a strip club. It's an interesting movie. But I just couldn't get into it. Not sure why. The acting maybe. Or the editing. Just didn't pull me in.",
            "review_date": "2021-07-03",
            "source": "rt"
        },
        {
            "content": "Combine the directing talent of Wim Wenders, the writing talent of Sam Shepard, the music of Roy Cooder, the cinematography of Robby Mueller, and the acting talents of Nastassja Kinsky and Harry Dean Stanton, and what do you get? One of my favorite movies of all time. I love the fact that Wenders never rushes things. Sure, the result may seem slow, but the pace is perfect, given the topic. The soundtrack and cinematography are also keys to this movie's success. If you start to watch it and consider stopping because of the pace, remember this: the final scene is well worth the time spent on the rest of this magnificent film.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "Watched on Criterion \n\n8.5/10",
            "review_date": "2021-04-14",
            "source": "rt"
        },
        {
            "content": "Very aesthetically pleasing.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "The movie has a European expressionist approach about aspects of Americana life, with the European guessing most of the time as he has little true insight.  Seems he was making it up on the fly.\n\nRegardless of the great reviews, I thought it was an over-reach that required imagination to make it work at a basic level. Long-winded, sleepy pace, and the journey was not worth the entry fee. Give it a miss because you'll regret having wasted 2hrs plus of your life.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "To date, this is my favorite movie of all time.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "After the first hour I wasn't sure where it was heading but it was just some good scene setting for the rest of the second act which softly, slowly and then powerfully comes to life with an emotional punch. A near perfect Western for pacing, mood and soundtrack. That scene in the booth is up there amongst the best I've ever seen. It's a brilliant piece of cinema.",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "Simple yet effective filmmaking. Paris, Texas explores the universal moments and emotions that make us human. It vividly captures the portrait of Travis Henderson (Harry Dean Stanton) and his struggles internally and externally, a remarkable feat considering the sparse action and dialogue (the latter, more so at the beginning.) What makes Paris, Texas stand out are the bookends. The first and last 30 minutes evoke the strongest reaction by tapping into the collective human experience. For what it's worth, this rating is the highest of high 7s.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "A so-so movie. Maybe as I watch more older movies, I'll appreciate them more.  For now they seem bland. Yet, I like some slow movies, or movies that take the mundane and make them beautiful or interesting.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "I felt like I was growing and relearning how to live right alongside this film. That's some powerful shit I can't say often. ‘Paris' is tender, patient, cathartic, poignant, intimate - quick, I need some more adjectives to capture this. Damn near an unmitigated home run, ‘Paris' offers up emotions I've rarely tapped through a film before. The emotional magnitude does leave a few narrative stones unturned. This may be my 2020 nitpick googles speaking, but the lone momentary distraction is the maid whose single purpose is dedicatedly teaching the white protagonist how to get his groove back. Nonetheless, ‘Paris, Texas' understands both the inherent loneliness of the human condition and its eternal power to heal. It is intoxicating and unassuming in its depth, and the organic manner in which it evolves over its runtime is its greatest asset. Thank you, Harry Dean Stanton.",
            "review_date": "2020-10-11",
            "source": "rt"
        },
        {
            "content": "Always great to see European films of this quality!",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "A Timeless classic! Great acting by the whole cast! I cant belive its 36 years since i first saw it in the cinema!",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "\"Every man has your voice.\"\n\n‘Paris, Texas' is one of the best art-house westerns out there. A slow-burn two-and-a-half-hour movie that kept my eyes locked onto the screen. How a movie can be so warm, and gentle hit the hardest in emotions.\n\nThe movie is long and slow paced, so of course it's not going to be for everyone, but then again, every movie isn't for everyone. However, movies like these are a special type of breed that cannot be duplicated so easily if you tried.\n\nWatching this movie without knowing a single thing about it added so many layers of mystery that perfectly placed me in the main characters head. Travis Henderson (Harry Dean Stanton), once a family man, but now a silent drifter walking aimless in the Texas desert while having amnesia on certain parts of his life. He has become a worn-out and raggy version of himself, which leaves the audience wondering why. His brother Walt (Dean Stockwell) finds him and helps to recollect his memories, while also reuniting him to his son, sister in-law, and eventually his wife. So as Travis is retracing his steps and rediscovering forgotten memories, you are with him all the way until the end.\n\nHarry Dean Stanton is excellent as Travis, a man fallen into a black hole of emotions. He may not be a great father or husband, but tries his best to mend the wounds he caused in the past and to leave a personal impact on his son Hunter. Stanton subtle approach of bringing a character like Travis to life is truly extraordinary, because Stanton draws more into Travis gentleness while also displaying the pain behind his kind smile. There were many instances in the movie that I thought that if any other actor played the role, they would have easily over done it for dramatic effect, but Stanton deadpan and yet natural delivery made certain scenes more effective.\n\nA solid child performance from Hunter Carson, who plays Travis's son who is also named Hunter. The scenes between the two were the sweetest elements in the movie and brought a warm smile to my face.\n\nNatassja Kinski plays Travis's wife, who does not appear until the third act, but when she does, she is instantly hypnotic to watch. An actress of pure beauty and raw talent. Her quiet and soft-spoken voice made her presence even more remarkable, because how something so simple can leave the biggest impact. She spends most of her scenes in one room, and yet I totally bought the chemistry between Stanton and Kinski, which is impressive considering the two are never in the same room together and share only two scenes in the movie. All the emotions from Kinski comes from her reaction and demeanour, so with every flicker of her eye and long pauses communicates so much of her emotional state that a million words could not. It's unbelievable.\n\nThe conversation scene towards the end is one of the finest achievements in cinema. Painful and revealing that even if you don't cry, you will think about crying. It is as moving as anything I think I have ever seen. I'm getting teary eyes just thinking about it.\n\nI find it fascinating how a German director like Wim Wenders approaches the portrayal of family life in America, because Wender leans more towards the sad elements in order to destroy the illusion of the perfect family life. It is not all doom and gloom, but it is not all sunshine and rainbows too, just real enough for the audience to attach themselves to the characters and story.\n\nThe score from Ry Cooder is fantastic and plays perfectly in sync with the Texas setting. The music also represents that dry, lonesome, and reminiscent of the past. It is the type of music that makes you feel sad, but the weird kind of sadness that you enjoy.\n\nPerhaps the biggest standout in the whole movie is Robby Müller's cinematography. Everything from the breathtaking landscapes of the Texas desert where the scorching heat cannot stale the colours of the environment, while Müller shows us a distant land stretching further away. The other is light and colour that is drenched in vibrant neon. The whole movie has beautiful visuals that helps create the overall mood of the movie while also giving it a foreign feel. It has some of my favourite shots ever.\n\nOverall rating: A devastating, but hypnotic movie that stirs emotion in me like no other. An absolute masterpiece.",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "The screenplay delivers a heartbreaking scenario and it manages to take fantastic sequences with an astonishing twist.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "The colors and the silences of this work made me feel something substantially true about the human condition that I cannot explain.",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "The movie with the most beautiful hug.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "If I could give six stars out of five to Wim Wanders masterpiece I definitely would. This is maybe the most beautiful movie made during the 1980's thanks to the powerful performances, the beautiful art imagery and the compelling storytelling. When a movie is capable to make us feel sympathy for the characters, it is because the storyteller was able to deepen effectively into their essence in order to bring it to the screen. Such quality can only be achieved by a few filmmakers.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "This is an amazing, meditative film that uses the elements of mystery very effectively. I'm afraid if I say more, it may ruin that mystery. However, I will say that its certainly worth watching and is an unexpectedly great film.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a 1984 road movie directed by Wim Wenders 🍿 \n\nA place for dreams. \nA place for heartbreak. \nA place to pick up the pieces.\n\nIt's ok, but I feel mixed about this one 😉\nI'd recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Beautifully crafted both structually and visually, Paris, Texas manages to convey a journey as sweeping as the Texas plains it explores. (4.5/5)",
            "review_date": "2020-02-28",
            "source": "rt"
        },
        {
            "content": "My sad opinion about this movie is that it's supposed to be so quietly emotional and naturally beautiful that (outside of technical appreciation) it leaves me mostly indifferent.",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Wenders is able to use color as a way of showing emotions, using colours that are not associated with a western to show certain emotion. A beautiful piece of cinematography.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "In order to achieve one star in my reviews, something has to happen in that movie. Anything. But somehow, Paris, Texas manages to stretch a whole lot of nothing out for 2 1/2 hours. And not in the Seinfeld way - in the \"screaming at my TV in sheer agony and boredom because this is a soulless waste of a movie devoid of human emotion or plot of any kind\" way. How anyone can watch this film and think it's one of the greats is beyond me. For 2 1/2 hours it incessantly breaks the first and most important rule of storytelling: Do Not Bore Me. Paris, Texas did absolutely nothing but bore me. It is pretentious, without merit, and a joyless waste of time.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "Absolutely terrific. Possibly one of the greatest movies ever. An unforgetabble piece of american cinema.",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "There are very few movies as brilliant as this one. What would you expect with such a  stellar cast, Wim Wenders directing, and the Pulitzer winning Sam Shepard on the script. Some have complained that it was too slow. That's like complaining that doing the Tango is too slow. The sense of intimacy, love and heartbreak achieved in this film is rare.  It is a Michelangelo of the Cinema art form. Find the time to watch this gem.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "One of the most overrated films I've EVER seen.\nPretentious drivel that goes no one.\nAbsolute dreck. Don't waste your time with this movie.\nTwo hours of my life I'll NEVER get back.\nWhat a piece of ****.",
            "review_date": "2019-12-05",
            "source": "rt"
        },
        {
            "content": "It's a selfish film that seems to believe in the rights of selfish people. It's as though the writer wants to tell us that a child is supposed to be with their real parents no matter what the consequences are. I feel that somebody wants to blame others for messing up their life, and use this film to encompass their own selfish beliefs.",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "Amazing film, my favorite!",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "My favorite movie. Impeccable masterpiece! ",
            "review_date": "2019-09-23",
            "source": "rt"
        },
        {
            "content": "The beauty of film-making and story-telling!",
            "review_date": "2019-09-01",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a beautiful film from critically-acclaimed director Wim Wenders.  It tackles a wide range of themes from family and betrayal, to reunion and tragedy.  It is not a movie for the masses; it is carefully crafted and meticulously plotted to go beyond simply evoking emotion from the audience – it devastates anybody with a heart and soul who would attempt to watch it. Admittedly, it does take a while to start become intriguing, but we are fully invested in Travis by the halfway point of the movie.\n\nOne of the best aspects of Paris, Texas is the brilliant yet subtle performance from its lead actor, Harry Dean Stanton.  In roughly the first twenty minutes of the movie, Stanton is silent and his performance is all body language.  We are introduced to him as he aimlessly walks around fields and barren landscapes somewhere in Texas.  He tries to drink water from a random spigot and is disappointed when nothing comes out, yet he still keeps walking on with unexplained intentions.  News of his appearance at a hospital reaches his brother, Walt, who comes to \"save\" him, and this proves to be a sort of humorous sequence in which Walt talks at Travis while Travis remains silent and mysterious until the story demands him to speak.  Travis becomes more and more talkative gradually throughout the film, and is the most obvious changing feature of his character arc.  This movie is essentially a telling of the re-birth of its protagonist, Travis, and we should not have it any other way.\n\nThe way the plot is structured makes it follow an almost untraditional path.  In the time slot that would normally be considered act one, Paris, Texas seems unsure of where it is going, and this is in part because the characters are unsure of what to do and do not have a set goal in mind. The protagonist, Travis, does not set a plan for himself until about halfway through the movie, and because of this, the second half of Paris, Texas is clearly the better half.\n\nThe dominant theme that appears in this movie is the questioning of what family means and what constitutes a \"true\" family.  Half an hour into the film, it is finally revealed through dialogue between Travis and Walt that Travis used to have a wife and child, and the child, Hunter, is currently being housed and cared for by Walt and his wife Anne, who are the boy's aunt and uncle.  They are extremely attached to Hunter since they have raised him for about half of his life (he is almost 8 in the movie) so it stirs up some controversy when Walt decides to bring Travis home and reintroduce him to his biological son. It does bring out the good in Travis, however, who longs for a connection and feels ashamed when Hunter does not want to walk home with him because \"everybody drives\" and nobody walks anymore. This is clearly an excuse that he really just does not trust his dad.\n\nThe best scenes of the film are clearly in the second half of the movie, but they will not be discussed in order to avoid spoilers. Without giving too much away, it is safe to say that Paris, Texas is a beautiful, emotional journey that deals with the notion of family, and above all, it is a mature movie. Anybody with a heart will appreciate this film, unless the viewer has never experienced heartbreak over family.\n\n9/10\n",
            "review_date": "2019-07-24",
            "source": "rt"
        },
        {
            "content": "Sad & heartwarming. Paced well. Terrific performance from Harry Dean Stanton as expected.  ",
            "review_date": "2019-06-24",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton will always have my deepest respect and admiration, as I consider him one of the greatest actors in the American cinema world. However, he is primarily known for numerous supporting roles in different movies of his career which spanned over 65 years. Paris, Texas is a rare example of the movie where Stanton plays leading role and he made it perfectly. He has been able to show very different emotions on the screen, and watching him in this movie is a delight. I can say a lot of good words about Dean Stockwell's performance as well. The movie is a great story about peculiarities of the relations between child with his actual parents who abandoned him and the family who brought him up. In a sophisticated manner, the genre of road movie in the hands of Wenders gives a glimpse into the path of son and mother to be reunited and gives the fresh start, and drama of the man trying to get over the break-up which made him alien for several years. One the most important part of film is the director's work focusing on striking images and use of colours, especially green colour. Wenders is a great master to work with the sublime and delicate material.",
            "review_date": "2019-04-06",
            "source": "rt"
        },
        {
            "content": "The absolute best movie of the 80s",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "Great story and acting.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "While deceptively simple on the surface, this is a masterful example of screenwriting and storytelling that finds truth and poetry in the mundane and is centered on the kind of quietly nuanced characters that I guess any actor or actress would love to play once in their lives.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "Sorry, dear Mr. Shepard, but this was the Worst movie or play youï¿ 1/2(TM)ve ever been associated with. I mean, how many times is Travis going to pull out that wrinkled photo of Texas dirt? About halfway through I didnï¿ 1/2(TM)t care about any of the characters, and the closing monologues unleashed by Travis and Jane are tedious at best. There is no Power of Redemption, just Boredom. If this film won any awards they should be returned pronto.",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. ",
            "review_date": "2018-09-29",
            "source": "rt"
        },
        {
            "content": "I just watched this again for the first time in 35 years and it still holds up. The story even more so in an era which highlights abuse of women.",
            "review_date": "2018-08-25",
            "source": "rt"
        },
        {
            "content": "A gentle story that nonetheless draws you into empathising with its characters. It pulls off a high-wire act of telling a story that is at once extraordinary and highly relatable. You will be deeply moved by its final scenes.",
            "review_date": "2018-08-20",
            "source": "rt"
        },
        {
            "content": "If there was a camera recording my everyday life, I think the result would be faster and more entertaining than this. The guitar, the desert, a cliche theme, it seems to make it worse, though you may rescue something out of that.",
            "review_date": "2018-07-11",
            "source": "rt"
        },
        {
            "content": "It's a pity that many goes movies goes un-noticed and underrated, but these types of melancholic flops are higher rated. Totally surreal theme and not an iota of pragmatic value. If it would have been categorized as a kids fantasy, that would have done it some good.",
            "review_date": "2018-06-08",
            "source": "rt"
        },
        {
            "content": "Awesome quiet film.  The scene between Stanton & Kinski in the one way mirror booth was priceless, heartbreaking & healing.",
            "review_date": "2018-05-16",
            "source": "rt"
        },
        {
            "content": "A Neo-Western masterpiece, Paris, Texas is a drama of proportions featuring Harry Dean Stanton",
            "review_date": "2018-03-15",
            "source": "rt"
        },
        {
            "content": "Intense and well crafted. Everything works just fine.",
            "review_date": "2018-03-11",
            "source": "rt"
        },
        {
            "content": "One of those movies that draws you into the story and will not let go! I miss movies this good..",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "I'm surprised and pleased to see that so many people liked this movie as well as I did; I'm just a wierdo, not a snob. OK, kind of a snob. You know, part of the elite that composes the \"deep state\", and has no money, that nobody listens to when he whines, and has absolutely no effect on domestic or foreign policy. It's even better than \"My Little Pony: The Movie.\"",
            "review_date": "2018-01-12",
            "source": "rt"
        },
        {
            "content": "You have to be in the mood to watch this. ",
            "review_date": "2018-01-06",
            "source": "rt"
        },
        {
            "content": "An above average road movie following a broken man recovering from a failed romance set against the majestic vistas of the southwestern US.  The musical score by Ry Cooder captures the essence of beauty and melancholy perfectly. This is not the America Hollywood would advertise, this is the America inhabited by millions of forgotten people, who now find a voice in a young German filmmaker.",
            "review_date": "2017-12-26",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "I found this movie a little too slow for my current mood.  I sort of lost interest in the middle, but I stuck with it and the the beginning and end of the story are great.  Harry Dean Stanton was great.  I think another redeeming characteristic is how beautifully this film was shot and the stark landscapes.",
            "review_date": "2017-11-01",
            "source": "rt"
        },
        {
            "content": "Very watchable and undeniably sweet.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "I give this a 99/A+.",
            "review_date": "2017-09-25",
            "source": "rt"
        },
        {
            "content": "After marinating in rage for a solid 2 hours, I feel compelled to write a review to achieve some catharsis completely absent from this bland piece of work. With such high marks across the board, I was expecting to be blown away by this film. Instead, a faux-nostalgic dusty film plodded along the flimsiest of plot lines. The climax, a 45-minute masturbation in the art of pregnant pausing, really only needed 7 minutes to cover the same ground. This film was a complete waste of Stanton's talent.",
            "review_date": "2017-09-20",
            "source": "rt"
        },
        {
            "content": "How folks are mesmerized by this film is truly astonishing - a french-German take on love, loss, & the dry littered effect of human presence in the desert of west Texas. The title should be \"The Abomination of Desolation,\" and then 45-mins cut. Even the deleted scenes run to 25-mins. Eurochick Nastassja Kinski, eminently watchable since \"Cat People,\" as a wayward Texas wild child? Come on ... \n\nThis is film at its least & most minimalist to tell a Shepard story probably best left between the covers of the book - which was the reason for watching this on the day of Shepard's passing. Almost as bad is the soundtrack. By the end you'll want to find a dobro & smash it on your DVD player. The Reviews are misleading, and this opinion from a film buff of many types & genres, foreign & domestic. There's nearly nothing here that isn't a waste of time. Slow & almost goofy in places. Let's take the 8mm footage: It has the requisite cliched scratches & zoomy shakiness. But it's not shot & shown at 18-fps. A German director's sophomore mistake & part of what imparts to 8mm its home movie look - as it's supposed to have here.\n\nThis production is one of those weird films that acquires some kind of cult following among critics & the moon-eyed Burning Man pod people. It's not good - and why it's appraised as such by so many here is a mystery. Even Dennis Hopper was trotted-out to weigh-in in the extra materials; but he didn't seem that enthusiastic either.",
            "review_date": "2017-08-02",
            "source": "rt"
        },
        {
            "content": "4.3/5\n\nIm not sure Paris, Texas is a movie Im gonna watch again, not because its bad, but because the first time experiencing the emotionally deep story of Travis and the way the whole production comes together to squeeze the poetic out of the small things, has no point of comparison.",
            "review_date": "2017-07-03",
            "source": "rt"
        },
        {
            "content": "A heartfelt character study that is truly unique in where the characters end up and what they've done to get there, a very spontaneous film that will surprise and shock you.",
            "review_date": "2017-07-01",
            "source": "rt"
        },
        {
            "content": "Great movie about losing yourself both physically and mentally, and not knowing what to do when times get really tough. It's a movie about the transformation of a particular individual who you think would never get his shit together. It's also a movie about love and friendship and being a loving parent and doing what's right.\n\nAll in all, it was a fantastic movie with a slow pace and a telling story. So warning, this is not for those who crave big action sequences - go watch Transformers.",
            "review_date": "2017-06-02",
            "source": "rt"
        },
        {
            "content": "Visuals of cars on the drylands",
            "review_date": "2017-05-30",
            "source": "rt"
        },
        {
            "content": "This is one of those movies, like Being There, where the genuine disconnection of the lead character and loss of love makes me cry over and over.",
            "review_date": "2017-05-19",
            "source": "rt"
        },
        {
            "content": "Wim Wenders' beautiful tale of love, loss, and sacrifice is my favourite film to date. Its gorgeous cinematography and soundtrack compliment the wonderful performances from not just Harry Dean Stanton and Nastassja Kinski, but the entirety of the cast.\n\nThe film follows Stanton's protagonist, Travis, as he attempts to rebuild his relationship with his son Hunter, and his wife Jane, after mysteriously going missing for years. What ensues is a moving portrait of a man who must ultimately sacrifice his own happiness for that of those he loves.\n\nThis film is a contemporary Western, using the genres features and translating it into a modern-day setting. What we get because of this is both a beautiful look at the American South-West and a poetic journey with a mysterious, flawed protagonist, who ultimately redeems himself, a clear play on the Western genre conventions. It mimics films like Shane and The Searchers through the nature of its lead.\n\nThis film, despite its 150-minute runtime, is incredibly rewarding even after multiple watches. Because it plays on such well-recognised genre features, we know how this film will end. He will take Hunter to Jane, and due to his jealous and manipulative personality, he will leave so that those he loves can live a happy life. Film to me is less about the destination and more about the journey, and for a road movie like Paris, Texas this is perfect. We experience what Travis experiences, we feel his emotions, see the world with him, and are crushed by the finale despite the inevitable nature of it. What rewards us is not the finale, but the road to it. Just describing this masterpiece cannot do full justice to it, it is a must see for lovers of cinema.",
            "review_date": "2017-04-11",
            "source": "rt"
        },
        {
            "content": "Ese monólogo al final... \"I knew these people, these two people. They were in love with each other\"...",
            "review_date": "2017-04-09",
            "source": "rt"
        },
        {
            "content": "Probably the most American movie made by a foreigner. \nConsonance of cinematic perfection from the camera trough the direction to the soundrack.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "Cuando anda perdido buscando su lote baldío los colores del desierto son tan intensos que alcanzan tonos infantiles. Su exilio es voluntario, ha logrado matar los recuerdos de una realidad tortuosa y ahora busca el vacío definitivo, ese pedazo de tierra chuta en Paris, Texas, a partir del cual pueda reiniciar. Eventualmente se resigna a que lo lleven de vuelta pero se niega a soltar los pies del suelo para volar o continuar el viaje en otro vehículo que no sea el que lo recogió. Ahora que ha retomado la realidad, mejor no perderle el hilo rompiendo la continuidad. Mejor no dormir siquiera. Cuando escapa con el muchacho de quien ha dejado de ser padre se siente ya en dominio, lo manda despojarse de consideración por quienes sí se han ganado ser sus padres, lo embarca en un inepto aprendizaje. Los sentimientos son intensos cuando habla con la choca, todo es ahora rojo, rojo el suéter, roja la camisa, rojo el teléfono. A la siguiente entrevista se ilumina de azul mientras a sangre fría cuenta su historia, y el parqueo está verde cuando observa desde la distancia el reencuentro. Los abandona en paz consigo mismo por haberlo desterrado del cuidado de la francesa preciosa y el responsable señor de las vallas para lanzarlo a un futuro incierto. 7/10",
            "review_date": "2016-12-23",
            "source": "rt"
        },
        {
            "content": "Such an artful classic. Nastassja Kinski = amazing.",
            "review_date": "2016-12-13",
            "source": "rt"
        },
        {
            "content": "Wim Wenders crafts a powerful story about pain and resilience that reflects the inner struggle of lost souls.",
            "review_date": "2016-11-13",
            "source": "rt"
        },
        {
            "content": "Directed by lauded German director, Wim Wenders and emotively scored by Ry Cooder, this winner of Palme d'Or at the 1984 Cannes Film Festival is a long-drawn melancholic ode to the immense sense of loss and loneliness of a man in the vast landscapes of desolateness.",
            "review_date": "2016-11-06",
            "source": "rt"
        },
        {
            "content": "Long, slow and seems to last forever.",
            "review_date": "2016-10-25",
            "source": "rt"
        },
        {
            "content": "A work on the mystery of human condition -- why we destroy what we love most dearly in life.",
            "review_date": "2016-09-21",
            "source": "rt"
        },
        {
            "content": "5/5 Paris, Texas is a two hour and twenty-five minute emotional gut punch brought to life by a haunting score, a marvellous performance by Harry Dean Stanton and some of the most stunning cinematography I've ever seen in a film.",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a moving depiction of people struggling to reconnect with each other, a drama that challenges us just as much as it satisfies our emotions.",
            "review_date": "2016-09-09",
            "source": "rt"
        },
        {
            "content": "Supposedly this was both Kurt Cobain and Elliott Smith's favorite movie. As someone who is also an angsty beta male I can see why.\n\nIn contrast to its deeply American aesthetic, which is fantastic, the movie's themes are the antithesis of the unbridled American dream. A man on a quest to lose what he has earned and return what he feels he does not deserve. A very surprising story given that it was made in the middle of a decade of hedonistic materialism.\n\nThe pacing may put some people off as it takes an exceptionally long time to tell a very simple story, but for the most part it worked for me as it gave the sense that this was a small part of a larger chapter of Travis' life. The cinematography also captures some of the best shots of the Southwest I've ever seen, they almost make Texas not seem like a complete cesspool, until the end of the film.\n\nVery nice movie.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "Very charming and strong movie, a rare movie that you would like to have a happy ending.",
            "review_date": "2016-07-13",
            "source": "rt"
        },
        {
            "content": "Slow burning road film. A quest to get to the root of what went terribly wrong and how to make it right again.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "I wanted to squeeze the words out of Travis by the last half hour. It's amazing how much this can accomplish emotionally with color and minimalist soundtrack.",
            "review_date": "2016-05-14",
            "source": "rt"
        },
        {
            "content": "cinegeek.de Our Daily Free Stream: Wim Wenders - Paris Texas. Oder wer liebt nicht Nastassja Kinski? - Ein Mann, der aus der Wüste kommt. Ganz allein, ohne Zukunft und ohne Vergangenheit. Kurz vor dem Verdursten stösst er auf eine Baracke, in der ein deutscher Exilant ihn versorgt. Der Deutsche nimmt die Brieftasche des Fremden, um seine Identität zu erfahren und ruft den Bruder an. Als ich diese ersten Minuten von Paris Texas zum ersten Mal gesehen hatte, konnte ich mir nicht vorstellen, wie der Film nun weitergehen würde. Wer viele Filme sieht, kennt diese Gefühl: Ganz gleich, ob ein Werk grossartig ist oder nicht, meistens weiss man recht schnell, was als nächstes geschehen wird. Bei Paris Texas ist das anders und das allein macht Wenders Film so faszinierend. Es scheint, als betrachten wir ein Bild, dass sich bewegt, aber keine aneinander gereihten Dialoge mit Bildern untermalt. Wenders hat ein ganz und gar individuelles Werk geschaffen über Verlust und Einsamkeit. Die Charaktere entstammen der Fantasie des Autoren Sam Shepard. Sie passen in das Werk von Wenders, der am liebsten Road Movies macht, in denen Männer nach einem Sinn suchen in der Weite der Landschaft. Diese Weite hat er nie besser getroffen als in Paris Texas. Harry Dean Stanton spielt den verlorenen Mann und welcher Schauspieler wirkt gleichermassen verlassener und auch zorniger? Die Gründe, weshalb er allein durch die Wüste wandelt, finden wir nicht heraus, wohl aber erfahren wir, wie gross und schmerzhaft sein Verlust war. Früher einmal war er verheiratet und Vater eines kleinen Jungen. Nach seinem Verschwinden wuchs sein Sohn bei dem Bruder (Dean Stockwell) auf. Die Mutter (Nastassja Kinski) ist ebenfalls verschwunden. Hunter Carson spielt den Jungen und er geht mir so zu Herzen, wie ich es nie wieder bei einem Kinderdarsteller erlebte! Nun hat der Verlorene (der Travis heisst) die verrückte Idee, seine Familie wieder zusammen zu bringen. Ganz langsam nähert er sich seinem Sohn an, obwohl er noch nicht genau weiss, wie er mit einem Kind überhaupt umgehen muss. Von seiner Frau weiss er nur, dass sie ein Mal im Monat Geld von einer bestimmten Bank abhebt. Als er sie trifft, trennt sie eine dieser Scheiben, hinter denen Prostituierte mit ihren Freiern mittels eines Telefons sprechen. Der Freier sieht die Hure, sie aber nicht ihn. Das ist die Ausgangssituation der bewegendsten Szene des Films. Paris Texas drückt Gefühle aus, legt sie frei und das ist dem Film wichtiger als eine Geschichte zu erzählen. Weniger geht es um vermisste Personen als um verlorene Gefühle. Ganz am Anfang fängt Wenders sie ein mittels eines Super 8 Films, der Travis Vergangenheit zeigt. Wenders Bilder suchen immer wieder Menschen, die sich in der Weite verlieren. Vor uns die steinige Landschaft von Texas, in der die Kaffs merkwürdige Namen wie \"Paris\" oder \"Manchester\" tragen (wer ml Google Map spielen möchte). Dennoch ist es keineswegs ein amerikanischer Film geworden: In der Verweigerung des \"Storytelling\", dass dem Offenbaren von Innerlichkeit weichen muss, hat Wenders einen sehr deutschen Film gemacht. Er zeigt sich fasziniert von der amerikanischen Kultur: Untermalt ist der Film vom Spiel einer einzigen Slide Guitar, die Ry Cooder spielt! Amerikanische Musik und Mythologie machen den besonderen Reiz von Paris Texas aus, durch den staunenden Blick des Ausländers. Paris Texas ist Wenders bester Film, bestimmt auch deshalb, weil er seinen Bildern \"echte\" amerikanische Dialoge angepasst hat. Sam Shephard erlaubt es seinen Figuren, dass wir sie ohne viele Worte kennen lernen. Ihre tiefsten Gedanken und Ängste müssen bei ihm nicht in Dialogen erklärt werden. Mit seiner Passion zu experimentieren schien Paris Texas kaum in das Popcorn Kino der 80er zu passen. Der Film ist ein Nachzügler, nicht nur den Neuen Deutschen Films, sondern auch der Art, die in Hollywood in den späten 60ern produziert werden konnte. Paris Texas ist wahrhaftig, tiefgründig und brilliant! Für mich einer dieser Filme, die ich immer wieder sehen kann und danach glücklich bin. (Dazu gibts unsere Film List \"Road Movies\" auf cinegeek.de",
            "review_date": "2016-05-06",
            "source": "rt"
        },
        {
            "content": "89%\nParis, Texas deals with domestic drama and American culture through unprecedented gravitas, and Harry Dean Stanton shines in his role.",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "Should you see this movie? See that tomatometer score?",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "It's a slow burner but it also features one of the greatest scenes ever committed to film.",
            "review_date": "2016-03-29",
            "source": "rt"
        },
        {
            "content": "She told him that she dreamed about escaping. That was all she dreamed about - escape.",
            "review_date": "2016-03-07",
            "source": "rt"
        },
        {
            "content": "Another brilliant Wim Wenders piece from the 80s. One I had not seen until now. Can a combination of Wenders, Sam Shepard, Harry Dean Stanton and Dean Stockwell fail? No, I don't think so. Add to that a score by Ry Cooder and glorious cinematography by Robby Müller (who among other films shot Repo Man, Breaking the Waves, Dancer in the Dark and Dead Man).",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "I love this movie so dearly.",
            "review_date": "2016-01-20",
            "source": "rt"
        },
        {
            "content": "A masterwork in storytelling that demonstrates the emotional capabilities of cinema. Deeply moving in gentle, subtle ways. Excellent score and an unbeatable cast namely Stanton as the transformative Travis.",
            "review_date": "2015-12-25",
            "source": "rt"
        },
        {
            "content": "Such a powerful film, but especially in the final 30 minutes. The monologues at the peep booth are what make this movie. Such a beautiful moment. Harry Dean Stanton should've been nominated for an Oscar for his performance. Dynamically, he shifts from a silent loner, to a fully realized human being, who speaks like a poet to his estranged wife. The cinematography is also very clear and crisp for the time it was released. I must warn you, there is a bit of lag. It's a slow movie. The reuniting with his son didn't quite hit me as well as it should've. But there is too much to praise. This is Wim Wenders's masterpiece.",
            "review_date": "2015-12-05",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton delivers an Oscar worthy, powerhouse performance as Travis in this exceptional adaptation of Sam Sheppard's story.  Methodically paced, the film winds through the discovery of the tumultuous past of a drifter, one shrouded in conflict and the unbearable loss of love.\n\nComplementing the cast, a young Hunter Carson is irrepressibly honest as the long left, hesitant son and Nastassja Kinski is haunting as the love of Travis' life.  The scenes of reunion play out so beautifully as to be kin to true art.\n\nIt is a heartbreaking journey through a complicated life, and a love so strong that it cannot survive.  This one is on my short-list of the greatest films of the 20th century.",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "America, as a concept, often manifests itself in broken anti-heroes, valiant underdogs, and cruel, hyper-masculine alpha males; Paris, Texas takes these various tropes and rolls them into one to create Travis Henderson, a man who now lives solely for the sake of making a redemptive sacrifice in order to help reunite the family he could've been a part of. Wenders' grasp on what drives America is astounding given the fact that he's German, his choice to set the film in the desolate stretches of West Texas an insightful means of tapping into the classic, manifest-destiny attitude that drives the country towards growth for the sake of it and fuels its peoples' perpetual belief in a better tomorrow. His story of a family tying to rebuild is a perfect encapsulation of what the nation stands for; we're certainly not perfect, but the need for honest, genuine, simple fulfillment through legitimate human connection drives us our entire lives and makes room for forgiveness. For viewers receptive to this idea, Paris, Texas is a flat out gorgeous experience.",
            "review_date": "2015-11-22",
            "source": "rt"
        },
        {
            "content": "A great story of loss and the inability to piece things back together.",
            "review_date": "2015-11-12",
            "source": "rt"
        },
        {
            "content": "Pensa num filme lindo. Pronto. Paris, Texas.",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton.  Wim Wenders.  So so good.",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "Directed by Wim Wenders, Screenplay by famous actor Sam Shepard and starring Harry Dean Stanton as Travis it is essentially the man-with-no-name because he's the man-who-won't-speak movie with a heart. The movie opens with a man walking alone along a railway line in the desert and you immediately think why's a man walking alone along a railway line in the desert.\n\nIt's got this beautiful and stunning simplicity to it, like Ry Cooder's perfectly eerie and resonant solo steel guitar. Travis is rescued by his brother Walt who asks him where he's been for the last four years? He says nothing.\n\nHe doesn't feel obliged to explain or declare anything. We learn everything from the questions becoming increasingly drawn into why he won't answer them. Why he carries a photo of a plot of land he bought in Paris, Texas. He says he doesn't know why.\n\nSo there is this great gaping canyon of a fractured family in his life without an explanation as he gently and slowly tries to build a relationship with his estranged seven year old son and ultimately unite him with his mother.\n\nBut what that plot summary doesn't reveal is how incredibly moving and powerful the smallest gesture of love between family members can be.\n\nIt is in how we notice the faintest details even when nobody speaks. This movie literally proves actions speak louder words and shines a light on human vulnerability and the fragility of relationships and the fragility of human existence.\n\nIt is like showing us how fine-tuned and terrifically ingenious, rational and logical human emotion is even when its unknowable. Like the most paranoid movie not actually being paranoid in the end.\n\nThis movie is still a mystery to me and as it reaches a final conclusion it opens another door. It doesn't have all the answers, but it just might have all the right questions.\n\n- See more at: http://www.principalegg.com/reviews/review-of-the-top-10-most-paranoid-movies-of-all-time/",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "Beautifully shot, lovely soundtrack, emotional story.",
            "review_date": "2015-07-16",
            "source": "rt"
        },
        {
            "content": "As far as I am concerned this is a cinematic masterpiece. Harry Dean Stanton barely speaks at all, but with just a glance or a minor gesture -- you know it all. Stunningly photographed and quietly powerful. This is a sort of cinematic poetry. Brilliant.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "Just a beautiful masterpiece.",
            "review_date": "2015-05-02",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2015/04/paris-texas.html",
            "review_date": "2015-04-21",
            "source": "rt"
        },
        {
            "content": "The acting and directing in this movie is spectacular.  As far as acting goes it really could not get much better. A lot is due to the director, he seemed to understand how to get everting he could out of his actors including a little kid. I loved the story, but it is defiantly a slow one. It is about a man who is found in the desert by his brother. And his attempt to put his family back together after a traumatizing event.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "An elegiac poem of the sad and lonely and the equally lonely landscapes of the American west. This film is refreshingly direct in its focus, fascinated by the singular characters at its center, which always seem to drive the narrative rather than some term paper thesis or plot contrivance. But belying this narrow focus is a wide-eyed camera that takes in all it sees, leaving infinite space for quiet contemplation, elevated even higher by that iconic score. Cooder's spare riffs seem to arise from the land itself",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "A beautiful and moving story about family, regret, and redemption. Incredibly powerful and a visual masterpiece.",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "Masterpiece! The script, ways of story telling, acting, cinematography were all perfect! It took a while to kick in on how good it actually was but this is one I will remember in years to come and has been added to my top 50!",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "I love tearjerkers.  In my top three of all time.",
            "review_date": "2015-02-12",
            "source": "rt"
        },
        {
            "content": "Beautiful film in every facet.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Great performances, draws you in. Love the soundtrack, imagery and pacing. Beautiful western landscapes and sky. Explores broken family and reconciliation.",
            "review_date": "2014-12-17",
            "source": "rt"
        },
        {
            "content": "Very emotional from inside and compelling. Paris,Texas is a unique experience of guilt, love, belief and faith with mouthwatering cinematography of western amercia. I love Wim Winders unique style of filmmaking, it's quiet but he explores deep emotions brilliantly. Harry Dean provides a steller performance from start to finish. Nastassja's role was small, her facial expressions were superb and that last scene was extremely well acted. One of the most well acted scenes I've ever seen. Classic.",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "stanton is the reason 2 watch this slow meditation about a man",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "I really like Wim's films. This is my fourth, and will be the third one to stick with me for a long time. One of the best photographed films I've seen with stunning nature and imagery. This is cinematic excellence, simple but very beautiful. The slow pace drags me into the story and I feel that I know the characters very well after a while. I'm never bored, the conversations and the imagery make sure that's not an option.\nI symphetize, I observe, I smile.\nThere is some great main-story here, and it's developing so nicely. The last twenty minutes or so is a climax after a long chase and I just admire the very long scenes filled with dialogue and emotion.\n\nCOLOURS. Colours are key in the film for me. Glowing green, red skies, yellow chairs - there are always something on screen that makes it interesting or delecate. One of the best colour usage I've seen. Even from Wenders. I love the acting and the main actor is especially doing an ace job. A great character that I both envy and symphatize with. The music is another strong feature here, making several scenes complete.\n\nI would not say it's a perfect film, but it's not far from it. Heck, it's not even my favorite Wender film, that says a lot about the man. I really need to check out more of his stuff. A colourful, powerful film that is bound to stay with you.\n\n9.5 out of 10 Star Wars bed sheets.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "The beautifully-filmed \"Paris, Texas\" tells a story, and tells it in a way, that is both novel and hauntingly familiar. In its opening moments it seems almost to be a spaghetti Western. It has the dusty badlands and close-ups of the cracked, inscrutable face of a mysterious protagonist (Harry Dean Stanton). He says nothing, and when others speak it is often with a European accent, reminiscent of those that were poorly dubbed over in the old Italian and Spanish gunslinger films. A German-inflected townie in Terlingua-is he a doctor? law enforcement? just a drinker? probably all of the above-is straight out of a great noir or adventure film, channeling the untrustworthy gregariousness of Sidney Greenstreet in \"Casablanca\" and Walter Huston's old-timer expatriate in \"Sierra Madre.\" But the mystery the movie introduces in its opening scenes feels new and exciting: a man who will not talk, who has a history but seems not to remember it, who has walked so long through the desert that his shoes are worn through.\n\nDirector Wim Wenders tries out several different settings and speeds in the course of unraveling the story of Travis, this mysterious man, yet the information is so fragmented that for a long time each new piece only deepens the mystery. Slowly the plot proceeds, first as an almost comedic road buddy movie, then as a kind of \"Kramer v Kramer\" dramedy as the ragged Travis works to win the trust of a seven-year-old boy, Hunter. The character of Hunter is increasingly central to the film, and the child who plays him is uncommonly believable for an actor of his age. He has to deliver lines that resonate as both funny and poignant, as when he says \"Goodnight, Dad\" to two men in succession or struggles with a decision that causes pain to one of the two women he calls \"Mom.\"\n\nThe landscapes of Texas have probably never been more faithfully committed to film. The deserts of the southwest are the hook, but soon it's all highways and isolated gas stations and endless flatness. Later scenes set on and near the tangled highways of Houston are filmed in a point-of-view manner that is mesmerizing and builds tension, much like the long driving cuts in Andrei Tarkovsky's \"Solaris.\" By this point in the movie, enough information has been revealed about Travis that the mystery has lost some of its urgency, and both Travis and the script seem on the verge of turning inward and abandoning us to their own private musings on the unknowability of others. A reveal about a mysterious \"Jane\" feels too stereotypical for a movie that had up to then been using assorted tropes but tell a fresh tale. But the movie does not end without bringing its threads and themes (especially the theme of the unbridgeable distances between people, and of the jealous desire to possess loved ones, first broached through a character called Anne) to a final fruition. Some of the camera-work in the penultimate scene, involving a one-way mirror, ingeniously underlines these ideas, and there is a satisfying balance and believability to the movie's last dialogue. Ry Cooder's guitar-based musical score has a strong, appropriate presence throughout the film, and like it is artful yet accessible.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Excelente! Y esos colores! Cada escena parece pintada a mano, como si los personajes estuvieran dentro de un óleo.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "This movie last 2 hours 25 minutes and seems like 5 hours. You cannot speed through much because someone might speak or do something.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "He still loves her.\nBut \"that's only her in a movie.\"",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "Wim Wender's most memorable English speaking film is essentially an emotionally restrained, beautifully shot Kramer Vs. Kramer on wheels, with a little bit of art-deco thrown in. After being found on the brink of death, Travis reconnects with his brother after four years of estrangement, and as Travis slowly recollects the memories of his life, he embarks on a quest with his son to find his wife, Jane, he walked out on, and reunite his family. The plot reads like a Sparks heartfelt tearjerker, but the on-screen delivery is something to behold. It moves at an unhurried pace, allowing you eyes to linger on the beautiful nothingness of Paris....Texas, your ears to absorb Ry Cooder's memorable score, all while Sam Shepard's script unravels smooth as butter. Surprisingly tense as it moves to the climax with calculated precision, everything from the father-son bonding, to the tireless search for Jane, all builds up to one of the best scenes in cinema history, with Nastassja Kinski stealing the show.",
            "review_date": "2014-08-18",
            "source": "rt"
        },
        {
            "content": "Very Slow..Didn't Really Get Into It.. Would Need To See It Again Maybe.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton. Incredible. The screenplay, performances, and score are beautiful together. Some have described this as a \"love letter to America\" from Win Wenders, and I can't help but agree. Great movie.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Plain and simple -- this is a perfect film.",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "A strong statement to life, family, and love.",
            "review_date": "2014-06-19",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "A movie that express the true art of cinema..the magic of the moving pictures and how inevitably their power effects our lives.\nA master film!!!",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "I think the last scene (act) is remarkable, but quite long & winding overall.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "I'm trying to work out why this film is so highly praised. Heres what I came up with: I think it filled a desire for American film makers to start making french films. It fits that bill in the sense that its romantic with a hint of some of the complexities/darkness of relationships but still with, what I would regard, as a slightly naive view of those complexities.  In short it romanticises romance.\n I mean this in the sense that it never feels real. This if for several reasons but mainly theres something cold, distant and almost childlike about how everyone speaks in the film \"I like this...I loved him. I go to paris texas\". Etc.\n\nActing is generally ok but Aurore Clément is jarringly terrible as the french Aunt. Harry Dean Stanton is basically father stone (google it) but he can't do much with this script.\n\n It always feels like a slightly 'intellectual' novel.Its overly long and quite pretentious. Yeah paris is a metaphor and Travis' heart broke so bad he couldnt speak. Fuck. Off. It has one of those stories where its all based around events that happened in the past and the film is essentially revealing the details of those events to us. Thats a structure I never tend to enjoy and given that it takes about 2 and a quarter hours until you understand much at all, its a bit frustrating. The core story itself is kind of interesting..perhaps I would have enjoyed a prequel more.",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "Paris, Texas; a simple story, told astoundingly and with absolute perfection. \nOn a technical level, it's totally masterful. The cinematography is brilliant, you can tell each shot was presented with such careful consideration. \nThe story, also brilliant, will speak to countless people, it's one that will always stay in my mind. Focusing on love, the loss of it and what effect it has on someone, it's a heartbreaking film that clearly relates to the lives of many people; the last third of which shows cinema at its absolute best. This, along with the brilliant score, thoroughly earns it's title as a classic (a word that is used to describe a lot of films that really don't deserve it) and in my eyes is painfully close to being a masterpiece.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Esta es bella ... Por algo ganÃ³ Cannes",
            "review_date": "2014-03-18",
            "source": "rt"
        },
        {
            "content": "Una de mis peliculas favoritas. Todas las palabras que me vienen a la cabeza, no le harían justicia, por eso he decidido sintetizarlo en dos: Obra Maestra.",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "An excellent, beautifully shot movie. The cinematography is second to none - it's probably the most beautiful movie I've ever watched. The scenery and filming is gorgeous. It also has a steady, methodical pace, but doesn't lose your attention for the nearly 2.5 hour running time. The acting is great, and the story is heartfelt and strikes deep at one's emotions. It's a story of emotion and gradual, beautiful reconnection - a lovely piece. There are also funny parts of this deep story. The plot, while great, nags me a bit because it seems a little bit contrived. However, the wonderful filmatography, the great story, creativity, and suspense, and just overall it's great - makes it one of the best, most beautiful, pretty movies I've seen, and one of my personal favorite movies.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "Pretty great movie. I just thought it was a little too slow and long. But, it is a great story about love of family and the loss that a family can experience when they are torn apart. The movie has some great acting from a cast of actors who aren't as famous.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Slow and moody but mesmerising.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "A favourite of mine that I have seen several times, this is a classic film that's really hard to easily describe, and even more so to explain just why I like it so much.  It won the Palme D'Or and is a somewhat challenging film due to its slow pacing, and difficult to summarize plot.  Essentially is follows a man who was wondering for 4 years as he tries to reconnect with the family he left behind.  Harry Dean Stanton is great in it, the cinematography is excellent, and it features a strong score by Ry Cooder.  Give it a try!",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Beautiful scenery and haunting soundtrack capture the mood of this movie perfectly. The story is somewhat thin and the final chapter is not logical or grounded in reality, but the movie achieves its goal of showing American society from European point of view.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "One of the most moving monologues in the film history.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Lovely calmness to everything helped by a great Ry Cooder soundtrack, but Christ this is slow.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is the first Wim Wenders film I've seen (only one so far). It's a calm but provocative film with Harry Dean Stanton giving one of the more unique and great performances I've seen on celluloid. It's the story of a one man sort of righting a wrong in the only way he knows how and it's beautiful.",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "Wife and I attempted to watch this a few months back. Ninety minutes of story (at best) stretched out to 150 minutes. Like watching paint dry. After a while even Ry Cooder's wonderful incidental music became tiresome. I don't mind movies that move at a deliberate pace ('Revanche' comes to mind), but this was excruciating. Cinematography and acting were fine, though not enough to make up for the abysmal tempo. We finally fast-forwarded to the non-ending. Might have been better if we'd taken a couple of Quaaludes beforehand, but overall I'd suggest you just buy the Ry Cooder album and skip this dog.",
            "review_date": "2013-10-04",
            "source": "rt"
        },
        {
            "content": "An emotional story about a man who, after being lost for four years, has to return to his life to fix his past. The film is a bit long, and slow paced at times, but I was never bored. Beautifully shot, and with memorable characters. And I specially liked the third act, which brings the most powerful scenes of the movie. Not my average type of movie, but it is a really interesting and engaging drama, that I highly recommend.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "There is something so beautiful that can draw you so deeply to \"Paris, Texas\".",
            "review_date": "2013-09-20",
            "source": "rt"
        },
        {
            "content": "\"Paris, Texas\" is the slowest yet most interesting film that I have ever seen. It is about a child whose parents have disappeared for four years after a couple of years since his birth. Since then, the brother of the father raised the child with his wife. One day, the father is found collapsed in a bar from dehydration and the brother brings him home. The father is temporarily mute and shocked. Conflict ensues when the real father of the child wants him back and wants to find his wife. There is so much here that can be appreciated. The cinematography is absolutely gorgeous covering the Texan landscape as is the score by Ry Cooder which captures the feel of the film; slow yet powerful. The direction by Wim Wenders is some of the best direction I have ever seen in a drama film. The camera moves graciously with power that by the end our eyes and emotions are glued to the screen. The story is so simple, so layered, so captivating, so realistic, so heartfelt that I have never seen anything like it before. It truly describes lower class life in the US. The performances from Harry Dean Stanton and Nastassja Kinski are beyond words. \"Paris, Texas\" has it all and then some it boasts powerful direction from Wenders, fine performances, and a fully fleshed out plot.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Great movie, incredible acting (Harry Dean Stanton), excellent ending.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "One of the best dramas I've ever watched, period.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "This was weird.  \nBut I'm weird, so I liked it.\n\nIt's a good watch, if a bit existential.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "When you accept the task of forming a family and start a new life, the bonds created are permanent and of an indestructible transcendence. The toughest enemy of love is critique. Pride, jealousy, intolerance and egocentrism can also be determinant factors, but everything resides in oneself, and hence our responsibility to give up our way of being and adjust it to the people that we love the most. That is done through decisions, decisions that we face every day of our lives for the sole purpose of love.\n\nThe most admirable aspect of the film is its structure which is divided into chapters.\n\nI. The first chapter opens with the aftermath of personal oblivion, of escaping from the life we once signed an implicit emotional contract to take care of, just to find internal emptiness and maybe the loss of personal identity, which is Travis' case. The journey back to the world left behind begins, yet with a silence difficult to break.\nII. The second chapter introduces you to the protagonist's process of readjustment to the people that participated in his past and memoirs.\nIII. The third chapter begins a necessary alternative journey of search for the missing key in the already shattered family.\nIV. The fourth chapter contains the relevant message of Universal value, from Paris to Texas, that defines our very human condition, as beings in the need of love and acceptance. Sorrows and pains cannot be contained in oneself permanently; sooner or later they have to find a way to be externalized and escape from our hearts and minds.\n\nThe unique thing about the film was: Travis' character acted differently in each chapter, showing a clear trend of emotional evolution.\n\nIt is important to note that Travis had the luck of belonging to a family that didn't put any significant blame in him given that he was absent for around 4 years. Perhaps this may seem unbelievable given our contemporary set of values. Suspend your disbelief, because it has a high reward in the final 20 minutes, as the characters make amendments and nude their hearts to speak what was necessary to confess and fix for coming to better terms. A near-masterpiece of cinema that shows the importance of prioritizing family and listening, something what women are experts at. Just like Welles did in the past, acting is also reacting, because in the reactions half of the emotional impact is found.\n\n94/100",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Poetic, engaging, enduring.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Long at 140 minutes, Paris, Texas follows a drifter who returns to a forgotten life. Great characters and a superb script, the final scene is poetic and ties together the seemingly thin plotline. Some great cinematography, it's no wonder critics loved this. The score is wonderful, and complements the incredible landscape shots, which are jarringly dramatic. Hard to distinguish between brilliance and boredom at times though, I may have to reflect on this...",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "\"Paris, Texas\" é um filme tocante que reúne a sensibilidade européia de Wim Wenders com um roteiro tipicamente americano de Sam Shepard e traz  a melhor atuação da carreira de Harry Dean Stanton.",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "I cannot recall a film where the interactions between characters have been so perfectly acted. Yes it's a little lengthy but the wonderful visuals and dialogue keep you interested and don't allow you to pass into boredom.",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "This is a beautiful film that can deliver powerful scenes with subtlety and intelligence. It is packed with great performances and amazing writing. Together with the gritty style, the great performances and the fantastic writing make \"Paris, Texas\" a triumph in film making",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "More than the incredible subtleness and grandeur of the storytelling of Paris, Texas we have an odd and unique view of the Southwest part of the United States. I think the film is a response to all of those stereotypical elements imposed by Hollywood about what should Westerns contain. We have no cowboys, no \"Wanted\" billboards, no sheriffs. We can just see people leaving their lives, or forgetting them. We can see Travis trying to find himself in those barren lands which does seem to mean something to him. His shining beacon of hope is Paris. Paris, Texas. A reflection of something greater, which is completely and knowingly out of his reach.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "A wonderful film. While some disagree I found it not the least bit too long or lulling. The film goes where it needs to go when it needs to go, and it doesn't take too much time to get there. Stunning performances from Harry Dean and Nastassja Kinski, not to undermine Hunter Carson, make Paris, Texas an unforgettable film and maybe my favorite film in the Criterion. On a side note, the quality of the Criterion Blu-ray is well worth the money.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "The great danger of isolation, Jane explains, is not just that we lose our way, but memories fade, we give up hope and are engulfed by the wilderness. Nowhere but in the vast wastelands of the American Southwest are a road-map, compass and reference points so important to our very existence.\n\nWim Wenders delicately translates a singular Sam Shepard / Kit Carson screenplay with vision and grace. A minimalist Ry Cooder score effectively punctuates this introspective story of redemption and sacrifice.",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "One of those purely character pieces using Texan backdrop.  Good.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "One of the finest films of the 1980s, and possibly the best road trip ever committed to celluloid. This heartbreaking and poignant journey of one man's redemption is so effortlessly constructed by Wim Wenders, a director with an evident confidence of vision and huge ability to draw superb performances from his cast. A masterpiece.",
            "review_date": "2013-05-12",
            "source": "rt"
        },
        {
            "content": "With wonderful story, at times sad, at times funny, with greatly developed characters, with extraordinary and moving performances (especially that of Nastassja Kinski) and with exquisite dialogue, Paris, Texas is one of those films that you can see are not from Hollywood, realistic and meaningful, and it is one of the rare film from the 80s that deserve the classic status.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is one of those rare movies that is as beautiful as it is extraordinary.  The movie delivers on so many levels that it would take too long to enumerate them.\n\nWithout a doubt this is Wim Wenders best movie, and is fully worthy of all the plaudits it has received over the years since it was released.\n\nEqually stunning is the soundtrack provided by Ry Cooder, which has become so familiar that there can hardly be a TV programme that hasn't used it when portraying a desert scene.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Slow but intriguing movie. A matter of fact story which leaves many open questions but that's the rustic charm of the movie. Good performance by Stanton with some good direction and editing. Thankfully they didn't over dramatise the movie.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "This Is Why I Distinguish Between \"Father\" and \"Dad\"  \r\n\r\nI am not particularly familiar with the work of Wim Wenders.  There are two more of his movies that I am particularly looking forward to the chance to get around to, but one starts with \"U\" and one starts (in English) with \"W.\"  The one starting with \"W\" is set in Berlin (as indicated in the original German title, which I believe roughly translates to \"[i]The Heaven Over Berlin[/i]\"), but I'm pretty sure the one starting with \"U\" is also set in the desolate stretches of the inland United States.  This seems to be something that captivates the stranger sort of German directors.  I'm not going to make more than a glancing reference to [i]Lebensraum[/i], but I do think there's something to the idea that the land just keeps going for miles and miles, flat and eternal.  It's captivated plenty of American directors, too; it's pretty captivating stuff, and what is [i]Lebensraum[/i] but Manifest Destiny?\r\n\r\nFour years ago, Travis Henderson (Harry Dean Stanton) walked away.  He left his son, Hunter (Hunter Carson), with his brother, Walt (Dean Stockwell), and just disappeared.  Now, Travis has shown up in a hospital, and they have tracked Walt down as his next of kin.  Walt comes to get him, but Walt doesn't really know what to do with him, especially because Travis is at first silent.  In many ways, it seems as though Travis has been living in his own head for the last four years.  Walt takes Travis back to his home in the suburban outskirts of Los Angeles, where he and his wife, Anne (Aurore Clément), have been raising Hunter as their son.  It is really Hunter who finishes bringing Travis out of his shell.  At first, Hunter doesn't want much to do with Travis, but they slowly begin to bond.  Hunter is the first one to be aware of how much his father is still in love with Jane (Nastassja Kinski), Hunter's mother, and together, they go after her.\r\n\r\nThe moment which struck me most in the movie (and appropriate, given that Rotten Tomatoes has today randomly churned up a review that starts with mention of my own daughter) is the one in which Hunter is talking to a school friend (Edward Fayton) about Travis.  He has been told that Travis is his father, but he's still allowed to call Walt his father.  When you are not-quite-eight, it's best to have everything laid out as clearly as possible, and it's obvious that this has not happened for Hunter.  He knows that Travis and Walt are brothers, and he knows that he is expected to call Travis his father and allowed to call Walt his father, but he doesn't know the logistics of how that works.  His only response to how he has come to have two fathers is \"Just lucky, I guess.\"  Part of this is that kids just generally think that however they've grown up is normal, so if this is how things are for Hunter, this must be normal.  But I do think things should have been kept clear for him all along.\r\n\r\nThere is also a fairly agonizing scene in which Travis has finally found Jane, and he explains to her how he sees what had until now been the end of their relationship.  From my perspective, it sounds like the two will need a heck of a lot of therapy if they decide that they want to continue their relationship after the end of the movie.  However, the fact that Travis is coming clean with his feelings is something, at least.  He does not blame her for everything.  He clearly understands why she did what she did, why she did everything that has led to them being where they are in this new time and place.  I don't think his understanding it will prevent the pattern of behaviour from repeating itself, but I think that Travis wants it to.  I also think that it will help Travis that Hunter is more of a person, but in some ways, that also makes Hunter more vulnerable.  He will not forget his parents after this the way he did when they both disappeared when he was three, and that is, after all, what Anne feared from the moment she heard Travis was alive.\r\n\r\nTravis and Walt's father met their mother in Paris, Texas; he apparently liked telling people that they had met in Paris and letting them start to fill in \"France\" before he clarified.  (Actually, in several ways, the elder Travis Henderson doesn't sound like a very pleasant person.)  And, yes, this is in many ways a film about assumptions.  Walt and Anne assumed Travis was dead.  Travis assumed, when he left, that there would be someone left to take care of Hunter.  Hunter--and this is the most reasonable of the assumptions--assumed that the life he was living was the life he would lead.  Heck, Walt and Anna assumed that letting Travis walk Hunter home from school would mean that they would both return to the house in a reasonable time.  Sometimes, what we assume is not what will be.  And somewhere, in that great, open expanse of the American wilderness, we always believe we will find ourselves.  It's hard to say how safe that assumption is.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "Excruciating...  Great as a photo gallery, awful as a talkie.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Auf dem Begleittext zur DVD von Paris, Texas\", die ich mir ausgeliehen habe, wird die Farbdramaturgie des Films betont. Oft, übersehe ich solche Dinge leicht, doch im Fall von Paris, Texas\", denke ich, wäre sogar mir das leuchtende Rot in einer Vielzahl von Szenen aufgefallen.\nDiese Farben sind nur ein Highlight der Kameraarbeit von Robby Müller, dem Langzeit-Mitarbeiter von Wim Wenders. Er fängt die mythischen Qualitäten der weiten Steppen von Texas perfekt ein. Wim Wenders, als erfahrener Inszenator von Road-Movies, erforscht das Land, das durch seine schiere Größe dieses Subgenre erst erschaffen hat. \nDie Erforschung des mythischen Amerikas, des amerikanischen Traums, der Flucht in die endlosen Weiten, durch die Augen eines Nicht-Amerikaners.\n\nWenders ist nicht zynisch oder negativ dem Giganten gegenüber eingestellt. Mit Zuneigung nähert er sich dem amerikanischen Lebensgefühl und seinen Charakteren.\nParis, Texas\" wird nicht nur als einer der besten und renommiertesten Filme von Wenders in Erinnerung bleiben, sondern auch als rare Gelegenheit Harry Dean Stanton in einer Hauptrolle bewundern zu können.\nMehr noch als Stanton, verdient meines Erachtens, der Rest seiner kleinen Familie Beachtung. Natassja Kinski ist absolut umwerfend, sie wirkt gleichzeitig verletzlich und selbstbewusst und ihre Konversation mit Stanton, verborgen hinter einem Spiegel, ist einer der großartigsten Szenen des Films. Auch Hunter Carson als Sohn der beiden überzeugt mit seinem Esprit, seiner Lebensfreude und Unschuldigkeit.\n\nUnschuldig bleibt in diesem Film nur er. Tiefe Narben aus der Vergangenheit brechen auf und veranlassen den gebrochenen Vater, seinen Sohn aus der Obhut von Tante und Onkel zu entführen und ihn zu seiner leiblichen Mutter zu bringen. In minderen Werken, würden die Gefühle des Sohns thematisiert werden. Hier aber, versteht er, dass er Teil eines größeren Ganzen ist, und fühlt sich mit seinem entfremdeten Vater verbunden, ebenso mit seiner Mutter, die er kaum kennt.\n\nRy Cooders Gitarrensoundtrack begleitet den Film wie aus einem Autoradio. Ein perfect fit\", selten hat man stimmungsvollere Begleitung zu einem Road Movie gehört.\n\nDer Gelegenheitskinogänger sei jedoch gewarnt. Dies ist ein Kunstobjekt. Paris, Texas\" ist langsam, oder besser, der Film nimmt sich Zeit um die Weiten der USA und der seelischen Klüfte der Charaktere zu überbrücken. Die Minuten verrinnen nur langsam, aber wer sich darauf einlässt wird mit einem tollen cineastischen Erlebnis belohnt.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Perhaps the most important reasoning for the title of Paris, Texas is that it depicts the American south in such a picture-esque light. Very rarely do we see such films that do so, which is odd as anyone who has been to the area will find the look of this film instantly familiar. Although helmed by German director Wim Wenders, this is very much an American film, and his European sensibilities are what really make Paris, Texas so astonishing. He gives great attention to character emotions, and isn't afraid to have scenes go on for a longer duration than many American directors would allow. In the end it's a stirring portrait on alienation and regret, and a slept-on masterpiece from the early 80s. It's easy to see why both Kurt Cobain and Elliot Smith both cited this as their favorite film.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "A man, Walt (Harry Dean Stanton), is seen wandering the prairie outside of a small town in Texas. His brother, Travis (Dean Stockwell), who is searching for Walt, spots him and takes him, who is mute and obviously damaged by something, to a nearby hotel to try get some sort of information out of him. The next day, as they drive to California, Walt begins to talk, but not a sufficient amount to indicate what happened to him or his woman (Nastassja Kinski), who is the father of his child (Hunter Carson), being cared for by Travis and his French wife Anne (Aurore Clement). There, Walt begins to bond with his son, although remaining somewhat distant at times, but eventually allowing him to accompany him back to Texas to find the mother/his woman. Very slow moving drama hits the mark, thanks to its ability to generate evocation of curiosity from start to finish. The photography is quite fine, as is the acting and the conclusion to the long story. It definitely is an off-beat movie, yet it does work quite well.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Muy buena pelicula de WW...",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Quite simply one of the best movies I've ever seen.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Emotion travels through the faces and thoughts of the characters slowly and in a manner we seldom see in recent movies.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "An amazing film that is far more complex than its simple premise would let you believe. I have never seen a conversation (despite being more of a two-way monologue) as deep as the one in this film. Truly, an impressive film.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Sometimes, some films, are just plain boring. Dense plotting is not a requisite for a good film, but this is pushing it, and I was bored. There is good work in this film, but the torrid pace and paper thin plot are not for me. I like my movie experiences to be loaded and with a solid tempo. This is neither, and therefore I just didn't enjoy it, doesn't mean it's a bad film, like I said there are good elements, just not the ones that are able to bring this one to me. Recommended for anyone, except me.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "This really is a beautiful film that touches the heart. Exploring various relationships primarily the father and son and ending in the reunion with the mother aswell, Paris, Texas is slow moving, touching and poignant. The cinematography is beautiful capturing the sparse and harsh land of Texas and it's incredible size compared to one wandering man. It is definitely too long and I did start to fidget a little towards the end, but this could also be because it was late at night, I wasn't expecting the long length. Considering this was made in 1984 it still holds up incredibly well and the DVD transfer is wonderful in stunning wide screen. This isn't a 'must watch' film but for those interested in films (either writing, directing etc, or those who simply enjoy watching) this is an excellent example of a structurally solid film. We are introduced to characters in the opening scenes and discover that the drifter has been gone for 4 years but we don't know why, so we keep watching in hope of finding out, truly inspirational script.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Un trabajo visual solemne, un cuidado del color increÃ­ble. Interpretaciones que rayan en la locura de la perfecciÃ³n, un cuidado de cada lÃ­nea en los diÃ¡logos que los vuelven sublimes. Cada detalle en pantalla es una excavadora a las profundidades de la mente. Cada fotograma es una delicia.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Wim Wenders has such a keen eye, as there is just so much gorgeous imagery in this beautiful meditation on reconciliation and selfless love. While this film may seem aimless at first, those who stick with it will find themselves emotionally rewarded in the end. Not to mention Ry Cooder's evocative, minimalistic score is one of the best ever.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "SIMPLY MAGNIFICENT !!!",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "The film has some really great moments. The story pulled me in strong at the beginning but towards the end, when the performances were getting really good, I started to get less interested. I didn't care so much about Jane. I just wanted to see Travis and Hunters relationship build.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "I really can't think of any issues with this film. The cinematography, acting, pacing, dialogue, story - it's all wonderful. As another has said, \"a German director has made a film more American than most American films.\"",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Intentionally slow, however it is constantly engaging. A character driven story with amazing performances from its leads. The cinematography and blocking is like watching a series of beautifully crafted still images, drenched in emotion.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is one of the finest films ever made. It isn't the performances, the cinematography, the music, story, or direction that make it great. The whole is greater than the sum of its parts, and it's all of these elements together that serve to deliver complex and challenging ideas (the plight of the American family, fleeting passion, necessary sacrifice) and arouse feelings (often sad or melancholy) that stay with us long after the credits roll. \n\nI'd be very surprised if anyone out there didn't at one point in his/her life identify with Travis (Harry Dean Stanton), Jane (Nastassja Kinski), or Hunter (Hunter Carson). There's a confusion that comes with life experiences, one that forces us to analyze and evaluate ourselves and our relationships with others. It's hard to explain where that confusion comes from, and nearly impossible to resolve the questions it brings up. This film manages to articulate the feeling of helplessness that comes with that futility and the acceptance necessary to put those feelings to rest.",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "\"Paris, Texas\" is a delicate study about redemption, forgiveness and family with some poignant acting by Harry Dean Stanton.",
            "review_date": "2012-12-21",
            "source": "rt"
        },
        {
            "content": "excelente pelÃ­cula! es buena en todo sentido, de lo mejor que vi!",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "A heartbreaking masterwork. So perfectly executed that every frame mesmerises. Few films have captivated the American landscape and culture as so beautifully nuanced as Wim Wenders. Harry Dean Stanton gives a stellar performance.",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "How can anyone call this masterpiece boring? Interesting beautiful & touching",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "A touching and profound look at American life. Harry Dean Stanton gives the performance of his career.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "Probably the most overrated film in the history of cinema... Where to begin?\n\nFor starters, there's the boy. When we kick things off, he's in a happy adoptive home and all seems pretty good for the little tyke. Next thing you know, ol' dad (who abandoned him in the first place) comes back into his life unexpectedly. Why looky there, good old pops decides to get to know his son and spend a little time with him. Hey, how about that! He decides to kidnap him for no explicable reason. While we're at it, why don't we have dear old dad drive him halfway across the country while he and the little guy barely communicate with each other? And for good measure, let's have the father of the year abandon him again with his trampy wife out of the clear blue. God forbid he take him back to the happy home he took him from in the first place. No, just go ahead and ditch him again with the directionless ex-wife.\n\n\nHow about the seemingly endless monologue at the peep show? Yes, let's pretend that neither of them know who's on the other side of that glass. Let's let this pointless innuendo continue on for twenty minutes as the poor kid waits in alone in a hotel room. This scene goes on for eternity and all I remember thinking while I watched it was, \"Man, I've got to piss... Why doesn't he get to the point?... Damn, I've really got to piss... For fuck's sake! Say you're sorry, tell the slut that the kid's alone in a motel room and you're dumping him on her so I can go piss already. Good god, is that so hard?\"\n\n\nOne of my absolute favorite parts of this film is when dad pulls up to the strip club and leaves the boy alone in the car. During this tremendously simple shot something funny happens. A couple of gawkers walk up to the factory window above the parking lot and proceed to stand there for while. Eventually they realize they're in the shot and sulk off to the side. How did nobody notice this when it happened or at least catch it in post? Good god, this film has some hamfisted directing. \n\n\nThe only reason I gave this one and a half stars instead of a big fat zero: It's got a nice score and decent cinematography. Notice I said decent, not \"beautiful\" or \"breathtaking\" as so many others do. It's adequate to slightly above average at best.\n\n\nWhy in the world this is considered one of the greatest cinematic achievements of all time is beyond me. Horrible, meandering screenplay? Check. Clumsy, sloppy directing? Check. Baffling, pseudo-noble message? Check. Agonizing, needlessly slow pacing? Check. Unanimous winner of the Palm d'Or? You've got to be fucking kidding me.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "Dear Homer Albin, Driver for PARIS TEXAS...\n\nNot much glory in the transportation department, I know. The long drives to and from the airport, the daily errands, the interminable waiting around on set.  But while you were sitting bored in the driver's seat, watching through the windshield as Wim Wender's atmospheric, elliptical and hypnotic film Paris, Texas was being shot, you were unknowingly witnessing a masterpiece take shape before your eyes... (CONT'D)\n\nhttp://www.dearcastandcrew.com/letters/2012/5/16/paris-texas.html",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "A masterpiece of the highest order. Like a great novel, this film unfolds with ease and wraps you up in its world.",
            "review_date": "2012-11-09",
            "source": "rt"
        },
        {
            "content": "There's a lot of the \"re-establishing estranged family relationship\" films, especially now, but none quite like this one. Harry Dean Stanton is incredible and his role is forever memorable from here. It's a soft, focused movie about loss and re-connection. Sam Shepard's monologues are as poignant and profound as Wim Wenders's nuanced and stark direction and cinematography.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "\"I thought you were afraid of heights.\"\n\n\n\"I'm not afraid of heights. I'm afraid of fallin'.\"",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "One of top ten road movies supported by majestic performances and outstanding Ry Cooder score.Shall to see before you die.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "Paris, Texas written by L.M. Kit Carson and Sam Shepard, directed by Wim Wenders. Starring Harry Dean Stanton, Dean Stockwell, Nastassja Kinski, and Hunter Carson. Music-score was composed by Ry Cooder. Film's aesthetic cinematography was by Robby Müller. This was a co-production between French and West German productions. Film won Golden Palm award at Cannes Film Festival.\r\n\r\nStanton wanders in the desert, he is out to make it with his life with his brother and son (Carson), and most of all to quest his ex-wife. \r\n\r\nFilm starts slow but with ingredients to hold your attention and interest under its prime target. We become much determined and enthusiasts to find out a true personality behind Stanton's character. He wears the character and keeps himself disguised under the lid. Beautiful and eye-catching bird's-eye-view capture of landscapes make the film superior. The title of film truly demonstrates the substance of plot. Although film may fall short of attracting broader audience, yet it is worth everything.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "This is a good movie. While I wasn't fully interested in this film until about halfway through, the cinematography was beautiful enough to watch until that point. The story is done very well. The acting by Harry Dean Stanton is great and really adds a lot to the film. Definitely worth it to watch.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "It's an engrossing and emotional cinema experience that slowly pieces together the fragments of a broken life. A wonderful film.",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "This film angered me. I do enjoy the beautiful shots of Texas and the mojave desert, but the film is basically about how a kids life get further screwed up by the return of his father (and later mother) who take him away from the father's brother who seems to have taken away a much better personality from growing up with their parents...",
            "review_date": "2012-09-06",
            "source": "rt"
        },
        {
            "content": "Great family drama, road trip comedy, and tragic love hybrid.",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "Paris, Texas never ceases to fascinate, both visually and emotionally.  The story remains timeless due in large part to the emotional journey that one finds easy to connect with. The film is also anchored by terrific performances from Stanton and the gorgeous Kinski, whose final \"confession\" scene is one of the most memorable moments in cinematic history (for me at least, ha)! Moving at a slow pace,  the film slowly but surely grows on you as you go along with the protagonist. It's surely a journey worth taking.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "Excellent story and film making, I wish Wenders gave us many more like this one",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "Worth watching, worth buying!",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Wow, Harry Dean Stanton finally caught his big break in 1984, because after years of playing supporter in big and well-known films, he finally got lead roles into two well-recieved films, like \"Repo Man\", and later, this film. Of course, it figures that the year Stanton gets his leading roles in acclaimed films is the year no one goes to see the film he's in, except the critics of course. Well, at least this film made its budget, because even in USD, it barely cost a thing, and really, if the budget covered Nastassja Kinski's blonde wig, then they should have saved some money by keeping her brunette, because I'm telling y'all, a lot of beautiful girls are better when brunette, and if nothing else proves that, then it's this film's diluting the attractiveness of Nastassja Kinski, of all people, and she's doing a really good and really pretty Texas accent, so you know that wig drove her down a few notches. Okay, maybe Nastassja Kinski didn't fall that far, as she's still pretty incredibly beautiful, because it's still Nastassja Kinski, only she's not entirely brunette Nastassja Kinski incredibly beautiful (My tongue is getting twisted just from typing Nastassja over and over again, though it might just be because I keep thinking of Nast... that should-be brunette girl), which isn't to say that the film's disappointments end there. No, I like this film just fine, and certainly more than I like the film Wim Wenders did a few years after this, \"Wings of Desire\". Huh, now that I think about it, I can't tell if Wim Wenders loves slow avant-garde films more or films that deal with crossing cultures, because even when he does a film that's almost entirely in English, it still has to pertain to a place in Texas called Paris, have several foreigners in starring roles and be primarily produced by the US, UK, France and Germany. Well, either way, we can definately tell for certain that, to one degree or another, he loves slow films, avant-garde or not, for although this film is enjoyable, largely because it's not all that avant-garde, or at least not nearly as avant-garde as something like \"Wings of Desire\" (Few things are as overwhelmingly avant-garde), it's still not the biggest attention-sustainer, even with Nastassja Kinski (Her beautiful self actually doesn't show up until final act or so, so maybe that's why most of the film didn't hold my attention so much).\r\n\r\nOkay, now, the film is of course not nearly as painfully drawn out as something like \"Wings of Desire\", largely because this film has something that \"Wings of Desire\" didn't have: a plot, or at least until the film even forgets where its going through all of its excessive padding. Clocking in at startlingly close to two-and-a-half hours, the film has more than enough time to unravel its strong story, and boy, does it not let you forget the \"more than enough time\" part, because as reasonably hefty as this story is, the film goes plagued to nearly no end by scenes that drag nearly to no end, and if you have a hard time believing it's that rough, then buddy, sit back, because I'm understating. Now, don't worry too much kids, because this isn't quite a modern Terrence Malick film, where well over half of the film is comprised of total nothingness, yet much of this film finds itself dragged down to a crawl by excessive bloating through filler material, if not total nothingness, so much so that, as I said, the film altogether momentarily loses focus after a while, and rarely makes a full recovery after that. This film's momentary lapses in focus dilutes resonance and the ceaseless padding slows down the film's momentum to a crawl, but either way, the film drops your attention all too fast and all too often, while dullness sets and leaves you to think about setting into bed. Again, calm down kids, as the film's dull spots aren't relentless, yet the film is relentlessly slow, meditating much too deeply upon the atmosphere of the film to the point of actually tainting the atmosphere with dry blandness, often to where the film does descend as low as dull, and here and there to the film descends as low as all-out boring, because director Wim Wenders wants so bad to make this the hyper-artistic style piece that it just simply isn't. Now, I'm not saying that this film would be any more exciting if was the hyper-artistic style piece that Wenders wants it to be, because no matter which way you look at it, the film is too meditative, too slow, too bloated and too do-little to be anything terribly upstanding, yet chances are that the film would be better, because what it is right now is a dramatic story rich with substance, and on that level, it slips up by Wenders' attemps at making it an art piece, which not only makes the film dull, but all over the place in focus, tone and theme, as well as limited in substance and ultimately not what is should have been, could have been and perhaps would have been if it were in the hands of a more substance-driven and - yes, I'm gonna say it, you pretentious art snobs - \"competent\" director. As it stands, well, it's at least better than \"Wings of Desire\", because where Wenders headed that operation and crafted a film that was tremendously mediocre for what it was and by its own right, Wenders' mistakes go battled back by the components to this film that really do deliver, sadly not where the film itself delivers, but decidedly to where the film is enjoyable, as well as even rather impressive as, if nothing else, well... an art piece.\r\n\r\nMany of Wim Wenders' artistic touches don't fit all too comfortably, yet there is a certain artistic something that's well welcomed no matter what kind of film you're making, and that is, of course, fine cinematography, for although this film's cinematography's level of impressiveness has dated a bit, Robby Müller's comfortable shot staging, clever lighting and stunning color bounce remains something to behold even to this day. This piece of style definately catches your eye, while what catches your investment is the very story that goes tainted by other forms of style, though not much too much, for although the film's \"story\"telling styles overwhelm the substance and leave it rather underwhelming in execution, the story remains the primary focus, and it's a strong enough story to where the overstylizing isn't nearly drowned out, yet still to where you can lock in with the story, and mostly with the help of the writing duo of L.M. Kit Carson and, yes, \"that\" Sam Shepard, who I really wouldn't have pegged as a writer of this kind of stuff (No wonder he played a surviving Butch Cassidy in \"Blackwood\"; he seems to know a thing or two about secret lives). Hey, I've got to say, if most of Shepard's writing is better than his work here, then maybe he should write a bit more often, for although his and Carson's screenplay isn't especially upstanding, it is reasonably strong, providing thorough insight into this worthy story, as well as believably human and layered characterization that fleshes out the essence of the key components to this character focus, thus making a strong story all the stronger. Ever so unfortunately, Wender undercuts most every right move made by the film's strong writing duo and perhaps stronger source material and subject matter, and for every compelling high point, there are quite a few underwhelming low points, yet make no mistake, this film has its fair share of compelling high points that manage to avoid going tainted by Wenders' undercuts and give us genuinely engaging occasions of resonance that provide a glimpse at the better film that this final product, as a whole, isn't. Still, with all of the film's low points, it never descends so low to the point of being worthy of dismissal, going supported by its worthy story and a writing team that's certainly stronger than the director who executes their work messily, and if all else fails, then you at least have strong performances to fall back on. Everyone holds his or her own, with someone like the stunning Nastassja Kinski stealing the show for the all too brief time she's on, yet it's leading man Harry Dean Stanton who really steps up to the plate, as his Travis Henderson character, an amnesiac who has missed four key years of a that life he's slowly but surely easing into and looking to ameliorate as well as he can, definately presents quite a few acting challenges, many of which have been toned down by the unfortunate writing down of the material, yet many more of which go accomplished by Stanton with ease, as Stanton boasts a soberingly human and heavily layered presence that defines the Henderson character, broken up by high points in emotional range that further breathes life into Henderson and makes a character more compelling than the film itself. Now, with all of my compliments, as I said, Wenders undercuts most every high point in this film with his arrogant, gratuitously over-artistic touches that sadly leaves this film to descend beneath genuinely good, yet, in all honesty, all but just barely, as the strengths in this film stand stronger than the film itself, and while the sum of these parts failt to carry the film to the level of its golden aspects, there's enough inspiration behind this film to keep you sticking with it, even with all of the low points that ruin much of a promising vision.\r\n\r\nOnce the end of this journey is reached, the film is left tainted by the excessive bloating that renders the film's focus hazy and its effectiveness diluted, thus creating a disengagement that, when combined with the film's relentless slowness, often creates dullness, if not all-out boredome, and after two-and-a-half hours of this, the final product is left falling very short of what it could have been and as underwhelming, yet not to where it can't still catch your eye with its fine cinematography, while your investment goes caught by the strong story, brought to life by strong writing by L.M. Kit Carson and Sam Shepard, as well as by a compelling lead performance by Harry Dean Stanton, thus creating high points that may not be enough to dismiss underwhelmingness - spawned from Wim Wenders' many missteps -, yet remain enough to make \"Paris, Texas\" a generally enjoyable and consistently watchable dramatic piece that may not live up to potential, let alone hope, but ultimately gets you by.\r\n\r\n2.5/5 - Fair",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Loved it. The journey called life continues. Lonely hearts in desperate times.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "El camino para encontrarse puede ser muy largo pero sin duda al lograrlo se puede iniciar una vez más.\n\nNastassja Kinski es hermosa que gran descubrimiento.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "A classic but unconventional road movie in which the imagery often takes precedence over plot  but with Sam Shepard's emotional and dislocated screenplay and Robby Muller's dreamlike cinematography this becomes an artsy and epic mediation on America and family.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "Too Long at 2 hr 30 min and unbearably slow in places.",
            "review_date": "2012-07-26",
            "source": "rt"
        },
        {
            "content": "Wenders is a master. And along with Wings of Desire, this is his masterpiece. This film, I feel this was the beginning of something in cinema. But, it doesn't brag about how great it is. This film hits hard to the viewers and to the cinephiles. Hauntingly beautiful. Deserves more than it got.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "Subtly dramatic in its exploration of human relationships.  Not only does it manage to use the desert landscape to great effect, mirroring the moody persona of the characters involved, but its confessional storyline is deep and meaningful.",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "Between Sam Shepard's spare American writing and Wim Wenders's elegant European direction emerges a wonderful blend of two styles of storytelling, but that makes this movie sound like an exercise in style. It's not; it is actually a beautiful, deeply moving tale of people lost in America. As Travis, Harry Dean Stanton gives an assured, composed performance that captures both his character's journey of re-emergence and his ultimate withdrawal into the shadows. His journey, across a ruined, rusting Southwest, is epic in a Homerian sense, but is also gently, hauntingly intimate. It's an absolute masterpiece.",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "It is impossible to escape",
            "review_date": "2012-06-19",
            "source": "rt"
        },
        {
            "content": "poetry captured in the landscapes of the old west set to the tune of the twangs of the guitar",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "A perfectly balanced movie with depth. My favourite Wim Wenders.",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "A pretty sad, romantic tale.",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "Some films with simple plots are sometimes slow and rather boring, but  Paris, Texas is a fine movie, pleasing to watch, in spite of being a long motion picture.",
            "review_date": "2012-06-11",
            "source": "rt"
        },
        {
            "content": "It is a shame I can only watch this for the first time once. Utterly flawless river flowing uphill, constantly working it's way through wonderful scenes of picturesque beauty towards that climatic booth scene, one of my favorite pieces of any film. Wonderful piece of cinema.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Il n'y aucun autre mot pour décrire Paris, Texas autre que Classique. Ce petit chef-d'oeuvre s'incrustera éternellement dans la liste de mes classiques de cinéma comme étant une réalisation majestueusement touchante qui ne peut laisser personne indifférent. Le jeu de Harry Dean Stanton est tout simplement bouleversant, notamment dans ses échanges avec Hunter. Décidemment, je me meurs d'envie de découvrir les autres univers de Wim Wenders, après m'être laissé touché par le réalisme poignant de Paris. Paris, France? Non. Paris, Texas.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Brilliant is the word. I've to make a special mention of the camerawork, amazing stuff. Few scenes in the film will remain with you forever, like the one when the protagonist meets his wife after 4 years, the kid when he meets his mother & the first 10 odd minutes without any dialogue!... Loved it..",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "A poetic masterpiece. A beautiful, emotionally driven film about real characters and real life and seeking redemption/answers. My second favorite film of all time.",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "Staggering out of the desert sun like a less vengeful Clint Eastwood in High Plains Drifter, Harry Dean Stanton steps into the shoes of one of the seminal, iconic, eighties characters. Travis Henderson, in his red baseball cap, battered suit and broken shoes sums up a decade of Americana in his purposeful stride, mournful stare and wholly confused brain. Alongside Blue Velvet (tied in here by a helpful Al from Quantum Leap, minus Ziggy), Paris, Texas paints the other side of eighties America with broad, delicate strokes that depict a land far away from Wall Street and communist paranoia.\r\n\r\nTravis emerges in a small town you've probably never heard of (sic) in Texas with no memory of the past four years and an unwillingness to communicate. His brother, Walter (Dean Stockwell), comes to pick him up and together they return to his house in Los Angeles. Travis discovers his son, Hunter, who he abandoned four years ago has been practically adopted by Walter and his wife. Travis seeks to reconnect with his son and maybe track down Hunter's mother, Jane (Nastassja Kinski).\r\n\r\nParis, Texas is eye wateringly good to look at. Robby Muller and Wim Wenders fill a usually washed out landscape with primary colours; hazy purple sunsets, bright orange deserts, deep black tarmac and piercing blue skies are shot from angles that slowly reveal more and more of urban America's encroachment onto nature. Texas looks like nowhere else on Earth, Alien and inhospitable, yet cities spring up in the windshield of driving cars or on the horizon. Pinnacles of steel and glass to match the tors and cliffs Travis is originally found amongst. Ry Cooder's slide guitar score ebbs and flows as the story demands, reflecting both the film's southern settings and the character's broken hearts.\r\n\r\nTravis starts out sad and confused, moves into touching and funny and ends up strong as a rock (and right). It's a brilliant arc (sorry), paced perfectly and played out with such skill by Dean Stanton that multiple viewings reveal more and more. These craggy, hicky, worn and drawn guys are his stock in trade but Travis is somehow different and more. Three dimensional and so believable it's a wonder you haven't bumped into him in a bar.\r\n\r\nBy the end it's doubtful whether Travis is even human, he feels more like an angel, sent to repair past mistakes and re-unite lost souls. That would explain his memory loss, his speechlessness at the start and certainly the film's unwillingness to deal with Walter and Aurore's loss of Hunter. The unification of the mother/son bond is the only concern here, overruling common sense at the cost of the lesser characters so we end up with a triptych. Travis, Hunter and Jane, not exactly together at the end but not far apart.\r\n\r\nPerfect is a dangerous adjective to toss around when it comes to film, the never stopping march of time, public opinion and attitudes changing and well, sheer bloody mindedness can all skew a film's worth but as it's been 27 years since release then Paris, Texas is so close to being perfect you couldn't squeeze a knife in there. Don't try.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "One of my new favorite movies.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "This art film had a good cast and an interesting premise. The title is integral to the plot of the film however it's shot mostly in Los Angeles and Houston. Ended on a nice note.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "A beautiful and mysterious story from the filmmaking master Wim Wenders.",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "Phenomenal. It's also the first and only time I've seen John Lurie in colour.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "I have a feeling I am going to end up revisiting this a year from now and loving every minute of it. The first thing that grabbed me was the look of it; visually, it's a knockout. I've only ever seen about three movies that looked as good as \"Paris, Texas.\" (The second thing was that it initially reminded me of \"Rain Man\" when the scene with the plane came along, but since it completely changed shortly after I am not going to dwell much on that.) I won't lie, though: the length was a total turn-off (not the movie's fault, I just have a diminished attention span, especially when watching movies at home). I can't say it should've been shortened despite this. Everything about it seemed spot-on to me. The pacing wasn't too slow or too fast, considering the story, and it didn't seem to be drawn out any more than it needed to be. The acting was great too (or maybe it's just that I never saw anyone in this in anything else beforehand that made them feel more like real people to me... whatever, they were still really good). There's no doubt in my mind that this is a solid, stunning, very interesting and unique movie... I just couldn't get fully involved in it. I will definitely revisit it, though.",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "Wenders' cinematography is stunning and it is a great feat considering how much he fits into his frame in terms of the variety and assortment of colours and objects in there.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "Un inconsueto, ma persuasivo ed originale, esercizio di stile del regista tedesco Wim Wenders; \"Paris, Texas\" si esprime con le immagini, con le sequenze di ripresa on the road, e la calda e luminosa fotografia, che mette in risalto il deserto del Texas. Il deserto, e l'architettura post-moderna americana, sono le metafore della vita di Travis Henderson; un uomo emotivamente distrutto dall'abbandono del figlio e della moglie, che si ritrova a vagabondare tra il confine del Messico e degli Stati Uniti. Viene quindi ripescato dal fratello, da quattro anni il \"tutore\" di suo figlio. Deciderà successivamente di raggiungere Houston per ritrovare l'ex moglie, adesso spogliarellista in un peep-show club. La pellicola è molto particolare per la colonna sonora, non un soundtrack nel senso più stretto del termine, ma un secco e turbato riff di chitarra, soggetto a distorsioni e/o dilatazioni del suono, in base ai dialoghi da accompagnare (e alle loro argomentazioni). Scelta artistica parecchio efficace nel ratificare il giusto pathos alle scene chiave e rendere la sobria sceneggiatura più interessante. \"Paris, Texas\" non è un film che potrebbe piacere a tutti, ma può comunque emozionare molti, e affascina ancora oggi per la tecnica singolare nella direzione.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "Unique and deeply emotional.  The plot is unique and meanders as much as its main character, but everything flows naturally.  The cinematography is gorgeous and the score is effective.  A great film from the 80's.",
            "review_date": "2012-03-29",
            "source": "rt"
        },
        {
            "content": "A beautiful and involving film about a man coming alive, with a leading performance by Harry Dean Stanton that shows him to be underappreciated.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "Beautifully photographed film, Harry Dean Stanton is fantastic in a very restrained and quiet performance. The Music by Ry Cooder is a great touch to the film.",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "Wonderful plot. How melancholic, how blue.",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Sleepy, but beautiful to look at with a perfectly constructed climactic scene.",
            "review_date": "2012-03-03",
            "source": "rt"
        },
        {
            "content": "Like its protagonist, \"Paris, Texas\" is quiet, shy, and well-meaning. It's a beautiful little film with a fair of share of both funny and heartbreaking scenes. Harry Dean Stanton, Dean Stockwell, and Nastassja Kinski give wonderful performances.",
            "review_date": "2012-03-01",
            "source": "rt"
        },
        {
            "content": "UN CLASSIQUE TROP POCHE !!!!!",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "Very long drawn out movie with very little story to tell. Take a pass on this one.  I'm not sure why the critics are unanimous in liking this particular movie. If there is anything positive to say about the movie it is the music by Ry Cooder was exceptional.",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "Wim Winders' low-key tale about a man who has left his family and gone wandering in the desert, Paris, Texas is an absolute masterpiece of widescreen composition.  Featuring unforgettable performances from Harry Dean Stanton, Dean Stockwell, and Nastassja Kinski, Paris, Texas is a film about disillusionment, existential anxiety, and the failure of interpersonal communication.  But it is also a powerful film about the journey back from despair to functionality.   Wenders fills the screen with absolutely perfect and beautiful images.  Every frame reveals a perfectly composed shot that juxtaposes humankind and its seemingly soul-crushing problems with the immensity of the environment in which we dwell.  \n\nThe film opens with Stanton's character meandering through the Texas desert in a state of mute detachment.  His brother finally finds him and takes him on a journey to reconnect with his wife and the son that has been raised by his brother and sister-in-law.  Poignant, compelling, and psychological, Paris, Texas plumbs the depths of darkness that can seep into any human relationship.  Filled mostly with dialogue and image, Wenders' classic never moves quickly but instead forces us to consider the existential questions that underlie even the most seconds of everyday life.",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "A roller-coaster of emotion, heartbreakingly well made.",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "I believe this was Elliott Smith's favourite film. It's a brilliant piece of Americana. Harry Dean Stanton's performance is an emotional masterclass, simple yet incredibly moving. The film is visually stunning and intriguing from the first shot to the last.",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "Great cinematography and music.",
            "review_date": "2011-12-26",
            "source": "rt"
        },
        {
            "content": "Beautiful!Beautiful! and unforgettable love tale.This is true cinema to the highest level possible.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Wim Wenders' Paris, Texas is a winding modern Western, skilfully shot and impressively acted. Even when silent, Harry Dean Stanton's Travis is a worthy protagonist, guiding us through the movie with a fantastic performance via a character comprised of great depth and enigma. Wenders paces the film expertly despite its length, capturing the beauty of the American South minus the stereotypes, and crafting memorable rounded characters and great dramatic weight particularly in the final act. All in all this is a solid film made quite captivating by its compelling narrative.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "...a stirring portrait of people striving against their disconnect that resists simple answers even as it rewards our emotional investment.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "A Masterpiece. This is the kind of movie that I can give 5 stars.",
            "review_date": "2011-10-25",
            "source": "rt"
        },
        {
            "content": "Eyes glued to the screen from beginning to end. Plus my favorite score of all time, provided by Ry Cooder, interpreting Dark Was The Night by Blind Willie Johnson.",
            "review_date": "2011-10-18",
            "source": "rt"
        },
        {
            "content": "asl?nda 4.5tan 4.. nastassja kinski oynuo,wim wenders filmi,gzüel bayag?...\r\ntexas eyaletindeki paris kasabas?ndan al?o ismini.. bi eleman kafay? s?y?rm?? 4 y?l ortadan kaybolmu? 35-40 caivar?,sonra birgün texas da bulnuuor ve karde?line haber weriolar,o da gelip onu al?o,onun da e?i var,ve cocuklar? war ve cocuk asl?nda bu kaybolan adma?n cocugu,8 ay??na gelmi? sar???n erkek cocugu,sonra annesi de kay?p vsa derken annesi her ay bu cocuk ad?na bankaya para yat?r?omu?,bunu elti sölylüor babaya,sonra baban?n kafa iyice düzelince hatunu aramaya gidior houston a,sonra hatun böle cameknal? striptiz kulup,muhahbe tklup gibi biyerde cal???ormu?,orada adam buluor onunla konu?uor vehikayelerini hatuna annat?p hat?rlmas?n? sagl?or,onu aglat?or,adama zmamn?nda k?skancl?ktan vs kafay? s?y?rm?? hatuna ufak capl? eziyet etmi? ve sonra olay kopmu? derken.i?te cocuk otel odas?nda beklior,hatuna otelin adresini verior adam,hatuna cocuguna kavusuor..adam arabada gidior vs derken film bitior,iyi film.. karde? ve elti de cok iyi cift cocuga kedni cocuklar? giib bakm??lar...cok sewmi?ler,ayr?lmaktan korkuolard? vs..",
            "review_date": "2011-09-20",
            "source": "rt"
        },
        {
            "content": "With the onset of this movie, I thought it was all about the showcasing of the color palette. The high contrast accents of red (Travis's cap, an old sign at an abandoned gas station; it's basically omnipresent) adding interest to what could've been a dreary dessert setting of beige eternity. \n\nBut then we're thrown into reality when an estranged father/brother who's been mysteriously missing for four years is found and brought back into the issue of his abandoned family: his son who is now seven (who's been looked after by his brother and his wife), and his young wife who ran away but occasionally wires money to their son without letters or contact. \n\nAs Travis awakens from his comatose, ultra ennui'd out state of mind, he sees that he must take responsibility for the rift he's created in his son's life. He embarks on a mission to find his wife by tracing her checks to the bank from which they've been sent. \n\nThis is one of the most beautiful movies I've ever seen, on a physical and emotional level. The cinematography is reminiscent of Amelie, minus the whimsical romantic hootnanny business that makes it so charming; but Paris, Texas is charming in its own right--existentially charming, if that's even possible; and the scene at the end in the hotel--heartbreaking.",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies ever. It's dreamlike mood, haunting performances and simple questions of what's our role in all this is handled with such simplicity and grace from Wenders, it's hard not to fall for Paris, Texas.",
            "review_date": "2011-08-31",
            "source": "rt"
        },
        {
            "content": "Truly beautiful cinematic landscape, heart warming story well Directed.  However, far too slow paced and long.",
            "review_date": "2011-08-29",
            "source": "rt"
        },
        {
            "content": "Favorite movie from the 80's.",
            "review_date": "2011-08-14",
            "source": "rt"
        },
        {
            "content": "Long and ponderous with too much space and not enough content, but the cinematography is quite nice.",
            "review_date": "2011-08-12",
            "source": "rt"
        },
        {
            "content": "A man resurfaces after disappearing for four years in order to put things right with his estranged son and wife. This is a film whose concept could have easily have been played for either cheap laughs or cheap sentiment. But script by Sam Shepard and the direction by Wim Wenders gives us a film that's genuinely moving and even sweet at parts but never feeling the least bit manipulative or phony. Harry Dean Stanton and Natassja Kinski both deliver great performances especially at that climactic scene in the end. Extra points for Robby Muller's great cinematography.",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "Paris, Texas, Great Movies\nI doubt if this film would have a remake sometime in these days. Wherein movies that we watch today in the theaters are very unconventional, some superhero flicks, some sequels, some remakes, some novels to film, and some recycled story, but I gotta tell you, \"Paris, Texas\", is one of the best American films of all time, you will never think that this was released more than 20 years ago, and still, it is I think an essential movie for real movie professional watchers like me. I don't really know where to start but trust me, if you don't want to spend your time reading this long review, then go, see this movie right now if you have a time.\nThe film begins in a desert showing a man walking without anything at all, only a picture of a family and a phone number, but who are those? Now, we know a little who this man is, then someone phones that other person, who thinks he's is brother, and the brother came to that Texas town to pick him up. Instead, it became a little silent movie, this man doesn't speak until a moment where he finally speaks and even eat. Anyways, the guy's name is Travis, and now, he and his brother, went back home to L.A., and there Travis saw his brother's wife and his son. Now, the son who is Hunter, spends more time with him, like how you doing and how is school, and surprisingly, the two did had a quick easy relationship that we all thought they're not gonna talk at first. After that Travis and Hunter went to Houston to find next her wife and Hunter's mother who is Jane. How did they know Jane is in Houston? Because she is giving them (Travis' brother and his wife) money from the bank. And Travis followed her after Hunter saw her car, and finally going into a sex club? What is he doing there? Is Jane now one of the prostitutes in that club? Travis look everywhere and finally getting to find her, there they talked and remember, she doesnt know who this man is. And that's another long conversation, but after that, it was an another scene where Jane and Hunter met and saw once again. And it ended again on Travis leaving and probably unsure where he's headed. \nEnough of storytelling now, and I'm sure I said the whole plot of the film now, but that's not it! As we go also to Travis' adventure, we also get to know more about him, he's lost and alienated to a place where everyone was never been there. His character is very important to those people he met, and ending up changing their lives as well, and also reuniting his family again and leaving them again, not in madness, but in a sacrificial way. And you'll see when you watch it. Another thing that I love is the last 20 minutes or so, on that club where Jane and Travis talk over on a telephone, as if now we all know all the big answers to the big questions right at the beginning of the movie. And that's not about it, it is also the scene where we finally see their human trapness inside, he's nobody, she's nobody too, but there's a story behind it, which made me so emotional as well. And also above else, the direction is steady is not lost, the stunning photography and camerawork is fabulous that we always think a movie set in Texas is always a western but this one is not finally about a western or a quest, it is all about finding for a hope and life, but the film avoids it pure entertainment an having a one whole scene, and that ain't no matter. \nSo, is \"Paris, Texas\", one of the best films of 1984, yes, and also the decade of 80's. \"Amadeus\" and \"Once Upon a time in America\" are two of the best of 1984 but I gotta say, this is quite a journey that I will never forget, that also reminded me of some other great film that are similar to this like \"Wings of Desire\" and \"The Searchers\". So, what else? Are you ready to watch this movie now? If not, then you just miss a one hell of a ride!",
            "review_date": "2011-08-01",
            "source": "rt"
        },
        {
            "content": "An emergence from an alcohol-soaked horror fog into a bittersweet reality.  You will probably cry at the end of this film.  And you will definitely remember this film.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "Probably the most hyped piece by American indie master Wim Wenders, âParis, Texasâ? kicks off rather slowly, in the extremely patient and subtle- even somewhat boring- Wenders style. I was ready to declare it an accomplished drama with very little emotional impact on me, but the thing caught me by surprise with a truly excellent, movingly honest ending. Hits the bullâ(TM)s eye, even if it takes a long time getting there.",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorites",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "one of the most flims ever to be made!",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "Maybe my favourite Wim Wenders movie along with Lisbon Story. This movie explores spaces between people in most refreshing and truthful form. Much recommended for those who didn't see a Wim Wenders film before.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "6,5 / 10\n\nArranca excelente pero se va desinflando hacia el final........",
            "review_date": "2011-06-14",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton delievers one of the best performances ever on screen in this great film. I loved everything about this movie, from the music to the performances to the direction to the scene between Stanton and Kinski. Excellent film.",
            "review_date": "2011-06-05",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and acted, plus Harry Dean Stanton! A little too glacially paced for my taste but enjoyable none the less.",
            "review_date": "2011-05-30",
            "source": "rt"
        },
        {
            "content": "Makes me want to take a road trip!",
            "review_date": "2011-05-27",
            "source": "rt"
        },
        {
            "content": "In terms of film-making, the term \"simple\" is often used as a pejorative. But sometimes the simplest of stories can yield some of the most compelling results. Win Wenders' 1984 \"Paris, Texas\", is a modest yet moving portrait of a man in search of his roots. Harry Dean Stanton is as amazing as ever as a man who, after a four year separation from his family, has come back find who he was/is. \nMuch like Wenders' \"Wings of Desire\", much attention is given to the setting to show how seemingly insignificant we are in comparison to our surroundings. Yet, rather than war torn Germany, Paris, Texas features panoramic shots of the Texas badlands. With a character so arcane and withdrawn from the world, Wenders utilizes the power of atmosphere coupled with Stanton's acting prowess to fill in the parts of the story where the words won't suffice. \nIt is a story about the path to finding one's identity and Wenders finds so many ways to convey this journey.The freeway scene is a brilliant metaphor for how we as humans go through life. We seem to be traveling down this open road at breakneck speed, making last minute lane changes in hopes to catch up with the life we so desire.\nThe film moves at a snails pace, but I get the sense that Wenders doesn't want to rush Travis' journey. I think it is a smart touch as by the films conclusion, one feels that we were allowed to drink in so much of his life that his image kind of sticks with us. There have been many times in my life where I have felt like a Travis and I think the film beautifully encapsulates the confusing and often heart wrenching journey that one must take in order to find out who they really are.",
            "review_date": "2011-05-25",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a slow developing character study. It breathes and aches with every slow-panning shot, with every awkward, stilted conversation. It breaks normal film-making convention not to be different, but because that is what the characters demand to be realistic. As a piece of 2.5 hour artwork, Paris, Texas excels beautifully. Those interested in a plot will be bored to tears.",
            "review_date": "2011-05-23",
            "source": "rt"
        },
        {
            "content": "Can't believe I haven't seen this movie until now!  Wonderful cinematography making great use of wide angled lenses, music by Ry Cooder, great storyline & script, impeccable charcater acting by Harry Dean Stanon and brilliantly directed supsense thriller that keeps the viewer glued .... that is for 2/3rds of the movie!   In the final 1/3, I thought Travis's rehabilitation & Hunter's reacceptance of his father was too quick to be fully credible.   Also I didn't like the ending which was too pastiche for such a  masterpiece - did the director, Wimd Wenders, succumb to American studios with his choice of ending? Personally I would have ended the movie following the wrong red chevvy - OR later at the signpost, one for Houston, one for LA - kept the audience guessing & heightening the emtional aspect.  This would have kept the tautness of the earlier part of the film in check.  I thought it was unrealistic that Travis choose to turn left.  The mother/son reunion wasn't credible!  Nonetheless a film that is well, well worth watching!",
            "review_date": "2011-05-19",
            "source": "rt"
        },
        {
            "content": "It should feel like a slow-paced affair, but 'Paris,Texas' is captivating throughout. A mesmerizing mystery that packs an emotional punch.",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "Not all it's cracked up to be. Nice to see Harry Dean Stanton in a leading role for a change. The story is built up nicely and has an ending that leaves a lump in your throat but a few big questions remain unanswered which is always bad in my book.",
            "review_date": "2011-05-07",
            "source": "rt"
        },
        {
            "content": "There is an emotional intensity in Wenders' classic tale of love and loss that slowly and intriguingly evolves from an epic genisis in the desert. It is one of the greatest beginnings to any film I have ever seen: Harry Dean Stanton in a dusty suit, white runners and a red cap carrying a can of water through an empty, barren landscape where eagles pry and the sun penetrates the face. This is played to the sound of Ry Cooder's lonely, crying guitar. Between Robby Muller, Kate Altman and Wenders, they collectively conjured up an outstanding and artistic vision for the cinematic screen. The story isn't too bad either. Travis (Stanton) slowly recovers his memory and his soul thanks to a rekindling with his brother and his son and subsequently embarks on a quest to find the woman he once loved but walked out on several years before. Stanton provides a performance that is distant and troubled but never devoid of intrigue, while Aurore Clement is sweet and charming as Travis' sister-in-law.",
            "review_date": "2011-05-02",
            "source": "rt"
        },
        {
            "content": "Hauntingly beautiful.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "I felt it sagged in the middle (Wenders spent way too long in LA, my interest began to drift around the point the sassy Mexican lady showed up) but the opening and closing sections in Texas are just about perfect, so hey.",
            "review_date": "2011-04-22",
            "source": "rt"
        },
        {
            "content": "One of the best films I have ever seen.",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "Beautiful!Beautiful! and unforgettable love tale.This is true cinema to the highest level possible.",
            "review_date": "2011-03-29",
            "source": "rt"
        },
        {
            "content": "Gripping first half, with amazing performance by Stanton and a wonderful feel for the period and the awkwardness of the relationships. Falls apart (for me) once the lost soul and the kid head back to Texas, and especially the talky scenes between Stanton and Kinski.",
            "review_date": "2011-03-23",
            "source": "rt"
        },
        {
            "content": "Bloody Brilliant movie",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "Incredible photography to be sure. Great performances. Touching story. All the makings of a great film.",
            "review_date": "2011-03-03",
            "source": "rt"
        },
        {
            "content": "My most favourite film of all time. Has every thing. Brilliant",
            "review_date": "2011-02-22",
            "source": "rt"
        },
        {
            "content": "How have I managed to miss watching this for all these years?  This is a cinematic masterpiece, it is worth seeing for the cinematography alone, there are stunning scenes of desert, I particularly love the use of colours throughout the film.  There is also a masterful soundtrack by Ry Cooder, a wonderful story, go see this film.",
            "review_date": "2011-02-09",
            "source": "rt"
        },
        {
            "content": "They call them Classics for a reason. Beautiful movie, every frame is magnificent",
            "review_date": "2011-02-01",
            "source": "rt"
        },
        {
            "content": "With no direction home.",
            "review_date": "2011-01-28",
            "source": "rt"
        },
        {
            "content": "Wow.  This film is phenominal.  Simple story in what most may consider a \"slow\" film, but I was definitely in sync with it's quiet rhythm and deeply affecting performances.  For those who love film.",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "For much of this film, I found myself intent on disliking its ostensibly experiential style, then I got locked into a wavelength with it. It spoke to the same corners of my brain that an Earth record does during a quiet, rainy afternoon drive; that is, its success is in this sort of massive, distant, infinite, last-man-alive sadness that eventually finds a way to swallow you whole. This notion becomes either hard to swallow or just right in the wake of feeling that deep, nebulous \"unresolved\" feeling. Wenders certainly made me work hard for it all the way through, but at film's end, I was ultimately moved. I also read once, many years ago, that Kurt Cobain called this his all-time favorite film, which goes some distance to unfold another emotive layer for me. A must-see.",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "would of rather watched paint dry........wait did i say paint, i meant diarrhea .",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "UN CLASSIQUE TROP POCHE !!!!!",
            "review_date": "2011-01-25",
            "source": "rt"
        },
        {
            "content": "An amazing journey with an interesting character.  First we start off wondering why this man, Travis, is not speaking, then we take this slow trip to discovering him.  Travis keeps wandering around, not sticking to a single place.  No one can force him to stick around.  His brother Walt finds him in Texas, which is the first time even hearing from him in 4 years.  Travis isn't even close to what Walt once thought of him.  One of the things Travis first says is that he bought some land in Paris, Texas because that's where he thought he was conceived.  His dad would kid around saying he first met his wife in Paris, then pause for the Texas part so they would think Paris, France.  The rest of the movie pretty much plays off of this idea.  Everyone around seems to be creating life to fit their views whether it is real or not.  Walt and Anne raised Hunter as their own child, and Hunter even calls them mom and dad.  When Travis comes back Walt tries to get Hunter to see Travis as his real dad, which is upsetting Anne.  She wants to keep things the way they have been.  I mean, Travis and Jane left their child for 4 years, right?  What makes Travis a fit parent?  It might be logical, but again it's just people trying to live in their own fantasy world.  \n\n**SPOILERS**\n\nEverything begins to slow down even more when Travis takes Hunter with him to find Jane, and not in a bad way.  I was so connected with the characters that I wanted to be along with them the entire journey.  I love that Travis finds Jane in the sex place, and when they talk it's full of long shots until they both finish their stories.  And the shot with her close to him at the glass and his face is reflected over hers was perfection.  I really think Paris, Texas is a better film than Wings of Desire, but both show that Wim Winders is a master filmmaker.",
            "review_date": "2011-01-23",
            "source": "rt"
        },
        {
            "content": "Great Wim Wenders film.",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "Clearly well done, if you want to feast on human depravity.",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "Lacrimogen oleacÄ. Da tare bun. Fotografia Ã (R)n genere rupe bucÄÈ>i. Ãn Le Meridien am stat, da nu la Houston, ci la Dallas. SeamÄnÄ.",
            "review_date": "2011-01-22",
            "source": "rt"
        },
        {
            "content": "I enjoyed watching this film. It is a quiet and haunting picture that is lead by an excellent performance from Harry Dean Stanton. He truly delivers a role of a lifetime. I loved the ideas the film had about our memories of things and how they truly are in real life. The main character's journey to find himself and those he has left behind was quite profound. Recommended film.",
            "review_date": "2011-01-21",
            "source": "rt"
        },
        {
            "content": "To see the United States from an outsider's perspective is a wondrous and interesting thing.This film, and its director, really reminded me a lot of Werner Herzog. Both Herzog and Wenders are German, both have done road/journey movies, have used similar Americana type soundtracks, and have made films giving a unique view of the U.S. In this case, it is the southwest. The Herzog film it most reminds me of is my favorite of is: a perplexing and wild and strange gem called \"Stroszek\".\r\n\r\nThis film is just as strange, although I do not find it to quite be the masterpiece it is often heraldd as being. Don't get me wrong, it is fantastic, but I found it hard to get completely immersed in. It's a bit hard to sit through. At times though, when I was able to really tune into the same wavelength this was on, it was quite great.\r\n\r\nThis film begins like some sort of mystery, and indeed it takes the whole film to really find out what happened, but it lacks the traditional shenanigans of the mystery genre. Even when the answers come to light, I was left unsatisfied and wanting more. That's not a bad thing, either.  WHile there is a story and plot, it is not really about those things.\r\n\r\nInstead, this is more of a meditation on character, emotions, loneliness, and despair. That Stanton's character is a man of few words (quite literally) is one of the many things that make this film a curiosity worthy of seeking out. Stanton is a brilliant character actor, and this was his first time to take the lead. He's wonderful, and I wish more people would take advantage of his abilities and let him lead more often.  The little kid gives one of the better and more interesting performances by a child, and Stockwell is also nice. The two women, while pretty good ,left a little to be desired. The performances aren't bad, just overshadowed. \r\n\r\nBesides the acting, the best reaosn to watch this are the music and the cinematography. Ry Cooder's music here is probably the definitive drifter theme in all of cinema and in general. Robby Müller's cinematography is some of the best work done in the last thirty years. From the neon to the vast expanses of landscapes shots, everything looks gorgeous. The way that light and shadow are dealt with is also quite stunning. \r\n\r\nAs mentioend above, this film is a bit trying on the patience. While it could be a little shorter, I think the real issue here is the pacing. It both works for and agaisnt the film. It's good that the story unfolds graudally, because that's part of the intrigue, but I think it takes a bit too long at times, and the viewer may wonder why some stuff is focused on longer than it should be.\r\n\r\nI'm giving this 4.5 or an A- in letter grade terms, but I'm not sure how I really feel about this one. I'm mixed on it, and am not sure how to really accurately describe or grade it. I think that's a sign that this is worth checking out.",
            "review_date": "2011-01-20",
            "source": "rt"
        },
        {
            "content": "I thought I had this movie all figured out.  I thought Travis had gotten into a car accident that killed his wife, and that's why he's mildly catatonic and refuses to drive or sit in the front seat of an automobile.\r\n\r\nWell, now I'll eat my hat.  This movie is, as Jim Hunter describes, \"a long, perambulating film,\" but I never thought it tried to be deep or understated.  There is so much exposition in Travis' confessional that any Intro to Playwriting class would ream it a new arsehole, but for some reason, it works.  Perhaps it's because the characters aren't looking at each other.  Perhaps it's because Harry Dean Stanton is just so straightforward about it all:  his rage, his brutality, his numbness.  He's neither overstated nor understated; he's just stated.  Perhaps it's because of Nastassja Kinski's complex good girl/bad girl duality.  Her coy yet cautious follow-up questions show that she's not entirely naive; she has an inkling about who's on the other side, but she IS still naive enough to will herself to believe it's not so.\r\n\r\nHunter Carson as the precocious, young son is mighty impressive.  Hunter and Jane's reunion scene is so unexpected.  It's not tearful (at first).  It's not resentful.  It's not deep.  It just is.  Hunter gets up, walks over, holds out his arms for an embrace, all at an aching adagio pace.\r\n\r\nLastly, I think I've found a gesture that rivals the inexplicably beautiful woman-putting-on-stud-earrings tableau:  woman's-hand-resting-on-clavicle.  I mean, looking like Nastassja Kinski might help too.",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "A long quiet film, mostly dull but with some certain powerful scenes. Was lauded at the time because critics were aghast at the end of 1970s angst cinema and the rise of the glossy, artificial styles of the 1980s. Can't blame them even if I love both styles.",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "This just about sums it up: http://movies.nytimes.com/movie/review?res=9507E7D61639F937A25753C1A962948260",
            "review_date": "2011-01-11",
            "source": "rt"
        },
        {
            "content": "Really enjoyable, slow paced and sparse dialogue but nevertheless, great characters.",
            "review_date": "2011-01-11",
            "source": "rt"
        },
        {
            "content": "One of the most underrated films ever made!",
            "review_date": "2010-12-29",
            "source": "rt"
        },
        {
            "content": "The film opens with a man walking in worn-out shoes across the desert, and that image perfectly describes my feelings about the film as a whole.  It is a long, perambulating film that tries to be understated but ends up as a let-down that even Sam Shepherd's beautiful writing, Harry Dean Stanton's fine acting, and Nastassja Kinski's gorgeous face (she's the prettiest crier since Ingrid Bergman) can't save.  Much of act one does little to set up the film's primary conflict, which doesn't really reveal itself until midway through act two, which is too long to wait to understand to what dramatic question we should attach ourselves.  And even the reason why Stanton's character finds direction on his journey is ironically too quickly developed and resolved.  I found myself thinking that even a seven-year-old in all his seven-year-old naivete wouldn't forgive that easily.\nOverall, I think the film should have started about forty minutes into the story, and it would have achieved the same effect.",
            "review_date": "2010-12-13",
            "source": "rt"
        },
        {
            "content": "Wim Wenders' opus is an intriguingly enigmatic, though uneven effort. Cinematographer Robby Muller has captured some stunning images of the American West, and there are excellent performances by a superb cast. It's biggest flaw is its meandering pacing - which can be hypnotic at times, deadening at others. Not the masterpiece some have made it out to be, but a fascinating piece of work.",
            "review_date": "2010-12-08",
            "source": "rt"
        },
        {
            "content": "Somber and beautiful. A must see.",
            "review_date": "2010-12-06",
            "source": "rt"
        },
        {
            "content": "Just about everyone seems to love this movie. Maybe it's an American type thing that I don't quite understand? IMDB tells me this was Kurt Cobain's favourite movie. Then again, Cobain married Courtney Love...\n\nAnyway, the acting does deserve a thumbs up, other than that it didn't do much for me.",
            "review_date": "2010-12-04",
            "source": "rt"
        },
        {
            "content": "A beautiful movie: it's the perfect amalgamation of 'American cinema' and 'European cinema'.",
            "review_date": "2010-12-02",
            "source": "rt"
        },
        {
            "content": "A convincing, moving, and quite often beautiful film.  Stanton is terrific in the lead role of a \"damaged\" man, a role that often gives me pause since it's usually done terribly...Half Nelson, anyone?  Yet Wenders treats this extremely delicate material just right, as even one misstep could have been fatal.  The film's southern landscape looks terrific (and doesn't force its obvious metaphors, so more bonus points to the filmmakers) and the performances from Stanton & Kinski in particular range from merely excellent to sublime.  And with Criterion's great DVD and outstanding Blu-Ray of the film, there's no reason not to see it.  So see it.",
            "review_date": "2010-11-29",
            "source": "rt"
        },
        {
            "content": "And for the first time, he wished he were far away. Lost in a deep, vast country where nobody knew him. Somewhere without language, or streets. He dreamed about this place without knowing its name. And when he woke up, he was on fire.",
            "review_date": "2010-11-21",
            "source": "rt"
        },
        {
            "content": "Wim Wenders' whimsical tale certainly looks beautiful, but such stunning cinematography involuntarily overshadows the rest of this almost masterpiece. There is a nicely crafted story and some convincing acting from the entire cast - especially Harry Dean Stanton and a young Hunter Carson playing father and son. Although quite lengthy, the film goes by rather quickly which may be due in part to its road-movie status. Many different landscapes, from the Arizona desert to the Los Angeles and Dallas skyline, are documented with an insatiable eye. Wenders' style is unmistakable and sometimes a little overambitious; he does capture the beauty of an ignored United States, yet the story he tells is strong enough that he hardly needs such superfluous composition. As for the narrative, its shrouded and enigmatic details are fitting before the unveiling of a big, however anticlimactic surprise. A final confrontation between husband and wife is somewhat overdramatic to the point of Sirkian absurdity. This scene begins on the right foot, but about halfway through its twenty-minute duration becomes overwrought in its message and noticeable in form. Many of the other scenes like this contain moments of sheer brilliance that hide the failings and, ultimately, make it worthy of a look.",
            "review_date": "2010-11-16",
            "source": "rt"
        },
        {
            "content": "Já dizia o mestre Wes Anderson: \"Família não é uma palavra. É uma sentença.\" Não poderia esta afirmação ser mais correta. Família prende, lhe guia e lhe esmaga. Você não sai de uma família, mesmo que a abandone. Você permanece com ela, mesmo que seja só no sobrenome. Este maldito sobrenome lhe trás memórias, sejam felizes, sejam dolorosas, mas trasem. Toda vez que você pensa que sai, ela lhe puxa de volta.\r\n\r\nE é sabendo disso que o lendário cineasta alemão Wim Wenders (Asas do Destino, Quarto 666) faz, talvez, seu mais famoso, e melhor, filme. Paris, Texas é um filme tocante, singelo, absurdamente simples e igualmente fantástico. Uma história que, assim como as famílias, lhe pega quando você pensa que já saiu (ou, no caso, superou o que acabou de ver). É simplesmente fenomenal o trabalho que Wim Wenders faz neste filme para contar a história de Travis (Bickle?). Um homem atordoado, entorpecido, sem destino ou memória, que vive num cenário interior desolador.\r\n\r\nInicialmente conhecemos Travis (Harry Dean Stanton e suas orelhas de abano) numa cena lendária. Ele está no meio do deserto do Mojave, num ponto esquecido por Deus, com aminésia e um galão de água, vestido num terno absurdamente surrado e com um boné de baseball. Não há sinal de civilização por milhas e milhas de distância. Então ele começa a andar.\r\n\r\nApós desmaiar num bar enquanto comia gelo, Travis vai parar no hospital. Com base em seus documentos o médico chama por seu irmão Walt (Dean Stockwell) para resgatá-lo. A partir deste momento sabemos que Travis estava desaparecido por quatro anos e tem um filho e sua esposa (Natassja Kinski) também sumiu. Tudo o que se sabe é que ela manda mensalmente dinheiro para mesada do filho, que se chama Hunter (Hunter Carson). O resto do filme concentra-se \"volta para si\" de Travis e no seu esforço para recuperar o amor do filho perdido e, quem sabe, juntar-se novamente a esposa.\r\n\r\nO brilhantismo de Wenders é nítido desde o primeiro frame do filme. O modo como o cineasta alemão divide o filme e o seu senso de timing é perfeito. Primeiramente o Paris, Texas é um road movie que toma lugar no deserto desolador e escaldante do Texas, depois vira um intenso drama familiar de reconquista do amor (a segunda melhor parte do filme, com certeza), a volta para o road movie e o retorno do drama familiar, agora como tema o reencontro. Estas quatro divisões são fundamentais para a compreensão. E estas quatro divisões são suficientes para Wenders destilar todo o seu talento.\r\n\r\nAuxiliado por um denso roteiro escrito pelo ator e dramaturgo Sam Shepard (também escritor de um outro filme de Wenders, A Estrela Solitária e um dos autores do retumbante fracasso de Michelangelo Antonioni, Zabriskie Point), Wenders constrói diálogos ímpares na história do cinema. E cenas ímpares também. O que não dizer da cena em que Travis vai buscar seu filho pela primeira vez, e volta de mãos vazias por que Hunter, o garoto, acha as roupas do pai simplesmente ridículas? Paris, Texas é um retrato maravilhoso de um homem que quer sua identidade de volta e, no processo, acaba em trânsito, com uma mudança de valores (no caso de Travis, ele não tinha nenhum, pois nem memória tinha).\r\n\r\nAlém de tudo isso as atuações do elenco são ótimas. Harry Dean Steanton é um ótimo Travis. Sua cara espantada no início do filme é um porta-retrato perfeito para sua personalidade entorpecida. Dean Stockwell está ótimo, assim como Aurore Clement. O iniciante Hunter Carson está perfeito em seu papel (sim, ele está muito confortável com a personagem que leva seu nome). Para completar o time de protagonistas, Natassja Kinski está perfeita em uma peruca loira. Aliás, sua atuação na cena do espelho está linda.\r\n\r\nParis, Texas é o título perfeito para esta tour de force pela mente do seu protagonista. Uma análise psicológica ímpar na história do cinema, uma viagem ao deserto que cerca Travis, mesmo quando está cercado de gente. Este deserto o deixa sem destino. Quando Travis volta a si, descobre as coisas do seu passado, parece pensar se não era melhor estar no deserto, sem ninguém. Ele percebe que é um estranho no ninho. Um ser falso. A piada que seu pai contava sobre sua mãe é uma metáfora até sobre si mesmo. E esta tour de force tem como a cereja no bolo a fotografia perfeita de Robby Müller e a trilha sonora tocante de Ry Cooder. Todos estes elementos convergem para uma cena única, a melhor do filme, e talvez o melhor acerto de contas na história do cinema: a supracitada cena do espelho.\r\n\r\nParis, Texas é a metáfora do deslocamento. Um lugar chamado Paris não é para estar no Texas. Assim como Travis não deveria estar no deserto, ou em lugar algum, que não seja com Jane e Hunter. E nem isso ele parece conseguir fazer direito. Travis é quase um Iuri Jivago. Um Werther da vida.\r\n\r\n    \"Papai dizia que conheceu a mamãe em Paris. Daí ele fazia uma pausa e concluia: 'Texas. Paris, Texas'. Era uma piada muito engraçada. Até que ele realmente passou a acreditar que a conheceu em Paris.\"",
            "review_date": "2010-11-13",
            "source": "rt"
        },
        {
            "content": "Bored me a bit but Natassja Kinski gives the performance of a lifetime.",
            "review_date": "2010-11-03",
            "source": "rt"
        },
        {
            "content": "I had surprisingly never even heard of this movie until the recent Criterion release put it on my radar.  Having seen and appreciated Wenders' Picnic at Hanging Rock, I decided to check this out.  I must say, I have absolutely no idea why this movie isn't more well known.  The cinematography was superb; being well executed and the lighting created a wonderful atmosphere.  The performances of the actors were perfect, my favorite scene being where Travis and Jane [sort of] first come face to face.  There was an electricity in the air and a great sense of sadness, anguish, and self-reflection.  While the movie offers up very few answers, I believe it was stronger for it.  Highly recommended, this is a must see film.",
            "review_date": "2010-11-01",
            "source": "rt"
        },
        {
            "content": "It was quite a bit less boring than I expected.",
            "review_date": "2010-10-27",
            "source": "rt"
        },
        {
            "content": "A unique take on the road trip film like only Wim Winders can do. The last 20 minutes are absolutely astounding.",
            "review_date": "2010-10-25",
            "source": "rt"
        },
        {
            "content": "Score breakdown by categories :\n*arranged according to level of relevance to this film*\n\nacting 5/5\nStory 3/5\nDirecting 4/5\nCinematography 4/5\nEditing 4/5\nconcept 4/5\nCinematic expression 3.5/5\nSoundtrack 3/5\nStyle 3/5\nDesign 2/5\n\nFundamental values:\n\nOpening 4/5\nEnding 3/5\nIntegrity 4/5\nReplayability 4/5",
            "review_date": "2010-10-23",
            "source": "rt"
        },
        {
            "content": "Exploring what the concept of a family establishes in the society of today. Suggestive soundtrack, fantastic photography and philosophical narrative, still delivering a strong and emotional plot.",
            "review_date": "2010-10-11",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and well acted by Stanton...Takes awhile to get into but the final 20 minutes are some of the most powerful and meaningful scenes that make up for a slow start.",
            "review_date": "2010-10-07",
            "source": "rt"
        },
        {
            "content": "Not less than a masterpiece, the most impressive thing about this film is its cinematography, which mirrors perfectly with Protagonistâ(TM)s stark reality and lost dreams. Its absolute stunning imagery is like watching a skillful artistâ(TM)s painting, which depicts a story through symbolism and colors only...",
            "review_date": "2010-10-07",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. It builds like a thriller and ends in emotional devastation and/or triumph, depending on your view point.",
            "review_date": "2010-10-05",
            "source": "rt"
        },
        {
            "content": "Brilliant. Harry Dean Stanton is amazing in this great movie.",
            "review_date": "2010-09-30",
            "source": "rt"
        },
        {
            "content": "Rating: 3.7/5. One of the finest films I seen. Direction is really good by Wim Wenders. Great cinematography, with wonderful performances by Stanton, Kinski, and Carson(the little boy). Watch it!",
            "review_date": "2010-09-25",
            "source": "rt"
        },
        {
            "content": "What a beauty of a film. The colours are too wowwie for me!",
            "review_date": "2010-09-22",
            "source": "rt"
        },
        {
            "content": "Wow. Paris, Texas is a trememdously brilliant, deep, unusual movie whcih Roger Ebert described in his 1984 review as 'defiantly individual' and this it certainly is. It's impossible to guess from the exposition where exactly the movie is going to go - just like Stanton's character. Where has he been? Where is he going? Does he even know?\r\n\r\nLike Herzog's equally brilliant 'Stroszek', to which this movie may be destined to be forever compared, it is the director's 'America' movie using similar imagery, from the bold scenes of the desert vistas and the railroads and the trailer parks to much more subtle images (such as a trucker's cap with the word 'Stetson' written on it serving as a metonymic device for the real thing).\r\n\r\nThe denouement is one of the most interesting and unique in any movie I have ever come across. It is certainly not uplifting, but at the same time it is not deeply saddening. It is not predictable or trite but is definitely not 'wild' or 'David Lynch'. It is full of heart, full of words but at the same time echoes with a hollow apathy as the characters, without spoiling the plot, seem to finally come to terms with their detachment and do little more than break even. It's a wonderful, emotional work of art.",
            "review_date": "2010-09-20",
            "source": "rt"
        },
        {
            "content": "I love this film, a perfect combination of cinematic elements. As contradictory as it sounds it's a mood film...with a narrative. A Film schoolboy's wet dream",
            "review_date": "2010-09-12",
            "source": "rt"
        },
        {
            "content": "Paris,Texas on bluray. Wim Wenders' pensive road flick. Amazing cinematography of a battered, dusty neon-lit American West.  Robby Muller's camera-work is so influential. Harry Dean Stanton gives a sublimely aching and child-like performance.  It's hard to imagine the film without the acoustic guitar of Ry Cooder.   Despite it's slow pace, this film offers patient viewers a treat , dealing with understated emotions and the cruelness of things left unsaid.  5 out of 5 sturm und drang",
            "review_date": "2010-09-04",
            "source": "rt"
        },
        {
            "content": "A beautiful and involving film about a man coming alive, with a leading performance by Harry Dean Stanton that shows him to be underappreciated.",
            "review_date": "2010-09-02",
            "source": "rt"
        },
        {
            "content": "It's a very slow picture but at the same time it's not boring. The last quarter of the picture is mesmerizing thanks to the great performances by Harry Dean Stanton and Nastassja Kinski.",
            "review_date": "2010-08-17",
            "source": "rt"
        },
        {
            "content": "slow moving but makes the climax all the more intense and absorbing for it. good score too.",
            "review_date": "2010-08-12",
            "source": "rt"
        },
        {
            "content": "i hadn't seen this in a long, long while but i just got it on blu-ray. could this film be any better? i don't think so. the cinematography, cast, screenplay, score and pacing are all totally perfect. it just occurred to me that, of the films i'd put in a list of my favorites ever, this is the only one devoid of sex, violence or laughs. this movie is all love, however fucked up and fractured that love might be. if you haven't seen this, or if it's been a while, get on it. it's good for your soul.",
            "review_date": "2010-08-11",
            "source": "rt"
        },
        {
            "content": "A film that only those who have their hearts broken can truly appreciate. A journey into lost souls and emptiness. Parix, Texas have touched me profoundly, it have never failed to take me all the way back to the memory lanes of my teenage years.",
            "review_date": "2010-08-08",
            "source": "rt"
        },
        {
            "content": "The strange events and superb cinematography at the beginning of the film set the tone. The minimalistic music from Ry Cooder is a perfect match with the minimalistic decor. A very good film with a story slowly unraveling to beautifully shot scenes.",
            "review_date": "2010-08-01",
            "source": "rt"
        },
        {
            "content": "Esse Ã© lindo.... Um cara que largou tudo e acidentalmente volta para reconstruir sua famÃ­lia e se reintegrar a sociedade.. isso Ã© bem um resumo mesmo. E Nastassja Kinski estava simplesmente linda.",
            "review_date": "2010-07-22",
            "source": "rt"
        },
        {
            "content": "This is such a powerfully visual film.  The cinematography was breathtaking and immersing.  The story is very emotionally investing also.  The slow pace lets audiences fall into the characters and the environment.  Another utterly satisfying criterion release.",
            "review_date": "2010-06-22",
            "source": "rt"
        },
        {
            "content": "What the most precious thing would you put under the pillow? \nThis is a plain movie.  Nothing fancy here, but a slowly, gently told story.  I like the way the guy walking his son home, and also love how the director shoot the movie, light but hit audience's heart heavily.  All actors, just five of them, are excellent and fit into the roles.  This is a plain movie, a plain good movie.",
            "review_date": "2010-06-13",
            "source": "rt"
        },
        {
            "content": "It started out with an opening scene with a western-type editing. We see a man walking in a no man's land and we wonder how he got there. He's not a man going into a mission, but more like coming back from a failed one. He's Travis, a man who unofficially took a vow of silence and is heading towards uncertainty. \"Paris, Texas\" is a Macguiffn of a title, making us audiences believe that it is Travis' ultimate destination, only finding out that there is more to him to redeem than a piece of a dry land. The main character was played by character actor Harry Dean Stanton in one of his rare leading roles. Producers must have found him fairly unsuitable for a lead in terms of physical appearance, but no one dared to look at his ability to evoke great amount of emotions in such small ounces of effort. The climactic scene is the ultimate proof of this claim. Many sentimental pictures in the mainstream scene concerning reconciliatory themes have characters that are tailor-made for audiences to empathize with, and all rushing into a satisfactory ending to finish the story. But \"Paris, Texas\" made it an hour longer than the usual, completing the circle of emotions with subtle ease. And though the characters were literally throwing out their repressed emotions, it never felt contrived. The end scene of Travis'  face with a faint glint of smile, has able to support the heavy pour out of emotions in the earlier scene, which only proved the film's literal, emotional power.",
            "review_date": "2010-06-07",
            "source": "rt"
        },
        {
            "content": "One of the most achingly beautiful movies I will ever see. Although I first saw it many years ago (and many times since then), I was just thinking about it and remembering how perfect is. Penned by the unfairly talented Sam Shepherd and directed by the great Wim Wendors - you really have a head start there. Nastassja Kinski is the loveliest and Harry Dean will break your heart in half.",
            "review_date": "2010-05-29",
            "source": "rt"
        },
        {
            "content": "1984's Palme d'Or at Cannes by unanimous vote. A beautifully shot-and-colored cinematic tribute from German director Wim Wenders and cinematographer Robby Muller toward their vision of classic Americana.\n\n Massive vistas of blue skies, white clouds, dark storms and orange sunsets. The artful neon and dingy rooms of mid-Century motels. Towering stone monuments within the Mojave Desert. The skyline of Houston. A conversation under an L.A. spaghetti junction. A 3am pit-stop diner with a massive T-Rex out front. All this imagery and so much more, drawn from nearly 100% location shoots and authentic props. \n\nCriterion's restoration is outstanding; images are top-notch crisp and color/lighting is outstanding (and highly innovative). Composition is often extraordinary. Note, for example, in-car shots where the rear-view mirror image and the highway far ahead are both simultaneously in perfect focus.\n\n Ry Cooder's twangy-bluesy slide guitar echoes precisely and sadly the 'hollow man in search of redemption' that Harry Dean Stanton delivers. \n\nThe film opens with Stanton found wandering in the desert, after he and his wife disappeared four years prior, abandoning their child in care of Stanton's brother. Then the viewer's on-the-hook for 2.5 hours to find out what really happened. \n\nThe film's split into two parts. Only the first 80 minutes was scripted/plotted pre-production, and that time flows slower than molasses under sparse, focused dialogue authored by Sam Shepard. Then Wenders - sans script, storyboards or plotline - starts winging it. The pace quickens, much is improvised, loose ends dangle - and Stanton's delivery gets stronger with every passing frame. \n\nThough the viewer waits far too long for it, Stanton's near-fin spousal reunion/confessional (also scripted by Shepard) is undoubtedly one of cinema's great works of drama and visual composition. \n\nWenders' commentary is worthy. \n\nRECOMMENDATION: See it. Serious plot-patience is required up front, but visuals astound throughout.",
            "review_date": "2010-05-20",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a rarity in the world of cinema. It's not only abnormally impressive on a technical level; it manages to transcend the boundaries a film of its type would normally conform to in an attempt to make a name for itself. This in mind, Wenders' singular creative touches take an ordinary tale of self-realization and eventual reconciliation in an attempt to better oneself to a level I've never before seen, regardless of how simplistic the protagonist's circumstances are.\r\n\r\nGranted, Harry Dean Stanton's excellent portrayal of central character Travis' plight as an individual struggling to come to terms with the poor choices he's made in relation to those he loves the most isn't necessarily groundbreaking, but to disavow the film's genuineness in this regard would be unfair to say the least. The interaction between him and every other character, his son included, almost always serves as a proverbial key to discovering the truth behind Travis and the reasoning behind his behavior, but the film's latter act can appear to some as a tad rushed despite how satisfying it is as a means of giving both Travis and his estranged wife a much-needed sense of closure. All in all, Paris, Texas is an extraordinarily well-acted, thoughtfully paced and beautifully shot piece of cinema that provides valuable insight behind the ideas of love lost and an individual's attempt to essentially fix what's been broken.",
            "review_date": "2010-05-18",
            "source": "rt"
        },
        {
            "content": "My favorite of all time.",
            "review_date": "2010-05-16",
            "source": "rt"
        },
        {
            "content": "I like it, but I do question the ending. . .",
            "review_date": "2010-05-12",
            "source": "rt"
        },
        {
            "content": "With no real scenes of stunning beauty and no sweeping shots like in Gone with the Wind, how this becomes a visual mesmerizing piece of art is the gift of a great director and cast. Tender loving film.\nHigh notes -\nDr - Wim Wenders.\nAc - Harry Dean Stanton, Natassja Kinski.\nPhotogrophy\nScript\nMusic - Ry Cooder.",
            "review_date": "2010-05-12",
            "source": "rt"
        },
        {
            "content": "What a subliminal and beautiful film! I didn't care of these characters. Actually I had somewhat negative first impressions on all of these characters and ended up caring and sympathizing with each and every one of them. Great story line and great acting especially from Harry Dean Stanton whom I remember faces from so many movies but never cared to remember the name.",
            "review_date": "2010-05-07",
            "source": "rt"
        },
        {
            "content": "This is one of those 'every serious film buff needs to see this' movies. A huge critical success (it has a 100% rating on Rotten Tomatoes), Paris, Texas is a drama that takes its time to explain itself. Very slow moving. But interesting and involving every step of the way, thanks to great performances, great scenery and that ever persistent need to figure out what the hell happened to this guy! It takes its sweet time finally explaining that too. \nSo if you like your movies to unfold themselves at a brisk pace, or like a little action with your drama, skip this. If you're looking for a well told, well acted slice of American drama, welcome to Paris, Texas.",
            "review_date": "2010-05-01",
            "source": "rt"
        },
        {
            "content": "Gorgeous beyond belief. Shed some new light about Sam Shepard for me. His script is absolutely magnetic while only using simple every day dialogue that is very real. That is the brilliance of Shepard, he can say so much with few words. There is not much action at all, it's slow paced with well shot on the road scenes, but there is so much magical camera work that captures bright blue colored skies and haunting imagery like subdued neon lights that gives it such a personal and solitary atmosphere. The chemistry of all the actors is what carries it to a fundamental level. Harry Dean Stanton gave a performance of a life time with everyone else not far behind him. I always have this giant pain in my heart in the famous booth scene and at the end. So heart breaking and yet so moving. Consistently keeps me thinking about it after it ends.",
            "review_date": "2010-04-26",
            "source": "rt"
        },
        {
            "content": "I liked it, especially the whole mirror-telephone scene, which was a unique scene, but I would have definitely cut several scenes out of this movie, as its content didn't justify its length...",
            "review_date": "2010-04-23",
            "source": "rt"
        },
        {
            "content": "Wim Wenders followed a great tradition of Germans working in America with \"Paris, Texas\", and like his forebears Murnau and Lang along with his fellow German New Wave figurehead Herzog, he made an exceptional film that won the Palme D'or at Cannes. Shot in the American west, it takes a relatively simple storyline of a man's attempts to remember who he is and reconnect with his family and turns it into an epic examination of loneliness and the bond which ties families together. \n\nThe opening shot of the film shows just how barren and empty the landscape is, standing in the middle of it all is Travis, a man who is 2 minutes away from collapsing from dehydration and hundreds of miles from his brother Walt who comes to pick him up and take him back to LA. On the drive back, we discover that Travis has been away for 4 years, has a 7 year old son called Hunter and a wife called Jane whose whereabouts are unknown. \n\nLots of questions arise from this early premise: Where was he for 4 years? What did he do? Why did he leave? Where is his wife? But Wenders doesn't give any quick and easy answers away, he takes his time with the material, lets Travis ease back into a normal way of life until he figures out what he wants to do, and not what everyone else thinks he should do. Walt tries to give him space right at the start, putting on a happy face + making small talk to gain his trust, but deep down you know he's just equally upset and angry at Travis for leaving and simply wants a reason for his departure. \n\nWalt and his wife Anne have been taking care of Hunter for the last 4 years and have become very attached to the lad, who after some initial dislike starts to warm towards Travis after the two walk home from school in one incredibly touching scene, leaving Walt + Anne worried that he won't be as close with them as before. In a way they know the boy should be with his real father, but it still hurts that their bond may become weaker now that Travis is back in the picture. Even more so when Travis tells Hunter that he wants to find Jane so the 3 of them can be a family together.\n\nSam Shepard's Searchers-esque screenplay is as bare as the landscape Travis inhabits right at the start of the film, but Wim Wenders has crafted a gloriously beautiful film with some gorgeous neon-lit shades of various colours helping you feel Travis' moods along with every twang of Ry Cooder's award-winning guitar soundtrack. Harry Dean Stanton has had minor roles in major films up until \"Paris, Texas\", and he doesn't disappoint in the lead role, remaining a sympathetic enigma throughout with very strong support from Nastassja Kinski, Dean Stockwell and a hugely underlooked child performance from Hunter Carson. \n\nKurt Cobain cited this as his favourite film and it ain't hard to see why: \"Paris, Texas\" is a beautifully simple story filled with so much feeling it's hard not to fall under its spell. Even with a 2 and a half hour length I feel like I could watch it anytime, it's an outsider's view of America with some nice observations on the culture and its effects on the people who can't relate to it.",
            "review_date": "2010-04-22",
            "source": "rt"
        },
        {
            "content": "Like all real cinema, this movie perfectly conveys the ineffable in moving images. Vast barren western landscapes, perfectly captured moments of time, place, and light, a story that combines a nearly universal simplicity with deep oddness and mystery (a lost man with no words or memories, whose silence and almost sweet simplemindedness mask a disturbing personal history), a gradual shift from no dialogue to almost pure narration, and an initially quaint soundtrack that grows increasingly haunting--it's all indescribably lovely and sad. And Criterion's recently rereleased version is astonishingly beautiful, a like-new print.",
            "review_date": "2010-04-20",
            "source": "rt"
        },
        {
            "content": "More powerful with every watch. Unfortunately I can't rate this any higher.\n\nBeautiful imagery of the US South West, with a hypnotic soundtrack from Ry Cooder whose haunting slide guitar fits perfectly with both the visuals and mirrors the minds of the characters. Perhaps my favourite movie soundtrack of all time.",
            "review_date": "2010-04-18",
            "source": "rt"
        },
        {
            "content": "Should be screened alongside every public presentation of the Gospel. One of cinemaâs perfect examples of honest active redemption and the mending of brokenness.",
            "review_date": "2010-04-17",
            "source": "rt"
        },
        {
            "content": "To my shame, I only just watched this for the first time.  Needless to say, I was blown away by this beautifully shot film about a man coming to terms with himself.  Someone was telling me that the final monologue Harry Dean Stanton gives in the booth was made up and recited to Stanton on the spot by Sam Shepard after the scripted monologue wasn?t working.  Amazing.",
            "review_date": "2010-04-17",
            "source": "rt"
        },
        {
            "content": "it's the 3rd time I saw \" Paris, Taxas \", it's a really Perfect film, Great road movie ! I like both of Harry Dean Stanton and Dean Stockwell's wonderful acting, and so touching was everytime when the background music guitar playing... it will go deep into your heart.",
            "review_date": "2010-04-15",
            "source": "rt"
        },
        {
            "content": "Wim Wenders Paris, Texas portrays life as viewed from a strange, dream like perspective. It captures the turbulent avenues of the human heart, the halcyon nostalgia of memory as travelled through a barren, windswept landscape of days and years. The tiny eccentricities the make us human and the highways as mapped out of its mortal entirety. And at the risk of sounding patronising (patronising moi?) I would suggest the viewer has to be travelled a little in years themselves in order to truly appreciate its story, if not its superb artistry. \r\n\tHarry Dean Stanton plays Travis, a man who for four years has been wandering aimlessly the ghostly Mohave landscape. His brother Walt (Dean Stockwell)finds him out there, having thought him dead, and together they travel back to California where Travis meets his young son whom Walt and his wife have reared themselves. The dialogue is sprinkled with strangely beautiful quirks for instance when Paul explains to his brother that he works for a company that makes highway billboards Travis says\" Oh, so you are the one who makes them, some of those are really beautiful\" as though his brother were the only one who constructed them. The cinematography and direction is transcendental;all played out to a spectral slide guitar soundtrack. from the haunting super eight films that visage the days of young love. To the landscape of ghostly roads, neon lit petrol stations, skeletal railway lines and midnight cafes. To the final heartbreaking third where the conversations between Stanton and an exquisite Natasha Kinski concludes in an act of selfless love sublime... \r\nThe human heart deserves more than mere escapist entertainment, the detritus and junk food fodder than fills our cinema screens, the human heart deserves Paris, Texas.",
            "review_date": "2010-04-15",
            "source": "rt"
        },
        {
            "content": "215: Great america road movie. Great performances by Harry Dean Stanton and Nastassja Kinski, and one of the best best child acting by Hunter Carson.",
            "review_date": "2010-04-09",
            "source": "rt"
        },
        {
            "content": "Amazing film, with touching performances, beautiful landscapes and gripping narrative.",
            "review_date": "2010-03-30",
            "source": "rt"
        },
        {
            "content": "A place for dreams. A place for heartbreak. A place to pick up the pieces.\n\nA place for dreams. A place for heartbreak. A place to pick up the pieces.\n\nTravis es un hombre perturbado. Ha estado vagando por el desierto por un tiempo indefinido hasta que a falta de agua se derrumba en un bar. Ahí es cuando contactan a su hermano para que lo vaya a buscar, lo cual hace. Travis no se comunica y lo que le pasó es un misterio. Lo único que sabemos es que lleva un gran dolor encima. Poco a poco se va abriendo y vemos la odisea que lo lleva a restablecer una relación con su hijo y a buscar a su esposa para pedirle un inusual favor. Paris, Texas es una película que hay que verla con paciencia, ya que se mueve lento y no le da una recompensa sino al que espera. Es filmada de la misma manera con largas tomas al vacío. Pero no por eso deja de tener un gran peso sentimental, y la gran recompensa llega en la escena donde Travis se encuentra con su esposa y a través de un vidrio vemos la dolorosa distancia que hay entre ellos y todo el dolor que ha enterrado con el tiempo, y es una de mis escenas favoritas en el cine, porque se toma su tiempo y ningún momento es manipuladora, sino que somos testigos de una relación deteriorada. Paris, Texas es un logro cinematográfico, porque es un recordatorio que menos es más, y si se tiene una historia sólida, hay que dejar que se cuente sola y no hace falta forzarla. Los ojos de Travis dicen más que mil palabras, y sabemos desde el principio que todo este viaje no se trata de que tenga un final feliz, sino que finalmente tenga la tranquilidad al saber que hizo lo correcto.",
            "review_date": "2010-03-29",
            "source": "rt"
        },
        {
            "content": "wow i actually cried twice watchin this film, hehe, what a great film, has a real emotion, a lot of beautiful scenes, convincing acting, and a neat cinematography",
            "review_date": "2010-03-24",
            "source": "rt"
        },
        {
            "content": "Mixed feelings about this movie, but the one thing I know is that the photography is GORGEOUS.  Truly brilliant cinematography, some of it reminds me very much of some of Christopher Doyle's work with Wong Kar Wai, just beautiful painting with the camera.  Slow, but compelling through the first 2/3rds, then it got really bogged down in long monologues which weren't strong enough to keep the movie going despite some incredible acting.  Impressive, but not really my cup of tea exactly, it needed to be cut tighter and written more tautly IMO.\n\nThe Criterion BD is visually brilliant, *except* for some moderate EE which was unfortunate, and some aliasing, perhaps it was a 2K scan tweaked to 1920?  Hard to say.",
            "review_date": "2010-03-24",
            "source": "rt"
        },
        {
            "content": "movie is a simply a moving and wandering stuff......If you wants to find your real realtionship means what.......just check out this.\r\nwim winder's one of best classic...  the movie's editing in last phase of the reel goes fantastic...... story,character and all technical elements speaks the briallance by keeping all it pace together......wow...!!  Overall good feeling and uplifting.......",
            "review_date": "2010-03-21",
            "source": "rt"
        },
        {
            "content": "This is a cinematic emotional masterpiece with a core that points straight to the things we love and says, Are we in love with them as they are, or as we imagine them to be?\r\n\r\nThe title is a perfect representation of this point; it's the town where Travis, played by Harry Dean Stanton in probably his best role on screen, was conceived and where his father said his mother was from, without giving the name of the state, only the town. Paris--as in France--is the fantasy. Paris--as in Texas--is the reality. Did his father love his mother for what she was, a plain girl from Texas, or what he imagined her to be, a \"fancy woman\" from France?\r\n\r\nTravis has the same problem; he's the real focus of the film and around him the Texas twilight casts long, sad shadows that glisten with hope, brilliant colors, and soon to be approaching night. In him's a heart that's torn between his love for what he knows and for what he wants to run away from, between his son, Hunter, his ex-wife Jane, and himself. The only one of these he knows is real is his son, who's the second core of the film. Hunter is the reality of his marriage to Jane (SEXY LADY) Nastassja Kinski, the one thing he knows is solid and true and right in front of him.\r\n\r\nNobody makes films like this anymore. This was done in 1984 and deservedly won a Palmes d'Or prize at the Cannes Film Festival, one of the top awards given to a film director.\r\n\r\nNobody makes films with this much heart anymore. Things have changed.\r\n\r\nThings have changed.",
            "review_date": "2010-03-16",
            "source": "rt"
        },
        {
            "content": "Sometimes challenging, but mostly straight forward family drama.",
            "review_date": "2010-03-16",
            "source": "rt"
        },
        {
            "content": "nearly perfect film. beautifully shot and acted. emotionally powerful.",
            "review_date": "2010-03-15",
            "source": "rt"
        },
        {
            "content": "The first half is dominated by the acting strength of Harry Dean Stanton and Dean Stockwell. It drew me in, and I became immersed in the characters and mood. In a way, I wasn't concerned about the reason behind Travis's disappearance. I got the feeling that Wenders wanted us to concentrate more on the characters on screen and their current actions. I was moved by the scene with the home movie and the sweetness of Travis's attempts to entertain his estranged son.\n\nWhen the film moved into the second and third acts I was felt less involved somehow and lost a little connection with Travis as he met with his past. The final scenes were directed with great skill and Stanton especially shone but I preferred the first hour.",
            "review_date": "2010-03-09",
            "source": "rt"
        },
        {
            "content": "I am all for giving characters time to establish and evolve, but spending over two hours practically sitting on the plot's hands then deciding in the last 10 minutes \"ok let's wrap this up\" is nowhere near as masterful as the gorgeous colors and cinematography on display here. The \"No More Heroes\" games took some great cues here.",
            "review_date": "2010-03-02",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a film that encompasses so much human emotion and spiritual drive; a film that travels such sociological lengths within the human mind just as it does physically in space and setting. The film begins in a dusty and lonely desert location, but journeys from here to busy airports; to contemporary American suburbs to the highways connecting these places, to apartments in towering buildings and right on to sleazy performance houses located within the deep, deep crevices of large cities. The sense of travel is important; the sense of journey is apparent. One of my favourite scenes-come-shots in the film occurs when the film's lead stares out of his brother's garden overlooking a highway and an airport runway. No one says or does anything, the character just sits and observes all this activity going on as he forms thoughts in his head; thoughts linked to the fact he must conclude a certain journey he has begins to realise he has already undertaken.\r\n\r\nThe film begins with a lone man walking through a desert, he is Travis Henderson (Stanton) and wears a rugged and unshaven look as he potters about in a smart, but dusty, suit. Eventually, his brother named Walt (Stockwell) drives out to meet him after being called out by an individual that comes into possession of Travis' wallet, and attempts to figure out what happened. Quite quickly, director Wim Wenders combines beautiful scenery; the bending and twisting of conventions when we see a formally dressed man in a place we don't expect to see a formally dressed man; and an element of mystery when it transpires Travis' memory is less than perfect and he's been out of contact for four years. Additionally, when asked what happened – Travis rejects the question, tiptoeing around it and further placing it on a back-burner. All that he does reveal, to begin with, is the explanation of the title; that being that he wants to own a small plot of land in Paris, Texas – something he's been observing via a small photograph for all these years. This gives the film an initial overall direction, or something for its mysterious, mute character to aim for.\r\n\r\nPart of the film's underlying effectiveness is the way Wenders allows us to slowly get involved with characters like Travis. Initially, the audience is invited to toy with a few ideas surrounding him. Do we think he's in trouble with someone? Is he on the run? Can we trust him when he's driving for Walt? Can we trust him when Walt (who knows about as much as we do at most points and thus; speaks for us, the audience) leaves him alone in the motel room as to not merely run off again? The answer to that last question is 'not really' and when it transpires Travis does run away from Walt's attempts at help, maybe we feel a little angry at him; a little frustrated that he's acting in this quite shut off and childish manner.\r\n\r\nBut things change, and people branch out. It's interesting to note that when Walt does disappear from the text as the film nears its final third, Wenders is clearly signalling that he feels comfortable enough he has delivered the necessary information for us to form our own realisation of what's going on and allows Travis to take over as that character that drives the film; as a character that goes places, not randomly, but because he knows what he needs to do – we know what the situation is and away he goes. It's an effortless switch on Wenders' behalf; a master-class in directing as he delivers this long and drawn out story in the most humbling of manners but never, ever looses track of who's who and what their role is on the screen.\r\n\r\nThe core of the film revolves around the sorting out of problems past; a sort of correcting of mistakes. But this is no film resembling a crude red marker-pen streak straight through several errors on a page, this is more a noting of mistakes made in a first draft before re-writing what should have been accomplished first time out in slick and effortless typography. Not knowing what transpires and why certain people are in the position they're in is 90% of the fun but what I will say is that a third party agent is involved and they're of a rather innocent variety. It is this agent that, when revealed, bridges gaps and enables certain personnel to take on certain responsibilities.\r\n\r\nAnother key tactic in Wenders' delivery is Nastassja Kinski's character. Looking at some of the old posters uploaded here on IMDb, it seems there are a fair few detailing her character with the face of said person slapped all over the covers. But Wenders doesn't reveal what it seems he considers his prize jewel until much later on. I could say her name is Jane perfectly fine, but to mention her surname would be a spoiler of rather unfortunate consequence. Needless to say, she is connected. Paris, Texas is a rewarding experience. It asks us to find time to lend to those that come across as immediately eccentric or not of a 'type' we would immediately pay much attention to. It wants us to look at a person and look at a world through this person's perspective as we begin to realise those of an unspectacular variety might very well have a story of the spectacular variety, to tell. \r\n\r\nThree stars with a plus, out of four.",
            "review_date": "2010-02-24",
            "source": "rt"
        },
        {
            "content": "A great Road Movie and the Perfection of the European Look on the West grandious directed, acted, shoten and i love the Soundtrack",
            "review_date": "2010-02-22",
            "source": "rt"
        },
        {
            "content": "a near perfect film.  Win Wenders continues the kind of filmed meditation he captured with Wings of Desire settting it among the sand and neon of Texas.  Slow paced and sparse like the desert itself but also beautiful and hypnotic.",
            "review_date": "2010-02-19",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is a movie with the kind of passion and willingness to experiment that was more common fifteen years ago than it is now. It has more links with films like Five Easy Pieces and Easy Rider and Midnight Cowboy, than with the slick arcade games that are the box-office winners of the 1980s. It is true, deep, and brilliant",
            "review_date": "2010-02-18",
            "source": "rt"
        },
        {
            "content": "It's kind of fitting that a movie called \"Paris, Texas\" spends no time there.  It would be like \"Titanic\" taking place entirely at a K-Mart - only this movie is great and doesn't attempt to suffocate you with Celine Dion.  Travis is wandering the deserts of Texas before passing out and resorting to having his brother Walt come and bring him to the salvation that is California.  That's fine and dandy for the first hour but when Travis is reunited with his son (turns out Walt and his wife raised the kid after Travis split and his wife Jane gave up custody), the duo leave for Houston to reunite mother and son.  Ordinarily, this would be the stuff a Lifetime original movie is made of.  But with directing by Wenders and captivating performances from just about everyone (sorry Walt, but your wife kind of brings this whole thing down), this is elevated into a pretty engaging work.  Yeah, there's a shift in purpose halfway through and in the end you kind of wonder what all has been accomplished but it is all worth it for one scene.  It happens in this role-playing whorehouse place (which, really, isn't that where all life-affirming scenes are shot?  No...?) and is just about the most heartbreaking 20 minutes you could expect to find in a simulated coffee shop.  To give more details would only diminish the impact but Sam Shepard really knocked it out of the park with his writing.",
            "review_date": "2010-02-16",
            "source": "rt"
        },
        {
            "content": "phenomenal. intelligent and beautiful. an emotionally believable story.",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "Beautiful!  Do not miss this piece of life. It is perfect in every way.",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "Solid, a good piece from the 80's",
            "review_date": "2010-02-13",
            "source": "rt"
        },
        {
            "content": "Beautiful and electrifying. Every frame is alive.",
            "review_date": "2010-02-12",
            "source": "rt"
        },
        {
            "content": "if you like slow-paced movies.. you still may not like this one. tenderly shot, and great performances. this film is growing on me as i type.",
            "review_date": "2010-02-10",
            "source": "rt"
        },
        {
            "content": "Texas has been a major focal point throughout the history of cinema. From the classic westerns all of the way to until now, filmmakers have found bold inspiration kept in the rugged landscape of the American southwest. Who would've thought that, possibly, the greatest representation of this terrain would've been captured by a pioneer of New German Cinema, who's not even from the state (let alone the country). \r\n\r\nThe star of the picture has to be Robby Müller, whose cinematography is always breathtaking, but here captures some astoundingly beautiful images which rank amongst his greatest works. The cast is amazing with Harry Dean Stanton leading the way in, quite possibly, the best performance of his career. The subtle score by Ry Cooder only expands the universe and environment of the film in brilliant minimalist fashion.\r\n\r\nThe story is sheer perfection and highly recommend that if you haven't yet seen this work, or any film by Wim Wenders for that matter, this should be high on your list. This film went on to win the Palme d'Or at Cannes and remains one of the few masterpieces to come out of the 1980s. Well, that's about all the praising I've got in me for now. All I can do for the time being is wait for you to go watch it right this instant. Go on, I'll wait...",
            "review_date": "2010-02-09",
            "source": "rt"
        },
        {
            "content": "My favourite of all time.",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "Straight forward story of a dissolved relationship between man and woman with child but Wenders articulates every emotion through his camerawork and cinematography combine that with the not just the performances but the perfect casting. And as an added bonus John Lurie shows up out of nowhere a little more than halfway through the flick.",
            "review_date": "2010-02-01",
            "source": "rt"
        },
        {
            "content": "\"Paris, Texas\" is touted as Wim Wenders best American film and it is both filled with really beautiful shots (though the red/green scheme is a bit overdone) and excellent acting (even if the scenes with the kid wear), headlined by Harry Dean Stanton.  The \"peep show\" sequence is a notably great meta-moment that is pivotal in a story that is strong without being overly complex.",
            "review_date": "2010-01-31",
            "source": "rt"
        },
        {
            "content": "Top down, this is one outstanding movie.  It so rare to see a movie that has every aspect right.  Such a pleasure.  I can't wait to buy it on blu-ray",
            "review_date": "2010-01-30",
            "source": "rt"
        },
        {
            "content": "A very well-made, charming film that stars two of my absolute favourite actors working in synch to try and awesomely underact each other. Brill.\nBeautifully shot and scripted my only quibble is with the film's falling action, where Travis finally reveals what's up to his long lost wife, and merely comes across as a little bit cliche at best, misogynistic at worst.\nAh well, still a great movie, and the shots of Big Bend National Park are jaw-dropping.",
            "review_date": "2010-01-29",
            "source": "rt"
        },
        {
            "content": "2 slow 4 me zzzzzzzzzzzzzzzzzzzzZZZZZZZZZZZZ!!!!",
            "review_date": "2010-01-28",
            "source": "rt"
        },
        {
            "content": "Starts well, but has the most ridiculous last 15 minutes or so which undo anything that was good about the preceding hour and a bit.  Overrated dreck.",
            "review_date": "2010-01-28",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful films ever made in terms of visual design and story.  Since I havent seen this film in years, I decided to rewatch this film when I got the new blu-ray from Criterion to see if this stood up, and man it did.  Harry Dean Stanton is so perfect in this role.  He has always been under appreciated and I love seeing him in the lead role.  His character perfectly unravels never being overly dramatic or emotional but dam the film packs an emotional wallop.  The imagery is gorgeous, creating a beautiful landscape of Americana throughout.  Love this film still.",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "This film sky-rocketed into my top 10 of all time. Harrowing and beautiful in a methodical and meditative way. The best road/estranged family movie I have ever seen.",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "What started off sort of a mystery with interesting characteristics in the movie progressively became boring with long drawn out scenes that could have been cut to a forth of what they were.",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "A great, beautiful movie.  Everyone loves Harry Dean Stanton, and for me, this is the ultimate Harry Dean Stanton movie.  Yep, itâs a slooooow flick.  But the haunting mystery of Stantonâs drifter propels the audienceâs interest and thereâs that burning mood that seems to pulse from the filmâs negative.  Dean Stockwell is excellent as the protective brother and Hunter Carson is one of the finest child actors Iâve encountered.  VF.",
            "review_date": "2010-01-26",
            "source": "rt"
        },
        {
            "content": "I had heard so much about this film and thankfully Criterion released it.  Wings of Desire was my introduction to Wim Wenders, and that was instantly one of my favorites.  This one is no different.  It is a gorgeous film and really showcases some of America's most beautiful landscapes.  The story unfolds slowly, but the actors are at the top of the game and make the journey worth it. The last 30 minutes or so of this movie are emotionally draining, and though it may not have a typical Hollywood ending, it is an appropriate ending none the less.  This is one I will be revisiting very soon, and probably over and over again.",
            "review_date": "2010-01-26",
            "source": "rt"
        },
        {
            "content": "Harry Dean Stanton.....what a guy!  Great story that slowly comes together. Two things that struck me was the use of colour red in the middle of the film when Travis, Hunter (both wearing red) track down Anne (wearing red) in her red car......and then at the end of the film, Anne and Hunter are wearing green, with green lights in the office block outside the hotel window and Travis is also bathed in green light in the car park. Whether this was deliberate or I just notice strange things I may never know.\r\n\r\nYou can't beat a Ry Cooder soundtrack for added emotion (sadness ... longing...depression...dissatisfaction etc)",
            "review_date": "2010-01-24",
            "source": "rt"
        },
        {
            "content": "Cheap symbolism, cheap quirky gimmicks (these must be more lame stories about amnesia than actual cases of amnesia), cheap dramatics. I don't care much for Harry Dean Stanton in the first place, his sad sack routine gets tiresome. The film sets up a melancholy little mystery for which the payoff is beyond disappointing. Nothing that happens in the entire movie feels genuine. It's not boring, but it sure isn't very satisfying. Some nice visuals, though.",
            "review_date": "2010-01-22",
            "source": "rt"
        },
        {
            "content": "Sad and touching movie, beautiful music",
            "review_date": "2010-01-19",
            "source": "rt"
        },
        {
            "content": "This one should come with an alarm! Achtung! As in any of Win Wenders' movies, silence counts as much as lines. He takes his time to tell the story. Excelent sountrack.",
            "review_date": "2010-01-18",
            "source": "rt"
        },
        {
            "content": "A haunting beautiful story of redemption.",
            "review_date": "2010-01-07",
            "source": "rt"
        },
        {
            "content": "I found it to be boring. Sure spots were good but it seemed to have lasted for 5 years",
            "review_date": "2010-01-05",
            "source": "rt"
        },
        {
            "content": "Great story by Sam Shepard; great acting -- especially by Harry Dean Stanton and some awesome film work by Wim Wenders. Whether it's the shots to make an ordinary car ride work up more anticipation in the viewer or the scenic vistas, this is a beautiful film -- both in quality and subject matter.",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "It doesn't take much to make a happy ending for some folks and this story nails it.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "A beautiful film. I just relate so mch to Harry Dean Stantons character.",
            "review_date": "2009-12-12",
            "source": "rt"
        },
        {
            "content": "Great photography, music, script, performances.....a must!",
            "review_date": "2009-12-07",
            "source": "rt"
        },
        {
            "content": "Brilliant cinematography and music.",
            "review_date": "2009-12-05",
            "source": "rt"
        },
        {
            "content": "A paradox of a movie, so well-made and engaging, and yet so overlong and uncathartic; perhaps that's due to  expectations that I impose on the movie, rather than the work itself.\r\nOn the other hand, its raw drama and pure acting overcome whatever shortcomings it might have.\r\nRegardless of my quibbles with it, Paris,Texas is a work of art and deserves to be seen.",
            "review_date": "2009-12-02",
            "source": "rt"
        },
        {
            "content": "in 2 words? too long!",
            "review_date": "2009-12-01",
            "source": "rt"
        },
        {
            "content": "Ihanat maisemat, varit, ohjaus.",
            "review_date": "2009-11-30",
            "source": "rt"
        },
        {
            "content": "Thanks Tina for introducing me to this when I was a kid. You were right! :)",
            "review_date": "2009-11-26",
            "source": "rt"
        },
        {
            "content": "Natassja Kinski is Stunning!",
            "review_date": "2009-11-26",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. I had this shoved at my in a DVD-store a long time ago and I can't thank that guy enough for recomending it. By far Wenders and Shepards work. People keep telling me that this movie is slow. Well, they're wrong they can't just get into the mood of the movie.",
            "review_date": "2009-11-24",
            "source": "rt"
        },
        {
            "content": "Paris, Texas is one of the finest films ever made. It isn't the performances, the cinematography, the music, story, or direction that make it great. The whole is greater than the sum of its parts, and it's all of these elements together that serve to deliver complex and challenging ideas (the plight of the American family, fleeting passion, necessary sacrifice) and arouse feelings (often sad or melancholy) that stay with us long after the credits roll. \n\nI'd be very surprised if anyone out there didn't at one point in his/her life identify with Travis (Harry Dean Stanton), Jane (Nastassja Kinski), or Hunter (Hunter Carson). There's a confusion that comes with life experiences, one that forces us to analyze and evaluate ourselves and our relationships with others. It's hard to explain where that confusion comes from, and nearly impossible to resolve the questions it brings up. This film manages to articulate the feeling of helplessness that comes with that futility and the acceptance necessary to put those feelings to rest.",
            "review_date": "2009-11-21",
            "source": "rt"
        },
        {
            "content": "Dramatic, poetical, heavy, humanistic drama about yearning, complexity of human existence, alienation and deeper sides of our souls. Heavily poignant, analyzes the most important relations : love between a man and a woman and between a parent and a child. Unlike other Wenders' features which are mostly totally pointless, lousy and boring In Extremis, this one is absolutely stunning...",
            "review_date": "2009-11-14",
            "source": "rt"
        },
        {
            "content": "wow surpris Ã  l'os ! trÃ¨s beau film, le road movie par excellence. Malheureusement, longueurs Ã  la fin. Le film aurait pu avoir 5 sinon...\r\nrecommandÃ© Ã  ceux qui veulent quelque chose de diffÃ©rent ou bien les addicted du cinÃ©ma comme moi ;)",
            "review_date": "2009-11-04",
            "source": "rt"
        },
        {
            "content": "Love this film, Ry Cooder soundtrack is amazing too!",
            "review_date": "2009-10-30",
            "source": "rt"
        },
        {
            "content": "Simply stunning.\r\n\r\nHarry Dean Stanton gives the best performance of his career as alonely wanderer, who when found by his brother, pieces together his past.\r\n\r\nThe cinematography is incredible making full use of the landscapes of Texas. The colors are lush and beautiful as well.\r\n\r\nThe score by Ry Cooder is one of the most haunting I've ever heard.\r\n\r\nThis film is absolutely fantastic.",
            "review_date": "2009-10-29",
            "source": "rt"
        },
        {
            "content": "Awesome, much better character piece than the rubbish we see nowadays.",
            "review_date": "2009-10-25",
            "source": "rt"
        },
        {
            "content": "Very intresting movie. Nice filming.",
            "review_date": "2009-10-17",
            "source": "rt"
        },
        {
            "content": "I can honestly say I've never seen anything quite like it....and that's a good thing.",
            "review_date": "2009-10-13",
            "source": "rt"
        },
        {
            "content": "Ok but i think what happened during the 4 years of wandering would of made a better movie.",
            "review_date": "2009-10-02",
            "source": "rt"
        },
        {
            "content": "one of best dramas i know",
            "review_date": "2009-09-28",
            "source": "rt"
        },
        {
            "content": "Just beautiful. What a wonderful story, the acting is so good, the scenes are perfection.\nSo emotional, the last moments of the movie are heartbreaking and intense. Nastassja kinski, that woman cannot be more beautiful.",
            "review_date": "2009-09-21",
            "source": "rt"
        }
    ]
}