{
    "rating": 9.1,
    "release_date": "1984-11-02",
    "num_reviews": 390,
    "genres": [
        "Drama"
    ],
    "summary": "New York Times reporter Sydney Schanberg (Sam Waterston) is on assignment covering the Cambodian Civil War, with the help of local interpreter Dith Pran (Haing S. Ngor) and American photojournalist Al Rockoff (John Malkovich). When the U.S. Army pulls out amid escalating violence, Schanberg makes exit arrangements for Pran and his family. Pran, however, tells Schanberg he intends to stay in Cambodia to help cover the unfolding story -- a decision he may regret as the Khmer Rouge rebels move in.",
    "reviews": [
        {
            "content": "It's hard to imagine that what should have been a great film could be reduced to merely passable based on a bad music score, but such might be the case with The Killing Fields.  The movie, about friendship, loyalty and the horror of war, centers around the relationship between New York Times journalist Sydney Schanberg (Sam Waterston) and his aide Dith Pran (Haing Ngor) as they try to bring international attention to Khmer Rouge rule in Cambodia and the covert American intrusion into the country at the tail end of the war in Vietnam.  Filled with countless powerful images and an enduring message, much of the impact is sabotaged by Mike Oldfield's horribly distracting score, consisting primarily of a shrill and wince-inducing synthesizer that sucks the emotion out of countless powerful scenes.  While it's still worth watching, it might be more impactful with the sound turned down and the subtitles turned on.  Just a suggestion.",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolutely sensational movie. I rarely cry over films and TV but this was an exception. Beautiful ending, enough to make any human being shed a tear.\n\nThe reason I didn't give it 5 stars is because there are a lot of scenes in which Cambodian is spoken without English subtitles which is confusing.",
            "review_date": "2021-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting but fails to keep you absorbed ",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It sends an important message about communism, but it's definitely overpraised. The first half was too confusing without knowledge of the history, there was no explanation of the events at all, and the second half lacked dialogue - almost none of it was in English and there were no subtitles. The press characters were all unlikeable, the story telling was very muddled, the pacing could have been better, and the ending was predictable. However, the cinematography, visual effects, and soundtrack were decent. Furthermore, the depictions of chaos, the disregard for human life, and the lifestyle of a slave were well done. Not really worth watching without context though.",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very strong movie. Tells a strong, profound and deep story.",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Confronting, raw and un-putt-down-able.",
            "review_date": "2021-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic and highly Morbid.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is tremendously capable in short bursts - creating moments of violence and suspense that catch the viewer off guard - but doesn't really weave them together as effecively as it could have; the Khmer Rouge never quite feel as dangerously spontaneous and ever-present as the narrative wants them to. The relationship between Waterston's Schanberg and Ngor's Pran feels too undeveloped to carry the emotional weight necessary to carry the film throughout their separation. The protagonists don't really exhibit much in the way of tangible flaws, leading the film to feel almost too sanitized of a depiction. Regardless, the Killing Fields remains a powerful condemnation of the Cambodian genocide at many points, often as a result of Pran's quiet tenacity in the face of exceptional cruelty. he embassy scene, in which the assembled photojournalists scramble to forge a passport for their ally, is exceptionally well done and features the tension that would have served the film well if it were allowed to be more pervasive. (3.5/5)",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was great but I'm not so impressed with this site's summary.\nI wasn't aware this film is \"American cinema?\".",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between 3 and 3.5 stars. Touching testimony of the effects of Nixon politics in South Asia, the brutality of Pol Pot system, and the story of a friendship.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really powerful and it has a lot of great performances.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping and powerfully acted",
            "review_date": "2020-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story/Screenplay: (2.5/5) A historical drama that is mixed with facts and opinions.  In retrospect, after 45 years since the Khmer Rouge took power in Cambodia, these opinions appear ill-informed.  The story should have stuck to facts.\n\nDuration/Tempo: (4.5/5) At 2 hours and 21 minutes, it's a long movie that felt 30 minutes shorter.  Was well directed and edited.\n\nCast & Crew: (3.5/5) Nothing great, but Sam Waterston is memorable.\n\nSummary: (3.5/5) The story is very good and flawed at the same time, but the acting is solid and the film is reasonably long.  A thumbs up.",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances, story and music",
            "review_date": "2020-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long movie but good.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Male friendship is an odd thing as in films the bond often slips into homoeroticism as in the case of Becket (1964) and Once Upon a Time in America (1984) but this film avoids heading into that territory and instead chooses to portray the emotional, heartfelt connection that two men experienced. First time feature film director Roland Joffe brings an observant but slowly paced style of filmmaking to the subject which allows for development of characters and a sense of great loss as the tragedy stretches on and on. While I found the film to be a tad over long, you really do feel the length, I was captivated by the story and I did come away feeling that I had learned a great deal about the horrific effects that resulted from the Khmer Rouge winning the Cambodian Civil War.\n\nAmerican journalist Sydney Schanberg, Sam Waterston, covers the political upheaval in Cambodia in the mid-1970s for the New York Times and is aided by his dutiful assistant Dith Pran, Haing S. Ngor, who makes sacrifices to get his employer access. The two form a particularly strong bond over the following years as Schanberg and fellow foreign journalists Al Rockoff, John Malkovich, and Jon Swain, Julian Sands, are threatened by the new Khmer Rouge regime. The country soon falls into disarray as the military are disorganized and amoral and when the journalists are apprehended Pran is forced to beg for their lives. The journalists become extremely devoted to him after he takes this action and when he faces imprisonment they try their hardest to forge a British passport by creating a new photograph to place within it. Sadly, Pran is taken in by the police and forced into working on a camp where he is brainwashed under the ideals of the new government while a guilty Schanberg returns to the United States and desperately tries to locate Pran. \n\nThe film doesn't necessarily follow the traditional structure of a film of this sort as while you could argue that we see a rise, a fall and a rise again we progress through this traditional structure with more focus on the characters than their achievements. The majority of the first hour of the film is simply meeting the characters and seeing Schanberg try to cover the dangerous political situation while Pran displays his devotion. It is only after Pran saves these men that a plot really begins to emerge as we see the armies truly impact the lives of these men and build up the relationship between the two protagonists. From there the two are separated and we see Pran tortured while his best friend worries over him back in New York City. To me this was the less interesting section of the film as the drama seemed more forced and the film was lacking without the friendly rapport between Pran and the journalists. Obviously this section was necessary as we needed to see the extent of the suffering that people faced under this regime and feel overjoyed when poor Pran finally made his way out but it stretched on for a long time and at some point the misery of it all was drowned out by how repetitious it felt.\n\nFortunately before the rather slow second half there is one surprisingly thrilling sequence in which Malkovich and Sands try their hardest to take a photo of Pran and have it inserted in his fake passport. A certain camaraderie and boyish excitement is present in these sequences that is not seen in the rest of the film and I must say I was holding my breath as these photographs developed and then faded into nothing. The tragedy at the end of this rush to save Pran only serves to make these scenes more poignant as all that effort goes to waste and Pran will be unfairly tortured but at least he knows he has won the love and respect of the men he has worked with. Malkovich also shows off the fiery intensity that would make him an icon and which worked to such great effect in Places in the Heart (1984). \n\nThis is definitely deserving of a look but not on the level of fellow Best Picture nominees A Passage to India (1984) and Amadeus (1984).",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's probably a must-see... though seeing it feels more like reading an article than watching a movie. This one's long and slow-moving, but that doesn't detract from its importance.",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"‪The Killing Fields\" has probably had most profound impact on me over the 1,000s of films I've seen (yes, I watch a LOT of movies). Haing S. Ngor co-starred (won an Oscar) and basically just relived his life since the film was based on his owexperiences. I literally sobbed uncontrollably after watching it on VHS around 1986. ‬",
            "review_date": "2019-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully filmed, intense and emotionally powerful.  Stay for the great  music over the closing credits!",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A journalist is stuck in Cambodia during a massic local war. The U.S. are naturally helping, but they fail a lot and they bomb a lot of civilians. It's not easy for our American guy, Sydney and his crew, but with a lot of help from a local, Dith they get around and out of very tricky and serious situations.\n\nThis is a biography and the true story of an journalistic award winner and his friend for life who got stuck in the middle of the chaos after Sydney was rescued from it. He wrote well but always shared his praise and positive critique with Dith, not even sure if he was alive.\n\nA very fascinating story, well executed. It has action, drama and some real harsh moments. It feels a bit dated for me and I lost my consentration at times as I never felt I knew the characters that well.\n\nSolid film, but not a masterpiece.\n\n7 out of 10 Coke bottles.",
            "review_date": "2019-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best, GREATEST inspiring movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Roland JoffÃ (C)â(TM)s film tells the story of New York Times journalist Sydney Schanberg and his friend Cambodian journalist Dith Pran as they experience the U. S. bombing of Cambodia, subsequent departure of international forces, and then the bloody rule of Pol Pot and the Khmer Rouge in the 1970s, which resulted in genocide.  As expected, it is horrific.  But focusing on the central friendship allows the filmmakers to treat the terrible events as a sort of backdrop, letting viewers digest their awfulness while keeping their attention on the more specific concerns of Schanberg (Sam Waterston) and Pran (Haing S. Ngor), such as how to get Pran a forged passport.  Of course, the film could also be charged with the typical crime of giving American viewers a white protagonist to identify with rather than simply telling the story of the Cambodians -- but, conversely, Pran does dominate the filmâ(TM)s second half (in a work camp) and really becomes the filmâ(TM)s emotional center (and Ngor rightly won the Best Supporting Actor Oscar).  The film doesnâ(TM)t really pull any punches either â\" there are brutal unjust killings throughout, plus the usual aftermath of war (injured and dead children, dead bodies piled up or cast aside), even as the cinematography can also be quite beautiful (showing sunsets of Thailand, where the film was shot).  The tension remains high for most of the picture and you never quite know who will survive.  Waterston, John Malkovich (playing an acerbic photog), Spalding Gray (who later developed his monologue Swimming to Cambodia about making this film) and Craig T. Nelson are some of the familiar faces who went on to further success after this film.  Cambodia itself took a lot longer to recover from the events portrayed here...which stand as a warning to the world and its leaders.  Powerful.",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An under appreciated film about one of the darkest points in humanity's history, 'The Killing Fields' follows two characters as they both struggle in the survival of the Cambodian Genocide. This is a film so thick with suspense and tension that you feel the fear that the characters feel.",
            "review_date": "2018-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie about the Khmer Rouge takeover of Cambodia and the death of 3 million people.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1984 film that explores the historical episode of Cambodian politics in the 1970s during the Vietnam War.\nOf course the Vietnam conflict has been filmed several times however the impact on neighbouring Cambodia not so much.\nI am not going to give a history lesson or preach about the involvement of a Western country in international conflicts but this film does provide an insight into this shameful episode.\nThe film concerns the journalistic exploits of New York Times hack Sydney Schanberg in Cambodia. \nSchanberg works alongside interpreter Dith Pran (Haing S. Ngor, who won a Best Supporting Actor Oscar).\nHe is left behind when western citizens are evacuated.\nAs the film progresses Pran becomes a prisoner in captivity in fields full of rotting corpses.\nSchanberg tries to use his influence back in New York to raise the profile of Pran's situation and indeed that of Cambodia.\nThe film progresses until for Pran there is an escape. Sadly no escape for millions of his countrymen.\nThe film sadly opened my eyes to a shameful period in Cambodia and perhaps how it mirrors other events?\nThe soundtrack by Mike Oldfield has some tubular bells and bit of McCartney then Lennon.",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning, harrowing, heartbreaking.",
            "review_date": "2017-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New York Times reporter Sydney Schanberg (Sam Waterston) is on assignment covering the Cambodian Civil War, with the help of local interpreter Dith Pran (Haing S. Ngor) and American photojournalist Al Rockoff (John Malkovich). When the U.S. Army pulls out amid escalating violence, Schanberg makes exit arrangements for Pran and his family. Pran, however, tells Schanberg he intends to stay in Cambodia to help cover the unfolding story -- a decision he may regret as the Khmer Rouge rebels move in.",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty realistic story-telling of real life history.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a real testament to the power of film. After spending some time in Cambodia, I attempted to watch this movie at the age of 25. Couldn't do it, as it brought back to many memories of being told the stories and seeing the aftermath of the genocide. I finally turned it on at 29 and had one of the most complex reactions to a film I have ever had. A truly special film. Joffe was a genius for creating this and The Mission alone.",
            "review_date": "2017-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The the rise horrific regime of the Khmer Rouge in Cambodia during the mid-late 1970s is told in this moving film about the friendship of journalist Sidney Schanberg and his Cambodian interpreter, Dith Pran. The pair were caught up in the chaos of Phnom Penh as the Americans and then French pulled out of the city and Pran was forced to stay behind and try as best he could to survive the madness of the revolution. There's a real sense of the panic and trauma the population of the country underwent. This is perhaps most vividly shown on the screen as the Khmer soldiers enter the city and force the civilians to evacuate. The movie doesn't flinch from showing some of the atrocities Cambodia endured at the hands of both the US with their bombings and the Khmer militants. The casual shootings and beatings, sometimes by family members, the way in which people were suffocated by having plastic bags put over their heads and the mass graves in which bodies are dumped are all portrayed but in a manner that feels shocking and moving rather than gratuitous. This was an awful and shameful piece of human history which the movie captures well. Sam Waterston, John Malkovich and Julian Sands play the chief Western characters but the movie is held together by Dr. Haing S. Ngor, himself a survivor of the genocide, who really holds the movie together. His portrayal of Sith Pran is extraordinary and he rightly won an Oscar for his role in this magnificent film from director Roland Joffé. An unusual score by Mike Oldfield adds perfectly to the sense of confusion and terror during the evacuation of Phnom Penh and takes on a more measured and sympathetic tone during the quieter scenes. The Killing Fields stands as a demonstration of how the human spirit and friendship can at times overcome terrible adversity and despite the harrowing nature of the subject matter, this is ultimately an uplifting story.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A group of journalists are caught up in a warzone, there one big contributer is unable to get safe, ends up in slavery under young revolutionists. While one of the other journalists are getting world-wide recognition for his work. A painful and emotional time through fire, death and the unknown.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grim story of a New York Times reporter's guide in Cambodia who spends four years labouring in the killing fields after the Khmer Rouge overtake the capital.  He was one of the lucky ones.  Great history lesson.  Hard to believe this happened in my lifetime.",
            "review_date": "2016-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Telling an important historical story.",
            "review_date": "2016-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting true story of friendship and survival, set against the backdrop of one of history's most oppressive regimes.\n\nSet against the Khmer Rouge regime in Cambodia in the 1970s, the true story of New York Times journalist Sydney Schanberg (played by Sam Waterston) and his Cambodian interpreter Dith Pran (Haing S Ngor).  They are there in 1973 when Cambodia is a side-theatre of the Vietnam conflict.  At this time the Khmer Rouge are on the rise but not a major threat.  Then we jump forward to 1975 and the Khmer Rouge have the upper hand and are about to take control of the country.  The US, and other countries, are evacuating personnel.  Though both of them have an opportunity to leave too, Schanberg and Dith Pran decide to stay to cover what happens next.  This will ultimately put Dith Pran's life in grave danger as the Khmer Rouge's reign over Cambodia was one of oppression and genocide.\n\nInteresting, though a bit dry.  The movie starts very slowly and takes a very long time to find a second gear.  Even when things do start to fall into place and you get to understand where the story is going, things still don't really move at more than a moderate pace.  \n\nHowever, the last 40 minutes or so more than make up for this.  We see the extent of the Khmer Rouge's oppression and atrocities, and the movie becomes a powerful, tense story of resourcefulness and survival.  Great, emotional ending.\n\nSolid work by Sam Waterston as Sydney Schanberg.  Haing S Ngor, a Cambodian doctor and refugee with no previous acting experience, gives a great performance as Dith Pran and well deserved his Best Supporting Actor Oscar.  \n\nThe cast also includes John Malkovich (in only his second feature film), Julian Sands (third feature film) and Craig T Nelson, all of which give fine performances.",
            "review_date": "2016-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "84%\nSaw this on 6/5/16\nThe thrilling BGM always ensures that the viewer is glued to the screen and in its first half, it tells the shocking realism of war with fine cinematography and set pieces. In the second half, its about survival. The film may not always connect emotionally the way you want it to.",
            "review_date": "2016-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie made on any genre ever ? Yes it has all the ingredients to be in helm  !",
            "review_date": "2016-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling human story.",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Destruction and violence shown from the point of view of a journalist covering the state of the war-torn country in which it's set.",
            "review_date": "2015-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Short of being a documentary it tells of a true story of a reporter feelings of deserting his friend in Nam when America pulls out in a hurry and leaves a true patriot behind. Really loved the story of the hardships the young man endured.",
            "review_date": "2015-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film made me so angry. Men with their weapons who think that they rule the world. The parallels between Asia 50 years ago and the Middle East were obvious. When will the love of power be less important than the love of humanity?",
            "review_date": "2015-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unflinchingly gut-wrenching and spine-chilling, this war drama about a band of journalists covering the story of Cambodia falling prey to the terrifying reign of Khmer Rouge is unsettling to watch and lingers long in our memories like a ghost.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's something terribly smug about a film which tells the story of genocide and tyranny through a Western perspective. More oppressive than the film's politically motivated self-seriousness is its white liberal guilt. In telling the story of Pol Pot's regime through the eyes of an American reporter, director Roland Jaffe has fashioned a narrative that is as dishonest as it is cursory. The factors driving the Khmer Rouge takeover are entirely grazed over, and the images of warfare and desolation feel like photos in a TIME magazine--exotic suffering as filtered through a Western lens. The over-indulgent score is a symphony of  synthesized cacophony which tells the audience how to feel (unsuccessfully) instead of letting them feel for themselves. At once fragmented and overly manipulative, The Killing Fields tells the story of Pol Pot's totalitarian regime as you would read about it in the New York Times while sipping a cup of coffee.",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling and well-told.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving film that'll leave your heart broken with the shocking impact it has on offer; the scenery and events will leave leave people in sadness and tears, the film direction by Roland Joffe is impressive and well-executed, and there are realistic performances throughout the film, especially from the debuting (and late) Haing S. Ngor. This is a film that you absolutely must not miss out on.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very powerful and scary film. It's surreal how the journalists go about their business while surrounded by a war zone. The coffee shop scene definitely stands out in an explosive way. The movie speaks volumes about how Americans saw the world back then and how we take our freedom and peace for granted. The journalists seem to be there only as journalists. They seem indifferent to everything besides getting a perfect picture. They act so carefree it gives you the idea that nothing bad will happen to them, and nothing does happen to them. Instead the movie brilliantly follows Dith. It isn't about Americans in a war torn country, it's about the people who live there. Dith is such a polite and helpful guy it's really heartbreaking to see what he goes through. In most survival movies the struggles get to you because you imagine yourself in the survivors situation, but in The Killing Fields you care for the character because you see him as a real person and not just someone to identify with. It isn't an easy movie to sit through, but it's a very rewarding experience. The movie succeeds because it draws on your compassion and not just your instincts of self-preservation.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrowing war drama focussed on those caught in the middle, when a country tears itself apart.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For it's time it must have been very rough. It still tells an important and relevant story. Very well shot. The score was very annoying from time to time. Well performed.",
            "review_date": "2014-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, good acting, good plot, very entertaining. But, it was too long and a lot of it just dragged on. But, it's a classic. Very depressing.",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the film focuses on a important topic, it fails to give the audience any deeper background on the difficult situation it depicts. Shots and acting are both very good though it does not live up to its potential.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an incredible and harrowing true story that reminds us of all the countless stories not being told.",
            "review_date": "2014-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic and sprawling, while still being intimate and character driven, Roland Joffe's epic portrayal of real life events is both haunting and emotionally compelling. With images that will stick with you and gigantic set pieces the film feels like exactly what you would want a war time tragedy to be. But Joffe doesn't simply rely on his big visuals to take care of the grandness of the film, what really is big about this film is its heart. Sure there are some big set pieces with hundreds of extras, but what really works here are the character moments. The quiet moments that contrast the really big and loud moments in the film. Joffe knows how to tell a character's journey, and that's what makes this film work. Also, there are some explosions and big sweeping landscapes too.",
            "review_date": "2014-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the early scenes but once they start the cross cutting between Shanberg back in the states and Pran's desperate battle to survive he started to lose me. Ngor earned his Oscar.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waterston is great and always is and it is a good movie.",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I only watched this film because it is directed by the man who brought \"The Mission\" which was a story taking place in a world of timeless beauty enchanted with Ennio Morricone's score where it is absent in this one.",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far from the harrowing depths of \"Apocalypse Now,\" but stark and un-sentimental enough to stand on its own terms. Then Roland Joffe went on to direct \"Captivity.\"",
            "review_date": "2014-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "★★★★ (out of four)\r\n\r\nQuite possibly my favorite film from 1985.  It is emotionally harrowing, but triumphantly rewarding as well.  Haing S. Ngor won a Supporting Actor Academy Award for his moving performance.\r\n\r\nSydney Schanberg, played by Sam Waterston, is a New York Times reporter, covering the final days of the U.S. pullout in Vietnam in 1975.  He befriends Dith Phan (Hgor), a Cambodian translator.  Schanberg has the opportunity to help Phan leave and go to the U.S., but instead he leaves him behind in order to continue to receive information.  Phan is eventually captured and Schanberg fights for his escape.\r\n\r\nWaterston is also terrific and the film, which received a Best Picture nomination, proves to cover the gambit of emotions.  It's exciting, moving, maddening...but predominately very satisfying.\r\n\r\n[IMG]http://img.photobucket.com/albums/v48/Zeppo1/KillingFields_zpsb8c26801.jpg[/IMG]",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The killing fields is a drama if you combined the deer hunter and argo with more mixed results than each. It's well acted by its principal cat particularly Dr. Haing S. Nyor but the story just doesn't hold your attention well even though its well shot.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strictly speaking not a bad movie ,but definitely not the masterpiece its held up to be. The Killing Fields is a bloated epic about the Cambodian civil war that doesn't hold a candle to the better movies in its genre. We get allot of heavy handed moral rhetoric about Vietnam and Cambodia that we've heard a million times before and sentimental moments between the characters that feel underwhelming because we never actually  get to learn anything about their personalities or why their friendships are so enduring in the first place. Apart from a few fragments of the movie that have a mesmerising moment or two, The movie is far too over-long and generic to leave  any lasting impression.  If I wanted to go see a good movie about Vietnam or Cambodia, I'd much rather be watching The Deer Hunter or Full Metal Jacket.",
            "review_date": "2014-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historic movie from the perspective of a reporter who witnessed the Vietnam War.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb, tense, horrifying and true, made all the more impressive by the fact that it was made only a few years after the events it depicts.",
            "review_date": "2014-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "American government and its blindness to other people, societies, culture  (Nixon: Cambodia is \"the perfect example of the Nixon doctrine\") and its perfidy leads to human catastrophe. But this is also a love story between colleagues devoted to getting the truth over all obstacles.   Astonishingly, the good guys win.  But the charade of American morality and leadership world-wide goes on.  See it to believe it.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline didn't offer me much insight into the Khmer Rouge. Second half of the film is admittedly better. Also, possibly the worst film soundtrack i've ever heard. Should have just watched a documentary about the Khmer Rouge.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie so powerful, I can only watch it every now and then.  Absolutely beautiful, devastating and unforgettable.  I've now seen it @ 7 times and it still choked me up three times (especially the ending) revisiting it this afternoon.  A great double/triple feature with \"Swimming To Cambodia\" and/or \"The Year Of Living Dangerously\" if you really want to turn yourself into an emotional trainwreck for a day.  Still, not to be missed.  Movie making, writing and acting all at their finest.",
            "review_date": "2013-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest instances in the film are the dialogues, the conviction of its characters, the anticipation, the horror, the abrupt violence, the anxiety, the scenes that are the most human.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It must be nerve-racking for the producers to offer a tale so lacking in standard melodramatic satisfactions. But the result is worth it, for this is the clearest film statement yet on how the nature of heroism has changed in this totalitarian century.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A horrific tale of Cambodia and a foreigner's relationship to a native in trying to get him out of his war torn country. Despite the plethora of Vietnam movies, this remains the only major film on the Cambodian conflict. It maintains its power.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the film's gut-wrenching first half devoted to depicting with gritty realism and a beautiful cinematography the takeover of Cambodia by the Khmer Rouge, the second half relies on Ngor's superb performance to show a man in an amazing struggle to escape from hell.",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dramatisation of American journalist Sydney Schanberg and Cambodian journalist Dith Prans experiences during the escalation of the Cambodian civil war. The Killing Fields is an incredible and emotional film that focuses both on the friendship between Schanberg and Pran as well as the atrocities committed by the Khmer Rouge and the irresponsible handling of the crisis by the American government.\r\n\r\nThe film is violent and very effectively graphic which I feel it needs to be given the subject matter. The soundtrack is very mixed and utilized to its full potential, with some powerful orchestral scores and at times some eerie futuristic scores. The film also does something very unconventional, which is to change from Scanberg to Pran's point of view halfway through the film, but it works out perfectly and it's the second half about Pran that is the better part of the film. The latter half is very thin on dialog and gives Cambodian doctor Haing S Ngor a chance to shine which he does and his performance is so spectacular that it won him an Oscar for his first role ever, as Dith Pran. This is a film that portrays historically important events more vividly than any history book ever could.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heavy duty true story movie about the Cambodian genocide. The most profound bromance in the history of cinema.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It a very interesting subject and great movie.",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A deeply moving account of how the US retreat from Vietnam in 1975 in fact solved little for the people of the region. The killing would go on for ten more years as the Khmer Rouge brutally shifts the theater of war west to Cambodia. \n\nRoland Joffe moves the story along skillfully, strikes the appropriate dramatic tone and gives this film an unusually authentic look and feel. On a more personal note, I could have easily lived without John Lennon's banal, \"bumper-sticker diplomacy\" anthem \"Imagine\". An indulgent and sickeningly sweet ending to what, up to this point, was a serious and important film.",
            "review_date": "2013-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film, but I say that through the lens of someone who has watched the film for the first time after having visited said killing fields of Choeung Ek near Phnom Penh and the Tuol Sleng Genocide Museum. I struggled to remain objective with this film and got sucked into the emotional drama and the intensity of the sacking of the city. On a technical note, I thought the decision to not include any subtitles was genius - really added to the confusion, especially when the Western journalists get taken by the Khmer",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joffé's film is daring in its execution and powerful from start to finish. Apart from it being an absolute masterpiece of cinematography by Chris Menges, The Killing Fields is admirably able to create intensity and deep human emotion without employing conventional structures and narrative gimmicks with its realist style.",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Killing Fields is going down the history as one of the greatest films ever made about the ground reality of war in Cambodia. Somehow we tend to shy away from watching harrowing films because they are obviously hard to watch and keep us up at night. But next time you feel like you want a dose of reality and intelligence, go out of your way and watch this tearjerking film, you will walk away feeling elated, knowledgeable and simply human. If we don't see it, we won't understand the degree of adversity. Dr. Hang S. Ngor's personal life story adds to the tragedy. Soundtrack is top notch. Movie truly deserves all the accolades. The scenes of destruction and killing are fierce and overwhelming. The story of friendship is deeply moving. The movie is a must see.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'The Killing Fields' (1984) is pretty deep and definitely well-acted. In fact it won an Academy Award for Best Supporting Actor, Best Editing and Best Cinematography. And I love the original score created by Mike Oldfield. The music is done in this weird and atmospheric way that adds on to the horrific scenes of violence. It's very impacting, but not emotional scaring. This movie didn't ruin me from the inside because of all the bloody deaths of people including small innocent children, but it's definitely something that will be remembered for how upsetting it was because of the history. No film can get more realistic than this.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Joffé presents a heavy slice of humanity within the horrendously thuggish confines of the barbaric Khmer Rouge revolution.  Haing S. Ngor is wrenching as the main Cambodian character.  The atrocities of the Khmer Rouge wannabe communists are unbelievable.  Anytime a movement or cult mobilizes children for militant murder no good can come of it.  'd say that this film easily outpaces \"Platoon\" in terms of Vietnam War and related films. (21 February 2013)",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspired by the true story of Dith Pran and his survival under the Khmer Rouge regime, The Killing Fields is a powerhouse of a film.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie about perseverance amid unimaginable hardship and a great account of the inhuman cruelty of Pol Pot's Khmer Rouge.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Cambodian genocide performed by the Khmer Rouge regime in 1970s - led by the infamous Pol Pot - has much been overshadowed by American's Vietnam War; However the fact remains that during it's brief regime from 1975 to 1979, the Khmer Rouge was responsible for one to three million (varies between sources) deaths by execution, forced labor, malnutrition etc. With the film The Killing Field, director R.Joffe attempts to capture the sense of chaos and madness of Khamer Rouge's violent reign. \n\nThe film is shot in documentary manner and tells the extraordinary true story of two reporters, Sydney Schanberg  (Sam Waterston) and Dith Pran (Haing S. Ngor), who reported of Cambodia events in 1975. The first part of the film follows largely reporter Sydney Schanberg and how he relentlessly pushed the boundaries of journalism to keep the world aware of the rapidly deteriorating situation in Cambodia. The second part of the film focuses on Dith Pran and the events that took place after the country's capital, Phnom Penh, was overrun by Khmer Rouce troops. While Sydney got evacuated with the rest of westerns when the capital was occupied, Dith Pran as a native Cambodian was forced to stay and survive the merciless reign of Khmer Rouge. \n\nWhile the film's story is based on real events and tells about important subject, it failed to captivate me. This was largely due to the slow and rather uninspiring first part of the film with main focus on Sydney Schanberg. The film's interesting rate picks up greatly on the second part when the focus is turned towards Dith Pran and his amazing escape to freedom from one of the Khmer Rouge's forced labor camps. However it was bit too little and too late to restore my total complete interest with the film . \n\nSo in the end The Killing Fields is a about important subject, but as a movie it turned out to be rather heavy to digest and at times I felt more like watching a documentary than a film. Even so, what the film lacks in entertainment department, it certainly compensates with good acting by all actors involved and by shedding light on a largely neglected historical event, the Cambodian Genocide.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before Roland Joffe's career went into a rapid decline he was one of the most acclaimed film directors of the 1980's, and a pairing of him with John Malkovich is not something I would ever miss, particularly when it won 3 Academy Awards.\n\nThe Killing Fields is strong because it makes every human being an important figure to the story. It doesn't have one or two as the main figure and the rest just as extras who may or may not die. It makes every person important, because in the situations the story charters into, every figure is in fact important. It's a tricky wire that The Killing Fields walks on because it's such a powerful story which needs proper telling, and luckily Roland Joffe achieves that just fine. His role as a director is excellent, and he makes The Killing Fields out to be a memorable story which is told with finesse.\nHis application of the atmosphere is exemplary in its strength because the convincing production design and naturally flowing cinematography sets the mood for The Killing Fields organically for the brutality that follows in the story, and it all just comes together so naturally that the viewer is thoroughly convinced of the realism in the drama. It's very powerful and hard hitting drama, and is extremely convincing. The lighting also assists in setting the mood for situations\nThe musical score is horrific, by which I mean its so beneficial to the intensity that it makes he drama of The Killing Fields mirror that of a horror film, as it's powerfully strong and haunting at the same time. It's successful all round and thoroughly intense when it needs to be.\nAnd the cast of The Killing Fields constantly keep the character drama of the story important and give a round of strong performances.\nSam Waterson is strong as Sidney Schanberg, and I wish he got more screen time to make a longer lasting effect with his presence. Nevertheless he did a powerful and determined job and made a fine lead role.\nJohn Malkovich's performance is mood-setting because his physicality and performance is a reminder of the character portrayed by Dennis Hopper in the war classic Apocalypse Now!, who was also a photographer and had a similar appearance.\nAnd Haing S Ngor is interesting to watch, because he's so involved in capturing the essence of Dith Pran's character drama that he does nothing short of becoming the character. Haing S Ngor isn't an actor, he is a victim of the actual events in Cambodia and created a goal of showing people what the horrific starvation of the Cambodian people is like. He ended up having to do it as an actor, but it is no lesser in its strength this way and is just impeccably powerful. His ability to capture emotional drama and leave an impact on the viewer is a strong achievement.\n\nThe Killing Fields is utterly a brutal and unforgettable experience that taught me more about Cambodia than 13 years of schooling did.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When a movie becomes art and holds an important message. An excellent piece of work.",
            "review_date": "2012-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true story.  No fiction could have been made to be more fascinating.",
            "review_date": "2012-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very realistic, not even a touch of fiction! A must see for today's filmmakers ..that's what cinematography means, reality delivered untouched!",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watched this over a long period of time in global class. doesnt feel like and actual motion picture, the way its made and acted makes it look like a documentarey or something. its splendidly acted, very snubbed when it comes to war movies. very disturbing and at points scary! \nA+ i just really dont like 2 hour movies! not boring at all however!",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film that follows the trials of a pair of journalists (Sam Waterston, an American and Haing Ngor, who is from Camboida) who are terrorized and barely escape alive from Cambodia while trying to cover the Vietnam War. It's nice to watch a film that isn't just shootous and chaos in the middle of the jungles of Asia. Sam was incredible in an Oscar-nominated role and Dr. Ngor won Best Supporting Actor for a role he pretty much lived in his own life. Sadly, Ngor was shot and killed in a robbery attempt in 1996. He survived the Killing Fields in real life, but died in America. How ironic is that?",
            "review_date": "2012-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant movie, gripping and moving. Of course, I laughed at part of the soundtrack, because it sounds just plain silly.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very good but harsh movie based on a true story.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like many war films, there are images here that you will never forget. Intense at times, this is a must see with a classic humanistic tone and vibe bringing you right up the amazing ending.",
            "review_date": "2012-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Less horrible content than I expected. Still a very touching and emotional film.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mastery of \"The Killing Fields\" is seen in almost every aspect of its production. Roland Joffe and Craig Nelson provide such professionalism and artistic integrity to a film of major political proportions. From a political point of view, this film is undeniably important for audiences to witness a side to violence that is not always exposed so easily. In terms of filmmaking, \"The Killing Fields\" represents pure art in every sense of the word. It's a total masterpiece. \n\nA journalist and his assistant attempt to document the horrors of the Cambodian Genocide during the Vietnam war, where violence has enveloped both nations. Throughout the course of there journey,  they are met with insurmountable odds, having to face tough decisions like risking there lives in order to successfully document what they are witnessing. The film's story is so perfect because its so distinctively real and vivacious. It's brutal honesty brings the audience closer and closer in. It's almost as if you are viewing a true eye-witness account. That's how good this movie is. \n\nThe performances are absolutely remarkable. Sam Waterston does an amazing job in this film, and he really makes you believe that you are taking a look at actual occurrences. His wonderful acting lights up the screen. He will really blow you away. The rest of the cast does a fantastic job as well, especially Haing Ngor, an actual Cambodian who went through these experiences. The performances and story unfold like a Newspaper special, documenting everything that happen in a reflective manner. \n\nThe film's visuals are the most Breathtaking aspect. To witness all of the horror and violence through the perspective that the filmmakers allow us to is truly remarkable. The movie is made in such a way that we are viewing what is occurring in a journalistic manner. \"The Killing Fields\" doesn't take any steps to dumb down its audience. It presents them with the brutal truth. Landscape shots of the Cambodian countryside are vivid and surreal. Every second of film is used to the directors' advantage. Everything has a purpose here. \n\n\"The Killing Fields\" not only serves as a remarkable achievement in film, but a strongly political important picture. Its a film that truly had guts, to present its audience with honest documentation of the horrors and atrocities that were committed in Cambodia during the 1970's. If it isn't, it should be on some list somewhere of the most politically important movies ever made. It exhibits a mark in human history, and in the history of film, of a time of political instability, social unrest, and unrelenting violence. A truly important film, and a truly wonderful film at that.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sam Waterson's early career, before he became that DA on \"Law and Order\" who I perpetually want to punch in the nose.",
            "review_date": "2012-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given this films high critic rating I was expecting Apocalypse Now. This is not what I got and I suppose to some extent my bitterness at that has affected my rating. The story seemed to try too hard to strike an emotional resonance that simply wasnt there. The main character was not likeable in the least, his sidekick was awkward and uncomfortable, the story had no lead in and neither did half of the secondary characters.",
            "review_date": "2012-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly one of the most haunting films ever about the Khmer Rouge reign of terror in Cambodia.  It is sometimes annoying with the way in which Sidney Schanberg seems to treat Dith Pran very poorly but the manner in which this film portrays the way the Khmer Rouge ruled Cambodia is accurate and frightening.  The acting in this film is excellent as are the special effects.  One thing I like in particular about The Killing Fields is that it doesn't get preachy for the most part but sticks with telling the story.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all too common tale of many displaced Cambodians. My parents lived this horror first hand...",
            "review_date": "2012-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very impressive. A film that unapologetically has a definite, passionate and sympathetic tone, without descending into too much sentimentality. The sentimentality there is, is needed, I think, to prevent it being unwatchable, since it is dealing with a very emotive and disturbing subject.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just finished watching this last night. I watched it in increments, which my Mom yells at me for, but it didn't affect the story for me or anything. Well anyways I thought this movie was pretty good. Sometimes I dazed off during some of the plot, but for the most part I was entranced...by Sam Waterson's intense acting, by John Malkovich's needed scenes of sailor-esque swearing, and by Ngor's ability to keep my eyes on him in every scene. Overall, this was pretty fresh.",
            "review_date": "2012-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty watchable, but patchy at times & not as substantial as you'd expect.",
            "review_date": "2012-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is an \"oomph\" film which takes place during the Khmer Rouge's regime of Cambodia. An American journalist, Sydney Schanberg, and his Cambodian photographer/translator ,Dith Pran, are caught in the revolt and are eventually captured. The foreigners are sent out of the country but Dith Pran is taken prisoner. Roland Joffe was at first a seemingly important filmmaker. The Killing Fields was his first film and he followed it up with the equally powerful The Mission. Since then his career has been full of mediocre and atrocious films... what a waste. Along with films like Salvador, Hotel Rwanda and The Last King Of Scotland this powerful true story feels as relevant now as it was when it was made. Its the film that doesn't let us forget the atrocities which fell upon Cambodia and it's people. The performances are incredible. I never like watching Sam Waterson on screen but he is solid this time. The film's powerhouse performance, however, belongs to Haing S Ngor as Dith Pran. Having never acted previously he himself was a survivor of the Khmer Rouge and he considered the film to be his own way of bringing the story to the world. He won the Oscar for best supporting actor but I reckon his role deserved the award for lead actor. He has more screen time and a deeper humanity to his performance. The support acts are great too including John Malcovich, Julian Sands and Spalding Gray (and what the hell is Graham Kennedy doing in this?)... At the close of the film John Lennon's imagine is played over the final moments. When the song begins it seems a little tacky but as the power of Lennon's lyrics and optimism are sung, it highlights the power of the song and the astonishingly disbelieving realism of what man is capable of. I hadn't seen The Killing Fields for years but I'm glad I revisited. A great film.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stark, war drama, reminiscent of Salvador.",
            "review_date": "2012-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We must be like the ox, and have no thought, except for the Party. And have no love, but for the Angka. People starve, but we must not grow food. We must honor the comrade children, whose minds are not corrupted by the past.",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A carefully designed touching movie about an American journalist and his Cambodian guide who get into the whirlpool of Khmer Rouge revolt in Cambodia, and become separated. As the American returns back to the comfort of his New York flat, he agonises about his friend's situation who is basically left to die in the Khmer Rouge's captivity. When getting his Pulitzer Prize, he points at his allegedly dead friend as the main source of his journalistic success and makes himself heard by people who came across a person by the same name in a Red Cross camp near Thailand, which leads to the unlikely reunion of the old friends. A wonderful historical and political movie built over a strong lyrical story and creditworthy performance by Sam Waterston.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields follows the story of Dith Pran a Cambodian translator who befriends journalist Sydney Schanberg while he covers the uprising in Cambodia. As a historical picture of the atrocities that Pol Pot and the Khmer Rouge committed The Killing Fields falls well short of showing viewers who are unfamiliar with what transpired the evil and inhumane acts of one of the worlds most notorious serial killer. As a bio-pic of Dith Pran The Killing Fields skims the surface of  the Khmer Rouge Cambodia while providing a moving story of one mans fight to survive a world that most people could never imagine. Dr. Haing S. Ngor (who lived through Pol Pots sick dictatorship) does a fantastic job as Dith Pran but his thick accent at times becomes hard to understand. The Killing Fields falls short of being a great educational tool but provides a movie of hope and the human spirit which makes up for its shortcomings.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since when did they let British people make movies about the Vietnam War? Man, a year before this film alone, they were iffy about Oliver Stone, an red-blooded American veteran from the war, making \"Platoon\"; but hey, in all fairness, the guy is so crazy and offensive that you could sense it before he even really got his career moving. Maybe the Brits fooled everyone with that poster, because with this film's name and that old West-lookin' poster, you'd think that this is the most tobacco-spittin'-ist, gun-shootin'-ist Western that we've ever seen, and I know that sounds like yet more American territory, but really, if they'd let the Spanish and the Italians be icons of the Western film genre, I think that we could at least cut the Brits some slack. Of course, we're not talkin' Westerns; we're talkin' about 'Nam, and everyone knows that it's only the Americans' job to go to war with most every major Asian nation. It's no place for the Brits, unless they're planning on having a war with the Vietnamese to see who is more obnoxious, and even then, it would be kind of underwhelming, seeing as the Brits would lose by lunch, because the Vietnamese had to have been the most obnoxious people on Earth in the '60s. Yeah, I know that's very offensive, but really, although a lot of them weren't that bad back then and certainly aren't that bad now, let's see you come back and be totally tolerant after they've thrown you're buddies on fecal matter-covered spikes, sent children out with grenades and robbed you, all while yelling at you in the most obnoxious jibber-jabber... you bunch of Brits. Still, I must admit that although you weren't really there, y'all know how to still make some pretty decent Vietnam war films, though not quite good enough to drown out the missteps that tragically triumph over potential yet again.\r\n\r\nWith this being a British Vietnam War drama from the mid-80s, it should almost go without saying that this thing is dry and even kind of dull, dragging along very quietly with a loose grip on both editing and tension. This of course damages the film's compellingness, which was already tainted from the get-go by offering very little immediate development, and as the film continues, it fails to make up for that immediate lapse in development by providing very little exposition. The two aspects of slowness and a lack of exposition, when combined with the kind of repetition that plagues this film, form a dreadful mix that often means one thing: Nothing. Well, sure enough, for long periods in the film, absolutely nothing happens, and when something does happen, it's so messily tacked on the shaky line that is this film's storytelling. This concept of portraying the horrors of the Vietnam War through the eyes of the innocents caught in the middle, as well as the journalists that went to find something unthinkable brutal, only to find far more than they ever could have expected, is wildly inventive and potentially stellar, but in execution, the unique concept is done an injustice by a tone that's both dry and unrefreshing. However, for every misstep this film makes in executing its ambitious concept, it will pull a right move. It may not always be a smooth film, but it is one that will make you think, because although the film is not as provocative as it could have - nay - \"should\" have been, you'll still walk away with plenty to chew on.\r\n\r\nAs much as I joke about how everyone is portraying the enemies of the Vietnam War as wildly obnoxious and evil, there were plenty of victims on both sides, and even between the battlefields, and when this film removes the reigns and tells it like it is, things get pretty hardcore. Whether it be a shot to the face, cries of fear, dismemberment, children taking shrapnel or all-around pandemonium, Roland Joffé doesn't shy away, but neither does he focus so deeply on the brutality to where it's manipulative. The film is harsh, violent and ultimately effective, which isn't to say that Joffé only nails the brutality of the situation, because there will be points where the fine score, lovely cinematography and sharp editing all supplement Joffé's tender, thoughtful atmosphere and create sharp emotional resonance that may not be in the film enough, but really wake you up, if not just plain break your heart. Joffé may be the very man that keeps this film from being truly powerful, but when he delivers, he knocks you cold, being matched in resonant skill only by his performers, all of whom are excellent, with leads Sam Waterston and Haing S. Ngor standing out the most. In the beginning of the film, Waterston's Sydney Schanberg character is a charismatic, professional one, but as he walks through the most horrifying sights that no man should see, defeat and anguish falls upon him little by little, a fact emphasized particularly well during a scene in which he's looking through unspeakably horrible footage and listening the operatic music in the midst of it all, and with all of the jaw-dropping, real gore and sweeping music, the thing that catches your eye the most in that sequence is Schanberg's cold, broken and lifeless face, racked with anguish in one of the many definitive testaments to both the Sydney Schanberg character and Sam Waterson's acting abilities that you can find throughout the film. The same, if not greater amount of praise goes out to Haing Ngor, who's portrayal of a clever and skilled, yet still very civilian and honorable man caught in the most dangerous of situations is believable, emotional and haunting. These two men, and others, go through the most senseless, godless of horrors, and while the flaws in the final product keep it from being a truly impacting portrait on war, the performances are among the most key aspects that make this film as effective as it ultimately is.\r\n\r\nWhen the horrors die down, there's still much to be desired in the execution of this should-be distinctively brilliant, very unique concept, as it is plagued by limited exposition, as well as some repetition and storytelling that's both unrefreshing and often fairly dull, yet the film will often make up for some its mistakes with glowing moments carried by an assured and appropritately disturbing, when not deeply emotional atmosphere set by both the imperfect Roland Joffé's and his consistently stellar cast, headed by the hauntingly powerful Sam Waterston and Haing S. Ngor, both of whom play two of the biggest parts in making \"The Killing Fields\" a generally compelling and ultimately provocative portrait on the brutality of war through the eyes of the mere observers caught in the middle.\r\n\r\n3/5 - Good",
            "review_date": "2012-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tension has you on the edge of your seat! Cinema was left in stunned silence.",
            "review_date": "2012-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling film that's respected for many reasons, and makes a powerful statement. This film is an extraordinary account (well, most historical films are) of a tumultuous time in the globe, but it's greatly flawed in the process.\n\nBased on the perspective of a group of journalists, they all go to Cambodia, when it just so happens that the Khmer Rouge is fighting to take over the nation. After the army assumes control, the journalists try all they can to stay together and find a way home. However, one, Dith Pran, couldn't make it and must endure the horrors of  \"Year Zero\" that was initiated back in Cambodia.\n\nA variety of factors makes this well worth watching. The story is nicely done, with accurate information about the Cambodian genocide. Sure, it doesn't have all the details, but movie has the important stuff. Speaking of accuracy, this is a close depiction to what it's like being a journalist stuck in a war zone. Feels very real, thanks in large part to mostly unknown actors, and they do a great job. The fact that one of them, Haing S. Ngor, was actually a survivor of the genocide makes it more effective and authentic. It has an epic and sweeping arc on its agenda, and the cinematography, scenery, and direction support it. There's some very harrowing moments, especially in the last half. One of them is when Pran takes a plunge into what gives the film its title. The brutal and honest emotions make it not just a war film, or a genocide drama, but also a tale of friendship, trust, and betrayal, which really proves poignant in the end.\n\nThese 'killing fields' seem to rub off the wrong way somewhat. The soundtrack: I admire Mike Oldfield, since his album \"Tubular Bells\" is great. However, his approach to scoring an epic historical war drama about some pretty serious horrors is haphazard at best. Yeah, seriously, some parts of it are bad. At one point, it sounds like a circus funhouse gone totally wrong. But it did have its potential... \"Imagine\", while a good song, seemed kinda out of place here mostly because it felt a little too optimistic about 'never again'. Also, that film moved very slowly, as if it were crawling for the entire 2 1/2 hours; a few parts put me on the verge of rest, notably the ending.\n\nOverall, this film is gripping, tough, yet thoughtful material, filled with much ambition, which works only to a certain degree. It's a darkly satisfying treat for history buffs and others interested in this area of topic.",
            "review_date": "2012-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting and very well crafted overall. Enjoyed the depiction of the lives of foreign correspondents and the strong pathos of the film.",
            "review_date": "2012-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great true story, Dith's story was so much more interesting than the reporters.",
            "review_date": "2012-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serious, powerful and gut-wrenching film-making. An excellent motion picture.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film and so realistic to. The best aspect is the stunning cinematography and the first shot of the boy on the buffalo (wearing a US army hat), sets the standard. Also a rather wonderful score by Mike Oldfield. Amazing, true story of what would have been the worst genocide in human history but thankfully stopped in time (but not soon enough). Still the human cost and suffering was horrific. The film reflects these sentiments and feelings. Interesting early performance by John Malkovich.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful scenery is the backdrop for this horrific story set during the evacuation of Vietnam in 1975. Hard to imagine the Cambodian genocide happened during our lifetime.  Amazing that Dith Pran survived to tell it.  Unbelievably good, although I am a sucker for a true story.",
            "review_date": "2012-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields remains one of my all-time favourite anti-war films, and it's not hard to see why. I think that the greatest strength in this classic lay in Haing S. Ngor's award-winning performance as Dith Pran. Ngor himself was a Khmer Rouge victim, and reading a Readers' Digest condensed feature written by him, detailing his harrowing experiences during Cambodia's grim years, I realized that it would have been a pity had he NOT portrayed Pran in this. Sam Waterston, John Malkovich, and Julian Sands, among the others in its cast, were superb and brilliantly evocative. This great odyssey of the human spirit kind of reminded me of Doctor Zhivago, but of course with one difference - unlike Doctor Zhivago, The Killing Fields had no hinted or explicit scenes of romantic melodrama. What it showed throughout its entirety was pure cinematic enigma, exposing the horrors and brutality of war and communism to a wholly convincing level. It really was an enjoyable film, and I think that all those opposed to war in general should watch it.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is one of the rare films that take a step back and let the pictures speak for themselves - I usually like that and whouldn't mind the slow (very slow to be exact) pacing either. The pictures are just not powerful enough for a good deal of the time.\r\nIt has some beautiful landscape and longshots reminiscent of great Vietnam war movies but it felt a bit like a mashup of dying children and the pain of Haing Ngor rather than a coherent plot.\r\n\r\nI haven't found it very engaging all in all. I'm not quite sure but I think it's because of the way it's shot/made/done. It aged pretty bad in my opinion - not the subject or the looks but the narrative techniques. \r\n\r\nAlso, didn't care much about what was going on - Ngor's fate was the only halfway compelling thing in the whole movie for me and the stronger second half with the focus on him saves The Killing Fields a 60% rating.\r\n\r\nPS: Did Malkovich ever look young?",
            "review_date": "2011-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "masterpiece\none of the best movie about journalism and war  ever made",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing. i watched this after a friend visited the actual fields.",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. Highly recommended.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing and powerful film, but remember, it's not just a film, this all happened just 35 years ago.",
            "review_date": "2011-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is often too on the nose, and telling the tale of Pol Pot's regime through the lens of an American rather than through the Cambodians themselves is problematic, but THE KILLING FIELDS still manages to compel through the performances of Waterston and Ngor.",
            "review_date": "2011-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extra 1/2 star for actually watching it in Phnom Penh, after visiting The Killing Fields...",
            "review_date": "2011-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving true story about the atrocities committed in Cambodia during the 1970's seen through the eyes of an American journalist, while offering an excellent perspective on the recent history of South-East Asia.",
            "review_date": "2011-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Going into The Killing Fields with little knowledge of the historical context, I was unsure of what exactly was going on at first. However, as the film progressed, the context became more clear, as well as the relationships formed. This film produces many heart wrenching moments between the main characters, Sydney and Pran, but also through the scenes of the gruesome civil war going on in Cambodia. The standout moments of this movie are seeing the characters humane sides come through in their selfless and relentless ways to help each other. This makes the almost two and a half hours worth it.",
            "review_date": "2011-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "According to IMDB, Ronald Joffe's film 'The Killing Fields' is a based on a true story about an eye wintess story by Sydney Schanberg, a New York Times correspondent during the time of the U.S. pullout from Vietnam in 1975. Due to a language barrier, while reporting in Cambodia, Schanberg requires a translator and hence his Cambodian friend Dith Pran accompanies him. During the US Army's evacuation of all Cambodian citizens, Schanberg pressurizes Dith to stay back and continue sending him news flashes and help him with the news coverage. Due to this, he is left alone in Saigon while his family is evacuated by helicopter. Dith is then captured by the Khemer Rouge and is unable to be traced by anyone, despite efforts from Sydney. While accepting his Pulitzer Prize on behalf of Dith, Sydney Schanberg promises to somehow have Dith rescued from Cambodia. The film goes on to show the constant efforts of Schanberg and Dith Pran's own efforts until he finally succeeds to escape amidst tragedy of the death of his friend and a young boy whom he was asked to look after. The film was an extremely well made one that brought out the truth of this reality very effectively.\n\tFor a film to manage to bring out emotion and sympathy from the audiences while simultaneously being historically accurate is always a challenge. However, I felt that this film managed to do this extremely well. The development of characters, which is so crucial in a story such as this one was done beautifully as audiences were allowed to build a personal connection with them. Based on reality, the film portrays the horrific incidences that took place in Cambodia and for audiences, viewing this was truly a moving experience. Though the acting could have been slightly better, the fact that Dith's character played by Haing Ngor had actually been in Cambodia at the time greatly added value to the film. For me personally, the scenes of absolute silence amidst tragedy were most powerful as they had so much emotion behind them. Honestly, I would highly recommend this film for everyone.\n\tAs an Emerson student, I find that this historical tragedy is extremely significant. Today, we live in a world that is becoming increasingly smaller. Being a communications school, Emerson students must understand this importance and significance of being able to communicate with people from across the world. Had Schanberg been able to do this, maybe the story would not have been as tragic as it turned out to be. Besides this, it is heartening to see the dedication and passion that the two had towards media and journalism. As aspiring professionals of the media world, we students must draw inspiration from such characters.",
            "review_date": "2011-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields, directed  by Roland Joffe is a 1984  film about the experiences of two journalists, one American and one Cambodian, during the Khmer Rouge's takeover  in Cambodia following the Vietnam War. We follow the paths of these two journalists and their very different struggles during this horrific time in history.\r\n\r\nThe Killing Fields is a heartfelt drama about  the relationship between two journalists, which almost seems romantic. The love that these men have for each other is a bond strengthened by a common passion and goal to show the world what is really happening in Cambodia, despite all of the politically influenced  mass media in the United States telling the public that nothing is wrong. The acting from Haing Ngor is absolutely phenomenal; being somebody who actually went through  it\r\nduring the time period, he gives us such a genuine performance and establishes some serious credibility  within the film. He brings a certain emotional reality that is necessary with trying to recreate such a gruesome event in history. The film's score was beautifully done as well, providing a solid backbone to the severity and raw emotion expressed within each scene. It elevated  the tension so perfectly at times like when they are in the dark room making the fake passport at the French\r\nEmbassy or when Pran stumbles across all the corpses in his escape. The score gives off that raw \"real-life\" feel that is so important in its emotional appeal. The cinematography couldn't fit this style any better. Its persistant use of tracking shots forces us to follow the characters along in their efforts to document and uncover the reality of the situation in Cambodia. We move where they move. The one thing I disliked that took away from the realness of the film was some of the fake blood splatter; it looked like a cartoon and was very unconvincing in relation to the rest of the film. Despite this one minor blemish it's a beautifully crafted film that stirs emotion (I teared up at the end of this one) and uncovers the truth about the Cambodian Genocide.",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this film was very well done. It was extremely emotional and moving. I cannot imagine the strength and courage it took the men on which the film was based to survive this awful time in Cambodia. Knowing about this historical tragedy is extremely important for all. Understanding world tragedies makes us more aware of third world countries and horrific news stories in the media today. It is important to witness more serious media that focuses on true stories, heart-wrenching tales, instead of reality TV and the latest trends.",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sydney Schanberg is a journalist in The New York Times, who was sent to Cambodia in 1972 as a correspondent of the war that was occurring there. When he arrives, he meets Dith Pran, a Cambodian photojournalist and refugee who survived the Cambodian Genocide. This man becomes Schaberg's guide and translator during the war. When trying to photograph the execution of two Khmer Rouge operatives, they are arrested and later learn that the press had reported a different version of the story. In 1975, people were being evacuated from the capital because of a possible invasion from the Khmer Rouge. Even though Pran's family is able to flee, he decided to stay and help Schanberg cover the story. After going through several situations, in which they get arrested again, Pran is turned over to the Khmer Rouge after they ask for every Cambodian citizen to be turned in. After months of searching for Pran, Schanberg begins to blame himself for Pran's situation. He wouldn't be trapped if it weren't for him. However, after several complications, Pran reaches a Red Cross camp in the border of Thailand. When he returns home to his family, he reunites with Schanberg who apologizes for everything. Pran forgives him and the movie ends.\n       This movie was extraordinary. The acting, camera movements and the realism in the film captured everything necessary for the audience to be caught in the moment. It is credible, touching and it is poetically convincing. It doesn't have a traditional Hollywood structure, but as a human story, it is very well made. It captures a vivid image of how people's lives were during that period.\n\tIt is essential for an Emerson College student to know about this story, not only for general knowledge, but also because, as communicators, we all need to be aware that media cannot always be trusted. We must learn from the things that we saw about the misunderstandings in the media, and work to try and avoid those issues.",
            "review_date": "2011-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields was excellently crafted story about the sacrifices of friendship and the enduring chaos of the civil war in Cambodia. The actorâ(TM)s emotions were performed so flawlessly that I felt I was with them through their deep traumatic journey together and their separation. This film was filled with excessive violence and on the edge-of-your-seat fear. The experience of watching the movie provided me with an extremely raw perspective of Cambodia during that time. The film was a suspenseful and emotional ride from beginning to end.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought that the film was really well done. It was a great performance by the actors, namely the two main characters, Sam Waterston and Haing S. Ngor. They made all of the emotions and drama believable, like a true portrayal rather than just a performance. They really captured and displayed such intense feelings at such hard times, sometimes without even the use of words. I found the storyline fascinating; there was never a moment that I thought dragged on or didnâ(TM)t add something to the movie. I really thought it was powerful, moving film.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film Ã¢The Killing FieldsÃ¢? was about what happened during CambodiaÃ¢(TM)s civil war. Sydney Schanberg and Dith Pran are two reporters trying to cover whatÃ¢(TM)s happening. When the war gets too unsafe, Sydney is evacuated, but since Dith Pran is a citizen he isnÃ¢(TM)t allowed to leave. The film then splits into two different storylines. The first is SydneyÃ¢(TM)s story of trying to tell America the tragedy that is happening in Cambodia while trying to find his friend Pran. The other is PranÃ¢(TM)s story of being taken into a camp where Pol Pot and his followers are killing people that do not live up to their standards. Pran finally escapes and is reunited with his family and Sydney.\nI thought it was a terrible, but eye-opening film. It showed what really happened in Cambodia during the civil war and it wasnÃ¢(TM)t pretty. Everyone was getting killed, including innocent children. It was rather graphic and a few parts were very disturbing. I was expecting the film to be in the form of a documentary, but instead it was in story form. I liked it this way, but I also thought it took away from the realness of what happened by only focusing on two main people. A few parts were unclear, I think the movie could have been explained better and some parts should have been translated with subtitles. Overall it was a good movie that really made me think. It makes me sick to know that the American government knew what was going on but did nothing to stop it and even dropped bombs themselves. \nI think knowing of this historical tragedy is important to an Emerson student because we need to be aware of what is happening in the world around us. Things beside whatÃ¢(TM)s happening in our lives should be important to us. I think it is also important for a student taking this Media/Society class to see how important the media is in telling the world what is going on.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Killing Fields, an American reporter, Sydney Schanberg, risks his life to report the truth about the war and how the Khmer Rouge regime is taking over. He wants the story to be headlining news in the United States, but goes through many obstacles to achieve that. Schanberg and his translator, native Dith Pran, travel throughout Cambodia taking pictures of the bombings and shootings that are arising daily. After two years, the international embassies begin to evacuate in preparation for an invasion of the capital by the Khmer Rouge; by this time Schanberg and Pran are more than just co-workers, they are close friends. Schanberg gives Pran the option to evacuate with his family because this was extremely dangerous. Pran decides to stick by Schanberg and accomplish the reporting goals, while his family goes to the U.S. Eventually the Khmer Rouge demands all Cambodian citizens in the embassy be turned over. Schanberg and his colleagues make a failed attempt at faking Pran's U.S. citizenship, and he is forced to stay in Cambodia under their totalitarian regime, while Schanberg returns to the U.S. Back home, Schanberg campaigns and after much frustration successfully finds Pran and they are ultimately reunited.\n      The film was shot as if it were primary footage of the actual occurrence. There are many moments in the film that catch the viewer off guard. The film is extremely graphic and overwhelmingly heartbreaking. The Killing Fields came out in 1984, so the film was great quality especially for the time period. The angles and frames that the movie was shot in were very creative and effective in creating a great movie.\n     Having knowledge of this historical tragedy is extremely important to many communities, especially the Emerson community. Seeing how the people of Cambodia were treated was hard fathom. This movie shows that the government virtually controls what stories get reported. The government made it extremely hard to report because they had such tight regulation on the issue.  Emerson students should take note of Schanberg's passion and immense dedication to his line of work, the truth, and his morals. These characteristics are key factors to becoming successful. Schanberg and Dith go to great lengths to survive and communicate the truth about Cambodia to the world and survive during this ambitious quest.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Killing Fields\" won three Oscars and 23 other awards. Deserving of these honors, the film created a vivid picture of the horrific tragedies that occurred in Cambodia in the 1970's. The plot revolves around an American journalist for the New York Times, Sydney Schanberg, who tries to bring to light the tragic killings that were occurring in Cambodia. Working alongside Schanberg was his close friend Dith Pran, a Cambodian journalist and translator. The movie adapts the historical events of how the Khmer Rouge, the ruling communist party of Cambodia at the time, massacred thousands of people in an attempt at social engineering. While press corps were sanitizing the story, Schanberg and Pran continuously endangered their lives to expose the gruesome reality of what was happening to the innocent people of Cambodia. Eventually Schanberg is able to return to the U.S, while Pran is forced to stay in Cambodia and be of service to the violent Khmer Rouge. Yet after many attempts and failed efforts, Pran survives and escapes the communists' influence, and the story ends with the reunion of Pran and Schanberg. \n\t\"The Killing Fields\" gives a detailed dramatization of the cruel genocide that occurred in Cambodia. Although the truths of these events were eventually documented, it did not receive the full attention that it deserved. This film appeals to the audience's emotions and further advocates for the awareness of what happened to Cambodia in the years 1975 through 1979. Therefore, I commend the staff that worked so hard to promote the awareness of these occurrences. Considering that Emerson College is a school that is concentrated on \"film, theater, journalism, marketing, communication, writing, literature, and publishing,\" it is very important for students to know about this historical tragedy. This film shows how important forms of communications can be in times of political turmoil and heartbreaking violence. Through forms of media, and other forms of expression, people can help bring to light and possibly shorten the length in time of which events like this occur.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The killing fields film is one of the classics in its category. The film was released in November 2, 1984. Sydney Schanberg an American journalist for the New York Times was covering the Cambodian national armyâ(TM)s fight against the communist Khmer Rouge. Sydney teamed up with Dith Pran, a Cambodian journalist and interpreter for New York Times. When Sydney arrived to Cambodia the US army have bombed Neak Leung by mistake, Sydney and Pran bribe a policeman to sneak them in the boat because all routes were closed. After arriving to the town and taking photographs Khmer Rouge followers arrested them. Before Sydney Schanberg and Pran were released, the US army arrived with the international press unit to report a less harmful version of the story. Two years later Khmer Rouge was approaching the capital and all international embassies where evacuating. Sydney managed to get a secure evacuation order for Pran and his family. Although, his family was evacuated Pran refused to leave and insisted on covering the story with Sydney. The war accelerated for Khmer side and he was almost in total control. Meanwhile, all non-Cambodian citizens were in the French embassy awaiting their evacuation. Unfortunately, Pran lost his passport when he was at his familyâ(TM)s evacuation, Sydney and other reports tried hard to make a fake passport for Pran, but it was an unsuccessful attempt. He was forced to leave the embassy, and Sydney left Cambodia. Several years later Sydney won a journalism award for his converge. He also searched countless times for Pran, but Pran was forced to labor under Khmer Rouge. After a while he escaped and was captured by a different prison compound leader named Phat. Short time after Phat was attacked and killed by Khmer comrades, Pran discovered that Phat son had dollars and a map showing a safe route to a Red Cross camp. Pran escaped with Phat son and for other worker, but when he arrived to the camp all of Pran followers were died. As soon as Sydney knew the location of Pran he travelled there and took him back to the states to join him again with his family.\nThe movie was interesting and inspiring in my perspective. I think the movie was well produced and sent out a clear massage about both journalism career, and the war in Cambodia. I think that the sequence of the story was well made.\nThis historical tragedy is important to students at Emerson College because one of the main majors of this College is communication, which the movie talks about. The movie message for communicators is honesty and loyalty, which is one of the main factors for a communication major.\n-30-",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields? is a film that illustrates the horrific truths of the Cambodian civil war. This film depicts the price of war, survival, freedom and friendship. The story is depicted as we follow New York Times correspondent Sidney Schanberg (Sam Waterston) and interpreter Dith Pran (Haing S. Ngor), through their experiences in a country shattered by war. We watch a fictionalized account of the story of these two men, as they strive to record and tell the stories of the Cambodian: people, society and country. Yes this film is more fluid than an eyewitnesses account. However you are left with a sharp pain as you grasp this nationÃ¢(TM)s story. You will see the graphic details of the Cambodian history, you will be taken to the concentration camps where you watch as people are brainwashed, beaten and brutally killed. You will experience the pain of sacrifice and dedication.",
            "review_date": "2011-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Killing Fields\" is a story of perseverance and survival. It presents a grim adaptation of an eyewitness article written by Sidney Schanberg, New York Times correspondent, about the tragedies that occurred during the Cambodian Civil War. The film brilliantly captures the intense emotional struggle of those who painfully endured the hardships of the war. It leaves the audience with a sense of pity for the people unfortunate enough to have been caught in the middle of such brutality. \n\tWhen conflict began in 1973, Schanberg arrives in Cambodia and is aided by a local translator and journalist, Dith Pran, reporting about the impending dangers caused by the domino effect from the neighboring Vietnam war. As the rebel Khmer Rouge regime gains momentum, Schanberg and other journalists were captured. Dith Pran, endangering his life in the process, miraculously saves them all but was unable to escape Cambodia. Instead, he was taken and sent to a prison camp in the countryside and subjected to torture and forced labor. During those years, Dith Pran witnessed his country spiral into madness and the innocent laid dead in mass graves. Back in the U.S., Schanberg had received the Pulitzer Prize for his coverage in Cambodia. Unable to bare the burden, he admits to having \"left\" Dith Pran behind.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is adapted into a dramatized version of the real facts putting friendship, humanity in between the characters Sydney Schanberg and Dith Pran. I think the Oscars, among other awards, were well deserved: the acting was good and overall it does its best to show accurately all the historic facts during this war in Cambodia. Other than that, I had the chills when Pran was planning on escaping the killing fields; the terror of this regime is graphically conveyed to the viewer, it shows the brutality of the regime and, despite it all, how friendship and compassion can grow so much during hard times.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although âThe Killing Fieldsâ? may seem like a generic war movie on the surface, it is much more than that. It is the story of the resilience and intelligence of Dith Pran and many Cambodians like him, it is the story of the deep and abiding friendship between Dith Pran and Sydney Schanberg, and it is the story of the efforts of the journalist duo to report the horrific happenings of the Cambodian conflict and the war crimes of the Khmer Rouge. âThe Killing Fieldsâ? is well acted, in particular by Haing Ngor who portrayed Dith Pran. Ngor brought great depth and likeability to his character which must have been derived from his personal experiences at the hands of the Khmer Rouge. The film is definitely dramatized and at times the amount of blood and pyrotechnics detracts from the gripping realism and humanity of the story; the conversations between friends, the fear, the sudden and difficult good byes. While perhaps over the top and lacking in brevity, âThe Killing Fieldsâ? is emotionally and politically charged and succeeds in gripping its audience.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is adaptation of the 1975 Cambodian War regarding the dreaded Khmer Rouge. It is told from the point of view of Sydney Schanberg, a New York Times journalist, and his local representative, Dith Pran. Throughout the film, the two men begin to cover and photograph the tragedy this war has brought to its people. When Pran's family is given the opportunity to flee to America, Schanberg convinces Pran to stay and help him finish his in-depth story. Eventually, Sydney heads back for America, leaving Pran behind to face the Khmer Rouge on his own. Back in the US, Schanberg win an award for his story, while Pran continue to battle for his freedom and independence back at the slavery camps. Towards the end of the film, Sydney returns with Pran's family at an attempt to save his friend. The final shot shows the two men reuniting, safe and sound in a Red Cross camp near Thailand. \n\tWhile the movie itself was very well made, filled with haunting and emotional scenes, it was not something I would recommend to someone with a queasy stomach.  It was very difficult for me to watch the descriptive scenes, including that of Pran witnessing the killing fields, filled with bones and blue bags used for the suffocation of the war's innocent. The film was basically a two hour brutal torture and it is not something I will likely watch through a second time. However, the true story is beautifully told, and the acting itself is very powerful. \n\tThis historical tragedy should be an important story that every Emerson student should take into account. The Killing Fields shows the importance of communication and how important it is to report the truth to the people. The movie also gives the impression that one should never give up, and fight for their rights and their dreams. Despite the gory graphics, this film should make Emerson students proud of what they have accomplished in their lives and never give up on what they want in life.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is set during the civil war in Cambodia in the 1970's, and focuses on an American reporter for the New York Times, Sydney Schanberg, and his Cambodian guide, Dith Pran. The two men work very closely to report the tragedy occurring in Cambodia, and Schanberg later wins a journalism award for their work. Determined to report the truth, Schanberg and Pran stop at nothing in order to cover the violence in Cambodia that takes place between the Khmer Rouge (the communist party) and the government troops. After Pran sends the rest of his family to the United States with the evacuating American troops, he remains in Cambodia to help Schanberg. The Khmer Rouge arrests Pran and Schanberg, along with some of their colleagues. Being an American citizen, Schanberg is able to retreat back to the United States, but Pran is forced into working in the fields under the watchful eyes of the Khmer Rouge. Pran must partake in the re-education process, in which he needs to pretend he is not an intellectual and acts as though he does not know French or English in order to survive.  Pran eventually escapes, and he partakes in an emotional reunion with Schanberg. \r\n\tThis film combines an emotional story with very powerful images. The desolation of Cambodia during that time period is expertly captured and portrayed in a way that connects the audience to the characters in the film. The scene that shows Pran walking through the field of decaying bodies is especially haunting.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Cambodian genocide that took place during the rule of Pol Pot and the Khmer Rouge in the late 1970â??s is considered to be one of the worst genocides in modern world history. The film, The Killing Fields, takes its name of those who have died due to disease, starvation, and violence upon innocent civilians from the restrictive policies of the Khmer Rouge, numbering from 1.8 to 2.3 million, in which the land of Cambodia became their corpses. The Killing Fields is an important and eye-opening portrayal of a significant period of world history in Asia. The film is based on the true stories of New York Times journalist Sydney Schanberg, and Cambodian journalist, Dith Pran. Both undergo the events of the genocide themselves throughout this historic film.\n\nThe director of this movie does not hold back in showing the events leading to the genocide, which started in 1973 with an accidental bombing of a town by American planes that killed hundreds. Along towards the end of the film, Sydney is in New York, trying to find any sign of Pranâ??s whereabouts, for he was recently enslaved in a forced labor camp under Khmer Rogue rule. If the film had focused entirely on presenting the historical events, the film would be too overwhelmingly depressing to view. It shouldnâ??t be viewed as a historical drama but as a reminder that such atrocities exist and still happens in our world today. By simply ignoring them, those atrocities will never go away.\n\nDespite the horror of this inhumanity, this movie is not widely taught or discussed within schools in America. As an Emerson student, it is profoundly important to know of this historical tragedy because the characters in this event have risked their lives to use the art of media to communicate what is going on in the country of Cambodia. It was a duty to themselves that they were proud to accomplish. Many people arenâ??t aware of such events in the world unless it is being passed on through the arts such as movies like this, or even through mass media such as newspapers, radio, TV news, etc. As a student, it is our duties to spread the word of what goes on in this world as a message because every little matter that happens to one community can have the powerful, domino affect to impact everyone else.",
            "review_date": "2011-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fantastic award winning cinematography combined with emotional music lures you into the movie instantly. The performance by Haing S. Ngor (Pran) earned him an Oscar, and he deserved it. Sam Waterston (Schanberg) also put on an unforgettable performance. You instantly get attatched to the characters and the struggles they went through, and when you remind yourself that its true, it can put a tear to your eye. This is a movie that gave Cambodia the recognition and respect that it needed.",
            "review_date": "2011-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can honestly say this was a brilliant film. Powerful and moving, it tells a story that many would otherwise vaguely know about. Cinematography and screenplay aside, few actors have managed to create a perfect portrayal on the level of Doctor Haing S. Ngor?s role as Dith Pran ? whom I see as the real heroes of this story; not the actor or the journalist, but both men together. Their similar experiences in the brutal concentration camps during the Khmer Rouge regime brought a remarkably realistic atmosphere to the latter half of the movie. For about an hour, Dr. Ngor was not only himself; he was Dith Pran, and he was any and every other innocent victim of communist oppression and enslavement and genocide. He demonstrated the horrifying predicament of the Cambodian civilians in a way that only someone who survived it could do, something that no professionally trained actor could have achieved.",
            "review_date": "2011-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even a a kid, when this movie came out, I was taken by it",
            "review_date": "2011-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 1984 movie \"The Killings Fields\" portrays the journey of journalist and photographer, Sydney Schanberg, from \"The New York Times\" and his interpreter, Dith Pran, who has come to investigate the devastating conditions in Cambodia around the same time as the Vietnam War. The Khmer Rouge, the guerilla Cambodian army, were involved in a  civil war with the National Cambodian Army.  An evacuation is ordered for all American embassy inhabitants to leave the country, but Schanberg and Pran decide to stay to continue reporting what is going on.  Sometime after, when the Khmer Rouge take over the capital, the two journalists are arrested.  Pran is able to talk them out of the execution they had planned for the prisoners, but is then taken captive while his American friend goes free. \nPran is made to labor in at rice plantations and the Khmer Rouge try to brainwash him, and everyone else, into thinking their beliefs. He attempts to escape and in the process, is caught and thrown in prison again.  Meanwhile, Schanberg had been trying to find Pran to try and save him from the communist rule.  Then, he wins an award from his coverage of Cambodia, but feels guilty about it since, Pran had so much to do with the coverage and he still hadn't been located. \nWhen the prison where he is being held is attacked, Pran manages to escape and find a Red Cross station.  Schanberg is alerted of Pran's reappearance and goes get him from the safe house.\nThis movie was brilliantly made. It was intelligent, respectful toward actual events and very realistic. It brings up a great social point about censorship and journalism in times of war. Before Schanberg went out to Cambodia to write about it for \"The New York Times\" most people had no idea that any violence was occurring. And, what they did know was what the government chose to tell them. It only has to take a very small number of people to change the world by telling the truth and this film is a great representation of that point.\n\nE. Yumkas",
            "review_date": "2011-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is something about the film that keeps you watching it.  I don't know if it is the graphic visuals or the compelling story.  The film depicts chaos and struggle that war brings and the horror of living in it. But behind all the horror there is a loving story which makes this an amazing film.  while watching you can't help but think to yourself if Pran is going to make it or note.  This movie has a realistic quality about it that you can't find that much in movies today.  It is a touching movie that will keep you hooked watching and will touch you emotionally.",
            "review_date": "2011-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields, a 1984 British drama, seamlessly captures the horrific violence in Cambodia during the seventies.  The film tells the story of American Journalist Sydney Schanberg and Cambodian journalist Dith Pran and their efforts to report the truth of the violence of the Khmer Rouge while fighting to stay alive.  As the violence persists, Pran is forced into imprisonment with the Khmer Rouge, while Schanberg is evacuated from the country.  Pran becomes a laborer for the Khmer Rouge, He struggles for survival and longs to escape the brutality of the totalitarian regime and be reunited with his family and Schanberg.  \n\tThe Killing Fields was a poignant film that grabbed my interest from the start.  This movie does not shy away from the uncomfortable.  It depicts ghastly scenes of violence that are both shocking and edifying.  The vivid images throughout the film portray chaos and desperation unlike any other war film I have seen.  My emotions were deeply affected by each scene and I was left with a greater understanding of this historical event.  \n\tAs a marketing student at Emerson College, it is important to note the way the press handled the portrayal of violence in the media throughout this film.  In the beginning of the movie, the press corps arrived with the U.S. Army to report a sanitized version of the story.  It showed that the mass media is highly censored and displays a manipulation of opinions.  It is also important to note the persistence of journalists.  As I study the mass media and forms of communication and begin to develop my own marketing strategies, knowing about this historical tragedy becomes relevant.",
            "review_date": "2011-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sydney Schanberg (Sam Waterston) arrives in Cambodia during the Vietnam War in 1973. He finds carnage galore and is accompanied by a translator (Haing S. Ngor) who speaks the language of rebel group, Khmer Rouge. They begin to sift through the wreckage of various cities that have been torn apart by war, finding that the Americans screwed up their coordinates in the process of bombing cities within Cambodia and to be imprisoned by times by Cambodian forces. Soon they are fighting for their lives. Fairly grim film looks at the journalist and Cambodian perspective of the devastating war during the late 1960's and early 1970's. Fairly intense at times, but most intense during the middle sequences of the film. Quite sad as well and very graphic. It's length, admittedly, it not used to the full extent and the film does not rank as great as entertainment as other Vietnam War related movies, but it is very effective. Here is a successful movie that does not need soldiers fighting each other to demand full attention from the viewer.",
            "review_date": "2011-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "god u wish someone wud hav beheaded that prick pol pot.........this movie jus makes that statement even more clearer",
            "review_date": "2011-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the book The Death And Life Of Dith Pran, The Killing Fields is one of those films of male friendship and love that makes us uncomfortable.  Waterston plays Sidney Schanberg, an investigative reporter covering the Nixon-approved secret bombing of Cambodia as the Khmer Rouge take command and Polh Pot ascends to power.  I think it's fair to say though, that we receive news items these days from war torn parts of the world, that the film doesn't hold the same shock value as it did on release.  Dr Ngor won an Academy Award for his portrayal of Pran, despite never having acted before.  Remarkable.",
            "review_date": "2011-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I first saw The Killing Fields when I was a freshman in high school when I began to follow the Hollywood trend of making a film about anything and everything about the Vietnam war. At that time, this was one of the films of that genre that stood out to me. I decided to revisit this film again, many years later.\n\nThe Killing Fields is an outstanding piece of film making that is serious in nature and tragic in scope. The performances by a young Sam Waterston (Law and Order) and Dr. Haing S Ngor hold the film together. Their chemistry is electric and its almost as if the two of them seamlessly became the characters they are portraying.\n\nThe cinematography is beautiful, despite the war torn environments and the bloodied victims. The sequence  that shows the evacuation of Saigon is intense and amazing.\n\nFinally, the musical score is something that is actually a character itself that I never noticed on prior viewings. Its a score that is very stirring.\n\nIf you haven't seen The Killing Fields, its an excellent movie that highlights a portion of history from the Vietnam War. A warning however, there are graphic images that may be disturbing to some viewers. This is a serious film with a serious story.\n\nHighly Recommended",
            "review_date": "2011-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few war films that doesn't come from a soldier's point of view, and neither does it feature any adrenaline-pumping battle sequences.\nAnd yet, the film does just as fine a job as any anti-war film in creating a frightening, chaotic world. Ngor's performance is superb, it's a shame he was snubbed for the best actor award. The direction by Roland Joffé along with the oscar-winning cinematography by Chris Menges bring the story to vivid life. The latter portion of the film, taking place for the most part in the Cambodian countryside is particularly breathtaking. The only thing that felt out of place was that ending, with \"Imagine\". It just felt forced.",
            "review_date": "2011-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very good but harsh movie based on a true story.",
            "review_date": "2011-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields in the incredible true story of the atrocities committed by Khmer Rouge in Cambodia. Brilliantly acted and directed The Killing Fields is a powerful film that touches on what is probably one of the greatest crimes of the 20th century along with the Holocaust. The Killing Fields is a stunning drama film that brings to light a terrible crime. This is a brilliant film that exposes the horrors of the Khmer Rouge, and one mans survival through the ordeal. The Killing Fields is an accomplished film that though is a solid drama, also plays out like an important history lesson. The film will most likely want to make you read on the subject. The film is an important one, and like Schindler's List, also evokes the humane side to a terrible ordeal. A film that evokes emotions as you watch the events unfold before you. The cast that grace this film are terrific, and the thing that's pretty interesting is that actor Dr. Haing S. Ngor who plays Dirth Pran is an actual survivor of the Cambodian Killing Fields. This is a superbly crafted drama film that has a strong story, and boasts some terrific performances. This is a must see film for anyone who is interested in the subject, and to those who enjoy a solid, drama film; The Killing Fields is a strong, near flawless picture, and one you can't easily forget.",
            "review_date": "2011-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very impressed. An above average Vietnam film.",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Killing Fields\" is a war film less about war than it is about loyalty, deceit and pride. Syd Schanberg is a reporter for the New York Times covering the situation in Cambodia at the close of the Vietnam war. Dith Prahn is his companion and translator. His fealty to his friend soon becomes a hazard when the Khmer Rouge infiltrate and control the city. All Cambodians must return. Prahn is helpless, captured and abused. Syd is back in America, fighting to find his friend and rectify his actions. The scenes of war are nothing spectacular and the film becomes muddled when that is it's focal point. It's strength lies in the relationship of Syd and Prahn, exceptionally played by Dr. Ngor. It teeters the fine line of becoming mawkish and realistic, but allows the viewer to witness the true life account of the victims of Cambodia. Heart-felt, tragic and honest. A look into the results of war on the innocent, the lavishes of men and the heart of truth.",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not usually one to dock a great film a point on account of its score/soundtrack, but I did find the music to be distractingly bad at certain intervals, particularly in the first half of the movie when the music would have sounded more appropriate to the background of an old \"Lost in Space\" episode.  Also, who among the viewers of this movie didn't groan when \"Imagine\" kicked up at the end of the flick?  That said, this is one of the most brutal and emotional war films ever made and the bulk of it holds up well.  You'd be hard to come by a more realistic account, and its journalistic story gives it an almost documentary vibe that really brings you in.",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "War movie.Base on true story.\n40%\nThis movie was created before I was borned.\nIt may sound great at that time but for me right now i,m not get in to it ; motion , feeling, acting is simple. Some explosion scene some group of citizen just walk like they are shopping : ( but finally i watch it to the end.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hard film to watch but leaves a lasting impression. So dark its crazy but given the subject yeah its a very taut and important film. Really well made, can't turn away in spite of the sadness.",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Teetering on the edge of being 5-star.",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really touching, some extreme left thinkers should see it.",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good flick based on the true story of a Camobidian working for the NYT who got stuck with the Khmer Rouge for a number of years and escapes.  This is a subject I was very ignorant of for many years since it happened when I was fairly young.",
            "review_date": "2011-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film detailing the story of Pol Pot's Khmer Rouge, and their genocide of the Cambodian people told brilliantly through the eyes of real life reporter and survivor of the Killing Fields, Dith Pran.  A must see.",
            "review_date": "2011-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely emotional and honourable take on a truly gruesome period of history. The final scene is tear jerking.",
            "review_date": "2011-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very thrilling drama",
            "review_date": "2011-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well made movie about a point in history often forgotten.",
            "review_date": "2011-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Academy Award type of movie. Solid production of an interesting story that we rarely know about. Two and half hours seems a bit daunting but the second half of the film is pretty exhilarating and you get to hear Imagine by Lennon in the end.",
            "review_date": "2011-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece!\nOne of the best movie about journalism and war ever made .A incredible description of Cambodia during the war the killing field manages to make us experiment the tragedy and the consequences of war as only a few films have made it.Beside it's amazing story of friendship survival and hope it is, the true story of the killing field that makes it unforgettable.the \"killing field\"s human appeal is so strong  that affects you  deeply after seeing it.You are not the same afterward.For this very reason the killing field  belongs to this category of film such as hotel Rwanda that change your perception of the world for ever.",
            "review_date": "2011-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was ok. I honestly didn't get the hype. It was a good story - very sad - but it wasn't anything I haven't seen before.",
            "review_date": "2011-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Khmer Rouge were cunts.  And so were the Americans.",
            "review_date": "2011-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was actually quite disappointed with this film. I was expecting a history lesson on what happened in Cambodia . Eg schindlers list or hotel Rwanda give a bit of background info. This doesn't. Being honest it's hard to follow at the best of times and the talking in Cambodian without English subtitles or translations really doesn't help. The story is mildly touching though but really that's about it. The music is scary( not tense but weird) and the story is not very memorable except the scene with the put full of corpses. I tried very hard to \nIke this but I just couldn't. Get interested",
            "review_date": "2011-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and sweeping story about one of the most horrific events in modern history.",
            "review_date": "2011-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the structure; it starts out like Welcome to Sarajevo, with heroic white journalists running around trying to save the world, and then the situation devolves to an absurd degree, and it switches to a grim, utterly compelling march for survival, almost completely devoid of English or translated dialogue. It's also visually ballsy, with some iconic magic-hour photography (the scene from the poster is stunning) and scenes with massive crowds of extras crammed into single frames. What happened to Roland Joffé?",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love the soundtrack mike Oldfield is my favorite artist",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Roland Joffe's greatest offering. Terrific ending.",
            "review_date": "2011-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good film, and it's portrayal of the Khmer Rouge is graphically brutal. I can see why S Ngor got the Oscar for his depiction of Dith Prang seeing as he's not actually an actor. There does however feel as though something is missing from the film. It takes for granted that you already know about the conflict in Cambodia in the seventies and the cause and effect of the Vietnam war. Especially in relation to the subsequent bombing campaign by the US in Cambodia which gave rise to the Khmer Rouge. None of the history is fully explained and only snippets of information are divulged and as a result you feel slightly lost as the story unfolds.",
            "review_date": "2011-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As moving and powerful now, perhaps even more so, than it was when the film was originally released. The Killing Fields brings a highly talented cast to a movie filled with images and sounds that play back in your head long after you've got done watching it. Though graphic in nature and certainly not for kids, I would highly recommend it to anyone. Making the film even more hard hitting is its trance like soundtrack, beautiful photographing of Cambodia, and the fact this film was based on a true story.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serious, powerful and gut-wrenching film-making. An excellent motion picture.",
            "review_date": "2011-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did I not rate this?! I saw this 3 years ago! AMAZING MOVIE.",
            "review_date": "2011-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its good, but theres something missing to take it to greatness...i cant put my finger on it.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sad film. Read about the co-star Dr. Haing S. Ngor and they should make a film about him as well.",
            "review_date": "2011-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. This one always gets me.",
            "review_date": "2011-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic film. Awful when the little kid gets killed by a landmine",
            "review_date": "2011-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a pretty amazing and sad film. journalists get caught up in cambodia's civil war and try to make it out safely.\n\ni didn't know much about this topic so for me it was quite interesting. haing ngor does an amazing job as dith pran the cambodian journalist.",
            "review_date": "2011-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a true story about the Khmer Rouge in Cambodia. It is extremely powerful and very tragic. The Killing Fields is a wonderful movie.",
            "review_date": "2011-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, really heart rending. It's so sad and senseless what human beings are capable of doing against each other. Nominated for Best Picture in 1984.",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Because of when it was made and hindsight this movie barely scratches the surface of what was going on and what the Cambodians went through. Its well acted and stays interesting but only hints at the real issues.",
            "review_date": "2011-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure boredom for the most part, but it depicts a true scene in a war/chaos.",
            "review_date": "2011-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from the dated 80's score, it's an otherwise thoughtfully un-sensational take on one of the most horrifically sensational eras of the 20th century.",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and emotional film lead by a string of stunning performances, an energetic screenplay and extraordinary cinematography. Very good.",
            "review_date": "2011-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies that just crushes someone when they watch the work.  The story revolves around the unfortunate true occurence of the Khmer Rouge doing ethnic cleansing in their year zero campaign. The film is an important work and unforgettable.  It is the soundtrack that is a little dated.",
            "review_date": "2010-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good performances in an emotional, important story, but this suffers from poor direction, as the film wanders off at some points.  Good, not great.",
            "review_date": "2010-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie that brought sam waterson to the forefront",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see film for sure. Really great performances in a portrayel of a truly horrific time in Cambodia.",
            "review_date": "2010-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "deeply moving, very important and outstandingly made. and a proper tearjerker...",
            "review_date": "2010-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The political impact of this film is irrefutable. After my first viewing of this striking portrait of the Cambodian holocaust, I was completely radicalized. After my most recent viewing, I felt that the acting in this film is middling. The story itself, while compelling, is conveyed in a matter-of-fact presentation. There's not much left to the imagination. The issues the film raises about Shamberg's character using Dith Pran in order to write his award-wining stories are never addressed head on. While the film raises awareness about Cambodia, it fails to provide any meaningful insight into its main characters.",
            "review_date": "2010-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film with an ending done so tastefully that it made me shed a tear.",
            "review_date": "2010-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible story. It is hard to believe it is true.",
            "review_date": "2010-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This show is so fucking intense!",
            "review_date": "2010-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a horrible event in History.  A Lovely country though. Made my visit to Cambodia so much more personal.",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney....sidney....\r\nI think that's right. That's all i can remember lol. Quite interesting true story.\r\nSaw it at the cimema in 1984! Very dated but not to be missed.",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absorbing, haunting and memorable although I would have liked to have known more about the characters to care more. Also if one does not know anything about the conflict it will be hard to understand. I also somewhat doubt Dith's story although anything is possible.",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrifically harrowing and haunting movie, beautifully shot and a great performance by Haing S. Ngor. ~re rated~",
            "review_date": "2010-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although the first hour or so is your generic war movie without much to it, it soon picks up and delivers a real war experience, as moving as its unsettling.",
            "review_date": "2010-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is an excellent film which provides a striking dramatisation of the 1970s Cambodian Holocaust. Focussing on the relationship between a US newspaper columnist (Sam Waterson) and his Cambodian guide (Haing S. Ngor), it's a very human perspective of the chaos happening around them, where 2 million people were eventually killed by the Khmer Rouge. In a few scenes I felt the soundtrack was heavily distracting from the story, but this is still a very profound and effective drama with powerful images.",
            "review_date": "2010-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-told story, with good acting. Good direction in a very correct film. The ending was excellent.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film. Really good acting, and a really good story. I saw this movie in high school and it is probably better to actually be studying these events, as you are watching this film because it really gives you a really nice perspective as to what is actually happening. Very well made.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is decennia ago that I have watched this movie in a further empty cinema, but still remember my heart was strangled. The one scene where Dith Pran falls into the mud and gazes into dead bodies and faces is still engraved in my brain after all those years.",
            "review_date": "2010-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and moving true story of friendship. I like it a lot.",
            "review_date": "2010-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does a decent job of humanizing the tragedy in Cambodia.",
            "review_date": "2010-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow, meditative film that takes some patience.",
            "review_date": "2010-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The horrors of the Cambodian genocide became buried in the first hour and twenty minutes of background information on the conflict between a small group of journalists, eventually huddling in an American embassy, versus an emperging Khmer Rouge government hellbent on capturing photographer Dith Pran. Thought to be benign, rebels overtake the government with the help of Americans, ignorant to their full power after the end of the Vietnam War. Not to say that these events were not important, but the film came across as more of a biography of Dith Pran, a captured Cambodian, then on the actual killing fields full of rotting corpses. For the next hour the tumultuous record of exposure to the dictatorship based on genocide is captured by Dith Pran, working the fields, trying to escape without being killed by small children, the hierarchy of the system. The ugly betrayal of humanity is alarming, not always documented by groups of people being slaughtered. It's etched across actor Haing S. Ngor's face as his mortality flashes before his eyes. My main qualm is the choice of music, which is either a reject 80's synth piece, or a racially insensitive set of bing bongs. Plus, the last song played is \"Imagine\", which stinks of a tearjerker cliche.",
            "review_date": "2010-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and horrific.",
            "review_date": "2010-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That they just plop you right in there without any exposition or explanation is both the film's greatest strength and its greatest weakness.",
            "review_date": "2010-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very difficult watch, realistically bringing the horrors of Pol Pot's evil regime in Cambodia to the big screen.  All the acting is fantastic, but extra credit must go to Haing S. Ngor in his screen debut.  Powerful stuff.",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are better war movies out there, but none seem to touch upon the atrocities of Pol Pot. Vietnam may be where Hollywood lies its claim, but Cambodia deserves an equal storytelling stake. So for going to this country, and for featuring a very young Sam Waterson and John Malkovich, you gotta see this.",
            "review_date": "2010-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "87/100. Very well acted, Haing S. Ngor is outstanding, Sam Waterston and John Malkovich also excel. Very believably presented, the cinematography is very effective, as is the score. Powerfully written and directed, heart wrenching at times and riveting throughout. The editing is very skillfully done and adds a great deal to the pacing and effectiveness of the film. Quite unforgettable. Some may find it disturbing because of it's brutally realistic approach.",
            "review_date": "2010-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Grandious War Drama about the Rise to Power and the Reign of Terror of the Red Khmer who create a realistic Portrait of that Time and the Crimes of the Red Khmer and also critize the Bombardement of Cambodcha trough the U.S. Air Force without Marching In for which it was dedicated earlier and this failed March was responsible for the Victory of the Red Khmer and their Rise to Power who create one of the Ruthless and Violent Systems on Earth who still exist today Million's of People are suffering in Forced Labor Colonys who are comparable to the Concentration Camps of the Nazis the Scenes in this Colony were the most disturbing in this Film and shows how anti-intellectual the Red Khmer were they shoot Teachers, Medicals and other Intellectuals to have a loyal Folk of Dopes who stop to think and just work the little Girl in a Leading Position who torture Prisoners was freaky there were also many other Child Soldiers in the Row of the Red Khmer and there were also beautiful Pictures of the Local Nature of Cambodcha and a bombastic Soundtrack in this Movie Sam Waterston and Haing S. Ngor play superb",
            "review_date": "2010-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Someone needs to tell this story better. Bad acting... Terrible music...and yet it's a compelling story!",
            "review_date": "2010-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "realistic portrayal of the ruthless khmer rouge era in cambodia",
            "review_date": "2010-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A devastating, searing true life war story focusing on the war reporting of New York Times correspondent Sydney Schanberg, played by Sam Waterston in a superlative Oscar nominated performance, he won a Pulizer Prize for his coverage of the civil war in Cambodia before its capital, Phnom Phenh, fell to the Khmer Rouge in 1975. Stunningly photographed on location in Thailand, directed with great skill and intelligence by Roland Joffe, with powerful Oscar winning cinematography by Christopher Menges, who captures the  full horror of this Asian holocaust, in which about three million Cambodians perished, in a inhuman campaign of ethnic cleansing by the tyrant Pol  Pot.  Lacerating scenes include those involving Schanberg's desperate attempts to free his friend and Cambodian assistant, Dith Pran, played by the late Dr. Haing S. Nigor, who in real life was a survivor of this human tragedy, he delivers a heartfelt and unforgettable Oscar winning performance, he is left behind in the chaos, and must survive the living nightmare of the Khmer Rouge's \"re-education camp.' a contemporary version of hell on earth. The film also features exceptional supporting performances by John Malkovich, Julian Sands, Craig T. Nelson, Athol Fugard, Spalding Gary and Bill Paterson. A poignant and intensely moving film, which is one of the most powerful haunting motion pictures ever made on the subject of the Vietnam War. Winner of 3 Academy Awards, Best Supporting Actor: Dr. Haing S. Ngor, Best Cinematography: Christopher Menges, Best Film Editing: Jim Clark. Note:  On Feburuary 25, 1996 Dr. Haing S. Nor was found murdered in the garage of his apartment building, shot to death at the age of 55, in Los Angeles, it is very sad and ironic that a man who endured and survived 4 years of imprisonment, torture and starvation during the Khmer Rogue atrocities in his homeland, and struggled to be free, should die so brutally. His relatives and friends believe that his killing was revenge for his opposition of the Khmer Rogue.  Highly Recommend.",
            "review_date": "2010-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For all those who think , their life is in shit , ... watch this . the movie is all about , WILL power  and Hope and the sence of thankfullness and gratitude for those who save your life by putting self at stake . MUST WATCH  .  dont watch if u cant see dead and ripped off carcasses. :)",
            "review_date": "2010-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very painful to take in after finishing.",
            "review_date": "2010-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man. Amazing story--both horrific (in its depiction of what was going on in general) and really moving (in its depiction of the friendship between Schanberg and Prahn)--and supremely well-done film (except, minor issue, for the music which was at times kind of weird and intrusive).",
            "review_date": "2010-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Interesting story, excellent photography. Just a little more long of normal.",
            "review_date": "2010-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Journalists do have a heart.\r\nHigh notes -\r\nAc - Sam Waterson, Haing Ngor",
            "review_date": "2010-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The song \"Imagine\" by John Lennon starts to play . . . \"Nothing to forgive, Sydney, nothing.\"",
            "review_date": "2010-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "got this on VHS oldc school and remember oit when i was young!! best of the best and this happened!!!!!!!!",
            "review_date": "2010-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In mid 1975, a man named Saloth Sar took power in a small southeast Asian country that was completely neutral in the war between the United States of America and Communist North Vietnam. he then promised peace and prosperity for all of his people. everyone would be totally equal. he then proceeded to kill of everyone with even half a brain in his country. some estimates of the amount of people that he killed, range as high as 2.2 million in a country full of 7 million people. Saloth Sar is better known by the name of Pol Pot. The country that he took over as leader of the Khmer Rouge (Khmer Rouge meaning Red Khmer with Khmer being the major ethnic group of the country he took over) was Cambodia and this is a movie about the Killing Fields. Oh and by the way, if you do not know who Pol Pt was, look it up NOW. watch this movie NOW. forgive me if I get a tad preachy here, but this is not the sort of event in history that we can afford to forget.\r\n\r\nYes I know, this film didn't win Best Picture so this is a little bit of a deviation from my latest review pattern. although I feel that this film fully deserved to win Best Picture over the sub par period drama about two rival composers, Amadeus. \r\n\r\nI was raised my whole life (this is my dad's second favorite movie after The Godfather) being led to believe that this film was extremely brutal. well, in a way that hurt me because I had this level of brutality on the level of Saving Private Ryan and it wasn't that brutal at all. this is not to say that it wasn't brutal. it totally was. what the KR did to gain power is extremely horrifying. this movie truly captures just how horrible it all was. If you were a doctor. you were killed. if you were a lawyer. dead. non Khmer Rouge politician. really dead. student. dead. spoke a language other than Cambodian. dead. journalist. dead. if the Khmer Rouge were bored and needed something to do. dead. you get the idea. The result was that after Pol Pot was no longer in power, there were no smart people left in Cambodia. \r\n\r\nnow for the film itself. the acting was really good. I liked John Malcovitch and Sam Waterston a lot. but, the highlight of the film was the Oscar winning performance by the late Haing S. Ngor. he was absolutely amazing. He played Dith Pran, a Cambodian Journalist helping out the main character. he had easily the best performance of the whole movie. the whole movie was overall the best movie of 1984. its brutality and the power behind what the film was about made it an excellent film. Replacement winner for the actual 1984 Best Picture winner, Amadeus.",
            "review_date": "2010-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's not a topic I really know anything about, but i thought it was a fascinating account of war in cambodia with really great acting and some thrilling and terrifying suspense. BRAVO - haing s. ngor!!!!\n\n(on a side note - I've said it before but here  it goes, the synthesizer is LITERALLY the worst invention by the hand of MAN!!!!! just the sound of it literally aborts you from the story and reminds you that the film was made in the window of time of the late 70's - 80's.......)",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me there has to be some more intresting take on how to tell a story.",
            "review_date": "2010-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense, moving and powerful film that will stick with you a long time after you've watched it.",
            "review_date": "2010-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a truly great film. harrowing and tragically true. it makes you think.",
            "review_date": "2010-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting film, plays on the emotions but earns it.",
            "review_date": "2010-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film although I was looking forward to hearing more about the history of Pol Pot's regime of terror and I dont think it went into detail about the socalled \"education camps\" were the unfortunate souls were sent to.\r\nAside from this it was a joy to watch how a friendship unfolded and how when separated for a long period were eventually reunited. \r\nThe re-uniting of the 2 friends in the story was set to the backdrop of John Lennons \"Imagine\" and is now notorious in film history. \r\nMaybe not the action some people would like to see from a war movie but definately a great watch and id recommend it.",
            "review_date": "2010-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this to be a truley entertaining epic. The Killing Fields is both hard to watch and a great look at an event in history. While it starts off slow and has to many \"Am I about to Get shot\" moments, the movie overall pays off. It is increadibly well acted and well written. The film is able to evoke all the write emotions and more than makes up for the boring first part.",
            "review_date": "2010-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just jumped onto my list of personal faves.  how am i only now watching this?",
            "review_date": "2010-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie about people. The good and bad that happens everywhere all the time. And this is one of those few movies that tells the truth about communism. Perfect up until it closes on the worst song ever written. The song that is about the eradication of all distinction, even good and evil, \"...and the world will be one.\" Nonsense. SRSLY, a great movie up until the worst song ever written.",
            "review_date": "2010-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow.... never the same after.",
            "review_date": "2010-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unflinching film based on the true story an american journalist and his cambodian journalist friend who gets left behind in cambodia during a military coup. The images are brutal, the story is original and emotional with Ngor winning a supporting oscar for his powerful, underplayed performance.",
            "review_date": "2010-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful story of journalist role behind the darkness of true story!! Roland Joffe told the dramatic plot that give an affects to our humanity and morality sides. Sam Waterston and Haing S. Ngor leads a casts with surprising brilliant performance at his no longer careers. Masterpiece!!",
            "review_date": "2010-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat formulaic but gripping story.",
            "review_date": "2010-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loved this as a kid and i still love  it to this day",
            "review_date": "2010-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is a telling story and such a sad story we humans are so cruel to one and other....",
            "review_date": "2010-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that should be viewed universally.  If we believe NEVER AGAIN this movie provides motivation to understand our fellow human's plight and passion to help rectify wrongs.",
            "review_date": "2010-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving war film with great performances.",
            "review_date": "2009-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-told story, with good acting. Good direction in a very correct film. The ending was excellent.",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have ever seen.",
            "review_date": "2009-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "25 year old movie, which you will notice while watching\nBut still this story needs to be told! another story about the dark side of humanity.. it saddens me but at least I know now",
            "review_date": "2009-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent depiction of the Khmer Rouge coup (long sequences of noisy urban chaos make you feel like you're there) and their murderous 're-education'/cultural revolution (although it failed to fully convey the beserk, bloody savagery of the masses run amok), with a truly amazing performance by Haing Ngor, a doctor who had never acted before",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Documentary shot as fiction. Outstanding movie.",
            "review_date": "2009-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Become a little more worldly and check this one out. A true story with brilliant performances and brilliant set pieces that work to create an endearing and provocative piece of cinema. \n\n    Intense and surreal ... lets you realise the horrors that man is capable of and the enduring spirit of friendship, family and a good heart. Get ready for tears. ...",
            "review_date": "2009-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's slow, especially compared to today's films, but when it gets going, it's extremely gripping.",
            "review_date": "2009-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must admit that I was working while watching this, but it seemed pretty good.  Josh said it was a bit slow.  The story was heartbreaking.",
            "review_date": "2009-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "so moving one of the best movies about war I ever seen",
            "review_date": "2009-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart wrenching & deeply moving, a brillant movie!Highly recommended.",
            "review_date": "2009-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not as impressive as i thought it'd be, based on what i'd heard about it over the years. and jesus, sam waterston is fucking terrible.",
            "review_date": "2009-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I have ever seen. If this doesn't make you think there's no hope for you",
            "review_date": "2009-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it for the first time in 20-something years. Magnificent. Better than I remembered.",
            "review_date": "2009-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not quite liked it.but i'm agree with it winning oscar for best cinematography and best supporting actor.the cinematography by chris menges really captured the sorrow of cambodian and the ruthlessness of khmer rouge on screen perfectly.and Haing S. Ngor give the performance of a lifetime as a cambodian who got trapped in this conflict.",
            "review_date": "2009-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The saddest movie I've ever seen. Some awful voice-overs and visuals take away from the effect, but it is still a powerful film.",
            "review_date": "2009-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly moving film about the unintended consequences of irresponsible war.  Most people know about the attrocities that happened in Vietnam during the Vietnam War, but maybe not so much when it comes to Cambodia.  Very cool to see some stellar actors when they were much younger.  An important piece of cinema.",
            "review_date": "2009-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really observant film that doesn't push anything on the audience.  There are one or two moments that seem a bit random/awkward and not necessary, but this can be overlooked given the success of this sprawling, unconventional story.  I really enjoyed the latter half especially.",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the movie was engrossing, the acting was amazing and the story gave me cause to think. the plight of the people was shown through the eyes of just a few men but it was shown in a way that you could feel the bond between them, and everything surrounding.",
            "review_date": "2009-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrowing and emotional, made even more so if you watch it when pregnant with your first child, like I did in 1985. And the reality was even worse than this. Brilliant film ... shame the music was such crap.",
            "review_date": "2009-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hang S. nor received a well deserved Oscar for his portrayal. An exciting and intriguing movie from start to finish.",
            "review_date": "2009-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely good drama. Ngor is amazing.",
            "review_date": "2009-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The war-film genre is yet to be explored by my part, and I'd seen The Year of Living Dangerously (A similarly-commenced film) no less than a week prior, so the first hour of this movie was goddamn boring and deja vu. When its traits became discernable, The Killing Fields launched into a Hollywood category and not a half hour goes by without manipulative music. The characters are full fleshed, the war-victim violence is plenty real and spontaneous, and the message is typical, but who doesn't like John Lennon and his posthumous lectures.",
            "review_date": "2009-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set durring the Cambodian genocide of 1975-1979",
            "review_date": "2009-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent account of the fall of Cambodia into madness and bloodshed. Ngor delivers a wonderful performance as our eyes and ears throught the last, devastating act...",
            "review_date": "2009-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that portrays a tragic story and is great. Haing S. Ngor gives a great performance and all the tribulations that his character goes through is sad, yet triumphant at the end",
            "review_date": "2009-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well acted, Haing S. Ngor is outstanding, Sam Waterston and John Malkovich also excel. Very believably presented, the cinematography is very effective, as is the score. Powerfully written and directed, heart wrenching at times and riveting throughout. The editing is very skillfully done and adds a great deal to the pacing and effectiveness of the film. Quite unforgettable. Some may find it disturbing because of it's brutally realistic approach.",
            "review_date": "2009-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the most profound film about friendship that I've ever seen. A harrowing and ultimately redemptive story ... and the friends' reunion at film's end had me crying nonstop ...",
            "review_date": "2009-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Killing Fields is one of the best films of all time, it grabs you and doesn't let you go. The fact that this film is about real events and real people makes it all the more powerful. Haing S. Ngor is amazing and his performance is all the more impressive when you learn that he actually experienced the events in the film. Exciting, dramatic, horrific and heartbreaking. The Killing Fields is a film that must be watched.",
            "review_date": "2009-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tragic and thoughtful. Fantastic film",
            "review_date": "2009-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Law & Order's own Sam Waterston beats out Dustin Hoffman and a miriad of other A-listers for the lead to deliver a pitch perfect performance in a gut wrenching film surrounding the genocide in Combodia following the Vietnam War. Watch this film just to see the Oscar winning performance by the Cambodian journalist who surrives the killing fields. Based on a true story, please watch this movie!",
            "review_date": "2009-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good flick and very educational if you are unaware of the issues here. it is presented well and has very few flaws..it is maybe a little long by todays film standard but serves a good point.",
            "review_date": "2009-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*Should-Be 1984 Best Picture: I don't know why I am so cold toward Amadeus. It's a great film. But for my money The Killing Fields is one of the most powerful films in my memory.",
            "review_date": "2009-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A review of a truth.",
            "review_date": "2009-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really moving and powerful. Plus Sam Waterston, really hot for an old guy.",
            "review_date": "2009-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "harrowing and wonderful",
            "review_date": "2009-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As well regarded as this is, I'm surprised to find myself indifferent to it. It feels like the second half of an amazing movie, but the film as it is never really sets up the relationship between Syd and Pran, leaving the movie with an emotional hole. By the time Malkovich (who steals the film) accuses Syd of using Pran, it doesn't seem too far from the truth. The \"friendship\" never really seems there, and it hurts the film. It's very well made, and some of the Cambodian scenes are devastating, but it never really succeeds the way it should.",
            "review_date": "2009-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving movie and story about such a horrible event.  More people should watch this movie because I don't think enough people have an understanding of how pervasive genocide is amongst the human race.  This genocide was on a similar scale to the Holocaust, but how often do you see any memorials, museums or rememberances of it.  Genocide is a HUMAN problem, devoid of race, religion or creed.  It can happen anywhere.",
            "review_date": "2009-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This unsatisfying examination of the Cambodian genocide is actually more of a story about an American journalist and his relationship with a Cambodian journalist. The complexities of journalistic ethics are not developed nor explored deeply enough and the story of horror that serves as the backdrop suffers as a result.",
            "review_date": "2009-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more than just a war film; the story of the rise of the Khmer Rouge and the dictatorship of Pol Pot in Cambodia is excellently and frighteningly portrayed here, viewed from a decidedly personal level throughout. Whilst New York Times journalist Syd Schanberg's part of the story is interesting in itself (his relationship with the occupying US forces and their eventual withdrawl from Phnom Penh), it is the tale of his Cambodian assistant photo-journalist, Dith Pran that rightly takes centre stage. Pran is forced to fend for himself and fight to survive within the totalitarian systematic slaughter which the Khmer Rouge inflicted upon their own citizens. Dr. Haing S. Ngor certainly deserved his Oscar for his moving and dramatic acting, and given the fact he was untrained makes it all the more remarkable. The secondary cast are also fully-fleshed out, with John Malkovich and Bill Paterson playing memorable minor roles.",
            "review_date": "2009-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully filmed......a very moving cinematic experience. Highly recommended.",
            "review_date": "2009-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If this, Law and Order, and that Robot Insurance sketch from SNL were all that Sam Waterston ever did, he would still have had an amazing career.",
            "review_date": "2009-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A realistic movie about the horrors of life in Cambodia and the confusing business of politics.  It's sad that the actor who portrayed the Cambodian man (Haing S. Ngor) who assisted the American reporter suffered such a cruel fate in his own life after so beautifully telling the story of the struggles of Cambodians in this movie.",
            "review_date": "2009-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The wind whispers of fear and hate. The war has killed love. And those that confess to the Angka are punished, and no one dare ask where they go. Here, only the silent survive\"\r\n\r\n5/10\r\n\r\nThe Killing Fields is a movie split right down the middle.  The first half is attrociously bad but the second half is good and literally saves the film.\r\n\r\nThe first half of the film is undone by bafflingly out-of-place and over-the-top music.  Most of the acting is average or sub-par and the plot doesn't flow very smoothly.  The second half is the film's saving grace and tells the story of Dith Pran's life under the treachery of the Khmer Rouge.  There are some powerful scenes as with most films focusing on genocides but the rest of the film is not strong enough to match up to those scenes.\r\n\r\nThe Killing Fields is worth watching for the second half but it is horribly dated and incoherent.",
            "review_date": "2009-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic film worthy of the 3 Academy awards it received.  The message of this film is very clearly conveyed by the director.  Haing Ngor was the standout actor of this film, showing painfully how less than nothing people (\"the masses\") become under totalitarian government (where is he now?).  It has a quality of real life to it even in things that are insignificant to the main plot, which are the 1 per cent'ers that make a film great and more believable.  The only distraction was the film being in two parts.  The first quarter of the film really was only a satellite story to the remainder, which was what we wanted to see, detailing the Khmer Rouge take over and the eventual invasion of Cambodia by Vietnam in 1978.",
            "review_date": "2009-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a brilliant movie set in cambodia during the rule of polpot",
            "review_date": "2009-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be my first movie which made me cry when I was young.",
            "review_date": "2009-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only movie I gave 5 stars. This show how the vietnam war effected other countrys. And how America play their hand in the killing of 2 million innocent people In a country that didn't do anything to them. I've talked to people who went those the same thing as the characters in this movie (my mum and her siblings) and they said this was the closest thing to what they actullay went through. 5 stars easlily the BEST movie made. Ever",
            "review_date": "2009-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the Pianist was a movie about one man's survival against the odds. But this movie supercedes it. Dr Ngor deserved that oscar. For a non-professional actor to display such a character is simply amazing!!!!!",
            "review_date": "2009-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "heart wrenching, sweaty palms, horrifying, desperate  - incredibly powerful film.",
            "review_date": "2009-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful story of the atrocities and unlikely bonds that emerge from war.",
            "review_date": "2009-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haing S. Ngor is genius in this flick.",
            "review_date": "2009-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Roland Joffe's vietnam feature is sadly long forgotten amongst most reviewers. Not even 20,000 people have given it a rating on IMDB, and it's hard to see why. The director expertly spins us a new tale in the fiery war, where we see the reporters outlooks and experiences in a very dangerous war zone. Split in two parts, The Killing Fields looks at the bond and promises people make, and the pure compassion here is outstanding which is completely down to Waterston's and Ngor's vivid and believable performances. Joffe's realism is what makes this film so vivid, but the short running time restrains this epic from being perfect.The title 'The Killing Fields' relates to a number of sites in Cambodia where masses of people were murdered purely because they refused to be changed by the totalitarian communist khmer rouge regime and be 're-educated'. It looks very closely at 'year Zero' a time where cambodian history was to be erased and a new order took over to supposedly rewrite the mistakes their ancestors made. Part one of the feature observes the build up and danger that surrounds journalism in a war zone. Syndney Schanberg willfully presents his guide Dith Pang with an ultimatum. As the american troops have left the area, communism spreads and as everyone is evacuated he asks Pang if he would stay on with him. What ensues is a nerve-shredding suspense filled drama, with the two fleeing to a french embassy, but as Pang doesn't have a passport to stay on the ground, he is forced to leave and stay at a re-education camp, while Schanberg goes back to America to dwell on his mistakes. The second half deals with these horrific camps themselves, but Joffe never presents us enough detail to really shock us and show the full extent of such an awful war!Based on a fascinating true story, The Killing Fields capitalises on believability and truth with some very vivid characters. Sydney Schanberg is a great example of a journalist. But his compassion for his story would be nothing without guide/reporter friend Dith. Joffe's characters are lifelike, they are truthful and they stick firmly in a documentary style fashion which adds to the films respect and portrayl of Vietnam life. The film won the best supporting actor award for Haing Ngor's role as the struggling surivior of the Cambodian camps, as he tries to escape. It's a brave honest film that doesn't shy away from the state the american troops left the country in after they left.It is hard to believe that Joffe is the same director responsible for that wreck of a horror film 'Captivity'. His debut direction here is smart and broad allowing all the details to soak through. Building and depicting the towns, camps and life of these mainly peaceful people, and then shattering it all, with bleak desolate re-education camps, as well as showing the desperation and peril these people were in. He uses brief shocking violence at times to show how the relationship between life and death is much different in such a horrible war. Exceptional, though it is his fault the film is too short.The Killing Fields, loses the hollywood, big budget style that glossed over the cracks in films like Apocalypse Now, and The Deer Hunter. It is less theatrical and more realistic. It is a simple tale and look at Vietnam but Joffe manages to pull enough off, keeping some of the more mundane and less entertaining elements relevant and interesting. This combination of fact and fiction results in a diverse thoroughly harrowing account of a despicable time in history that shows a good unbiased balance of war. Ok the John Lennon 'Imagine' soundtrack at the end does grate with some people, but I felt it was a fitting way to end one of the most compassionate films ever made. Full of raw emotions The Killing Fields soundtrack emobodies the right sounds to facilitate the Vietnam feature, and it works for the most part.The Killing Fields [i]is [/i]far from perfect, but despite its flaws in length and in missed opportunities to be epic it remains a gut-wrenching oscar worthy drama that shows the war from completely different perspectives. Though it will never be everyones favourite war film, it may well be mine.\r\nFinal Score: 83/100",
            "review_date": "2009-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although this is a story that more people need to know about I found the plot tough to follow if you were unfamiliar with the history behind this film",
            "review_date": "2009-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tragedy of Cambodia (Kampuchea) after the repressive rule of authoritarian general Lol Nol ended and the insanity of Pol pot's extremist Maoist dictatorship started. Ranks up there with SALVADOR and THE YEAR OF LIVING DANGEROUSLY in the realm of real-life horror stories.",
            "review_date": "2009-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real life story from the war ravagged Cambodia.",
            "review_date": "2009-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "has the E.T factor in that you want to kill yourself about an hour in, but also like E.T because its damn good",
            "review_date": "2009-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jarringly edited, and looks like it was shot on videotape, but a good primer on recent Cambodian history.",
            "review_date": "2009-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can easily die, if you're smart enough!!",
            "review_date": "2009-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is terrific!",
            "review_date": "2009-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie bored me to tears.  Very rarely did anything interesting ever happen.  I was expecting to be shocked by this movie, but wasn't.  I should have gone with my instincts and avoided it like I did when it originally came out.",
            "review_date": "2009-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dr. Haing S Ngor dominates this movie. Apparently he had never acted before. It tells the true story of Dith Pran, played by Cambodian survivor Haing S. Ngor, and his journey to escape the Khmer Rouge death camps which is an awful moment in human history. A movie that it is not easy to watch. Brutal and honest , the scene at the French embassy was the hardest to bear. My only gripe was that during certain scenes, the translation was poor some subtitles would have been much appreciated",
            "review_date": "2009-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow umn what a sad movie 2 watch..i have just seen this movie 4 the 1st time n think that this is a good movie 2 watch its got a good cast of actors/actressess throghout this movie,...i think that john malkovich, craig t nelson play good parts throughout this movie...i think that the director of this   Drama, Art House & International movie had done a good job of directing this movie because you never know what 2 expect throughout this movie its a really sad movie but its brilliant 2 watch",
            "review_date": "2009-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dr. Haing S Ngor dominates this movie. Apparently he had never acted before. It tells the true story of Dith Pran, played by Cambodian survivor Haing S. Ngor, and his journey to escape the Khmer Rouge death camps which is an awful moment in human history. A movie that it is not easy to watch. Brutal and honest , the scene at the French embassy was the hardest to bear. My only gripe was that during certain scenes, the translation was poor some subtitles would have been much appreciated",
            "review_date": "2009-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those epic movies that is known more for what it shows than how it shows it. Still, it's an incredible story and, at moments, quite powerful.",
            "review_date": "2009-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "still a very good period piece SE Asian/Cambodia in the mid 70s: US bombings, year zero, the forced agrarian reform by Pol Pot and the Khmer Rouge, cival war..film touches on many episodes.  Forgot that Sam Waterston was young once...still a very good flick.",
            "review_date": "2009-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good book, turned into a good movie. Solid performances and direction, and a soundtrack I love. It's a movie set during a war, but not about war (not directly). It's about a friendship that transcends war.",
            "review_date": "2009-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect film story of a tragic era.",
            "review_date": "2009-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little bit slow at the beginning, I thought it is a war movie~~ well, it is about war, but it tells the way in a different way. Very powerful movie, really make you think about and wish that there will be world-peace, as long as possible. Don't miss this one if you like profound movies.",
            "review_date": "2009-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the Khmer Rouge tribunals having started, this movie is an inside look at what many Cambodians went through under the Pol Pot's tyrannical power. The biggest misconception about this movie is that it's a war movie or that it's about an American journalist in Cambodia. No, it is a story about Dith Pran and how he survived while others around him died. Haing S. Ngor survived the Cambodian genocide only to be gunned down years later. His performance as Pran mirrors his own. Ngor does a lot of good acting, considering he was never an actor, but a doctor. I liked that this movie switches gears halfway and tells about Pran's struggles as he tries to escape Cambodia. It's horrible enough that Cambodians massacred Cambodians just for the fact they were too \"westernized,\" but worse that anybody could do this to another person. If violence makes you uncomfortable, don't see this. But what director Roland Joffe does is not show us some violence. We hear gunshots off screen. Maybe that's worse, because we see other people's reactions. Granted the whole scene at the end where Pran and Shneeberg are reunited at a Red Cross camp while John Lennon's \"Imagine\" is playing on the soundtrack is cheesy and the last line, \"There's nothing to forgive\" seems to be add for dramatic purpose. But the rest of the movie and the great acting by John Malkovich, Julian Sands and Sam Waterston makes it worth that little mulligan. This is one of the best movies of the 1980's if not one of the most important movies ever made.",
            "review_date": "2009-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On my Top Five Movies List of all time.  There is such humanity in this movie, love, suffering, tension, honor.  It moved me deeply.  It shows mankind at its best & worst.  Waterston, Ngor and Malkovich were magnificent!",
            "review_date": "2009-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story about a tragic incident in our history.  Realistic and full of impact.",
            "review_date": "2009-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "strong stuff here.  shows the brutality of a new regime and just how depraved, soulless, and brainwashed humans can get.",
            "review_date": "2009-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent film, shows the horror of ethnic cleansing and another example of how low the human race can sink",
            "review_date": "2009-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half, great. Second half, great. Overall, not great. What happened there then?",
            "review_date": "2009-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got to see this one and it's no doubt a powerful film.  Very scary and very touching.  Mostly the story of friendship between two men, one American (who escapes Cambodia) and one Cambodian (who has to somehow survive the twisted world of Pol Pot's utopian paradise in order to escape).  Must see.  A holocaust that should never be forgotten.  But it has a \"happy\" ending, so I maintain it is not as depressing as I feared.",
            "review_date": "2009-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant thought provoking film around the genocide in Cambodia.  A well written script is complimented with some excellent all-round performances.",
            "review_date": "2009-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watched only half of it... not very good",
            "review_date": "2009-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great Viet Nam flick.  This is a true story of a photo journalist and his escape from Cambodia.  A must see!",
            "review_date": "2009-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful movie.  Don't watch this unless you are ready for a serious downer.  You will never hear the song \"Imagine\" the same way again.",
            "review_date": "2009-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DISTURBING!yeah you watch that movie like you see in front of your eyes this reality, like a documentary filmed too close to those painful events...the childs crying, the human being everywhere dismantled...foreign people trying to help...useless...watching what the civilians went through...i couldn't help but be really frustrated, even more at the end when my heart did tremble, yes. a movie that doesn't age and should be watch, an historic one by the Master Joffe and to be watch to never forget...i guess that's the point: should never those wars and massacres be forgotten!:(",
            "review_date": "2009-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly memorable piece of film-making on one of the most horrific events in human history. I would have liked to have had an idea on what sort of lives the Khmer Rouge and the towns under their control had led before the West bailed out of Cambodia and a little more back-story rather than just \"the war on Vietnam spilled over\" but to me these points are the only time the movie fails to deliver. The scene in the bathroom that follows Schanberg's accepting the journalism award which hints that perhaps he used the plight of Dith Pran to aid his career was much needed and very brave to put in, it confirmed this movie as more than just about one Western journalist or his plight/ego. A fantastic movie that does justice to the subject.",
            "review_date": "2009-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great! This movie made me afraid of ever going to Cambodia. Now that I am older, I'd love to go there. i would love to somehow give back to my community. While I can never understand the hardships of my grandparents, I learned that I must work word to be where I want to be. The taking of innocent lives is unforgivable.",
            "review_date": "2008-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very moving true story. think it couldn't happen to you? think again.",
            "review_date": "2008-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering when it was made, I can't really fault it's cinematography but it does enough to showcase the suffering and pain Cambodians went through...I wasn't sure if Ngor deserved his Oscar till the 2nd half of the film - he nailed it...You better skip lunch for this film..It's that gory in some parts...",
            "review_date": "2008-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, but relevent as it shows what happens when we pull out of a conflict based on public pressure and the anti war fags, millions get slaughtered",
            "review_date": "2008-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'hotel rwanda' meets 'deer hunter'. well, this came first, so maybe hotel rwanda is 'killing fields' meets 'deer hunter'. ahh, the good old argument over which genocide came first. and there are plenty to choose from! movies like this, when they serve to educate through a medium that is so pervasive, are essential. loved the discordant songs that threw you off balance. abrupt, but great ending.",
            "review_date": "2008-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the very first movie I saw as a tot... this really made me cry..no I friggin' wept. It was made in the year of my birth and the introduction to this movie was what started my love affair with history the different worldly philosophies. I haven't even started kindergarten and I was already asking questions about the Khmer Rouge and why the world I've been born into and initially made to believe was good could have so much hate in it. The doctor who won an academy award for this movie was assassinated a year after. I still keep the Reader's Digest copy of his story with me.",
            "review_date": "2008-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i remember reading \"The Killing Fields\" in 10th grade and finding it incredibly powerful.  the film version does a more than adequate job- even though it seems to speed through the last half.",
            "review_date": "2008-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly moving film. It comes off with such a brutal sense of reality that it feels almost like watching a documentary. \n\nCrazy early 80s soundtrack too.",
            "review_date": "2008-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most touching films that I've seen. I recomend this movie to everyone, especially to those who aren't aware of all the deaths caused by communism, and to those who denies it. It is sad that so few are aware of the events that this movie tells us about.",
            "review_date": "2008-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An astonishing film. Some of the most powerful images I've ever seen filmed. It's amazing that humans allow other humans to do these kinds of things to each other. I agree with another viewer: A film everyone should see.",
            "review_date": "2008-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can be considered as a classic masterpiece, if people have the stomach to watch the brutality the film offers to the viewers. Stunning acting and storytelling create a haunting experience about the life in an autocratic world. Horrible music, in fact, music in a movie like this actually ruin the realism of the film. i can't question if this film is a little too far fetch with its brutality or not because I have never experience the kind of horror like they do. However, i can't ignore the fact that human brutality like the ones shown in the movie do happen in place similar to the one in the movie. All and all, it is a great movie and I enjoyed it very much. Even though it is not for the faint of heart.",
            "review_date": "2008-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review will be written when/if re-watched (Probability: Low).\n\nFirst viewing: 13.04.2003",
            "review_date": "2008-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching and powerful with the most intelligent use of a song (Imagine by John Lennon just before the end credits)",
            "review_date": "2008-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is one of my absolute favourites. It is perfect in every way and moves me to tears every time I see it. It is a reminder to us all that even when you think that things cannot get any worse in your life. Just think about all the Dith Prahns around the world and that should make your worries seem trivial.",
            "review_date": "2008-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They have this film-OMG!",
            "review_date": "2008-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing story and film- brilliant performances.  still haunts me after all these years.",
            "review_date": "2008-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving film, Haing S. Ngor is brilliant, the whole movie shocks me but i'm glued to my seat til the end",
            "review_date": "2008-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though the pacing is slow at times, the story is well told has some stalwart performances.",
            "review_date": "2008-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent film, will get you crying",
            "review_date": "2008-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best drama's I have seen. Very compelling, dramatic and all the actors were at their Oscar best in this powerul drama.",
            "review_date": "2008-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing piece of work, stellar performances, sublime score and the horrible face of sheer madness. A must see!",
            "review_date": "2008-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely one of the most moving and beautiful films I have ever seen. I cry every time. It reminds me of how much unspeakable evil is really out their and of how great my life is compared to all the Dith Prahns in the world.",
            "review_date": "2008-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could not stand this movie. The fact that it's three hours long made it that much worse!",
            "review_date": "2008-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very intense, heart-wrenching story of one man's survival and escape from the genocide of the Khmer Rouge in 1970's Cambodia.",
            "review_date": "2008-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film with great depth and performances. Reminds me of \"Midnight Express\" and \"The Shawshank Redemption\" and that is a good thing.",
            "review_date": "2008-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most Brilliant movies ever made. Acting that none could match.",
            "review_date": "2008-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting, with a fine air of intensity.",
            "review_date": "2008-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one hell war flick .. especially for those who would like to study the massacre in Cambodia during Pol Pot dictatorship .. u better watch this one ..",
            "review_date": "2008-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie that I just watched for the first time last night.  I certainly left with better insight into Cambodia during the 1970's and its complexities leading to the rise of the Khmer Rouge and their mass-murdering regime through the personal struggles of Pran and Sydney.",
            "review_date": "2008-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very thought proveken",
            "review_date": "2008-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ankertill Brewer.... Waterston and Ngor final embrace with John Lennon's music in the background, just unforgettable!",
            "review_date": "2008-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a feel good movie, but  powerful none the less.",
            "review_date": "2008-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True story set in Cambodia bout an american journalist and his cambodian translator, mike oldfield sountrack",
            "review_date": "2008-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sam Waterston and Haing S. Ngor are exceptional to watch on screen. I used to enjoy  watching Waterston on Law and Order, but after watching this film I love it now. The only thing that I wasn't really happy about in this film were the musical pieces that included a synthesizer because it completely killed any dramatic scenes it was featured in. Also in one scene where a prisoner is shot right through his glasses, an obvious and incredibly fake blood spatter was added which was kinda weird. Besides that, this is an incredibly good film by Rolland Joffe.",
            "review_date": "2008-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haing S. Ngor simply delivers one of the most heart felt, intense supporting roles I've ever seen. What a lot of people don't now is that he basically lived his characters story in his real life. It's sad how his life ended. This is one of the most underrated movies of the 80's, BRILLIANTLY shot.",
            "review_date": "2008-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought it was brilliant, such brave filmmaking, I also defy anyone not to have a tear in their eye come the finale - I certainly did!",
            "review_date": "2008-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was alright, and got across the message it was trying to spread quite easliy, but the storyline seemed ridiculous. Awful music as well.",
            "review_date": "2008-09-15",
            "source": "rt",
            "lang": "en"
        }
    ]
}