{
    "rating": 9.2,
    "release_date": "1984-09-08",
    "num_reviews": 250,
    "genres": [
        "Comedy",
        "Music"
    ],
    "summary": "\"This Is Spinal Tap\" shines a light on the self-contained universe of a metal band struggling to get back on the charts, including everything from its complicated history of ups and downs, gold albums, name changes and undersold concert dates, along with the full host of requisite groupies, promoters, hangers-on and historians, sessions, release events and those special behind-the-scenes moments that keep it all real.",
    "reviews": [
        {
            "content": "5 Stars for the greatest, most uniquely real gut- punchingly funny parody of the music business ever. \nThe fact that so many huge rock stars love & watch it obsessively, many of them convinced it's written about them is a tribute to it's amazing blend of fiction & real events.\nThe characters, the actors & the writing make Spinal Tap one of greatest comedies ever. A must watch, your life will be better for the experience.",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "A classic. Score: 11/10.",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "This comedy -mocku- rockumentary is one of my all-time faves.  Not only is it brilliantly written (and improvised),  this 1984 release stands the test of time.  And amazingly, as many times  as i've watched this movie, the side- splitting goofery of this great cast NEVER gets old.  Each watch reveals new and slyly subtle  riffs.  Comedy Platinum!",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "It's a classic.  What a surprise it's on YouTube for free ! \nBest metal/rock movie ever. Good for the soul.",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "Fantastic satire of wannabe 70s 80s rock band. Some viewers with, erm, perhaps a short attention span may find it boring.",
            "review_date": "2023-03-04",
            "source": "rt"
        },
        {
            "content": "What a freaking snooze feast, I don't get what people like about this.\n\nThe is def a w people movie, so if you ain't w then you probably wont like it.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "Brilliantly directed hilarious yet meticulous mockumentary. A cult classic.",
            "review_date": "2022-11-30",
            "source": "rt"
        },
        {
            "content": "This movie is so good and iconic that most people assumed they were a real band for over thirty years! Full of great gags, jokes and one-liners and some genuinely good music, it's an extremely clever and immersive film.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "There's some pretty amusing dialogue (one quote I remember being 'you ponce about like a bunch of hairdressers!') the song names are amusing enough and it certainly seemed pretty authentic, like a fly-on-the-wall documentary (or rockumentary, as they say).\n\nIt's maybe a bit like an 'MTV Diary Of' show perhaps, only without the talking heads aspect. It's certainly an 80s film and it obviously has a strong 1980s feel to it - the brand being very much portrayed as an '80s hair band.\n\nIt's kind of ludicrous in an excessive parody kind of a way but its also very much a good bit of silly fun. It looks like everyone enjoyed making the film, from what you can tell and that somehow makes watching it more enjoyable too. I hadn't realised (until I read the credits) that it was co-written by Harry Shearer (who does various Simpsons voices). The 'philosophical 80s rocker' (surely that's a contradiction in terms?) is a new one on me but there you go!. This is, I believe, a cult classic and certainly I thought it was an enjoyable parody film, in the same way as 'Airplane!' is a very good parody, or send up, of disaster films. I would definitely recommend this film, primarily for fans of 80s rock and roll/hair band groups (Bon Jovi, Def Leppard, Van Halen etc.).",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Watch it until you see the humor and then you'll think it's the funniest film ever made.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "Paul Rudd was not in this movie",
            "review_date": "2022-08-02",
            "source": "rt"
        },
        {
            "content": "I'm sorry but this movie really sucks. I don't see what all the fuss is about.",
            "review_date": "2022-07-04",
            "source": "rt"
        },
        {
            "content": "A hilarious mockumentary of a rockumentary.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "I hated this movie, and I'm a musician. I regret buying it, I regret that it's in my movie collection, and I have nothing good to say about it, so I'm going to stop.",
            "review_date": "2022-06-16",
            "source": "rt"
        },
        {
            "content": "Irreverent mock-rockumentary with humor that vacillates between dry and soaking wet.",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Again, I was expecting more. More laughs, more fun. I started watching this movie expecting for the \"amplifier goes up to 11\" joke to be representative of the movie. Well, it is not. It seems washed out, diluted, like you are expecting for something to happen, and when it happens, it barely does.",
            "review_date": "2022-02-20",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap is a consistently hilarious movie. The thoroughly excellent cast bring to life a great script filled to the brim with funny and quotable moments. The movie is then brought to a peak of excellence by the fact that it has just enough to it, from the bands music, to their stagecraft, that one might seriously mistake it for the real thing. And best of all it's a movie that doesn't overstay it's runtime, saying what needs to be said, and making a clean wrap of the plot in a short and sweet 82 minutes. \nSuperb. \n94/100",
            "review_date": "2022-01-21",
            "source": "rt"
        },
        {
            "content": "I don't get the praise for this movie.  There were some good bits, but mostly it just felt dumb and slow.",
            "review_date": "2021-11-28",
            "source": "rt"
        },
        {
            "content": "It never ages. It's the right length & tone. Never overplays. Because it's shot documentary style it just holds up beautifully. The cross the board performances were all perfect down to every bit part.",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "The grandfather of all mockumentaries, Rob Reiner's This is Spinal Tap remains one of the funniest films in the genre, even almost 40 years after its release.  Reiner plays Marty DiBergi, a director of commercials, who decides to make a documentary about Spinal Tap, a rock band well beyond its prime. Christopher Guest, Michael McKean and Harry Shearer all shine as the three front men in the band, seemingly unaware of their declining popularity.  The film is filled with iconic scenes (miniature Stonehenge, the amp that goes to 11, the album signing event, etc…) but succeeds on the strength of the characters and the rapport that exists between them.  Even as their collective careers teeter on the edge of oblivion, they are able to naively hang on to some degree of hope.",
            "review_date": "2021-09-12",
            "source": "rt"
        },
        {
            "content": "This film is for all Druish princesses and named my avatar. What film is your Godparent?\n\n\"Stonehenge! Where the demons dwell\nWhere the banshees live and they do live well\nStonehenge! Where a man's a man\nAnd the children dance to the Pipes of Pan!\"\n\nWhile I was searching for Spinal Tap, I got turned on to my \"Stonehenge\" brothers from Norway, via Ylvis' \"Stonehenge\":\n\n\"What's the deal with Stonehenge?...\nYou should have left a tiny hint\nWhen you made this f'ing labyrinth of stone...\nWho the f#$k builds a Stonehenge?\"\n\nWhen coming up with an appropriate avatar it is important to see if there is comedic cultural understanding all the way in Norway where the little people towered over poorly artistically rendered PI...",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "There is nothing I can say about this movie that can add or distract from it. It is a force of nature and in my opinion, the most perfect of movies. I've debated adding it to the site numerous times, but my worry was that it's so ingrained in my heart that there was no way I could do it justice. So instead, let me share my favorite scene from the movie and explain why it means so much to me and then you can just watch the damn thing yourself.\n\nAs limo driver Tommy Pischedda (Bruno Kirby) drives Spinal Tap through New York City and all seems bright and the future wide open, he makes the faux pas of thinking that he can directly interact with rock gods. He looks in the back of his car and addresses one of their female admirers: \"Excuse me… are you reading \"Yes I Can\"?\"\n\nTommy may not understand this heavy metal, but he does know the Rat Pack. That's the kind of celebrity culture that he understands. People that deserve to be there. People that have given blood and sweat and sacrificed. But maybe, just maybe, these longhaired kids are trying.\n\n\"You know what the title of that book should be? \"Yes, I Can If Frank Sinatra Says It's OK,\"\" shares Tommy. \"‘Cause Frank calls the shots for all of those guys. Did you get to the part yet where uh…Sammy is coming out of the Copa…it's about 3 o'clock in the morning and, uh, he sees Frank? Frank's walking down Broadway by himself…\"\n\nAt this point, Nigel Tufnel, the guitarist of the band, rolls up the window that separates the celebrity from the hired help. It's a bracing and truth-packed moment, as the look on Tommy's face shows that he should have never opened himself to such scorn.\n\nRockumentarian and Tap fan Marti DiBergi tries to deal with the chill in the air, offering, \"Well, you know, they're not, uh, used to that world. You know, Frank Sinatra, it's a different world that they're in.\"\n\nThe sheer exhaustion in Tommy's speech that follows, as well as his know-it-all feeling on the world of celebrity follows. \"You know, it's just that people like this…you know…they get all they want so they really don't understand, you know…about a life-like Frank's. I mean, when you've loved and lost the way Frank has, then you, uh, you know what life's about.\"\n\nBut what sums it all up is when he says, \"F****' limeys.\"\n\nLook, Spinal Tap is the only movie that the IMDB allows you to rate an eleven. If I have to tell you anything else, you just won't understand either.",
            "review_date": "2021-06-03",
            "source": "rt"
        },
        {
            "content": "A must for every musician",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "It's impossible not to love this movie.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "A great fake documentary(aka mokumentary) about a fictional heavy metal band spinal tap",
            "review_date": "2021-03-10",
            "source": "rt"
        },
        {
            "content": "Continuing through the Guest and company mockumentary series this was probably my least favorite next to Best in Show and A Mighty Wind. Still clever and funny but probably also suffers due to high expectations after almost 40 years of hype.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "Some people call this their favorite comedy of all time. That raised my expectations and even though I laugh and enjoyed it, found it clever and funny it falls short for me. At moments the joke felt repetitive for me.",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "This has been my favorite comedy since I was 12 in 1987. An absolute MASTERPIECE of comedy and improvisation and even better (or worse) if you are a musician. Be sure to watch a version that contains all of the bonus materials including an hour of deleted scenes. This gem is ageless and timeless.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "Turn it up to 11!! Classic! Funny movie!",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Of course, it would be wrong to suggest this sort of mayhem began with rock-n-roll. After all, there were riots at the premiere of Mozart's \"The Magic Flute.\" So, what's the answer? Ban all music? In this reviewer's opinion, the answer, sadly, is 'yes.'",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "I love the humour and the songs are hilariously great",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "Well, quite a disappointing experience this was. I just don't understand how Rotten Tomatoes works I guess. With + 90 % scores from both critics and audience I had expected something really good, not this shit.",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "This is by far one of the best comedies, mockumentary and should be rated 11/11!",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "One of the best \"rock\" movies still.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "A comprehensive spoof of rock n roll lifestyles.\n\nRob Reiner tears apart Led Zeppelin, Black Sabbath, AC/DC, Iron Maiden, Judas Priest, The Beatles, The Rolling Stones, Genesisand every popular hard rock and heavy metal band of the 1970's and 1980's with his hilarious and influential mockumentary This Is Spinal Tap (1984). Reiner crafted one of the finest musical comedies ever gifted to humanity thanks to the supporting efforts of Christopher Guest, Michael McKean, and Harry Shearer alongside Rob Reiner's mad leadership.\n\nReiner's direction was already on point with riveting, intimate direction, improvised dialogue, and a peerless sense of humor in his fascinatingly delightful directorial debut. It's astonishing that Reiner had such a sharp sense of humor and directorial vision for his debut. This Is Spinal Tap mocks pretentious bands, sexist artists, gaudy outfits, and documentaries that would depict their subject bands as flawless saints and visionary artists without any issues. Peter Smokler's cinematography is obviously pretty with natural lighting during the interviews and colorful stage lighting, but his wide shots of the band are all funny. I think his handheld or still documentary camerawork is timeless and works to aid every absurd joke herein This Is Spinal Tap.\n\nReiner's apt writing makes biting satire and short work of foolish rock bands too big for their own good as his strikingly personal direction ensures This Is Spinal Tap to play on forever like Spinal Tap's experimental \"Jazz Odyssey.\" Every line is hilarious whether written or improvised by Rob Reiner, Christopher Guest, Michael McKean, Harry Shearer, or any number of other oddball actors present within this unholy tome of rock legacy.\n\nFurthermore, Rob Reiner himself is funny as the deadpan serious documentarian Marty Di Bergi, who probably fancies himself the Werner Herzog of documentaries without realizing that Werner Herzog is the Werner Herzog of documentaries. I must mention that Christopher Guest is phenomenal as Nigel Tufnel, the idiotic lead guitarist of Spinal Tap. His electric playing, unforgettable stupid one liners, and subtle eyes portray loneliness, longing, or disgust more than Nigel's words surely ever could.\n\nMichael McKean is fantastic as Spinal Tap's frontman David St. Hubbins. His vain foolishness is very funny, especially with how endearing he plays the moron fronting Tap. His playing is so interesting and tight too. McKean has excellently sweet chemistry with the lovely blonde June Chadwick as David St. Hubbins' loving girlfriend Jeanine Pettibone with ambitions to management. She's gorgeous as she contemptibly glares as Nigel or adoringly gazes at David St. Hubbins. Harry Shearer is funny as the lackadaisical bassist Derek Smalls. Tony Hendra is great as the uptight manager Ian Faith making excuses for every mistake along the way.\n\nBruno Kirby cameos as a Frank Sinatra loving limo driver, complaining about the band and who disgruntledly states Spinal Tap is just a fad. Fran Drescher cameos as the adorable publicist Bobbi Flekman concerned about Spinal Tap's sexist cover and lyrics with her instantly recognizable nasal New Yorker accent. Dana Carvey and Billy Crystal cameo as funny mime waiters. Paul Shaffer cameos as an incompetent promoter called Artie Fufkin. Anjelica Huston cameos as the misinformed Stonehedge artist Polly Deutsch. Lastly, Fred Willard cameos as the too sarcastic Air Force Lt. Bob Hookstratten. This Is Spinal Tap's supporting cast is insane.\n\nSpinal Tap may be a joke of a heavy metal band, but the soundtrack to This Is Spinal Tap is actually very technical and pleasant classic metal. With energetic songs like \"Tonight I'm Gonna Rock You Tonight\" or \"Sex Farm\" showcase playful songwriting and nice vocals. Whereas, epic songs like \"Rock and Roll Creation\" and \"Stonehedge\" display the band's strong musicianship and progressive attitude to just play whatever. Christopher Guest, Michael McKean, Harry Shearer, and Rob Reiner made a realistic heavy metal band's album for this comedy movie and I appreciate their dedication to the joke.\n\nRobert Leighton, Kent Beyda, and Kim Secrist's editing is so fast and natural, you feel like you're with the band on tour throughout America and Japan at all times. Their cuts keep you close to each character and make This Is Spinal Tap's brief 82 minute run-time a quick blast through rock history. All the costumes and make-up are as outrageous as every rock and roll or heavy metal band's outfits through the 70's and 80's for added realism.\n\nIn conclusion, This Is Spinal Tap is less Anvil: The Story of Anvil in its earnesty, but rather full on Wayne's World or Tenacious D with the spirit of true documentary realism to showcase a plethora of comedic talent. Rob Reiner in his prime was unstoppable!",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "If Nirvana liked it, then Spinal Tap is good enough for me.\n\nKurt Cobain explained why Nirvana turned down a chance to be a part of \"Singles.\" Cobain said: \"There's never really been a good documentary on rock and roll bands.\" Dave Grohl cuts in to say, \"Except for Spinal Tap, [that] was the only rock movie worth watching,\" which Cobain agreed with, as well as mentioning \"Don't Look Back\" by D.A. Pennebaker.\"\n\nAnd I would add The Rutles: All You Need is Cash.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Probably the most iconic mockumentary of all time and for good reason. Spinal Tap is uneven and may wander aimlessly a bit at times, but it's peaks are comedic gold. A near perfect reflection of the scene and endlessly quotable.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "A classic film, often copied never topped.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "Mildly funny at times but boring the rest of the time. The satire of the degradation of rock and roll culture is clever but not hit home enough to be important.",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "Exceptionally balanced blend of humor, from surface throwaway jokes to long, slow burns, that will appeal to fans of classic rock as well as your average moviegoer. The end credits are an absolutely hysterically timed conclusion to the film given the \"plot\" development in the film's last half hour or so, in which the jokes are less frequent or obvious. Among the greatest mockumentaries ever made. (4.5/5)",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "I heard that this was hilarious back in the early 1980s, but I just wasn't feeling it. SPINAL TAP is a comical mockumentary about the lifestyle of obscene rock stars. The film was made well enough to make everyone believe they were a real band; nonetheless, in my eyes, the pragmatic conflicts reflect nothing more than an R-rated Saturday Night Live episode.",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "Some very funny scenes for an old film.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "This honestly felt more of a documentary than it did of a movie, I didn't really enjoy it and it's not my cup of tea, sorry.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "It's Spinal Tap. Are you an asshole? Of course its good. If you don't understand the nuanced comedy then you are un-read, un-cultured, and likely subject to trick jokes.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "Funny fake rockumentary! One of the best in genre.",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "All of Christopher Guest's mockumentary follow-ups are chasing this film...and it's not even close.",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "When it comes to the glorious stupidity of rock music, whip-smart mockumentary gold standard \"This Is Spinal Tap\" has zero peers. Sidesplitting on an epic scale, this satire is also a shortlist candidate for Greatest Comedy Ever, and can claim parentage of every self-aware music film made since, from the wildly inventive \"24 Hour Party People (2002),\" to recent Tap-evocative record label satire \"Stadium Anthems (2019).\"\n\n\"Tap\" now transcends its early filmic and rock confines: Nigel Tufnel, David St. Hubbins, and Derek Smalls have burrowed deep into the cultural zeitgeist, holding sway in the very words we choose in conversation at the water cooler and at the pub (see: \"goes to eleven\"). And its commentary on the fleeting absurdities of fame have never been more eviscerating.\n\nNearing forty years old and still swallowing everything in its path, \"This Is Spinal Tap\" is as enduring as it is the hilarious, and that's quite a feat. This is one of the most joyously experienced entertainment vehicles ever assembled. - (Was this review of use to you? If so, let me know by clicking \"Helpful.\" Cheers!) - WATCHED IT? THEN WATCHLIST: \"Being John Malkovich (1999),\" \"Stadium Anthems (2018),\" \"24 Hour Party People (2002).\"",
            "review_date": "2020-02-05",
            "source": "rt"
        },
        {
            "content": "hilarious and a great watch. spinal tap has a unique sense of humour that pulls through with pretty much every scene.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "great movie from my childhood",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "This movie doesn't have the plot cast and especially not the laughs. ",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "A classic, scathing lampoon of every successful rock band that's ever been guilty of taking themselves too seriously. Rob Reiner directs (and plays an important supporting role) but it seems like all he really needed to do was point a camera in the right direction, then edit several hours' worth of golden improvisational delight into a concise, intelligible ninety-minute package. It's a roaring parade of nonstop laughs, some blunt and easy, others sharp and witty. Famous bits like Christopher Guest's \"this one goes to eleven\" have been played to death but still elicit smiles, while deeper cuts, such as the band's reaction to contemporary critics or their infamous Stonehenge performance, land as if they were brand new. And the music is great, too, not just as a cutting satire, but as a convincing love letter to the days when power rock was all the rage and flocks of buzzed, well-feathered teens would still pack a stadium to hear the loudest noise on the planet. An enduring masterpiece.",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "\"This is Spinal Tap\" is definitely not a poop sandwich. Turn it up to 11 and press play. The movie only gets better each time it's watched.",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "So real its scarey.In fact if you did a documentary on some old british heavy metal band it really wouldn't much different this movie.",
            "review_date": "2019-08-01",
            "source": "rt"
        },
        {
            "content": "Big Bottom is the greatest rock song in history.",
            "review_date": "2019-07-12",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap is a 1984 Mock-rockumentary directed by Rob Reiner. The film stars Christopher Guest as Nigel Tufnel, Michael McKean as David St. Hubbins and Harry Shearer as Derek Smalls.\n\nThe story follows a director Marty DiBergi who wants to make a Rockumentary on a rock band (Spinal Tap) who are going on tour in the USA. The premise I personally loved, and I thought that it was pulled off extremely well.\n\nThe acting was very strong especially the three main members of Spinal Tap (Nigel, David and Derek), I felt that they fit the characters perfectly and all gave a great performance.\n\nThe characters in my opinion were also portrayed really well, and were extremely entertaining to watch on screen. The characters also had good chemistry and bounced off of each other really well, especially Spinal Tap and their manager Ian Faith.\n\nThe film also had some really strong editing and cinematography, to make it feel like a real documentary.  \n\nThe sets and costumes in my opinion were also done really well, especially whenever Spinal Tap would be on stage.\n\nPersonally I don't care very much for rock music, but luckily in this film its done in a mocking but still loving way.\n\nThe comedy in my opinion is hands down the strongest aspect of the film, especially from how it mocks the musicians and music of the rocking world.\n\nThe film I also found to be really enjoyable, and I hope to watch it again soon.\n\nOver all I give it a \n9/10",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "Hilarious rockumentary/mockumentary. It smartly skewers the Heavy Metal scene, without mocking it in mean-spirited fashion. Soo many quotable lines. This one goes to 11.",
            "review_date": "2019-06-22",
            "source": "rt"
        },
        {
            "content": "If you watch it tonight, it will rock you tonight.",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "This movie is fucking brilliant. The way Rob Reiner was able to make it seem candid like an actual documentary while making it hilarious is genius. There's a lot of what seems like genuine reactions to scenes in the movie that make it that much funnier. \n\nThe whole backstage sandwich and food scene was hilarious. The whole hand held carmen feel to it makes it that much more believable that it is indeed a documentary. The song they play are actually good. You get the feeling that a lot of the interactions and scenes in this movie are improvised which makes for the best comedy if it's done right. And they definitely do it right here. \n\nDamn, that black TSA girl was foxy. The whole Stonehenge bit was so funny. \n\nThe acting was so good and they played there roles brilliantly. Plenty of dead pan and dry humor. I loved it.",
            "review_date": "2019-05-02",
            "source": "rt"
        },
        {
            "content": "Easily the most dull, boring, unfunny comedy to every be released. Go watch Norbit instead, you can thank me later.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "Every scene and every line is obnoxiously stupid, over the top, and endlessly repeatable. The music, though obviously a parody of the British glam metal scene of the 80's, expertly making fun of the greats such as Def Leppard while still paying tribute to the influence of the band.",
            "review_date": "2019-01-22",
            "source": "rt"
        },
        {
            "content": "Not quite as funny as I had hoped but there were definitely some laugh out loud moments.",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap is a 1984 American mockumentary directed and co-written by Rob Reiner.\nThis was funny satire features some classic scenes and quotes, and has now achieved a classic cult status. I really enjoyed its style, which reminded me of many The Beatles documentaries that I have seen over the years. \n1001",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "Classic comedy must see for everyone.",
            "review_date": "2018-09-30",
            "source": "rt"
        },
        {
            "content": "I don't see how this movie has a very high score on rotten tomatoes. I don't believe it, I watched this movie and it's just a band movie that I've already seen before. Maybe it's because when this movie came out this was the first of its kind, the band movie. But in my opinion, this movie is overrated.",
            "review_date": "2018-09-23",
            "source": "rt"
        },
        {
            "content": "This is a very well acted movie with an absolutely hilarious script. There's nothing wrong  with this movie being sexy when it totally goes up to 11. One of the funniest movies ever made.",
            "review_date": "2018-08-20",
            "source": "rt"
        },
        {
            "content": "Great, but unfortunately, not timeless",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "I saw this upon its release in an art house as  mainstream cinemas did not screen it in the U.K. l know taste is a personal thing but it's hard to fathom why some people do not find this funny. To me it's one of the funniest films ever made. And it has done something for rock music which does not apply to any other musical genre: highlighted its absurdity. Some like Ozzy have learned to exploit it but many others still peddle the same old rubbish about death and despair while sneaking home to listen to Sinatra and play golf. I long ago came to the conclusion that in the main, for the good of all, white boys should be kept well away from electric guitars.",
            "review_date": "2018-07-18",
            "source": "rt"
        },
        {
            "content": "gentle yet insulting..\n\nThis Is Spinal Tap\n\nAn idea or a concept isn't everything and this is a fine example for it, as the brilliant idea of it fades away quickly as it derails off the track and becomes something entirely different than what was promised or even more embarrassingly what was right. The writing is funny and brilliant, but fails to keep it true to its nature and fumbles its way down the road. There are few hilarious sequences installed in here that one cannot not get lost into it. Another major dilemma in here is that the priority in here is nothing but the punch line of the joke which is kept above the bigger picture in here and fails to make a definite point out of it. The performance is promising and hilarious at the same time, as they draw plenty of laughs from the screen. Rob Reiner; the director, is bang on the money on his execution skills and is convincing throughout the course of it. The music bits of the feature may come off, off putting and uneven in here. This Is Spinal Tap is a gentle yet insulting tap on the back in its self-created genre as it fails provide the essential ingredients to it and leaves it undercooked.",
            "review_date": "2018-06-13",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap Pros: - Fantastic Acting - Amazing Directing - Terrific Script - Good Cinematography - Great Editing - Very Funny - Wonderful Music/Songs - Most of the pacing is good - Interesting look at the music industry - Pays respect to rock music Cons: - Moves slow at times Overall Grade: A (9.5/10)",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever made.",
            "review_date": "2018-05-28",
            "source": "rt"
        },
        {
            "content": "Genius, original, clever comedy is one of the funniest ever made.  It's even more enjoyable for musicians.",
            "review_date": "2018-05-07",
            "source": "rt"
        },
        {
            "content": "This movie is a true cult classic some people will like it, some will love it, and some will hate it. I found the film really funny and great how serious the band is even with the jokes going on I like the film though I didn't love it. It's still better than 90% of the crap out there. You can't go into a film like this expecting The Dark Knight Rises this film is to be looked at scene by scene and you need to notice the little things to get all the humor. The film has been rated as one of the funniest films of all time so it's definitely worth a watch.",
            "review_date": "2018-04-22",
            "source": "rt"
        },
        {
            "content": "The tippy top of the mockumentary, still holds up well to this day almost 25 years later. Full of great performances.",
            "review_date": "2017-11-23",
            "source": "rt"
        },
        {
            "content": "This mockumentary is a cult classic not just because it's funny but because it is so accurate in all its goofiness that it could have been a real thing.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nThis is Spinal Tap feels just like a documentary with its filming and editing, and its also a very funny and well acted.",
            "review_date": "2017-10-05",
            "source": "rt"
        },
        {
            "content": "I laughed all the way through and I loved the way it satirizes the pretentious behavior of rock stars and the common tropes that are found in rock music. \"This Is Spinal Tap\" is a classic mockumentary film.",
            "review_date": "2017-09-11",
            "source": "rt"
        },
        {
            "content": "Ozzy Qsbourne thought this was a real documentary , that says it all really . A brilliant movie that is closer to the truth than a comedy should be",
            "review_date": "2017-09-10",
            "source": "rt"
        },
        {
            "content": "3 1/2 out of 5 stars. This was a silly movie. Had some really funny parts and was music centered which i love. It dragged a bit though and the British humor didn't always hit for me.",
            "review_date": "2017-07-24",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap is nothing short of comedy GOLD. It will probably hold the title of the best mock-rockumentary ever made into eternity. Great characters, dying drummers and 18 inch model of Stonehenge. The satire and slapstick hits almost every single time. The direction is masterful; clearly a lot of time and laughs were spent observing the actions of real, laughably egocentric self-proclaimed 'rock gods'. They clearly had great fun making this film, and it's a lot of fun for the audience too. You won't be disappointed; this film delivers.",
            "review_date": "2017-07-22",
            "source": "rt"
        },
        {
            "content": "I have limited experience with mockumentaries but it seems I enjoy them to some extent, but their dry humor tends to only elicit chuckles from me instead of big laughs. This is Spinal Tap was basically the same. It was definitely funny, and I enjoyed the humor, but my face wasn't exactly hurting from all the laughter. It's written very well, and it manages to poke fun at bands like this while simultaneously feeling strangely authentic. \n\nA huge part of the success of This is Spinal Tap has to be credited to the cast. Michael McKean and Christopher Guest are the leads of the band (and the movie). They have a great report between them. I like watching their slow descent from pride to frustration as the movie progresses. I also love basically every single thing Harry Shearer does as an extra comedic wild-card in the film. I was very impressed with all their fake English accents too. \n\nThe music was extremely well-written. There were a few different styles throughout the film, and it all worked. They had some crazy lyrics, and I found some of those moments on stage to be the funniest. The elaborate sets and the problems they had with them was icing on the cake. I kind of felt like This is Spinal Tap might be a movie that would be better watched with a group of people laughing together. I did enjoy it on my own, but I feel like I'm missing a little something that would make me LOVE it.",
            "review_date": "2017-07-15",
            "source": "rt"
        },
        {
            "content": "one of the funniest and most quotable movies you'll ever see.",
            "review_date": "2017-07-11",
            "source": "rt"
        },
        {
            "content": "As a mockumentary, This Is Spinal Tap goes to eleven.",
            "review_date": "2017-05-27",
            "source": "rt"
        },
        {
            "content": "This is Spinal is a hilarious mockumentary about the fictional heavy metal band \"Spinal Tap.\" Serious music fans will love this! Musicians can relate to some of the gags. Make sure you watch the Hellhole video and Heavy Metal memories.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "I will never think of Stonehenge the same way again.",
            "review_date": "2017-05-09",
            "source": "rt"
        },
        {
            "content": "Awesome movie. One of the first of its kind, this film introduced the world to the music mockumentary, and did so skillfully with stellar writing and direction from Reiner, as well as phenomenal performances from its three leads, wonderfully satirizing the hair band scene from the '70s and '80s.",
            "review_date": "2017-05-04",
            "source": "rt"
        },
        {
            "content": "A charming film that's inoffensive, very funny",
            "review_date": "2017-04-26",
            "source": "rt"
        },
        {
            "content": "I know it's a classic and I must say I did find it very funny in some places, even though I came out only mildly satisfied. A very well written film that people will be quoting for a long time, but I can't say I full heartedly recommend it.",
            "review_date": "2017-04-19",
            "source": "rt"
        },
        {
            "content": "A classic that holds up in almost every way.",
            "review_date": "2017-03-19",
            "source": "rt"
        },
        {
            "content": "You can't dust for vomit, that's all i'm gonna say.",
            "review_date": "2017-03-18",
            "source": "rt"
        },
        {
            "content": "Terrible, unfunny movie.  Sat there watching and waiting for the funny, and it never arrived.",
            "review_date": "2017-03-06",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap (1984) C-83m. ??? D: Rob Reiner. Rob Reiner, Michael McKean, Christopher Guest, Harry Shearer, Tony Hendra, R.J. Parnell.  One-of-a-kind parody of a rock documentary with Reiner as Marty DiBergi, filmmaker recording a concert tour of the most incompetent heavy metal band that ever made a return to the stage. Machiavellian and often very funny, with now-legendary scene with the amplifier that goes to \"11\".",
            "review_date": "2017-03-02",
            "source": "rt"
        },
        {
            "content": "this film is the best i have ever seen. the was only a small issue which is that their British accents were not that great.",
            "review_date": "2017-03-02",
            "source": "rt"
        },
        {
            "content": "About as perfect a comedy as movies can get.",
            "review_date": "2017-02-01",
            "source": "rt"
        },
        {
            "content": "Very funny.  Still humming Big Bottom.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "one of my all time favorite comedy",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Clever classic comedy.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Finally got around to watching this. I unfortunately knew most of the funny lines already and it seemed dated and .. well... stupid. I suppose it was an interesting in its day.",
            "review_date": "2016-12-19",
            "source": "rt"
        },
        {
            "content": "Hilarious, original and classic. No mockumentary will ever be quite as good as this masterpiece.",
            "review_date": "2016-11-29",
            "source": "rt"
        },
        {
            "content": "Never too late to catch up on the best rockumentary in history. It says it all about the story of their struggle being a once-famous and soon forgotten rock band. Almost real and years later after its being made, This Is Spinal Tap remains to be a legend and points of references.",
            "review_date": "2016-11-26",
            "source": "rt"
        },
        {
            "content": "Rob Reiner and Spinal Tap have succeeded in creating a totally realistic and believable mockumentary, and at the same time a very funny one. The acting and dialogues are great in a film that feels like a parody of but also a tribute to the big rock and metal acts of the '80s. Paired with Spinal Tap's hilarious original songs, \"This Is Spinal Tap\" is a very enjoyable cult phenomenon, significant for both cinema and music.",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "While being possibly slightly dated in comparison to recent comedies, This Is Spinal Tap is nonetheless extremely funny and an excellent parody of rock bands during the eighties. Possibly not to the same strength as the later entry, however is far more quotable when we look back at it.\nVerdict: B+",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap is directed and co-written by Rob Reiner, and it stars Christopher Guest, Michael McKean, Harry Shearer, and Rob Reiner in a rock music mockumentary comedy about a documentary of a fictional rock group called Spinal Tap. When my friend and I saw this in the city library, we rented it and others, and watched this, hoping it'll be good as this has high praise from critics and audience reviews. By the end of it however, we just didn't get how it got so high because we honestly thought that it wasn't a good movie, and my friend is more of a rock fan than I am. There were some parts that I agree with them like the acting being really genuine that it without knowing the film being a mockumentary, it would've fooled us. The way it was shot is like a documentary, and there were some funny moments in there that I noticed, but other then that, with some addition of songs that are not that bad, that's all I can give to this film that's positive. I didn't find it that funny, it wasn't really that interesting to me, and I just didn't care about the characters in this movie. I know this has a fan base, and people say that this is the best mockumentary of all time, and I just don't see it, at least with a film like Citizen Kane I can see why people think it's the best film of all time, even if I didn't think so, or even think it's a great film, I can see at the time about the achievements that it got, this one, I don't. I'm glad it did well with a cult following and made careers for both Rob Reiner and Christopher Guest, but for me, This is Spinal Tap is not for me, and I'll probably never get it I guess.",
            "review_date": "2016-08-01",
            "source": "rt"
        },
        {
            "content": "Funny rock comedy mocking 80s hair bAnds and their catchy but hollow music. Def made me chuckle through out. Well made and close to accurate mockumentary. Does remind me a bit of the Office, but not quite as funny.",
            "review_date": "2016-06-22",
            "source": "rt"
        },
        {
            "content": "Not incredibly funny, but still good for quite a few laughs.",
            "review_date": "2016-06-11",
            "source": "rt"
        },
        {
            "content": "This was good, I didn't love it though, definitely quotable and funny moments sprinkled in, but I felt like this had trouble know what it was",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "I don't know.  I wish I liked this stuff more.  It's one of those things where I can see the joke they are going for and it seems worthy, but I get very few laughs.  Nice try but ultimately it falls flat.  4.7 out of 10",
            "review_date": "2016-05-14",
            "source": "rt"
        },
        {
            "content": "Rob Reiner's directorial debut is one of the funniest movies of the 1980's and it oddly enough summed up hard rock/heavy metal's popularity in a mocking manner.  \"This is Spinal Tap\" is about a fictional band named Spinal Tap, a band with the distinction of being called \"The World's Loudest Band.\"  A band that loses most of their drummers to strange mishaps including one who choked on someone else's vomit.  A band that really never had a hit but follows whatever is popular at the moment.  They started out in the skiffle craze that swept Britain before becoming a rock and roll band, then psychedelia and settling on heavy metal where they sort of stuck in that genre for over a decade.\nAt the core of this story is the three main band members, David St. Hubbins (Michael McKean), Nigel Tufnel (Christopher Guest) and Derek Smalls (Harry Shearer).  David and Nigel are like brothers but when David's girlfriend Jenny (June Chadwick) it causes a lot of tension among the bandmembers.  They are attempting a comeback tour and filmmaker Marty DiBergi (Rob Reiner) is there to film this tour and the chaos and comedy that ensures.\nIt's a film that is so absurd, so fun and so enjoyable to watch that one can't even fathom this may not be a real band.  Their songs are good, albeit offensive at times.",
            "review_date": "2016-04-26",
            "source": "rt"
        },
        {
            "content": "The greatest rockumentary I have ever seen. Mixing satire on the Rock and Roll lifestyle with amazing comedic moments, this movie does not disappoint.",
            "review_date": "2016-03-20",
            "source": "rt"
        },
        {
            "content": "More of a \"mockumentary\" than a \"rockumentary\".  As a matter of fact, this is one of the finest examples of the genre.  Rob Reiner (aka \"Meathead\" from All In The Family fame) directed and co-wrote this film after being inspired by a predecessor, \"The Rutles\".  \n\nI would like the give this film a higher rating but simply has not held up that well over time.  It is a parody of a typical 70s British heavy metal band.  The film has developed a cult status, and many of its lines are recited by fans over the years.\n\nThe comedy is sedate, and makes one think about the rock business of that era.  Like a Monty Python film, one must pay attention to every line to understand a lot of the intelligent satire.  The film can easily be digested over multiple viewings and I'm sure fans have all seen it more than once.\n\nThe film actually deserves 8.5/10 stars, because for me, it teeters between being an exceptional movie vs a very good one.",
            "review_date": "2016-03-14",
            "source": "rt"
        },
        {
            "content": "Funny from start to end and with a story that is both believable and awesome, This Is Spinal Tap is an amazingly crafted mockumentary for the ages and a film that documents and spoof the rock n roll lifestyle in a funny and fairly accurate way in its own right.",
            "review_date": "2016-01-26",
            "source": "rt"
        },
        {
            "content": "absolutely hilarious in a very subtle way.",
            "review_date": "2016-01-24",
            "source": "rt"
        },
        {
            "content": "The movie that popularized mockumentaries does not hold up for me, 30+ years after it's release. Today's influx of mockumentary sitcoms might be to blame, ironically.",
            "review_date": "2016-01-06",
            "source": "rt"
        },
        {
            "content": "A true trail blazing comedy.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "Very quotable and funny, but sometimes a little slowgoing. Not perfekt, but very enjoyable and well made.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "The more you know about \"rock'n'roll\" the funnier it probably is, but even those not in the know will still find it laugh out loud hilarious. There's also some great tunes here, even when the lyrics make it unable to sing with a straight face.",
            "review_date": "2015-10-21",
            "source": "rt"
        },
        {
            "content": "Fake documentary of the worst-but fictional-Heavy Metal group.Sit down and relax listening the mostly absurd,sexist songs of genre,the Stonehenge sequence is solid gold",
            "review_date": "2015-08-16",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap gets 4.5/11 stars",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "Welcome to my 400th review since March 2011!\n\nWhat better movie to take a look at other than 'This is Spinal Tap'.  A cult classic.  These guys put on a fantastic show over a brief 80 minutes thanks to Rob Reiner's astute portrayal of the rock and roll lifestyle.  It's considered a rockumentary.  A coined term for this special genre.  The laughs are hearty and the dialogue is easily quotable.  If you're a lover of music and have taken classes about the history of rock like I did, you'll easily recognize every little nuance they interpret from some of the most famous bands.  The one part that slayed me was the Stonehenge bit.  \n\nIt's cleverly written pieces like this that make you look back on what cinema was like back in the day and you only wish there was more like this on a consistent basis.",
            "review_date": "2015-06-29",
            "source": "rt"
        },
        {
            "content": "Perfect in every way.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "http://letterboxd.com/zbender/film/this-is-spinal-tap/\n\n\"You know, several people spontaneously combust each year.\"\n\nAnd thus was the first I heard of Spinal Tap. This is Spinal Tap is a humorous mockumentary about the band of the same name. The film nicely satirized the rock and roll life style and \"rock arena\" bands of the 70s and early 80s. I enjoyed the musical numbers and the primadonna attitudes of the band members. The band members antics were also enjoyable. Unfortunately during the second half I did not enjoy the film as much, especially the break up of the band. Their attitudes were not as humorous and the film's tone was different. I was checking several times to see when the movie would end and it wasn't even a hour and a half long. I would still say worth though.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "The gold standard for mockumentaries.  So ridiculously believable that even Ozzy Osbourne believed Spinal Tap to be a band for a period of time. 11 is louder than 10!\n\n5/25/15",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "Next to Blazing Saddles, the  hardest I've ever laughed at the movies. I really thought my guts were going to spill out on the floor. That would of been gross.",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "I give it 11/5 stars",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "\"This is Spinal Tap\" is the most defining movie in the mockumentary genre.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "Hilarious and fun from start to finish, this spoof documentary is a little treasure that deserves to be seen. Excellent.",
            "review_date": "2015-05-04",
            "source": "rt"
        },
        {
            "content": "Quirky doesn't begin to explain it. Mockumentary done right.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "It's hilarious, original, stupid, witty, poignant, and absurd on every level possible. This Is Spinal Tap does everything you'd expect a classic comedy to do.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "I don't know if it's because I have a migraine but the actors are far funnier than the movie. I could be ok not watching this again, but I would to see these characters again.\n\nI know it's a classic so I will revisit this and give it another shot.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "The hilarity of this film goes up to \"ilevin\", most comedies only go to ten, but this goes to \"ilevin\". It might not be an exaggeration to say this is the funniest film ever.",
            "review_date": "2015-03-27",
            "source": "rt"
        },
        {
            "content": "A hilarious mockumentary about an 80's hair metal band attempting to stay relevant. So quotable.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "Mockumentary may be an entire genre now, but this is the film that put it on the map. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "There isn't a single scene in it that isn't funny.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "Grade: High 7/10\n\nThis is Spinal Tap is a film that has a cult following and I can kind\nof see why, but not completely. It has it's many moments and I can't\ndeny laughs were had throughout but part of me did feel it was\noverrated or one of those cult following films that aren't as good as\nothers say. I felt it was solidly good though and here below is why so.\n\nThe story is slow at first and the jokes don't flow as crazily as the\nstory but nevertheless jokes come off the reel with skill and\nprecision. I liked everything that is going on and I actually preferred\nthe arguments they all have to the music they play. I did enjoy the\nmusic pieces and some the concert scenes can be hilarious and well\ndone, the movie does excel in making what could be stupid jokes into\nactual smart ones.\n\nThe casting is very varied but they all work together well, all of the\nmain cast do a good job and to say it is a mockumentary style film they\nreally take to the part well. I like the more random cast more and the\nlittle funny bits really stem from strange encounters the band have. I\nthink Rob Reiner does a good job not only delivering the questions as\nhe the documentary maker but also reacts really well too.\n\nOn to Rob Reiner again and he just happens to direct and co write this\nmovie too so all round Reiner really shows skill and although I believe\nit could be funnier than it was, he still does a massively solid job.\nWritten by some of the main cast Christoper Guest, Michael McKean,\nHarry Shearer and of course Reiner, This is Spinal Tap has quick smart\njokes and really allows the viewer to laugh at anything.\n\nMy main criticism is at the jokes, it is funny as I did feel it was a\ntip top movie but part of me wanted to laugh more and for what some\npeople say, it isn't all that interesting either. It can bore you and\nwith me I felt it doesn't get off the mark well but does manage\nactually to make some good jokes in the start so I'll give it that.\n\nI think this movie was created for rock fans and comedy fans a like and\nit really has a target demographic. I also felt whilst watching that\nsome people will find it funnier than I did and although I did laugh\nquite a lot, there are more to be had here. Many will not like it and\nthink of it as kind of stupid and silly but I feel here you have to\nwant to watch it rather than just see if it is funny at all.\n\nOverall I gave it a high 7/10 and felt it was solidly in that but it could\nhave maybe gone up just a little with a few things. In conclusion this\nisn't a film that I absolutely loved but could easily see others loving\nit, this really will come down to what you want in film and what you\nwant to see, but then again anyone should give it a go, and you should\nin general laugh quite a bit if you have a funny bone.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "A Classic comedy filled with brilliant acting and tons of improvisation.",
            "review_date": "2015-01-16",
            "source": "rt"
        },
        {
            "content": "Capturing the essence of rock and roll. Genuine laughs guaranteed!",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Very well done, funny, and fantastic acting.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "Greatest mockumentary ever.  Absolutely hysterical.  Great, quotable lines.  Nothing short of brilliance.  \n\nGrade = 8.5/10",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "To this day I mimic the shows great one liners....a full on classic and staple of any DVD collection.",
            "review_date": "2014-12-13",
            "source": "rt"
        },
        {
            "content": "This is without a doubt one of the best mockumentaries ever, the primal one. No other attempt at satirizing rockstars and their lifestyle was this funny and smart. Some of the jokes literally turned into daily one-liners, and nothing can beat that Stonehenge scene, seriously.",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Subtly funny and full of memorable quotes, This Is Spinal Tap is a classic!",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "Rate it up to eleven!",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "The humor is ok ,but the music is what holds it up.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "Ironically, although the \"mock\" in this mockumentary is directed at various shades of rock between the British Invasion and the hair band era, the music of \"Spinal Tap\" is actually quite good. At the very least, it's good at being bad, and that's sometimes more than enough to get a song to the top of the charts. It's not exactly the quality, but the believability of the music being lampooned that makes \"Spinal Tap\" a great piece of satire. Like any good band documentary, the story of Spinal Tap is told through their music: they had more artistic phases than The Beatles, more previous members than Black Sabbath, and fell from grace like Guns 'N Roses, and at every stage their material is brilliantly, unmistakably derivative of those legends and their ilk. It's one thing to know exactly what's pretentious and corny and laughable about those acts, great as they all were, but it's another and deeply impressive thing to be able to showcase their excesses through music. Spinal Tap's early, Ed Sullivan-esque days sees them in mop tops and suits, singing jangly, catchy, teeny-bopper pop that really feels imported from the mid 1960s. Same for their flower-power days, the absurd put-ons of their goth rock era, the wanna-be virtuoso indulgence of their progressive experimentalism, and most of all, their preening, testosterone-driven glam rock of the late 1970s and early 80s. This last subgenre is the one the movie skewers most ruthlessly: the ridiculous songs \"Heavy Duty\" and \"Big Bottom\" are two of the wittiest and most scatological in the film, and at the same time are only slight exaggerations of real-life analogues.\n\nMuch of the non-musical material in \"Spinal Tap\" works just as brilliantly. The script is quotable in the extreme. It is concise and cutting with its observations on the music industry, as in hilarious dispute over a sexist album cover between a label executive (Fran Drescher) and Christopher Guests's oblivious lead guitarist Nigel Tufnel (one of many delightfully English names in the film).\n\nAt times, the movie is as earnest and emotional as real band documentaries can be. The Lennon/McCartney-inspired arc between best friends Nigel and David St. Hubbins (Michael McKean) could almost have been the focus of a straight drama. Near the end, that storyline strains the mockumentary format as the proportion of sentiment to snark shifts in favor of the former, but by this time the points have been scored. Spinal Tap has all the foibles of history's great rock bands, so it would be unfair, and inaccurate, if they didn't take on their essential likability, too.",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "It's like trying to extrapolate the universe",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "Not as great as everyone claims it to be",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of the 1980's with hilarious performances by Michael McKean, Christopher Guest and Harry Shearer, a lot of quotable lines, and a great directing debut for Rob Reiner.",
            "review_date": "2014-09-24",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap was a good example of a well done mockumentary. This movie follows the rock metal group Spinal Tap and their struggles of keeping band mates together and keeping their tour under control. We get to see many funny moments of the tour failures such as the bassist getting stuck in the cell and the small Stonehenge. This movie I thought would funnier than it was, it had plenty of its great moments but just didn't really meet my funny factor. I did really enjoy the whole tour story and was pretty funny. I really enjoyed the characters and their funny personalities and the constant deaths of the drummers. My one complaint is that it might have been too short though. I  did enjoy the soundtrack, all of them made up their own unique sound and was pretty good! I thoroughly did enjoy this movie and I'd probably watch it again. B",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "Not as consistently funny as its reputation, but.... this is one of very, very few movies which can lay claim to having scenes at the same level as Monty Python and the Holy grail.  The Stonehenge scene in particular is one of the greatest in the history of film comedy.  Spinal Tap can also be credited as giving birth to the bountiful mockumentary genre, and the members of Spinal Tap have continued the gag adroitly far beyond the release of the film.\nAs some have mentioned, while Spinal Tap may be an ingeniously ridiculous creation the Spinal Tap movie isn't just a gagfest.  It is even more so a picture of burnout, symbolic of the burnout of American rock and roll culture at the time yes, but more specifically of the physical and emotional burnout of the band members, amid an aimless playing out the string.  There are entire stretches of the movie that lag, which is why I've rated Spinal Tap slightly lower than Guffman and Best in Show. The draggy pace and empty sections may be for a purpose, but that purpose isn't comedy, which this movie at its best does better than nearly any other.   Other movies can show how drab and exhausting being on tour can be; only Spinal Tap can produce the volume, visuals, and yes, odor, of rock culture at its most riotously (at times almost endearingly) stupid, boorish and neanderthal.  When it does, it soars, headbangs and thrusts its way down from comedy heaven",
            "review_date": "2014-09-19",
            "source": "rt"
        },
        {
            "content": "91%\nFamiliar but riotously funny, This Is Spinal Tap is a refreshing take on rock and roll, and mockumentaries in general.\n\nV: 81%",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "The mockumentary makes you appreciate what rock and metal bands did by highlighting the hilarious struggles of a band, trying to survive, goes through. And then there's the songs...\"big bottom, big bottom. Talk about mud flaps, my girl's got em.\" With hilarious, original songs and their drive for greatness Spinal Tap is a favorite band of any hard-rocker.",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "Not sure how people thought this was good, it was ok and almost shut it off",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap (1983) - R. Reiner\n\nIn an effort to avert my gaze from the horrors of world events and localized cold and flu symptoms, I turned again to one of the few funny comedies of recent decades (and possibly Rob Reiner's last great movie).  Spinal Tap is Michael McKean, Christopher Guest, and Harry Shearer and together with Reiner (as the erstwhile \"rockumentary\" maker) and a cast of soon-to-be famous players in bit parts, they riff endlessly on the idea of the heavy metal band (and rock band in general) as it emerged in the 70's and 80's.  Even watched for the nth time, the dialogue and episodes depicted here are of such sublime ridiculousness that no other mockumentary can compare (though Guest made a noble effort in the 1990s). Everyone is clearly having fun being as stupid as possible - and it's funny (not stupid) for the most part.  Even the casual music fan can catch the loving winks at bands that transformed themselves from blues to psychedelia to metal across too-long careers, along with the lip-synched videos, bloated tours, meddling girlfriends, and general chaos and calamity that seemed to follow their egos across time and space.  Expect low budget and accept no substitute (I haven't bothered to see any of the sequelia).",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "This movie goes to 11!",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "From Rob Reiner comes the laugh-out-loud rock-n-roll mockumentary This Is Spinal Tap.  Michael McKean, Christopher Guest, and Harry Shearer star as the British heavy metal band Spinal Tap as they launch their latest album with an American concert tour.  The comedy is hysterical and quite clever in how it satirizes the stereotypes associated with rock-n-rock bands.  And, the music itself is pretty good and feels like the heavy metal of the '70s and '80s.  Still, at times the film's a little too cartoony and rushes the story.  This Is Spinal Tap has some issues, but overall it's a lot of fun and provides plenty of laughs.",
            "review_date": "2014-08-09",
            "source": "rt"
        },
        {
            "content": "93%\nA hilarious and well-thought-out mockumentary.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Fairly amusing mockumentary.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "The reason that the satire has such a clever, wily quality is because any of these moments could have happened to any real music group.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "Hilarious mockumentary that pokes fun at the rock n roll lifestyle along with the fans of these ridiculous characters. Funny throughout and the style is beneficial to the viewer to get into the mindset. It feels real and most of it probably is real in some way.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "This was an interesting style of film because of the improvisation. It seams very real",
            "review_date": "2014-07-23",
            "source": "rt"
        },
        {
            "content": "A slilly, but really funny film even though it can slow down at times.",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "Not as consistently funny as its reputation, but.... this is one of very, very few movies which can lay claim to having scenes at the same level as Monty Python and the Holy grail.  The stonehenge scene in particular is one of the greatest in the history of film comedy.  Spinal Tap can also be credited as giving birth to the bountiful mockumentary genre, and the members of Spinal Tap have continued the gag brilliantly beyond the release of the film.\n\nWhile Spinal Tap may be an ingeniously ridiculous creation the Spinal Tap movie isn't just a gagfest.  It is even more so a picture of burnout, symbolic of the (big) bottoming out of rock and roll culture at the time yes, but more specifically of the physical and emotional burnout of the band members, amid an aimless playing out the string.  There are entire stretches of the movie that lag, which is why I've rated Spinal Tap slightly lower than Guffman and Best in Show. The draggy pace and empty sections may be for a purpose, but that purpose isn't comedy, which this movie at its best does better than nearly any other.   Other films can show how drab and exhausting being on tour can be; only Spinal Tap can produce the sights, sounds, and yes, the smells, of rock culture at its most riotously, at times almost endearingly stupid and neanderthal.  When it does, it soars, head-bangs and thrusts its way down from comedy heaven",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "With witty writing, a cast of dim, yet musically savvy British rock stars, Rob Reiner succeeds in creating an important, timeless mockumentary that parodies metal bands and the fan-fanaticism that surrounds the music industry.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "I feel like I'm required to give this movie an 11.  Spinal Tap is very creative, and funny.  But I'm going to be honest, it's a little bit bland for me.  Still, it holds excellent parody of rock groups of the 70s and 80s.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "The Original Rock-Mock-u-mentry",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "Funny movie. I'm glad I have it on DVD.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "Every bit as good as everyone has made it out to be, This is Spinal Tap is a frequently hilarious mockumentary about a rock group's slow journey into obscurity, and it's filled with the deadpan wit that makes British humor so great. By the end, there's even a sense of melancholy that creeps its way into the film as the band starts dissolving and people stop wanting to hear them. The movie copies the behavior of rock stars and the cliches of the documentary format so closely that you can hardly believe it's all fake. Wonderful movie, especially if you're a music buff.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "An amazing journey thru the eyes of an imaginary british rock band. See this movie!",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Very well done and amusing, though not a big fan of improvisational comedy.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "Very well done and amusing, though not a big fan of improvisational comedy.",
            "review_date": "2014-05-17",
            "source": "rt"
        },
        {
            "content": "The laughs go up to eleven with \"This Is Spinal Tap\".",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "A little dated for our age, but still a classic, no-brainer comedy (even though I still think that Amps that go to 11 are a genius idea).",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "After hearing countless references, I finally got to see this movie. It gave me a few chuckles alright, but I didn't exactly die of laughter. Perhaps my expectations were too high, or perhaps 80's jokes don't work so well 30 years later.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "The ultimate Mock-rock-documentary, \"This Is Spinal Tap\" draws on elements of glam metal and music trends, as well as the Beatles' film \"Let It Be\", to create one of the greatest cult comedies of all-time.\n\nThe film debut of Rob Reiner, and starring Reiner, Christopher Guest, Michael McKean and Harry Shearer, this partially improvised film tells the story of the greatest fictional rock band of the era, Spinal Tap, who are complete with in-band disputes, sexist album covers, interfering girlfriends, miniature Stonehenges, multiple dead drummers and an amplifier that goes up to 11.\n\nIt's witty, it's funny, it's rife with pop culture references, and it's just brilliantly iconic and incredibly British.\n\n5/5.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "Wahay! Always remember the part where Rob Reiner crosses his arms and unfolds them Micheal Bay did the same thing during a speech he walked out of.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Quality Rock satire. I give it 4.5 out of 11 stars! Luls.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "It's an age old tale of the band who take themselves far to seriously and are completely oblivious to the fact that fame has hit them square in the face and dealing with it has become a chore. This is Spinal Tap, documents the ongoing turmoil of the band with Rob Reiner working with this semi ficticious band in creating a documentary while their manager struggles to keep order and shows together. Being a part of the AV industry myself it strikes home even more so because ive actually seen situations that Spinal Tap get into happen on a regular basis and its funny as hell to watch. It has obviously influenced many bands and programmes over the years and many people have either riffed or paid homage to this cult classic. However this is where its at, it is 100% comedy gold, a laugh a minute, multi layered comedy, structured and executed in a perfect way. My only gripe is by the end, everything seems savy and it finishes far too quickly. This movie is endlessley quotable, full of surprises and just pitch perfect performances. get a couple of mates round, a couple of cans and just sit and revel in the majestic hilarity that it Spinal Tap.",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "Utter  s##t! anyone with an any interest or oven knowlage of metal or talent should stay well away from this complete wast of film. Dull, Boring and insulting.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Rock and Roll! I love Spinal Tap. 5 stars.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "A film director follows rock band Spinal Tap on their tour across the USA.\n\nI first became aware of this movie while talking to a work colleague about rock bands. Only in that conversation did I realise Spinal Tap was a made up band for the purpose of this mock/rockumentary. This only intrigued me further though and so I had to watch it.\n\nThis is Spinal Tap takes a look at a once popular British rock band as they go on tour in America. From problems with their album cover to underperforming ticket sales, malfunctioning set pieces and dying drummers, the film pokes fun at everything to do with rock bands and touring.\n\nThe songs are catchy and the film doesn't seem to lose pace. I found it enjoyable.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "The scene where all of them are playing bass... pure genius",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Hilarious mockumentary that is just as funny as it is smart, about a has been British heavy metal band on an absurdly catastrophic comeback American tour. While the pace of the film itself may not be as impressive, it is also true that the laughs just keep on coming. But what is truly impressive is this feeling of authenticism that truly blends in with the satire and comedy of the film not only through the filmmaking style employed by Reiner that makes it look like a legitimate documentary but also because of a somewhat faithful representation of the image of dumb hair rock bands of the past. A witty screenplay with some memorable dialogue completes the picture, along with some great performances by the cast and makes This is Spinal Tap a cult classic worth watching again and again.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Not sure how or why this has such good reviews and high ratings.  I found this to be one of the most boring and quite awfully made movies of all time.  There is not a single positive thing that I can say about this movie.  Not sure what kind of drugs people were on in the 80s...but this movie is bad and fans of it should feel bad.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "I have watched this movie several times -- this time with my mom.  I insist that this is one of the three greatest rock-n-roll movies, the other two being Amadeus and The Blues Brothers.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "A genuine mockcumentary.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "I honestly had no idea of what to expect with THIS IS SPINAL TAP, with the exception of a couple of bits that have entered the pop culture lexicon (the Marshall amp bit, for instance). What I got was...ok, I guess? It wasn't exactly a laugh-riot, but there were a number of recurring funny bits. Still, there were too many stretches that I didn't find funny at all. Fortunately, the songs were well-written and performed. Otherwise, I would have been mostly bored. Overall, it was a mixed bag in terms of comedy, although it did have a few amusing insights into the over-the-top-ness of rock bands. Maybe it would have been funnier if I'd been born 20 years earlier.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Excellent satire. Good movie.",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "viva el rock n roll bitches",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "As a rockumentary, This Is Spinal Tap well documents heavy metal band Spinal Tap throughout their tour of the United States, tells us the history of the band back when they were a sunshine pop group from the 1960s, mourns for the deaths of the many drummers who played in the band, and takes the time to explain the particularly chosen equipment used on stage and by the band members. Spinal Tap is why you can now crank your amplifiers up to 11. Did I specify that the band is fictional? Michael McKean, Christopher Guest, and Harry Shearer all play the three consistent band members, while Rob Reiner (both fictional and real director) interviews and films them during the tour. As a music lover, I adore some of the best stabs made at arena rock culture, such as on-stage technical difficulties (i.e., Disproportional set pieces), when lead guitarist Nigel (Guest) plays the guitar with the violin like an avant-garde, or mentally deranged, Jimmy Page, or the band's \"satirical\" art for their latest album, a woman on all fours held by a man's leash. The latter is, in fact, satire on satire.\n\nSometimes, the jokes can be too clever for their own good. In today's world, an entirely black album cover isn't so farfetched, or maybe Metallica are secretive Spinal Tap metalheads. That's forgivable though, because when some jokes fall short of their mark, the music is actually awesome. My favourite song is \"Big Bottom. It opens with pounding drums, followed by a lone, sexy bassline. The first line is, \"The bigger the cushion, the sweeter the pushin'.\" What more could you order from dumb, loud rock? This Is Spinal Tap is at its funniest when you have a feel for how big rock stars act on and off stage, but even if you're not much of a music buff, some moments will live on in your memory. Spinal Tap is all.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "\"The official explanation was he choked on vomit.\"\n\"It actually was someone else's vomit.\"\n\"they can't really prove whose it was, you can't really dust for vomit\"\nJust one example of the hilarious comments made by these stereotypical thick-headed band members.  \"This is Spinal Tap\" gets a little boring at some parts, but does a good job at poking fun when it does.  I also thought the acting really sold itself to look like a real documentary aswell.  4 stars.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "The ending is rushed, but that doesn't stop This Is Spinal Tap from being a hailarious parody of heavy metal bands. Filled with genius laughs and intelligent jokes, it's clear to see why Spinal Tap has endured as a classic all these years.",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "The subtlety is what makes it beautiful.",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "the stars only go to 5 but this one goes to 11!!!!",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Pure hilarity throughout.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Cult classic mockumentary is still pretty funny and worth a watch.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "An incredibly hilarious spoof of rock and roll bands.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": ".. a review of 'shark sandwich' just says 'shit sandwich'",
            "review_date": "2013-09-30",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap may be the best fictional nonfiction film of all time. Terribly funny, a blast to watch, and despite its 1980s setting a seemingly timeless picture, it transcends its subject material and plays out as completely accessible to all audiences, no matter their era or preference in music. An open mind and an eager funny bone are all that's required to fall in love with This is Spinal Tap, and it's one of the crowning jewels in Director Rob Reiner's impressive résumé.",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "An American comeback tour disintegrates for a UK rock band on its way down.\n\n    Camera follows the fake UK band Spinal Tap as they play at various venues in a USA comeback tour.\n    Rob Reiner interviews the band outside the concerts.\n    The band's sexist image is dealt with again and again.\n    The band's gigs were cancelled in Boston, Memphis, and just about everything after Ian quit.  The latest album is not doing well at all.\n    They were big in Cleveland, but had a hard time finding the stage.\n    The Stonehenge prop in Austin, TX was funny.\n    Nigel quits after Ian.  The 'End of Tour' party brings up the issue of 'End of Spinal Tap.'\n    Nigel comes back at the end of tour, with a message from Ian.  One of Spinal Tap's old hits was number 5 in Japan.  Ian suggested getting together in Japan.\n    They go on without Nigel, but then he jumps in during the concert in Los Angeles.\n    Jump shift: Ian's back as manager, and they perform to a big crowd in Japan.\n\n    Cinematography: 7/10 More fluorescent green tones than I wanted to see in any one movie.  Fortunately, most of the film was fine.\n\n    Sound: 4/10 Ridiculously bad.  The sound levels keep toggling between too loud (need to change the volume down to avoid the neighbors complaining) and too soft (need to up the volume to make out normal voices at all).  I gave up after a while.\n\n    Acting: 5/10 Michael McKean was exceptionally good.  Harry Shearer was in that special place he occupies between boring and repellant.  Christopher Guest is an actor I hope never to see again.\n\n    Screenplay: 6/10 Moderately funny throughout as the band stumbles from town to town.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "A funny, inventive, scripted mock documentary that would have viewers believe it was an actual documentary if they had not already known it was fake.",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "I've never found this as funny as it's refuted to bebut seeing it again after about a decade it was suprusingly engaging emotionally, or maybe I was just tired.",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "I have finally seen the comedic light after a second view of 'This is Spinal Tap'. A spoof of rock music and rock bands.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "A lot of fun and a brilliant parody of rock bands of the time.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "If I watch a film where a certain accent present throughout the movie, I tend to speak like that for the rest of the day. But after watching 'This Is Spinal Tap' I'm literally writing in British. This film's sense of humour is very different than the humour we are used to seeing in film's today. The jokes are so dumb but it has such a clever side to them as well. Think of the humour from films like Hot Fuzz and Shaun of the Dead in a documentary style film which makes for some very memorable quotes. \"The only question left is, how much more black could this be and the answer is... well... none!\" A very funny film. Nuff said.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "This movie is really witty. It was a fun mocumentary. The music was good and the acting was pretty funny. It wasn't laugh out loud hilarious in my opinion but it was extremely clever with it's humor. Having a great supporting cast gave it some flavor to. I was suprised to see Billy Crystal, Fred Willard and Dana Carvey play such minor roles. It is truly an amusing classic. It feels like a real documentary and is unique compared to other movies of it's time. It is it's own genre in my opinion which makes it worth a look.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Consistently hilarious and truthful at the same time. One of the best comedies of the 80s",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "This movie was a great introduction to Christopher Guest's writing, and this movie proves that good mockumentary flicks can actually be pulled off. The movie does a great job of spoofing rock and roll with the less than bright members of Spinal Tap and their struggles to stay a popular band. As I said before it's well written and funny, but it's not for everyone, so I'd recommend it to rock and roll fans over anyone else.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Spoon fed comedy. The best!",
            "review_date": "2013-07-26",
            "source": "rt"
        },
        {
            "content": "This movie is awesome. There is none more black. ;)",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "One of the best mockumentaries ever made laced with comedic gold that anyone whether they're into rock music of any kind or not can enjoy. However, anyone who specifically loves metal will likely find a certain special resonance with the film like few others. There's a good reason the term \"Spinal Tap moment\" became a widely used piece of slang.",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "A clever and amusing satire mockumentary about a heavy metal band that could be mistaken as a real documentary.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Hilarious and oh so true mockery of rock stars.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "Ok Dokey. Not rocking though.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Very skilled and subtle satire.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "In funniness, some comedies go up to 10; this one (say it with me) goes up to 11.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Hilarious! Nobody should miss this one.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Some good laughs sprinkled here and there, quite amusing",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "Hilarious rock Mockumentary.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "I will admit, it was just ok. I found it to be mildly funny but not anything to write home about. I found it to be some what dry throughout and really kinda boring at parts. It still had some funny moments but in general just ok. 95% is ridiculous.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "This one goes to 11!",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "So well written and performed you might think it's real.",
            "review_date": "2013-05-17",
            "source": "rt"
        },
        {
            "content": "This consistently smart, sometimes brilliant \"allegory\" isn't just the funniest movie on classic rock and role, but it's one of the most painfully funny satires in history, inventing its own heavily influential genre for years to come.",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "...these go to eleven.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "Most go to 10...But this one goes to 11",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "It is a very rare occasion, when I finally get to a cult classic - only to be blown away thereby.  This is not one of those rare occasions.  It is undeniable however, that this study unearths its fair share of farcical poignancy.  I can certainly imagine watching it from the other side of that vast body of mockumentaries that followed - and being thoroughly impressed.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "I am sure this was a great movie when it came out almost thirty years ago and it is clearly a movie that is loved by many.  It didn't do as much for me, although I did like it/thought it was funny/laughed out loud!!",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "My favorite comedy of all time. Perfectly written, directed and acted. Despite the message of cultural content, it is timeless.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "I remember I was working in the theatre in New York when this came out in '84. The opening screening was at midnight on 57th street. I had no idea what it was about. There was little info about it. I decided to go check it out. needless to say, hilarity ensued. The while theatre was in stitches, self included. Great surprise that evening.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "A major contender for funniest movie ever made, and a biting yet loving satire of the rock and roll industry. It's a miracle that people as hilarious as Guest, McKean, and Shearer actually exist. Brilliant stuff.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "El actor Rob Reiner hace un excelente debut como director con este documental falso que narra la vida y milagros de la gran banda del Hard Rock, Spinal Tap.  Todos los cliches sobre el Rock & Roll se abordan en esta alocada, profetica e inspirada cinta que probablemente es la mejor pelicula sobre el Rock jamas realizada.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Awesome...one of the funniest most entertaining mockumentaries ive ever seen",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "I'd rate this an 11.  The music is infectious.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "This Is Spinal Tap is hilarious for classic rock fans, amusing for everyone else.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "Such a hilarious movie that has shining moments of humor throughout the whole film.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "This is honestly one of my all time favorite comedies.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "This movie goes to 11. Seriously, one of the best comedies of the 80's",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "awesome movie! directed by rob reiner.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "The smartest stupidity in the most blatant subtlety!",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Everything goes up to eleven. Nuff said.",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap brings you on a hilarious journey backstage and beyond on the world's most hysterical tour in music history. You will laugh until you cry, but mostly watch the tour unfold before you.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "This is a \"two Time\" movie. You have to watch it twice to catch all the sutle jokes. Even then you may mis one or two. I love this type of humor.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "This is Spinal Tap is a difficult thing to undewrstand if you don't know a history of good music, but watching it gives you so much nostalgia and so many laughs that it becomes imprinted in your memory as one of the most hlilarious and fresh comedy ideas of the past 50 years.\nRob Reiner's directional debut is full of clever writing, hilarity and an awesome soundtrack. This is Spinal Tap also features so many things that make it iconic, like the Amps with knobs that go up to 11, and the Tiny Stonehenge, and the term Rockumentary. But the unforgettable thing is the fact that This is Spinal Tap pays homage to so many classical musicians without ever doing injustice to anything in it's story, not to mention it's hilarious and perfectly acted with a great mockumentary format.\nThis is Spinal Tap is a classical comedy film that so many can enjoy, but it seems liek one day society won't reach it anymore with the development of the terrible music today.",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "This may very well be my favorite music movie after Amadeus and possibly my favorite comedy of all time. I love this film to the tenfold. YEAH! SPINAL TAP YEAH!",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "It was torturous. My friend Kim and I almost fell asleep.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Classic mockumentary",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "I have to say there were parts of this rockumentary that were very enjoyable. For every rock fan it salutes every group from the Beatles, Led Zepplin, and onward. Rob Reiner gives it a seemingly realistic feel, going so far as casting him as the interviewer Marty DiBergi. As far as the band goes, they probably could be passed off as a real bad as well, with real songs, album covers, and instrumentation. I think that makes the film so funny because we are seemingly the only ones who realize how silly they are. In their rock world amps that go up to 11 make sense and their everyday interactions are not even a bit funny. They didn't mean them to be but for the audience watching this epic failure of a U.S. tour unfold, we cannot help but smile at Spinal Tap. There was quite a lot of strong language but I thought the concept of the film was clever and there were some decently funny moments such as Stonehenge.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "A great piece of satire. What's the most important thing a mockumentary is that it has to feel genuine and believeabe; and with the music, characters, and acting it is. A great watch despite a thin plot and a lack of funny in the first half of the movie.",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "Still couldn't get why everyone rate this quite high.. Maybe because its way out of my era??",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "The 80s cult mockumentary This is Spinal Tap, doesn't have a striking appeal with me. Stylistically it's interesting for the films to satire rock stereotypes, and make the all around setting feel real. Interviewing to dope rock leaders, whose band is getting a \"more exclusive audience\". I actually never did laugh in this film, I lightly exhaled from my mouth making a \"psh\" sound, but I never actually had a real chuckle come out of this. It's not the most special of films, but it is decent. It's a film to watch midnight Saturday after drinking some red bulls, that was not the setting I was in.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "A comedy classic! The outtakes are a movie by themselves!",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "\"But these go to 11.\"",
            "review_date": "2013-01-14",
            "source": "rt"
        }
    ]
}