{
  "title": "Rear Window",
  "rating": 8.7,
  "release_date": "1954-09-01",
  "genre": [
    "Mystery",
    "Thriller"
  ],
  "summary": "A wheelchair-bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder.",
  "critic_reviews": [
    "Rear Window lovingly invests in suspense all through the film, banking it in our memory, so that when the final payoff arrives, the whole film has been the thriller equivalent of foreplay.",
    "Flawless, essential viewing that would earn more than its five stars if only Empire would allow it.",
    "The film leaps off the screen with a thrilling immediacy.",
    "As much as I admire all of these, especially \"Vertigo,\" I can't imagine that any one of them will top the feelings of exhilaration that are prompted by Rear Window, this most bittersweet of Hitchcockian suspense-romances. Make no mistake about it: Rear Window is as much of a romance as it is a brilliant exercise in suspense.",
    "Hitchcock confines all of the action to this single setting and draws the nerves to the snapping point in developing the thriller phases of the plot. He is just as skilled in making use of lighter touches in either dialog or situation to relieve the tension when it nears the unbearable. Interest never wavers during the 112 minutes of footage.",
    "What's extraordinary, for a film that works on these different levels, is that it also manages to be a riveting thriller.",
    "Simply put, Rear Window is a great film, perhaps one of the finest ever committed to celluloid. All of the elements are perfect (or nearly so), including the acting, script, camerawork, music (by Franz Waxman), and, of course, direction. The brilliance of the movie is that, in addition to keeping viewers on the edges of their seats, it involves us in the lives of all of the characters, from Jefferies and Lisa to Miss Torso. There isn't a moment of waste in 113 minutes of screen time.",
    "A superb example of suspense filmmaking, especially when one considers the technical limitations of its single set.",
    "Everything from the masterly opening sequence to the ambiguous final shot indicates that this is the work of a prodigiously talented director.",
    "In its perfect fusion of popular entertainment and high art, Rear Window ranks among Hitchcock's best.",
    "Masterpiece of voyeurism.",
    "The most densely allegorical of Alfred Hitchcock's masterpieces (1954), moving from psychology to morality to formal concerns and finally to the theological. It is also Hitchcock's most innovative film in terms of narrative technique, discarding a linear story line in favor of thematically related incidents, linked only by the powerful sense of real time created by the lighting effects and the revolutionary ambient sound track.",
    "Perhaps Alfred Hitchcock's greatest movie.",
    "In the hands of a lesser talent, this might have become a self-conscious stunt, but in Hitchcock's it has the tightly wound perfection of a flawless sonnet or sonata.",
    "Based on a Cornell Woolrich short story, this is one of Hitchcock's finest moments, full of subtle humor and nasty black turns, not to mention a wonderful score by Franz Waxman and gorgeous cinematography from longtime Hitchcock director of photography Robert Burks.",
    "Mr. Stewart does a first-class job, playing the whole thing from a wheel chair and making points with his expressions and eyes. His handling of a lens-hound's paraphernalia in scanning the action across the way is very important to the color and fascination of the film.",
    "Quite aside from the violation of intimacy, which is shocking enough, Hitchcock has nowhere else come so close to pure misanthropy, nor given us so disturbing a definition of what it is to watch the 'silent film' of other people's lives, whether across a courtyard or up on a screen.",
    "There is never an instant, in fact, when Director Hitchcock is not in minute and masterly control of his material: script, camera, cutting, props, the handsome set constructed from his ideas, the stars he has Hitched to his vehicle."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Jeff Jefferies is a photographer who likes to spy on the lives of his neighbors through the rear windows, until it begins to suspect that one of them killed his wife. Directed by Alfred Hitchcock, is written by John Michael Hayes, with theJeff Jefferies is a photographer who likes to spy on the lives of his neighbors through the rear windows, until it begins to suspect that one of them killed his wife. Directed by Alfred Hitchcock, is written by John Michael Hayes, with the participation of James Stewart and Grace Kelly.This is one of the most famous films of Hitchcock and has been several remakes target. Like many of the films of this director, it could almost be staged as a play, given that almost all the action takes place in the same place: the apartment of the protagonist. The script is excellent, although moments of too much predictability. The performance of the main actors is impeccable and striking, and I consider this one of the best films of Kelly's career. The photograph also deserves a very positive note. The rest (soundtrack, costumes, scenery etc.) is reasonable without surprise or particular attention.I always heard people talk of this movie when it came in Hitchcock's name. But to see the film, I was of the opinion that this director did some more interesting and remarkable films. Either way, it's a good movie, it is worth to be seen and appreciated, and that will please a lot to most suspense fans or thrillers.",
      "review_date": "2018-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hitchcock challenges our moral scruples with this mysterious thriller.  The very natural talent of Stewart plays L.B. Jefferies, an adventurous man confined to his New York appartment through injury.  The incredibly talented Kelly, plays hisHitchcock challenges our moral scruples with this mysterious thriller.  The very natural talent of Stewart plays L.B. Jefferies, an adventurous man confined to his New York appartment through injury.  The incredibly talented Kelly, plays his frustrated but devoted girlfriend who Jefferies needs to convince that he has witnessed a serious crime from his window.",
      "review_date": "2018-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very suspenseful, well thought out, together movie, which doesn't get too complex but still manages to provide an interesting story and unique directing techniques which will stand out as one of Hitchcock's masterworks.",
      "review_date": "2018-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My score 100Metascore / User score 100 / 90Tomatometer / Audience score 100 / 95IMDB 85(95)",
      "review_date": "2018-10-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA good and artistic film, but not very great, but it has a special and respectable style for itself.",
      "review_date": "2020-07-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hitchcock is the master of creating one room set films, in which we the audience see through the mind and eyes of the main character. Jimmy Stewart excellently plays a photo journalist, bound to a wheelchair, suspecting his neighbour ofHitchcock is the master of creating one room set films, in which we the audience see through the mind and eyes of the main character. Jimmy Stewart excellently plays a photo journalist, bound to a wheelchair, suspecting his neighbour of murdering his wife.",
      "review_date": "2018-07-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I absolutely love this film. It's either the #1 or #2 Hitchcock movie on my list (competing with Vertigo). The story is so compelling, and the set is simply amazing. I always love watching the action on the New York City street that you canI absolutely love this film. It's either the #1 or #2 Hitchcock movie on my list (competing with Vertigo). The story is so compelling, and the set is simply amazing. I always love watching the action on the New York City street that you can see through the little alley between the buildings. Such wonderful attention to detail. This film definitely deserves to be at the top of the Best Movies list.",
      "review_date": "2018-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rear window is pretty much perfection, Hitchcock’s opening sequence introduces you into this world of neighbors and all the happenings around James Stewart. Such an expertly crafted way to tell this story. Superb in every sense of the word. 100/100",
      "review_date": "2018-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hitchcock built a whole universe out of an apartment complex... We then, as audience, are witnesses to a man who spends his time peeping his neighbor. And... Grace Kelly looks stunning...",
      "review_date": "2018-10-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "¿What does a man when has to stay home due a sickness or handicap? Despite the slow passed, Hitchcock knew the best for catching the attention of viewer due the detective plot and the magnetism of James Stewart.",
      "review_date": "2019-05-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Holds up incredibly well, largely thanks to Jimmy Stewart's effortless charisma  & stellar believability.  Hitchcock is a master at building tension & keeping the audience guessing. A+",
      "review_date": "2020-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of those instances where the movie is outdated for me. I'm not young by any stretch, but I find difficulty in engaging these older films. I also think, dare I say it, Hitchcock is not a director I'd put on my top 10 list. I won't say IOne of those instances where the movie is outdated for me. I'm not young by any stretch, but I find difficulty in engaging these older films. I also think, dare I say it, Hitchcock is not a director I'd put on my top 10 list. I won't say I don't like his movies, but I'm not an avid fan. I got one of the box sets and found myself bored through most of the movies, this one included. Sure, the color themes are intriguing, but I've seen so much better use of color. This is the issue I have with these groundbreaking films; the ground was broken so long ago, they have been oft imitated.",
      "review_date": "2019-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bon alors, j'aimerais -une fois n'est pas coutume- commencer par une note positive : la gracieuse Grace Kelly et sa blondeur enivrante ainsi que ses yeux bleus comme l'océan et... Mais d'ailleurs il faut se méfier, car son prénom prononcé àBon alors, j'aimerais -une fois n'est pas coutume- commencer par une note positive : la gracieuse Grace Kelly et sa blondeur enivrante ainsi que ses yeux bleus comme l'océan et... Mais d'ailleurs il faut se méfier, car son prénom prononcé à l'anglaise, ça donne \"graisse\"... Et on ne veut pas de graisse, non, non, pas du tout !Alors, il vaut mieux dire \"Grâce\" avec un gros accent circonflexe sur le \"a\" mais ne pas l'utiliser comme adjectif parce que sinon ça donne \"grasse\"... Et elle n'est pas grasse, bordel de merde ! Mais passons, car je me rends compte que je meuble comme un crevard et que je fais mon Hitchcock quelque part  ; je me regarde donc le nombril, je me gave de Lexomil (c'est pour la rime) j'allume 3000 watts de projos et je commence à film... à faire de la merde.Je laisse le fâlot James Stewart en roue libre, avec lui quoi qu'il arrive, on commence déjà à s'endormir et j'étire mon espèce de pièce de théâtre qui dure pas loin de deux plombes au maximum : elle plombe tout avec un aplomb sidérant, hypnotique et surtout soporifique. Je veille bien à ce qu'il ne se passe strictement rien tandis que tout le monde mate ces automates à travers les fenêtres grandes ouvertes... sauf à la toute fin que je m'efforce de rendre encore plus ridicule que tout le reste, ce qui n'est pas une mince affaire......mais j'y arrive toujours parce que je m'appelle Hitchcock et qu'il paraît que les bobos m'ont surnommé le \"maître du suspense\" !! putain qu'est-ce qu'on rigole quand même...",
      "review_date": "2020-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yang kasih rate 0-3 berarti sengaja menjatuhkan karya orang lain, lu pikir bikin film itu mudah ? lu pikir penilaian sebuah film bagus atau tidak cuma dinilai dari plot nya / ceritanya saja misalnya ? kalo mau kontribusi kasih rate yangYang kasih rate 0-3 berarti sengaja menjatuhkan karya orang lain, lu pikir bikin film itu mudah ? lu pikir penilaian sebuah film bagus atau tidak cuma dinilai dari plot nya / ceritanya saja misalnya ? kalo mau kontribusi kasih rate yang objektif lah, pertimbangkan aspek2 lain dalam film tersebut (unsur2 intrinsik film).  Saya pribadi sangat tidak suka dengan orang2 yang tidak menghargai karya orang lain, dengan melakukan penilaian hanya dari aspek2 tertentu, tidak menilainya secara keseluruhan (semua aspek yg ada dinilai) serta memberikan penilaian secara obyektif, bukannya berdasarkan emosi/perasaan sendiri semata, alias subyektif.",
      "review_date": "2018-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love everything about this film. It is, in my opinion Hitchcock's finest film. Also Jimmy Stewart is amazing.",
      "review_date": "2020-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Kinda boring, but it was alright. Grace Kelly was so hot ;) For the 50s, it was a good movie, I guess.",
      "review_date": "2022-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Shockingly boring. This one really confuses me. I kept watching hoping for something in this film to really draw me in and stand out from other movies. Instead there was HUGE chunks of this movie that felt as if they were filler with only aShockingly boring. This one really confuses me. I kept watching hoping for something in this film to really draw me in and stand out from other movies. Instead there was HUGE chunks of this movie that felt as if they were filler with only a couple of minutes of actual development in the story. Very disappointing given the other reviews. I must have missed something because I would not recomend this film.",
      "review_date": "2021-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Charming even after six decades, Rear Window is a example how Hitchcok's movies ages well.",
      "review_date": "2019-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even though this probably is not my favorite Hitchcock movie, it is still one of the greats. I only recently saw his best movies as before I somehow rarely watched that old movies, but even as this is more than 60 years old, it still isEven though this probably is not my favorite Hitchcock movie, it is still one of the greats. I only recently saw his best movies as before I somehow rarely watched that old movies, but even as this is more than 60 years old, it still is really good and the suspense is there and everything else you love Hitchcock for.",
      "review_date": "2018-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rear Window is a one of the more sophisticated Hitchcock films, and I will always consider it a masterpiece. It has tension, suspense, humour, has a strong voyeuristic tone to it and moves along at a good pace. The cinematography was trulyRear Window is a one of the more sophisticated Hitchcock films, and I will always consider it a masterpiece. It has tension, suspense, humour, has a strong voyeuristic tone to it and moves along at a good pace. The cinematography was truly excellent, dark in some scenes and beautiful in another. The script is fantastic and genuinely memorable(Thelma Ritter's wisecracks especially), likewise with the story, about a man who is convinced that his neighbour has killed his wife. I have always considered Rear Window's main merit to be the performance of James Stewart, he was perfect as Jeff, the man who is in a wheelchair, due to a broken leg. The other performances go without fault either, especially from the beautiful Grace Kelly as Lisa and Raymond Burr in a chilling performance as \"the villain of the piece,\" Mr Thorwold. The music was expressive and atmospheric courtesy of Franz Waxman, and the climax was possibly the highlight of the film, after Stewart's performance. The 1954 version of Rear Window will always be a classic, not the inferior TV remake with Christopher Reeve. All in all, a must see for those who are fans of Hitchcock. 10/10 Bethany Cox.",
      "review_date": "2022-03-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stunning, methodical, funny, erotic, self-aware, suspenseful, intelligent. A masterpiece.",
      "review_date": "2022-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best, GREATEST thrilling mystery movie ever made! With 2 of the best movie characters ever portrayed: James Stewart as L.B. Jeffries and Raymond Burr as Lars Thorwald!",
      "review_date": "2019-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Like 12 angry men , rear window is a renowned classic that manages to accomplish an excellent film whilst set in a room. Static settings demand for things such as cinematography, writing and performances to have to be at their best as theyLike 12 angry men , rear window is a renowned classic that manages to accomplish an excellent film whilst set in a room. Static settings demand for things such as cinematography, writing and performances to have to be at their best as they are the story, what keeps attention.  Hitchcock is stunning at creating sublime story's that simmer and build into thrilling crescendos and rear window is his best example of that with his idiosyncratic camerawork swoops like the voyeur the main character is. Grace Kelly is an engrossing independent brave socialite reporter and Stewart a cynical photographer but Ritter stands out as the sharp wit nurse. The script is exceptionally well written . Not the best film I've seen but it's right there.",
      "review_date": "2022-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rear Window is an absolute masterpiece. Alfred Hitchcock is well known for his ability to make entire films out of one room and no film exemplifies this better than Rear Window. Throughout the film there is a constant state of suspense thatRear Window is an absolute masterpiece. Alfred Hitchcock is well known for his ability to make entire films out of one room and no film exemplifies this better than Rear Window. Throughout the film there is a constant state of suspense that is aided by convincing performances from Jimmy Stewart, Grace Kelly, and Thelma Ritter. Although this film is often overshadowed by better known Hitchcock films such as Vertigo and Psycho, this film still remains a must see for anyone as an absolute classic that should be in consideration for the greatest film ever made.",
      "review_date": "2019-07-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Before the movie played in my photography class I was expecting a black and white film that still has charm (similar to It's A Wonderful Life minus Christmas). What I got was way greater than I'd ever imagined. The film has interestingBefore the movie played in my photography class I was expecting a black and white film that still has charm (similar to It's A Wonderful Life minus Christmas). What I got was way greater than I'd ever imagined. The film has interesting characters, great suspense, and an interesting plotline all from one room. On top of that it still holds up really well for a film made 60+ years ago. The one point deduction is more of a personal profession, since there are other movies that I just enjoy watching more.",
      "review_date": "2019-08-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a classic film of course, a Hitchcock classic. Its subtle and it relies on you, the viewer, to imagine what may, or may not, have happened. Its interesting how Jeff (the main character) interprets the observations he witnesses. ItsThis is a classic film of course, a Hitchcock classic. Its subtle and it relies on you, the viewer, to imagine what may, or may not, have happened. Its interesting how Jeff (the main character) interprets the observations he witnesses. Its all a case of context, I suppose. Hearing him query other peoples interpretations of what he saw made me doubt the truth behind the circumstances. Its definitely a strong case of armchair detective, of course (how could it not?). It features a strong performance from both James Stewart and Grace Kelly, who is quick to challenge his assumptions. It makes me wonder what do others read in to otherwise seemingly every day activities and observations?. Its a slow builder, plot wise but it does well at pulling the audience in, questioning things.Its an intriguing watch, I found surprisingly tense, so I'd recommend it.",
      "review_date": "2021-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Its the best crime thriller portraying a message of love at the heart of it strictly visually.",
      "review_date": "2019-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the masterpieces and the best movie of all time created by legendry Alfred Hitchcock.",
      "review_date": "2021-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Peeping is very common in Hitchcock's movies, he \"usually uses the peeping lens angle to reflect the event, so as to enter the world with the voyeur's feeling.\"  In the movie \"Real Window\", the director places voyeurism on the most criticalPeeping is very common in Hitchcock's movies, he \"usually uses the peeping lens angle to reflect the event, so as to enter the world with the voyeur's feeling.\"  In the movie \"Real Window\", the director places voyeurism on the most critical part of the film's structure.  From killing time to voyeuristic voyeurism, Lisa and nurses strongly opposed to involuntarily join in. The audience nervously followed the development of the plot, confirming the voyeurism deeply rooted in everyone's heart.",
      "review_date": "2020-05-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hitchcock challenges our moral scruples with this mysterious thriller. The very natural talent of Stewart plays L.B. Jefferies, an adventurous man confined to his New York appartment through injury. The incredibly talented Kelly, plays his",
      "review_date": "2022-09-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After hearing so much about this movie, I finally watched it today. I enjoyed this movie. It was beautifully made. The direction, performances by the actors, story.... everything was good. There is thrill and suspense till the end andAfter hearing so much about this movie, I finally watched it today. I enjoyed this movie. It was beautifully made. The direction, performances by the actors, story.... everything was good. There is thrill and suspense till the end and everything opens up properly at the end only. Movie tries to confuse you due to which you are unable to predict the ending. One thing that I didn't like about the story was that there needed to be proper explaination at the end. Overall, it is a good thriller drama which will keep you bounded till the end.",
      "review_date": "2021-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Can't beat this classic. My first and one of my favourite Hitchcock films. I've watched it many times and will most likely do so again",
      "review_date": "2020-09-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Film goes in crescendo, thanks to some great dialogues, plot and camera movement. It's unbelievable that this was made 67 years ago.",
      "review_date": "2021-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Story: 8/10...love the premise and the small container of in which the story plays out. One backyard shared by a dozen or so tenants. One week of action. One grand narrative with a few interesting side-narratives to make it interesting. OnlyStory: 8/10...love the premise and the small container of in which the story plays out. One backyard shared by a dozen or so tenants. One week of action. One grand narrative with a few interesting side-narratives to make it interesting. Only complaint is that it all wrapped up so quickly with a neat little bow on top. And Jeffries' paranoia and chauvinism is rewarded in the end. Blah.Dialogue: 9/10...funny, intriguing, with a deep sea of meaning hidden beneath the surface of the words.Performances: 8/10...basically a stageplay on screen, which delivered some pretty predictable stage-acting performances from several characters. Kelly and Stewart are phenomenal (Kelly especially), but the other characters all LOOK like they are acting.Misc.: 10/10...Hitchcock is just masterful with the camerawork, editing, score, lighting. All the subtle stuff you aren't supposed to notice isn't noticeable, which is what makes it noteworthy! Phenomenal directing.Overall: 9/10...a few parts age quite poorly, but it's clearly a masterpiece and the inspiration for so many single-set movies that followed in it's wake.",
      "review_date": "2021-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ",
      "review_date": "2021-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best murder mystery ever. Modern. Simple. Different. Way ahead of its time.",
      "review_date": "2021-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Best Movie of all Time.Hitchcock the best.James Stwart and everyone is great.",
      "review_date": "2022-01-11",
      "source": "metacritic"
    }
  ],
  "num_reviews": 55
}