{
    "title": "The African Queen",
    "rating": 7.3,
    "release_date": "1952-03-21",
    "genre": [
        "Adventure",
        "Drama",
        "Romance",
        "War"
    ],
    "summary": "In Africa during World War I, a gin-swilling riverboat captain is persuaded by a strait-laced missionary to use his boat to attack an enemy warship.",
    "critic_reviews": [
        "A film that has everything--adventure, humor, spectacular photography and superb performances.",
        "Bogart is hilariously crusty as a hard-drinking river rat who journeys downriver on a rickety steamer with a prim missionary (a flawless, lock-jawed Hepburn), trying to stay one step ahead of the Germans.",
        "This was a movie that respected its audience and respected its genuine desire to be well and intelligently entertained.",
        "A ripping, gripping yarn, a surprisingly erotic love story and, as it happens, a premonition of Herzog's Fitzcarraldo.",
        "As charming as the C.S. Forester novel on which it is based, The African Queen is top flight entertainment, delightful, different, always interesting. It is filled with excitement and adventure and sparked by superlative performances from Katharine Hepburn and Humphrey Bogart.",
        "An engrossing motion picture. Just offbeat enough in story, locale and star teaming of Humphrey Bogart and Katharine Hepburn to stimulate the imagination. It is a picture with an unassuming warmth and naturalness that can have a bright boxoffice chance",
        "A slick job of movie hoodwinking with a thoroughly implausible romance, set in a frame of wild adventure that is as whopping as its tale of off-beat love. And the main tone and character of it are in the area of the well-disguised spoof...Mr. Huston merits credit for putting this fantastic tale on a level of sly, polite kidding and generally keeping it there, while going about the happy business of engineering excitement and visual thrills.",
        "Bogart slyly draws upon his past performances here—men of weary-eyed cynicism and faded idealism—to give Charlie’s rudderless existence an extra-textual charge.",
        "Grand, propulsive.",
        "Credit should also go to the crew; to Jack Cardiff for his frond-filled imagery and maestro sound recordist John Mitchell for his atmospheric soundscape.",
        "With Huston spending most of the shoot big-game hunting, it’s probably cameraman Jack Cardiff who deserves kudos for turning this odd-couple romance into such a colourful escapade through east Africa.",
        "A perfect ensemble of cast, photography and screenplay are all subtly handled through Huston's direction, bringing out Bogart and Hepburn's performances beautifully.",
        "One of Bogart’s best acting performances. It shows his range – although having normally played an “alpha” character, here he is easily manipulated by the strong-willed Rose.",
        "The direction is often questionable, but the screenplay (by James Agee, John Collier, Huston, and Peter Viertel from C.S. Forester's novel) is a model of tight construction."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "So much fun.  Inspired casting of Bogart and Hepburn,  super funny comedy, thrilling adventure,  heart tugging romance,  eye filling photography all add up to total wow.  I've seen this sucker dozens of times, never fails to entertain.  Good times.",
            "review_date": "2019-09-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i just realized that Katherine Hepburn has a massive orgasm when they go over the falls.  it is even foreshadowed and afterwords they are in a flooded boat, and he says \"The skin's nice and tight.\"",
            "review_date": "2020-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Humphrey Bogart and Katharine Hepburn show their talent in the riveting adventure masterpiece.",
            "review_date": "2022-01-19",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 17
}