{
  "title": "4 Months, 3 Weeks and 2 Days",
  "rating": 7.9,
  "release_date": "2008-01-23",
  "genre": [
    "Drama"
  ],
  "summary": "During the final days of communism in Romania, two college roommates Otilia and Gabita are busy preparing for a night away. But rather than planning for a holiday, they are making arrangements for Gabita's illegal abortion and unwittingly, both find themselves burrowing deep down a rabbit hole of unexpected revelations. [IFC Films]",
  "critic_reviews": [
    "This year’s foreign language Oscar scandal – there is always at least one – is the snub of director Cristian Mungiu’s disturbing, masterful realist drama following two college roommates as they carry out plans for one’s black market abortion in Communist Romania.",
    "The film is bold stroke that hopes to push Romanian society forward by staring into the dismal failures of its recent past.",
    "Despite their terrible ordeal these women are heroes, not victims. As Mungiu makes clear in the casual, brilliant final scene of this amazing movie, heroes persevere.",
    "The New Wave of Romanian cinema is the most exciting in the world right now. 4 Months, 3 Weeks, and 2 Days is its latest masterpiece.",
    "Writer-director Cristian Mungiu confirms the Romanian cinema renaissance while creating a paradoxical marvel: a bleak tale of illegal abortion that powerfully affirms one's faith in people.",
    "The result is a mixture of unified atmosphere and lived-in character study, and while Vasiliu’s role is not as indelible as that of her co-stars, Marinca’s Otilia and Ivanov’s steely abortionist are just about perfect.",
    "This is a powerful film and a stark visual accomplishment, but no thanks to Gabita (Laura Vasiliu). The driving character is her roommate Otilia (Anamaria Marinca), who does all the heavy lifting.",
    "A grueling and deeply affecting human drama.",
    "In a truly great movie the form becomes indistinguishable from the story, and that’s certainly the case here.",
    "Without a single gunshot (and just one flick of a switchblade), it turns into an existential suspense film with the highest stakes imaginable: the survival of the human spirit.",
    "Brilliant, suspenseful, absolutely riveting film.",
    "Tense, kinetic, intelligent and real – as if Paul Greengrass had remade Vera Drake.",
    "One of the strongest movies in recent years.",
    "This is a film with a commitment to reality unlike any we're used to seeing.",
    "Pitch perfect and brilliantly acted, 4 Months, 3 Weeks & 2 Days is a stunning achievement, helmed with a purity and honesty that captures not just the illegal abortion story at its core but the constant, unremarked negotiations necessary for survival in the final days of the Soviet bloc.",
    "Though the frighteningly late-term abortion at its center hints at larger sins in the last gasp of Nicolae Ceausescu’s iron-fisted regime, it’s no metaphor, but a sordidly visceral transaction conducted in the next best thing to a back alley.",
    "Romanian writer-director Cristian Mungiu's brilliantly discomfiting second feature is one long premonition of disaster.",
    "You just don't expect Hollywood to produce a masterwork so early in the new year. And it hasn't. This slice of celluloid dynamite comes from Romania, and what you see will floor you.",
    "Nothing good happens in 4 Months, 3 Weeks and 2 Days, the riveting, horrifying chronicle of an illegal abortion performed in 1987 when Ceauescu's dictatorial hand still gripped Romania's throat. And yet no lover of greatness in filmmaking will want to look away from one of the very best movies of 2007.",
    "It’s a pitiless, violent story that in its telling becomes a haunting and haunted intellectual and aesthetic achievement.",
    "4 Months unfolds like one of those street-level Dardenne brothers movies (Rosetta, L'Enfant).",
    "A remarkably engrossing and thoughtful picture, beautifully rendered in an artful mode of realism.",
    "Elegantly crafted, brilliantly acted film.",
    "Anamaria Marinca delivers an utterly transfixing performance as Otilia, a young woman who helps a friend (Laura Vasiliu) obtain an illegal abortion in the waning days of Romania's communist Ceausescu regime.",
    "A beautiful and formally compelling work of art.",
    "The coup de grâce is especially graceless because everything we know is already visible in Marinca’s eyes. The actress is extraordinary.",
    "It is filmmaking as it should be but usually isn't.",
    "Depressing and gut-wrenching, but always powerful and gripping.",
    "Relentlessly dark but expertly rendered, it shares its cinematographer and quality of aggrieved compassion with another recent Romanian art house hit, \"The Death of Mr. Lazarescu.\"",
    "Despite being slow and deliberate, it is often compelling and occasionally riveting. As \"The Lives of Others\" was in 2007, this is the first memorable movie of 2008.",
    "A grueling film in both technique and subject matter.",
    "This is a tale of friendship, corruption, betrayal and desperation masterfully told without an ounce of filmmaking flash and with an unflinching commitment to realism.",
    "The film is dark, gloomy and without music, but it is also observant and highly suspenseful, with Mungiu using his often static camera to balance banal cruelty with simple generosity.",
    "Mungiu’s pacing is so sure, however, in its switching from loose to taut, and the concentration of his leading lady so unwavering, that the movie, which won the Palme d’Or at last year’s Cannes Film Festival, feels more like a thriller than a moody wallow.",
    "A curious filmgoing experience: Virtuosic, assured, and possessed of undeniable aesthetic force, it’s also hard not to turn away from.",
    "It makes \"The Death of Mr. Lazarescu\" and \"12:08 East of Bucharest,\" the last glum Romanian movies about life under dictator Nicolae Ceausescu, seem merry."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Powerful. Not a happy story by any account but a story of mis-guided friendship where there is no happy ending for the 'good one'. Its a dark novel brilliantly transformed to the movie screen.",
      "review_date": "2012-02-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't remember a movie where I cared so much about what I was watching.  Though it moves slowly and inconspicuously, it builds an incredible amount of momentum by the midpoint.  I found myself thinking \"please please let things work out forI can't remember a movie where I cared so much about what I was watching.  Though it moves slowly and inconspicuously, it builds an incredible amount of momentum by the midpoint.  I found myself thinking \"please please let things work out for these two girls\", as if they were good friends of mine.  And I'm usually overly critical and not easily drawn in.  It helps that Mungui manages to avoid a single false note in the entirety of the film with his direction.  Anamaria Marinca plays her very difficult role without a trace of self-pity.  This is a truly amazing movie that surprised me.",
      "review_date": "2012-04-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If this was awarded the #1 Best Movie, I can write off the rest of that year.  Perhaps there is a lot of politics behind that award and the high \"critical acclaim\" which distorts the rating.  The movie is dark and dull.  I'd rate it lower butIf this was awarded the #1 Best Movie, I can write off the rest of that year.  Perhaps there is a lot of politics behind that award and the high \"critical acclaim\" which distorts the rating.  The movie is dark and dull.  I'd rate it lower but I like films that have historical context, foreign cultures, and are in other languages.",
      "review_date": "2015-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If it was exactly August 31st, 2007, we would have exactly 4 months, 3 weeks, and 2 days before the release of this film. Exactly what a legendary film would bring us.",
      "review_date": "2016-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is one of the most powerful, shocking, realistic movies I've ever seen. It also somehow pulls off the impossible task of making a well-rounded argument about abortion without getting too political. That probably sounds insane, butThis movie is one of the most powerful, shocking, realistic movies I've ever seen. It also somehow pulls off the impossible task of making a well-rounded argument about abortion without getting too political. That probably sounds insane, but I swear it's true. If you are anti-abortion, you might leave this film with the belief that we need to legalize it completely. If you are pro-abortion, you will definitely find yourself second-guessing your beliefs, because this movie does revel in some gruesome imagery.The color scheme of 4 Months, 3 Weeks, and 2 Days is stunning. The cinematography and direction is immaculate. The acting is really great, and really hard to watch. I don't know if I'll ever watch it again because its so upsetting, but I am really glad I watched it. It can be slow at times, and that's not always a good thing, but this is a must-watch movie. I'd put it up there with works like Schindler's List or Twelve Years a Slave.",
      "review_date": "2020-02-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Tense, unexpected, interesting, good plot. Because I don't speak Romanian, difficult for me to know if the acting was ok or not, but it seemed good. Dialogue seemed good also from the subtitles.",
      "review_date": "2017-07-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La historia es interesante, pero la peli es muy lenta, como todas las de artes.",
      "review_date": "2019-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In this gut-wrenching drama, we are presented with a story that will shake your core, \"4 months\" thrives on realism, it doesn't spare us anything and will not shy from displaying the gruesome world we live in, it tackles what arguably is oneIn this gut-wrenching drama, we are presented with a story that will shake your core, \"4 months\" thrives on realism, it doesn't spare us anything and will not shy from displaying the gruesome world we live in, it tackles what arguably is one of the most controversial topics in modern society and it does it with an elegant polished style, the acting here was everything, the two opposite leads are just near damn perfect, the emotions and sentiments that they illustrate are breathtaking and so moving, so much so you find yourself majorly invested in what's gonna happen next. This is the brutal life-like cinema that I like. It offers a unique insight into a world so dark you can't take your eyes off it.",
      "review_date": "2019-10-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The neorealism and morbidity of of the subject might shy away some viewers, but everything about this movie is handled with such delicate care - the acting, the cinematography, the absence of a film score - that it really does suck you intoThe neorealism and morbidity of of the subject might shy away some viewers, but everything about this movie is handled with such delicate care - the acting, the cinematography, the absence of a film score - that it really does suck you into it's existence, forcing you to feel the hardships of living in a state of oppression. Moral of the Story: don't live in a place where abortions are illegal.",
      "review_date": "2010-08-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You keep expecting something to happen, but nothing Happens in this movie. The doctor makes an unusual request half way through the movie, and that is all.",
      "review_date": "2008-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Watch this movie for the perfect example of how to trick everybody into thinking your movie is good, without actually having to create an intelligent story. Just make it about a controversial issue, have a shocking proposal from a doctor toWatch this movie for the perfect example of how to trick everybody into thinking your movie is good, without actually having to create an intelligent story. Just make it about a controversial issue, have a shocking proposal from a doctor to two women halfway through, and show a human fetus to freak people out. Then everyone is so blown away that they're convinced it's because of the merits of the film. I wouldn't really call this a pro abortion movie. In fact, the fetus scene is like the videos of slaughterhouses they make to convince people to become vegetarians. Regardless of the stance it takes, it doesn't really go about it in a thought provoking way. The one thing I did appreciate was the idea that the one girl was willing to accept the doctor's offer for her friend. It was an interesting statement about friendships, although it's possible that that just happened by accident, and that the writer wasn't really even thinking of that. I will not reveal my opinion on abortion, but I don't think it matters. A weak script is a weak script. The movie is all about shock value, and people mistake that for decent writing.",
      "review_date": "2012-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A pointless waste of time unless you find watching a back alley abortion in Communist Romania to uplifting. I'm not anti-abortion, I just found the film to be a monumental waste of time.",
      "review_date": "2008-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How did this movie get such high reviews? I love foreign, art house, film noir but I just found this incredibly boring, slow and pretty slim on plot and dialogue. I just could not figure how many of the scenes even added to the overall How did this movie get such high reviews? I love foreign, art house, film noir but I just found this incredibly boring, slow and pretty slim on plot and dialogue. I just could not figure how many of the scenes even added to the overall theme, experience or anything. But glad the people who loved it loved it.",
      "review_date": "2010-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie is a drag, a slow, depressing movie that is surprisingly average for the reviews it has been getting. The only reason its been rated so high is because it deals with abortion and thats a politically hot topic right now. I am a fan this movie is a drag, a slow, depressing movie that is surprisingly average for the reviews it has been getting. The only reason its been rated so high is because it deals with abortion and thats a politically hot topic right now. I am a fan of these kind of subtitled foreign art movies, but 4 Months is not that amazing of a movie. Well made, but thats about it.",
      "review_date": "2008-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Painful to no real purpose, and often ineptly made to boot, this is a long, dark slog to nowhere. Sometimes the most dismal view isn't the most truthful, and this tortuous grim exercise in hopeless glum grit never gets at the humanity Painful to no real purpose, and often ineptly made to boot, this is a long, dark slog to nowhere. Sometimes the most dismal view isn't the most truthful, and this tortuous grim exercise in hopeless glum grit never gets at the humanity behind the gloom. Need an antidote to this ugly film? Check out the Czech cinema of the '60s, dark comedies that were humanistic yet truthful.",
      "review_date": "2008-03-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clearly, the reason that this film has such a high score from the critics is that it is a film made to entrance, to shock,and addressed directly to the liberal self reproach of the west world, and from the users because it receives massive Clearly, the reason that this film has such a high score from the critics is that it is a film made to entrance, to shock,and addressed directly to the liberal self reproach of the west world, and from the users because it receives massive votes from the Romanians, who are in a state that says every success outside the borders will uplift the image of our country. The film was very good technically, but if you analyze it a little bit it has NOTHING in stake, no ethical weight, no character deep study(mr. Bebe only seems real because he talks real but his actions are completely cartoonish and unmotivated) , and the girls are so common, so devoid of any ethical sense that i struggle to care for any of them. Plus, it?s more likely a short or a medium length movie, made a feature film by some pointless scenes.",
      "review_date": "2008-04-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the not just the worst movie I've ever seen, this is the worst movie ever made. this is also not hyperbole. This movie is all the proof you need that critics aren't real people, they're pompous idiots who sniff each This is the not just the worst movie I've ever seen, this is the worst movie ever made. this is also not hyperbole. This movie is all the proof you need that critics aren't real people, they're pompous idiots who sniff each others farts.",
      "review_date": "2009-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After having seen the rave reviews on Metacritic I decided to buy this film. Honestly, I'm at a loss as to what all the fuss is about! It seemed like the film never really got going, I couldn't connect with it, and, as other people After having seen the rave reviews on Metacritic I decided to buy this film. Honestly, I'm at a loss as to what all the fuss is about! It seemed like the film never really got going, I couldn't connect with it, and, as other people have said, not a great deal happens. Though not the worst film I've seen by a long-shot, disappointment was my main feeling, that and waiting for it to end...",
      "review_date": "2009-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To see this movie sandwiched between Pan's Labyrinth and Dr. Strangelove absolutely turns my stomach. this is movie is complete rubbish. do you want to watch nothing happen for 2 hours in a communist country in the 80s? watch it. its To see this movie sandwiched between Pan's Labyrinth and Dr. Strangelove absolutely turns my stomach. this is movie is complete rubbish. do you want to watch nothing happen for 2 hours in a communist country in the 80s? watch it. its not \"harrowing\" its not \"poignant\" it is, however, CRAP.",
      "review_date": "2010-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Exceptional acting and as a viewer you experience the emotions of the actors but not what I would call a \"thriller\".",
      "review_date": "2008-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Is this a joke! I have a 20 minute test and this film failed. i have no idea about what was going on and could actually care less. I read some of the other comments and cannot believe that realism is so compelling when it is totally boring and dull.",
      "review_date": "2008-11-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bill B. nailed it right on the head. Story is interesting but lacks a driving plotline. I expected a lot more given all the glowing reviews on metacritic.",
      "review_date": "2008-10-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oh my Gosh! This movie is linearly overrated, nothing in this is either thoughtful or interesting. I was clearly bored, with director and writer Cristian Mungiu running out of ideas once the first half hour passes. I am truly and Oh my Gosh! This movie is linearly overrated, nothing in this is either thoughtful or interesting. I was clearly bored, with director and writer Cristian Mungiu running out of ideas once the first half hour passes. I am truly and comprimisably letdown and disappointed, this is said to be a masterpiece. And its up for the Academy awards, BAFTA's, Golden Globes and many other red-carpet nominations. And I don't think this film doesn't deserve anything it is getting. 99/100!! That is negatively stunning, I had also found this film to keep on surpassing on poor storytelling, they didn't give a singly purpose or point to what is happening, and they needed to explain way more what was happening, I was confused half of the time. Anyway, I fell asleep a few minutes before the credits started because this just wasn't enjoyable whatsoever, and whatever mood I am in. For me, this blows, one of the year's worst films, in the top 10 for that.",
      "review_date": "2008-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "God awful. This is another independent movie that has the critics' panties all in a bunch. The reason it's terrible: nothing happens in the movie. It plods along with scenes of dialogue followed by more scenes of dialogue about the God awful. This is another independent movie that has the critics' panties all in a bunch. The reason it's terrible: nothing happens in the movie. It plods along with scenes of dialogue followed by more scenes of dialogue about the most mundane shit ever. Yeah, it sucks to be living in an oppressive Communist society. We get it. At least make it more interesting with a STORY or something. Acting is decent. The scenery and props are pretty good too; it's pretty drab and depressing looking which gives it atmosphere. Otherwise, a complete waste of time.",
      "review_date": "2009-07-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When it was over, we were glad the pain was over. But we were oh so confused how this movie received such a high rating. It was bad beyond English words (literally).",
      "review_date": "2008-11-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not a bad movie but by no means worthy of all it's praise. A woman gets an illegal abortion, end. Yet another instance where a taboo subject matter is confused for a compelling story.",
      "review_date": "2011-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Devastating movie. Besides the abortion plot. It's a movie about female friendship. Anamaria Marinca is amazing, Bravo!",
      "review_date": "2008-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I run a boutique cinema. This movie drew my smallest crowed of 2009. It was the only one I cannot remove from my mind, and I think the fact that it hasnt won an award reveals the hypocrisy of the Oscars. Harrowing and mundane in the same I run a boutique cinema. This movie drew my smallest crowed of 2009. It was the only one I cannot remove from my mind, and I think the fact that it hasnt won an award reveals the hypocrisy of the Oscars. Harrowing and mundane in the same breath. If you can get out of this film without white knuckles, you are made of strong stuff.",
      "review_date": "2009-10-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A powerful and great foreign drama, the cinematography in this picture is simply stunning, the acting faultless lead by the mesmarising Anamaria Marinca . When i know I've seen a great film is when i could watch it with no sound or A powerful and great foreign drama, the cinematography in this picture is simply stunning, the acting faultless lead by the mesmarising Anamaria Marinca . When i know I've seen a great film is when i could watch it with no sound or subtitles and it still has an effect on my emotions and i can safely say i could with this film, the location of this film was filmed perfectly to portray what life was like in 1987 romania, those who don't find the simplicity in this film capturing must have no heart. The only reason i didn't score it a 10 was because i didn't like the ending as much as the other parts of the film. I hope foreign cinema has some more delights like this up there sleeves.",
      "review_date": "2009-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the \"must see movie\" of all times.",
      "review_date": "2008-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was good, but I felt unsatisfied when it ended. I think it lacked a clear theme or message so am quite surprised to see it receiving a higher accolade than other superb foreign language films, such as The Lives of Others.",
      "review_date": "2008-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Strong in many respects, realism, consistent tone, acting, suspense, tension etc... However, the ending represented a HUGE misstep. [***SPOILER***] Within an hour after such a late-term abortion that woman would not be sitting down at a Strong in many respects, realism, consistent tone, acting, suspense, tension etc... However, the ending represented a HUGE misstep. [***SPOILER***] Within an hour after such a late-term abortion that woman would not be sitting down at a restaurant ordering dinner. she'd be lucky if she hadn't bled to death. completely unrealistic moment to an otherwise very realistic film.",
      "review_date": "2008-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is bleak--and that will put off many people. But don't let it put you off. This film is a strong experience--relentless tension. Admits that people make mistakes under pressure, which is difficult to watch. Above all, however, This film is bleak--and that will put off many people. But don't let it put you off. This film is a strong experience--relentless tension. Admits that people make mistakes under pressure, which is difficult to watch. Above all, however, the film rings true. And on the rare occasions this happens in cinema you have to confront the ideas of the film.",
      "review_date": "2008-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this is not a movie.its an experience.how can a movie be so real so grasping.........i do not envy as such but feels competitive with a person named mungiu.whole abservation of life is so deep and true.it comes from inner consciousness.ithis is not a movie.its an experience.how can a movie be so real so grasping.........i do not envy as such but feels competitive with a person named mungiu.whole abservation of life is so deep and true.it comes from inner consciousness.i firmly can claim this to be the most brilliantly acted and directed movie i have seen and i can see in future.the minute details are hard to understand by everyone.its unforgettable and matchless.no exxagaration but the truth.i cant see anyone could have done a performance like anmaria.its not \"acting\".its performance.this film is a must see for those who see",
      "review_date": "2008-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Only people that lived during that Romanian/Ceausescu era can understand this movie!Very well done and love the overall story.A+",
      "review_date": "2008-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well-made, but it's correct that the Academy didn't give it a \"foreign language movie\" nominee !!!",
      "review_date": "2008-03-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A little slow at first for my taste....but it drags you in and gets pretty intense!",
      "review_date": "2008-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was quite excited about seeing this movie, what with the fantastic reviews. And... I can't say I was disappointed, really. It had superb acting, and on the whole it was very well done. It was gripping, to the point that my friend and I was quite excited about seeing this movie, what with the fantastic reviews. And... I can't say I was disappointed, really. It had superb acting, and on the whole it was very well done. It was gripping, to the point that my friend and I were enthralled by every detail the film threw at us as we watched. The sad part is that, after all the thrills and the suspense and the drama, it didn't deliver. We wanted it to go in a Hollywood direction, we wanted that I.D. at the desk to mean something, for that little mention of a phone number to lead somewhere, but it didn't. It was comical, really, how much... MORE wanted. In any other film, this would have been devastating, but the incredible single takes and the emotion that the viewer couldn't help but feel along with the actors made it all too good otherwise. It's a worthwhile watch, just don't go into it expecting anything near your conventional film.",
      "review_date": "2008-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is frighteningly realistic rendition of life in the Eastern Bloc under communism. The awfulness of everything down to the clothes and the offensive drunk waiters make compelling viewing. Easily the best film I saw last year, and I saw This is frighteningly realistic rendition of life in the Eastern Bloc under communism. The awfulness of everything down to the clothes and the offensive drunk waiters make compelling viewing. Easily the best film I saw last year, and I saw Cargo 200!!!",
      "review_date": "2009-10-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't really know what to say about this film really. Right off the bat, you're probably wondering whether you should watch it, and yes, yes you most certainly should. The film itself is amazing, I just don't really I don't really know what to say about this film really. Right off the bat, you're probably wondering whether you should watch it, and yes, yes you most certainly should. The film itself is amazing, I just don't really understand why to be honest. Nothing really happens in it! But the acting, the emotions it makes you feel and several all factors help pull it through. It doesn't deserve the near perfect reviews in my opinion, but it still the best film I've saw in a while.",
      "review_date": "2009-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was easily one of the best films I saw in 2007. Clearly there is something stirring in Romanian cinema as '4/3/2' is another outstanding work for that country's burgeoning film scene.",
      "review_date": "2008-01-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "brilliantly acted! you can feel the tension and the lack of edited scenes brings you into the drama. the camera doesn't even exists, you don't feel it like a movie but like a fact, a scene happening in front of you. i'm not brilliantly acted! you can feel the tension and the lack of edited scenes brings you into the drama. the camera doesn't even exists, you don't feel it like a movie but like a fact, a scene happening in front of you. i'm not surprised it's a rewarded film. not recommended to youngs (they can't fully understand the scale of the event or sense the minor details).",
      "review_date": "2008-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In the end, this is an average movie, where not much (i.e. enough) happens. The story is mostly carried forward with constant and inane dialogue. A large portion of the conversations seem improvised. In the end this is a prototype of a movie In the end, this is an average movie, where not much (i.e. enough) happens. The story is mostly carried forward with constant and inane dialogue. A large portion of the conversations seem improvised. In the end this is a prototype of a movie that the critics love, but the average movie goer will remain ambivalent and indefferent over. Nevertheless, slow pacing and historically appropriate milieu do set a realistic and touching mood.",
      "review_date": "2008-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If Andrei Tarkovsky made a Dogma 95 movie, it might look and sound and feel like this. Cinematically, this is a masterpiece of artistic discipline, the perfect marriage of form and content, the freshest thing in years, a brand-new way to get If Andrei Tarkovsky made a Dogma 95 movie, it might look and sound and feel like this. Cinematically, this is a masterpiece of artistic discipline, the perfect marriage of form and content, the freshest thing in years, a brand-new way to get your truth twenty-four times a second, blah, blah, blah. . . .Dramatically, it does the last thing you expect from an issue movie: give you an engaging, realistic central character, so you forget about political abstractions and start worrying about what will happen to her and what she's going to do. This is a time capsule movie, a Voyager spacecraft movie, a great and perfect film that may all on its own redeem traditional narrative cinema for the next few years.",
      "review_date": "2008-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "[***SPOILERS***] I appreciate \"4 Months, 3 Weeks and 2 Days\" for its excellent craftsmanship: the artfully composed shots are worthy of a gallery exhibit; the stubborn refusal to cut away from certain scenes is brave and inspirational; and [***SPOILERS***] I appreciate \"4 Months, 3 Weeks and 2 Days\" for its excellent craftsmanship: the artfully composed shots are worthy of a gallery exhibit; the stubborn refusal to cut away from certain scenes is brave and inspirational; and the acting (or non-acting, it was so realistic) is sublime. Overall, I agree with the critics that \"4 Months\" is an uncompromising work of art. But the problem I have with \"4 Months\" are in the form of red herrings, and plenty of them. For example, when the brooding back-alley abortionist, Mr. Bebe, pleads with his mother to go back into her apartment, the tension mounts to where you think he's going to physically toss her inside. During this moment, in Mr. Bebe",
      "review_date": "2008-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Terrifyingly grey, as everyday life in communism, and exceptionally beautiful, as Otilia's friendship and unselfishness.",
      "review_date": "2008-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this is an involving and very moving film. highly recommended. to shaun b - you sound so pompus. firstly one film doesn't 'prove' anything, especially when your point of view is supposedly the evidence, and the filmthis is an involving and very moving film. highly recommended. to shaun b - you sound so pompus. firstly one film doesn't 'prove' anything, especially when your point of view is supposedly the evidence, and the film doesn't even reply to your silly sweeping statement about the french - the film is romanian.",
      "review_date": "2008-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've seen it three times already and enjoy it every time. Brilliant acting, image, camera work. The scenes with long moments of silence are my favorite. You can see here how powerful can be acting without saying anything.... Ana Maria I've seen it three times already and enjoy it every time. Brilliant acting, image, camera work. The scenes with long moments of silence are my favorite. You can see here how powerful can be acting without saying anything.... Ana Maria Marinca transmitted with her back at the camera things that many actors have to use face and words to do it.",
      "review_date": "2008-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "OK, this movie is very good, but it's not THAT good. A score of 98 would lead you to believe it's one of the best films to come out in the last 10 years, and it's not (I'm just trying to manage expectations). My main OK, this movie is very good, but it's not THAT good. A score of 98 would lead you to believe it's one of the best films to come out in the last 10 years, and it's not (I'm just trying to manage expectations). My main problem is the ending [no spoilers], which is a little abrupt and leaves several issues unresolved.",
      "review_date": "2008-02-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As good a film as any I've ever seen or expect to see again.",
      "review_date": "2008-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Felix K. This movie came out in 2008 how can the academy give this a foreign language nod when this movie came out in 2008. The Oscars are for 2007! that being said this was was very well made and beautiful film.",
      "review_date": "2008-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pure filmaking . Answer to all these kind of movies which sucrifice a good idea for an oscar.BRAVO Romania.",
      "review_date": "2008-04-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Some of the finest acting I have seen on film. Beautiful shots and not melodramatic. I have found nothing in it to falsify reality (1980s in Romania).",
      "review_date": "2008-06-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A powerful, disturbing film with amazing performances. You will feel sick to your stomach after watching this - which is an indicator of great filmmaking that draws you in forces you to face realities that you'll never be comfortable A powerful, disturbing film with amazing performances. You will feel sick to your stomach after watching this - which is an indicator of great filmmaking that draws you in forces you to face realities that you'll never be comfortable with. Easily the best film I've seen in many, many years.",
      "review_date": "2009-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For those who don't know yet (and I can see there are a lot in here) Romania IS/WAS NOT PART OF THE SOVIET UNION. Learn some geography before posting here, ok?",
      "review_date": "2009-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent movie, not for the light hearted, though. paradoxically enough, it is not really about what seems to be the main event: an abortion. Instead, it captures in a both subtle and gripping manner the essence of communism: a system Excellent movie, not for the light hearted, though. paradoxically enough, it is not really about what seems to be the main event: an abortion. Instead, it captures in a both subtle and gripping manner the essence of communism: a system corrupt to the bone that rules through fear, where everyone keeps an eye on someone else and the only way to survive is to become part of that system. The inherent dehumanisation such a system brings about does not escape the director.",
      "review_date": "2009-05-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the most compelling and heartbreaking films I've ever seen. It tackles the hard subjects of totalitarianism or abortion without beating you over the head with a given message. It simply tells the story of these two girls--a very One of the most compelling and heartbreaking films I've ever seen. It tackles the hard subjects of totalitarianism or abortion without beating you over the head with a given message. It simply tells the story of these two girls--a very sad one at that.",
      "review_date": "2009-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Filmgoers are so used to being spoon-fed their neatly shrinkwrapped \"takeaway\" messges from Hollywood that they flounder helplessly when a film staunchly refuses to tell them what to think.",
      "review_date": "2010-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie I have seen in years and the only 10 I have ever given",
      "review_date": "2008-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this is perhaps one of the finest european movies, one of the best of this decade along with cache, head on, the lives of others, hamble con ella etc. approaching Romania's recent traumatic history in a touching way without many this is perhaps one of the finest european movies, one of the best of this decade along with cache, head on, the lives of others, hamble con ella etc. approaching Romania's recent traumatic history in a touching way without many political references and inacuracies. a simple story of abortion, powerfully shot and performed with just a hint of historical reference...Romania 1987...pure art",
      "review_date": "2008-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I know it's only January, but I'd be surprised if any film is better than this one. The direction is superb and Anamaria Marinca gives a riveting performance. Do not miss under any circumstances. [Warning: There are some very I know it's only January, but I'd be surprised if any film is better than this one. The direction is superb and Anamaria Marinca gives a riveting performance. Do not miss under any circumstances. [Warning: There are some very graphic and realistic scenes relating to the abortion at the film's center]",
      "review_date": "2008-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Clearly overrated. In essence, this is a very well executed after school special. Proof that critics are often lemming like, and the French often confuse bleakness for art.",
      "review_date": "2008-01-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Perfect. Beautifully acted and crafted into a powerful experience. Bleak to the point of attempted suicide but throughly enjoyable.",
      "review_date": "2008-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent film, one of the best I've seen in a long time!",
      "review_date": "2008-02-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Powerful, stunning, honest, superbly crafted, with exceptional performances by the leads. The fact that it was snubbed for an Oscar nomination is as much of a disgrace as most of the critics say.",
      "review_date": "2008-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fearless, unflinching and harrowing. A true masterpiece.",
      "review_date": "2008-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Juno was a much funnier pregnant-girl movie. I like movies. In France it's called cinema, why is that different.",
      "review_date": "2008-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A truly work of art and deep thoughts. Poignantly acted and beautifully crafted to almost perfection. A must see!!!",
      "review_date": "2008-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "10+++. NO words.We can not run away from our reality.Outstanding sendingout emotions!",
      "review_date": "2008-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Both a true-to-life drama about life in Romania in the eighties and a tense thriller. Must-see.",
      "review_date": "2008-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've only one complaint. The movie is too slow to be a thriller, which is what it is marketed as. It is a truly masterful drama. The woman who plays Otilia is an extraordinary actor. Not since 2001: A Space Odyssey has the ending to a I've only one complaint. The movie is too slow to be a thriller, which is what it is marketed as. It is a truly masterful drama. The woman who plays Otilia is an extraordinary actor. Not since 2001: A Space Odyssey has the ending to a film been so devastating to me ! Very great film.",
      "review_date": "2008-04-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When planning a murder, always remember to bring a plastic sheet, to catch the blood, to leave without a trace. Patrick Bateman(Christian Bale) remembered his plastic sheet in Mary Harron's \"American Psycho\". Gabita (Laura Vasilia) When planning a murder, always remember to bring a plastic sheet, to catch the blood, to leave without a trace. Patrick Bateman(Christian Bale) remembered his plastic sheet in Mary Harron's \"American Psycho\". Gabita (Laura Vasilia) forgot hers, so she'll have to make do with a plastic bag. In our minds, we're thinking like Roy Scheider in \"Jaws\", as the bag is being laid out on the bed: You'll need a bigger... What if the bleeding doesn't stop? As is custom, we're worried that the woman won't survive the procedure. Most, if not all, of us, never consider the fetus, never give the unborn a second thought. But the film does, miraculously, without sanctimony. Catholic pedagogy doesn't make up our minds for us. It's our familiarity with genre conventions that does the trick. \"4 luni, 3 santamani, 2 zile\" stages the abortion, and more importantly, the aftermath, like a murder had just transpired. When Otilia(Anamaria Marinca) is pressed into action, remembrances of dead bodies rolled up in carpets from other crime movies, not that kind, old woman \"Vera Drake\", hit us square between the eyes.",
      "review_date": "2008-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Incredible piece of filmmaking. Now, I am no diehard movie fan, let alone an indie-film or foreign-film connoisseur; I am simply a fan of a sharp, brilliantly told and expertly conceived story. This movie offers that. Tremendous acting Incredible piece of filmmaking. Now, I am no diehard movie fan, let alone an indie-film or foreign-film connoisseur; I am simply a fan of a sharp, brilliantly told and expertly conceived story. This movie offers that. Tremendous acting surrounds a refreshingly simple plot. Stellar work about an important and still-relevant subject.",
      "review_date": "2009-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was an emotionally riveting, haunting film. The acting was extraordinary.",
      "review_date": "2009-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An excellent piece of foreign cinema. You can feel it slowly clasp onto you, then push you down to the ground. It leaves with you with an emotional feeling that is hard to find with movies.",
      "review_date": "2009-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not as great as it is rated, but watchable. Has some completely out of place grotesque violence. I didn't borrow this to see excessive violence (and neither would most people). You don't have to ruin what could have been a more Not as great as it is rated, but watchable. Has some completely out of place grotesque violence. I didn't borrow this to see excessive violence (and neither would most people). You don't have to ruin what could have been a more beautiful movie with a guys face been stabbed to nothing with a glass bottle. Poor judgment.",
      "review_date": "2009-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the depiction of a young woman having an abortion in soviet russia is a highly unusual and intriguing theme. the acting throughout the film is very well done although i still could not connect with this film, i found it quite boring at times the depiction of a young woman having an abortion in soviet russia is a highly unusual and intriguing theme. the acting throughout the film is very well done although i still could not connect with this film, i found it quite boring at times and i think something much more could be made out of it. it seems any films with the \"a\" word in them receive very high acclaim and i am worried that people are trying to be so politically correct that they feel they must give in and give films like this so much notoriety. over all impression is one of disappointment.",
      "review_date": "2008-11-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It feels like a perfect illustration of a story and the feeling you get while watching 4 months, 3 days and 2 weeks can only be described as identical to the electric, tense and addictive sensation of reading a superb book. It's justIt feels like a perfect illustration of a story and the feeling you get while watching 4 months, 3 days and 2 weeks can only be described as identical to the electric, tense and addictive sensation of reading a superb book. It's just amazing and once again just like your new favourite book - if it wernt for the worry that I may find it less enthrawling I'd go and watch it again.",
      "review_date": "2008-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wonderful!! Filmaking, storytelling, acting. This is what I'd call a true horror film, strongly connected to reality and deepest human nature introspection. The story is told in an implicit, but - at the same time - direct manner. This Wonderful!! Filmaking, storytelling, acting. This is what I'd call a true horror film, strongly connected to reality and deepest human nature introspection. The story is told in an implicit, but - at the same time - direct manner. This is a subtle and powerful film. It will follow you long after you left the theatre.",
      "review_date": "2008-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a fantastic film from start to finish, and I have to add that I doubt I'll see a better film than this the rest of the year. This will surely create a lot of discussion in the abortion debate, and I think the director is This was a fantastic film from start to finish, and I have to add that I doubt I'll see a better film than this the rest of the year. This will surely create a lot of discussion in the abortion debate, and I think the director is clearly not on one side or the other based on the ending. It's really a shame this wasn't one of the foreign film Oscar nominations. Although I have not seen them, I would be surprised if they are better than this. Oh, and Andy C, you are an idiot!!! Poor storytelling and they needed to explain more what was happening??? Huh? I really don't see what was confusing about the film at all. Maybe you should just stick to seeing Rambo or Hottie and the Nottie.",
      "review_date": "2008-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I went to this film expecting a masterpiece; I left the theater without such an experience. In short, the film drags at times, and definitely overrated in the emotions evoked to the audience. Excellent acting.",
      "review_date": "2008-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "glen f's comment comparing this film to Juno is hilarious! (\"Juno was a much funnier pregnant-girl movie.\") Best laugh I've had this week!",
      "review_date": "2008-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superbly performed gritty tale - but I learnt nothing from it, it was simply harrowing for its own sake, and didn't preoccupy my mind for long after its viewing. This film has very little to say.",
      "review_date": "2009-10-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beautifully written, \"4 months\" is easily in the top 10 of the year for great acting! I cant say anything that anyone else has said thats true about it, its clearly obvious the cast did a superb job. I can understand how some people find Beautifully written, \"4 months\" is easily in the top 10 of the year for great acting! I cant say anything that anyone else has said thats true about it, its clearly obvious the cast did a superb job. I can understand how some people find this film dull, its an acquired taste, its not some action Bruce Willis flick, its driven on emotion, treads on your nerves, and through it you will feel something real like i did, or you wont, as i said - its an acquired taste.",
      "review_date": "2009-10-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Polarizing film. my wife hated it . i really enjoyed the incredible acting and the directors bold use of stillness and silence. the 7 averages our impression.",
      "review_date": "2009-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Finally seen this and was not disappointed, my partners(romanian) tales of communist Romania were verified in this movie, it was gritty, commanding and masterful. that was life in Romania prior to the revolution in 89, they were the people Finally seen this and was not disappointed, my partners(romanian) tales of communist Romania were verified in this movie, it was gritty, commanding and masterful. that was life in Romania prior to the revolution in 89, they were the people and the movie is a true representation of Romania at the time.",
      "review_date": "2009-09-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A powerful and distubing tale set in Ceausescu's Romaina.How this wasn't even nominated for an Oscar is baffling.One of 2008's best movies.",
      "review_date": "2021-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "4 Months, 3 Weeks and 2 Days, Not more. Masterwork. I saw this movie 2 years ago. The internal coldness of this movie burned my bone marrow. It is still alive in a corner of my mind.",
      "review_date": "2022-12-02",
      "source": "metacritic"
    }
  ],
  "num_reviews": 124
}