{
  "title": "Gran Torino",
  "rating": 7.9,
  "release_date": "2008-12-12",
  "summary": "Retired auto worker Walt Kowalski fills his days with home repair, beer and monthly trips to the barber. The people he once called his neighbors have all moved or passed away, replaced by Hmong immigrants, from Southeast Asia, he despises. Resentful of virtually everything he sees--Walt is just waiting out the rest of his life. Until theRetired auto worker Walt Kowalski fills his days with home repair, beer and monthly trips to the barber. The people he once called his neighbors have all moved or passed away, replaced by Hmong immigrants, from Southeast Asia, he despises. Resentful of virtually everything he sees--Walt is just waiting out the rest of his life. Until the night someone tries to steal his `72 Gran Torino.  The Gran Torino brings his shy teenaged neighbor Thao into his life when Hmong gangbangers pressure the boy into trying to steal it. But Walt stands in the way of both the heist and the gang, making him the reluctant hero of the neighborhood--especially to Thao's mother and older sister, Sue, who insist that Thao work for Walt as a way to make amends. Though he initially wants nothing to do with these people, Walt eventually gives in and puts the boy to work fixing up the neighborhood, setting into motion an unlikely friendship that will change both their lives. (Warner Bros. Pictures)… Expand",
  "critic_reviews": [
    "A movie at once understated and radical, deceptively unremarkable in presentation and ballsy in its earnestness. Don't let the star's overly familiar squint fool you: This is subtle, perceptive stuff.",
    "Above all, it feels like a summation of everything he (Eastwood) represents as a filmmaker and a movie star, and perhaps also a farewell.",
    "Perhaps the best thing about Schenk's script is that it enticed Eastwood to end his self-imposed acting hiatus and bring his one-of-a-kind aura back to the screen.",
    "Mr. Eastwood is also an adept director of his own performances and, perhaps more important, a canny manipulator of his own iconographic presence.",
    "Eastwood finds the humorous aspects of the character as well, no more so than when the appetite of the widower who lives on beef jerky and Pabst Blue Ribbon becomes the center of attention among the Hmong women cooks.",
    "A lifetime in movies runs through this prime vintage Eastwood performance. You can't take your eyes off him. The no-frills, no-bull Gran Torino made my day.",
    "It's also a terrific, career-capping role for Eastwood, who claims he's now retired as an actor. He shows off his comic chops more fully than in any film since \"Bronco Billy\" more than a quarter-century ago.",
    "Stars Eastwood as an American icon once again -- this time as a cantankerous, racist, beer-chugging retired Detroit autoworker who keeps his shotgun ready to lock and load. Dirty Harry on a pension, we're thinking, until we realize that only the autoworker retired; Dirty Harry is still on the job.",
    "The movie is supremely entertaining -- and often hilarious.",
    "It's a meditation, as affecting as it is entertaining, on the limits of violence and the power of unchained empathy.",
    "The movie was not written for Eastwood, but it still seems to be all about him--his past characters, his myth, his old role as a dispenser of raw justice.",
    "If you can survive the F-bombs and the near-constant ethnic invective, Gran Torino is not to be missed, if only as the gutsy, thoroughly unexpected valedictory of an icon fully willing to spend every bit of his considerable capital.",
    "Simply terrific, enormously watchable and an absolute must for all Eastwood fans. Gotta say it: this film will make your day.",
    "An amazingly over-the-top anti-racism parable but, despite its obvious shortcomings, it is nevertheless effective and affecting.",
    "Eastwood directs with his usual relaxed pace and bursts of intensity, a style that's pleasing to watch--and which, also as usual, never fully compensates for any shortcomings of the script handed to him.",
    "Earnest and understated, Gran Torino is an unflinching examination of themes that have fascinated Eastwood in most of his recent films: family, war, loss, faith and unexpected human connection.",
    "For those who gripe that America doesn't make cars or movies like it used to, Clint Eastwood has two words for you: Gran Torino.",
    "This movie seems even rougher around the edges than much of his past work. Still, it's hard to resist.",
    "Gran Torino amounts to one more elegiac movement in Eastwood's astonishing late-career symphony.",
    "This is Eastwood's first acting job since \"Million Dollar Baby,\" and his range, like his raspiness, is fairly one-note.",
    "Highlighted by the star's vastly entertaining performance, this funny, broad but ultimately serious-minded drama about an old-timer driven to put things right in his deteriorating neighborhood looks to be a big audience-pleaser.",
    "Until Gran Torino starts rumbling headlong toward its tone-deaf, self-serious ending -- the script is by Nick Schenk -- it's often enjoyable, satisfying and funny.",
    "Eastwood's furthest venture yet into the comic possibilities of his flintier-than-thou persona.",
    "The movie is ludicrous, but Eastwood’s consistency is poignant. He has an agenda and sticks to it.",
    "Gran Torino is not a masterpiece. It’s a fun character drama that features a knowing but winning final performance by Clint Eastwood and just enough commentary to make it worth discussing.",
    "An endlessly fascinating movie. If only it were a good one.",
    "Eastwood has always had the gift for comedy in his acting repertoire, but he indulges in it only rarely. His fans might embrace this return to comedy.",
    "Eastwood's performance is the movie's centerpiece, and as you might expect, it's just tough enough to hold everything together.",
    "Eastwood's foursquare directorial aesthetic tends to heighten, rather than camouflage, a screenplay's shortcomings.",
    "Maybe this mixed-up and weird, awful but awfully likable movie is what Dirty Harry had coming to him, after all.",
    "Eastwood is still a primal force on-screen, but his unusual practice of shooting scripts as written, which served him well on \"Unforgiven\" and \"Million Dollar Baby,\" here leaves him exposed to Nick Schenk's familiar situations and awkward dialogue.",
    "Gran Torino skids into the narrative ditch. By the time it jolts to an ending, followed by Clint rasping a tune to the closing credits, you're more likely to be rolling your eyes than dabbing them.",
    "Nick Schenk's well-intentioned script employs the creaky old Hollywood device of reversing everything set up in its first half.",
    "It's no compliment to say a movie is \"all of a piece\" if the piece is all worn out. For all its surface harshness, this movie is a star vehicle at once rickety and cozy."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie has one of the most interesting main characters I have seen in a very long time, and if it didn't have that it would have gotten a much lower score from me. Eastwood's performance is amazing.",
      "review_date": "2010-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of his best movies yet.We need more movies like this its action and a few funny parts.As of always eastwood is a perfect actor he always gets the job done.",
      "review_date": "2013-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A film that speaks to the perceptual tensions humans face in the most significant of facets, and does so with such poise and audacity that the viewer can't help but adore. What compels \"Gran Torino\" to its bold of state is the lingeringA film that speaks to the perceptual tensions humans face in the most significant of facets, and does so with such poise and audacity that the viewer can't help but adore. What compels \"Gran Torino\" to its bold of state is the lingering emotive responses we feel from Eastwood, who merely from a glance, tells the story of life through the aged, piercing eyes that burrows inside of you, and demands of your notice. Visually, \"Gran Torino\" may appear to be an \"out-of-it's-prime,\" vintage piece of work, but the engine thrives and subdues its supposed insipidity to its previously prime state where its gritty demeanor flourishes.",
      "review_date": "2011-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved Gran Torino...Clint Eastwood was superb in his \"last\" role...I cried at the end and found it very moving. I agree that the Priest did not do a good acting job. He was very mis-cast.",
      "review_date": "2009-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a shame that most of the people can't realize this is not about \"gangster / redemption / retribution \", but well, like Lisa Schwarzbaum said: This is subtle, perceptive stuff.",
      "review_date": "2009-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unforgiven was a fabulous Eastwood film. Gran Torino is different but another of Clint's masterpieces. Poignant, funny, raw, emotional.. it has it all and so well.",
      "review_date": "2008-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It seems age has been a blessing for Clint Eastwood, giving him a marked perspective on life, which somehow seems to resonate with everyone (There is virtually no one I've talked to who hasn't liked the story in this movie). Combining thatIt seems age has been a blessing for Clint Eastwood, giving him a marked perspective on life, which somehow seems to resonate with everyone (There is virtually no one I've talked to who hasn't liked the story in this movie). Combining that with his talent as both a director and lifelong actor, he gives us one of his most powerful works - what he capitulates in poignant subtlety (Mystic River, Million Dollar Baby), he makes up for with dramatic bravado.",
      "review_date": "2010-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino may not be Eastwood's best but it sure ranks in the top 5. While watching the movie you may think the script is all contrived -- until the very ending.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was the Bomb! Clint Eastwood knows how to act... no doubt. Don't miss this movie, it will most likely be the last you see staring the great. A+",
      "review_date": "2009-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lot of potential, spoiled by reprehensible acting from everyone except Clint. I was laughing in parts where I really shouldn't have been laughing. But still enjoyable enough to earn a slightly passing grade.",
      "review_date": "2009-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastic and surprisingly emotional tale of a bitter old war-veteran and his Korean neighbors. Very well acted and surprisingly down-to-earth. It's got too much language in it for my preference, but it doesn't effect any of the emotionalA fantastic and surprisingly emotional tale of a bitter old war-veteran and his Korean neighbors. Very well acted and surprisingly down-to-earth. It's got too much language in it for my preference, but it doesn't effect any of the emotional merits of the film.",
      "review_date": "2011-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought it was a really good film. Eastwood has shown us all once again why he is still relivent in acting by giving a great performance that is a typical style that Eastwood has given us in the past.",
      "review_date": "2011-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "dude. whoever the hell gave this movie a bad review must be the dumbest **** i have may ever know.  this movie was perfect in every way.  and pete, **** u!! u have no idea wut ur talking about. u should walk right up to clint eastwood anddude. whoever the hell gave this movie a bad review must be the dumbest **** i have may ever know.  this movie was perfect in every way.  and pete, **** u!! u have no idea wut ur talking about. u should walk right up to clint eastwood and tell him what u just said,. and he will be sure to **** u up, u ****",
      "review_date": "2011-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino is gritty and gratuitous.\rA great script with a well paced plot. The believability is essential and it elevates the movie. A really good picture all around.",
      "review_date": "2013-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino is honestly one of the most touching movies I have ever seen. The best characters in any movie are those who lived long before the movie's setting, those are deep and fully experienced life. Clint Eastwood is great in this movie,Gran Torino is honestly one of the most touching movies I have ever seen. The best characters in any movie are those who lived long before the movie's setting, those are deep and fully experienced life. Clint Eastwood is great in this movie, he is honestly my favorite part of the movie and my favorite actor of all time. Despite, I can't give the movie a full rating because some of the acting is off, especially Walt's friend and the some of the gang, they pulled me out of the moment which was unfortunate.",
      "review_date": "2014-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my opinion, Gran Torino is a very respectable film by the legendary Clint Eastwood. A solid redemption story with good performances and a nice script filmed on location in Michigan, Gran Torino will definitely appeal to Eastwood fans,In my opinion, Gran Torino is a very respectable film by the legendary Clint Eastwood. A solid redemption story with good performances and a nice script filmed on location in Michigan, Gran Torino will definitely appeal to Eastwood fans, Michigan natives, and the Hmong people. Heck, I'd recommend anyone check this one out!",
      "review_date": "2018-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie directed and interpreted by Clint Eastwood. Gran Torino is absolutely a must see.",
      "review_date": "2018-07-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a while back since I saw this movie, but I know I loved it!The old grumpy grandpa (Clint Eastwood btw) who hates his greedy family and just wants to live out the rest of his days in his neighbourhood is part of a heartwarming andIt's a while back since I saw this movie, but I know I loved it!The old grumpy grandpa (Clint Eastwood btw) who hates his greedy family and just wants to live out the rest of his days in his neighbourhood is part of a heartwarming and heartwrenching story, which ultimately rewards merit and diligence and leads to a happy end (sort of). Sure, it's cheap in its narrative ways sometimes, but I can neglect that, for the story itself is actually pretty good.",
      "review_date": "2020-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Solid comedy/drama, if a bit corny and stilted at times.",
      "review_date": "2008-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino is maybe the best movie I have ever seen.  It is full of everything to pleasure both genders. I watched at my father's apartment with my sister. We all had a great time with this awesome movie. 10 out of 10 is not enough, so IGran Torino is maybe the best movie I have ever seen.  It is full of everything to pleasure both genders. I watched at my father's apartment with my sister. We all had a great time with this awesome movie. 10 out of 10 is not enough, so I will cheat and say 12 out of 10 :P",
      "review_date": "2010-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Decent performance from Eastwood but really nothing new at all in the gangster / redemption / retribution themes the movie throws up.",
      "review_date": "2009-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie painted a perfect picture of how people are nowadays.It was a masterpiece, the slamming on foreign cars especially was great. Anyone giving this movie a low score probably did so because the movie made them realize they fit into This movie painted a perfect picture of how people are nowadays.It was a masterpiece, the slamming on foreign cars especially was great. Anyone giving this movie a low score probably did so because the movie made them realize they fit into one of the groups being heckled the whole time.",
      "review_date": "2009-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A really good and heartfelt movie. Even though the acting may seem stiff, it felt real. Not that over dramatic type deal. If the movie was enough to make me tear up then yes what a great movie it is. People who've given bad reviews A really good and heartfelt movie. Even though the acting may seem stiff, it felt real. Not that over dramatic type deal. If the movie was enough to make me tear up then yes what a great movie it is. People who've given bad reviews don't deserve to be critics. They don't even know what a good movie is, even if it smacks em right in the face.",
      "review_date": "2009-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just echoing the sentiments of some other voters: poor acting by the young cast members; unbelievably fast bonding between ardent racist Walt and his Hmong neighbors; cliched situations used to create conflict; blatant exposition at times Just echoing the sentiments of some other voters: poor acting by the young cast members; unbelievably fast bonding between ardent racist Walt and his Hmong neighbors; cliched situations used to create conflict; blatant exposition at times (such as when Walt talks to himself in the mirror about how much he has in common with the Hmong--he may as well just turned to the camera and spoke the line to the audience). And his singing at the end seals this raw deal. Don't believe the hype, as they say. It's just average at best.",
      "review_date": "2009-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Eastwood playing Eastwood......and not very well. His facial expressions limited to a scowl and and grrr. The supporting cast, ostensibly Hmong natives, would have made most high school theatricals look good. All the Hollywood tropes are Eastwood playing Eastwood......and not very well. His facial expressions limited to a scowl and and grrr. The supporting cast, ostensibly Hmong natives, would have made most high school theatricals look good. All the Hollywood tropes are dragged out: an embittered veteran lovable enough for neighbors and priests to seek his redemption, despite being constantly insulted by his racial and religious slurs. The ending everyone expects in an Eastwood movie has a twist, which some may find moving but I thought was contrived and implausible. The best laughs came out of the racial slurs....the audience howled....which makes me wonder about us in this age of Obama.",
      "review_date": "2008-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's Eastwood direction, but it's no Eastwood film that I want to own, or even recommend. The Hmong theme is utterly replaceable with any struggling race in terms of gang violence and identity, and does very little to highlight It's Eastwood direction, but it's no Eastwood film that I want to own, or even recommend. The Hmong theme is utterly replaceable with any struggling race in terms of gang violence and identity, and does very little to highlight Hmong cultural value -- in fact, one of the film's unintentional jokes is that it summarily dismisses the Hmong as \"just more Asians\", and even fails during its expositional scenes to convince anyone of more than what's already commonly known: the Hmong fought with us more than 30 years ago, and were supplanted to places like Wisconsin in following decades as refugees. So, anyone under 30 might walk away with some new superficial knowledge, but don't expect them to swallow the tired race theme -- political correctness and inverseness have BOTH been declared dead by succeeding generations. Audiences over 30 might laugh longer and harder at the endless racism, but what's the value there? And why has nobody attacked the appallingly poor acting in the younger actors? This would be summarily thrown out if it had been directed by anyone else -- even anyone known.",
      "review_date": "2009-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "All I can say is Clint Eastwood is a legend but legends can make make mediocre movies too. Case in point, Gan Torino, only wish the reviewers had the guts to admit this, instead of acting like fanboys and praising everything Clint Eastwood does.",
      "review_date": "2008-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I simply cannot understand why this movie has garnered such favorable reviews from both critics and fans. It is one of the most ham-fisted pieces of dreck I've ever seen. Do you find it insulting to have the plot spoonfed to you? Would I simply cannot understand why this movie has garnered such favorable reviews from both critics and fans. It is one of the most ham-fisted pieces of dreck I've ever seen. Do you find it insulting to have the plot spoonfed to you? Would you rather watch actors act, rather than have the character development firehosed down your throat in the first 5 minutes? Did you feel manipulated after you watched 'Million Dollar Baby'? You'll hate this one too. Someone needs to revoke Eastwood's lifetime pass.",
      "review_date": "2009-02-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Giving this movie a 1 was generous, but I thought they deserved a point for working out how to turn the camera on! The first movie I have ever walked out on; the lack of strength in plot, sceenplay, or acting was cringe-worthy at best.",
      "review_date": "2009-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Contrived writing, poor acting and terribly paced. An overall disappointment. Eastwood has consistently been one of the most generous and rewarding directors in Hollywood for some time, but this trite is the sort of stuff that unfortunately Contrived writing, poor acting and terribly paced. An overall disappointment. Eastwood has consistently been one of the most generous and rewarding directors in Hollywood for some time, but this trite is the sort of stuff that unfortunately stains a career. The only clever, endearing, and ultimately redeeming part of this film is its ending, but it can only pack so much punch. And any force it had was totally suffocated by the embarrassing exitlude sung by Eastwood himself.",
      "review_date": "2009-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Give me a break, this movie stinks. Probably the most overrated movie I remember seeing in the theaters. What's the worst part about Gran Torino? The acting, story line, script, director, characters...take your pick.",
      "review_date": "2009-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I just don't understand movies nowadays. The movie was terrible. The story line was horrible. The acting was a joke. This movie was horrendous.",
      "review_date": "2009-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow, all these 10's?!? This movie was average at best. It was better than Eastwood's \"Blood Work\" movie but besides that i was not that good. The acting was terrible (yes, I know all the Hmong's were first-timers) and the Wow, all these 10's?!? This movie was average at best. It was better than Eastwood's \"Blood Work\" movie but besides that i was not that good. The acting was terrible (yes, I know all the Hmong's were first-timers) and the story was boring. And I've heard from everyone that it had a bunch of laugh's in the film...The only time everyone laughed in the theatre was when he dropped one of his 568 racial slurs in the film. Its just a movie full of the slurs; gooks, fish-heads, swamp-rats, japs, zipperheads...I can't even remember them all. I shook my head coming out of the theatre after seeing caucasians already laughing and repeating those degrading slurs against Asians. ...I was going to give it a 0, to try and even it up but a 5 is what it deserves. Erase all the slurs and it still is only a 5. Overhyped!!",
      "review_date": "2009-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not nearly as good as all the hype. Forced dialogue, bad acting, contrived writing",
      "review_date": "2009-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "All the previous comments by \"3 or less\" pretty much sum it up. I told my wife I wish I could have those 2 hours back. What a waste of time.",
      "review_date": "2009-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible!!! The acting was terrible, Eastwood was over the top, several times growling as if he was going to \"hulk\" out, the racial slurs really got old by the second half. The story felt like a hallmark tv movie.",
      "review_date": "2009-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We all love Clint, but he should have made a better choice to showcase his acting skills. This movie is the work of a first-time screenwriter, and it shows. It is often amateurish, cliched, and sentimental. I've seen better made-for-TV We all love Clint, but he should have made a better choice to showcase his acting skills. This movie is the work of a first-time screenwriter, and it shows. It is often amateurish, cliched, and sentimental. I've seen better made-for-TV movies. Some good moments, yes, but overall it is a big disappointment. Clint--you can do better!!!",
      "review_date": "2008-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The acting was forced. The only natural sounding actor in the movie was Clint Eastwood. The message was ham-fisted and flat out handed to audiences at the end. The script was incredibly contrived.Overall, I felt that movie suffered from anThe acting was forced. The only natural sounding actor in the movie was Clint Eastwood. The message was ham-fisted and flat out handed to audiences at the end. The script was incredibly contrived.Overall, I felt that movie suffered from an unfortunates messiah complex and was unintentionally racist. An white, angry, growling old man has to save everyone else because they can't take care of themselves.",
      "review_date": "2010-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The two Asian siblings' acting is a joke. Paris Hilton could probably out-act them. They make the movie very hard to watch.",
      "review_date": "2009-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The grand lesson of this movie is that the way to really defeat evil people is to allow them to kill you. Because maybe, just maybe, they might have to spend a few years in prison--boy that will teach 'em! This movie is the ultimate The grand lesson of this movie is that the way to really defeat evil people is to allow them to kill you. Because maybe, just maybe, they might have to spend a few years in prison--boy that will teach 'em! This movie is the ultimate result of a culture that has become completely pacified and sissy-fied. It was a good movie up to the end. It made some valid commentary on our over-offended society (friends throw ethnic insults at each other without getting offended--unthinkable!). I love Clint Eastwood as an actor, but he has completely sold out to this pacifist mentality--the best way to teach bad people a lesson is to let them hurt you.",
      "review_date": "2009-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clint is playing the John Wayne card by doing his Dirty Harry routine. It's tedious to a degree yet nonetheless entertaining if you let go of any expectation of artistry he shows in his non-starring vehicles. He's a great director Clint is playing the John Wayne card by doing his Dirty Harry routine. It's tedious to a degree yet nonetheless entertaining if you let go of any expectation of artistry he shows in his non-starring vehicles. He's a great director but his acting is really stiff.",
      "review_date": "2009-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen",
      "review_date": "2009-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For all the people trashing this film, you obviously can't see any of the moral of greater idea of this movie. It wasn't poorly written of directed, if you go looking for things to hate you'll find them. This was a great movie.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Can just say wow? I would;ve given this an 8 or nine, but it ticks me off that people give these movies 3's and 0's when they really don't deserve a score that low",
      "review_date": "2009-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Now that was just awesome.",
      "review_date": "2009-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Highly disappointing. Slow and poorly written. Basically a sermon on \"kids these days\".",
      "review_date": "2009-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seriously? A Best Picture contender. You're kidding, right? Really. A Best Actor nomination for Clint. Come on, for Gran Torino? Where he plays that Archie Bunker guy who growls more than Learch and puts the fear of God in every ethnic Seriously? A Best Picture contender. You're kidding, right? Really. A Best Actor nomination for Clint. Come on, for Gran Torino? Where he plays that Archie Bunker guy who growls more than Learch and puts the fear of God in every ethnic gang in Detroit by his mere old white man presence, that Gran Torino? Seriously Clint, it's time to put Dirty Harry to bed. Oscar? Only if they award one for Best Achievement In Cliche!",
      "review_date": "2009-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very interesting movie, and the end was a real shock to me. The only thing that keeps me from giving in a ten is Clint's portrayal of that mean old man: nobody is that mean and full of dieased, racist blather. He carries on that bit for Very interesting movie, and the end was a real shock to me. The only thing that keeps me from giving in a ten is Clint's portrayal of that mean old man: nobody is that mean and full of dieased, racist blather. He carries on that bit for way too long, and should have dropped it the minute the Hmong girl (the best character in the film, for me) got in his truck. And it's unlikely that anyone would carry war atrocity guilt for so long. Otherwise, it was a fine film, and it was fun to see the Hmong families together. We really did mess up the lives of so many people over in SE Asia; the least we can do is show them some respect. Hey, I know, I know, this is just a movie, but you know what I mean.",
      "review_date": "2009-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the best movies I have seen in a long time.",
      "review_date": "2008-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This plays like a MADTV parody of Clint Eastwood. Still gets a 2 because I enjoyed laughing at the poorly executed cliches.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent entertainment value. Timely theme, well-directed, humorous yet with some sober universal values -- kind of like President Obama's Inaugural speech.",
      "review_date": "2009-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Someone ought to file a lawsuit for plagiarism. The whole film was practically copied from Alan Smithee's collective works, the Ultimate Anthology of Prosthetic Plot Points. If you like your drama spoon fed to you with a predictability Someone ought to file a lawsuit for plagiarism. The whole film was practically copied from Alan Smithee's collective works, the Ultimate Anthology of Prosthetic Plot Points. If you like your drama spoon fed to you with a predictability factor running off the scale and if you can stand Eastwood doing a poor grizzly imitation while impersonating a fossilized plank of wood throughout the entire film, I guess this movie is for you. I guess the joke's on the fan boys again.",
      "review_date": "2009-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Movie of the year. Awesome movie, with some of the best character development I have seen in some time.",
      "review_date": "2009-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The subtleties crafted in this film are profoundly complex and with out the ability to see them this will seem like a \"waste of time\". But with the proper amount of intelligence, chances are you may find yourself moved and challenged in the The subtleties crafted in this film are profoundly complex and with out the ability to see them this will seem like a \"waste of time\". But with the proper amount of intelligence, chances are you may find yourself moved and challenged in the most sincere ways. When movies like this come around, I think they should be celebrated. And if not by the Academy, by those who matter... us.",
      "review_date": "2009-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Slow pacing, poor acting and an unbelievable script make this film bad enough, but the continued suggestion that casual racism is acceptable if the other person accepts it \"good natured banter\" beggars belief.",
      "review_date": "2010-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clint starts off in fine acerbic form as Walt, a malcontented Korean War vet with neighbour problems, but regrettably the film rapidly descends into homily, cliche and downright implausibility. Gasp as Walt discovers his softer side! ChuckleClint starts off in fine acerbic form as Walt, a malcontented Korean War vet with neighbour problems, but regrettably the film rapidly descends into homily, cliche and downright implausibility. Gasp as Walt discovers his softer side! Chuckle at the chutzpah of the young girl confronting three would-be rapists with wisecracks and her irascible neighbour with cheeky repartee! Marvel as the impossibly baby-faced priest becomes Walt's confidante in a last minute schmaltzy reconciliation between Walt and his long-lost faith!Extra half a star for \"Click Clack, Ding Dong and Charlie Chan\", though. Funny when he was being mean, saccharine when he wasn't, and impossible to reconcile the two.",
      "review_date": "2011-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino is a decent film for watching if you're bored, but if you're expecting something completely immersive and gripping, you will be disappointed. There's no action or significant events really, and the entire plot can be summarised inGran Torino is a decent film for watching if you're bored, but if you're expecting something completely immersive and gripping, you will be disappointed. There's no action or significant events really, and the entire plot can be summarised in about 20 seconds. There aren't any unnecessary parts in the film which are unrelated or pointless, but character development isn't as good as it could be and overall the film is a bit too long and thin on content. The whole film takes place within a few meters, as just bout the entire film is all in one house and a street. The problem with Gran Torino is that there's no real emotion during the film. No excitement. The entire film is quite bland; although it does manage to keep you watching it all the way through. Its only redeeming feature is the occasional comical scenes.",
      "review_date": "2013-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, this left me disappointed. The Hmong actors were **** terrible. Specially that Toad guy, him screaming to get out of the basement at the end was laughable. \"Walt! Waaaaaaaalllllt!\" Cmon, that was just the worst scene in the movie. AndWell, this left me disappointed. The Hmong actors were **** terrible. Specially that Toad guy, him screaming to get out of the basement at the end was laughable. \"Walt! Waaaaaaaalllllt!\" Cmon, that was just the worst scene in the movie. And how the hell could a **** like him even have a driver's license to drive the Gran Torino? It was inexplicable.It was strange, this film was trying to show us to be nicer to our neighbors and more accepting of foreign cultures... but then they go out of their way to show us that the Hmong are really weird and freaky. Like... no touching the tops of people's heads? An actual **** voodoo witch doctor? Cranky old woman spitting out a bunch of weird brown fluid? But hey, it's all good cause their food's really tasty, right? Right? Heh...The padre was just annoying me throughout the entire film. Not badly acted, but his character just came off as a sanctimonious prick. Mission accomplished if that was what they were aiming for.Clint was good as usual. But that ending... just didn't work for me. I know they were setting us up for a more traditional ending and then went for an unorthodox approach, but still... I wanted that traditional ending. Instead, they gave us Walt committing suicide, essentially. Very disappointing ending.",
      "review_date": "2011-09-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Naysayers be damned, great movie. The reality, as one poster pointed out, is that spoiled teens and their spoiled parent's would probably not appreciate the calling out that they receive in this movie, everyone else (who has a sense of Naysayers be damned, great movie. The reality, as one poster pointed out, is that spoiled teens and their spoiled parent's would probably not appreciate the calling out that they receive in this movie, everyone else (who has a sense of humor) will love it.",
      "review_date": "2009-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing performance by Clint Eastwood, and it astounds me that even as old as he is, he can still make a 20 year old mucle-head piss his pants out of pure bad-assery.",
      "review_date": "2009-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "They stopped makin' movies like this 'round 1977. deeply affecting.",
      "review_date": "2009-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastically worked critique of modern American society. One of the best films i have seen in ages. Eastwood is typically brilliant as both actor and director. There is a reason he came back to acting this film is brilliant.",
      "review_date": "2009-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Classic Eastwood...gritty portrayal of current urban existence.",
      "review_date": "2009-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great performances. Great pace. Classic Eastwood ending, as always.",
      "review_date": "2009-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was one of the best yet in the last 3 years that I have seen. The thing of this movie that struck me as memorable is that so many people in the midwest are similar to Mr. Kowalski rough on the surface and so good hearted This movie was one of the best yet in the last 3 years that I have seen. The thing of this movie that struck me as memorable is that so many people in the midwest are similar to Mr. Kowalski rough on the surface and so good hearted underneath. Anyone that wants to know what the midwest is about just watch this movie and it will give you a glimpse of reality. Thank you Clint for your incredible performance and direction.",
      "review_date": "2009-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just about the time the joke gets old the movie shifts gears. Overall a respectable movie that deserves a look on the big screen. I was surprised. BTW, Clint gets a 4 for his song during the credits.",
      "review_date": "2009-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clint's in a league of his own. If this was his last movie he went out with his boots on. Certainly deserving of all the praise it is getting. Perhaps Hollywood should take some lessons on acting and directing from Clint. Excellent.",
      "review_date": "2009-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its only shortcoming was the irony of life and a shortage of good young actors.",
      "review_date": "2009-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I expected this move to be a Dirty Harry retread. I certainly starts that way but becomes something else. There is too many racial slurs and exaggerated \"man to man\" swearing. This movie is far from perfect but Clint pulls it off. It good to I expected this move to be a Dirty Harry retread. I certainly starts that way but becomes something else. There is too many racial slurs and exaggerated \"man to man\" swearing. This movie is far from perfect but Clint pulls it off. It good to see Detroit neighborhoods as they truly are. Poor and run down but people keep trying to live there.",
      "review_date": "2009-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This typical Clint Eastwood film exceeded my expectations of a horrible\"shoot 'em up\" movie. Some parts of the movie really made me want to meet Walt (Clint Eastwood). Over all this movie gets a firm 9/10 from me.",
      "review_date": "2009-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie. While there is plenty of \"offensive\" language, the overall theme of the movie is an old man, set in his ways, who fought asians earlier in his life, and so was unhappy with them moving into his neighborhood. As the movie Excellent movie. While there is plenty of \"offensive\" language, the overall theme of the movie is an old man, set in his ways, who fought asians earlier in his life, and so was unhappy with them moving into his neighborhood. As the movie progresses, he not only lays down the law to one of the local gangs, brings many laughs to the audience (some so rapid that you miss a second or third joke while still laughing at the first) and leaves you genuinely enjoying your time spent watching, but grows to have an understanding and appreciation for their culture. Unfortunately, the movie's namesake makes hardly an appearance, and doesn't play a significant role in the storyline. A shame, because (while not my favorite classic muscle car) it's a gorgeous machine that does indeed demand a bit of respect and appreciation. Very good movie. An excited 10 rating. Watched it twice so far, and will be buying the DVD as soon as it's out.",
      "review_date": "2009-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Gran Torino\" is a near-miss for Clint Eastwood: by far his best film of the year, but far from \"Letters from Iwo Jima\" or \"Million Dollar Baby,\" which not only are more realistic than this surreal and borderline stereotypical representation \"Gran Torino\" is a near-miss for Clint Eastwood: by far his best film of the year, but far from \"Letters from Iwo Jima\" or \"Million Dollar Baby,\" which not only are more realistic than this surreal and borderline stereotypical representation of race-relations and family-ties, but also pact a more profound umph - that feeling you get when you've actually learned something - than what is ever revealed of Walt.",
      "review_date": "2009-02-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Incredibly powerful, both humorous and moving at the same time. One of the best films I've seen in a long time.",
      "review_date": "2009-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Was very surprised because the trailer made it look like Deathwish or something. I wasn't ready for how funny it was. Then, the last third of the movie became sort of an urban western. Really great and understated film - 10 of 10!",
      "review_date": "2009-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Eastwood is cool. Movie made me cry.",
      "review_date": "2009-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely amazing film. It's probably my favorite movie this year, if not of all time.",
      "review_date": "2009-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great Movie. I would give it a ten. Great action, plot, acting, etc. I would have nominated this movie for best picture. It is my third favorite film last year. My other two favorites were The Dark Knight and Slumdog Millionaire. The other Great Movie. I would give it a ten. Great action, plot, acting, etc. I would have nominated this movie for best picture. It is my third favorite film last year. My other two favorites were The Dark Knight and Slumdog Millionaire. The other two movies I would have nominated for Best Picture are Iron Man,and the Changeling, followed by Doubt. You have to see this movie. Whoever didn't like this movie, no affence, but flat out, is just an idiot or has very poor taste in movies! See this movie!!!",
      "review_date": "2009-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie had so much potential; a great storyline, excellent plot development and a dramatic and touching ending. However all of this could not make me overlook the absolutely horrible acting in this film. Clint Eastwood might as well have This movie had so much potential; a great storyline, excellent plot development and a dramatic and touching ending. However all of this could not make me overlook the absolutely horrible acting in this film. Clint Eastwood might as well have played all the parts himself, Eddie Murphy-style.",
      "review_date": "2009-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clint Eastwood's direction makes this film work. It is too overstated, but it's a film that you can't help but admire and like. Great performances all around, and it's well written and very moving.",
      "review_date": "2009-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Surprisingly thoughtful and hopeful in cracking the fault lines between the races and what people fear they don't like or don't know. Cheers to Mr Eastwood for this great film",
      "review_date": "2009-07-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is one of the best films I've seen in years. This is plain and simply a masterpiece made out of a plot that a 10 year old could have written. And that, I have learned, is what separates the true moviemakers from the wannabes.",
      "review_date": "2009-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is definantly in my top 10 of favorite movies. You would think that it would be all about Walt, our hero, being a tough guy, but that isn't the case. While Clint does sport his usual hard outer shell, you also get to see hisThis is definantly in my top 10 of favorite movies. You would think that it would be all about Walt, our hero, being a tough guy, but that isn't the case. While Clint does sport his usual hard outer shell, you also get to see his humerous side and, even more importantly, his soft side. Granted, at the beggining the movie doen't seem like much, the middle and ending is what puts it over the top. The relationships Walt forms and how he deals with a gang troubled young teen is what makes this movie spectacular. The plot twists will have you questioning humanity. Yes it does have some good action but that isn't really the purpose of the movie. And for those of you wary of this movie because of racism, don't worry, Walt insults all the major ethnicities (Asians, Mexicans, Jews, Blacks, etc.) so no one is left out. He hates (almost) everyone equally.",
      "review_date": "2009-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen",
      "review_date": "2010-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gran Torino is the best film of the year and Eastwood's performance is one of the best of all times.He must win the oscar for best actor this year.",
      "review_date": "2008-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very entertaining film, which is the reason I go to the movies. Great dialog, a lot of different emotions from humor to sadness. A subject a lot of people probably can relate to if they live in a large city. Eastwood continues to amaze with Very entertaining film, which is the reason I go to the movies. Great dialog, a lot of different emotions from humor to sadness. A subject a lot of people probably can relate to if they live in a large city. Eastwood continues to amaze with the quality of films he puts out.",
      "review_date": "2008-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clint Eastwood is excellent in portraying a character you really come to know well and care about.",
      "review_date": "2008-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best Movie of the Year! A must-see!! I thoroughly enjoyed this film. The racial humor makes you laugh throughout, and the characters have a good on screen rapport that draws you into the story. Very entertaining!",
      "review_date": "2009-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Suprisingly funny, mabey a bit cliched but I enjoyed it! It ends sadly and reminds me that this may be Clints last movie, a sad thing indeed.",
      "review_date": "2009-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My boyfriend & I go see movies all the time. I am hard to please when it comes to movies...and this movie was one of the best movies I have seen in a long time. It has a great plot and well worth the time & money!",
      "review_date": "2009-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story. Clint still has what it takes. Perfect movie for a 78 year old Dirty Harry.",
      "review_date": "2009-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow...this film made it to my top 10 list of favorite movies, ever! Aside from a bit of bad acting here and there by the newcomers, I absolutely loved it! Gripping, touching and very emotional...a Do Not Miss movie!",
      "review_date": "2009-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found this movie experience to be emotionally draining. No one but Clint Eastwood could have played his role as Kowalski. And it wasn't all tense and somber - there were lots of laogh out loud momemts, which made Kowalski even more I found this movie experience to be emotionally draining. No one but Clint Eastwood could have played his role as Kowalski. And it wasn't all tense and somber - there were lots of laogh out loud momemts, which made Kowalski even more endearing. Highly recommended!",
      "review_date": "2009-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quite frankly, I think this film is highly overrated. Eastwood gives a fine performance. But it's another hum-drum tail of aging man who is mad at life miraculously developing an unlikely friendship with Joe Blow. Walt Kowalski goes Quite frankly, I think this film is highly overrated. Eastwood gives a fine performance. But it's another hum-drum tail of aging man who is mad at life miraculously developing an unlikely friendship with Joe Blow. Walt Kowalski goes from Ivan the terrible to Mother Theresa in a matter of days. How many times can you hear the work \"gook\" and \"slope eye\" before it just starts to grow old. Not a horrible film, but wait until you can watch it cheaper than $10.50.",
      "review_date": "2009-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such and wonderful and powerful movie. Funny and touching all at the same time. Clint gives one of the best performances I've seen in quite a while and he fits the character perfectly.",
      "review_date": "2009-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think critics are letting their albeit well-deserved love of Clint Eastwood cloud their opinions. The dialogue felt stiff and some of the acting left much to be desired. Eastwood is excellent and there are funny moments, but this is not in I think critics are letting their albeit well-deserved love of Clint Eastwood cloud their opinions. The dialogue felt stiff and some of the acting left much to be desired. Eastwood is excellent and there are funny moments, but this is not in the same state, much less room, as Slumdog. And his familiar body posture -- that of the Jesus-like crucifixion -- at the very end is over-the-top ridiculous.",
      "review_date": "2009-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well-wrought storytelling bogged down by wooden performances and an inflated sense of purpose.",
      "review_date": "2009-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a marvelous film. More than I could have ever expected. This film is almost perfect from where I sat. The only weak link is the non professional player performing the part of the troubled male teen if only because he was such an What a marvelous film. More than I could have ever expected. This film is almost perfect from where I sat. The only weak link is the non professional player performing the part of the troubled male teen if only because he was such an important part of the story. Everyone else in the film is dead on perfect including the salty and inspiring screenplay. A MUST SEE and a special treat especially for older people.",
      "review_date": "2009-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I must admit I was hoping for a more believable movie. I thought a few times I was watching Carol O'connor and Archie Bunker. Clints character just wasn't believable with his over the top ethnic comments. Clint probably should have I must admit I was hoping for a more believable movie. I thought a few times I was watching Carol O'connor and Archie Bunker. Clints character just wasn't believable with his over the top ethnic comments. Clint probably should have left the directing to someone else. An OK movie but could have been better.",
      "review_date": "2009-01-14",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 134,
  "genres": [
    "Drama"
  ]
}