{
    "title": "In the Name of the King: A Dungeon Siege Tale",
    "rating": 7.7,
    "release_date": "2008-01-11",
    "genre": [
        "Action",
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "summary": "An unspeakably evil army rampages across what was an idyllic, peaceful world, destroying everything in its path, looking to conquer the mighty Castle Ebb and vanquish the King himself! Amidst this backdrop of war in the Kingdom of Ehb, between the evil Gallian and the ruling King Konreid, a once simple family man named Farmer sets out toAn unspeakably evil army rampages across what was an idyllic, peaceful world, destroying everything in its path, looking to conquer the mighty Castle Ebb and vanquish the King himself! Amidst this backdrop of war in the Kingdom of Ehb, between the evil Gallian and the ruling King Konreid, a once simple family man named Farmer sets out to find his kidnapped wife, Solana. (Freestyle Releasing)… Expand",
    "critic_reviews": [
        "A second-rate regurgitation of \"The Lord of the Rings.\" Everything about it, down to the set and costume design, apes Peter Jackson's epic trilogy. However, while \"The Lord of the Rings\" was a grand story of scope and power, In the Name of the King feels small in more ways than one.",
        "Its convictionless competence is merely dull, denying the pleasures of an outright howler without providing much else.",
        "Is this movie so god-awful bad that it's hilariously good? Can't be bothered deciding. Figure that's an answer in itself.",
        "This is the sort of movie where men stand blankly over dead loved ones, then start digging. Masculine stoicism or emotional botox? You decide.",
        "Cultists will be happy to discover that In The Name Of The King bears all the so-bad-it's-good hallmarks of a classic Boll production.",
        "Director Uwe Boll sticks with what he knows -- how to turn video games into dull, cheap-looking movies.",
        "An awkward “Lord of the Rings” knockoff, it features both elaborate battles and bumbling humor, though it’s never quite clear when you should be laughing.",
        "As numbing and depressing to watch as suits hammering out a film-packaging deal one venal clause at a time.",
        "Who among us can explain the enigma wrapped in a riddle surrounded by fierce, ravening, razor-toothed conundrums that is German director Uwe Boll?",
        "It's completely undone by its terrible screenplay, inept direction, oppressive musical score and muddy visual palette.",
        "A plodding patchwork of derivative fantasy-adventure, medieval production design, risible dialogue, unimpressive CGI trickery and haphazardly edited action sequences."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Hey...like you are all good at making movies...i'd like to see your sorry arses make a better movie. Anyone who can create a film and put it on the big screen deserves a 10, good luck to all your losers.",
            "review_date": "2008-04-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This definitely a 4. The quality of the adaptation from the game, for what it's worth, is quite good. It's a shame that the source game chosen (Dungeon Siege) was a knockoff itself and poor at best anyway. Neither the game nor the This definitely a 4. The quality of the adaptation from the game, for what it's worth, is quite good. It's a shame that the source game chosen (Dungeon Siege) was a knockoff itself and poor at best anyway. Neither the game nor the movie really bring anything new to either genre. Uwe Boll continues to demonstrate little understanding for the audience he makes movies for and a poor ability to select decent source material.",
            "review_date": "2008-04-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "At times it may seem like it's trying to imitate Lord of the Rings at times, but it actually ends up being it's own unique thing, while it has some cheesy moments and some bad writing, and is nowhere near as the Lord of the Rings series, it'sAt times it may seem like it's trying to imitate Lord of the Rings at times, but it actually ends up being it's own unique thing, while it has some cheesy moments and some bad writing, and is nowhere near as the Lord of the Rings series, it's still very enjoyable, has faster, more chaotic, and fun action than most other Fantasy movies, and I like how it does the video tie in, it's not based of the story of one of the games, but rather a tale set in that world (hence the name a Dungeon Siege tale), and I would like to see more video game movie do that, instead of butchering the games plot, so it is an enjoyable movie, and one I would recommend seeing.",
            "review_date": "2011-11-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a Uwe Boll movie! How could it suck? An instant classic! 10/10!",
            "review_date": "2008-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "its uwe boll directing this ... do i really need to say any more? i didnt even know he directed this crap till the end credits . if i knew in advance i woulda stayed clear of this . its a cheap lord of the rings knock off that looks like itsits uwe boll directing this ... do i really need to say any more? i didnt even know he directed this crap till the end credits . if i knew in advance i woulda stayed clear of this . its a cheap lord of the rings knock off that looks like its on a B movie budget but yet has some decent actors like jason statham , burt renolds , and a few others . the script is pretty much a mess the diouloge is terrable ... i will say this though .. its deffinitly not uwe bolls worst film by far. you could see far worse wach alone in the dark , house of the dead , postal , or pretty much any thing els this guy has made.so its a tiny step up for him ... very tiny.",
            "review_date": "2011-06-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the name of the king: Dungeon Siege tale is best Uwe Boll movie without a doubt. Its true to its story and is very entertaining. Story is great and characters are unique. Overaly a very good movie.",
            "review_date": "2010-12-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The soundtrack for this movie is painful.",
            "review_date": "2008-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the Name of the King: A Dungeon Siege Tale manages to be an exemplary film about the so-called triumph of the human spirit by largely upending every cliché the usual cinematic treatment of the triumph of the human spirit indulges. In the Name of the King: A Dungeon Siege Tale manages to be an exemplary film about the so-called triumph of the human spirit by largely upending every cliché the usual cinematic treatment of the triumph of the human spirit indulges. Based on both a true-life story and an extraordinary game ",
            "review_date": "2008-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I've seen much much worse. The movie would have best been presented as a two night miniseries on Scifi. But it still entertained and I wasn't expecting it to run away with the Oscars",
            "review_date": "2008-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I would give it a 7-8 but with all the 'lets just bash the producer thoughts based on all his old films and look for the worst\" thoughts I'll just lift it to a 9. Considering the budget, Kudos to this film!",
            "review_date": "2008-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best movie ever.Very exciting with a good cast and great special effects. See this movie!",
            "review_date": "2008-03-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not a bad movie. Those that rated this a zero have obviously jumped on the Uwe Boll bashing bandwagon and have lost objectivity.",
            "review_date": "2009-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic effects, great cast, good storyline!",
            "review_date": "2008-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I thought it was a fairly good movie kept in mind what Mister Boll tried to unsleash on his audience before. It suffers the same problems than most of Bolls movies. Most into the eye popping was the much too close up clumsy camerawork that I thought it was a fairly good movie kept in mind what Mister Boll tried to unsleash on his audience before. It suffers the same problems than most of Bolls movies. Most into the eye popping was the much too close up clumsy camerawork that made even the best action sequences of the movie look like some crappy TV-series. The Sets and the costumes are almost great. ok, the plot stinks and is predictable to the bone, but that was clear form the beginning. Over all i would call it Bolls best work till now ( waiting for Far cry... xD )... You can even call it a real movie ^^ He would have done himself a favour not to go with the Dungon siege licence though... The movie would have been picked up a lot better if it had stayed of the videogame stuff and just been another fanasy-movie... Whatever",
            "review_date": "2008-01-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good actors acting adequatly...great sword play....adequate VX. Who figured that Statham was eire to the throne? None of you, that's who! Quit comparing movies with othere movies, people.",
            "review_date": "2008-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie deserves more credit then what it was given, it is Uwe Boll's best work so far, take that for what its worth. This movie is a major step for him, hopefully one day he will actually make a decent movie that will make it in the The movie deserves more credit then what it was given, it is Uwe Boll's best work so far, take that for what its worth. This movie is a major step for him, hopefully one day he will actually make a decent movie that will make it in the box office and win him some admiration. At times the acting tries to go towards a comic relief stance, but it dosen't work out to well. During the fights some of the camera sequences felt a bit dodgy, they really took away from the suspense. Overall it wasn't too great and it wasn't too bad either.",
            "review_date": "2008-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I fucking love uwe boll. I think everyone else who has given this film good marks will agree with me when I say this movie is of the so-shitty-it's-good vein. I can't wait to see what he comes up with next.",
            "review_date": "2008-04-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow.. makes LOTR look pathetic.. fantastic movie.. watched tt back to back .. just so i wouldnt miss anything.",
            "review_date": "2008-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Enjoyable movie with many good moments. Big disappointment with the Krugs look, they should have focused on that a bit more. Story predictable, but that doesn't bother me.",
            "review_date": "2008-08-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Jason Statham is the greatest actor of all time he could have done better with this but i like it anyway.",
            "review_date": "2008-09-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can see most of you who couldnt follow the stryline haven't played the game, this 2 me was the best game to film conversion and i have seen most if not all. although the story did not completely comply with the game there were enough I can see most of you who couldnt follow the stryline haven't played the game, this 2 me was the best game to film conversion and i have seen most if not all. although the story did not completely comply with the game there were enough elements of the game in the film. the battle scenes although not as good as the battles from lotr especially the defence of minas tirith or the defence of helm's deep were very good and it was good to see some of the places i visited in the rpg game showing in the film which is a big help in understanding the film. i feel they should make a sequel based on dungeon seige 2.",
            "review_date": "2009-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the worst movies that I have ever seen.  It looks good, but the acting is absolutely dreadful.  It could be considered a comedy because it is so absurdly awful.",
            "review_date": "2011-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the most star studded B movie (and I'm being generous by calling it a B movie, it's more like a college film project) I've ever seen. OK, I'm not saying it has A list players but it has names you recognize: Burt Reynolds, JasonThis is the most star studded B movie (and I'm being generous by calling it a B movie, it's more like a college film project) I've ever seen. OK, I'm not saying it has A list players but it has names you recognize: Burt Reynolds, Jason Statham, and John Rhys-Davies. If you enter with low expectations, this film is good for a laugh (thus the 3 points). If, however, you're expecting an engaging action flick then I'm afraid you should look elsewhere.",
            "review_date": "2013-12-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I found this Boll movie to be very boring. Boring and dull. The kin of boring that makes you fall asleep, and the kind of dull that makes you want to leave. In the name of the King does these things for unfortunately every second of the film.I found this Boll movie to be very boring. Boring and dull. The kin of boring that makes you fall asleep, and the kind of dull that makes you want to leave. In the name of the King does these things for unfortunately every second of the film. But you have to give the director credit for trying here for it is not all terrible.",
            "review_date": "2014-02-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is that kind of 'strange movies', an adventure of a simple Farmer that involves many kind of different characters with their own problems and agendas, as well as their stereotypes: the thug friend of the farmer that will follow him noThis is that kind of 'strange movies', an adventure of a simple Farmer that involves many kind of different characters with their own problems and agendas, as well as their stereotypes: the thug friend of the farmer that will follow him no matter the threats, the girl apprentice of magic that becomes a special knight (a kind of paladin), the wizard that knows more than all of them, the twisted traitor, the free dryads, the King and his army, all of them making their actions in their own particular way. One of the films that I remember most fondly. Thanks!",
            "review_date": "2014-12-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Uwe Boll brings another stinker to the big screen. Be sure to catch it opening weekend, because it won't survive to weekend #2. I think it would be less painful to watch with a bottle of scotch and a few buddies to laugh at it with.",
            "review_date": "2008-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lowtax should have put some barb-wire on his gloves.",
            "review_date": "2008-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a waste of time.",
            "review_date": "2009-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Don't see this movie. Please make him stop!",
            "review_date": "2008-01-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What is it with you people!! An awesome jaw dropping work of art comes out and you somehow complain and give it a low score. But then a absolute piece of shit movie comes out and there 10's everywhere. This move did so many things What is it with you people!! An awesome jaw dropping work of art comes out and you somehow complain and give it a low score. But then a absolute piece of shit movie comes out and there 10's everywhere. This move did so many things wrong. From the story line to the acting. I just don't understand people anymore...",
            "review_date": "2008-01-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was painfully bad. I wanted to leave but I was with friends, so I couldn't. I should have seen this crap coming, it's made by Uwe Boll, quite possibly the worst director still making movies today.",
            "review_date": "2008-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All Uwe Boll movies suck including this!",
            "review_date": "2008-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow this movie was bad. Truly so-bad-its-awful garbage.",
            "review_date": "2009-09-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Actors were fine; producer/director and editor let down them and the audience.",
            "review_date": "2008-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is horrible, I don't believe that anyone would give it a 10, Ewe, is that you? This man is a murderer of video-game films. He thinks Michael Bay is far worse than him. I would rather watch Pearl Harbor again, before watching 10 This is horrible, I don't believe that anyone would give it a 10, Ewe, is that you? This man is a murderer of video-game films. He thinks Michael Bay is far worse than him. I would rather watch Pearl Harbor again, before watching 10 minutes of this film. And, trust me, I hated Pearl Harbor.",
            "review_date": "2008-04-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unwatchable - I love Jason Statham movies, but this is utter garbage. I have seen better special fx in an episode of barney.",
            "review_date": "2008-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As previously stated, the soundtrack for this movie is absolutely terrible. However, the dialogue is so much worse. You actually feel embarassed for the actors. (And yourself for watching) Uwe Boll is the worst thing to ever hit cinema, and As previously stated, the soundtrack for this movie is absolutely terrible. However, the dialogue is so much worse. You actually feel embarassed for the actors. (And yourself for watching) Uwe Boll is the worst thing to ever hit cinema, and he is part of the reason why movies today are horrible. This movie would get points for good action; there wasn't any and this movie gets a zero. There are no redeeming qualities to this movie and you are left worse off after you have seen it. Then again maybe Uwe Boll is being artistic in the fact that he can invoke such feelings of anger and hate over something as trivial as a movie. Tut tut.",
            "review_date": "2008-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "First off, Jason Statham stick to action movies (Hint: The Transporter). The only thing that I liked about this movie is the fact that it ended. Could someone please give me back the last 2 hours of my life. All I wonder is why didn't First off, Jason Statham stick to action movies (Hint: The Transporter). The only thing that I liked about this movie is the fact that it ended. Could someone please give me back the last 2 hours of my life. All I wonder is why didn't the guy at the movie store warn me that this movie sucks. Accents are wrong, \"Farmer?\", compatible with planet of the apes in medieval times.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So bad that this movie was funny to see just how bad it was!",
            "review_date": "2008-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The script, production design, acting, directing and editing were all so bad that at times I felt like I was watching a campy, 1970s Saturday-morning television show. The story is completely incomprehensible and the editing in the first half The script, production design, acting, directing and editing were all so bad that at times I felt like I was watching a campy, 1970s Saturday-morning television show. The story is completely incomprehensible and the editing in the first half hour is so slapdash and uneven that there is zero continuity. Ray Liotta should stick to doing video game voices instead of \"acting\" in movies based on video games. And Burt Reynolds ... there are no words. What a waste of time and money -- for the filmmakers and the moviegoing audience.",
            "review_date": "2008-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Painful. So bad it caused me physical pain. I swear I left the theater with the worst headache I have had in years.",
            "review_date": "2008-01-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I feel like someone owes me an apology for having been subjected to this abomination. I curse you Uwe Boll!!",
            "review_date": "2008-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the Name of the King: A Dungeon Seige Tale had to be the most hilarious movie to start the new year off. For that I'll give it a 10. Never in 34 years have a movie had me in tears from so much laughter. Some of the scenes were just In the Name of the King: A Dungeon Seige Tale had to be the most hilarious movie to start the new year off. For that I'll give it a 10. Never in 34 years have a movie had me in tears from so much laughter. Some of the scenes were just plain ridiculous. If you are looking for a Lord of the Rings type film, this is not it, far from it very very far from it. Jason Stratham and Ray Liotta has put a serious hurt on their careers with this movie and really should leave the Matrix stuff to Keanu Reeves, he's better for those type of sequences.",
            "review_date": "2008-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All you need to know going into this film is this: It's a film by Uwe Boll.",
            "review_date": "2008-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "what is the music throughout all about? it ruined the film. It s a cheap film ,terrible acting in parts and boring to watch.",
            "review_date": "2008-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I had to watch this just because of the interesting assortment of actors in the cast, and because they were in a Uwe Boll film. His direction is more ambitious than usual, and certainly a better quality than the majority of his work. It I had to watch this just because of the interesting assortment of actors in the cast, and because they were in a Uwe Boll film. His direction is more ambitious than usual, and certainly a better quality than the majority of his work. It actually has some good cinematography, but the story is so stupid I guess it doesn't matter much. Uwe Boll's best film, but that isn't saying a lot.",
            "review_date": "2008-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really take it that the three people who gave this film a ten below me might be Uwe Boll himself. This is a very bad movie. Almost as bad as \"Pluto Nash\". Almost.",
            "review_date": "2008-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While the writing was done by a 10 year old who had read some \"grown-up\" books. The cinematography wasn't as bad as I thought it would be, however, let me say again, the writing was PAINFUL. Not even that star/has-been star cast could While the writing was done by a 10 year old who had read some \"grown-up\" books. The cinematography wasn't as bad as I thought it would be, however, let me say again, the writing was PAINFUL. Not even that star/has-been star cast could save that. Then you have conflicting accents, throw in some melo-dramatic acting and a stupid, hard to follow, thoughtless story and screen play, and there you have a pile of steaming...well you know. No wonder Uwe sounds like eww.",
            "review_date": "2008-04-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A load of crap. All accents are wrong, some british,some american. Evil army? WTF was jason statham thinking? I feel like I should be entitled to a refund for renting this worthless movie. Try to make something that doesn't suck next time.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love jason statham, hes one of my favorite actors. And I felt sorry for him as I sat through this shitfest. But then again, what do you expect?Uwe boll.",
            "review_date": "2008-07-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "LOL, this was HILARIOUS, in an unintentional way! I went with my best friend, and there were these three other college guys sitting behind us, and they were laughing the most! This movie is SO corny and cheesy I don't even know where to LOL, this was HILARIOUS, in an unintentional way! I went with my best friend, and there were these three other college guys sitting behind us, and they were laughing the most! This movie is SO corny and cheesy I don't even know where to begin. The first laugh of the movie came when the camera cut to Burt Reynolds, college guy was like \"HAH!!\" Then it all went downhill from there. Uwe Boll pretty much made an unintentional comedy, especially from Ray Liotta's performance!! LMAO!!",
            "review_date": "2008-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Worst movie of all time. Seriously. I have not seen worse. I am a true believer that this movie will be played over and over again in hell. On a high note, i did laugh a number of times - during situations which were supposed to provoke Worst movie of all time. Seriously. I have not seen worse. I am a true believer that this movie will be played over and over again in hell. On a high note, i did laugh a number of times - during situations which were supposed to provoke sadness. Thats what terrible writing coupled with atrocious acting does to a movie. Five words - worst movie of all time.",
            "review_date": "2008-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The worst movie I've ever seen. I walked out 15 mins from the end. . i just couldn't take it.",
            "review_date": "2008-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I could of done better then this director , saved a lot of money, some of the actors on this movie should of done a updated movie , it was like watching modern day actors try to fit into ancient times, it was frustrating, to watch, also , I could of done better then this director , saved a lot of money, some of the actors on this movie should of done a updated movie , it was like watching modern day actors try to fit into ancient times, it was frustrating, to watch, also , some of them need desperately acting lessons, burt reynolds, is a great actor so he pulled it off, but the others needed to be in a gangster movie, or put makeup on to desguise them from the type of movies that they had done before. the story made no sense, they should of had some prelog statements made at the beggining, you had no idea about the characters, you didnt get close enough to the passion of each character, clean the board all those good actors and not much of a story to follow, something was missing ,it was hard to watch at times , and caused me real distress, because they had so much equipment and energy put into it, but the story seemed, boring, the movie seemed boring, the film production , had some wonderful scenary, but why could i not get into the passion of the movie i just dont know. it seemed odd at best, what were they thinking, you cant just start a story without any background of the situation, who did i feel passion with , i just dont know, very boring,, bery boring indeed, a lot of good stars, but no real content, i think they all just wanted to make a movie, no body was conviencing me of there characters, a interesting actress, was the wife of the hero, great actress, i beleived in her character, she was beleivable, so that is my statement about the movie, it seems to me, i would of arranged alot of things differently then the director did, the villian i think should of put makeup to add to the characters beleivable self,i dont like to be critical, but i thought the movie was really bad. and always look for positives in everything",
            "review_date": "2008-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Holy crap! i think this has to be one of the worst films i have ever seen. Who ever casted this film must be blind or from the planet stupid. The only reason i give this movie a 1 is for the fact that it had, ok boobs.",
            "review_date": "2008-04-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why do I have a feeling that the perfect 10s were done by Uwe Boll himself? This poor English probably gives it away... My brain still hurts from watching this awful film a week ago. That's all you need to know.",
            "review_date": "2008-04-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have been looking ever since watching this steaming dog turd of a movie for something worse than this. The humor (well, the intended humor) made me cringe, the action sequences can make even Chuck Norris want to cry, and the ending made me I have been looking ever since watching this steaming dog turd of a movie for something worse than this. The humor (well, the intended humor) made me cringe, the action sequences can make even Chuck Norris want to cry, and the ending made me want to punch something. I would have paid any thing to have Uwe Boll, or as I like to call him Ow My Balls, in the room at the time. The only problem would be that he is a good kick boxer.",
            "review_date": "2009-04-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It was ok. The action was good for the most part but the parts with magic were super, super corny. There was little plot to it as well. The acting was solid but thats expected by the experianced cast. Overall, There is nothing really specialIt was ok. The action was good for the most part but the parts with magic were super, super corny. There was little plot to it as well. The acting was solid but thats expected by the experianced cast. Overall, There is nothing really special (or good) about this movie. Its just another generic film really.",
            "review_date": "2012-01-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have not seen all of Uwe Boll's films. But this is the second worst one I have seen. Remember that show from the 90s. Angel? The spin off to Buffy the vampire slayer. This move is like a couple of episodes of that with less interesting,I have not seen all of Uwe Boll's films. But this is the second worst one I have seen. Remember that show from the 90s. Angel? The spin off to Buffy the vampire slayer. This move is like a couple of episodes of that with less interesting, less dynamic characters.\rHe does a lot better on the BloodRayne films at least.",
            "review_date": "2015-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If it weren't for the terribly bad music and the disastrous sequences/scene editing, the film might have turned out to be something. But compared to current productions, I also have to say how good the quality of the equipment and the fightIf it weren't for the terribly bad music and the disastrous sequences/scene editing, the film might have turned out to be something. But compared to current productions, I also have to say how good the quality of the equipment and the fight scenes are. A 0 would be wrong if you compared Disney garbage.",
            "review_date": "2022-07-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's an Uwe Boll movie, Do you really need more of an explanation to avoid this? This movie is low bar even for video game movies",
            "review_date": "2020-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Having heard about the movie before i sat down to watch a bad movie for entertainment. I was really surprised how good it was. Yes, its just a pulp fantasy movie, but it entertained me very well. Of course, comparing it with Lord of the RingsHaving heard about the movie before i sat down to watch a bad movie for entertainment. I was really surprised how good it was. Yes, its just a pulp fantasy movie, but it entertained me very well. Of course, comparing it with Lord of the Rings it sucks, but you know its a Uwe Boll movie so making that comparison is like comparing a pro soccer player to a guy with one leg. I've sat through way worse fantasy movies, speaking of LotR the Hobbit comes to mind, which i enjoyed way less than this (both movies in the directors cut editions). Personally I think you can compare these movies very well, both got orcs (not called orcs) and no blood, but dungeon siege got real people dressed up and not cgi. And the villain looks like David Hasselhoff.",
            "review_date": "2015-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I like Uwe Boll as a man and as a director. I don´t care what you say. But unfortunately I will have to agree that this movie isn´t good. But don´t pretend Uwe is the worst thing ever.",
            "review_date": "2021-11-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A masterful dichotomy of pitiful brilliance! This film will go right over most people's heads unless you get the timing right. You take your dose of acid or schrooms at least 2 hours prior to starting the film. Turn the sound Off then aboutA masterful dichotomy of pitiful brilliance! This film will go right over most people's heads unless you get the timing right. You take your dose of acid or schrooms at least 2 hours prior to starting the film. Turn the sound Off then about 20 seconds in at the title , press play on your stereo with pink Floyd's album  the wall in it !  Then the movie makes sense. trippy vibes",
            "review_date": "2018-03-12",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 77
}