{
  "title": "Let the Right One In",
  "rating": 8.5,
  "release_date": "2008-10-24",
  "summary": "A fragile, anxious boy, 12-year-old Oskar is regularly bullied by his stronger classmates but never strikes back. The lonely boy's wish for a friend seems to come true when he meets Eli, also 12, who moves in next door to him with her father. A pale, serious young girl, she only comes out at night and doesn't seem affected by the freezingA fragile, anxious boy, 12-year-old Oskar is regularly bullied by his stronger classmates but never strikes back. The lonely boy's wish for a friend seems to come true when he meets Eli, also 12, who moves in next door to him with her father. A pale, serious young girl, she only comes out at night and doesn't seem affected by the freezing temperatures. Coinciding with Eli's arrival is a series of inexplicable disappearances and murders. One man is found tied to a tree, another frozen in the lake, a woman bitten in the neck. Blood seems to be the common denominator. But by now a subtle romance has blossomed between Oskar and Eli, and she gives him the strength to fight back against his aggressors. (Magnolia Pictures)… Expand",
  "critic_reviews": [
    "In the basest of terms, a horror flick. But it's also a spectacularly moving and elegant movie, and to dismiss it into genre-hood, to mentally stuff it into the horror pigeonhole, is to overlook a remarkable film.",
    "This is one of the real finds of 2008.",
    "At once a devastating, curiously uplifting inhuman drama and a superbly crafted genre exercise, Let The Right One In can stand toe-to-toe with Spirit Of The Beehive, Pan's Labyrinth or Orphee. See it.",
    "It's one of the great horror films of recent years -- and a welcome antidote to the in-your-face sonic assaults that all too often pass for genre fare.",
    "The best fairy tales always have so much darkness in them. That's why they resonate so deeply. This is a magnificent film.",
    "Could be summarized as a vampire tween romance, but that cheap and tawdry sum-up does zero justice to the magnificent emotional resonance of this gemlike bloodstone of a film.",
    "Stick your neck out for this Swedish horror show. It's a winner, full of mirth and malice, plus a young romance you'll never see on the Disney Channel.",
    "The young actors are powerful in draining roles. We care for them more than they care for themselves. Alfredson's palette is so drained of warm colors that even fresh blood is black.",
    "Funny, fear-inducing, with periods of voyeuristic gore and an undercurrent of anxiety and dread, Let the Right One In is up there with the bloodsucking classics.",
    "The beauty of Let the Right One In resides in the way the horror remains grounded in a tragic kind of love.",
    "Most contemporary horror films derive shocks from mere torture. Let the Right One In locates most of its fright-power in the needs and confusions of people who are usually overlooked.",
    "The most violent scene is dreamlike, and more direct killings are often seen at an angle or from a distance. The camera placement is thoughtful and effective, never titillating.",
    "It's a sweetly queasy film that suggests the spirit that sustains us, the demons we hide from the world, and the monsters that prey upon us in the dark might all be variations on the same beast.",
    "It's a little long and dissipates some of its power in an unfocused subplot, but the skewed sensibility of the film is both innocent and feral and offers a smart and satisfying reworking to the familiar genre. An American remake is already in the works.",
    "A coolly balanced and utterly compelling examination of alienation and love.",
    "Let the Right One In unfolds with quiet, masterly assurance.",
    "A moody adaptation of the Swedish best-seller about a fateful mortal-vampire romance, Let the Right One In is atypically literate and unexpectedly affecting suspense fare. Complex characters, ominous situations fraught with mortality and the recklessness of youthful ardor create a tense and subtly shaded narrative.",
    "Alfredson makes the most of every detail, carefully crafting an atmosphere of haunting alienation. These two lost souls may come together under unusual circumstances, but their connection feels universally human.",
    "In this sinister but gorgeous and compelling film by director Tomas Alfredson, being human and acting human don't always go together.",
    "There is a remarkable stillness to many of the film's most indelible images, particularly the exteriors, which are so carefully photographed, and without the usual tiresome camera jiggling, as to look almost frozen.",
    "An ingenious mixture of satire, dead-end suburban realism and gory vampire fantasy.",
    "It's a genuine genre vampire picture; and it's Swedish, winter-lit, Bergmanesque.",
    "A remarkably fine and genuinely frightening movie about a teenage vampire.",
    "Despite having no previous film experience, Kare Hedebrant and Lina Leandersson give evocative performances as Oskar and Eli, respectively.",
    "Let the Right One In is a children's film, but you wouldn't want your child to see it. It's a horror film, but the gruesome splatter is the least of its scares. And it's a love story, but the prepubescent kind where sex is a distant idea and loneliness a shared reality. A wicked trick, a cinematic treat, this is some Halloween offering.",
    "Strikes a surprising array of notes: scary, sad and hopeful. The director, Tomas Alfredson, does a great job of presenting peril in the film.",
    "Some will classify Let the Right One In as a horror movie, and I suppose that's technically accurate. To me, however, this is much more of a coming-of-age/friendship movie.",
    "Calling to mind the work of Anne Rice and Stephen King, atmospheric adaptation of Swedish author John Ajvide Lindqvist's bestseller is well directed by his countryman Tomas Alfredson (\"Four Shades of Brown\") and should click with cult and arthouse auds.",
    "The Scandinavian moodiness of the first half gives way to a series of jolting set pieces in the second.",
    "If random arty blood thrills are your cup of fear, perhaps you'll enjoy Let the Right One In, a Swedish head-scratcher that has a few creepy images but very little holding them together."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "One of the most refreshing vampire films you'll see this decade. The story is poetic yet disturbing and the leads are well cast. Watching it with good friends will only improve the experience.",
      "review_date": "2010-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my top five favorite films of all time. A modern horror masterpiece, beautiful cinematography, great child acting, an eerie and creepy tone. A very poetic, engaging, tho disturbing tale. Anyone who dislikes this obviously doesn'tIn my top five favorite films of all time. A modern horror masterpiece, beautiful cinematography, great child acting, an eerie and creepy tone. A very poetic, engaging, tho disturbing tale. Anyone who dislikes this obviously doesn't understand the art of film making, because this film is art. It's American remake Let Me In heavy pales in comparison.",
      "review_date": "2016-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic re-invention of the vampire tale. Leaves you debating and talking about it for days after. A few camp moments, but overall a great success.",
      "review_date": "2009-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely the right one to let in. I",
      "review_date": "2010-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As a fan of the book this has to be the best adaptation of a horror novel since The Exorcist. The child actors act like real kids instead of 20 somethings pretending to be teenagers. It has marvelous cinematography and sticks closer to theAs a fan of the book this has to be the best adaptation of a horror novel since The Exorcist. The child actors act like real kids instead of 20 somethings pretending to be teenagers. It has marvelous cinematography and sticks closer to the vampire mythology and this puts Stephanie Meyer's Twilight to shame since both the book and film were released after Let The Right One In.  It proves that international features are fresh.",
      "review_date": "2011-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't say enough good things about this film, so I guess I'll just say one. The main reason this movie worked so well for me is quite simple: I have never (and likely will never) have a stronger emotional connection with the characters. TooI can't say enough good things about this film, so I guess I'll just say one. The main reason this movie worked so well for me is quite simple: I have never (and likely will never) have a stronger emotional connection with the characters. Too many films rely on things like SFX, creative camera-work, bright colors and flashy visuals to draw audiences into the film's world. Here, there's almost none of that. All you have is the writing and the characters. And, shockingly, those two things alone amount to, literally, the best film than I have ever seen. No joke.",
      "review_date": "2011-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'll not dare try to do this film justice with words.  It is only one of two movies I will rate a 10.  Spooky, tasteful, alarming, wonderful.  Let the Right One In is all of those things.  It has the soul that Hollywood seems to have lost inI'll not dare try to do this film justice with words.  It is only one of two movies I will rate a 10.  Spooky, tasteful, alarming, wonderful.  Let the Right One In is all of those things.  It has the soul that Hollywood seems to have lost in its attempt for bigger, better action and special effects.  All the actors and actresses in this work of art (yes, it is literally that and much more) are superb, but the best?  Lina Leandersson.  The girl can project more emotion with her eyes than most can using speech and every other tool.",
      "review_date": "2011-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hands down for the best film of 2008. I really liked this movie, and it is a big comeback to the vampire movies. Today we have \"The Vampire Diaries\", \"True Blood\" and \"Twilight\". But forget them, because \"Let The Right One In\" is a movie thatHands down for the best film of 2008. I really liked this movie, and it is a big comeback to the vampire movies. Today we have \"The Vampire Diaries\", \"True Blood\" and \"Twilight\". But forget them, because \"Let The Right One In\" is a movie that shows that just because a vampire and a human can become friends and later on lovers, dosen´t mean that it must be a boring and stupid romantic movie (like Twilight). \"Let The Right One In\" does feature a little romance, but its also a disturbing and a scary movie.",
      "review_date": "2013-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Okay. May be i had high expectations for this blank cr1p after seeing the reviews. Unfortunately though - it ended being another brick in the wall of the dumbest movies ever made!",
      "review_date": "2018-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gory thrillers are basically all that Scandinavian movies are famous for worldwide and Tomas Alfredson doesn’t want to share away from this with his vampire flick Let the Right One In (Låt den rätte komma in). But the Swedish production thatGory thrillers are basically all that Scandinavian movies are famous for worldwide and Tomas Alfredson doesn’t want to share away from this with his vampire flick Let the Right One In (Låt den rätte komma in). But the Swedish production that has been showed at pretty much any film festival imaginable still isn’t what you’d call mainstream. The main characters are a twelve-year-old bullying victim and a vampiress of the same age  just that she’s been twelve for a longer time. Now does that sound odd to you? Well, it is. Damn right it is.\rTo spice up the somberly snowed landscape of the northernmost part of Europe with some blood is a great idea stylistically and the Dutch cinematographer Hoyte Van Hoytema knows exactly how can he make the murder scenes rememberable. However, he’s quite a singularity with this in the cast of Let the Right One In. One could pick on the fact that the child actors don’t feel genuine, the director has a way too austere approach to an unbelievable story, or that there isn’t any suspense at all, but eventually, all boils down to the mixture of horror, drama, romance, and coming-of-age story that just doesn’t work. For example, one scene shows a man brutally slaughtering another man, and the next shows the flirtation of two kids. But that alone wouldn’t have ruined the movie for me  it’s a handful of plainly ridiculous scenes that made it impossible for me to take Let the Right One In seriously. In one, a woman gets attacked by a dozen cats in a Scary Movie manner, in another one, the same woman ignites herself in a hospital bed, and what we also get to see are the bare nether regions of a twelve-year-old girl  a scene that confirms her previous comment, she isn’t a girl. Oh, and the best is yet to come: a close-up shot of a man who’s burned his face with acid! Think of it like The Dar Knight’s Two-Face with worse prosthetics.\rIf there aren’t any of such idiotic moments, time is bypassed with boring dialogs, which accumulate to a sheerly unendurable sum over the course of almost two hours running time. All of this is disappointing, considering the potential some rare scenes show  as in the one, in which protagonist Oskar visits his divorced father and the lovely father-son-ambiance suddenly leaves as a buddy of his father stops by and leads him away from the offspring and to alcohol. This particular scene is short and mostly silent, but still probably the best of the film because it for once manages to emotionally affect the audience.\rThe overall product though, is really disappointing. You can’t accuse Let the Right One In of using clichés, but that alone doesn’t make a film original  in this case, it only makes it to an unfrightening horror film, an unmoving romance, and a drama too ridiculous to take seriously.",
      "review_date": "2013-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was just not interesting. It bored me half to death. It barely had any good scares. The little boy was annoying. A lot of the scenes could have been brilliant if they were just quicker and more intense, but they weren't. The scenesThis movie was just not interesting. It bored me half to death. It barely had any good scares. The little boy was annoying. A lot of the scenes could have been brilliant if they were just quicker and more intense, but they weren't. The scenes that should've been intense just plodded along endlessly. This is one of those instances where music could have done wonders for a movie.",
      "review_date": "2011-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What the F***? I get the point, but could not get why people are going so crazy about this movie. Love, difference, bullying - okay, but it was simply boring, nothing special actually. I'm a fan of Twilight and it still didn't work for me.What the F***? I get the point, but could not get why people are going so crazy about this movie. Love, difference, bullying - okay, but it was simply boring, nothing special actually. I'm a fan of Twilight and it still didn't work for me. Love is a matter of support, so 1 point for that.",
      "review_date": "2018-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just finished watching this movie...and I have to say I did enjoy the story...I'm a sucker for a good vampire movie...that said, the pace of the movie just didn't do it for me...it was a struggle to keep up with due to the pacing Just finished watching this movie...and I have to say I did enjoy the story...I'm a sucker for a good vampire movie...that said, the pace of the movie just didn't do it for me...it was a struggle to keep up with due to the pacing of the film-very SLOW...loved the little girl who played the vampire!",
      "review_date": "2009-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched an English dubbed version of 'Let the Right One In' and was extremely disappointed. The critics had led me to believe that this was the greatest vampire movie of all time, but whether it was due to the terrible dubbing or not, i didI watched an English dubbed version of 'Let the Right One In' and was extremely disappointed. The critics had led me to believe that this was the greatest vampire movie of all time, but whether it was due to the terrible dubbing or not, i did not see any entertainment value whatsoever in this boring mess of a movie which, i can honestly say, was slightly worse than the atrocious twilight movies.",
      "review_date": "2010-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "From the reviews I'd read I expected something fresh and interesting from this one, but in the end it did nothing for me. First, the grim aesthetics made me squirm: everything is unremittingly ugly, faded, and bleak, and the characters From the reviews I'd read I expected something fresh and interesting from this one, but in the end it did nothing for me. First, the grim aesthetics made me squirm: everything is unremittingly ugly, faded, and bleak, and the characters show a typical Scandinavian lack of affect or animation (I do realize this is deliberate, but I've never liked the whole Lars von Trier masochism-as-art idea). Second, while the premise was admittedly original (a vampire story told from the perspective of children, without flinching on the violence and gore) the story is actually quite weak, replete with stock characters (the Inattentive Parents, the Bully, the Mysterious Girl Next Door), clumsily engineered twists (the guy brings a jar of acid to splash on his face so the police won't be able to identify him if he gets caught? What century does he think this is?), and a great deal of disturbing and improbable child-on-child violence, even when the vampire girl isn't around. Lastly, while I get that the movie is trying to make a point about how children can be both touchingly innocent and shockingly bloodthirsty (as when the protagonist fantasizes about stabbing the bullies with a hunting knife), I guess I'm just past the point where I think that kind of thing is cool and edgy. I like a nice cathartic bloodbath in a movie as much as anyone (heck, so did Shakespeare), but watching a roomful of scared kids get turned into chum by a creepy little girl left me no wiser about how violence begets violence or what-have-you; It was just disgusting and gratuitous, doubly so when you realize that she \"did it out of love\" or some such nonsense. Overall, an unsatisfying and pretentious film. I suspect the only reason it's received such good word-of-mouth is that the only people who bother to watch it are the ones who think doing so makes them seem sophisticated and clever.",
      "review_date": "2009-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Take away the subtitles and what do you have left? Bland, uninteresting characters, lugubrious pacing, stilted dialogue and a nonsensical plot that manages to go nowhere with a potentially great premise. I'm truly puzzled why this dopey Take away the subtitles and what do you have left? Bland, uninteresting characters, lugubrious pacing, stilted dialogue and a nonsensical plot that manages to go nowhere with a potentially great premise. I'm truly puzzled why this dopey film earned such glowing reviews, but my hunch is that the critics mistook technical skill with \"Art.\" A slick, pretentious exercise in form over substance.",
      "review_date": "2009-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrible movie, no value whatsoever. The only movie I've ever seen that's as bad as this is Clockwork Orange. Both were foreign, they have no continuity or surface meaning. It's just random ridiculous nonsense. I HATED this movie!",
      "review_date": "2010-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "These votings here seem very fishy to me. (Maybe some people from the production company or from the distributor?). This movie is boring, stupid and absolutely NOT intriguing. Fade and pale characters, a idiotic plot. But above all: boring and dull.",
      "review_date": "2009-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watch a lot of movies, and I appreciate and very often agree with the reviewers, who reneder us a great service. It's rare I'll take the time to watch a movie that the critics pan, as a matter of fact, unless I have good reason I watch a lot of movies, and I appreciate and very often agree with the reviewers, who reneder us a great service. It's rare I'll take the time to watch a movie that the critics pan, as a matter of fact, unless I have good reason to--recs from friends, genre that isn't about plot and acting, etc. I was, therefore, completely ready to be stunned by the excellence of this film. Wow. Was I underwhelmed! When I was telling a fellow filmophile about it, this morning, I had to acknowledge its debt to Bergmann, in that it is so minimalistic in its plot, dialogue, scenes, and cinematography. The children are pretty and I won't quibble with their acting. But my impression of the movie is that in its attempt at minimalism, it has achieved, instead, shallowness--a very different thing There is no depth to the characters or to the story. In Bergmann films, very often the characters are iconoclastic, representing ideas, principles, psychological states, classic conflicts, etc. It is apparent that this movie aspires to that import, but instead of archetypes, the characters are little more than caricatures. There is just not enough depth and substance to warrant the praise this movie has received--not in my humble opinion, anyway.",
      "review_date": "2009-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Alright folks, I just finished watching this movie. I watched it with English audio dubbing. I am convinced that whoever translated this movie from the original to english, just winged it. Terrible voice overs with absolutely no expression Alright folks, I just finished watching this movie. I watched it with English audio dubbing. I am convinced that whoever translated this movie from the original to english, just winged it. Terrible voice overs with absolutely no expression in their voices whatsoever. If the voice overs were an accurate representation of the original language [german etc]. then this has to be the absolute worst movie I have seen in a very long time. No, this movie is not a cinematic masterpiece. It's pure garbage. Yes, I fully understand it is attempting to reflect human nature, both the good/evil sides of all of us. Yet, give me a break. Everyone was completely expressionless. Useless shells of a body walking around blurting out useless garbage. I guarantee I could have acted better than each and every one of these so called actors. The director of this film should retire immediately. I'm so embarrassed to have even watched this movie, that I will never read another hyped up review here again. The marks that people are giving here are astounding. Utterly ridiculous. You should be ashamed of falsely rating movies.",
      "review_date": "2009-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of those movies where you try too hard to make it great. Everyone wants to admire it's artsy feel and direction, and like it because it is different, but it's not. It's dull, boring, and doesn't make total This is one of those movies where you try too hard to make it great. Everyone wants to admire it's artsy feel and direction, and like it because it is different, but it's not. It's dull, boring, and doesn't make total sense. It's a very poor excuse for a love story/horror film. It's not beautiful, it's disturbing and boring. Try not to think too hard.",
      "review_date": "2009-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is best to know something about a reviewer in order to judge the relevance of their view. I am not a horror fan. Well, not American horror at least. The decent foriegn films that make their way into the states typically are subtle and It is best to know something about a reviewer in order to judge the relevance of their view. I am not a horror fan. Well, not American horror at least. The decent foriegn films that make their way into the states typically are subtle and psychological as opposed to the violence porn we Americans have come to expect. This is a prime example. Subtle, minimal, brooding, and great. Please, spare the Bergman comparisons (who I hold to be overrated, but still a great director.) This film is not \"deep.\" It is good. Is it scary? Yes and no. Is it different? Yes. Is it worth seeing? Absolutely. I despise vampire films due to their stupidity and overt morbid sexuality. This is a film about loneliness and childhood. Simple as that. Simplicity is the KEY to making a good film i.e. Akira Kurosawa and Kiyoshi Kurosawa. Great scenes, good acting, great film score, respect for the intelligence of the viewer = Great movie. And yes, the pool scene at the end of the film is one of the best I have seen in years.",
      "review_date": "2009-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fantastically new take on an old idea. The setting is as familiar, but strange, as are the characters and concept. Very interesting to see how the writer spun in the traditional \"rules\" of vampire, but managed to create a very unique A fantastically new take on an old idea. The setting is as familiar, but strange, as are the characters and concept. Very interesting to see how the writer spun in the traditional \"rules\" of vampire, but managed to create a very unique story. A must-see.",
      "review_date": "2009-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I first heard about this story when I read about a little budget film in Empire magazine, I'm a Vamp fan and love the genre. Its dark and moody, but the friendship and possibly love that forms between Oskar and Eli just shines and makes I first heard about this story when I read about a little budget film in Empire magazine, I'm a Vamp fan and love the genre. Its dark and moody, but the friendship and possibly love that forms between Oskar and Eli just shines and makes this a magical movie. Violent in some scenes although not as much as the novel (A must read btw) but it works amazingly well. MY best film of the year thus far and now one of my all time top 10.",
      "review_date": "2009-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw this movie on Friday and must say it is the most unique, and brilliant film I have seen in a long time. I love the quote from the critic that says that you won't see this kind of romance in a Disney movie. This film is probably the Saw this movie on Friday and must say it is the most unique, and brilliant film I have seen in a long time. I love the quote from the critic that says that you won't see this kind of romance in a Disney movie. This film is probably the antithesis of the Disney film yet just as powerful in its imagery and ideas while being less heavyhanded and melodramatic. I haven't been able to quit thinking about how great it was for 3 days now.",
      "review_date": "2008-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie I've seen in ages. Direction, acting, pacing, cinematography - genius. The use of effects was restrained and seamless and only used when it suited the story. This movie is now in my All-Time Top 5.",
      "review_date": "2008-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love that this movie does not explore every element of the plot, details, and character relationships. It allows the film to serve as a window to a familiar but imaginary world and lets the viewer use their own imagination to fill in all I love that this movie does not explore every element of the plot, details, and character relationships. It allows the film to serve as a window to a familiar but imaginary world and lets the viewer use their own imagination to fill in all sorts of things, be it the nature of Eli's relationship w the man she lives with, Oskars father and his friend, the future of Oskar and Eli, etc. These loose ends allow me to stay in the story, rather than it being just a cut and dry 2 hr experience.",
      "review_date": "2009-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Actual score would be 9.6. should have received award nominations. This a transcedent film.",
      "review_date": "2009-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow. this film was almost perfect. I went in expecting a slight horror/thriller--and instead got a rather touching romance and allegory on the horror of childhood. What a brilliant surprise. As others have pointed out, the level of craft Wow. this film was almost perfect. I went in expecting a slight horror/thriller--and instead got a rather touching romance and allegory on the horror of childhood. What a brilliant surprise. As others have pointed out, the level of craft involved here is stellar in just about every aspect: direction, acting, cinematography, score, screenplay etc. It is in Swedish, but there's not a lot of dialog to begin with. I was a bit shocked to find there might be an american remake in the works as it seems unnesessary given how great this one is (& likely to turn out worse). If you can't find this in theaters, rent it as soon as you can. Just a great little film.",
      "review_date": "2009-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Transcends genre barriers and a hauntingly beautiful film about sacrifice, love, trust, and companionship.",
      "review_date": "2009-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Starts off kind of slow, but eventually goes somewhere. Horror fan or not, watch it.",
      "review_date": "2009-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A masterpiece. Tremendous acting, great score and some stunning shots, the scene where she jumps out the window or even the scene where the kid is being drowned and the body parts etc all fall in, no sound... the film is just a cinematic A masterpiece. Tremendous acting, great score and some stunning shots, the scene where she jumps out the window or even the scene where the kid is being drowned and the body parts etc all fall in, no sound... the film is just a cinematic masterpiece. No REMAKE is needed! I will not see it, and nobody else should either, they should see this film only. Tomas Alfredson directed this film to such a high point that i can't even think for a second that somebody can even touch it.",
      "review_date": "2009-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Striking cinematography, excellent score. It creates a very eerie atmosphere and is genuinely chilling at times. Very visual and intelligent. I am not a fan of vampire films, but this one is one of the best ones.",
      "review_date": "2009-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a really thought-provoking film! The cast of actors were good and i loved it.",
      "review_date": "2009-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "People, stop giving terrible movies, glowing reviews. This movie is terrible. In fact, that's an understatement. Save your precious time and see a different movie: this one is dull beyond belief. You'd actually have more fun People, stop giving terrible movies, glowing reviews. This movie is terrible. In fact, that's an understatement. Save your precious time and see a different movie: this one is dull beyond belief. You'd actually have more fun watching a tulip grow in your garden. So get outside, set up a lawn chair and stare at your beautiful tulip. I saw this movie 2 days ago. The acting is utterly horrible. I watched it to completion, hoping it would get better. Yet with each passing minute, I realized that was a pipe dream. An odd combination of a lonely 12 yr. old befriending a vampire, both of which are painfully boring to watch. I would have had more excitement tipping cows. Oh, I gave this movie 1 point because there was a pretty white cat in the movie that 'acted' quite well.",
      "review_date": "2009-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The start of the movie began bland and at first it was hard to tell if it was suppose to be thriller, horror or drama (i wouldn't know since im not swedish) and at first your thinking, this has got to be one of the worst movies The start of the movie began bland and at first it was hard to tell if it was suppose to be thriller, horror or drama (i wouldn't know since im not swedish) and at first your thinking, this has got to be one of the worst movies I've even seen....but then it begins to get better the further into the movie you go. Then you begin to feel sorry for a boy who can't defend himself against a few bullies. Then a boy meets a vamp chick, not a wanna be vamp chick....A REAL VAMPIRE. She just so happens to be his age sorta, which leaves you wondering just when is she gonna turn him? For some reason she has a fondness toward the boy....and what starts a a friendship begins to blossom into a subtle romance. In the end it was a good movie for those who look at the elements. Might not be everyones type of movie. It wasn't a 10 for me....but close enough. Those who like such a subtle not so violent and gore filled move will surely enjoy. I figure if I was swedish there would be more to it that I would understand. As Paul D said, one of the greatest endings in a movie i've ever seen. This is what american film still struggles to get right!",
      "review_date": "2009-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stunning slow burning film. Very reminiscint of Lost in Translation with er vampires. Wonderfully acted, great cinematography... loved every bit of it.",
      "review_date": "2009-04-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's very good, but only in swedish version.",
      "review_date": "2009-05-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is way overrated (we give it a generous 6/10) even without considering the poor dubbing. We didn't care for the characters and found the movie was dull. It really lacked depth and any kind of intensity. This film will not This film is way overrated (we give it a generous 6/10) even without considering the poor dubbing. We didn't care for the characters and found the movie was dull. It really lacked depth and any kind of intensity. This film will not please to everybody, despite its consistently good rating.",
      "review_date": "2009-05-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is brilliant. It's telling that you have to go to foreign cinema to see something made with quality and depth, rather than the hacked McDonald's-esque crap that Hollywood churns out for the teeny boppers (looking right This movie is brilliant. It's telling that you have to go to foreign cinema to see something made with quality and depth, rather than the hacked McDonald's-esque crap that Hollywood churns out for the teeny boppers (looking right at you Twilight). Definitely follow other reviewers advice and watch it in Swedish with English subs. This movie is stirring on a number of levels, I'll leave it at that. To the guy saying it lacked depth and intensity, I'll just say that it was there and then some, but it was clearly lost on you. Just one piece, that I'll keep spoiler-free, is the juxtaposition of Oskar and Eli's companion/guardian/EX?!?!....i.e. a glimpse of Oskar's future state.....anyhow, Twilight's there for those that prefer to be unchallenged. Anyhow, I'm glad it's getting so much critical respect, b/c it's well deserved.",
      "review_date": "2009-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pacing, script, cinematography... everything that could possibly go right in a production did in this one. My favourite movie of all time.",
      "review_date": "2009-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I personally loved the film the scors for the film are amazing osker in love and the farther are me personal favs i found the film gripping and i have seen it 5 times in 4 days day 1 i seen it on comp then bought the dvd getting the book I personally loved the film the scors for the film are amazing osker in love and the farther are me personal favs i found the film gripping and i have seen it 5 times in 4 days day 1 i seen it on comp then bought the dvd getting the book cant weight to read it gr8 film 10/10 one of the best vampire movies in a ages.",
      "review_date": "2009-08-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Disappointed by Twilight? Watch this and find out how good a vampire movie can be. (Although its so much more than just a vampire movie.)",
      "review_date": "2008-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "They always talk as if it's happened in reviews but here art truly collides with horror and what results is another dimension in the genre - maybe a little of what Carrie was after - but here horror is let loose in the sensitivity of They always talk as if it's happened in reviews but here art truly collides with horror and what results is another dimension in the genre - maybe a little of what Carrie was after - but here horror is let loose in the sensitivity of youth and makes for an amazing movie as it play across the face of Oscar. Brings to mind the Oscar in the Tin Drum (very similar).",
      "review_date": "2008-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Autentic and chilling, the atmosphere and attention to detail is impressive.",
      "review_date": "2008-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Masterful. The movie had no in-your-face scenes, no jump-out-of your-seat scares, and no scenes that weren't exquisitely composed and beautifully timed. It was good to see a movie that deserved its critical adulation. I was beginning to Masterful. The movie had no in-your-face scenes, no jump-out-of your-seat scares, and no scenes that weren't exquisitely composed and beautifully timed. It was good to see a movie that deserved its critical adulation. I was beginning to worry about them.",
      "review_date": "2008-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Owen Gleiberman never actually saw this movie. At least not sober.",
      "review_date": "2009-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Poignant in the it portrays the moral dilemma of a 12-year old around good and evil, does anyone deserve death as punishment, revenge and who can protect you when adults cannot empathize or understand you? Truly erie without being gorey and Poignant in the it portrays the moral dilemma of a 12-year old around good and evil, does anyone deserve death as punishment, revenge and who can protect you when adults cannot empathize or understand you? Truly erie without being gorey and sinister while simultaneously touching.",
      "review_date": "2009-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's very rare indeed that the supernatural is woven into the everyday so believably.The most enjoyable film I've had the absolute pleasure of seeing for ages.",
      "review_date": "2009-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw this film and I say that this is one of the best films of 2008, and the best thing is this film is not from the US. Awesome movie!!!",
      "review_date": "2009-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfect! If you only have $10 to watch a movie. This is the ticket! The one film You must see this year.",
      "review_date": "2009-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Recommend this to your friends - they will thank you.",
      "review_date": "2009-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was watching in it the middle of the night, while my roommate was sleeping. A few scenes had already brought me to the edge of tears and then something so shocking happened that I just inhaled, loudly. I didn't realize what had I was watching in it the middle of the night, while my roommate was sleeping. A few scenes had already brought me to the edge of tears and then something so shocking happened that I just inhaled, loudly. I didn't realize what had happened, but it just goes to show that it's a movie that grabs you emotionally and doesn't let go.",
      "review_date": "2009-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful movie. Not a perfect 10, but for all pretense and purposes I give it one.",
      "review_date": "2009-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best. Movie. Ever. Created. On. The. Face. Of. The. Earth.",
      "review_date": "2009-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film represent what a good terror film should be: blood, scary people, great atmosphere and an excelent story! I can't describe how impress I am about this 90 min thiller makes me feel. Impressive ending!! Just watch it.",
      "review_date": "2009-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the best movie of 2008 in my opinion. A dark and haunting fairy tale that has an ending for the ages. One of the absolute best endings I have ever seen in a movie. You will be thinking about it for days if not weeks. The use of music This is the best movie of 2008 in my opinion. A dark and haunting fairy tale that has an ending for the ages. One of the absolute best endings I have ever seen in a movie. You will be thinking about it for days if not weeks. The use of music is incredible in this movie and was the best use of music last year. The young actors are perfect in their roles. The film will no doubt be butchered by it's Americanized remake, but this nearly flawless swedish version deserves to be seen by everyone that considers themselves a movie person.",
      "review_date": "2009-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best horror films ever made. This could just as easily be a story of an innocent boy or girl who is abused or ignored by their parents and hence become enslaved by the evil of the world under the guise of friendship. I see no love One of the best horror films ever made. This could just as easily be a story of an innocent boy or girl who is abused or ignored by their parents and hence become enslaved by the evil of the world under the guise of friendship. I see no love story here. it seems obvious to me that the little vampire, who needs a replacement for her now incompetent familiar , sets her designs on the boy from the beginning. The story revolves upon itself. As the familiar was so will the boy become and vice versa. Superb film. Chilling and haunting.",
      "review_date": "2009-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It took a while to get goin but when it did it was a real suprise. I truley loved this movie. Wasn't sure what it was about when I first started watching it but it turned out to be an original yet familiar take on a vampire love story It took a while to get goin but when it did it was a real suprise. I truley loved this movie. Wasn't sure what it was about when I first started watching it but it turned out to be an original yet familiar take on a vampire love story between two young children. Brilliantly dark and moving right to the end, watch and enjoy",
      "review_date": "2009-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After shuffling restlessly in my seat waiting for some interest, at last the film began to pick up - as the end credits started to run!",
      "review_date": "2009-05-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dracula's daughter meets Nietzsche's adolescent angst with a tweeny bit of love thrown in the mix. The film was quite realistic, at least for a 12 year old vampire living in Sweden. Actually all kidding aside Let the Right One In Dracula's daughter meets Nietzsche's adolescent angst with a tweeny bit of love thrown in the mix. The film was quite realistic, at least for a 12 year old vampire living in Sweden. Actually all kidding aside Let the Right One In was superbly acted. The two main child actors were real gems. Let the Right One In was also immensely rich with emotional depth. If this film did have a fault is that it was that it was persistently morose. [***WARNING POTENTIAL SPOILER***] What the director interprets (or tried to project) as a happy ending really was horrifying. Either that or Swedes are more depressive than I thought. OK it could be interpreted that Oskar was not Eli's butt monkey Renfield in that he did not eat bugs and probably wasn't simply being used by her to fulfill a need as her feeling for him seemed genuine. But still he did run away from home to help a serial killer, granted vampire by necessity. Yet vampires need love too, right? I guess the crux of the film was about the powerful mutual connection that evolved be-tween these two even in the mist of the most darkest of contexts, pure unadulterated (another pun) violence. Also that Eli nor Oskar's violent fantasies weren't simply portrayed as evil. There was a certain isness about the film in general that avoided moralistic dualities. In this sense was the strong existential and stoic undercurrents. In short Let the Right One In is the thinking man's/woman's film. Personally I prefer Buffy & Angel which are also highly philosophical yet gave the viewers a much needed breaks using comedy and social drama. However for what it was Let the Right One In was right on the money. If Ingrid Bergman made a film about vampire's this would be pretty darn close to the end product he might create. This is a compliment. But at the same time it's not always easy to stick with a Bergman film. They are the type of films you work at and hopefully come away with something more than just the taste of eye candy. In this case mission accomplished.",
      "review_date": "2009-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is such a beautiful film. It's dark and sad but at the same time it's warm in a special kind of way and there were some moments that made me smile a bit.",
      "review_date": "2009-05-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a good film IF YOU WATCH IT IN ITS ORIGINAL LANGUAGE WITH SUBTITLES. Do not, I repeat, do not watch this with the horribe english dub. Why would you watch that anyways? Haven't you learned by now that all dubs ruin films? This is a good film IF YOU WATCH IT IN ITS ORIGINAL LANGUAGE WITH SUBTITLES. Do not, I repeat, do not watch this with the horribe english dub. Why would you watch that anyways? Haven't you learned by now that all dubs ruin films? Nothing philosophical here, just a simple good film. Watch it on DVD and switch the audio to swedish with eng subtitles and enjoy something different.",
      "review_date": "2009-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Finally watched this last night, and its quickly went into my list of favorite films. A classic.",
      "review_date": "2009-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Spellbinding and the swimming pool scene is pure genius.",
      "review_date": "2009-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ponderous and empty, minimalism at its absolute worst. And a big fat lol at the glorifying reviews so many vote bots seem so fit to aim at this exercise in dullness. The acting is bland, very stiff dialog and no progression in either the Ponderous and empty, minimalism at its absolute worst. And a big fat lol at the glorifying reviews so many vote bots seem so fit to aim at this exercise in dullness. The acting is bland, very stiff dialog and no progression in either the development of the characters or the story itself. For a worthwhile outlandish 'horror', I suggest you turn to Korea in stead of Sweden. For drama, anything else will do.",
      "review_date": "2009-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Because of the glowing reviews, the hype, and the fact that I liked the premise, this is one of those movies that I went to expecting, and wanting to like. And it is one of those movies that I spent a lot of time trying to convince myself Because of the glowing reviews, the hype, and the fact that I liked the premise, this is one of those movies that I went to expecting, and wanting to like. And it is one of those movies that I spent a lot of time trying to convince myself that I was enjoying it. But at some point, (past the midway point), I finally gave up, and admitted this movie wasn't really working for me. From a narrative point of view, this story is a little too meandering. It definatively could have been tighter. I also left the theater thinking this story had been told from the wrong p.o.v. I would have preferred the story had been told from the girl's/vampire's point of view, than from the young boy's. It would have given us a better feel for her character. As it was I think her character was really kind of underwritten, and she almost comes off more as a plot devise, than as a real character. I understand the desire in a movie like tjhis is to have the vampire comes off as \"mysterious\", but you should be able to capture that with good, nuanced writing, rather than short-changing the character with the writing. I also keep reading that this is a great horror movie. But this isn't the least bit scary, nor suspenseful. What it really is, is an offbeat love story between 12 year-old children, dressed-up as a vampire story. And there is nothing wrong with that idea. All-in-all, this isn't a bad movie. It just isn't nearly as good as it has been made out to be.",
      "review_date": "2008-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "!! Sort of a spoiler warning !! This movie would get a 10 from me were it not for the overdone ending. That aside this is a wonderful movie. Ah if Hollywood would pay this much attention to the CRAFT of moviemaking. Go to this movie and !! Sort of a spoiler warning !! This movie would get a 10 from me were it not for the overdone ending. That aside this is a wonderful movie. Ah if Hollywood would pay this much attention to the CRAFT of moviemaking. Go to this movie and drink in the wonderful camerawork, setting, STORY and attention to detail. What a magical mixture of horror and coming-of-age. Where do they find these great young actors? Hollywood eat your bloody hearts out.",
      "review_date": "2008-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I completely agree with reviewer Ken G. I had read so many incredible reviews for this film and the trailer had me wanting so much more. Then, when I did see it, my final impression was \"yeah, it's good but not as good as advertised.\" I completely agree with reviewer Ken G. I had read so many incredible reviews for this film and the trailer had me wanting so much more. Then, when I did see it, my final impression was \"yeah, it's good but not as good as advertised.\" For me, there were just too many unexplored plot points that would've made this story so much more compelling (i.e. when Oskar is asking Eli about what vampires can/cannot do). I applaud the original take on the vampire genre and the subtle acting (especially from Lina Leandersson as Eli) but it's not the be-all, end-all.",
      "review_date": "2008-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't quite give it a perfect 10, because it is not the perfect movie. However, the movie is a heck of a lot more promising than Twilight. The movie tells like a vampire movie, but the whole time keeps you in ambiguity. You can't I can't quite give it a perfect 10, because it is not the perfect movie. However, the movie is a heck of a lot more promising than Twilight. The movie tells like a vampire movie, but the whole time keeps you in ambiguity. You can't decide if she is, or is not a vampire till the end. All the while, the movie explorers early adolescence and sexuality to a T. It is a great film and is on my top 10 for 2008.",
      "review_date": "2008-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is/is not a horror movie. This is/is not a coming of age story. This is/is not a story about outsiders. This IS one of the most intriguing, thought provoking films you will see this year. You will be talking about it for days afterward. This is/is not a horror movie. This is/is not a coming of age story. This is/is not a story about outsiders. This IS one of the most intriguing, thought provoking films you will see this year. You will be talking about it for days afterward. First class film-making.",
      "review_date": "2008-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie of 2008, it is gruesome, scary, profoundly movie, and has an amazing charm. I couldn't find a single flaw.",
      "review_date": "2008-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First of all, I agree with some other critics, this is what Twilight should have been. I liked this movie and its slow but it grows on you. The main character slowly develops a relationship with a 12 year old femaile vampire. At the end we First of all, I agree with some other critics, this is what Twilight should have been. I liked this movie and its slow but it grows on you. The main character slowly develops a relationship with a 12 year old femaile vampire. At the end we realize, the vampire is not a 12 year girl but a very old killer who needs a new guide in this human world.",
      "review_date": "2008-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I walked out of the movie, looked at my buddy Bobby, and said \"that may have been the best movie I've ever seen\". First off, I didn't know it was a vampire flick. I just thought it was a movie about bullies & subsequent revenge. I walked out of the movie, looked at my buddy Bobby, and said \"that may have been the best movie I've ever seen\". First off, I didn't know it was a vampire flick. I just thought it was a movie about bullies & subsequent revenge. But man, it was so much more. A coming of age, romance, revenge, vampire flick may come close to describing it. The pace of the movie, the direction, the cinematography, the acting, the set pieces - all top-notch. To be a classic a movie must have an amazing ending. Think Butch Cassidy, The Graduate, Planet of the Apes, The Sixth Sense. On that standard alone, this movie is an instant classic. Nothing else this year will come close.",
      "review_date": "2008-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is the alternative to Twilight that actually pays off! The movie is brilliantly written and is indescribable in various instances. I think this movie will introduce many people to the concept of love from another point of view. In This movie is the alternative to Twilight that actually pays off! The movie is brilliantly written and is indescribable in various instances. I think this movie will introduce many people to the concept of love from another point of view. In our society we have too many love stories about upholding the human spirit and beating all the odds; superhero sort of love. This movie will introduce people to the world of tragic love. It teaches us how being broken doesn't mean we are incomplete. That love can complete one another and can overcome true psychological barriers. A must see.",
      "review_date": "2009-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favourite films in recent memory. The relationship between the two lead characters moved even my stone heart, and had me thinking for sometime after it finished - trying to figure out Eli's exact attitude or intentions toward One of my favourite films in recent memory. The relationship between the two lead characters moved even my stone heart, and had me thinking for sometime after it finished - trying to figure out Eli's exact attitude or intentions toward Oscar but then taking some comfort in the fact that, even if the intentions were darker than I would ideally like them to be, they both need and fit with each other. Don't mean to lose anyone there. This is quite a bizarre film but one that I would highly recommend, as somebody once recommended to me. The film was stunningly bleak to look at and its slow pace went down well with me. The two twelve year-old actors, playing twelve year-old characters, were incredible and it was crucial that this was the case because child actors can be pretty banal sometimes. I hear Hollywood are doing a remake but plan to call it \"Let me in\" because that is more catchy. Sounds like a tragedy already.",
      "review_date": "2009-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A dark, brooding vampire film with sub-titles and two 12 year old kids as the leads. Impossible? Friday the 13th Part 27, right? Nothing is impossible. Let The Right One In is one the the best horror movies of the last decade. Be Afraid. Be A dark, brooding vampire film with sub-titles and two 12 year old kids as the leads. Impossible? Friday the 13th Part 27, right? Nothing is impossible. Let The Right One In is one the the best horror movies of the last decade. Be Afraid. Be Very Afraid!",
      "review_date": "2009-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perfect. The young actors are brilliant, the story is intriguing, and there's a constant stream of anxiety and paranoia. The sounds that curdle when Eli gets hungry; the pale and muted color pallet; it all combines to make a twisted but Perfect. The young actors are brilliant, the story is intriguing, and there's a constant stream of anxiety and paranoia. The sounds that curdle when Eli gets hungry; the pale and muted color pallet; it all combines to make a twisted but absolutely beautiful film. It is more about these two young kids and their inevitable relationship. They relate on the fact that they are lonely in this world. The vampire myths are played to full, dramatic effect here, yet some how render more realistic than they would in say, Buffy. Also, the side-plots about his parents are interesting and sad. His mom hardly ever talks to him unless he's being yelled at, and his father gets his hopes up on togetherness but just throws it all away for a few shots. This movie is amazing, with gore that is not really unnecessarily gory, and violence that only helps seam together the film. A+.",
      "review_date": "2009-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie. I am shocked that it wasn't nominated for any Academy Awards. It should have been nominated in at least three catagories... I will at least give it the award for \"Best Movie I've Seen In A Very Long Time\".",
      "review_date": "2009-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the most affecting and fascinating movies I have ever seen. Hopefully it's cult will continue to grow.",
      "review_date": "2009-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My top pick of 2008, regardless of genre. Elegant, maddening and moving: the most frightening characters were all too human.",
      "review_date": "2009-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the movie that will make me completely reevaluate the way I interpret metacritic and rotten tomato ratings. There is absolutely nothing that separates this movie from a million other boring, cheesy vampire movies except for the poor This is the movie that will make me completely reevaluate the way I interpret metacritic and rotten tomato ratings. There is absolutely nothing that separates this movie from a million other boring, cheesy vampire movies except for the poor voice dubbing. For the life of me, I cannot figure out how so many critics can give such a poor movie such high marks. If I could say anything it would be please, please, please don't see this movie. In fact, go to the video store, steal as many copies as possible, and burn them so no one has to go through what I did.",
      "review_date": "2009-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A vampire film with as much heart as gore. No patent leather, slick-fashion-wear, or uber-cool characters turn this into a puberty-struck superhero fantasy. The casting and acting is superb. There is a real sense of intimacy and empathy for A vampire film with as much heart as gore. No patent leather, slick-fashion-wear, or uber-cool characters turn this into a puberty-struck superhero fantasy. The casting and acting is superb. There is a real sense of intimacy and empathy for the young characters. Occasional, but awesome special effects add little shocks in this minimalist treatment. The director's use of mise-in-scene is all the more artistic when coupled with the stark scenery. This is the best vampire film I've seen. Due to language patterns, hearing the original Swedish with English subtitles sounds more emotive than the dubbing.",
      "review_date": "2009-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Gems like these are a dime a dozen. A title worthy of universal acclaim. Who would have thought that two 12 year old lovers could possess the intensity to surpass adult dramas.",
      "review_date": "2009-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't explain how it did it, but this film completely drew me into the quiet atmosphere and it really moved me emotionally. I was thinking about it for days afterward. So beautiful.",
      "review_date": "2009-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's one of the most beautiful movies I've ever seen. And touching. I wasn't expecting it when I watched but I was really surprised and pleased with this movie and specially with the actors. they were brilliant.",
      "review_date": "2009-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best love stories, one of the best vampire movies, and it is beautifully crafted.",
      "review_date": "2008-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie... well-done in its conception, but of course, misses on using a lot of potential. Depending on how good your imagination is this will either affect your opinion a lot or not at all. Still highly recommended viewing.",
      "review_date": "2008-12-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A child falls in love with a vampire in a bloodless, faded town",
      "review_date": "2008-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm speechless........so beautiful, sad and touching. Especially Lina Leandersson's performance is sensational.",
      "review_date": "2008-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply put, one of the most engaging movie experiences of the decade, even if it moves at a pace that some may describe as glacial, and leaves many questions unanswered. Which is part of its power. The stunning contrast of the wintry Simply put, one of the most engaging movie experiences of the decade, even if it moves at a pace that some may describe as glacial, and leaves many questions unanswered. Which is part of its power. The stunning contrast of the wintry stillness and the sudden bursts of red-blooded violence brings to mind the sometimes surreal world of pre-adolescence, where the extraordinary coexists with the dullness of the world of the adults. An instant classic if there ever was one, it dwarfs all recent efforts in the genre, and once its subtle but powerful fangs sink in your mind you may find yourself haunted for a very long time.",
      "review_date": "2009-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nDefinitely one of the most original vampire stories I've seen in a long time, with an odd mixture of childlike innocence and gore.  In the end, though, it's not completely compelling and some of the situations require a herculean suspension of disbelief, such as when victims are being killed in what is practically broad daylight... out in the open... with lots of witnesses... and those witness barely register any emotional response or even call the police.  On top of that, it's a bit slow.  The two young leads act their parts brilliantly, however there rest of the characters are mere caricature.",
      "review_date": "2010-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captures the quiet eeriness and beauty of the Swedish landscape just as well as it confidently maps the contours of human sociality.  The combination of the two geographies sears itself more deeply into memory than the pomp and circumstanceCaptures the quiet eeriness and beauty of the Swedish landscape just as well as it confidently maps the contours of human sociality.  The combination of the two geographies sears itself more deeply into memory than the pomp and circumstance of more ambitious (but less effective) films.  Redeems chocolate as a symbol for love.",
      "review_date": "2010-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Boy gets bullied at school, meets strange girl, becomes friends, people get murdered in the town, learns Morse code, hits back at bullies, strange girl isn't what she seems.Swedish film which is a sort of dark fairytale about adolescence inBoy gets bullied at school, meets strange girl, becomes friends, people get murdered in the town, learns Morse code, hits back at bullies, strange girl isn't what she seems.Swedish film which is a sort of dark fairytale about adolescence in a small town.The two main actors are excellent & has some beautiful cinematography & atmospheric music to get the feel of the place.It is quite slow in parts but overall a lot better than some of the other vampire films that have been made recently.",
      "review_date": "2010-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Having just read the original book by John Ajvide Lindqvist, I was really looking forward to finally seeing this. I wasn't disappointed, but couldn't help but feel a little underwhelmed due to the amount of plot that didn't make theHaving just read the original book by John Ajvide Lindqvist, I was really looking forward to finally seeing this. I wasn't disappointed, but couldn't help but feel a little underwhelmed due to the amount of plot that didn't make the transition from page to screen.A good film, but not on a par with the book.",
      "review_date": "2011-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A perfect movie. Went in expecting a decent vampire flick. Was totally blown away. It wasn't just a great vampire movie, it was a great movie in general. I highly recommend this to any cinema lovers out there.",
      "review_date": "2012-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Overall, this was truly a story for the intellect, after watching I sat for days unable to watch another movie, or even think about anything else really. The movie was a haunting, original take on vampires, which is refreshing in light of theOverall, this was truly a story for the intellect, after watching I sat for days unable to watch another movie, or even think about anything else really. The movie was a haunting, original take on vampires, which is refreshing in light of the new \"Teen Vampire\" fad. It was a beautiful movie about companionship and the true nature of evil. Could not have been a better cast selected for these children. Everyone should see this movie, because it's difficult to describe what it makes you feel. Definitely a unique experience.",
      "review_date": "2010-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "*No spoiler review* An atypical vampire story done right...finally! If you are sick and tired of the sexy and sleak vampire stories of recent times like Twilight or True Blood (and I certainly am) give this movie a watch; I can't see how you*No spoiler review* An atypical vampire story done right...finally! If you are sick and tired of the sexy and sleak vampire stories of recent times like Twilight or True Blood (and I certainly am) give this movie a watch; I can't see how you could possibly be disappointed. For the story/plot I give the movie 8 out of 10. The story has the best of both worlds when it comes to American vs Foreign cinema. While it progresses at a pace that doesn't allow for drowsiness it still unfolds calmly and with a good amount of mystery; and things are not always explicitly explained, which I love. Aesthically/visually I give the movie 8/10. The cinematography is beautiful and there are sometimes some really interesting and creative shots. This movie definitely utilizes the power of visual storytelling. I would also like to point out in this section that the music is awesome! It's a really ambient orchestral score that fits totally well in the context of the movie and also stands on its own at times. Overall this film was top notch and one of the best movies in general I've seen in a while. I was completely engrossed from start to finish and I plan on watching it a second and third time very soon (if that's not a positive review of a movie I don't know what is). I took away 2 points out of 10 from my score because of a certain very silly scene involving some cats (you'll know when you see it) and because while it is freakin' awesome (seriously, see it) it is not so big a revelation as to warrant a 9 or 10 score reserved for the truly best pictures out there. There's no reason to be hesitant or timid about seeing this. It has such a high user AND critical score for a reason. Stop reading reviews and rent or stream this on a night when you can be engaged in a good movie. Don't sacrifice this beauty to that \"I'm pretty tired so I'll just throw on this movie until I fall asleep and finish it tomorrow\" kind of night.",
      "review_date": "2010-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Given that the film is originally from Sweden gives the film edge before even viewing it, but this film is mainly a series of events tied together. It's mainly centered on Oskar, who is being bullied by his classmates but never has theGiven that the film is originally from Sweden gives the film edge before even viewing it, but this film is mainly a series of events tied together. It's mainly centered on Oskar, who is being bullied by his classmates but never has the courage to strike back. Then he meets Eli, a girl who is about his age and they slowly start to fall for each other. But Eli is leaving out one little detail, she is a blood sucking vampire! With an implication that Oskar is lonely, he soons accepts the fact that she is one because he loves her. Eli is tied to bloody deaths around the town, but the director focuses more on Eli's and Oskar's relationship and there sides of the family rather than criminal investigations and the creature feature aspect. He does it simply by positioning the camera's in a wide shot where the action is happening. Unlike American horror, \"Let the Right one In\" excludes any crescendos and develops a nice storyline that keeps you interested, but everything appears blan.",
      "review_date": "2010-11-22",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 130,
  "genres": [
    "Drama",
    "Mystery",
    "Thriller",
    "Fantasy",
    "Horror",
    "Romance"
  ]
}