{
    "title": "Slumdog Millionaire",
    "rating": 7.8,
    "release_date": "2008-11-12",
    "genre": [
        "Drama",
        "Romance"
    ],
    "summary": "Slumdog Millionaire is the story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India’s “Who Wants To Be A Millionaire?”But when the show breaks for the night,Slumdog Millionaire is the story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India’s “Who Wants To Be A Millionaire?”But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show’s questions. Intrigued by Jamal’s story, the jaded Police Inspector begins to wonder what a young man with no apparent desire for riches is really doing on this game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. [Fox Searchlight]… Expand",
    "critic_reviews": [
        "Four stars simply aren't enough for Danny Boyle's Slumdog Millionaire, which just may be the most entertaining movie I've ever labeled a masterpiece in these pages.",
        "This is a breathless, exciting story, heartbreaking and exhilarating at the same time.",
        "Director Danny Boyle's riveting and kaleidoscopic tale, based on Vikas Swarup's debut novel \"Q and A,\" is exquisitely adapted to the screen by Simon Beaufoy.",
        "Slumdog Millionaire is the film world's first globalized masterpiece.",
        "The story may stretch credibility until it's ready to pop its seams, but Patel conveys the simple confidence of a prodigy who has learned everything important in life, except how to lie.",
        "It doesn't happen often, but when it does, look out: a movie that rocks and rolls, that transports, startles, delights, shocks, seduces. A movie that is, quite simply, great.",
        "You may even feel like dancing in the aisles yourself. Sure, the real world doesn't always work this way. Have you forgotten that this is one of the reasons why we go to movies in the first place?",
        "Slumdog Millionaire dives headfirst into something greater than a subculture - the enormous unchronicled culture of India's mega-slums - and achieves even more sweeping impact.",
        "A terrific yarn, one so engrossing and surprising that the nature of the story's structure -- each question Jamal gets asked on the show corresponds with a traumatic or momentous moment from his childhood -- never feels like a contrived framing device.",
        "Danny Boyle's finest since \"Trainspotting.\" In fact, it's the best British/Indian gameshow-based romance of the millennium.",
        "Romantic, action-packed and always held together by an intriguing social conscience, Slumdog Millionaire is a rapturous crowd pleaser.",
        "Slumdog Millionaire features the simplest story Boyle has ever told, which may explain why its many pleasures are so pure.",
        "This is Boyle's fullest, most satisfying work and an audience-pleaser that deserves to be a big hit.",
        "An almost ridiculously ebullient Bollywood-meets-Hollywood concoction--and one of the rare \"feel-good\" movies that actually makes you feel good, as opposed to merely jerked around.",
        "Boyle has been nothing if not bold with this film. He's dared to use so many venerable movie elements it's dizzying, dared us to say we won't be moved or involved, dared us to say we're too hip to fall for tricks that are older than we are.",
        "Like all good fairy tales, this outsize celebration of perseverance and moral triumph contains within it a deeper idea -- in this case, the relative nature of what we think we know, and what's worth knowing at all. No doubt Dickens himself would approve.",
        "The whole thing is irresistibly preposterous.",
        "Like Mumbai, Slumdog pulses and throbs with raw, unadulterated life and the hope for a better Bombay, today. It's brilliant.",
        "The result is magical and life affirming, and will enrapture those who are not scared away by the mention of \"subtitles.\"",
        "Brimming with humor and heartbreak, Slumdog Millionaire meets at the border of art and commerce and lets one flow into the other as if that were the natural order of things.",
        "A great movie is something more than the sum total of all its parts, and here, the elements all come together to form a feature that speaks a universal form of optimism that isn't likely to get lost in translation, no matter where it screens, or who is watching.",
        "Boyle, one of the premier stylists in the world fills \"Slumdog\" with ebullient energy and ceaseless invention.",
        "Absolutely perfect family entertainment for anyone over the age of ten. It is a celebration of not just the usual triumph of the human spirit, but a celebration of the human experience.",
        "Despite its elements of brutality, this is a buoyant hymn to life, and a movie to celebrate.",
        "It's a stunner.",
        "Slumdog Millionaire is nothing if not an enjoyably far-fetched piece of rags-to-riches wish fulfillment.",
        "After last year's black-hearted \"No Country for Old Men,\" the Oscars may well be in the mood to embrace a fairy tale sampling every imaginable genre, with a note of triumph accompanying even the worst suffering, capped by the snazziest ending money can buy.",
        "What's perhaps most fascinating about the film is Boyle's relentless focus on the realities of present-day India as a vehicle for his spectacle and laughs.",
        "Driven by fantastic energy and a torrent of vivid images of India old and new, Slumdog Millionaire is a blast.",
        "In the end, what gives me reluctant pause about this bright, cheery, hard-to-resist movie is that its joyfulness feels more like a filmmaker's calculation than an honest cry from the heart about the human spirit (or, better yet, a moral tale).",
        "A stylish, ingeniously constructed bit of hokum, a sparkling trinket of a movie that's as implausible as it is irresistible.",
        "The movie brushes against some of India's worst social ills, but it's essentially a fairy tale.",
        "What IS surprising is the unembarrassed energy that Boyle devotes to his pursuit of the obvious; there’s nothing wrong with the formulaic, it would appear, so long as you bring the formula to the boil.",
        "The entire film has the glibness of a music video. Boyle has managed to make dire poverty seem glossy.",
        "The real star of the film is not a person but a city, the vertiginous, exciting, massively overcrowded \"maximum city\" of Mumbai. On one hand, this environment of Dickensian, almost hallucinatory contrasts between rich and poor, good and evil feels perfect for Danny Boyle.",
        "Doesn't hit its stride until the last 30 minutes, and by then, it's just a little too late."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nBeautiful and emotionally satisfying. There is no other way to describe \"Slumdog Millionaire\". I know a lot of films have already showed poverty and violence before and the ending is quite predictable, but what matters here is not how it ends but what it takes to make us cheer so much for Jamal.",
            "review_date": "2011-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I just read David W's review. He must be a young man and doesn't get it. India really treats its citizen's this awful. The country is overcrowded, corrupt and only the strong survive. If you are from the slums as the lead I just read David W's review. He must be a young man and doesn't get it. India really treats its citizen's this awful. The country is overcrowded, corrupt and only the strong survive. If you are from the slums as the lead characters were you have only a 20% chance of surviving. If the people don't kill you the disease and poverty surely will. Yes, the premise of the movie \"Who wants to Be a Millionaire\" isn't a true story but the lifestyle hits the nail on the head. I guess David still lives in a comic book fantasy world. Without question one of the best movies in many a year and should sweep the OSCARS for Best Picture, Best Directing and Best Screenplay.",
            "review_date": "2008-12-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Despite my scepticism this is finally a movie worthy of the hype. Great storyline, superb acting from all and excellent direction make this movie one of the best of the last five years. If you haven't seen it, watch it now. It will be worth it.",
            "review_date": "2012-07-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am giving this movie three stars which it deserves just because of the cinematography and some other minor things. Else this movie is trash. I bet if an Indian director would have made this, it wouldn't have been considered even eligibleI am giving this movie three stars which it deserves just because of the cinematography and some other minor things. Else this movie is trash. I bet if an Indian director would have made this, it wouldn't have been considered even eligible for the Oscars. The dirtiness in this movie makes me retch. There wouldn't be a mortal on the planet called earth who could jump into **** for getting an autograph of Amitabh Bachan. And as if AB will give it as well!And I hated the dialogue when Jamal says: \"This is the real India,\" when a police constable was beating him up barbarically, and then an American interrupts and gallantly produces some dollars from his purse, saying \"Let us show him the real America.\" or something like that. That made me shut my television off. Of course the movie didn't instill any excitement when Jamal was about to answer a question on the game show. You know that it is gonna be right. But the cinematography and the background music was great. And following Jamal through his journey is not all that bad, though. It is exciting sometimes. The love story which runs parallel is somewhat fascinating.This is a movie worth watching, but don't overestimate it as an award winner. Certainly if you are a non- Indian, it would be a new experience.",
            "review_date": "2011-07-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well deserved oscar! The movie is incredible! The ending was a bit rushed (no spoiling) but overall i think that this is a movie directed so well, that you don't want to miss.",
            "review_date": "2017-01-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slumdog Millionaire is Danny Boyle's worst film so far. Boyle tried to ambitiously replicate Fernando Meirelles' City of God - a true modern masterpiece about life on the outskirts of Rio De Janeiro - but he failed miserably. It's one ofSlumdog Millionaire is Danny Boyle's worst film so far. Boyle tried to ambitiously replicate Fernando Meirelles' City of God - a true modern masterpiece about life on the outskirts of Rio De Janeiro - but he failed miserably. It's one of those terribly cliched and predictable movies where the lovable loser wins at the end and gets the girl and the money. The acting is weak and there's a glaring lack of substance. There's not a single transformation portrayed, no character arc just an overflow of sappy moments. It doesn't resemble a shred of reality and it completely skips the true horrors of being born in poverty. I have lived in England all my life but even someone as unaware as me could point out that kids who serve tea in India with no parents don't speak in English, certainly not with hints of a British accent. The film says that the only hope to escape poverty is by fortuity and for that people flourish it with awards? Danny Boyle's crowd pleasing \"art\" film is the very definition of mediocrity. It's manipulative trash simply made for the sole purposes of winning awards.",
            "review_date": "2015-01-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "How this dreadful movie won an Oscar for best picture is beyond me. It's so dull, drawn out, and silly that one has difficulty understanding where crtics found their praise. The work is drab, dreary and smacks of amateurism to the nth degree.How this dreadful movie won an Oscar for best picture is beyond me. It's so dull, drawn out, and silly that one has difficulty understanding where crtics found their praise. The work is drab, dreary and smacks of amateurism to the nth degree. The record shows that Hollywood Academy of Motion Pictures changed the way they vote for Oscars due to the selecton this dog of a movie.",
            "review_date": "2015-07-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A liberating and uplifting movie and the feel-good film of the decade, Danny Boyle delivers the Oscar Winning Slumdog Millionaire. And it's easy to tell why the film has won numerous awards. The film focuses upon Jamil Malik (Dev Patel) an 18A liberating and uplifting movie and the feel-good film of the decade, Danny Boyle delivers the Oscar Winning Slumdog Millionaire. And it's easy to tell why the film has won numerous awards. The film focuses upon Jamil Malik (Dev Patel) an 18 year old orphan from the slums of Mumbai and a constant on the Indian version of Who Wants To Be A Millionaire, who is one question away from winning 20 million rupees. However he arrested in suspision of cheating. During his interrogation Jamil reveals his incredible and heartwrenching story of his life as a young boy growing up on the streets of Mumbai with his brother Salim, and how he loved and lost the girl of his dreams Latika (Freida Pinto), each question links to a memoir of Jamil's exhilarating life. Superbly well directed in the ever capable and inspring hands of Danny Boyle who delivers a beautiful film from start to finish and one that will live long in the memory, utterly unmissable!",
            "review_date": "2011-05-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slumdog millionaire does suffer from some silly dialogue, but the film is beautifully filmed, mighty, wondrous, romantic and just fantastically acted. It deserves its Oscar. I give this film 87%.",
            "review_date": "2012-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Extremely overrated. Poor acting.An annoying cacophony atop a predictable structure.I want those 2 hours of my life back.",
            "review_date": "2009-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Eye-rollingly formulaic. This one wins the \"Pan's Labyrinth\" critically overrated film of the year award. Today's filmmakers have no clue how to tell a compelling story. Just another style over substance fluff-job.",
            "review_date": "2009-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most overrated films of the year in addition to The wrestler, Rachel getting married,the visitor,che or Frost/Nixon. Slumdog millonaire is a bad film and a bored bored bored film.",
            "review_date": "2008-11-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "slumdog millionaire is just a group of plot devices moving through a childishly contrived plot,\rdoing solely what said plot requires them to do, with no heart to make me believe otherwise.\r\r\nthese anti-characters go through NO developmentslumdog millionaire is just a group of plot devices moving through a childishly contrived plot,\rdoing solely what said plot requires them to do, with no heart to make me believe otherwise.\r these anti-characters go through NO development or change whatsoever, they begin the terrible\r\"story\" as good or evil, with no grey area, and remain good or evil when the \"story\" ends, they don't even have much personality, jamal is good... because he's good, latika is good...\rbecause she's good, saleem is bad... because he's bad... they have no logical motivation, and\rbefore you try and tell me that saleem killing the owner of an orphanage/brothel is what made\rhim evil... NO, saleem lets go of latika when they're escaping, saleem locks jamal inside a toilet, forcing him to swim through feces to get out (which is played for laughs)... saleem is a terrible person before he shoots the guy, and he's a terrible person after he shoots the\rguy... the fact that these aren't characters means the only time i care about anyone in the entire movie, is when saleem, latika and jamal are children... solely because they're little children, and nobody with a conscience can refuse to care about children who go through\rhorrific torture and... WAIT WHAT??? that's right, this film centres around the torturing of children, the prostitution of children, the emotional suffering of children, you get the point, now let me explain why this is a problem, THIS IS WIDELY ACCEPTED AS ONE OF THE BEST FEEL-GOOD MOVIES OF 2008, doesn't the physical/sexual/emotional abuse of children just make any sane person feel all warm and fuzzy inside? I SINCERELY HOPE NOT! jamal and saleem had a terrible childhood which is revealed through flashbacks as terrible\ras the things they depict, it is from these flashbacks that jamal knows all the answers to\rthe questions presented in an indian \"who wants to be a millionaire\" (which is impossble to\rcheat in, because only the host knows the questions/answers, and every variation of the show\ronly uses LANDLINES to prevent connection failure, which renders two major plot points in the film completely invalid), but the most gaping plot holes arise when two of these flashbacks DO NOT EVEN GIVE JAMAL THE ANSWER, OR THE CHANCE FOR JAMAL TO FIGURE OUT THE\rANSWER!!!\r oh, and they don't show jamal completing the general knowledge questions REQUIRED to appear\ron every variation of the show, which he would have failed at, because he is unaware that\rghandi is on every piece of indian currency (even though he clearly earns indian money\rthroughout the movie), if he doesn't know that, how much more does he not know? this alone\rrenders the ENTIRE PLOT invalid...\r jamal went on the show because latika loves the show, and he loves latika, which is oh so\rIMPOSSIBLE TO BELIEVE BECAUSE JAMAL AND LATIKA HAVE NO CHEMISTRY, THEY HAVE NO COMMON\rINTERESTS, THEY DON'T EVEN HAVE AN IN-DEPTH CONVERSATION IN THE ENTIRE MOVIE, this is what i meant when i said 'no logical motivation' jamal and latika are in love solely because the plot needs them to be, and dear god does it show.\r oh, and then there's the ending, now, all throughout the movie, there is a consistent theme: money is evil, so what happens... HE WINS!!! if the movie had any logical messages he would have lost, and realised, alongside the audience, that money isn't everything, but no...\r let me leave you with this: slumdog millionaire won eight oscars.",
            "review_date": "2013-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this is the movie which deserve two awards to sy the least.THE MOST OVERRATED MOVIE & THE BEST FEEL-GOOD MOVIE TO THE WEST.all the director does at his best is that to portray India as a big slum.all the shady characters are Indians and thethis is the movie which deserve two awards to sy the least.THE MOST OVERRATED MOVIE & THE BEST FEEL-GOOD MOVIE TO THE WEST.all the director does at his best is that to portray India as a big slum.all the shady characters are Indians and the occassional foriegn tourists are the only messiahs.very cool indeed.I think it is well hatched plot by the academy to give awards to two indians who worked with the film so that they can be sure it will grab the attention of India.Rahman has given to Indians sweeter melodies than jai ho to the Indians.Its a very poor attempt to showcase the poverty of India so that the westerners can feel good about themselves.same can be said abt the Booker Prize given to Aravind Adiga.Pure, unadultrated crap.",
            "review_date": "2009-09-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really to stop watching this movie right at the beginning. Just 5 minutes into the movie, I knew it was going to be a really bad cliche movie and it was. It was an insult to see this movie to have so much acclaim and the credits of this I really to stop watching this movie right at the beginning. Just 5 minutes into the movie, I knew it was going to be a really bad cliche movie and it was. It was an insult to see this movie to have so much acclaim and the credits of this movie cut the cake to how shitty this movie it was. The only thing that this movie did for me was to feel bad for the country of India but that's because they depict so badly in this movie.",
            "review_date": "2010-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i was looking forward to seeing this because everyone i know enjoyed it, but i thought it was boring, drab, and over-rated.  Needs to recolor some of the subtitles, white text on a yellow background (i believe it was a car) is damn neari was looking forward to seeing this because everyone i know enjoyed it, but i thought it was boring, drab, and over-rated.  Needs to recolor some of the subtitles, white text on a yellow background (i believe it was a car) is damn near impossible to read.\r The story was nice, i like the concept, just didn;t do it for me as a film.",
            "review_date": "2009-07-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "@erin I'm sorry? India is in every sense a free country, which I can say, being an Indian myself. About the film: Ok, but there are much better films out there. I did not like the movie much as it shows India in a bad sense, and I love @erin I'm sorry? India is in every sense a free country, which I can say, being an Indian myself. About the film: Ok, but there are much better films out there. I did not like the movie much as it shows India in a bad sense, and I love my country. The acting was good.",
            "review_date": "2010-04-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Contrived Plot",
            "review_date": "2009-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why this predictable, schmaltzy movie won Best Picture and is being so widely praised is beyond me. THE DARK KNIGHT, RACHEL GETTING MARRIED, VICKY CHRISTINA BARCELONA, THE WRESTLER and WALL-E were all far better movies.",
            "review_date": "2009-02-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This may be the worst movie ever made. I take that back. \"From Beyond\" is the worst. This one is second. Not one of the reviews I've read even mentioned the aspect of the persecution of the Muslims in a Hindu country. Where is the moralThis may be the worst movie ever made. I take that back. \"From Beyond\" is the worst. This one is second. Not one of the reviews I've read even mentioned the aspect of the persecution of the Muslims in a Hindu country. Where is the moral indignation at India for this racist behavior? The reviewers all mention the vibrant colors of the slums. That makes it the best film of the year? Why should we be visually assaulted watching a movie? Crap.This movie is crap.",
            "review_date": "2009-03-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the Worst films that i have watched in the past 5 years. It was trying to be funny at some points without even being close to funny. I never felt for any of the characters. If they both would have gotten shot and died i would have One of the Worst films that i have watched in the past 5 years. It was trying to be funny at some points without even being close to funny. I never felt for any of the characters. If they both would have gotten shot and died i would have been happy cause the movie would of ended.",
            "review_date": "2009-12-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Highly disappointing. Many aspects of this movie are great but Boyle's tendency to keep a tucky romantic love story in the center of the movie with awfully ridiculous dialogues simply ruins the movie. I choose 3 to counteract the high Highly disappointing. Many aspects of this movie are great but Boyle's tendency to keep a tucky romantic love story in the center of the movie with awfully ridiculous dialogues simply ruins the movie. I choose 3 to counteract the high scores this movie gets.",
            "review_date": "2009-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stupid. boring. i got the dvd and was waiting and waiting for the movie to live up to all the Oscars it won and it never happened.i fast forwarded through half of it because it was so damn boring. and the part with him not caring if he won Stupid. boring. i got the dvd and was waiting and waiting for the movie to live up to all the Oscars it won and it never happened.i fast forwarded through half of it because it was so damn boring. and the part with him not caring if he won the money seemed totally unrealistic. horrible.although there were a few redeeming parts such as the nail biting ending.",
            "review_date": "2009-04-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There's a kinetic genius woven into the brightly colored fabric of Slumdog Millionaire, which is only something a director as wildly exuberant as Danny Boyle could accomplish. In what is a basic story, seen many times before, Boyle takes awayThere's a kinetic genius woven into the brightly colored fabric of Slumdog Millionaire, which is only something a director as wildly exuberant as Danny Boyle could accomplish. In what is a basic story, seen many times before, Boyle takes away from its roots of epic and bombast, and modernizes it into a wild, exotic adventure. It's something that can be funny (which the movie is). It's something that can be horrifying (which the movie is). It's something that can be romantic (which the movie is). It's Danny Boyle's take on a trip to somewhere else, and we're lucky enough to go with him",
            "review_date": "2011-08-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best movie I have seen in quite some time. It has everything and sucks you in and keeps you riveted for the full 2 hours - And Bollywood at it's finest in the closing credits to boot! Hello Best Picture!",
            "review_date": "2008-12-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I must be from another planet, or I watched a different movie than the one everyone's raving about, or I got much more humanity & entertainment out of a true masterpiece like Salaam Bombay. Slumdog is contrived and shallow when it could I must be from another planet, or I watched a different movie than the one everyone's raving about, or I got much more humanity & entertainment out of a true masterpiece like Salaam Bombay. Slumdog is contrived and shallow when it could be at its best. The silver screen buckles under the gigantic Who Wants to be a Millionaire graphics. It has its moments, to be fair, but in such a compelling setting as Mumbai, Director Danny Boyle manages to serve up fast food when we could have been tasting authentic street fare.",
            "review_date": "2009-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very good film---loved the beginning more than the end as I thought the young actors/early slumdog scenes were almost perfect--absolutely captivating. The story seemed to unfold predictably and edged on cheesy towards the end, but it still Very good film---loved the beginning more than the end as I thought the young actors/early slumdog scenes were almost perfect--absolutely captivating. The story seemed to unfold predictably and edged on cheesy towards the end, but it still moved me so I guess that says something. Yes, it's very contrived in many parts, but really, it's a solid film worthy of theater prices and/or rental.",
            "review_date": "2009-01-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Superb. Some squemish scenes and uncomfortable moments, but one of the best movies I've had the pleasure of experiencing. The acting by the children was remarkable. Go see it!",
            "review_date": "2009-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film editing was amazing. I started to leave the theater twice because the sound was way too loud (I have a hyper-sensitive sense of hearing), but the exciting pace of the movie pulled me back to my seat. I inserted some ear plugs I had The film editing was amazing. I started to leave the theater twice because the sound was way too loud (I have a hyper-sensitive sense of hearing), but the exciting pace of the movie pulled me back to my seat. I inserted some ear plugs I had in my purse, relaxed, and enjoyed the rest of the film.",
            "review_date": "2009-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Utterly average. Script is okay and cheesy at times. Acting is average. The camera work is average. It does show India in a non-bollywood way which is nice, but nothing worthy of praise. The only reason it's done well is because of the Utterly average. Script is okay and cheesy at times. Acting is average. The camera work is average. It does show India in a non-bollywood way which is nice, but nothing worthy of praise. The only reason it's done well is because of the PC times we live in and the \"oh poor them\" attitude the film portrays. It's a feel good movie so utterly predictable and unrealistic. Honestly, if you want to feel good, watch a comedy. If you want to watch something about good people hard done by coming out all the better, watch Defiance. This movie is cheesy & uninspired, no different from your average chick flick.",
            "review_date": "2009-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I rarely watch independent films. When Persepolis was released, I had no desire to go and see it. After hearing about all the Oscars that Slumdog won, I figured I'd order it on demand. I have never been so happy to spend $5 and 2 hours I rarely watch independent films. When Persepolis was released, I had no desire to go and see it. After hearing about all the Oscars that Slumdog won, I figured I'd order it on demand. I have never been so happy to spend $5 and 2 hours for a movie. Not only did it hide its low-budget production extremely well, but it said to the major Hollywood producers, \"Get off you're lazy asses and make a good movie! We made one without all the high-tech equipment, why can't you do the same?!\" I would have given this movie a 10 but I felt that the love story was unoriginal, which is not a bad thing; I just would have liked it even more had it been 100% original. Due yourself a favor and watch this movie. It definitely lives up to the hype.",
            "review_date": "2009-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you are one of those people that has problems with plausibilility, you might have problems with this movie as I did. Was it gritty realism or an idealistic romance?",
            "review_date": "2009-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was one of my favorite movies of all time. It showed you just how violent and poverty-stricken the slums of India are, it showed you the fierce hatred between Hindus and Muslims, it even showed you the lives of children living in India. This was one of my favorite movies of all time. It showed you just how violent and poverty-stricken the slums of India are, it showed you the fierce hatred between Hindus and Muslims, it even showed you the lives of children living in India. Apart from nerve-tingling violence (a boy getting his eyes cut out, a girl getting a knife slashed across her face, a young boy killing a man with a revolver, a young boy getting beaten harshly by a guard, people setting a man on fire, a boy getting electrocuted) there was a very strong and great message to this movie. There was also slight sexual refrences, but they were very mild (a boy leading a girl into a room, girls dancing scandaly, boys walking through an alley of prostitutes, but not giving them money, although they walk in on a couple but it does not show anything). I thought the acting in it was spectacular. The children playing young Jamal, Salim, and Latika were outstanding, convincing you they truly lived in the slums of India, as well as the older versions convincing you their lives had slowly panned out and changed them into very different people by a sequence of events. There was slight cussing as well (the b-word, d-word, and s-word said only a couple times). But the themes of the movie, you could not help but feel heartbroken at how the children were living in such a poor, violent situation. Being beaten for hardly no reason, having to search through trash heaps, live in such a polluted area...it was incredibly heart-wrenching. There are a few disturbing events, such as a boy jumping into a waste mound, a boy getting his eyes scooped out with acid, a girl dressed up as a hindu god with several disgusting piercings, a boy getting hot chili peppers stuck down his pants, and many others. But apart from the violence and slight sexual references this movie taught me how truly lucky I am to live in such a free country, where people can't take me away to try to force me into gangs to shoot people, or to work as a prostitute. It also showed that just from your experiences, even if you are a \"slumdog\" from India, if you have traveled places or learned things from your experiences, you can know just as much as a rich gameshow host. :)",
            "review_date": "2009-06-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie! The beginning is definitely better than the end, mostly because of the younger actors doing an incredible job. The ending is a bit cheesy, but overall very enjoyable movie.",
            "review_date": "2008-12-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As riveting a movie as you will ever find. Keeps your attention for the full 2 hours. Reminds me of Pvt Ryan in that once you see it you will never forget it. Kudos for such a wonderful suspenseful movie. Masterpiece worthy of all the accolades.",
            "review_date": "2008-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am not usually one to write reviews, but since my point of view is not represented....I walked out of this film. It started with a torture scene, which was soon followed by a mob scene in which the hero's mother is murdered. The hero I am not usually one to write reviews, but since my point of view is not represented....I walked out of this film. It started with a torture scene, which was soon followed by a mob scene in which the hero's mother is murdered. The hero and his brother (now orphans) are soon picked up by an \"orphanage.\" The orphanage teaches the kids to beg and when they burn one of the kid's eyes out to make him a better beggar - I walked out. I've seen many movies set in India and was ready for the poverty that would be portrayed. But it was too much. The scene of the kid getting his eyes burned out, haunted me for two days. The story had a great premise, but with each answer he gave in the quiz show - there was a related horror. That said, my husband really liked it. For me I could not stomach it.",
            "review_date": "2008-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Superb! Real. Authentic. Hopeful. Masterful filmmaking. It is a unique twist on an old story, done so well and so differently. Best movie I have seen in many years!",
            "review_date": "2009-01-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie for everyone over 15, especially for Americans who need to be reminded about how good we have it. This movie is about a street kid named Jamal (Dev Patel) who wins on the",
            "review_date": "2009-01-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A beautiful story that has heart, and magic. It has just enough realism to keep the suspension of disbelief, but it never loses its fairytale love story, and reaches toward the idea of fate and destiny.",
            "review_date": "2009-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I grew up in Mumbai myself, and while I am pleased that a movie about my city is receiving this much attention, I just wish it wasn't this particular film. It wasn't a horrible film, but I really didn't enjoy it as much as I grew up in Mumbai myself, and while I am pleased that a movie about my city is receiving this much attention, I just wish it wasn't this particular film. It wasn't a horrible film, but I really didn't enjoy it as much as most people do. Regarding the credibility issue, I do agree that the film needed to \"follow its own rules\" as others have said. As I understand it, the movie tries to show fantastic things happening in a gritty, realistic world. But the world itself is not realistic. Apart from minor errors in terminology, (eg. talking in terms of millions rather than crores, calling the quiz show its US/UK name rather than the Indian name, etc.), the fact that all these practically illiterate people can speak perfect English is extremely unrealistic, which foreign viewers may not realise. A lot of the plot hinges on this ability. Also, as everyone should know, the 'phone-a-friend' thing doesn't happen live with everyone watching! The person on the other end would just look up the answer online before the call is even made! The quiz show is obviously always prerecorded. I also felt that, since Jamal's love for Latika drives all his actions, it was very unconvincingly portrayed. I understand the guilt he feels for leaving her behind as a child. But guilt is not the same as love. Why does he love her as an adult after having such a flimsy friendship with her as a child? I am willing to believe it's possible, but surely the director might have fleshed it out more convincingly. Lastly, the brother's suicide was extremely unjustified, and again the director could have helped us understand it better.",
            "review_date": "2009-01-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a overrated and unnecessarily hyped movie. I have heard lots of music so far but could not what is special in the music of the film that it got nominamted for best music, backgroung music....Most of the time the backgroung music ofThis is a overrated and unnecessarily hyped movie. I have heard lots of music so far but could not what is special in the music of the film that it got nominamted for best music, backgroung music....Most of the time the backgroung music of \"Kaun banega Crorepati\" has been palyed, some other time a film song \"Aaj ki raaat\". I believe there are far better music we already have heard in bollywood movies, even that is by A R Rahman. \r\rLots of other points are there which have already been discussed in this forum, I will not go for those again, but I personally not satishfied with movie. I tried a lot to like the movie but I can not.",
            "review_date": "2009-01-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I long to pay homage to Danny Boyle, S. Beaufoy, the great cast, and AR Rahman. This film gives viewers everything they go to the movies for in an explosive yet measured stream of laughs, horrors, griefs, suspense, and wonder.",
            "review_date": "2009-01-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All movies stand on scaffolding that is artifice. The best movies (and this is one) make us either forget about the scaffolding, or not care one iota that it exists. This is the case of the latter. We know full well the improbability, even All movies stand on scaffolding that is artifice. The best movies (and this is one) make us either forget about the scaffolding, or not care one iota that it exists. This is the case of the latter. We know full well the improbability, even the impossibility, of the events here, but are so swept away by this film, its actors, its premise, that scaffolding be damned. I do like it better than anything else I've seen this year. Terrific movie. And Boyle is one hell of a director.",
            "review_date": "2009-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "fantastic movie. great cinematography, entrancing (if a bit corny) storyline, great acting. I loved it. I'd probably give it an 8.7 or an 8.8 but 9 is closest.",
            "review_date": "2009-01-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The best movie made about the society of the India I've ever seen. There is no doubt about it...",
            "review_date": "2009-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Doesn't live up to its hype... not bad, but nothing special either...",
            "review_date": "2009-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Very mediocre. I agree with other sentiments about moviegoers jumping on the 'awards bandwagon.' There is nothing really original about this film other than the fact that it comes from India. I could not help but think that this Very mediocre. I agree with other sentiments about moviegoers jumping on the 'awards bandwagon.' There is nothing really original about this film other than the fact that it comes from India. I could not help but think that this movie was simply a combination of a couple of movies I have seen before and it was much less powerful. The film tries to juggle too many half baked messages and plot twists to be of real substance; and propped up by acting that is OK at best this film is not worth the praise it is getting.",
            "review_date": "2009-02-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "amazing movie i founded spectacular indeed in terms of the storyline and where it takes place, the slums of india. The love story just captured me.",
            "review_date": "2009-02-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Waste of money, was boring. just very unrealistic and horrible indi background. that video at the end? do i need to say anything, gayest crap ever. some funny parts but just not good enough. put me to sleep.",
            "review_date": "2009-02-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Really enjoyed it. Found the music to be a little hard to appreciate at times. Never the less I'll not forget this one soon.",
            "review_date": "2009-02-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Without doubt one of my all time worst experiances in the cinema - and a prime example of how seemingly intelligent critics would rather not upset the apple cart and state the facts - this film is awfull! The script is badly written, Without doubt one of my all time worst experiances in the cinema - and a prime example of how seemingly intelligent critics would rather not upset the apple cart and state the facts - this film is awfull! The script is badly written, characters are totally without any depth or substance, serious themes of poverty are used as puerile plot points then thrown away as and when it doesn't serve a totally twee unbelievable romance. The acting is uniformly amatureish - none of the protaganists create any humanity beyond the writers belief you should care for them due to their sufferings - and the fact they are contrasted with one dimensional evil characters all around them. Maybe if the director wanted to make some serious points about 3rd world poverty he could of done it with more rounded characters? Some of the representations of India (police torture because you get a few questions right on a game show) are ludicrous verging on racist. Which maybe ok in a fairy tale, but then don't make a fairy tale and use serious issues as plot devices. Far from being proud of this piece of dirge (as the UK press are suggesting) British Cinema should bow it's head in shame.",
            "review_date": "2009-03-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slumdog Millioniare is clean production, reminiscent of a music video. This turns out to be its greatest flaw. Full of shine and glitz, in the end Slumdog Millionare feels, for some reason, as if it has no soul. Fun fluff. That's all.",
            "review_date": "2009-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A huge letdown considering all the hype! Apart from being visually impressive and having a few mildly entertaining moments, this movie is confusing at best and pointless, naive and overblown at worst. I mean, the 2 main characters that are A huge letdown considering all the hype! Apart from being visually impressive and having a few mildly entertaining moments, this movie is confusing at best and pointless, naive and overblown at worst. I mean, the 2 main characters that are supposed to be deeply in love never even exchange a proper sentence, and the character of Jamal Malik is as blank as a sheet of paper. Not to mention that the point of the story completely escapes me...unless the point is depicting all the worst horrors of Indian poverty just to elicit the shock and pity of the white, Western viewer comfortably seated in a cinema chair with lots popcorn in his hand. I am forced to conclude that this is one of the main reasons why this movie got so many awards- to appease social consciousness. It seems that by patching graphic scenes of poverty and violence onto a pointless, confusing plot and a set of faceless characters, we come to what is, today, considered a highly acclaimed movie.",
            "review_date": "2009-03-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What people need to understand... what if you only knew 10 things... ever? Only 10 things -- because you grew up in the slums. And by some kind of luck, those 10 things happen to be the exact 10 things needed to change your life! And what if What people need to understand... what if you only knew 10 things... ever? Only 10 things -- because you grew up in the slums. And by some kind of luck, those 10 things happen to be the exact 10 things needed to change your life! And what if each of those 10 things had a harrowing story to go a long with each answer ? That's what this movie is all about. It's about destiny.",
            "review_date": "2009-03-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The most accurate review here is by \"C D\" & not because he/she is from Mumbai but because of the plot and acting holes in the film that he/she identifies. Slumdog is entertaining and stylistically shot but does not come close to crossing the The most accurate review here is by \"C D\" & not because he/she is from Mumbai but because of the plot and acting holes in the film that he/she identifies. Slumdog is entertaining and stylistically shot but does not come close to crossing the threshold of a truly great film that deserves a 9 or 10 rating.",
            "review_date": "2009-03-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slums are cool. i mean, where else can you walk around covered in sh**? This movie is a feast for the overstimulated. Is someone trying to trumpet down the distinction between films and music videos for good? I do like the juxtaposition of Slums are cool. i mean, where else can you walk around covered in sh**? This movie is a feast for the overstimulated. Is someone trying to trumpet down the distinction between films and music videos for good? I do like the juxtaposition of game show to 'hard knocks school of life', yet this theme is no longer that fresh.",
            "review_date": "2009-03-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Oscars aside, I heard so many good things about this movie from friends, I just had to see it. Honestly I was uninterested, had no desire to see this movie and figured I would hate it. But I really started to get into it and in the end Oscars aside, I heard so many good things about this movie from friends, I just had to see it. Honestly I was uninterested, had no desire to see this movie and figured I would hate it. But I really started to get into it and in the end thought it was a great movie. The flashbacks made it a little confusing at times, but it was necessary for the storyline. I found this to be an intriguing love story, along with a success story proving that no matter where we come from or how bad our life has been, there is always hope for a great outcome. And that even if you come from the \"slums\" you do not have to fit a certain stereotype as Jamal's brother did. I think it's worth watching, even if you're skeptical. The only reason I gave it an 8 is because it was a bit slow to get into the meat of the story and in the beginning it was a bit choppy.",
            "review_date": "2009-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A beautiful and breathtaking look at a once-in-a-lifetime chance story of a teenager \"slumdog\" who just happens to be nearing the final question of Who Wants To Be A Millionaire. How did he do it? The acting was AMAZING. Dev and Freida A beautiful and breathtaking look at a once-in-a-lifetime chance story of a teenager \"slumdog\" who just happens to be nearing the final question of Who Wants To Be A Millionaire. How did he do it? The acting was AMAZING. Dev and Freida deserved the recognition they got, but what really stood out, were the amazing child actors! Especially the young trio (Jamal, Salim, and Latika) See it twice or however many times it takes to recognize this as the best film of 08!",
            "review_date": "2009-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a joke.",
            "review_date": "2009-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Probably one of the greatest movies I have ever seen. Words cannot express the amount of emotion packed into this amazing film.",
            "review_date": "2009-04-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent movie. The story is what makes it so great. Just the ending I found a bit corny, but other than that this movie is one of the best I have ever seen!",
            "review_date": "2009-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ok after hearing enough about; I finally checked it out and discovered that it is definitely over hyped but not as bad as some critics are claiming. It was different; which is more than I can say about most of the movies that have been Ok after hearing enough about; I finally checked it out and discovered that it is definitely over hyped but not as bad as some critics are claiming. It was different; which is more than I can say about most of the movies that have been coming out. That is why the wrestler and itself got so many nominations or won something. As for the movie there were definitely some corny/ dry scenes but not enough to have pushed this movie score below a 5; so if you fell asleep watching, its not the movie; its your narcolepsy. Anybody giving it a 10 needs to realize that there r a few numbers between 0-10; because you enjoyed it doesn't make it a perfect movie.",
            "review_date": "2009-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Danny Boyle turned a simple plot into a superb movie. Not every director has that kind of talent. Not every plot turns into a well done movie. One of the best movies this year.",
            "review_date": "2009-06-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film was originally meant to be released straight to DVD, but it shouldn't have as it was a good film itself and Oscar-worthy, it was just a little too depressing and not Best Picture-worthy.",
            "review_date": "2010-06-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Luis, just out of curiosity, what are your favorite pics of the year? Instead of being a pretentious blowhard fuck and basically maligning every film that is getting any award buzz, enlighten us with your superior taste in movies. This is aLuis, just out of curiosity, what are your favorite pics of the year? Instead of being a pretentious blowhard fuck and basically maligning every film that is getting any award buzz, enlighten us with your superior taste in movies. This is a great film. Definitely not perfect, but what is?",
            "review_date": "2008-11-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A perfect score as you will not believe your very own eyes. It grabs you a few minutes in and never lets go. The one guarantee is that after seeing this film no one will include India on your places to visit. If you are claustrophobic A perfect score as you will not believe your very own eyes. It grabs you a few minutes in and never lets go. The one guarantee is that after seeing this film no one will include India on your places to visit. If you are claustrophobic don't see this film.",
            "review_date": "2008-12-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is an incredibly entertaining film. I see a review in here putting it down because it is \"Forrest Gump\". That would be the \"Forrest Gump\" that won 6 Oscars including Best Picture. Is there an opposite to \"damning with faint praise\" - This is an incredibly entertaining film. I see a review in here putting it down because it is \"Forrest Gump\". That would be the \"Forrest Gump\" that won 6 Oscars including Best Picture. Is there an opposite to \"damning with faint praise\" - perhaps \"exalting with faint criticism\".",
            "review_date": "2008-12-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You've got to be kidding me. Do absurdly \"earned\" riches and a Bollywood starlet (there was no obvious chemistry between the actors so no \"love\" in sight) really make up for that horror of an early life? If they do then you can call the You've got to be kidding me. Do absurdly \"earned\" riches and a Bollywood starlet (there was no obvious chemistry between the actors so no \"love\" in sight) really make up for that horror of an early life? If they do then you can call the movie \"uplifting\". I don't think so and I am appalled by the way the audience is led around by the nose. We must really need a happy ending in a big way to jump for joy over this movie.",
            "review_date": "2008-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Creative film grabs you and doesn't let go. The acting and the the story is fantastic. Be forewarned that after you see this you will never visit India. Definitely will be up for an OSCAR as Best Picture of Year and deservingly so.",
            "review_date": "2008-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful, hearwrenching, stunning - how anyone can give this lower than an \"11\" is beyond me",
            "review_date": "2008-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was the most entertaining and breathtaking movie of all year. It also has one of those stories that you will always remember. I hope it wins many awards come this awards season.",
            "review_date": "2008-12-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The point of the movie is boring. Its 2009 and Im still watching movies about humans trudging around on earth. At this point in time, the viewer and critic MUST take into consideration, the TIME in which we live in, I am not interested in The point of the movie is boring. Its 2009 and Im still watching movies about humans trudging around on earth. At this point in time, the viewer and critic MUST take into consideration, the TIME in which we live in, I am not interested in plots, even with high quality, that involve feeble comparisons between rich and poor, and young modesty for the rules and grandiose randomness primitive civilization sometimes presents. I crave something innovative, constructive, and complex; in complexity simplicity can be established, at any point, for a common viewer, in 2009 i expect more from all entertainment genres. I am not a troglodyte.",
            "review_date": "2008-12-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Since David W pulled this below a 9 with his jaded view of what movies ought to be, I'll attempt to push it above 9 again with my 10 rating. This is one of the 2-3 best movies I've ever seen - right up there with Groundhog Day, Since David W pulled this below a 9 with his jaded view of what movies ought to be, I'll attempt to push it above 9 again with my 10 rating. This is one of the 2-3 best movies I've ever seen - right up there with Groundhog Day, It's a Wonderful Life and A Christmas Story. Well paced - betrayal and redemption, love and heartbreak, all set in a culture and setting unfamiliar and eye-opening for most of us.",
            "review_date": "2008-12-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Masterpiece. The flavor of my favorite novel \"Shantaram\", great score, plot, love story & such memorable images!",
            "review_date": "2008-12-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I went to the movies by myself because my gay brother J was afraid to go. And am I ever glad I did. The movie was great. After seeing the beautiful vision that is India I can't wait to send J on vacation there. I told him about the lush I went to the movies by myself because my gay brother J was afraid to go. And am I ever glad I did. The movie was great. After seeing the beautiful vision that is India I can't wait to send J on vacation there. I told him about the lush countryside with green hills and valleys to roam and how warm and wonderful all the people of India are. If you are looking for a family vacation then India is the place for you. Don't miss this feel good warm and fuzzy movie.",
            "review_date": "2009-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome. Possibly Boyle's best and thats saying something.",
            "review_date": "2009-01-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie has exaggerated both the poverty of Indian people and the attitude of the Indians. All the WORST POSSIBLE incidents that could happen to a human being is being depicted as happening to this SOLE PERSON, which can't be This movie has exaggerated both the poverty of Indian people and the attitude of the Indians. All the WORST POSSIBLE incidents that could happen to a human being is being depicted as happening to this SOLE PERSON, which can't be REALISTIC. I am at the same time not denying about the pathetic conditions of people living in the slums. But all the worst things occuring to a single person, is VERY UNLIKELY. The worst part of the movie is the attitude of the host of show \"Who wants to be a millionaire\". Being an Indian, I have never seen any person humiliating any other person in a PUBLIC SHOW. If something like this happens, the public will never tolerate these kind of humiliation on a show that is broadcast nationally. So this movie is a hype depicting all the bad side of the Indian culture and people. So I did not enjoy watching this movie.",
            "review_date": "2009-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I find the movie extremely offensive and racist. It shows Indian culture as bankrupt and evil. There isn't a single good Indian person in that movie. What are people happy about? Do you guys really believe India is such a morally I find the movie extremely offensive and racist. It shows Indian culture as bankrupt and evil. There isn't a single good Indian person in that movie. What are people happy about? Do you guys really believe India is such a morally bankrupt society? How come the west likes to see only movies that show abject poverty and misery? This movie is made by a westener for a western audience so that they can feel good about themselves. Pathetic!",
            "review_date": "2009-01-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is the most upifting and brilliant story told through cinema in a long time.",
            "review_date": "2009-01-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "what a tale... but it's not a great picture, a bit above average at best. yes, the setting is dramatic, yes, story holds some clever twists, but if you go expecting an epic, it falls quite flat.\r first 60 minutes were kinda borning,what a tale... but it's not a great picture, a bit above average at best. yes, the setting is dramatic, yes, story holds some clever twists, but if you go expecting an epic, it falls quite flat.\r first 60 minutes were kinda borning, then the next 20, okay, then flat again. a fairly packed theater laughed about 4 times, was tense for about 3 and didn't clap at the end.\r It is written... it's worth about 3 Oscars, not 10.",
            "review_date": "2009-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You'd be hard pressed to find another movie with so much emotion, exploration of the human condition, and commentary on poverty and social conditions. Throw in some underworld gangster action and a game show and this movie somehow ties You'd be hard pressed to find another movie with so much emotion, exploration of the human condition, and commentary on poverty and social conditions. Throw in some underworld gangster action and a game show and this movie somehow ties the elements together perfectly. Don't miss it.",
            "review_date": "2009-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An emotional roller coaster.",
            "review_date": "2009-01-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A celebration of filmmaking and storytelling. A joy to watch. Everyone who liked this film should still read the book 'Q & A'. It will still surprise you.",
            "review_date": "2009-01-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Why is everyone so eager to jump on this bandwagon? If not for the unbelievable shower of awards, this movie would have slipped into deserved obscurity. Manipulative...flashy...provides a caffeine-buzz but no real nourishment....exciting to Why is everyone so eager to jump on this bandwagon? If not for the unbelievable shower of awards, this movie would have slipped into deserved obscurity. Manipulative...flashy...provides a caffeine-buzz but no real nourishment....exciting to viewers who may just be easily pleased....I was annoyed and angered by the way the filmmakers expected viewers to respond to this horror-fairy tale....the more sensitive viewer would not be dancing in the aisles, and those who expect more from their art and entertainment would most likely not be inspired.",
            "review_date": "2009-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slumdog Millionaire is well worth seeing. It is original, thought provoking, as well as entertaining. The story walked more on the darker aspects of life than I usually like in a movie. But in this case some worth saying needed to be heard. Slumdog Millionaire is well worth seeing. It is original, thought provoking, as well as entertaining. The story walked more on the darker aspects of life than I usually like in a movie. But in this case some worth saying needed to be heard. It was really difficult seeing all those scenes of absolute poverty, violence, and criminal abuse those children had to suffer. In many ways they mirror what has happen and in some cases still does happen to impressionable children around the world. The film helps give understand to how our environment can profoundly shape us. Jamal however throughout everything this never loses his heart, ideals and compassion. He grows to be a man committed to truth as well as living out his highest desire, which in this instance simply being with the person he loves the most. With a single focus he never seems to forget even over length time separations and a vast array of circumstances. I thought the film was spot on, harrowing almost at every corner. The end was ok but seemed to lose its punch a bit, though it had its charm as well. Make sure you stay for the credits which I found quite a surprise.",
            "review_date": "2009-02-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic film which I will remember for a long time. I found that the young actors were especially believable and while it is a essentially a fairy tale that would never happen in the real world, it is one of the best damn fairy tales I Fantastic film which I will remember for a long time. I found that the young actors were especially believable and while it is a essentially a fairy tale that would never happen in the real world, it is one of the best damn fairy tales I have ever seen. Don't forget that, if this film was 100% realistic, it would just be depressing.",
            "review_date": "2009-02-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I cannot understand all this weird appraisal noise about this underrate piece of movie. It",
            "review_date": "2009-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excellent film depiction of life in contemporary India.",
            "review_date": "2009-02-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best movies I have seen in a long time (and for all you idiots who say that the movie is not realistic when it comes to India and their econamic situation and people, you need to do your research) It may have been unrealistic at One of the best movies I have seen in a long time (and for all you idiots who say that the movie is not realistic when it comes to India and their econamic situation and people, you need to do your research) It may have been unrealistic at times, but that is no reason to hate an amazing movie. It was a really touching story and I left the theater amazed.",
            "review_date": "2009-02-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Rightly said N.C. It is utter hype, and pure escapism. Forrest Gump 2 is a good nickname for this movie.",
            "review_date": "2009-02-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the bests movies i've ever seen. The actors performance are brilliant mainly the youngest actors. I love it.",
            "review_date": "2009-02-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Excuse me, how can you let JM call this film 'the gayest crap ever'? Would you publish comments saying something is niggerish? No. So why is homophobia allowed?",
            "review_date": "2009-02-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great movie I can't get enough of it!! love how boyle left in the part where the 2 dudes say \"no filming here\" lol classic. Good soundtrack too.",
            "review_date": "2009-02-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absolutely amazing cinematic experience. Danny Boyle has been on a real run lately. His last 2 films, \"Millions\" and \"Sunshine\" are underrated gems that have dedicated followings but little critical recognition. \"Slumdog Millionaire\" in An absolutely amazing cinematic experience. Danny Boyle has been on a real run lately. His last 2 films, \"Millions\" and \"Sunshine\" are underrated gems that have dedicated followings but little critical recognition. \"Slumdog Millionaire\" in my opinion is probably one of the two or three best things that Boyle has ever done. The real hero of the film though is Anthony Dod Mantle. Those \"in the know\" know that Mantle is one of the best living cinematographers alive and the photography in this movie is a big part of what makes it great. The camerawork makes this film really come alive and Mantle should've been recognized more. By the Academy and the Golden Globes.",
            "review_date": "2009-02-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Americans, Indians and their high fibre diet.... I stake my house that this movie and Benjamin Button (aka Forrest Gump Two) sweep the oscars.... Why!!?? Instead of trying to shape the thought of your nations via ignorance and the glossing Americans, Indians and their high fibre diet.... I stake my house that this movie and Benjamin Button (aka Forrest Gump Two) sweep the oscars.... Why!!?? Instead of trying to shape the thought of your nations via ignorance and the glossing over of serious issues and complex situations with superficial and insulting generalisations and inaccuarcies to suit said 'high-fibre diet' i.e., show them what makes them feel good and works, not what is true and makes one truly think and self-examine - good AND THE UGLY (and in all it's glory, not manipulated and summarised for easier consumption, you pussies).... remember when america gave all those awards to Forrest Gump? It is a silly robert zemekis fantasy movie of such incredible historical inaccuracies and crass ignorance that it is regarded by some nowadays as the worst film of all time - certainly one of the most intellectually-insulting cinematic experiences of all time.... but, oh, America the brave and the free and all things that are good.... and good 'ol india, represented by a handsome young man with good luck on his side, rising above his situation to manage to win a million dollars in an hour and have the woman of his dreams while the cities and country rot in a cess pool of rubbish, filth, human excrement and real, honest BROKEN dreams in their tens upon tens of millions..... wake up!! Danny Boyle even udnerpaid the indian mumbai orphans used int he film etc... touche. The Oscars handed about two oscars to 'No Country FOM' last year and even one critic above in reviewing 'Slumdog M' (a stupid, stupid reworking of the title \"Q and A\", but a reworking that reveals the uncomfortable contradictions inherent in the minds of the filmmakers and indeed their hearts too.... as they must manipulate, which disrespects the audience) refers to how 'after last years black-hearted NCFOM' etc etc----..WTF!!??? NCFOM is one of the greatest films ever made - indisputebly. Great art doesn't always put a smile on your face but that doesn't make it worse..... If I recall rightly, Romeo and Juliet is the greatest romance of all time and the most enduring... Tell me, how did that one turn out? Happiness is what you actually DO with your life..... art is about growing and being taken to places unexpected, being tested emotionally, intlelectually and intestinally and not giving in brainlessly to the slap and tickle you fantasized about in la-la land and then giving the piece of trash 11 oscars. Put it this way, as a NZer, Return of the King deserved about 4...... but you crazy americans get all caught up and sucked into the hype and you LOVE your high-fibre diet..... I knew when return of the king dragged on an hour too long with sentimental BS that it would sweep the oscars... SAD. Reward the best film, not the film that makes you happy - you bloody knobs.",
            "review_date": "2009-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Something fresh, something new, somewhere new.",
            "review_date": "2009-02-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome movie, I've seen it 4 times and it's just as good each time. A little bit of everything in this film, by far the best movie of the year.",
            "review_date": "2009-02-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Saw it first day it came out, having now idea what I was getting myself into... and look at it now!",
            "review_date": "2009-03-01",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 136
}