{
  "title": "Superhero Movie",
  "rating": 5.6,
  "release_date": "2008-03-28",
  "genre": [
    "Action",
    "Sci-Fi",
    "Thriller",
    "Comedy"
  ],
  "summary": "How many superheroes does it take to save the world? The creators of The Naked Gun and Scary Movie answer this question in hysterical David Zucker fashion with the uproarious comedy Superhero Movie. Meet Rick Riker. He's young, he's cool, and he's got superpowers. Now, if he only knew how to use them... But the world is in danger, and noHow many superheroes does it take to save the world? The creators of The Naked Gun and Scary Movie answer this question in hysterical David Zucker fashion with the uproarious comedy Superhero Movie. Meet Rick Riker. He's young, he's cool, and he's got superpowers. Now, if he only knew how to use them... But the world is in danger, and no one is safe when Zucker and the gang--headed by the hilarious cast of Drake Bell, Leslie Nielsen, Tracy Morgan, Pamela Anderson, Regina Hall, and many others--take aim at some of the biggest blockbusters of our time, including Spider-Man, Batman, X-Men, and Fantastic Four, to name a few. On March 28, learning to fly, spinning a web, and busting a gut has never been this much fun. (The Weinstein Company)… Expand",
  "critic_reviews": [
    "Undiscriminating comedy fans hungering for the High School High of superhero parodies need look no further.",
    "Given the abysmal quality of recent spoof pics, it's saying something that Superhero Movie provides a fairly steady stream of midsized laughs -- and even the 40% or so of gags that just lie there aren't actively painful.",
    "How can you tell the target age for Superhero Movie is exactly 13 1/2 years? Because most of the jokes are Internet-related.",
    "The very act of writing critically about Superhero Movie inspires something of an existential crisis -- no one likely to turn out for it is reading this review, and anybody reading this review is probably not inclined to see it under any circumstances.",
    "Puerile and idiotic it may be, but Superhero Movie is nonetheless smarter than most of its lowbrow brethren in the Hollywood sub-sub-category known as the spoof movie.",
    "Seems to have been given the comedy equivalent of blood thinner. It has the blazing satirical boldness to skewer the first Tobey Maguire Spider-Man -- and, amazingly, not much else.",
    "By-the-numbers screen parody fails to resurrect an increasingly tired genre.",
    "The gags are consistently weak, though actor Miles Fisher turns in a hair-raising impression of Tom Cruise.",
    "What's shocking about Superhero Movie is not that it's been advertised to death on Nickelodeon to impressionable children, but that it's a completely on-the-nose satire of \"Spider-Man.”",
    "This super-powered spoof just doesn't fly.",
    "Predictable, flat, full of name-dropping, tragically unhip, and likely to make a decent amount of cash.",
    "No real mockery is intended by this harmless, mindless grab bag of slightly used gags, which lampoons some of the conventions of recent comic-book epics and adds the expected staples of juvenile humor: urine, vomit and intestinal gas.",
    "It's a tonally confused comedy which, for once, doesn't go far enough comedically.",
    "This abysmal \"Spider-Man\" satire has more in common with the lamentable spate of \"Epic\" and \"Date Movies\" than Zucker and Nielsen's truly funny \"Naked Gun\" series."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I'm not one to like spoof movies other than the first 2 Scary Movies. Superhero movie I think is a great spoof film. It's one of few other spoof movies that really focuses on plot and character development. Not to mention the jokes. AddingI'm not one to like spoof movies other than the first 2 Scary Movies. Superhero movie I think is a great spoof film. It's one of few other spoof movies that really focuses on plot and character development. Not to mention the jokes. Adding Leslie Nielsen was the right move to make a funny Spoof film.",
      "review_date": "2013-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cindy: Sex? Really? Sweet! I'm so going to see this one now. Any other suggestions?",
      "review_date": "2008-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True, this movie is bad, but that is the way it is supposed to be. The sole goal of this film is to take a popular movie and rip on it, which this does very well. I found it to be funny, but it obviously won't be nearly as funny if you True, this movie is bad, but that is the way it is supposed to be. The sole goal of this film is to take a popular movie and rip on it, which this does very well. I found it to be funny, but it obviously won't be nearly as funny if you have not seen the films it parodies.",
      "review_date": "2008-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An excellent spoof from the master's of parody themselves, although extremely offensive, the stephen hawking gags are phenomenally good.",
      "review_date": "2008-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fill of corny jokes - which are funny! I don't understand how its reviews are bad, it's supoosed to rip of Spidermarn and make it funny. It does that. Good to see a great 'Movie' film!",
      "review_date": "2008-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Okay, it's no classic comedy, but it did make me laugh. The cast is good, it has a funny premise. I enjoyed it. Cleverly written at times.",
      "review_date": "2008-06-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is by far the best stupid comedy to come out in the last few years. If you don't like the stupid spoof genre, don't watch this movie. If you do like it, this one is the best since the old Jim Abrahams ones.",
      "review_date": "2009-09-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The story was quite good, and the comedy was HILARIOUS!",
      "review_date": "2009-09-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you ever watched one of the Scary Movies you'll feel the writers sense of humor throughout this movie, an excellent parody of super hero movie like X-Men, Spider-Man, Fantastic Four, Batman, and more, a hilarious movie, if your a fan ofIf you ever watched one of the Scary Movies you'll feel the writers sense of humor throughout this movie, an excellent parody of super hero movie like X-Men, Spider-Man, Fantastic Four, Batman, and more, a hilarious movie, if your a fan of the Scary Movie series, than this is a must see.",
      "review_date": "2011-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best spoof movie I ever watched.",
      "review_date": "2011-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superhero Movie is not a completely satisfying comedy film. It works to an extent as an accurate Spider-Man parody. It has serviceable comedy performances from Drake Bell, Christopher McDonald and Leslie Nielsen and has an amusing minor roleSuperhero Movie is not a completely satisfying comedy film. It works to an extent as an accurate Spider-Man parody. It has serviceable comedy performances from Drake Bell, Christopher McDonald and Leslie Nielsen and has an amusing minor role for Jeffrey Tambor, and the whole cast make the very best they can of writer/director Craig Mazin's mostly uninspiring script. The film is far weaker when the story veers off on tangents and tries to spoof films other than Sam Raimi's Spider-Man films in obvious and embarrassingly unfunny ways, particularly criminal is the offensively bad X-Men parody featuring Tracy Morgan. Since it does make you laugh now and again (mostly from ZAZ-influenced jokes that likely resulted from David Zucker serving as one of the film's producers), Superhero Movie is definitely on the better side of bad films, and is far superior to the woeful Epic Movie and Disaster Movie. It's just a shame that it's not more consistently funny, as there is little left to hide Craig Mazin's pretty sloppy filmmaking technique when you're not laughing. At the end of the day, being \"the best of the Scary Movie spin-offs\" isn't really much of an accolade.",
      "review_date": "2012-10-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superhero Movie just needs a psychiatrist. It's so stupid, that I would watch Troll 2 again instead of watching this piece of crap. Every character goes s**t in this movie. Craig Mazin doesn't know what Spiderman or sex jokes are if you usedSuperhero Movie just needs a psychiatrist. It's so stupid, that I would watch Troll 2 again instead of watching this piece of crap. Every character goes s**t in this movie. Craig Mazin doesn't know what Spiderman or sex jokes are if you used a spoof in a film. The actors FART in this film.",
      "review_date": "2013-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fun spoof of Spiderman 1+2 and a few others for good measure. I had more fun than I expected! Clearly the people who made this had alot of fun doing so.",
      "review_date": "2021-05-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "amazing movies, i love this type of comedy just like scary movies series :)",
      "review_date": "2018-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Could Do WorseSuperhero Movie may still have a lot of the 2000’s spoof movie clichés, But at least it’s not unbearable.",
      "review_date": "2020-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Hilarious spoof comedy. It really made my day. If you love superhero flicks or superheroes in general, you'll love this movie and you're going to laugh hard. Just don't take it seriously and you'll have fun.",
      "review_date": "2020-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Had a couple of genuinely funny gags but a lot of tasteless ones. Could have deviated from the Spiderman storyline just a little bit... Pretty forgettable all up.",
      "review_date": "2008-07-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is the greatest comedy movie I've seen. It's so funny, I can't stop laughing. If you like a kind of that comedy, don't miss this movie. Believe me!",
      "review_date": "2011-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While I admit that SOME of the critisisms of this movie are well-founded, people seem to actually search for critisism rather then watch the movie for what it is. I for example, couldn't crack a frown during the course of the movie even While I admit that SOME of the critisisms of this movie are well-founded, people seem to actually search for critisism rather then watch the movie for what it is. I for example, couldn't crack a frown during the course of the movie even if I tried. The well-positioned gags, personal pot-shots, and never ending satire is absolutely impossible to ignore. I couldn't tell you how many times people gave me evil looks for bursting out in spontanious fits of laughter. I highly reccomend this movie for people who can laugh at random and satirical humor.",
      "review_date": "2008-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A relly funny movie for the Superheros fan. The jokes are very very funny :)",
      "review_date": "2008-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not nearly as bad as I expected. Cinematically, it's horrid. Satirically, it's uninspired. Most of the jokes worked on some level, even if it was immaturity, and only a few gags were terrible. The real surprise was that there were Not nearly as bad as I expected. Cinematically, it's horrid. Satirically, it's uninspired. Most of the jokes worked on some level, even if it was immaturity, and only a few gags were terrible. The real surprise was that there were a couple of genuinely clever and funny jokes in there. This movie doesn't do anything to recover the reputation of gag based satires, but it succeeded just enough to be passable.",
      "review_date": "2008-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In case the title didn't give it away this is a \"parody\" of superhero movies, more specifically the first Spider Man film.The parody movie genre has proved successful on multiple occasions in the past, The Austin Powers movies being myIn case the title didn't give it away this is a \"parody\" of superhero movies, more specifically the first Spider Man film.The parody movie genre has proved successful on multiple occasions in the past, The Austin Powers movies being my favourite examples, but this is another example of a film full of lazy writing and lazy jokes that barely caused me to raise a smile let alone actually laugh. The only real question is how the Scary Movie franchise become popular enough to spawn, not only a bunch of sequels, but a host of other spin-offs as well?",
      "review_date": "2018-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Metascore reviewers suck once again! 33/100? That's hardly accurate, as this movie is funny as it is raunchy and distasteful (in all the right ways!). I'd watch the sequel without a second thought. Watch this especially if you liked moviesMetascore reviewers suck once again! 33/100? That's hardly accurate, as this movie is funny as it is raunchy and distasteful (in all the right ways!). I'd watch the sequel without a second thought. Watch this especially if you liked movies like Superbad or Kickass (1 or/and 2).",
      "review_date": "2014-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know what is with the low rating. I'm with Mikhall on this it was a great and funny movie. I'd watch it again and again. My friends even agree with me. So come on people vote and increase this rating people diserve to I don't know what is with the low rating. I'm with Mikhall on this it was a great and funny movie. I'd watch it again and again. My friends even agree with me. So come on people vote and increase this rating people diserve to know how good this movie is.",
      "review_date": "2008-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "We took our 9 and 11 year old to see this. It was shocking. We couldn't believe it was a 12a. We were totally misled by the title and rating. The film sensors have obviously lost the plot! Even if was an 18 who wants to see a woman with We took our 9 and 11 year old to see this. It was shocking. We couldn't believe it was a 12a. We were totally misled by the title and rating. The film sensors have obviously lost the plot! Even if was an 18 who wants to see a woman with 2 tampax shoved up her nose. Total trash not suitable for any normal person to view let alone children.",
      "review_date": "2008-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the first film I've ever walked out on...it's hard to describe in words how low-brow and devoid of humour this film is. I didn't have any preconceptions of the movie before I saw it, so I wasn't already a hater. This is the first film I've ever walked out on...it's hard to describe in words how low-brow and devoid of humour this film is. I didn't have any preconceptions of the movie before I saw it, so I wasn't already a hater. Having said that, I certianly am now.",
      "review_date": "2008-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How many of these ridiculously bad Zucker films can be put out. What is an outrage is that there's young, dedicated film makers out there with great ideas who only need a financial break to get their work put out - and yet we get these How many of these ridiculously bad Zucker films can be put out. What is an outrage is that there's young, dedicated film makers out there with great ideas who only need a financial break to get their work put out - and yet we get these kind of cornball movies that open big, and within 3 weeks fade into obscurity. For me, the only good film of this type was Scary Movie - which is the first. Every single one of its predecessors STINK, just like this one.",
      "review_date": "2008-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I wish I could give this a lower vote, I was appauled at the sex in this movie marketed to children and teens. No wonder our society is falling apart. I am sad that children are probably going to this expecting a \"Drake and Josh\" type fun I wish I could give this a lower vote, I was appauled at the sex in this movie marketed to children and teens. No wonder our society is falling apart. I am sad that children are probably going to this expecting a \"Drake and Josh\" type fun film and could be exposed to images they should not be seeing.",
      "review_date": "2008-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bad. Just bad. This may be the least funny movie in the \"parody movie\" series, that has really outlived it's welcome.",
      "review_date": "2008-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought this movie was supposed to be funny, but i wasn't laughing. i thought it was boring and a waste of time and money, please save yourself the anguish and go see something else, anything else!",
      "review_date": "2008-07-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thrown together and horrid. A long time ago, the Weinsteins made good movies. No more.",
      "review_date": "2008-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Shoud be a negative 100. It is just so awful. The whole movie theme is just about sex sex and sex. If people want to see sex they might as well watch porn.",
      "review_date": "2008-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Eric Holmberg, the narrator of \"Hells Bells 2: The Dangers of Rock 'n' Roll\", a right-wing, and occasionally right-on the money documentary about the inherent evil in popular music, complained that Hollywood often treats the Eric Holmberg, the narrator of \"Hells Bells 2: The Dangers of Rock 'n' Roll\", a right-wing, and occasionally right-on the money documentary about the inherent evil in popular music, complained that Hollywood often treats the Buddhists with kid gloves, while Christians have to deal with lampoon after lampoon about their faith on a regular basis. Well, Holmberg would certainly be pleased with \"Superhero Movie\", in which Dragonfly(Drake Bell) throws body blow after body blow into the Dalai Lama's solar plexus. Barry Andrews, the lead singer of Shreikback, wrote an amazing song called \"Gunning for the Buddha\"(from the album \"Big Night Music\"), that was incredibly offensive, but undeniably artful, and ultimately, provocative. \"Superhero Movie\" is not artful, or provocative. Beating up the Dalai Lama is just plain mean. The \"Police Squad\" movies, starring Leslie Nielsen, were irreverent, but nice. When Priscilla Presley stepped down from a ladder, and Lieutenant Frank Drebit said, \"Nice beaver,\" before the King's widow produces an actual beaver. That was funny. What's not funny? Disturbing a scantily-dressed female corpse at an open casket burial. There's not an actor alive who could make this funny. Nielsen, he tries.",
      "review_date": "2008-05-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film had better potential, but writer-director Craig Mazin believes that good comedy is only sex jokes, fart jokes, poop jokes, pop culture and internet references are the way to go. Scattershot satire is only good until the middle of This film had better potential, but writer-director Craig Mazin believes that good comedy is only sex jokes, fart jokes, poop jokes, pop culture and internet references are the way to go. Scattershot satire is only good until the middle of the movie. Better than Epic Movie, though.",
      "review_date": "2008-07-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good....Lord..... I honestly don't think I can explain just how bad this film is using words.",
      "review_date": "2008-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sucky plot and dumb comedy....Rather watch Scary Movie 1 over and over again before I watch this again.",
      "review_date": "2008-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was okay, its certainly better than 'Meet the Spartans' which is not saying much but still this spoof-movie scores a few laughs.",
      "review_date": "2009-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie tried to copy scary movie. I don't want to see any other type of these films again. Not funny, irritating, and insulting to movies as a whole. Completely and utterly stupid.",
      "review_date": "2012-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This isn't the worst parody film ever made, but Superhero Movie does lack in laughs (with an exception of Leslie Neilson) and it's special effects are typical of it's genre. Drake Bell is ok.",
      "review_date": "2014-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In an age of atrocious parodies, Superhero Movie is almost like a sigh of relief, no it wasn't necessarily a good parody film, but it was a lot funnier than the majority of them being made these years.",
      "review_date": "2013-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everything about this movie just screams \"typical spoof comedy film.\" There's nothing about this film that feels special. Sure, there are a few funny moments, but most of the film is just bland, tired, and just not consistently funny. It'sEverything about this movie just screams \"typical spoof comedy film.\" There's nothing about this film that feels special. Sure, there are a few funny moments, but most of the film is just bland, tired, and just not consistently funny. It's not the worst thing you'll ever see, and it might even fall into the \"so bad, it's good\" camp, but \"Superhero Movie\" won't revitalize the spoof comedy genre and it should only be viewed by diehard fans of spoof films.",
      "review_date": "2016-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Superhero Movie\" provides some laughs, but on pure cinematic terms, this is a pathetically bad \"Spider-Man\" satire that doesn't fulfill a moviegoer's expectation.",
      "review_date": "2015-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The only decent parody movie in a sea full of Jason Friedberg and Aaron Seltzer spoof movies.\r PROS:\r\n*Drake Bell does a great performance\r\n*Funnier than all Jason Friedberg and Aaron Seltzer's movies\r\n*Parodies only a few movies instead ofThe only decent parody movie in a sea full of Jason Friedberg and Aaron Seltzer spoof movies.\r PROS:\r*Drake Bell does a great performance\r*Funnier than all Jason Friedberg and Aaron Seltzer's movies\r*Parodies only a few movies instead of many\r*Leslie Nielsen\r*Great scene that parodies Batman Begins\r*Good performances\r*Has a fart joke that's actually funny.\r CONS:\r*Too much unfunny slapstick\r*Almost remakes it's main film target instead of parodying it\r*Cliché jokes\r*Tries too hard to be like Scary Movie\r*Wasting Leslie Nielsen\r*Including jokes that were already outdated by the time the movie came out",
      "review_date": "2016-07-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Eh oui, dès que vous voyez \"movie\" dans un titre de film américain, c'est comme un panneau clignotant qui veut dire \"danger, film de golio\" ! alors autant être prévenu et préparé... surtout qu'ici c'est du lourd dans le genre, du très lourd,Eh oui, dès que vous voyez \"movie\" dans un titre de film américain, c'est comme un panneau clignotant qui veut dire \"danger, film de golio\" ! alors autant être prévenu et préparé... surtout qu'ici c'est du lourd dans le genre, du très lourd, le genre qui s'attaque au sous-genre des films de super-héros, déjà super-débiles par défaut (et défauts) !Donc on ne rit pas trop ou si peu qu'on surveille à la fois et avant tout le plafond et le débilemètre dont l'aiguille fait des bonds de cabri et des sauts de carpe avec en fin de compte une \"fin\" particulièrement poussive au bout d'à peine 1h10 (je ne sais pas ce qu'il y a après : un quart d'heure de générique et de vidéogags sans doute ?).Nous retiendrons néanmoins la scène ou la séquence plutôt de pets, un passage souvent obligé dans les \"comédies\" de cet acabit, ce qui m'a rappelé une autre séquence avec un chat dans un autre \"movie\", un \"scary\" je crois. J'avoue que j'ai bien ri, car les flatulences restent une valeur sûre, une valeur refuge des films de golios ! C'est quoi qu'il en soit aussi catastrophique qu'attendu, pas de surprise à cet égard.",
      "review_date": "2020-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For a parody spoof movie this one worked rather well. With brilliant cameo roles from Dr Steven Hawkins who played himself for laughs.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yes, there were indeed some unfunny parts in the movie, but all the other funny jokes made me laugh so hard that tears came out of my eyes. Overall, very good parody of one of my favorite movie genres!",
      "review_date": "2011-04-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't listen to the hate, I loved it. I found it to be very hilarious. Some people just TRY to find flaws and not laugh to make the movie look like it sucks, it doesn't. Hilarious movie. Oddly enough, spoof movies suck but, this doesn't.",
      "review_date": "2011-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The only thing this movie has going for it is that it quickly fades into obscurity not too long after you have seen it. Not the atrocity Meet The Spartans is, but still quite bad and uninspired.",
      "review_date": "2012-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Believe me, this movie is a spoof, and all spoofs are always terrible, no question. Intimidated by this movie, seriously? Even a 7 year old can write better than this. But a 30 year old can't, BEYOND terrible.",
      "review_date": "2013-05-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Whoever gave bad reviews to this gem obviously can't laugh unless it's super complicated commedy. Welp to me I need only the quote \"I don't wear diamonds\" to laugh uncontrollably. I love this movie",
      "review_date": "2022-03-31",
      "source": "metacritic"
    }
  ],
  "num_reviews": 64
}