{
  "title": "The Day the Earth Stood Still",
  "rating": 4.7,
  "release_date": "2008-12-12",
  "genre": [
    "Sci-Fi",
    "Drama",
    "Thriller"
  ],
  "summary": "The Day the Earth Stood Still is 20th Century Fox’s contemporary reinvention of its 1951 classic.  Klaatu, an alien who arrives on our planet, triggers a global upheaval. As governments and scientists race to unravel the mystery behind the visitor’s appearance, a woman and her young stepson get caught up in his mission – and come toThe Day the Earth Stood Still is 20th Century Fox’s contemporary reinvention of its 1951 classic.  Klaatu, an alien who arrives on our planet, triggers a global upheaval. As governments and scientists race to unravel the mystery behind the visitor’s appearance, a woman and her young stepson get caught up in his mission – and come to understand the ramifications of Klaatu calling himself a “friend to the Earth.” (20th Century Fox)… Expand",
  "critic_reviews": [
    "This contemporary remake of the science-fiction classic knew what it was doing when it cast Keanu Reeves, the movies' greatest stone face since Buster Keaton.",
    "Surprise! The remake is not a heresy. It's a decent enough stab at being what the old movie was to its time, following the same basic plot, full of respectful references to its model, updated with a gallery of fairly imaginative special effects.",
    "The one unforgivable crime committed in this remake is the lack of the original's most famous line of dialogue: \"Klaatu barada nikto.\" Would it have been so tough to squeeze that in somewhere?",
    "I can't explain the film's main problem without giving plot points away; suffice to say that, after decades of watching Earth, Klaatu's team of observers has missed a crucial event you and I witness every day. I can tell you about the secondary problem, though: too much money.",
    "An entertaining rethink of the 1951 classic.",
    "Just because the new The Day the Earth Stood Still is green, though, doesn't mean it's dull. If anything, there's a lot more mayhem and destruction this time around.",
    "Passed my popcorn-movie test. Using the vast, expensive technology of a big studio production, it roused enough cheap energy to drive me to eat a bag of popcorn fit for a circus animal and wash it down with a quart of Diet Coke.",
    "A remake that does not disgrace the original, this is sufficiently different to stand alone and just as relevant in its concerns – as well as succeeding (arguably better) as a thriller. And after this performance, are we sure that Keanu Reeves is really human?",
    "Like the big shiny sphere at its center, the film is fairly pretty, but there's no real sense that there's anything inside it.",
    "For most of the way this ecofriendly fantasy is pleasantly clunky, and Reeves, whose expressive range here is slim to none, is perfectly cast as the alien.",
    "The problem here is that there are no big ideas.",
    "All this is presented in an expensive, good-looking film that is well-made by Scott Derrickson, but to no avail.",
    "Keanu Reeves plays Klaatu, confining his usual two-and-a-half-note vocal range to half that.",
    "Although the new version, which stars Keanu Reeves, is likely to make audiences pine for the meta-irony of \"Mystery Science Theater 3000,\" it's not a complete failure.",
    "The story, an updated version of the 1951 classic about a portentous extraterrestrial visit, feels musty and derivative, and not only because it's a remake.",
    "Something has been lost in the translation, and it's not just the script.",
    "As a message movie, it's preachy without being serious; for an action movie, there's a lot of racket but not much fun.",
    "One of the big problems here is that, despite much exposition, the nature of Klaatu's mission on Earth isn't at all clear.",
    "It lacks the simple elegance and intelligence of the earlier film, and employs special effects and pointless action scenes to replace passages of dialogue.",
    "The opening stretch, when the visitor arrives on earth and blithely dresses down mankind, is great fun. But screenwriter David Scarpi has drained away much of the sentiment.",
    "Despite the best efforts of stars Keanu Reeves and Jennifer Connelly, this new \"Day\" is tired and corny.",
    "Pretty good as science fiction thrillers go, but sadly, there isn't much more to say about it.",
    "A 'so-so' movie. It's not particularly good, but it's competent and more or less successful in its goals.",
    "The original Day the Earth Stood Still had a paranoid poetry that lifted the audience up even as it warned the world to come together. This one is so dour it just comes off as a scolding.",
    "This botched remake of \"The Day the Earth Stood Still\" seriously dishonors the seriously fine 1951 sci-fi landmark on which it's based.",
    "The film's major action sequences are never exciting, and even the now-requisite destruction of New York feels lazy.",
    "Any movie that awards a former Monty Python cast member a Nobel Prize in anything cannot be all bad. And The Day the Earth Stood Still could be worse.",
    "Dunno about the Earth, but time certainly stands still for a goodly portion of Scott Derrickson's expensively produced but utterly boneheaded remake of The Day the Earth Stood Still.",
    "Klaatu is a dream role for the beautifully blank Reeves, since he doesn’t even have to pretend to emote.",
    "How can this movie not be fun?",
    "Dull, unnecessary film.",
    "A jumble of spare parts and leftover dialogue, as if it had been assembled out of unused bits of every movie where an unknown whatzit threatens our way of life and the government goes into full institutional pants-crapping panic mode.",
    "What's never explained is why anyone would do such a dumb remake of Robert Wise's 1951 sci-fi classic.",
    "Suffice it to say that these morons have, quite simply, turned The Day the Earth Stood Still on its head and what's falling out of its pockets in that upended state is a stream of junk."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This was quite a bit better than i had expected. Thematically updated for the world's current parlous state. Keanu Reeves is well cast as Klaatu. Maybe not the classic of the 1951 original but still watchable.",
      "review_date": "2010-11-26"
    },
    {
      "review_title": null,
      "content": "The beginning of the movie seemed to be going somewhere but honestly this movie was terrible. What were the people making this movie thinking honestly? They have known what people would think of this film. Just terrible. Even worst than War The beginning of the movie seemed to be going somewhere but honestly this movie was terrible. What were the people making this movie thinking honestly? They have known what people would think of this film. Just terrible. Even worst than War of the Worlds. Don't waste your time seeing this.",
      "review_date": "2008-12-30"
    },
    {
      "review_title": null,
      "content": "Terrible movie. I give it a 2 for Jennifer Connelly and Keanu Reeves who did their best with the horrible script and some decent cgi. I thought Jaden Smith was acting bad and more importantly..annoying and distracting as hell. He might be Terrible movie. I give it a 2 for Jennifer Connelly and Keanu Reeves who did their best with the horrible script and some decent cgi. I thought Jaden Smith was acting bad and more importantly..annoying and distracting as hell. He might be cute for comedies with his funny hair but he can't do dramatic scenes with subjects like losing a parent. There a lots of better child actors out there. His character was useless and distracting for the movie. But that is also the fault of the screen writer and the director. Ever heard of pacing?? And also ever heard of the audience sympathizing for at least one of the characters?? Avoid if you can. Dumb remake with unsympathetic characters including a very irritating Jaden Smith.",
      "review_date": "2009-03-04"
    },
    {
      "review_title": null,
      "content": "I really don't get how you can 100 million dollars on a movie and then have a complete idiot write the script. Why,o why, would you greet our first interstellar visitor with a bullet and \"enhanced interrogation\" techniques?",
      "review_date": "2009-01-27"
    },
    {
      "review_title": null,
      "content": "Boring movie. If they had edited down to a 30 minute short it might have been exciting.",
      "review_date": "2009-01-04"
    },
    {
      "review_title": null,
      "content": "The only thing I really appreciated were the special effects. But Keanu Reeves simply can't act. The end is so bad, I really didn't like it. Plus, there's absolutely nothing to say about the story, it' quite boring.",
      "review_date": "2009-03-02"
    },
    {
      "review_title": null,
      "content": "One of the five worst (not worse) films of 2008. Pathetically dreadful. Only character of interest was John Cleese.There needs to be a movie remake committee somewhere that can stop a green light on this crap!",
      "review_date": "2009-04-11"
    },
    {
      "review_title": null,
      "content": "A one for special effects, now the real part of the movie review, im a fan of the 1951, and keanu is good in sci-fi, BUT jenifers staring & wonder at this great alien & his robot is not enough to say this has epic action, just the opposite. A one for special effects, now the real part of the movie review, im a fan of the 1951, and keanu is good in sci-fi, BUT jenifers staring & wonder at this great alien & his robot is not enough to say this has epic action, just the opposite. They Fail miserably in the movie is with GORT, simply they dont stop him like in the original or really even try too, He only stares and has less screen time then Darth Maul did! enuff said!",
      "review_date": "2009-04-10"
    },
    {
      "review_title": null,
      "content": "I went there expecting to see a action/sci-fi war of the worlds type film when it turned out to be boring,unfrilling and average Iv'e only seen it once and never agian.",
      "review_date": "2009-05-22"
    },
    {
      "review_title": null,
      "content": "Awful is an understatement. There was no suspense, a poorly written script, and no character development. Even when they had the opportunity to do something out of this world the director missed the opportunity as he seemed to color his Awful is an understatement. There was no suspense, a poorly written script, and no character development. Even when they had the opportunity to do something out of this world the director missed the opportunity as he seemed to color his picture by the numbers. How can you take a classic and turn it into this garbage. Avoid.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "For a movie about the destruction of the world it sure was boring. At the beginning upon first arrival there was a curiosity as to the plot, but after that the movie progressed at a lackadaisical pace (Note: I never saw the original so for For a movie about the destruction of the world it sure was boring. At the beginning upon first arrival there was a curiosity as to the plot, but after that the movie progressed at a lackadaisical pace (Note: I never saw the original so for those who did and know the story line you might be bored from the get-go). The special effects were pretty boring and there weren't that many considering this is an 'end of the world' flick. Honestly, if you want to be more entertained go back and watch Independence Day or even War of the Worlds. They both blow this one out of the water with better special effects, cooler aliens, a grander scale, and a movie worthy of worldwide annihilation. P.S. Only thing I liked about this movie was the old school robot, but he barely got any screen time.",
      "review_date": "2008-12-16"
    },
    {
      "review_title": null,
      "content": "Dreadful film that is slow moving without any character development. With just a little imagination it could have been so much more. An embarrassment to share the same title as the 1951 classic. Keanu Reeves sleepwalks through his role. Dreadful film that is slow moving without any character development. With just a little imagination it could have been so much more. An embarrassment to share the same title as the 1951 classic. Keanu Reeves sleepwalks through his role. Terribly disappointing.",
      "review_date": "2008-12-21"
    },
    {
      "review_title": null,
      "content": "Pretty lame flick without any suspense. It was so bad I started laughing at some of the dialog. Keanu Reeves is a joke. Who makes these things? Idiots?",
      "review_date": "2008-12-21"
    },
    {
      "review_title": null,
      "content": "One of the worse movies I've ever seen. The movie totally betways the intended story line. More time is spent discussing the live of the main femail character and her inter-racial son than the story line. The movie fails to caputre your One of the worse movies I've ever seen. The movie totally betways the intended story line. More time is spent discussing the live of the main femail character and her inter-racial son than the story line. The movie fails to caputre your interest, the acting was extremely bad. I urge you to never see this movie.",
      "review_date": "2008-12-27"
    },
    {
      "review_title": null,
      "content": "Ouch! This movie is barely worth renting. The movie itself was very far from its former self from 1951. It lacked key phrases that the original did. Might I add that dialog and the basic plot are really the only thing you need to copy when Ouch! This movie is barely worth renting. The movie itself was very far from its former self from 1951. It lacked key phrases that the original did. Might I add that dialog and the basic plot are really the only thing you need to copy when remaking an older movie. 4/10 and I'm being generous.",
      "review_date": "2009-01-31"
    },
    {
      "review_title": null,
      "content": "This is possible the worst movie ever made. It was worse than The Day After Tomorrow and the Core put together. The script is terrible, the best actor is the large sentinel thing and worst of all, nothing happens! The worst bits of hollywood This is possible the worst movie ever made. It was worse than The Day After Tomorrow and the Core put together. The script is terrible, the best actor is the large sentinel thing and worst of all, nothing happens! The worst bits of hollywood mega \"event\" movies distilled into one big mess. Rubbish",
      "review_date": "2009-04-29"
    },
    {
      "review_title": null,
      "content": "Lame. No sane investor could ever sanction the money they spent to make this ridiculous film unless they wanted to go broke. No bailout for this crapola.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Basically, this movie is about Global Warming. With a terrible subject as it's foundation, and horrid story poorly draped over it, this movie had no chance. The CG even looked bad.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "What have we become? To even call this movie by the same name as the black and white classic is an insult. For those of you who liked or even loved this movie I would suggest that you rent the original and then you will understand how What have we become? To even call this movie by the same name as the black and white classic is an insult. For those of you who liked or even loved this movie I would suggest that you rent the original and then you will understand how terrible a movie this is. You need to check your brains in at the door as there is nothing suspenseful or interesting. Keanu Reeves must have a death wish because this is as bad as it gets. Horrible flick.",
      "review_date": "2008-12-18"
    },
    {
      "review_title": null,
      "content": "To those of you who are taken in with the childlike computer generated special effects who don't know any better, I suggest you watch the black and white 1951 original classic. Then you'll understand what a good movie truly is. To those of you who are taken in with the childlike computer generated special effects who don't know any better, I suggest you watch the black and white 1951 original classic. Then you'll understand what a good movie truly is. This remake is total garbage not worthy of being mentioned in the same breath with the original.",
      "review_date": "2008-12-21"
    },
    {
      "review_title": null,
      "content": "See what happens if you don't listen to me? That was me Al as GORT. I had as big a part as I did as VP. Yeah the movie makes no sense and after about a half hour in you realize you have been taken. Those diamond mosquito's are now See what happens if you don't listen to me? That was me Al as GORT. I had as big a part as I did as VP. Yeah the movie makes no sense and after about a half hour in you realize you have been taken. Those diamond mosquito's are now on the endangered list. LOL",
      "review_date": "2008-12-22"
    },
    {
      "review_title": null,
      "content": "One of the worse ever seen...",
      "review_date": "2009-02-27"
    },
    {
      "review_title": null,
      "content": "One of the worst sci-fis of all time. Story doesn't make sense, terrible dialogue and bad acting. Jaden Smith can't be cast in another movie. That is nepotism. Boy CANNOT act!!!!!! He ruins every movie he's in.",
      "review_date": "2009-04-12"
    },
    {
      "review_title": null,
      "content": "Boring. Other than one brief scene with one of the characters being snatched up by a helicopter, I found this movie to duller than dishwater. Very disappointed.",
      "review_date": "2009-04-21"
    },
    {
      "review_title": null,
      "content": "Cannot believe how bad this is. The interrelationship between the robot and Klatu never explained? The day everything stood still?? The famous line we all ran around saying to each other as kids? eeves was well cast -- a part requiring no Cannot believe how bad this is. The interrelationship between the robot and Klatu never explained? The day everything stood still?? The famous line we all ran around saying to each other as kids? eeves was well cast -- a part requiring no acting fits him ever so well. A massive demonstration of Hollywood bungling. Special effects do not a movie make. I need to rewatch the original to purge any memory of this from my mind.",
      "review_date": "2009-04-28"
    },
    {
      "review_title": null,
      "content": "The begging quesion is Keanu Reeves alive. More importantly does anyone care? This may be one of the worst most boring movies of the year. A definite contender for a Razzberry.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "It was ok until the anti-climatic ending when the world is lift with a bunch of dead metal bugs and no power.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "Bland remake left me wanting to go home and rewatch the original. Save yourself the time and buy the Blu-ray instead.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "not bad at all, but I wouldn't call it \"amusing or exciting\". Instead it was a bit boring.",
      "review_date": "2008-12-19"
    },
    {
      "review_title": null,
      "content": "Tries to be new, tries to pay homage to the old...fails at both. Acting is fine. Keanu doing his best Bill Pullman as an emotionless alien. The script is just weak, no drama. The music...forgettable. Another \"Why did they remake this?\"",
      "review_date": "2008-12-19"
    },
    {
      "review_title": null,
      "content": "The plot makes no sense, the script is illogical and the acting is poor. The kid adds nothing to the story or the mood of the movie. What's particularly sad is that the film makers didn't seem to get the idea of the original, The plot makes no sense, the script is illogical and the acting is poor. The kid adds nothing to the story or the mood of the movie. What's particularly sad is that the film makers didn't seem to get the idea of the original, fabulous, movie from the 50's. There's a reason that the original is a kind of cultural icon--it works on many levels, it's entertaining. With virtually no special effects beyond those implied by the story, the power involved was clear. In this new version, Keanu seems sometimes to have extraordinary powers, sometimes not. He never seems either smart or wise.",
      "review_date": "2008-12-21"
    },
    {
      "review_title": null,
      "content": "Walked out! Terrible acting. Played-out storyline.",
      "review_date": "2008-12-21"
    },
    {
      "review_title": null,
      "content": "Keanu Reeves was going for a terrible Arnold Swartssnagger (spelled wrong srry) theme with his acting. You couldn't tell if he wasn't trying to act or if he was trying to hard.",
      "review_date": "2008-12-22"
    },
    {
      "review_title": null,
      "content": "Could've been good or at least entertaining. Pacing was bad. Script was bad. And the direction would've been better under someone closer to a Spielberg. The sid estory and the kid was annoying and out of place. Poorly executed overall.",
      "review_date": "2009-04-10"
    },
    {
      "review_title": null,
      "content": "Sad sad remake of a great movie. Lame updating, and the messege get conveluted. The filmmakers took one of the greatest robots of classic scifi and completely screwed it up. Sad sad movie.",
      "review_date": "2009-04-11"
    },
    {
      "review_title": null,
      "content": "What happened? seriously... did the original make sense? cos this one didn't... from what i could understand it appeared that aliens came to earth to kill everyone then halfway through decided to take pity on humans and left the planet, What happened? seriously... did the original make sense? cos this one didn't... from what i could understand it appeared that aliens came to earth to kill everyone then halfway through decided to take pity on humans and left the planet, leaving us without any form of technology as punishment or something. a 40/100 is definitely more than it deserves.",
      "review_date": "2009-08-29"
    },
    {
      "review_title": null,
      "content": "The plot is flawed. and acting is so rigid that any emotion is lost. keanu reeves proves yet once again that unless he has a shades on he is terrible.",
      "review_date": "2009-05-13"
    },
    {
      "review_title": null,
      "content": "Predictable and pushing a green agenda.",
      "review_date": "2009-05-17"
    },
    {
      "review_title": null,
      "content": "Thank you Keanu Reeves and thank you 20th century fox for ruining a classic.",
      "review_date": "2009-06-06"
    },
    {
      "review_title": null,
      "content": "The Day the Earth Stood Still based on the old classic, shows that whatever you do you can never make a remake that is better then the original. But the one thing in this movie that really surprised me is that they didn't say one swear The Day the Earth Stood Still based on the old classic, shows that whatever you do you can never make a remake that is better then the original. But the one thing in this movie that really surprised me is that they didn't say one swear in the entire film. It's a miracle in every PG-13 movie there has to be at least one swear in this there were none. Also another thing about this film that I didn't like was the over the top plot. That was the only thing that really bothered me. The acting was alright the special effects were fascinating, I thought it was pretty unpredictable so overall it was a nice rent it movie. Sure some parts were weird but it still had it's cool clever scenes. I feel like this movie would of been better of not being made because Scott Derrickson wasted his money making this remake it just wasn't worth it.",
      "review_date": "2009-07-23"
    },
    {
      "review_title": null,
      "content": "Exemplifies all that is wrong with Hollywood films: an unnecessary remake, an overwrought script, and a director too enamored with special effects for their own sake. Utterly lacking in every department. Charmless.",
      "review_date": "2009-08-26"
    },
    {
      "review_title": null,
      "content": "One of the worst movies ever. Nevertheless, not the worst.",
      "review_date": "2009-08-28"
    },
    {
      "review_title": null,
      "content": "Politically correct non-sense!",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Another failed attempt at making a remake of a fantastic classic. I can see where they were going when they got Keanu Reeves to play klatuu. He's your perfect stone faced actor with one expression and he did this part well. But this movieAnother failed attempt at making a remake of a fantastic classic. I can see where they were going when they got Keanu Reeves to play klatuu. He's your perfect stone faced actor with one expression and he did this part well. But this movie failed hard to bring back the classic 1951 film by the same name. This movie for one was rushed and that got me angry. NOT a good movie and do not recommend it.",
      "review_date": "2011-08-05"
    },
    {
      "review_title": null,
      "content": "Ok to watch once, but not something I'd ever watch a second time. Never saw the original, but still knew exactly where the movie was going.",
      "review_date": "2009-05-27"
    },
    {
      "review_title": null,
      "content": "My girlfriend and I saw the movie last night (12/19). Everyone was laughing so hard throughout the show, including us, we had tears in our eyes. We both loved the movie and plan on seeing it again -- and we never do that. Jim Carey -- thank My girlfriend and I saw the movie last night (12/19). Everyone was laughing so hard throughout the show, including us, we had tears in our eyes. We both loved the movie and plan on seeing it again -- and we never do that. Jim Carey -- thank you! I needed the laughter and gave it to us in a wonderful new style. Great acting! And the take off used in the seminar was great too. I've attended Tony Robbins for years and others and it was a little over board but not by much when it came to the emotions. Right on! I encourage everyone to see this movie if you want to laugh hard and have a great time.",
      "review_date": "2008-12-20"
    },
    {
      "review_title": null,
      "content": "This movie is ONLY rated badly because it dared to take the name of the 1951 gem of the same name. Other than two minor points, that is ALL it has in common with it. IF YOU view the movie WITHOUT reference to the older one, it's This movie is ONLY rated badly because it dared to take the name of the 1951 gem of the same name. Other than two minor points, that is ALL it has in common with it. IF YOU view the movie WITHOUT reference to the older one, it's actually a pretty good movie.",
      "review_date": "2008-12-20"
    },
    {
      "review_title": null,
      "content": "What starts out with great action turns into a schmaltzy tale for the \"green\" set. Preachy. Good special effects.",
      "review_date": "2008-12-20"
    },
    {
      "review_title": null,
      "content": "Excellent film. I loved every bit of it.",
      "review_date": "2009-01-01"
    },
    {
      "review_title": null,
      "content": "Keanu sucks. the movie goes no where and will 's boy is the only halfway decent spotlight in this tragedy of a remake.",
      "review_date": "2009-03-10"
    },
    {
      "review_title": null,
      "content": "Disappointing.",
      "review_date": "2009-06-27"
    },
    {
      "review_title": null,
      "content": "What a poor excuse for a movie. No sympathetic characters. No excitement. No (intentional) laughs. Low-rent effects. Bogus message. \"Happy ending\" is that the aliens don't kill us, just stop all our machines. Care to estimate how many What a poor excuse for a movie. No sympathetic characters. No excitement. No (intentional) laughs. Low-rent effects. Bogus message. \"Happy ending\" is that the aliens don't kill us, just stop all our machines. Care to estimate how many billions would starve due to no tractors to pull plows, no trucks to move produce, no refrigerators to keep food fresh? Kinder just to wipe them out, no? I've watched other \"message\" movies that were feeble logically, but were made tolerable because there were characters to identify with, or worthy special effects, or a good laugh or two. This one has nothing to recommend it. I went to IMDB and rated it a 1. Then I hunted down the other 3 movies I had rated as 1s and bumped each of them up to 2. Why must message films always be made by production teams that are ashamed of being human?",
      "review_date": "2008-12-16"
    },
    {
      "review_title": null,
      "content": "First off, i thought keanu reeves would ruin this movie, but i'll say that he played a decent klaatu. What ruined this movie, is the combination of environmental propaganda, severely bad (and completely unnecessary) product placement, First off, i thought keanu reeves would ruin this movie, but i'll say that he played a decent klaatu. What ruined this movie, is the combination of environmental propaganda, severely bad (and completely unnecessary) product placement, the over use of CG, and a poor replication of the very few similar scenes in the original. it was pointless to remake, the original is still much better. if you have seen the classic version in black and white, you will walk of out this movie half-disgusted.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI created an account just to express my contempt for this movie.  Started out interestingly enough, and devolves into a classic Hollywood  'Hurr-Durr humans are killing de Earff, durr!'So let me get this right:  there are only a handful of planets in the universe capable of complex life, according to the film.  Therefore we assume that the races who sent klaatu evolved in a similar manner to us.  Yet humans are beyond saving because of some hollywood writers' idea of global warming or other claptrap.  What about those other races?  did they just jump from amoebas to transcendent beings, and totally bypass their industrial and economic revolutions that require planetary resources?  I guess so. Oh well, nothing a few equations written with John Cleese won't fix.",
      "review_date": "2010-09-04"
    },
    {
      "review_title": null,
      "content": "I've rated this film a 10, not because it deserves a 10, but becaue the average of 4.5 is ridiculous. It was always going to struggle. A remake of a well loved movie that doesn't lend itself to the dumb immediate payback of modern actionI've rated this film a 10, not because it deserves a 10, but becaue the average of 4.5 is ridiculous. It was always going to struggle. A remake of a well loved movie that doesn't lend itself to the dumb immediate payback of modern action movies - it was screwed from the start. Critised for not being the original movie and for not being modern and full of action, or an exact duplicate, it never stood a chance. Actually there are a lot of subtleties to the movie, and the new twist on the old twist is brilliantly delivered;  for most of the movie I thought they'd forgotten the movie's name, and yet it turns out to be more poignant than in the original.Well worth watching if you have half a brain, but I suggest watching the orignal first. The makers of this film did, and it shows.",
      "review_date": "2011-06-18"
    },
    {
      "review_title": null,
      "content": "Quel gÃ¢chis! VoilÃ  ce qui m'est venu Ã  l'esprit dÃ¨s l'apparition du gÃ©nÃ©rique final. GÃ¢chis car, franchement, il y avait quelque chose Ã Quel gÃ¢chis! VoilÃ  ce qui m'est venu Ã  l'esprit dÃ¨s l'apparition du gÃ©nÃ©rique final. GÃ¢chis car, franchement, il y avait quelque chose Ã  tirer de ce remake. Tout d'abord, il faut bien avouer que le film a le mÃ©rite d'Ãªtre d'actualitÃ© (Ã©cologie, famille recomposÃ©e...), de proposer un casting pas si catastrophique que Ã§a (Keanu Reeves arrive Ã  rendre utile son jeu toujours aussi fade) et que le compositeur tente d'installer une ambiance adÃ©quate . Malheureusement, le terme de remake hollywoodien se fait grandement sentir : trop de moyens pour rien (pas de punch), effets numÃ©riques inÃ©gaux, mise en scÃ¨ne sans Ã¢me, happy end brutal et indigeste... Bref, c'est loupÃ© malgrÃ© que l'ensemble se laisse suivre.",
      "review_date": "2012-04-13"
    },
    {
      "review_title": null,
      "content": "Go see the 1951 version, it was waaaaaaaaaaaay better.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "I thoroughly enjoyed the movie, though it was not perfect.",
      "review_date": "2009-01-11"
    },
    {
      "review_title": null,
      "content": "A complete disaster in every way, acting, script, new ideas they're all terrible. There's never a moment when you're scared, intigued or even bothered about how it all ends. You feel no empathy for the human race at all, A complete disaster in every way, acting, script, new ideas they're all terrible. There's never a moment when you're scared, intigued or even bothered about how it all ends. You feel no empathy for the human race at all, where's the city destruction and human loss? The heart srings are never pulled on and by the time anything of significance happens you're already mentally in the car park thinking about what you'll be doing when you get home. It's hard to Judge Reeves on his acting as it's (purposely) wooden but it still seems bad, the child actor, a part which could have made this film as the alien started to feel what humanity was all about is just rubbish.",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "Interesting premise, fairly well executed. If you love these kind of disaster / end of world movies please don't be put off by the reviews, this movie is worth checking out!",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "This movie was not as good as the orignal as far as the acting was concerned. Keanu didn't do the movie any favors with his lackluster, emotionless performance. Jennifer's acting was fine. Special effects were nothing special and This movie was not as good as the orignal as far as the acting was concerned. Keanu didn't do the movie any favors with his lackluster, emotionless performance. Jennifer's acting was fine. Special effects were nothing special and below average for a modern sci-fi flick.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Breathtaking and thought provoking. 40/100 is too low an average.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "Poorly written and incoherent. Amazing special effects (even in IMAX) cannot give life to this dog.",
      "review_date": "2008-12-15"
    },
    {
      "review_title": null,
      "content": "I thought this was a great movie with an important message. More details on Klaatu's mission would have been nice, but no other complaints.",
      "review_date": "2008-12-18"
    },
    {
      "review_title": null,
      "content": "If aliens that looked like humans came they probably would be very calm, objective and emotionless. It had great elements such as the way humans, especially us Americans tend to apply Military action to any perceived threat. It was a mirror If aliens that looked like humans came they probably would be very calm, objective and emotionless. It had great elements such as the way humans, especially us Americans tend to apply Military action to any perceived threat. It was a mirror and we face that mirror and CHANGE.",
      "review_date": "2008-12-19"
    },
    {
      "review_title": null,
      "content": "I really wanted to like this film. I think Keanu Reeves and Jennifer Connelly are both good actors. But, I have to be honest, I was bored through much of the movie. The points of view of both the U.S. Government and the aliens were totally I really wanted to like this film. I think Keanu Reeves and Jennifer Connelly are both good actors. But, I have to be honest, I was bored through much of the movie. The points of view of both the U.S. Government and the aliens were totally idiotic. So it didn't pass the cerebral test that may have saved it since the action was less than exciting.",
      "review_date": "2008-12-20"
    },
    {
      "review_title": null,
      "content": "compared to the original is sucked, compared to anything it sucked. what a waste of time and money. this would have been better if it had been made by a complete retard running around with his head on fire. A remake of the day the earth compared to the original is sucked, compared to anything it sucked. what a waste of time and money. this would have been better if it had been made by a complete retard running around with his head on fire. A remake of the day the earth stood stil needed to be made, but this is not what is should have been by any strech of the imagination. Please stephen speilberg redo this redo.",
      "review_date": "2008-12-22"
    },
    {
      "review_title": null,
      "content": "I liked it a lot better than I expected to. It DOES get tiresome to find the U.S. government being the incompetent, aggressive, cabal of thugs in movie after movie, though. Plenty of predictable cliches in this flick but decently executed I liked it a lot better than I expected to. It DOES get tiresome to find the U.S. government being the incompetent, aggressive, cabal of thugs in movie after movie, though. Plenty of predictable cliches in this flick but decently executed and filmed.",
      "review_date": "2008-12-26"
    },
    {
      "review_title": null,
      "content": "This movie was not half as bad as I thought it would be. Not the greatest ending either but I was entertained nonetheless. Jennifer and Keanu did the best with the script.",
      "review_date": "2009-02-16"
    },
    {
      "review_title": null,
      "content": "I was very disappointed with this film. It was not a terrible film, it just did not live up to the expectations that I had for it. I was very excited to see this but then when I finally did, it was a let down. The concept seemed pretty cool I was very disappointed with this film. It was not a terrible film, it just did not live up to the expectations that I had for it. I was very excited to see this but then when I finally did, it was a let down. The concept seemed pretty cool but the execution was boring. the cool stuff that the trailers show don't even happen until the very end and they are not as cool as the trailers make out to seem. Wrap that up with a bad ending and you have a huge dissapointment.",
      "review_date": "2009-02-23"
    },
    {
      "review_title": null,
      "content": "I enjoyed it and found it very entertaining. I know, it's flawed but I was never once bored. The special effects were good. The performances are respectable, only Jaden Smith fails. Pure Hollywood entertainment.",
      "review_date": "2009-03-31"
    },
    {
      "review_title": null,
      "content": "Terrible,terrible movie.",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "Great film, good effects, although the ending was a bit of a let down.",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "The human whose likeness that Klaatu(Keanu Reeves) appropriates as easy comprehension for earthling contemplation, originally had a beard. Klaatu shaved. And sports a better haircut than his Reinhold Messner-like counterpart. That's one The human whose likeness that Klaatu(Keanu Reeves) appropriates as easy comprehension for earthling contemplation, originally had a beard. Klaatu shaved. And sports a better haircut than his Reinhold Messner-like counterpart. That's one vain alien. Reeves' smooth face recalls the diatribe put forth by Bruce Willis in Barry Levinson's \"What Just Happened\" about the fallacy of audience defamiliarization. In Reeves' case, however, it's a matter of professional courtesy that the facial outgrowths excuse themselves from its host. The chin tufts might out act him(there's not a world of difference between Klaatu and Reeves' human performance in \"Street Kings\"). When Klaatu emerges from the spherical ark, he's wearing a protective suit made out of living tissue. Which begs the question: Why bother with making a preliminary trip to try on human bodies if you're going to hide it under a deluge of white jelly? The biggest difference between the 1951 Robert Wise production and this egregious update is, of course, Klaatu himself, who comes off as a Sierra Club militant, or perhaps, a member of the Green party's galactic predecessors, the Mean Green party. In the nuclear age sci-fi classic, Klaatu offers the human race, a cure for cancer, and is shot for its humanitarian efforts. This update of \"The Day the Earth Stood Still\", in a sense, blasphemes the original, because Klaatu deserves the bullet. The alien is like Al Gore with an axe to grind. Bush stole the election in 2000, so Captain Ozone's doppelganger is going to steal the earth. Needless to say, Klaatu comes off as smug. The only people that Klaatu comes in contact with is a biologist(Jennifer Connelly) and her stepchild(Jaden Smith). It's an insult to the peacenik nature of the original Klaatu that Jacob has to teach the alien not to kill. Echoes of Edward Furlong in James Cameron's \"Terminator 2: Judgment Day\" educating the governor of California in pacifist ways loom loudly while this makeshift nuclear family eludes the law. Since Klaatu's visage is human-based, \"The Day the Earth Stood Still\" might have benefited dramatically had the original man's loved ones reconnected with this ghost in order to mount a defense for the human race's ongoing survival. At a cemetary, Jacob almost veers the movie into \"Pet Cemetary\" territory.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "sanctimonious drivel.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "No one loves science fiction movies more than I do. I saw the original and must have seen it 20 times since then. Michael Rennie was terrific. It was with great anticipation that I was looking forward to the remake. After seeing it this No one loves science fiction movies more than I do. I saw the original and must have seen it 20 times since then. Michael Rennie was terrific. It was with great anticipation that I was looking forward to the remake. After seeing it this evening there aren't words to describe how awful this turkey was. Keanu Reeves sleepwalks through the film as if he was a zombie. His fellow actors had to be embarrassed by the finished product because this was like Chinese Water torture as it meandered along oh so slow. There was nothing frightening, no suspense, no character development, no nothing. And the ending was so lame that theater goers were actually angry walking out of the movie. Save your hard earned dollars because this is one bad film.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Not nearly as well done as the original.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "I thought the movie was actually very worthwhile.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "Not nearly as bad as the critics say. It's not hard to follow, and makes for an interesting what if?",
      "review_date": "2008-12-15"
    },
    {
      "review_title": null,
      "content": "I don't really know why this movie is getting such bad reports. I've not seen the original and maybe that's why i like it, but i thought it was a decent movie, it's got a bit of a \"green\" undertone which might not be to I don't really know why this movie is getting such bad reports. I've not seen the original and maybe that's why i like it, but i thought it was a decent movie, it's got a bit of a \"green\" undertone which might not be to some people's tastes but if you just accept it as a simple popcorn movie and don't expect it to be a \"war of the worlds\" then you'll enjoy it.",
      "review_date": "2008-12-16"
    },
    {
      "review_title": null,
      "content": "Great film could not look away and what a great remake without introducing to many more plot points and characters.",
      "review_date": "2008-12-17"
    },
    {
      "review_title": null,
      "content": "I think the critics were a bit harsh with this movie. But it's true that the first half was promising, and that GORT didn't have much time in the movie. I did saw the original when I was much younger, and it doesn't badder me I think the critics were a bit harsh with this movie. But it's true that the first half was promising, and that GORT didn't have much time in the movie. I did saw the original when I was much younger, and it doesn't badder me if this film is different. The effects are fine, but the story is slim in substance. It doesn't explain or justify itself that much, which is a problem in terms of credibility. The second half falls short. If GORT would have been active in that part, it would have been more interesting. The actors were decent, but they didn't have much to work on. I must say the great work that was done with the music. This is by far the best part of the movie. Too bad the composer didn't have a solid movie to work on.",
      "review_date": "2008-12-20"
    },
    {
      "review_title": null,
      "content": "To be honest this movie was a little above average. Just because some pompous writers who think their criticism matters above all else, does not make a movie bad. Complaining about how they know what aliens or humankind would do in that To be honest this movie was a little above average. Just because some pompous writers who think their criticism matters above all else, does not make a movie bad. Complaining about how they know what aliens or humankind would do in that situation, what ignorant critics, I laugh at them. Yes, I agree that it may not be as good as the original, but for those who hasn't seen it would probably enjoy this movie. Even though the directors were horrible, it's not that bad of a movie. Critics, stop being so damned overzealous, just because you can write a few fancy words here and there. So people who read these reviews, at least rent the movie and watch it and see how your opinion compares with theirs, because critics' opinions are just that \"opinions\".",
      "review_date": "2009-02-15"
    },
    {
      "review_title": null,
      "content": "When will Hollywood realize that movies become Classics because they don't need a new and improved version. The 2008 version of The Day The Earth Stood Still is proof that 100 million dollars in CGI does not a classic make. You actually When will Hollywood realize that movies become Classics because they don't need a new and improved version. The 2008 version of The Day The Earth Stood Still is proof that 100 million dollars in CGI does not a classic make. You actually watch this movie remembering just how great the origiinal was, and still is! However, Keanu Reeves has found the perfect role to showcase his massive acting range - an emotionless alien. Rent the original now and next year you can rent this one with Invasion and the new Stepford Wives and have a Mystery Science Fiction Theatre Festival!!",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "This movie is no where near as bad as the critics have said. It is a very stylish film that is suspenseful and engaging. I have seen a lot of bad movies lately, this is not one of them. There could be more story / explanation and a little This movie is no where near as bad as the critics have said. It is a very stylish film that is suspenseful and engaging. I have seen a lot of bad movies lately, this is not one of them. There could be more story / explanation and a little less use of the child... but overall... The Day the Earth Stood Still... ROCKS!",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I have ever seen.",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "overall good story, but the use of the spheres instead of flying saucers and the nanotech locusts lacked the iconic impact that was present in the first version. Keanu Reeves acting was solid, but could have been used more effectively if the overall good story, but the use of the spheres instead of flying saucers and the nanotech locusts lacked the iconic impact that was present in the first version. Keanu Reeves acting was solid, but could have been used more effectively if the writing had been better.",
      "review_date": "2008-12-12"
    },
    {
      "review_title": null,
      "content": "Excellent movie, incredible special-effects.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Watched it today and I really enjoyed it. Great performace of Keanu Reeves (Not that I had any doubts..) Some of the lines reminded me of Matrix.. He just has that.. hmm, I dunno what do you call that...? Well, he's just perfect in Watched it today and I really enjoyed it. Great performace of Keanu Reeves (Not that I had any doubts..) Some of the lines reminded me of Matrix.. He just has that.. hmm, I dunno what do you call that...? Well, he's just perfect in these kinds of roles and movies ;)",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "I've never seen the first, and I never will. Coming into this fresh, it was exactly what I expected; a true-to-life representation of how it might go down.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "I never saw the original, so I went to go find out what the big mystery in the movie is. It turns out that the movie's mystery was how much product placement they could fit in there. It's literally everywhere. Product placement I never saw the original, so I went to go find out what the big mystery in the movie is. It turns out that the movie's mystery was how much product placement they could fit in there. It's literally everywhere. Product placement isn't inherently a problem, but when it's used to the extent that it is in this movie (every chance they get) it starts to seem more like a mediocre extended TV show than a movie. You go to movies for a fluid, engrossing experience and the egregious number of ads really detract from that here. That aside, Keanu Reaves was the perfect choice for the part. Sooo... acting was solid. 'Nuff said. All in all, I guess it wasn't awful - I just didn't want to go to the movies and throw down seven bucks for an ecology lesson and an armful of commercials. Bottom line: Wait till DVD or someone else is buying your ticket. It's nothing special.",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Not bad as almost everybody is saying and the best keanu ever. He doesn´t have to act in his role, he doesn´t have emotions as an alien!",
      "review_date": "2008-12-13"
    },
    {
      "review_title": null,
      "content": "Pretty good pop corn movie - better than a lot of the fodder that came out this year - wasn't intended to be Ben Hur.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "\"Starman\" meets \"War of the Worlds\". And not bad, either. The aliens--including Keanu's character-- give off a certain powerful menace that gives the film a sence of foreboding. Tight and too the point.",
      "review_date": "2008-12-14"
    },
    {
      "review_title": null,
      "content": "Destined to fail with the general consensus. It's a whirlwind of fragmented scenes that on the whole, at best, never accomplishes a solid grip on the attention of the viewing audience. The more serious scenes tend to be dull where the Destined to fail with the general consensus. It's a whirlwind of fragmented scenes that on the whole, at best, never accomplishes a solid grip on the attention of the viewing audience. The more serious scenes tend to be dull where the extreme measures that would normally be forefront in a global grave situation are non-existant. Sadly to say, the plot has good potential but this adaptation of the classic was assembled too quickly where it is evident there was a lack of \"fine-tuning\" in many areas of the production. Overall: It's a thumbs-down.",
      "review_date": "2008-12-15"
    },
    {
      "review_title": null,
      "content": "Not even a good popcorn movie.",
      "review_date": "2008-12-16"
    },
    {
      "review_title": null,
      "content": "I thought that it was good in taking a story that has so much potential and throwing it down the drain. The film dies when the largest amount of acting talent in the film is coming from young Jaden Smith. Thought to be honest Keanu Reeves I thought that it was good in taking a story that has so much potential and throwing it down the drain. The film dies when the largest amount of acting talent in the film is coming from young Jaden Smith. Thought to be honest Keanu Reeves landed theperfect role for him, a emotionless, dull character that was terribly revuved from the original. Overall this film was able to keep in the seat beccuase I saw it in IMAX and the sheer brilliance and size of the IMAX expierance was enough to keep me in the seat. The Day the Earth Stood Still should should have remained a classic not a crappy remake.",
      "review_date": "2008-12-23"
    },
    {
      "review_title": null,
      "content": "So I feel that both this version and the 1951 version both have their ups and downs. The 1951 version may look cheap compared to todays standards and the ending left me wanting more, but the acting and believability are extremely high.So I feel that both this version and the 1951 version both have their ups and downs. The 1951 version may look cheap compared to todays standards and the ending left me wanting more, but the acting and believability are extremely high. Fortunately, the 2008 remake retains the believability. The large amount of special effects doesn't make the story of this version less interesting. My eyes remained glued to the screen as I deeply was invested in what the characters would do next. A lot more of the science and the technology of the situation is explained in this version, and putting it in the modern times didn't remove the important plot elements. I think if you enjoyed the 1951 version, you should't have many reasons to hate this one.",
      "review_date": "2013-02-23"
    },
    {
      "review_title": null,
      "content": "Atypical, but also unprecedently bad film processing, extreme stupidly presented main movie ideas and reasoning between characters on 3th american school grade level. Story almost says nothing logic and someone claim meaning of this movie asAtypical, but also unprecedently bad film processing, extreme stupidly presented main movie ideas and reasoning between characters on 3th american school grade level. Story almost says nothing logic and someone claim meaning of this movie as main positive???!!!!! Well there is original view on invasion-apocalypse theme, unlike Independence Day style, and interesting visual-audio aesthetics. Good acting by main protagonist, and tension, to make people to think about their preferences in live, and about ways of our race. 2/10 for that",
      "review_date": "2014-08-11"
    },
    {
      "review_title": null,
      "content": "This movie could have been a whole lot better. The story is way too stupid and with a bunch of big actors nothing comes alive. Keanu Reeves is the worst actor of are generation so he doesn't help. The helicopters weren't even real, what aThis movie could have been a whole lot better. The story is way too stupid and with a bunch of big actors nothing comes alive. Keanu Reeves is the worst actor of are generation so he doesn't help. The helicopters weren't even real, what a cheap movie and it showed.",
      "review_date": "2012-03-30"
    }
  ],
  "num_reviews": 134
}