{
  "title": "The Wrestler",
  "rating": 8.2,
  "release_date": "2008-12-17",
  "summary": "Back in the late ‘80s, Randy “The Ram” Robinson was a headlining professional wrestler. Now, twenty years later, he ekes out a living performing for handfuls of diehard wrestling fans in high school gyms and community centers around New Jersey. (Fox Searchlight)",
  "critic_reviews": [
    "The Wrestler is like \"Rocky\" made by the Scorsese of \"Mean Streets.\" It's the rare movie fairy tale that's also a bravura work of art.",
    "Rourke creates a galvanizing, humorous, deeply moving portrait that instantly takes its place among the great, iconic screen performances. An elemental story simply and brilliantly told, Darren Aronofsky's fourth feature is a winner from every possible angle.",
    "Rourke is getting tons of press and award nominations, but Marisa Tomei kicks ass too. Not only does the one-time Oscar winner look amazing and perform her own pole tricks, but she effectively humanizes what could be just another naked chick in a movie.",
    "This is Rourke doing astonishing physical acting.",
    "The Wrestler is a character study, no more and no less, yet it's open-ended enough to function as many things.",
    "The movie has the simplicity and confidence of a Johnny Cash song.",
    "An emotional smackdown. Rourke's never been better, and the change of pace and texture suits Aronofsky perfectly. \"The Raging Bull\" of wrestling movies? Oh, go on then.",
    "It's a raw and honest film, and it keeps its feet firmly on the ground, even as The Ram flies through the air to deliver -- or receive -- another beating in the squared circle of life.",
    "What Rourke offers us, in short, is not just a comeback performance but something much rarer: a rounded, raddled portrait of a good man. Suddenly, there it is again--the charm, the anxious modesty, the never-distant hint of wrath, the teen-age smiles, and all the other virtues of a winner.",
    "The Ram is sometimes--often, even--a manipulative, self-pitying man, but Rourke and Aronofsky paint his portrait with a rigorous dignity.",
    "Like its hero, the movie has a blunt, exuberant honesty, pulling off even its false moves with conviction and flair.",
    "Aronofsky's directorial style is simple and spare. There are no flourishes or attempts to convince us that he is a master of his craft.",
    "You watch The Wrestler (with a superb title song from Bruce Springsteen) in a state of pure exhilaration. A great actor in a great movie will do that to you.",
    "The Wrestler offers something to pretty much everyone in the audience. Much like \"The Sopranos,\" it creates a world that might make you feel utterly at home or exhilarated by strange horrors. Maybe both.",
    "The Wrestler works for the same reason \"Rachel Getting Married\" works. The way they're acted, shot, edited and scored, both films deploy a loose, rough-hewn documentary style to great dramatic advantage. The corn isn't hyped. The performances click without going for the jugular.",
    "It's a haunting, scary, funny, sad portrayal from Rourke.",
    "The Wrestler presents a fascinating peek at the workings of the pro wrestling industry (the tenderness and humor the athletes share backstage is the complete opposite of the ferocity they display in the ring).",
    "The film's a little more accessible than \"Requiem for a Dream\" and a lot easier to understand than \"The Fountain,\" but its low-key grunginess may restrict its appeal to people who have liked professional wrestling and/or Rourke.",
    "Mostly though, the movie feeds off Rourke, who plays a genuinely decent guy who never lets his dawning self-awareness interfere with his responsibility to give the fans a show.",
    "It's bleak, credulity straining and often stomach-turning, but it definitely works as a heart-tugging character study, and Rourke's performance as the has-been title character is golden.",
    "Both Rourke and Tomei bring a tender, lived-in honesty to their sad roles.",
    "Director, Darren Aronofsky, and the writer, Robert D. Siegel, have turned the story of this washed-up faux gladiator into a film of authentic beauty and commanding consequence.",
    "He looks like a truck ran over him, but at 52 he's still ripped enough to get away with the role; in the end the movie is about Rourke's indomitability more than the character's.",
    "As far as I'm concerned, you can keep your Sean Penns and your Brad Pitts and your Frank Langellas; if there's any justice in the world, this year's best actor Academy Award will be going home with Rourke.",
    "The story has its clichéd and sentimental moments. It's no \"Raging Bull,\" more like \"Rocky\" shot with a handheld camera. But Rourke's wounded tough guy is undeniably captivating.",
    "The excesses are easy to forgive, both for the humour and charisma of Rourke's outsized performance and Aronofsky's canny low-key direction, which make for a combination that is irresistible.",
    "Whatever Aronofsky did -- or didn't -- do, Rourke's performance comes off beautifully. The Wrestler may not be the \"best\" Aronofsky movie in any technical sense. But the director clearly feels a great deal of tenderness toward his lead character.",
    "Bolstered by a career-best performance from Mickey Rourke and outstanding work by Marisa Tomei and Evan Rachel Wood.",
    "The Wrestler could have been a groundbreaking drama, one that upturns the sensational genre roots from which it stems. With Rourke in such form, it could have been character-driven to the core – if only Aronofsky trusted his character enough to resist screenwriter Siegel's contrived plot thrusts.",
    "Present in every scene, if not each shot, Rourke gives a tremendously physical performance that The Wrestler essentially exists to document.",
    "As good as Rourke is, and as willingly as he throws himself on the figurative hand grenade, his performance constantly begs the question of whether the story would be worth telling without him. Marisa Tomei, as Cassidy the pole dancer, delivers a courageous performance, one nearly as ego-battering as Rourke's.",
    "A heavy dose of corn syrup. Director Darren Aronofsky's herky-jerky, hand-held camera stylistics have a veneer of verity, but don't be fooled. This pastiche, written by Robert Siegel, is purest Hollywood.",
    "This movie has an aura of forced tragedy, like a fourth-generation version of \"Requiem for a Heavyweight.\"",
    "The movie isn't as world-shattering as those bouts: It's a regretful-old-warrior weeper.",
    "Rourke does strong, sensitive work here, which will cheer his old-time admirers and win him new fans...But the movie itself is pretty bad.",
    "The Wrestler doesn't add up. It's constructed with great care around a lead performance that is everything it could possibly be, but the picture itself is off-putting and disappointing."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Visionary writer/director Darren Aronofsky's follow-up to the confusing mess that was \"The Fountain\" is, on paper, a rather straightforward simplistic story of a broken down man trying to deal with the realities of his trade. But beyond Visionary writer/director Darren Aronofsky's follow-up to the confusing mess that was \"The Fountain\" is, on paper, a rather straightforward simplistic story of a broken down man trying to deal with the realities of his trade. But beyond the surface lies a film enriched with spirit and heartbreak. Mickey Rourke, (in what is sure to be an Oscar Nominated performance) takes on the role as the fictional 80's wrestler Randy \"The Ram\" Robinson who at one time was a big star and is now just a man far past his prime working indie circuits. A body bruised, broken and willing to take more damage. Mickey Rourke used to be a boxer and the damage he sustained to his face is put to full effect in the close-ups used to emphasize just how far one will go for the fans. Randy has lost all of what he has because of his chosen profession. He can't even pay to gain access to his trailer so on weekends he wrestles and weekdays he works at a grocery store. His family has left him and all he wants is the human connection that left. He treats the stripper he goes to (excellently portrayed by oscar winner Marisa Tomei) as if she's his best friend and the kids that live around him are the nephews that he plays Nintendo with, the ones he never had. But after Randy suffers from something that forces him to retire, he tries to make amends with people he hurt, fix the mistakes he made. That includes getting into contact with his daughter (another award making performance by Evan Rachel Wood) in what pushes this movie above what it is. These emotionally intimate scenes are what makes the movie more then about a simple Wrestler, more then just a man on a life's journey. The script by Robert Siegel could have easily been been turned into a Rocky Balboa rip off without the craftsmanship of Aronofsky. The scenes where the wrestlers are all casually discussing their plans for the ring that night are a humorous and informative touch. The seemingly strange combination of filming with a handheld camera, using panning and tracking techniques works, giving it a real and raw vibe which is almost documentary like. You are following this man's triumphs, his losses and his faults. You are watching a man's life unfold in front of you. He wrestles because the fans help heal the wounds, the gaps in his life, and because of that this movie is able to go above what others in the genre have failed to succeed at. Enough cannot be said about Mickey Rourke's powerhouse performance. Every step, every breath and every little nuance he portrays gives life to this character and the frailties he has. Rourke himself had similar dialogue to that of the film, stepping out of the acting spotlight for years to pursue a career in boxing. In more ways then one, this is his comeback just as much as it is Randy's. The Wrestler is a truly brilliant film that wouldn't of come to be without the cast and detail it has. Darren Aronofsky is used to making multi-shot sequenced films with quick edits ala \"Requiem For a Dream\". This sudden change of pace in both style and focus (his attention to detail with how real those \"fake\" wrestlers do their jobs is brilliant) only further his credence as one of the best directors this generation. He has captured something more then a movie, something that will move you because we can see a little bit of Randy in all us and connect with that on an emotional level. Whether it be not wanting to accept the name we're given or doing something for all the wrong reasons. We want him to succeed, to triumph, just like we want ourselves to. Likewise, Rourke and this film deserve success as well, if only because movies just aren't made like this anymore. Here's for a Best Actor and Best Picture Nod. Rating: A The Wrestler hits theaters on January 23'rd, I caught one of the limited release screenings. Written By: Kyle Bulai",
      "review_date": "2009-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The few flaws are dwarfed by veracity and intensity of emotion throughout the film. rourke's performance is gigantic, tomei's simply superb.",
      "review_date": "2009-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic performance by Mickey Rourke in a wonderfully understated film that does not go \"Hollywood.\" Marisa Tomei is perfect and the rest of the cast give an excellent backdrop to the story.",
      "review_date": "2009-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I highly recommend this film to anyone. The story is so heartbreaking and it's no surprise seeing how Rourke's performance was nothinig short of perfect. You would have to be dead inside not to pitty The Ram at the end of the movie.",
      "review_date": "2009-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely a masterpiece. Although I think many of us can \"see it coming\" throughout the film, the true art of this film is in the storytelling and the roller coaster of emotions. Mickey's acting is beyond an A+.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Marisa Tomei is FANTASTIC in the supporting role to Mickey Rourke's top effort of a lifetime! This movie will continue to stack up the awards in all categories and is destined to be a classic. Don't miss this one.",
      "review_date": "2009-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderful acting within the framework of a story that has holes. Micky Rourke and Marissa Tomei portray their characters supremely well, but the story is hampered by the areas that get glossed over....his daughter, the budding of his romance Wonderful acting within the framework of a story that has holes. Micky Rourke and Marissa Tomei portray their characters supremely well, but the story is hampered by the areas that get glossed over....his daughter, the budding of his romance with Pam, etc. I walked away with the feeling that this movie should have been an extra 20-30 minutes longer to cover the gaps. We're left to use our imagination to build obvious bridges over gaps left in the story. Considering the quality of acting and directing I'm positive that if some extra time had been taken it would have put this movie over the top. In the end it's a good flick, if a little short. The Aronovski style comes through and makes the film gripping and interesting.",
      "review_date": "2009-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was excellent all around- casting was superb, and even if you aren't a fan of professional wrestling, you'll cheer right alongside the fans around the ring. I don't know of any actor who is better suited for this This movie was excellent all around- casting was superb, and even if you aren't a fan of professional wrestling, you'll cheer right alongside the fans around the ring. I don't know of any actor who is better suited for this role, or who could pull it off as well as Mickey Rourke.",
      "review_date": "2009-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "John are you 10? The Wrestler is starts out as an in your face film about a professional wrestler and soon becomes a tale of survival and regret and friendship and just one man's imperfect life. It is very funny and very heartbreaking John are you 10? The Wrestler is starts out as an in your face film about a professional wrestler and soon becomes a tale of survival and regret and friendship and just one man's imperfect life. It is very funny and very heartbreaking and just fantastic. Still thinking about it hours later too.",
      "review_date": "2009-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superb heartfelt, touching performance by Mickey Rourke elevates the movie far beyond the sometimes cliche-ridden script. Excellent support from Marisa Tomei provides an additional reason to see it and an emotional scene with Evan Rachel Superb heartfelt, touching performance by Mickey Rourke elevates the movie far beyond the sometimes cliche-ridden script. Excellent support from Marisa Tomei provides an additional reason to see it and an emotional scene with Evan Rachel Wood also leaves a lasting impression. I hope that Rourke wins the Academy Award for his performance; he deserves it.",
      "review_date": "2009-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. Rourke sells as the old washed up wrestler who won't let a dream die while his star fades away. If there was more of the dialogue between Rourke and Tomei I think that I really would have loved it, but I wanted to see more Great movie. Rourke sells as the old washed up wrestler who won't let a dream die while his star fades away. If there was more of the dialogue between Rourke and Tomei I think that I really would have loved it, but I wanted to see more of the fire that drives these two individuals. May we all go out doing what we love.",
      "review_date": "2009-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good, but not great, film. Ty Burr (Boston Globe) sums up the lead performance nicely: \"This performance has a gentleness - an almost Zen-like acceptance of collapsed expectations - that comes close to breaking your heart.\" It's A good, but not great, film. Ty Burr (Boston Globe) sums up the lead performance nicely: \"This performance has a gentleness - an almost Zen-like acceptance of collapsed expectations - that comes close to breaking your heart.\" It's basically a character study, and also a cautionary tale, about clinging to your dreams and self-image long past their expiration dates. Rourke does give an amazing performance, and the ending -- although pretty cliche'd -- definitely touches your heart.",
      "review_date": "2009-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are many wonderful things about this movie --- not least the heroic performance by Mickey Rourke and the subtler but no less brilliant turn by Marisa Tomei. The photography is also stunning -- stunningly bleak. But there are some There are many wonderful things about this movie --- not least the heroic performance by Mickey Rourke and the subtler but no less brilliant turn by Marisa Tomei. The photography is also stunning -- stunningly bleak. But there are some weaknesses that keep the movie from achieving Raging Bull-like greatness, and they are mostly contained in the script. There are some truly terrible lines -- and it is a sign of great acting that the awfulness of them only becomes plain after you run them back in your head, shorn of the performances that give them cover. The subplot with the daughter is psychologically implausible. Still, this is in my view the best American movie of the year, fearless in ways that Frost/Nixon, Milk and their ilk can only dream of. Only Demme's Rachel Getting Married and Reichardt's Wendy and Lucy come close to.",
      "review_date": "2008-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have/had ZERO interest in wrestling, but I saw this movie when it first came out (perhaps 2 weeks ago?), and I still can't get it out of my mind. I feel so satisfied getting to see a slice of life film that didn't spoon feed me I have/had ZERO interest in wrestling, but I saw this movie when it first came out (perhaps 2 weeks ago?), and I still can't get it out of my mind. I feel so satisfied getting to see a slice of life film that didn't spoon feed me sugar bombs of \"positivity\", \"everything works out\", and \"we're in love, let's dance into the sunset.\". Even on life's best, funnest and most easy-going days, it's more complicated than that... It is often brutal. Often messy. Really great performances...especially delivered by Mickey Rourke. Multi-dimensional, touching, heart-breaking, funny. Really great film. If you have reservations about seeing a film \"about wrestling\" you need ant worry. Wrestling is only an aspect to the film. It's about much more than that.",
      "review_date": "2009-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really outstanding movie. Rourke and Marisa T. were superbly cast for this. You'll remember its sweetness long after it is over.",
      "review_date": "2009-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good film. Actually stirs thought and emotion, unlike the over-hyped Slumdog Millionaire. Great performances by Rourke and Tomei. Wood's performance is the only glaring weakspot, but Aronofsky wisely gave her limited screentime.",
      "review_date": "2009-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke gives a performance so well that the entire movie comes together beautifully behind him. Aronofsky captures Rocky's physical and emotional pain perfectly, that you end up feeling his pain throughout his journey.",
      "review_date": "2013-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is how you tell a tale.",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Wrestler is one of those rare, perfect films. It excels on every level of film making, and tells the haunting story of a man faced with his own mortality, and the conflict between the world inside and outside of the ring. Mickey RourkeThe Wrestler is one of those rare, perfect films. It excels on every level of film making, and tells the haunting story of a man faced with his own mortality, and the conflict between the world inside and outside of the ring. Mickey Rourke gives a career defining performance, and his costars are all equal to the task. The writing is breath taking, and the beautifully executed tracking shots completely put the audience in the emotional states of the characters. The Wrestler is a must-see movie.",
      "review_date": "2016-06-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A well directed film by Daren Afronsky, Micky Rourke and Marisa Tomei are more than able to bring their respective characters and all of their flaws to life in a realistic and engaging manner.. At times capable of bringing a tear to the eyeA well directed film by Daren Afronsky, Micky Rourke and Marisa Tomei are more than able to bring their respective characters and all of their flaws to life in a realistic and engaging manner.. At times capable of bringing a tear to the eye and at others capable of turning stomachs, the Wrestler nonetheless enchants throughout its entirety telling a story that all are capable of sympathizing with.",
      "review_date": "2011-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Lacked character developement.downright too cheesy of beginning. I know it's what it is...butttt.. still too much so. a few good/fair moments. i just couldn't recommend this to anyone other than to see if they agreed with me.",
      "review_date": "2009-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A predictable, linear and egregiously artificial film. Commercial drivel hidden with an artsy veneer. The characters lack depth and the narrative is missing an arch. Shockingly bad, unless you enjoy two hours of constant masochism and A predictable, linear and egregiously artificial film. Commercial drivel hidden with an artsy veneer. The characters lack depth and the narrative is missing an arch. Shockingly bad, unless you enjoy two hours of constant masochism and bulimic misery for the sake of it.",
      "review_date": "2009-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really want to give it a 0. I also really want to write in all caps. This movie is seriously, seriously terrible. Yes, Mickey Rourke is good, but the script is cliche drivel, and the directing... oy. and for gods sake, Darren, get yourself I really want to give it a 0. I also really want to write in all caps. This movie is seriously, seriously terrible. Yes, Mickey Rourke is good, but the script is cliche drivel, and the directing... oy. and for gods sake, Darren, get yourself a steadicam. It's not indie if we all get motion sickness.",
      "review_date": "2009-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great performance by Mickey Rourke, although the role didn't seem much of a stretch. The overall movie, however, was initially disappointing. But the movie has stayed with me, and I keep on thinking about it. The same way that Anchorman Great performance by Mickey Rourke, although the role didn't seem much of a stretch. The overall movie, however, was initially disappointing. But the movie has stayed with me, and I keep on thinking about it. The same way that Anchorman is not that funny the first time you watch, but becomes funnier the more times you quote it in a group of friends, this movie gets better after it has had some time to sit with you.",
      "review_date": "2009-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You will have heard a lot in the media about his comeback role as Randy",
      "review_date": "2009-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The wrestler is the most overrated film of the year.I think the film is bored and I don't like the Rourke's performance.I think Rouke's performance in The Wrestler is worst than Eastwood's performace in Gran torino,JoshThe wrestler is the most overrated film of the year.I think the film is bored and I don't like the Rourke's performance.I think Rouke's performance in The Wrestler is worst than Eastwood's performace in Gran torino,Josh Brolin's performance in Milk,Frank Langella's performance in Frost/Nixon , Richard Jenkins' performance in the visitor or Benicio del Toro's performance in Che.",
      "review_date": "2008-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The direction and filming were fine. Acting marginal i.e. there wasn't much of it. Basically a story about a bunch of losers. Not sure what the point was. Perhaps it appeals to ignorant white trash America, which is sad. I walked out of The direction and filming were fine. Acting marginal i.e. there wasn't much of it. Basically a story about a bunch of losers. Not sure what the point was. Perhaps it appeals to ignorant white trash America, which is sad. I walked out of the film 45 minutes into it. Don't waste your time.",
      "review_date": "2009-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Despite terrific performances from Rourke and Tomei, Aronofsky can't keep from sinking them with mawkish sentimentality and clunky dialogue that gets worse and worse. Watching the film slowly but surely implode into cliche is almost as Despite terrific performances from Rourke and Tomei, Aronofsky can't keep from sinking them with mawkish sentimentality and clunky dialogue that gets worse and worse. Watching the film slowly but surely implode into cliche is almost as painful as getting clotheslined by a professional wrestler.",
      "review_date": "2009-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most horrible films that I have ever seen.",
      "review_date": "2009-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The wrestler took 111 minutes just to tell you that the main guy is a washed up wrestler who can't make anything of his life and will die in the ring. Good movies need to have a balance of character development and plot. Mickie Rourke The wrestler took 111 minutes just to tell you that the main guy is a washed up wrestler who can't make anything of his life and will die in the ring. Good movies need to have a balance of character development and plot. Mickie Rourke gave an overrated performance. The movie was too one dimensional and lacked real substance.",
      "review_date": "2009-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The wrestler is one of the worst films of all times:Bored,bad performances.The best of the wrestler is the poster.",
      "review_date": "2008-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a typical Hollywood movie posing as an indie. Great performance by Rourke but the movie is 30 minutes too long. Wood's character only provided a tear jerk scene that really wasn't needed. The wrestling characters were the This is a typical Hollywood movie posing as an indie. Great performance by Rourke but the movie is 30 minutes too long. Wood's character only provided a tear jerk scene that really wasn't needed. The wrestling characters were the most interesting. Could have been better.",
      "review_date": "2009-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Impeccable casting, sheer authenticity, candid deliveries, and heart rending emotion drive \"The Wrestler\" to an unprecedented level, transcending anything of the hackneyed \"rags to riches to rags\" genre. The experiences seen through theImpeccable casting, sheer authenticity, candid deliveries, and heart rending emotion drive \"The Wrestler\" to an unprecedented level, transcending anything of the hackneyed \"rags to riches to rags\" genre. The experiences seen through the beaten and battered Rourke hits home and sticks with you like the cohesive wrap which covers his wounds. If your the fantastical type, salivating from the mouth, anticipating a knockout of Ivan Drago, \"The Wrestler\" is too real for your liking.",
      "review_date": "2011-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The wrestler is an amazing film that features great acting, Mickey Rourke is an amazing lead. The film does get a little boring at times and it seems to recycle itself a bit through out as well. Still a good film though.",
      "review_date": "2011-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even with all of its gritty and melancholy realism, The Wrestler feels a little too safe. The story is a standard character-driven narrative which rarely moves away from the staples of what makes drama. It includes such well-worn themes asEven with all of its gritty and melancholy realism, The Wrestler feels a little too safe. The story is a standard character-driven narrative which rarely moves away from the staples of what makes drama. It includes such well-worn themes as issues with family, work, and poverty; coping with the present and letting go of the past, and coming to terms with mortality and the fragility of life; nothing that hasn't been done before. This may be exactly what Aronofsky wanted to achieve with his bleak vision of reality; but it's just too slow-paced to be top-quality entertainment, and too basic to be top-quality art. However, a perfect performance from Rourke ensures it isn't lost to mediocrity. Worth a watch, but don't expect layers of complexity -- the film is as superficial as it is sincere.",
      "review_date": "2012-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought that there was more backstory to be told, but they left it all out. Rourke was amazing, Tomei was nude, and Wood was under-utilized.",
      "review_date": "2009-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beyond the Mat rip off redeemed by some good acting.",
      "review_date": "2009-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes, it's Mickey Rourke's best performance of his career and one that could beat out Sean Penn for the Oscar, but why is everyone so surprized? When I first heard that Darren Aronofsky was making a film with Rourke about a Yes, it's Mickey Rourke's best performance of his career and one that could beat out Sean Penn for the Oscar, but why is everyone so surprized? When I first heard that Darren Aronofsky was making a film with Rourke about a washed-up wrestler I knew then that we were in for another great film. I'll give praise where the praise is due - to Darren Aronofsky. He should have been nominated for Requiem For a Dream and nobody even noticed The Fountain, but I did and I can't wait for whatever he does next! A Standing Ovation to the real genius behind The Wrestler- Darren Aronofsky!!",
      "review_date": "2009-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hated it. Seriously, Aranofsky just knows how to make me feel terrible and I hate his movies because of how skillfully he does this. It would be a treat for sure if he took all of his considerable skills and made a \"happy\" film. Perhaps I hated it. Seriously, Aranofsky just knows how to make me feel terrible and I hate his movies because of how skillfully he does this. It would be a treat for sure if he took all of his considerable skills and made a \"happy\" film. Perhaps show some range!",
      "review_date": "2009-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I almost didn't bother with this one. A) Not a Rourke fan. B) Not a wrestling fan. But, I gave it a shot...and boy was I mesmerized. I completely forgot it was Rourke. He was amazing. I believed it all. MUST see.",
      "review_date": "2009-04-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is utterly the most, gut wrenching, break-out-into-tears, amazing films I have ever had the pleasure of seeing. To date, one of the best movies ever made.",
      "review_date": "2009-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you want to know what wrestling is really like watch this film. Very accurate.",
      "review_date": "2008-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dead-solid perfect.",
      "review_date": "2008-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Far and away the best movie I've seen this year. I really hope that it receives a big push and manages to crawl up into mainstream movie houses. Despite its grittiness I think this movie could speak to a very wide audience, especially Far and away the best movie I've seen this year. I really hope that it receives a big push and manages to crawl up into mainstream movie houses. Despite its grittiness I think this movie could speak to a very wide audience, especially profoundly to men.",
      "review_date": "2009-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a powerful movie. I have much more respect now towards the sport of wrestling, and the wrestlers themselves. How dare anyone give this movie below 3/5 stars, if they do, look at their reasoning, it is weak just like the review itself. What a powerful movie. I have much more respect now towards the sport of wrestling, and the wrestlers themselves. How dare anyone give this movie below 3/5 stars, if they do, look at their reasoning, it is weak just like the review itself. Don't hate on the movie because you don't like the director, or other such nonsense. Great film, great story, great acting, will move you!!!!",
      "review_date": "2009-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Huge Aronofsky fan here. Requiem FAD was an experience, and I will never forget how it affected me and those who were in the theater. No other film I have seen has had such an effect. I will see any film Aronofsky does. Mickey R. is Huge Aronofsky fan here. Requiem FAD was an experience, and I will never forget how it affected me and those who were in the theater. No other film I have seen has had such an effect. I will see any film Aronofsky does. Mickey R. is fantastic in this film. It is one of the most authentic and realistic dramas I have seen in years. The scene where the kid tells Ram about Call of Duty 4 was amazing to me for some reason. But, this film is more about Mickey R. than about the Ram-his character. This adds to the film yet detracts from it. If you like Aronofsky, see this film. If you like Mickey R. see this film. Very very good, and this made me care a lot more about Mickey's career. Not great, but worthy.",
      "review_date": "2009-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke is outstanding, he completely immerses himself in the role. Great film.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A powerful film with a richly developed main character, very ably performed by Mickey Rourke. The screenplay is quite good, but it is a little slow moving at times. Realistically and believable made, appropriate gritty cinematography.",
      "review_date": "2009-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film - still thinking about it the next day.",
      "review_date": "2009-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The year's best film, Mickey Rourke will make you feel so many things as you follow him throughout his days and nights - he is simply amazing - and what does he radiate? Kindness.",
      "review_date": "2009-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unreal, emotional, introspective, beautiful.",
      "review_date": "2009-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unrelenting and dark, but true in story and character.",
      "review_date": "2009-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ummmm, can someone explain why Sean Penn won the oscar for that dumb movie Milk? This is some of the best acting I've ever seen in a movie. 3/4 of the way through I started hoping/praying they weren't going to kill him off.",
      "review_date": "2009-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good, but as good as everyone says. I loved the movie, but I had a problem with the editing, which felt a little more like a documentary style, and the ending, which I had mixed feelings about but didn't hate. Other than that, IVery good, but as good as everyone says. I loved the movie, but I had a problem with the editing, which felt a little more like a documentary style, and the ending, which I had mixed feelings about but didn't hate. Other than that, I loved it. Absolutely loved it.",
      "review_date": "2009-06-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very good movie. The camera work on this film, makes it look like a documentary. Very real. maybe too real?",
      "review_date": "2009-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic Performance by Rourke. This sad, and slightly predictable, story is touching and moving for those who have ever felt useless in their life. When you can step back and ask yourself, \"Why am i here? What am I worth?\" then this movie Fantastic Performance by Rourke. This sad, and slightly predictable, story is touching and moving for those who have ever felt useless in their life. When you can step back and ask yourself, \"Why am i here? What am I worth?\" then this movie is for you.",
      "review_date": "2008-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie, even if you dont like wrestling. Kinda sad but the strippers make up for that.",
      "review_date": "2008-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Let me say that I have been a wrestling fan all my life, and I started watching the early 80s. I heard about all the hype and I went to see it tonight. I gave it 10 because it was so well done. However, it didn't touch me the way it Let me say that I have been a wrestling fan all my life, and I started watching the early 80s. I heard about all the hype and I went to see it tonight. I gave it 10 because it was so well done. However, it didn't touch me the way it would for a non-wrestling fan because none of this was a surprise to me. I never experienced it, but I've read about this story a 1000 times over in the business. I wasn't particularly touched the way an average movie goer might be but more sad and depressed. It makes me think of just how crummy the business realy is.",
      "review_date": "2009-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "honestly one of the best non-comedy movies i've seen in a long time. i just wish there was a theater near me playing this movie so i could show my respect and actually buy a ticket.",
      "review_date": "2009-01-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anti-hollywood in every sense; i believe its going to become a cult classic in due time. The directing, performances, script, writing, scenery, everything was on point. For once I wasnt angry at the open ending it had; it left the rest up to Anti-hollywood in every sense; i believe its going to become a cult classic in due time. The directing, performances, script, writing, scenery, everything was on point. For once I wasnt angry at the open ending it had; it left the rest up to imagination which is exactly why it was so strong and moving.",
      "review_date": "2009-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "[***WARNING SPOILERS ***] The wrestler was a sad and often painful movie to watch about an aging wrestler whose glory days were fading behind him. Though definitely struggling with vanity at the costs of his body and family relations Randy [***WARNING SPOILERS ***] The wrestler was a sad and often painful movie to watch about an aging wrestler whose glory days were fading behind him. Though definitely struggling with vanity at the costs of his body and family relations Randy definitely shows the viewer a much more human side that cares for children as well as an aging stripper who he identifies with and makes a bid for closeness. It seems Randy has made many mistakes in his life and his efforts to restore relations with his daughter and create a relationship with Pam fall short. Too much damage has happen with his daughter and ultimately Randy finds his only solace is in the ring. His colleges love him and his fans still treat him as legend though his is poor, lonely, and falling apart physically. I did not judge Randy in the end. He seemed a good person trying his best in a world less than perfect. Yes, he had his faults but not caring wasn't one of them. You get a sense some of his virtues were more new found as he faced the very real possibility of his death and or disablement. I was really impressed by Micky Rourke's acting. I really felt he stole the show. The others did just fine but Micky really shined. He conveyed a real loneliness, sadness, and introspection, as well as a spirit that just would not quit for his one passion in which he felt alive. I also found this somewhat of a cautionary tail. That all of us must one day face not only our own immortality but also that of frailty as well continue through life. When young we often live off that spirit acting like we can go it alone..... But in time we realize our human limits and need for community and family. As someone getting older himself this really spoke to me and I could identify with some of his plights. Overall this movie was really well done. A total surprise from an actor that hasn't been seen in a while. The Wrestler is not a feel good movie but it will keep your attention and if nothing more will evoke within you to think a little deeper about what someday we all must eventually face.",
      "review_date": "2009-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Extraordinary performance my Micky Rourke. could turn out to be a cult film. still thinking about it hours later.",
      "review_date": "2008-12-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't know what crack you all are smoking, but O'Rourke has always done well. He's ugly and he's bad. That's the way it's always been. Not a Hellywood pretty boy but a performer. Playing the tough parts has I don't know what crack you all are smoking, but O'Rourke has always done well. He's ugly and he's bad. That's the way it's always been. Not a Hellywood pretty boy but a performer. Playing the tough parts has always been his style. WTF. Is everyone beating off to Tom Cruise?",
      "review_date": "2008-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "John, what movie were you watching? This is a terrific performance by an actor whose career has been studded with ups & downs. This is his pinacle.",
      "review_date": "2008-12-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After being an ardent watcher of wrestling for many years I was presently suprised when 'The Wrestler' came out to see it delievered a fairly accurate representation of what many say about the wrestling business. Rourke rises from the boxAfter being an ardent watcher of wrestling for many years I was presently suprised when 'The Wrestler' came out to see it delievered a fairly accurate representation of what many say about the wrestling business. Rourke rises from the box office ashes to produce a rounded performance with wrestling moves and all. This film and the death of many real life wrestlers led me to realise I could no longer watch an industry that put such personal and physical strain on it's employees. It's powerful and poignant and body slams your emotions, again, again and again...",
      "review_date": "2010-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An already well-trodden story line is given a new lease of life thanks to some top performances - I never realised that Rourke could be this good. And what a top ending!",
      "review_date": "2012-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There seems to have been a lot that was skipped in the life of a wrestler but this covered more than enough and exposed the many myths against wrestling and wrestlers. In also explains their chaotic lives in terms of how wrestling affectsThere seems to have been a lot that was skipped in the life of a wrestler but this covered more than enough and exposed the many myths against wrestling and wrestlers. In also explains their chaotic lives in terms of how wrestling affects them. Memorable moments include the self slicing for blood (myth holds that its fake blood); constant travel means severed relationships of families and more closer to a group amongst wrestlers as family; and ofcourse the nature of taking steroids (health abuse) just to entertain since it becomes addictive. I was a wrestling fan as a child - not having watched it for about 8years now this was a refresher for me. Well done movie - felt like a documentary of a real wrestler rather than a movie.",
      "review_date": "2011-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's official. I just don't get Hollywood.Tonight I watched Mickey Rourke's highly-touted comeback (although I consider his perfect performance as Marv in Sin City as a more appropriate example of his comeback) in The Wrestler. While hisIt's official. I just don't get Hollywood.Tonight I watched Mickey Rourke's highly-touted comeback (although I consider his perfect performance as Marv in Sin City as a more appropriate example of his comeback) in The Wrestler. While his performance is phenomenal, Sean Penn deserved the Oscar. I'm glad I saw both performances and feel good that the best man won.In any case, The Wrestler itself is an interesting case study in the whole Hollywood scene.Saturated with near-flawless performances from underrated actors, and filmed in a superb, gritty, honest and raw manner, The Wrestler had the makings of another Raging Bull. Where it lost its way, however, is in the script and, in some way, the directing.Don't get me wrong. The Wrestler is a good movie. And I would rather watch it a hundred times than endure Benjamin Button again. However, it has some very basic flaws that, amazingly, have gone nearly unnoticed in most reviews I've read. Luckily there are a few out there who saw the same movie I did, but it begs the question of how in the world do seasoned film critics miss the basics? How can someone give this movie 4 stars when it breaks the simplest of film making rules??For the first hour of this nearly two-hour film is perfect. Shot in a documentary style, with very little scripted dialogue, what the viewer is exposed to is the seedy underbelly of the wrestling world. What a miserable existence is portrayed. Emotionally, the viewer IMMEDIATELY connects with what the people/characters are doing, why they do it, etc. It's sad. It's pathetic. It's depressing as hell.Then, the main character, Randy \"The Ram\" Robinson, has a heart attack, which requires a bypass and immediate retirement. Understandably, Randy's miserable existence as a washed up wrestler, compounded by this sudden health problem, which only exacerbates his miserable existence, would lead to introspection and making amends for any wrongdoing in his life.But here is where the movie loses me.I've been sucked in. I'm THERE. I am completely following, understanding and sympathizing with Randy. I'm even following why he would want to make amends. I'm even there when he initially approaches a long-lost daughter, who is not mentioned at all until his heart attack. And then suddenly a movie that is all about developing the emotional connection between the audience and the characters through exposure to reality, suddenly turns into a movie with a lot of sappy dialogue that heavily forces the viewer to shift from a reality-based understanding, to a manufactured one. One that is clearly script-driven and over-Hollywood, when much of the dialogue up until now has almost been banter-like and ad-libbed. Very natural to almost unnatural.Like Benjamin Button, it's these forced mechanics that drive me, as a viewer INSANE.The movie still has very incredible moments throughout the rest of the film, mostly performance-driven. At no point can I say that Mickey and Marisa are not good in this film. They are amazing. It's just that the script lingers far too close to Leaving Las Vegas and Rocky to feel too good about the power of this story.",
      "review_date": "2010-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this was a great movie. it really moved me and touched my heart, and Mickey Rourke did an amazingly beautiful job and he gave us a bravura performance. i'm not a fan of wrestling but the movie kept my interest from start to finish. 9+",
      "review_date": "2011-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a drama about an aging professional wrestler (Mickey Rourke), decades past his prime, who now barely gets by working small wrestling shows in VFW halls and as a part-time grocery store employee. As he faces health problems that mayThis is a drama about an aging professional wrestler (Mickey Rourke), decades past his prime, who now barely gets by working small wrestling shows in VFW halls and as a part-time grocery store employee. As he faces health problems that may end his wrestling career for good he attempts to come to terms with his life outside the ring: by working full time at the grocery store, trying to reconcile with the daughter (Evan Rachel Wood) he abandoned in childhood and forming a closer bond with a stripper (Marisa Tomei) he has romantic feelings for. He struggles with his new life and an offer of a high-profile rematch with his 1980s arch-nemesis, The Ayatollah, which may be his ticket back to stardom.\r Mickey Rourke is always tough, always violent so you can't really expect him to deliver good emotional dialogue. But Rourke said his lines with great emotions and also a sense of toughness underneath. His award-winning performance will be a mark in his long career. Marisa Tomei isn't to be left out either. Playing mom stripper who is attached to this washed-up wresler is probably one of the best thing she done. Looking good yet emotionally strong, Tomei is absolutely perfect for the role. Darren Aronofsky was snubbed from the director race. But the wrestling matches looked stylish and so believable that I think he should've gotten a nod. The Wrestler is a uplifting drama that has a thin premise, but it was built by a great cast and amazing cinematography",
      "review_date": "2010-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Wrestler is an excellent character study with a dynamite central performance from Mickey Rourke. It obviously takes a lot of influence from the famed documentary Beyond the Mat; Randy 'The Ram' Robinson is pretty much a dead-on xerox ofThe Wrestler is an excellent character study with a dynamite central performance from Mickey Rourke. It obviously takes a lot of influence from the famed documentary Beyond the Mat; Randy 'The Ram' Robinson is pretty much a dead-on xerox of Jake 'The Snake' Roberts, broken daughter relationship and all. That said, Beyond the Mat was fantastic and so is The Wrestler.",
      "review_date": "2013-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What Darren Aronofsky does here is let us take a peek into the loneliness and all to crappy life of a washed up wrestler who not even feeling anything in his life anymore tries to get the things that he was to selfish to keep. Weather this isWhat Darren Aronofsky does here is let us take a peek into the loneliness and all to crappy life of a washed up wrestler who not even feeling anything in his life anymore tries to get the things that he was to selfish to keep. Weather this is his trying to form a bond with a stripper or his daughter. It also gives us a slight glimpse into the world of wrestling something which is done fantastically. Rourke is back and better than ever as someone who is all to familiar.",
      "review_date": "2011-05-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A well acted, well shot and refreshingly different film which is unfortunately too predictable, too slowly paced and too deviod of really exciting or intense moments to be worth more than one watch. By all means give it a go, but don't buyA well acted, well shot and refreshingly different film which is unfortunately too predictable, too slowly paced and too deviod of really exciting or intense moments to be worth more than one watch. By all means give it a go, but don't buy into the hype that it's something spectacular. When the end credits role it doesn't feel as if anything ever really got going, and the conflicts, predicaments and dilemas in the movie are pretty weak. Fans of wrestling may get a bit more out of it, but to people like me it's just an OK movie.",
      "review_date": "2012-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love this movie.  It's raw, it's funny, it's believable.  The performances are perfect.It's a bit predictable, I suppose, but it doesn't matter.  This is a classic story about aging and trying to recapture the faded glory from the past.",
      "review_date": "2022-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In what may as well have been a dramatised version of his life, Mickey Rourke puts in a career-defining (and comeback) performance as a warm hearted yet broken down and aged wrestler going by the alias of Randy 'The Ram' Robinson, now workingIn what may as well have been a dramatised version of his life, Mickey Rourke puts in a career-defining (and comeback) performance as a warm hearted yet broken down and aged wrestler going by the alias of Randy 'The Ram' Robinson, now working part-time in a supermarket deli counter. A particular moment, when Randy is walking from the warehouse to the store, is truly brilliant, Aronofsky attempts to recreate a wrestlers walk towards the entrance ramp, and thus Randy slowly makes his way there, with the chants and screams of fans in his hand, epic.\rWe see a wonderfully constructed opening montage of various magazine and paper covers and cutouts from the 80s showing the hey day of The Ram, all leading up to the present day.\rRourke has embraced the character will a full steam ahead attitude, flowing bleached blond hair, fake tan and a physique resembling that of an older and battle-heardened wrestler, the fitness is there, but the age shows.\rIts a simple film redefining the message of forgiveness and redemption mixed into a excellent tale of drugs, sex and wrestling. Rourke brilliantly portrays his emotion through his famous skill of method acting (check out his clip from The Expendables) and through the masterful direction of Darren Aronofsky.\rIn this film, its the little thing that make the most difference to the story being told. Rourke wears a jacket in the film held together by duct tape, this already shows perhaps his financial difficulty, or his hesitation to  move on from the past. While not quite as hostile as Jake 'the snake' Roberts, Rourkes character could have very well been based on him.\rThe dialogue is simple yet heartfelt, with an Oscar-worthy performance from Marisa Tomei, who is Randy's long time friend who has a full-time job as a stripper.\rWhen Randy has a health scare after a match (and a brutal one at that), he begins, perhaps too little too late, about chaging his career for good\rIt simply falls into place, there may be some scenes hard to watch for many, there is humour in many aspects, but it is Rourke who has defined this movie as a standout masterpiece, beautiful filmmaking, wonderful acting but most importantly, a heart-wrenching story of despair, bravery, stupidity and love, see this as soon as possible.",
      "review_date": "2013-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a pretty good drama movie and Mickey Rourke does an amazing job as the lead. It's a very likeable movie and I would definently recommend watching it.",
      "review_date": "2013-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While the movie feels like an attempt to rejuvenate Mickey Rourke's career, the story is authentic and the performances are believable because they are outstanding.",
      "review_date": "2013-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why did I watch it?\rRecorded this one a while ago as well, following its high praise on release. Oh and I used to like wrestling.\r\r\nWhat's it all about?\r\nMickey Rourke is Randy 'The Ram' Robinson, an American wrestler popular in the lateWhy did I watch it?\rRecorded this one a while ago as well, following its high praise on release. Oh and I used to like wrestling.\r What's it all about?\rMickey Rourke is Randy 'The Ram' Robinson, an American wrestler popular in the late 80's, desperately clinging to his days of glory in the present day and scraping a living in doing so. Robinson puts his tired and worn body through the ringer against younger athletes in local independent matches  fought in front of small crowds. As he struggles to pay his rent, he manages to save funds for dances from his favourite dancer Marisa Tomei at his local strip joint and makes efforts to reconcile with his estranged daughter.\r Should you watch it?\rThe Wrestler is a brilliant character piece from director Darren Aronofsky. Rourke is fantastic as the battered and troubled veteran unable to call time on his career. His Oscar nomination was fully deserved and on the back of that performance I feel sorry he didn't come out as winner (note - I haven't seen Sean Penn in Milk). Marisa Tomei is also brilliant as the similarly troubled stripper Robinson finds solace with. Randy 'The Ram 'Robinson\rThe film is similar to Aronofsky's follow-up Black Swan, both being deep character studies of troubled leads. The film is heavy in shots from behind Rourke as he walks down corridors towards the ring or towards the deli counter at work and as well resembling the coverage of a boxer or rock band approaching the arena it gives the film the feeling of a documentary. You can almost imagine Louis Theroux providing some narration. Robinson's longing for the good times is complimented by the 80's guitar heavy score (Slash played the guitar for the score).\r The Wrestler  is the emotional ride of veteran who doesn't know how live for anything else and ultimately the ending doesn't matter as he climbs the turn-buckle for his 'finisher' as he has found peace back in the ring again.",
      "review_date": "2012-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am not even a wrestling fan, but I loved this. It is truly more than your average sports film, thanks to the brilliant performance by Mickey Rourke as the aging wrestler Randy \"The Ram\" Robinson. He truly embodies his character, possiblyI am not even a wrestling fan, but I loved this. It is truly more than your average sports film, thanks to the brilliant performance by Mickey Rourke as the aging wrestler Randy \"The Ram\" Robinson. He truly embodies his character, possibly because his career so closely resembles it, since he used to be huge and then fell off the map for a while. However, here, he firmly cements his place in history with a phenomenal acting performance. Marisa Tomei is also great here (she makes a great stripper, as expected) and Evan Rachel Wood does a great job as Rourke's daughter. The direction from Darren Aronofsky is also characteristically strong. While I personally prefer \"The Fountain\" and \"Black Swan\", \"The Wrestler\" is a fantastic addition to his filmography. The film is touching, triumphant, and moving, in all the best ways and will have you standing up and cheering by the end. The soundtrack is also great here with all the tracks from the 80's being a clear throwback to the days when \"The Ram\" reigned supreme. The cinematography is great and whole look and feel work really well here. Overall, The Wrestler is a film that succeeds in really every way imaginable thanks to the dynamite pairing of Aronofsky and Rourke.",
      "review_date": "2014-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Aronofsky-style movie about loneliness, despair, regrets and it is great, it's not that pressing as Requiem For A Dream but still it's pretty depressive as all other Aronofsky movies. It leaves you heavy hearted. Mickey Rourke made anAronofsky-style movie about loneliness, despair, regrets and it is great, it's not that pressing as Requiem For A Dream but still it's pretty depressive as all other Aronofsky movies. It leaves you heavy hearted. Mickey Rourke made an outstanding performance.",
      "review_date": "2014-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The stellar performances make up for a cliched plot and a weak script.",
      "review_date": "2012-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a sad, sad film. Mickey Rourke delivers once in a lifetime performance. I liked how the focus did not stray from the main character. There were no bad guys and no pressure to perform against some hunk for glory, instead it stuck with theIt's a sad, sad film. Mickey Rourke delivers once in a lifetime performance. I liked how the focus did not stray from the main character. There were no bad guys and no pressure to perform against some hunk for glory, instead it stuck with the main character faithfully and did him true justice. I was introduced to the dark side of wrestling with a hammer to the head. This guy deserves some recognition for his efforts.",
      "review_date": "2013-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Wrestler is an excellent film. One of the most depressing, yet utterly real dramas I have ever seen. Mickey Rourke gives an incredible performance as Randy \"The Ram\" Robinson. He is worthy of every praise he received and i'm so thrilledThe Wrestler is an excellent film. One of the most depressing, yet utterly real dramas I have ever seen. Mickey Rourke gives an incredible performance as Randy \"The Ram\" Robinson. He is worthy of every praise he received and i'm so thrilled he was able to come away with at least an Oscar nomination. Alongside Rourke is Marisa Tomei as the aging stripper, and Evan Rachel. Both give terrific supporting performances. The cinematography is top notch, brilliantly capturing the depressing tone of the film. A memorable film by Darren Aronofsky!",
      "review_date": "2013-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke plays convincing role as over-the-hill professional wrestler who is clinging on to his past. One of the best sport dramas around, although the main character owes some credit to the documentary film \"Beyond the Mat\".",
      "review_date": "2013-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An outstanding performance by Mickey Rourke who, I think, should have got that Oscar. The actual wrestling only tells half the story. Outside of the arena, I believe, is where The Wrestler is most strong. Here is where we experience theAn outstanding performance by Mickey Rourke who, I think, should have got that Oscar. The actual wrestling only tells half the story. Outside of the arena, I believe, is where The Wrestler is most strong. Here is where we experience the heartbreaking story of this highly acclaimed wrestler and really goes on in his life. A big thumbs up to this movie!",
      "review_date": "2013-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Wrestler is emphatic: Main character is immersive as a few others. Its development as inside as outside is admirable.",
      "review_date": "2019-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Instant Classic, and it is a must see for any wrestling fan, but it is still excellent even if you don't watch wrestling. The story was amazing and Mickey Rourke played the part amazingly. Pure excellence.",
      "review_date": "2014-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An interesting peak behind the curtain into world of professional wrestling. Mickie Rourke stars as a grizzled, down on his luck veteran on the downside of a once glorious career. Marisa Tomie is also absolutely stunning in this heavy hitting drama.",
      "review_date": "2019-04-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The usually astonishing Darren Aronofsky gives us another great film, Mickey Rourke puts on an heartbreaking performance as an washed up wrestler, Marisa Tomei is at her best since \"In The Bedroom\"",
      "review_date": "2014-05-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke is at his best ever in this movie. A pretty creative story in this one. Its very believable and it seems like its all unfolding before your eyes and its all real. Its almost like a documentary. Mickey Rourke just sticks to whatMickey Rourke is at his best ever in this movie. A pretty creative story in this one. Its very believable and it seems like its all unfolding before your eyes and its all real. Its almost like a documentary. Mickey Rourke just sticks to what he knows after years of boxing. One of the best movies I've ever watched.",
      "review_date": "2014-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story and acting all around in this movie. The Wrestler gives viewers a real glimpse into the lives of wrestlers . One of the better films out there",
      "review_date": "2016-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke back from the ashes in the tights of the gladiator, in his own twilight, trying to fixing his outside world who can't manage, over all because he is a deadbeat father. Get in the ring right now.",
      "review_date": "2019-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once again, the American director Darren Aronofsky pays off with yet another fantastic movie. This time, the feature tells the story of a \"near to retirement\" wrestler (Mickey Rourke) who fights to get a decent life outside of the wrestlingOnce again, the American director Darren Aronofsky pays off with yet another fantastic movie. This time, the feature tells the story of a \"near to retirement\" wrestler (Mickey Rourke) who fights to get a decent life outside of the wrestling business due to heart problems. Both the atmosphere of the film and the story itself make this movie seem extremely realistic and sensible; this actually makes the viewer realize all the stories similar to this one that have indeed taken place in the lives of many real individuals on society. Finally, the great performances, the incredible directing and the interesting story make this movie one of the best in all of the 2000s.",
      "review_date": "2017-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "to get in his mind subconsciously..The Wrestler\n\nThe Wrestler is a character driven drama about a sunken wrestler whose behind the stage life episodes changes drastically after he faces health issues. The camera work is manually handledto get in his mind subconsciously..The WrestlerThe Wrestler is a character driven drama about a sunken wrestler whose behind the stage life episodes changes drastically after he faces health issues. The camera work is manually handled which offers us a more personal experience and the perspective of the protagonist that helps us to get in his mind subconsciously. It is somewhat of a palindrome to \"Rocky\", but it has its own personality that comes alive through Rourke's gut wrenching performance. The background score is aptly scored with up lifting songs, decent cinematography and perfect editing. Ticking for around 100 minutes, the tale soaks up every emotional combat of protagonist's life. Siegel's narration isn't of a newer structure and webs out a safer play, but within its familiarity, it is thoroughly competent. The storytelling is elaborative and enthralling with a rhythmic beats that elevates the momentum of the sequences and glorifies each tiny notions. As mentioned earlier the performance objective is more than safe with Rourke on driver seat amping up the tale, alongwith Tomei's another mature and stable performance. Aronofsky is in his A game, flaunting his skills with such panache that his bubble doesn't seem fictitious at all, it's like the staged wrestling that Rourke does in here, but this time the audience hassled, is us. There aren't much verbal sparrings in this busy world, the props are used wisely along with all the all the physical sequences to speak volume and advance the plotline. The build up of all the leaps and eerie decisions that each characters make, the conversations are impressive, Tomei's inspiring track, the inner world of wrestling and Rourke's heartwarming performance are the high points of the feature. The Wrestler is a challenging eye popping tale to convey the message it actually wraps and its Aronofsky and his equally invested cast that makes it worth listening to.",
      "review_date": "2018-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fight movies, or where the theme is combat sport, appeal little to my personal taste, but I heard about this film so well that I decided to watch it. I was not a fan, and I confess that this style of combat is absolutely disgusting, mixingFight movies, or where the theme is combat sport, appeal little to my personal taste, but I heard about this film so well that I decided to watch it. I was not a fan, and I confess that this style of combat is absolutely disgusting, mixing masochism with ballet (everything is previously combined and choreographed). But the film has its moments, and the cast gave everything, and deserves this recognition.The story revolves around a wrestler, moderately famous, but whose career has not been particularly bright for many years, and whose age is now beginning to demand some rest: his body is badly treated, life on the road and vices of the profession have also taken their price and the heart is weak. To preserve the little health he has left, he has to leave the ring and find a common job, but adapting to a new life promises to cause him great difficulties.The rawness of the film can surprise, and even shock, the audience. And I'm not just talking about the brutality of the fighting, almost torture sessions by the Spanish inquisition! The film is not sweet and shows well the cruel change of life of the character, and the way it affects his self-esteem. It is not a pleasant film to watch, nor is it suitable for any audience. The harshness of scenes and situations is complemented by brutally sincere dialogues, in which there is no effort to soften words and things are what they are.Mickey Rourke had a lot of courage and a good deal of cold blood. I, personally, do not know if I would be able to subject myself to everything he had to go through to play that character. It is a truly commendable effort, and the result of this is a dramatic, powerful, impactful and authentic interpretation. In fact, it is the main reason to see this film! Marisa Tomei also appears in this film, in the role of a stripper, and seems to be totally uninhibited and at ease in the nude scenes (apparently, she dismissed the body doubles). She is very beautiful, and a talented actress who brightened the film with a wonderful performance.Technically, the film is quite interesting. Being a relatively low budget film, I was surprised that I never felt these financial limitations: the film has the look and quality of a more expensive film. The cinematography is very good and the sets, as well as the costumes, are of good quality and look good. The fight scenes are intense, and the level of brutality is high, and there is authentic blood there, I almost bet. The soundtrack seems to be fine, agreeing with the environment and the general tone.",
      "review_date": "2021-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This might just be the saddest movie I've ever seen. Not the kind of sad that makes you cry, but the kind that leaves you profoundly depressed.This movie feels real. I one hundred percent believe that Randy \"The Ram\" Robinson was a realThis might just be the saddest movie I've ever seen. Not the kind of sad that makes you cry, but the kind that leaves you profoundly depressed.This movie feels real. I one hundred percent believe that Randy \"The Ram\" Robinson was a real wrestler and it feels like this is a documentary crew just following him in his daily live. It all feels completely authentic.Micky Rourke is incredible.Marisa Tomai is also just as great.",
      "review_date": "2020-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOne of the most important thing in Darren Aronofsky movies is the focus in individual narratives and it perspectives about all the facts in stories. In Black Swan, the next director's work, for example, the viewer sees Nina, a ballet dance pressed by the importance of her next presentation and by her rivalry with Lily. In 2010 movie, it's worked the psychological e sensorial of Nina about the environment when she is, influenced by mental torments, when the frontier between psychological and physical world is over. In The Wrestler, the relation between Randy \"The Ram\" and the environment is the most possible real, without supernatural or metaphysics elements and influences like in Black Swan, influences that bring this movie to horror/thriller genre. The Wrestler is a real movie that talk about real emotions and stories thought real elements, and this detail is very important to understand the real definition of this movie. Randy \"The Ram\" is the typical figure of masculinity that use this to hide him fragile and weak side, contrasting with him Wrestler profession. He is the denial of classic characters of American cinema like Rambo and Rocky who, in last century, were symbols of American force in world, in a context of cold war between American capitalism and soviet communism. In this sense, Randy The Ram is the side of the American society doesn't showed to the world, representing the poor and miserable side of the country, something showed by the constants USA flag apparitions in many scenes in rings and in Randy's room. Aronofsky already work with the other side of United States in Requiem For a Dream, talking about how the pharmaceutical industry moves American society, mainly a middle class with the minim of consume power. In this case, the \"other side\" of American society is Randy Robinson out of rings, is the scene when the protagonist is coughing because of him health problems after an introduction showing him glory moments. Aronofsky is a director who works with an extreme nihilism in him movies and The Wrestler is one of the most nihilist movies of the director because of the manner that Randy see all the things, problems and solutions and what the relation between this elements with him wrestler career. Randy The Ram accept to continue him journey as wrestler even knowing about him health problems in heart, because he doesn't have any more in him life, no family, no daughter and no job. The nihilism is not anymore something negative similar to a existential crises, a negative perception about this philosophy. Now, is the liberation of individue against fail values like family and job that constructed capitalism. The value of job is finish when Randy let him job as attendant in market, while the value of family is finish when the protagonist break ties with him daughter. Then, the Randy decision in final frontier against Ayatollah is a nihilist revolt against these values. The Wrestler nihilism, even been only represented in the end, is an important element in all of movie since the violence of the second fight, before the time when Randy was in hospital, showed harshly and without a fix sense, until the manner that protagonist show him fighting wounds to Cassidy, like as it is a trophy. Both scenes show how violence is present in professional wrestler life and how it is like something to fill the inner void, and because of the form that violence is showed that transform The Wrestler in a nihilist and harsh movie. On the contrary of Trigun, mangá aserie, when the body wounds of Vash, The Stampede, are symbols to non-aggression of protagonist, in The Wrestler, the wounds is, justly, the affirmation and glamorization of violence, and who seen the mangá and Madhouse anime and Darren Aronofsky movie in 2008, know the difference between non-violence with piece, violence, nihilism and disbelief, when we compare Vash and Randy. There are, basically, two proofs Randy The Ram could be a symbology of United States: the first is the fight against the anarchist punk, adversary who symboligies the revolt against order an system, and the second is the fight against Ayatollah, the symbology of Iran, one of the mainly politic enemies of United States. Both adversaries that fight against Randy in movie are symbologies to something in opposite to American influence, the opposition to order and system of American neo-conservatism and the defense to a country minority in politic and economic of world. The possibility that Randy The Ram is a symbology to United States is broken in the end of movie with the final nihilist decision of protagonist, when he leave any extern symbologies and transform to a human that decisions and opinions is about himself. Them, the final attack against Ayatollah is not a attack from United States to Iran, but the concretization of this final decision about him life, when all politic symbology, present in characters like Rambo and Rocky , is leave, and Randy The Ram is, now, a new person",
      "review_date": "2022-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Mickey Rourke gives the performance of his career in this character study of man trying to move on in a world that has left him behind.",
      "review_date": "2021-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hate (and love) how Aronofsky always manages to make me feel anguish during his films.",
      "review_date": "2021-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A now old and tired Wrestler tries to physically prepare for his latest fight while trying to reconnect with his teenage daughter as the only way to redemption for a dissolute life led in the name of success and excess. ARONOFSKY SHIFTS THEA now old and tired Wrestler tries to physically prepare for his latest fight while trying to reconnect with his teenage daughter as the only way to redemption for a dissolute life led in the name of success and excess. ARONOFSKY SHIFTS THE SCENE LIGHTS FROM THE RING TO THE BREAKED SOUL OF A MAN WITHOUT EVER EXCEEDING IN THE DRAMATIZATION FOR ITSELF. The result is a genuinely harthbreaking movie, easily Aronofskyi's best to a level where it has never been repeated.",
      "review_date": "2022-11-12",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 136,
  "genres": [
    "Drama",
    "Sport"
  ]
}