{
    "title": "The Fall",
    "rating": 8.4,
    "release_date": "2008-05-09",
    "genre": [
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "summary": "Los Angeles, circa 1920s: A little immigrant girl finds herself in a hospital recovering from a fall. She strikes up a friendship with a bedridden man, who captivates her with a whimsical story that removes her far from the hospital doldrums into the exotic landscapes of her imagination. Making sure he keeps the girl interested in theLos Angeles, circa 1920s: A little immigrant girl finds herself in a hospital recovering from a fall. She strikes up a friendship with a bedridden man, who captivates her with a whimsical story that removes her far from the hospital doldrums into the exotic landscapes of her imagination. Making sure he keeps the girl interested in the story, he interweaves her family and people she likes from the hospital into his tale. (Roadside Attractions)… Expand",
    "critic_reviews": [
        "A movie that you might want to see for no other reason than because it exists. There will never be another like it.",
        "It's the most glorious, wonderful mess put onscreen since Terry Gilliam's \"Brazil.\"",
        "A deliciously vivid adventure fantasy.",
        "The Fall is a movie whose every frame pulsates with the desire to be a transportive, transcendent work of cinema. And each one of said frames is full of visual bedazzlement and wonder. So full that one is loathe to sum up with the phrase \"Close, but no cigar.\" But there is something, finally, kind of pushy about the film's desire to be a masterpiece.",
        "Dazzling and delirious, The Fall is a celebration of cinema, of old-fashioned storytelling and globe-hopping spectacle.",
        "The Fall is often an affectionate caricature itself, but one of astonishing beauty, featuring two heartfelt performances from Untaru and the tender, often mordantly funny Pace. They're perfect foils for Tarsem's gorgeous tone poem to cinema as a medium of magic and miracles, stories and lies.",
        "The Fall lives and dies on the strength of Pace and Untaru's remarkable performances. It's there that the pulsing heart of this magical-real film beats most true.",
        "Although the film revolves around a child, it's not a children's movie: A cruel and bitter undertone runs through the fanciful adventures, and Walker's depression is no mere plot contrivance to be cured by Alexandria's childish enthusiasm.",
        "The Fall is aptly named not only because it pertains to a tragic descent but because viewers will feel as if they have plunged headlong into an alternate universe with this dazzling adult fairy tale.",
        "It's an achingly beautiful movie and a triumph of location scouting, with more cosmopolitan spectacle than the past three Indiana Jones and James Bond movies combined.",
        "Director Tarsem (The Cell) reworks the 1981 Bulgarian film \"Yo Ho Ho\" for this stylish fantasy.",
        "Some of the set pieces are ravishing, more often they're ravishingly clunky.",
        "The Fall is what you'd get if you told a fiendishly gifted graphic illustrator the plot of \"The Princess Bride\" and sent him off to come up with his own version.",
        "If the human details are often problematic, the IMAX-grade bombast, ceremonial camera, and Jodorowsky-esque eclecticism still combine for a singular spectacle.",
        "There's no doubt that Tarsem's a visionary director. Now he needs to envision a worthwhile script for himself.",
        "Tarsem and his screenwriting collaborators aren't able to come up with enough interesting justifications for their sudden shifts, and soon the shape-shifting yarn just feels like lazy storytelling.",
        "This convoluted, arbitrary, overlong whimsy will strike most grown-ups as childish, and is far too violent and pretentious for kids.",
        "It's basically a Middle Eastern version of \"The Princess Bride\" with an assisted-suicide subplot.",
        "It has a rich premise and no lack of amazements. What it lacks in any sort of dramatic shape.",
        "It's the kind of movie for which the phrase ''you've never seen anything like it before'' was invented. The question is whether anyone would want to.",
        "Pretty pictures - thats what The Fall has to offer.",
        "A genuine labor of love -- and a real bore.",
        "There is never a sense that The Fall exists for any reason besides simply being something nice to look at. Yet no matter how good-looking a film may be, if it's as sleep-inducing as this, there's simply no point."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Amazing film, there's a lot of poetry and the story disclose in a very beautiful way.It's seriuos, it's odd, it's funny, it's a cult.One of the best photography I've seen in a movie, very emotional too",
            "review_date": "2017-07-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best and most impactful movies I've ever seen, both visually and emotionally exceptional.Seeing how the critics rated this masterpiece just makes me lose all hope for movie critics' credibility.",
            "review_date": "2017-09-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "After analysing this film and seeing it for a second time I have seen the masterpiece that is the fall. From the foreshadowing and great use of symmetry in the opening scene to the beautiful images of tarsem's sets. Not only is this filmAfter analysing this film and seeing it for a second time I have seen the masterpiece that is the fall. From the foreshadowing and great use of symmetry in the opening scene to the beautiful images of tarsem's sets. Not only is this film great in an artistic way but dramatically it delivers a surprising punch for an art film that's main focus is it's visuals.  I strongly recommend everyone to see this film although it is not for everyone.",
            "review_date": "2012-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tarsem weaves surrealist motifs into this Gilliamesque fantasy that will appear to the more visual-minded viewer (guess who saw Baraka?) They don't make them like this very often, and they may never again.",
            "review_date": "2013-10-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can understand why people don't like this film but I really want to give it a score of ten out of ten. However, what would I do if, at some time in the future, another film comes along that I like even more than this one? I wouldn't be ableI can understand why people don't like this film but I really want to give it a score of ten out of ten. However, what would I do if, at some time in the future, another film comes along that I like even more than this one? I wouldn't be able to give that film a higher score. So, for the stupefying beauty of the film, for the wonderful acting of the film, for the attention absorbing plot/s (some was a bit obvious but I think it was intentional), the arousing costumes and the gentle direction I give it full marks - ten out of ten. But I'm taking a little off the top for ... um ... oh ... OK it gets ten.",
            "review_date": "2012-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A magical and visual masterpiece. Make sure you watch it in 1080p, it's just beautiful. Great acting and directing. The design and creativity of this movie is something else. But be warned, it's not for everyone 9/10",
            "review_date": "2013-11-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A beautiful film! This brilliant, captivating, epic adventure took 4 years to film and used locations in over 20 countries including India, South Africa, Namibia....it's a brilliant film that everyone should experience because there willA beautiful film! This brilliant, captivating, epic adventure took 4 years to film and used locations in over 20 countries including India, South Africa, Namibia....it's a brilliant film that everyone should experience because there will never be another one like it. Stunning visuals, fantastic cinematography, and a flawless lead performance from Lee Pace make The Fall one of the most fantastical adventure films of the 2000s and one of the best films dealing with suicide.",
            "review_date": "2013-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "one movie you'll simply want to watch without a specific reason. great cinematography, wonderful direction, intriguing plot, and above all, the singular best chemistry between the leads. Lee Pace and Catinca Untaru steal the show.",
            "review_date": "2014-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Pretentious, artsy nonsense;.vacuous and incompetent. The director has a story to work, but little of that is apparent in the script, and worse yet is he doesn't know how to render a dramatic scene. His actors try minimalist expressions Pretentious, artsy nonsense;.vacuous and incompetent. The director has a story to work, but little of that is apparent in the script, and worse yet is he doesn't know how to render a dramatic scene. His actors try minimalist expressions to little effect. They try to cry but end up whining. He shooting angles are ridiculously wide and distant because he thinks the inanimate matter will speak where his actors fail to. He can thank his travel agent cum cinematographer for the postcard views.",
            "review_date": "2008-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is an R-rated kid's movie. The public expected and deserved better than to be treated to this \"Speed Racer\" with a Humanities degree.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I have a hard time understanding all the 10's for this film. For me to give a 10, it has to be pretty much flawless, and this film was FAR from that. While it was extremely good visually, the story itself left a lot to be desired. In I have a hard time understanding all the 10's for this film. For me to give a 10, it has to be pretty much flawless, and this film was FAR from that. While it was extremely good visually, the story itself left a lot to be desired. In fact, if it wasn't for the great cinematography, I would probably give it a lower number. This was nowhere near the quality of some of the other films I have seen this year such as The Edge of Heaven, Wall-E, 4 Months 3 Weeks and 2 Days or even Iron Man.",
            "review_date": "2008-07-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was very boring, it was hard for me to keep up because it didn't catch my interest at all. The plot is very simple and easy to understand, it was just made harder to get by the mix of reality and the bad stories the guy makes up toThis movie was very boring, it was hard for me to keep up because it didn't catch my interest at all. The plot is very simple and easy to understand, it was just made harder to get by the mix of reality and the bad stories the guy makes up to keep the interest of the kid. Visually ugly, the costumes are tacky, the colors too bright, the acting is okay. This is not an enchanting, artistic or moving story and I don't know why people like it. I find it to be boring, insipid and pretentious. Just a movie that tries to flash the viewers with high contrast colors, ridiculous costumes and a half-baked storytelling formula. It's a shallow movie in every aspect.",
            "review_date": "2014-11-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the most visually stunning films I have ever seen, and whilst being marginally let down by a slow start and some slightly clunky acting by the generally charming little girl, it ends so well you can forgive it. It has more This is one of the most visually stunning films I have ever seen, and whilst being marginally let down by a slow start and some slightly clunky acting by the generally charming little girl, it ends so well you can forgive it. It has more story line and substance than Hero, but is easily its equal in cinematography, see it at the cinema while you still can.",
            "review_date": "2008-10-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Major Disappointment! We have been looking forward to this film based on the reviews and trailers only to leave the theater shaking our heads wondering how much lower movies can go. All the good scenes were in the trailer. It totally lacks Major Disappointment! We have been looking forward to this film based on the reviews and trailers only to leave the theater shaking our heads wondering how much lower movies can go. All the good scenes were in the trailer. It totally lacks any real story and leaves you with an empty feeling. After only 20 minutes you could care less about the characters in the movie. The only reason we can see why a critic might like this movie is that *all* movies are so poorly written and lacking in any story arc as to make this one look somewhat good. In a world of blind men, a one-eyed man is king. Save your money.",
            "review_date": "2008-06-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fantastic film! I loved it up till the dissatisfying ending but one of the best movies of the year. Astounding and Magnificent.",
            "review_date": "2008-09-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A story about telling a story; but while the listener expands we can thank Tarsem for having the vision to give us some breathtaking visions and sequences. Even the opening, the black and white silent cowboy film being made on a bridge, A story about telling a story; but while the listener expands we can thank Tarsem for having the vision to give us some breathtaking visions and sequences. Even the opening, the black and white silent cowboy film being made on a bridge, gives us a tremendous series of almost statuesque tableaux. If you have a love of the visual, and understand the need to enjoy stories (however slight the plot is, and it isn't very deep at all) then this is a wonderful film. Having said that, the lack of a solid story just takes the edge of it, though the performance of the little girl who listens to the story unfolding is tremendous.",
            "review_date": "2008-10-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I don't know what these reviewers were watching, because this is probably the best film I've ever seen. My boyfriend and I are both in the industry and we have very different means of judging a film -- he's more visually I don't know what these reviewers were watching, because this is probably the best film I've ever seen. My boyfriend and I are both in the industry and we have very different means of judging a film -- he's more visually driven, and I'm first and foremost critical of the script and performances -- and we both thought this was a perfect movie. We were on the edge of our seats the whole time, we laughed at every scene (along with the rest of people in our screening) because despite the earnest marketing campaign, this is actually full of silly humor, and were both moved to tears at unexpected moments. The spectacle isn't arbitrary, nor are the plot twists. It's tightly constructed, with lots of unconventional choices that feel very honest. I cannot recommend this movie enough.",
            "review_date": "2008-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like amazing cinematography, great writing and great storytelling go see this! If you like only typical Hollywood crap this movie isn't for you.",
            "review_date": "2008-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely phenomenal. One of the most gorgeous films I have ever seen. It reminded me of a cross between Wizard of Oz, Pan's Labyrinth, and a Wes Anderson prescribed adventure. The stunted acting and brunt honesty of the film Absolutely phenomenal. One of the most gorgeous films I have ever seen. It reminded me of a cross between Wizard of Oz, Pan's Labyrinth, and a Wes Anderson prescribed adventure. The stunted acting and brunt honesty of the film acknowledges the trip into fantasy and its conflict with reality. Not to be missed.",
            "review_date": "2008-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I saw this movie twice already, and I'll probably see it one more time, something I",
            "review_date": "2008-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ingenious tale with vivid imagery. The two main characters work in unison to make the most of unfortunate circumstance. Together, they weave a story that is comical, tragic, adventurous and riveting. The story is told by an adult and the Ingenious tale with vivid imagery. The two main characters work in unison to make the most of unfortunate circumstance. Together, they weave a story that is comical, tragic, adventurous and riveting. The story is told by an adult and the visions are as interpreted by the child....Worth a post movie dinner dissection!",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When you were very young; when storybooks were read to you ... do you remember creating worlds so vivid that they were simply real, when you closed your eyes and imagined them to be? The Fall will invite comparisons to Pan's Labyrinth, When you were very young; when storybooks were read to you ... do you remember creating worlds so vivid that they were simply real, when you closed your eyes and imagined them to be? The Fall will invite comparisons to Pan's Labyrinth, The Adventures of Baron Munchausen, and maybe even The Wizard of Oz. It's a grown-up's storybook - a chance for you to sit down, revert back to your childhood, and become engrossed in make-believe again. However, if you've forgotten how to do that, you might have already outgrown this kind of film. This is storytelling as a fine art that not everyone will remember how to appreciate. Filmed in 18 countries over four years, this is also one of the most visually stunning movies I've seen. The symbolic uses color coupled with the rich palette, as well as the minimalist cinematography, create visual emotion like few films ever have. This one's better on the biggest screen you can find. In the end, The Fall is an ode to the magic of cinema.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Visually stunning, wonderful performances by Lee Pace and Catinca Untaru as the little girl, and at times a heart-pounding narrative made this an unforgettable movie experience. After seeing it, I subsequently dreamt all night-images that Visually stunning, wonderful performances by Lee Pace and Catinca Untaru as the little girl, and at times a heart-pounding narrative made this an unforgettable movie experience. After seeing it, I subsequently dreamt all night-images that were enveloped in brilliant colors and dramatic movement-impressions that were as surreal as the film itself. This must be seen on a large screen; I can't imagine it diminished on a small one.",
            "review_date": "2008-06-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful but dumb, and frustrating because the concept could have be astounding. There needed to be less flamboyance, and more plot, and message.",
            "review_date": "2008-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A fantastic movie from a director who I had only previously known from the ridiculous \"The Cell.\" I gave him a second chance with this film and am glad that I did. Besides the amazing visual that even its worst critics agree to be A fantastic movie from a director who I had only previously known from the ridiculous \"The Cell.\" I gave him a second chance with this film and am glad that I did. Besides the amazing visual that even its worst critics agree to be breathtaking, we have a wonderful reality plot juxtaposed by the fantastic story in the background. The story does a great job of showing how the story being told is not necessarily seen as intended, with the young girl's mind making its own decisions on how things visually happen (e.g. the Indian Roy describes is not of the Eastern variety). I agree with Ellen C that this should be seen in the theater if possible, but I will still be purchasing a copy as soon as it is on DVD.",
            "review_date": "2008-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is most hilariously bad movie I've ever seen. The 'story' makes no sense. The 'acting' and 'dialogue' are straight out of a junior school play. Every other shot looks like the generic photo that comes This is most hilariously bad movie I've ever seen. The 'story' makes no sense. The 'acting' and 'dialogue' are straight out of a junior school play. Every other shot looks like the generic photo that comes with the picture frame. To top it all off, a fair amount of money looks like it was pumped into the production. (at least it created work for a lot of people, eh?) Rent, and make a drinking game out of it, mute and make up your own dialogue, or just throw popcorn at the screen.",
            "review_date": "2008-09-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The moive was wonderful to watch. It has so many plots lines and graphics it's an amazing watch.",
            "review_date": "2008-10-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Visually stunning and moving. Catinca Untaru was nothing short of amazing. I don't know what was harder to do, fall in love with Untaru's sweet and adorable character or be enchanted by the fantasy story. This movie is so well Visually stunning and moving. Catinca Untaru was nothing short of amazing. I don't know what was harder to do, fall in love with Untaru's sweet and adorable character or be enchanted by the fantasy story. This movie is so well written & directed, I'm amazed I haven't heard more about it. Critics giving this film low scores do not appreciate charismatic cinematography, especially when its not filled with gallons of blood, nudity and vulgar language. In modern day cinema, it was refreshing to see a film so original. This is a must-see for all movie-goers. A+",
            "review_date": "2008-10-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Catinca Untaru is soooo lovable...and the story is quite fun to be followed...this movie won Glass Bear Award at the Berlin Int'l Movie Festival 2006...but to the lukewarm critics, I don't know whatever happened. And it's a Catinca Untaru is soooo lovable...and the story is quite fun to be followed...this movie won Glass Bear Award at the Berlin Int'l Movie Festival 2006...but to the lukewarm critics, I don't know whatever happened. And it's a movie you could enjoy though you go to the cinema alone.",
            "review_date": "2008-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Best movie of '08 by far. A visual masterpiece that delves into the bleaker aspects of the human pysche. The tale (the fantasy told by Roy) within a tale wonderfully reflects the mental state of lead character.",
            "review_date": "2008-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Though the scenery is the most sumptuous looking I've seen in a very long time, thankfully, none of the actors take one bite. It's a beautiful film, told simply, realistically, and everyone involved is simply magical. It's Though the scenery is the most sumptuous looking I've seen in a very long time, thankfully, none of the actors take one bite. It's a beautiful film, told simply, realistically, and everyone involved is simply magical. It's colourful and dark, epic and small - it's everything you wished your life was.",
            "review_date": "2008-05-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic. A beautiful vision of childhood innocence and imagination and the imperfections of childhood imagination. By letting Catinca Untaru be herself and adapting the film to her performance, Tarsem takes us to a place we haven't Fantastic. A beautiful vision of childhood innocence and imagination and the imperfections of childhood imagination. By letting Catinca Untaru be herself and adapting the film to her performance, Tarsem takes us to a place we haven't been since we were little. It is not conventional and not for everyone, but I found it to be fantastic in the truest sense of the word.",
            "review_date": "2008-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a moving tale of a suicidal man and innocent little girl who transform each other through a story that they improvise together. The film is as focused as it is phantasmagoric; it's a lusciously crafted lesson about the trans This is a moving tale of a suicidal man and innocent little girl who transform each other through a story that they improvise together. The film is as focused as it is phantasmagoric; it's a lusciously crafted lesson about the trans formative power of the imagination.",
            "review_date": "2008-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An absorbing movie worth multiple viewings. The rare movie that presents the world as seen through a child's eyes in a convincing way. More than a little confusing at times (again, multiple viewings).",
            "review_date": "2008-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Slow to start, but the ending is worth the wait. The Fall, though not phenomenal, is utterly intense, and sometimes confusing, but at the end of the movie, it comes together like a masterpiece. Though I had heard of this movie, I wasn't Slow to start, but the ending is worth the wait. The Fall, though not phenomenal, is utterly intense, and sometimes confusing, but at the end of the movie, it comes together like a masterpiece. Though I had heard of this movie, I wasn't sure what to expect, so I decided to check it out and am very pleased that I did. Without a doubt, it's one of those movies that you either love or hate. It's difficult to be on the middle-ground.",
            "review_date": "2008-09-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love this movie. It is one of the most breathtakingly beautiful films I have seen in a long, long time.",
            "review_date": "2008-09-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow - visually, this in one of the most stunning movies ever made! The only reason I did not give it a 10 is that it was more like watching a world class art installation than a dramatic film. The story is simple in its construction Wow - visually, this in one of the most stunning movies ever made! The only reason I did not give it a 10 is that it was more like watching a world class art installation than a dramatic film. The story is simple in its construction (although there are some not so obvious underlying meanings). In general, I think the negative reviews are related to the small mindedness of the general American movie going crowd. The most amazing part of this movie is that no computers were used to enhance any scene. In an age where we take the amazing for granted because everything is altered - this movie is truly amazing! See it!",
            "review_date": "2008-09-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stunning cinematography. Imperfect characters, the way people are. The story progresses with steep pace, the way life is. A kaleidoscopic tour around what nature offers, what civilization created and the puny inners men still have.",
            "review_date": "2009-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Utterly, utterly boring. Nothing but eye candy here.",
            "review_date": "2009-07-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Epic and ambitious, visually stunning but hampered by a largely B-List cast. Worth seeing for the cinematography alone.",
            "review_date": "2008-11-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A totally underrated movie. This one is a feast for the eyes and something for the heart.",
            "review_date": "2008-11-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The interplay of images and story unfolds to create a visually stunning and original epic film hidden within a drama. The tale is beautifully supported by the remarkable and natural performances of Pace and Untaru. And, the fact that it was The interplay of images and story unfolds to create a visually stunning and original epic film hidden within a drama. The tale is beautifully supported by the remarkable and natural performances of Pace and Untaru. And, the fact that it was filmed with a small budget and (at times) a small crew, makes it an even greater achievement.",
            "review_date": "2008-10-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There's nothing I can say here that will accurately tell you how good this movie is. You really need to see it.",
            "review_date": "2008-12-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful but simple, self-aware but enchanting. Substance matches style. See it.",
            "review_date": "2008-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Superb visuals. Both the real world as well as the fantasy settings are exotic. Intimate though somewhat disjointed story. Great acting. I actually felt the fact that I could understand only half of what the little girl said added to the Superb visuals. Both the real world as well as the fantasy settings are exotic. Intimate though somewhat disjointed story. Great acting. I actually felt the fact that I could understand only half of what the little girl said added to the exotic flavor of the movie.",
            "review_date": "2009-01-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The film is truly inspiring at first glance one would think that you were viewing a cinematic painting of Salvador Dali, vivid colour and expression of love, loss, temptation, confusion and heroic story telling at it's heart, it's The film is truly inspiring at first glance one would think that you were viewing a cinematic painting of Salvador Dali, vivid colour and expression of love, loss, temptation, confusion and heroic story telling at it's heart, it's all there. Tarsem Singh is definitely inspiring.",
            "review_date": "2009-04-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The Fall is by no means, a brilliant movie. But it is a brilliant creation. I have never been that fond of Tarsem's work, like The Cell, which was okay but the standout was the awesome Immortals. The Fall is a beautiful looking film, itThe Fall is by no means, a brilliant movie. But it is a brilliant creation. I have never been that fond of Tarsem's work, like The Cell, which was okay but the standout was the awesome Immortals. The Fall is a beautiful looking film, it surpasses all technical aspects and creates a living breathing world inside. Lee Pace is good in the lead, but I have seen better from him. You see, The Fall is low on violence and is more about the immersion of the viewer. The story is convoluted and hollow at times, with kiddish dialogues and screenplay that is all over the place. But this is a different movie, one that has the ultimate power to entertain the viewer and at the same time dazzle them. With a few flaws aside, The Fall is a great movie, that should be one to see, just watch it. Don't even complain.",
            "review_date": "2015-02-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You can find it filed under Netflix subgenre “Overacted Visually Striking Historical Fantasy Epic”. There are two ways to watch this movie, one is just to watch it, in which case you might as well just make a slideshow of stills and set thoseYou can find it filed under Netflix subgenre “Overacted Visually Striking Historical Fantasy Epic”. There are two ways to watch this movie, one is just to watch it, in which case you might as well just make a slideshow of stills and set those as your screensaver. Wait, there are three ways, because you could also take mushrooms and put it on a projector, which will be a “trip”—as they are fond of saying. The third way is to watch it while mentally projecting the invisible character of Tarsem Singh pacing like an angry tiger on the periphery of every scene. In case you are unfamiliar, here’s the new synopsis: inexperienced director sinks fortune and years of his and others’ lives into passion/vanity project that is supposed to be the ultimate ode to old school film making. See Tarsem pouring over a script for too long to keep it straight. See Tarsem yelling at his adorable actors until they start to breakdown for real. But also, see Tarsem searching the world over for the most beautiful places you have never seen, and lovingly recreating the greatest non-CG effects with such audacious aplomb that you simply can’t understand how the **** he pulled off some of those shots, and see someone obsessed with dead filmmaking make a film about dying filmmaking in a confused and beautiful hurricane of love and futility. Do that and you’ll be glad you got something more than a screensaver and a trip to the hospital like your other two friends.",
            "review_date": "2015-10-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most underrated films ever made, \"The Fall\" is a beautifully directed movie.",
            "review_date": "2019-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the most beautifully filmed movies ever. You could watch it just for the visuals alone and have your breath taken away, but it has an intense emotional core at its center as well, and the pure beauty of it and its story might bring youOne of the most beautifully filmed movies ever. You could watch it just for the visuals alone and have your breath taken away, but it has an intense emotional core at its center as well, and the pure beauty of it and its story might bring you to tears as it did with me.",
            "review_date": "2018-02-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautifully shot, with on-location set pieces in the style of Baraka (1992). A feast of vivid colors and showy costumes. Incredible acting from the little girl supplemented by decent acting from Lee Pace. Unfortunately, the story is difficultBeautifully shot, with on-location set pieces in the style of Baraka (1992). A feast of vivid colors and showy costumes. Incredible acting from the little girl supplemented by decent acting from Lee Pace. Unfortunately, the story is difficult to comprehend when formatted as a 100-minute feature film. By forcing you to focus on understanding what is going on, you start to miss the impact of the story being told. I get what the film is trying to do - the fractured, nonsensical plot reflects the state of the characters in weaving a combined narrative, highlighting a difference in language and mindset. Yet, one could argue that the content of the dream sequences doesn't matter all that much to the take home message, in which case the director should be a better shepherd of the viewer's time. Roy's motivation could be improved as well. We are shown the heavy impact of love lost, without context for why it was such a powerful motivator. Its one of those movies that gets better with multiple viewings when you can pick out all the details you missed the first time.",
            "review_date": "2021-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Still my favourite movie of all time. So hauntingly beautiful, absolutely stunning pictures and flawless acting. Secret masterpiece",
            "review_date": "2022-10-27",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 76
}