{
    "rating": 6.0,
    "release_date": "2018-07-04",
    "num_reviews": 33,
    "genres": [
        "Japanese"
    ],
    "summary": "Norimichi and Yusuke are both infatuated with their classmate Nazuna. But when Nazuna decides to run away from home, it's Norimichi she asks to join her. After their plans go awry, Norimichi discovers a magical ball that has the power to manipulate time and give them a second chance, but each reset brings new complications.",
    "reviews": [
        {
            "content": "Não lembro, mas gostei!",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "The animation was not appealing to the eye. The storyline was horrendous. The characters made this even worse. This is barely a 1-star coming from the good music and decent art style.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "Fireworks is beautiful anime film and good voice dub actors,but the story, the plot and the editing is a mess on this film.",
            "review_date": "2021-07-08",
            "source": "rt"
        },
        {
            "content": "I read the manga just to understand 'THAT' ending. It has a beautiful OST yet the movie is badly executed.  The visuals are beautiful except for some bad CGI mixed in the movie. I'm not sure if I would recommend it.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "Astonishing realism in teenage relationships.\n\nAkiyuki Shinbo and Nobuyuki Takeuchi's direction for their romance drama anime picture Fireworks (2017) is dreamy and enchanting. They keep all the drama on a grounded level of teenage worries about relationships, dating, friendship, and concerns for tomorrow. Their visual ideas for directing time shifting back into the past for an alternate existence is creative and cool. I adore when anime movies feel sincere in how they approach depicting teens in a coming of age story. Characters feel this freedom to do whatever, but I like how Shinbo and Takeuchi's direction has them hesitate when faced with making hard choices. It feels all the more authentic to me. Fireworks is a wonderful anime feature that I'll remember fondly.\n\nFurthermore, Fireworks' vivid colors for fireworks, outfits, and hair are as breathtaking as the stunning background paintings. Toho's hand drawn animation is truly gorgeous and as impressive as other modern anime films like Your Name or The Wind Rises. Everything is explosive in Fireworks, from strained friendships to sudden relationships developing, but Shinbo and Takeuchi's direction ensures there's this quiet fun to appreciate all the simple pleasures in life's every waking moment.\n\nShunji Iwai and Hitoshi One's script writing is beautifully sympathetic to the anxieties of kids with realistic dialogue to how teenagers think, talk, and feel. You better understand and relate to feelings of butterflies in your stomach over a crush speaking to you or asking you out, while empathizing with single friends jealous of your love life. Fireworks understands the loving feeling you get when someone you love is near and counting on you. I think it's a lovely anime feature.\n\nFireworks is a moving romance drama and a playful science-fiction adventure. I know some viewers disliked the ambiguous ending, but liked how it concludes on a warm, positive note of ethereal romance and simple closeness of a couple. What happens after this curious \"What If?\" style story of potential romantic encounters is up to you. \n\nThese mind bending stories work best when grounded to some kind of reality and Fireworks does that well by editor Rie Matsuhara easily cutting back to certain past events, while splicing together previous scenes quickly in a montage, so that the audience can follow along clearly. Rie's cuts keep Fireworks edited down to a brisk 90 minutes. I love short stories and I feel like anime narratives can be told effectively with sharp cuts like in Fireworks.\n\nSatoru Kosaki's score is beautifully composed. The J-Pop idol song in the middle of Fireworks is really cute and well written. The rest of Kosaki's score is sublime with this magically romantic orchestration that charms you immediately. All the voice actors and actresses have a playful excitement that comes across as endearing and memorable. Lastly, I really liked the strange sound design choices from Youta Tsuruoka. The crystal time marble changing time with this glistening sound or the splashes of water all sound neat in Fireworks, let alone the fireworks explosions themselves.\n\nIn all, Fireworks is worth seeing. I think Fireworks is a fantastic romance drama for lovers and the lonely to experience.",
            "review_date": "2021-01-08",
            "source": "rt"
        },
        {
            "content": "2017 was such great year. Sadly, Fireworks didn't embody any of it. One of my biggest issues in story telling is when real world issues are solved by fictional things. Okay so the oversexualized child has a hard time at home, let's just reverse time and fix it. A relatable issue with a solution that isn't possible. Sadly the best scene in the film is when the main character (I can't bring myself to remember anyone's name) gets punched. I showed this to a group of my friends and it made them all laugh. Given that it was supposed to be a tragic scene, I knew at that point we had a real stinker here. *sigh* not even the animation is that great, at least not for 2017 standards. Man it's the best part of the movie and that's no better than a 3/5. My God I hate this movie.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "It was so beautiful it bursted my heart I really loved it so much, I liked the art and the music.",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "This movie (if you could call it a movie) was awful. I cannot believe the director strung this together and released it as is. From what I saw the trailer and music video made this film seem promising. What I watched was trash.\n\nThe animation is terrible with very cheap CGI. It's so obvious if something isn't drawn. The worst are the cars, windmills, and fireworks. They shouldn't have bothered spending money on CGI if it was going to be that poorly rendered. \n\nThe basic plot becomes missing half way through the film, and ends with a huge \"you decide what happens.\" The characters are awful. They lack any real agency or even a basic personality. The worst is Norimichi Shimada (the main character) who if I had to describe is essentially air. \n\nLater when I think Nazuna Oikawa's has a real concern about opposing her mother's new boyfriend, they completely drop that part of the story and move on. \n\nThen there's the notorious acid dream like sequence that comes out of nowhere are provides nothing to the film. The monotone singing really takes the cake.\n\nHonestly, I can tell you I watched something, but if I had to describe what I watched, I would be unable to due to the confusion of what this movie is suppose to be.\n\nDo not watch.",
            "review_date": "2020-09-08",
            "source": "rt"
        },
        {
            "content": "It is a cute love story and I would recommend watching it. It can be a bit confusing at times, but other then that its a great movie.",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "Visually stunning; narratively devoid. It's hard to know what I even watched. It's just... The story builds up this excellent idea, something in the vein of Kimi no na wa, where some neat supernatural jargon is going to change stuff. But then it goes completely off the rails, totally distracted by its own presentation and premise. This was a wonder to look at, and my eyeballs were fully engaged the whole time, but my brain was on fumes desperately trying to figure out what was occurring.",
            "review_date": "2020-05-05",
            "source": "rt"
        },
        {
            "content": "Honestly the only reason I can give this a full star is the decent animation and music. The main character(s) have no plot development and definitely needed more 1st person narrative (from the persons head). Half the time the main character(s) choices didn't make much sense. The movie had lots of potential tbh, it's story had a good base concept if done correctly and with a couple of tweaks. Overall, I suggest if you don't want to waste time watching a pretty mediocre anime movie don't watch this. Thanks for reading!",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "It was cute..... Thats it... Nothing else was good. No character development. a ton of uncessasary things. The story was AWFUL and half the time you couldnt understand anything. It had so much potential and 30 minutes of the movie was them talking about wheather fireworks are or round. Its satisfying as in i got what i came for, like i got some romance but i didnt like it.",
            "review_date": "2019-08-22",
            "source": "rt"
        },
        {
            "content": "It was really good! I hope there will be a  pt2!!",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "I really liked it it was magical and reminds me when i was with a guy before i moved away",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "It so happy and sad. it made me cry so hard. it was a great movie. the end did not show were they were but still great. so before you watch it you better be ready to cry hard",
            "review_date": "2019-03-27",
            "source": "rt"
        },
        {
            "content": "It's a well made illustration of those opportunities you miss throughout life. Shaft's weird storytelling style is a good tool for visiting the \"what if\"s that weight in our hearts from time to time.\n\nThe \"critics consensus\" on this one is quite nonsensical. There is no \"ambitious blend of genres\" here. It's about a simple life changing event that forces a few common students to face their feelings, and a magical element that gives them the possibility of realizing what those feelings are.",
            "review_date": "2019-03-14",
            "source": "rt"
        },
        {
            "content": "The only \"fault\" with this movie is it grossly over estimated the intelligence of many of it's viewers.",
            "review_date": "2019-02-17",
            "source": "rt"
        },
        {
            "content": "Beautiful movie!!! I remember finishing it and literally crying for 1 hour after I finished it...but Iï¿ 1/2(TM)m a wimp soï¿ 1/2'ï¿ 1/2'ï¿ 1/2' over all, probably my favourite anime movie! 100% recommend it to anybody looking for an emotional movie",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "It was a great movie you should watch it",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "I was so confused by the entire movie. The story left me baffled. The animation was amazing! The music was perfect. But i was kind of sitting there thinking what in the world did i just watch?!",
            "review_date": "2019-01-03",
            "source": "rt"
        },
        {
            "content": "Overall Fireworks is one of the WORST movies of 2018 in my opinion & Definetly one of the worst anime movies of all time. The Characters are Dull annoying & extremely unlikeable & forgettable The animation while looking amazing at times is fucking Shit & so bland looking the film moves at a goddamn Snail's Pace &\nThe Dub is so Badly translated that ya just can't help but laugh\nas a Whole Fireworks goes up there with 50 Shades Freed, Show Dogs, Truth Or Dare & Sherlock Gnomes for the Worst Movie Of The Year",
            "review_date": "2019-01-01",
            "source": "rt"
        },
        {
            "content": "Boring, badly paced, and should've only had a DVD release.\nB's Tomatoes: 12%",
            "review_date": "2018-08-29",
            "source": "rt"
        },
        {
            "content": "Fireworks is a teen romance meets groundhog day story that is simply too shallow to really explore any of the themes it touches on.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "This movie has some of the most beautiful animation that you could search for. It is a decent movie but it lacks depth and resolution. It rises up in conflict and then just pitters out like a firework that soars high into the sky and then doesn't explode. It wasn't bad but it wasn't amazing either.",
            "review_date": "2018-07-06",
            "source": "rt"
        },
        {
            "content": "boring!!!!!!!!!!!!!!!!!",
            "review_date": "2018-07-05",
            "source": "rt"
        },
        {
            "content": "Was extremely disappointed. Unlikeable main characters with an overly forced love connection (despite no chemistry) leads to a dull and forgettable movie.",
            "review_date": "2018-07-03",
            "source": "rt"
        },
        {
            "content": "Uchiage Hanabi Break Down\nBy the way, this movie seems to be different from the original by a long shot and be careful for spoilers.\n- [ ] Nazuna possibly has thrown the ball to travel through time as possibly hinted from the beginning of the show when she writes a letter after she finds the ball. Although this isn't proven, it's good to keep note.\n- [ ] Very pointless/lifeless in a way as a problem in terms of character development for this movie. But the philosophy it's trying to teach is the main goal of this anime.\n- [ ] It all seems pointless, but as the review goes there are some hints in the detailed world that drive the meaning of the anime (they have to be major actions in this limited and interesting perspective but detailed animation)\n- [ ] First they start out with 4 important characters: Norimichi, Nazuna, Nazuna's mother, and Yusuke. Others most likely irrelevant. All of them are underdeveloped but at least the important 4 had some development.\n- [ ] The first signs of detail is when she first talks to Norimichi, about catching the dragonfly, most likely her. But he misses it, hinting that he missed his opportunity, basically foreshadowing the whole story from this point. When he missed his opportunity to go out with her on the last day and confess his feelings, or just missed opportunities in which he could have saved Nazuna.\n- [ ] First the fifty meter race seems to define the outcome of possibilities of the whole thing. Which the guy was mad in all of the other possibilities from the ball. At first the Yusuke says that he doesn't like Nazuna, yet he gets mad and jealous after Norimichi takes her from him. Which seems to be bounded by the 50 meter race that in the real world, the precedent was held.\n- [ ] Then comes the fireworks in which it was flat. They were all sure at first that it was round in which the real world it should be, but it was flat as depicted in the movie. This symbolizes that not everything is how it seems, just like Nazuna and Yusuke. Yusuke showed his jealousy or put on a fake face on the first trial causing pain to the real world. This show the real world and how little in the real world care until the last minute. But that one time, they asked one important question, \"If [fireworks] were flat, what would you do?\" As that is yet to be answered, it seems to show...\n- [ ] Then comes the second chance in which Norimichi goes back to fight the father, but that time he gets his way and he gets to have fun with her, says that \"This world is wrong. Fireworks can't be seen like this.\" That just shows that this version of the world is too good to be true, as shown that the type of fireworks is round, but they're extra blurry and fancy. That is when reality hits hard and they get killed. Throughout the story in the train station/ride with Nazuna, they talk about dying together, in love. Nazuna lost his opportunity to throw the ball and they fell into the ocean. \n- [ ] The next thing that pops up is the train, but is actually the road to an imaginary world. It's a train ride to death (to an endless path with no direction, which the sign says \"umi\" or the ocean), like afterlife as hinted after their death where nobody can see them, as Norimichi said, \"what if no one saw us?\" Which no one did. The world created seemed to be inside the ball. With things frozen, except for the fact that some people can move. Moreover, in the end, when they call Norimichi's name and he doesn't respond, it hints that he's dead showing Yusuke's unresponsive face, also hinting that this is the real world, while the ball provided a world that the ball created, as it has created many other worlds after.\n- [ ] When Nazuna jumped into the water, and popped it, it signified that she was a firework, as water droplets. And when the firework ball was shot up into the world, it showed what it look likes memories, but I believe it's not. It's the opportunities of Norimichi, that was the special powers of the ball, a ball of opportunity, dreams, wishes, timelines. That's why it changes the world with every throw and wish of Norimichi. And that fake imaginary world in response to the question, \"What happens after you die?\" Reveals a possible world, possible outcome hidden inside the opportunity of the ball. This story talks about the mistakes of a person and all of the opportunities that he could have taken which lead to better outcomes. But the world isn't real, as hinted when it became too good to be true, when he cheated the system by going back in time and modifying it, and by knowing the outcomes of each timeline. This symbolizes the author's story, he wishes to take the opportunities to change the outcome through a butterfly effect, but reality prevents that from happening; However, \"what if...\" the world isn't what it seems, maybe it would be possible?\n- [ ] This whole movie was focused on reality development, not exactly character development. It was like a cat and mouse chase of a runaway couple that the world forbids together - through fate. This is a lot like Romeo and Juliet's youthful love and immature infatuation of each other, signifying romance while focusing on reality development. However, without the character development, it's hard for the Romance to be romantic especially without good character actions. Because of all these layers, the lack of development, and different focus of the anime, people won't understand this and won't feel much emotion with this without understanding every single detail of the movie. That's is the point of the title: is the movie pointless? too good to be true? or is there more than meets the eye? This plays with our perception so much that many people won't see this as art, but as you can see, if you think about it long enough, you'll understand how this movie is a smart type of art, but failed to entertain as a general story.",
            "review_date": "2018-05-08",
            "source": "rt"
        },
        {
            "content": "Puede que vengan de los de Your Name, como no paran de alardear en los anuncios, pero si vas a verla con ese pretexto, a lo mejor, A LO MEJOR, sales un poco o muy decepcionado/a. Hay momentos entumecedores que te darán vergüenza ajena, pero eso no descarta que de vez en cuando sepa llevarte.",
            "review_date": "2018-04-23",
            "source": "rt"
        },
        {
            "content": "The only thing exceptional about this disastrous movie was the animation. Without it, the plot, the characters, the concept, it was all horribly written and irritable throughout the whole thing. This movie failed to keep me interested from start to end, and was not worth the watch. Was this movie supposed to be emotional? Well, I was definitely emotional, because I felt a lot of annoyance for these idiotic characters. The start was unbearably a a waste of time, and I recommend you skip through the first 30 minutes if you don't want to waste your time. It failed to make my heart feel warm, and the \"heartfelt moment\" only disappointing me.",
            "review_date": "2018-04-22",
            "source": "rt"
        },
        {
            "content": "good visuals, ost and animation. Plot makes no sense and characters are bland with no development whatsoever.",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "Very weak storyline and very slow pace",
            "review_date": "2017-12-09",
            "source": "rt"
        },
        {
            "content": "Flawed with a confusing closure but relatable and entertaining enough.. Full review: http://bit.ly/2jzzcGw",
            "review_date": "2017-11-30",
            "source": "rt"
        },
        {
            "content": "Pretty lighting and scenery, but somehow the characters and animation felt a bit sloppy to me. Plot was ... interesting in that it explored worthwhile themes of fate, regret and alternatives - yet it ultimately went nowhere and felt more like an art experiment. For example, the ending is open but I'm not entirely sure that ambiguity was at all necessary. Atmospherically appropriate, perhaps, but contributed little to the film.\n\nWriting is a bit crude but I suppose a realistic enough depiction of young school boys.\n\nReally, I was mainly here for the art and music. If you do decide to watch this (which I can't wholeheartedly recommend), do look out for the use of perspectives as a motif in the film to help tie the narrative and the art style together.",
            "review_date": "2017-09-06",
            "source": "rt"
        }
    ]
}