{
    "rating": 5.3,
    "release_date": "2018-03-30",
    "num_reviews": 198,
    "genres": [
        "Drama"
    ],
    "summary": "The Rev. Dave Hill faces an unexpected setback when his beloved church burns down -- prompting the officials at the adjoining university to try and kick his congregation off campus. Battle lines are quickly drawn between the church and the community as the reverend now finds himself at odds with his longtime friend -- the president of the school. Facing a legal battle, Hill soon seeks help from his estranged brother -- a big-city lawyer and atheist -- in a fight to help rebuild the church.",
    "reviews": [
        {
            "content": "Its a must see for everyone",
            "review_date": "2023-03-24",
            "source": "rt"
        },
        {
            "content": "Unrealistic depiction of well... everything?",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "A superficial strawman of a movie.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "Now in the real world this is something the ACLU would might have got involved in, but you Pureflix nazis turned the ACLU as EVIL!  But this one doesn't demonize the Left as much as the rest of the franchise, next movie included.  Both sides are human, neither is portrayed as evil or just bullying the right.  The two playing the brothers have great chemistry.  But since it pissed off the Right Winged Fox \"newzis\" this one made less than the other two, so next is \"back to formula\".  It's a said that this is the only faith based movie that says you can have your own faith and not what the right tells you what to believe.  I'm guessing director and co-writer Michael Mason was probably fired by Pureflix.  Or as I call them Pureflixaganda.",
            "review_date": "2022-07-12",
            "source": "rt"
        },
        {
            "content": "Netflix always screw it all.. progresism, so bad... They try to change christianism",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Evangelicals are only hurting themselves",
            "review_date": "2021-11-17",
            "source": "rt"
        },
        {
            "content": "The first movie was meh. The second one was bad. This one is a dented masterpiece and probably one of the most underrated Christian movies ever. My only regret was that this film wasn't released during the pandemic.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "While the plot was not always fully engaging to the audience, it was interesting to see the movie portray Christianity from a pastor's perspective. Being able to see a pastor that struggles just as everyone else struggles creates a relationship with the viewers. Overall, a good movie to watch but not much apologetics involved unlike the other 2 prior movies in the series.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "I'm surprised by this it was actually a decent movie with an actual good message and a plot that felt real. This is how you make a good Christian film that doesn't attack anyone who isn't Christian. Sadly the movie didn't do well and I think that is because of the first two films being so bad. It's not a perfect movie but it's a step in the right direction and I would like more Christian films like this one that don't try to devide people but bring them together. People should just watch this one and ignore the first two.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "bad, but a bad movie from a bad franchise.",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "Much like the first two, this sends horrible manipulative messages. (This deserves 0 stars, but it wouldn't let me do that)",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "The surprising part is how these people manage to make each part worst than the previous ones.. I had only seen that accomplished by the Resident Evil movies",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "An okay movie.  Over the top acting. Sure, but far less the other movies in the series.  I believe in the basic premise that there are extremely liberal colleges who want a completely secular environment to the point of hostility to Christianity(Look at the Ivy League Colleges where Christianity is a primitive belief).  The best part of the movie was about forgiveness and atonement not Christianity vs. the liberals",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "I enjoyed this one, touching and uplifting which unites people and brings down barriers. Needs to be seen by all",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Not as good as the other 2, but still an honest look at the doubts that arise when trying to live a life of faith.\n\nAlso highlights the balance of taking a stand and walking in love.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "Though it's not impressive compared to other films, the understandability of the religious drama among the characters is raised to a more praise worthy level.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "It is a good movie about forgiveness but it takes away from the series. It has a good storyline but feels as though it jumps around. It feels real and fake all at once. It is good to see and it was a nice story but a movie that I would recommend because you've seen everything on Netflix.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "It was different. If you seen the previous movie, you will see Dave getting arrested. The movie is about college trying to tear down his church to expand their school. In a way, it was a debate between them to prevent them from destroying his church. \nOf course, there were some sad scenes here. In the end, which was definitely great, he dropped the lawsuit and decided he will start a new one somewhere else for his followers. \nThis movie, along with God's Not Dead and God's Not Dead 2 is super intense and great! I love it! The songs are great! \"God's Not Dead, He Surely Alive!\"",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "A change in director and writer was much needed. This is clearly the best one, but still not necessarily a good movie.",
            "review_date": "2020-01-10",
            "source": "rt"
        },
        {
            "content": "somehow even worse than the previous parts",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "This is another decent movie, not as powerful it might have hoped to be. Really touches on a lot of points about the role of religion in the world these days.",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "It sucked . Pure politics  Throw them tomatoes NOW ",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "There's more!?!??!?!?!??!??!! NOOOOOOOO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "Was a great movie in today's world. ",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "A success in filmmaking! Makes you wonder why so many \"top critics\" watch this movie only to berate and mock us for producing media that shows us as persecuted. The irony is rich, almost as rich as this movie!",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Terrible. Characters were two-dimensional, the conflict was contrived as it gets, and the dialogue sounds like it was written by an incredibly biased and detached-from-reality third grader. Maybe the patently one-sided creators of this movie should've consulted an actual atheist for this movie instead of writing a character who is nothing more than the tired caricature of an atheist that theists who've never talked to an atheist think atheists are like.  ",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "A perfect ending to the series. Gives you lots of things to think about.",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "Nope! Not as bad as number 2, but it’s still got that agenda. If your movie is too preachy on a conservative or liberal side you’re in trouble. However this one feels like it learned from the last one. But seriously, go and watch Prince of Egypt or Indiana Jones and the The Last Crusade. Those two are very good movies that capture the importance of religion without being preachy and a bit rude. Also I’m an Orthodox Christian by the way so I guess my opinions on this movie are pretty valid in some way.",
            "review_date": "2019-06-30",
            "source": "rt"
        },
        {
            "content": "not worth watching again imo",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "I'm legitimately in shock. If you don't know, I absolutely hated the first two movies. All they did was make anybody who's not a Christian look like the most horrible people who ever lived. Those two movies relied on stereotypes and guilt-tripping to get their agenda across.\n\nGod's Not Dead: A Light in Darkness takes all of that, and throws it straight out the window. In fact, this movie is so different in quality and philosophically, that it actually feels like a reboot.\n\nEvery character in this movie is given depth, relatable dilemmas, and even natural human flaws. Even the Christians aren't perfect human beings! In the first two movies, every Christian was made to be flawless, perfect people with no flaws whatsoever. In God's Not Dead 3, they will make mistakes. They can get angry, they can do harsh things, but it's not done to a cartoony level. Instead, we actually see and understand why they did that, even if it was wrong of them to do that.\n\nAnd even most of the non-believers in this movie aren't evil! The movie even sorta encourages self-doubts, saying that God loves questions that need answering!\n\nI don't know what made Pure Flix change its direction and morals with this franchise, but I'm glad they did. What was once an excuse to hate on atheists is now promoting just the basics of kindness to everyone, regardless of faith.\n\nI NEVER EVER thought I'd be saying this, but go watch God's Not Dead 3. It's not only a pretty good Christian movie, but it's still shocking seeing as how it completely disregards the harmful messages of the first two films.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "That 11% is hilarious!  This was a great movie and I absolutely loved it!  Everyone should absolutely see it",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "If you haven't actually watched this movie, please don't make assumptions based on the previous two. They have gotten better each time. This one in particular blew even my very skeptical husband out of the water. It's complex, compassionate, funny, and I garunted not what you're expecting.",
            "review_date": "2019-03-02",
            "source": "rt"
        },
        {
            "content": "I thought this was the best movie of the series and was the most fun to watch out of all of them.",
            "review_date": "2019-01-15",
            "source": "rt"
        },
        {
            "content": "Great movie. Surprises. Intelligent debate about faith and tragedy. Honest look at Christians, their battles, failures and beliefs.",
            "review_date": "2019-01-04",
            "source": "rt"
        },
        {
            "content": "God's Not Dead with a Vengeance picks up right where God's Not Dead 2: God's Not Deader left off, and immediately drops that plot to take on college protesters. In the Marvel-esque end credits sequence of the previous film, mishap-prone Rev. Dave is arrested for refusing to turn over subpoenaed sermon transcripts. I imagine they had a treatment lined up about separating church and state, and the state limiting free speech rights at churches. (Separation of church and state doesn't apply when a teacher talks about Jesus is a public classroom, but does apply when a pastor should be allowed to speak with immunity about politics in church. The interpretation is always self-serving.) Unfortunately we never learned what the state was searching for in those transcripts, or what Rev. Dave had actually said in his sermons. One gets the feeling he was telling his congregation to get out and vote Republican. This story line is dropped in the first scene with a simple, \"It wasn't constitutional.\"\n\nWhat follows is a fairly dry story about an imminent domain case involving a church on a liberal public university campus. We know they're liberal because they go to parties featuring music with a bass beat that is distinctly non-Newsboys and have interracial relationships. After an atheist student accidentally blows up the church, killing the superfluous Rev. Jude in a series of events straight out of Final Destination, Rev. Dave must stand up to a college administration set on tearing down the church for a new student union.\n\nThis is actually a fairly sane movie compared to the others in the series. We learn Rev. Dave's social justice lawyer brother became an atheist after his family turned their backs on him when he was questioning his faith. The atheist student left his religion after his church's congregation nastily turned on his mother when she divorced an abusive husband. These are more realistic backstories than previously depicted, when atheists are depicted as bitter, resentful people who actually believe in God, but hate him. In another scene Rev. Dave's brother says, (I paraphrase) \"Christians have spent centuries persecuting non-believers, but as soon as the tide turns a little bit, they cry victim.\" The movie acknowledges Christians' own shortcomings and hypocrisy. The ending results in Rev. Dave compromising with the college to move the church off campus and delivering a message calling for mutual understanding.\n\nThe movie is still preaching to the choir, but is preaching a message they need to hear. As these movies get gradually better with each episode, I recommend they keep making them. By the time God's Not Dead 10 comes out, it will be win the Oscar for Best Picture.",
            "review_date": "2018-12-30",
            "source": "rt"
        },
        {
            "content": "This is becoming the Transformers of Christianity",
            "review_date": "2018-12-14",
            "source": "rt"
        },
        {
            "content": "This movie was actually better than its predecessor. The lead actor was good and loved John Corbett's performance. They lost me though by having Fox News commentator Jeannine Pirro do a cameo. She has been instrumental in causing division and spreading hatred, which is supposed to be the opposite of what this film was supposed to promote. Very sad and a disappointing.",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "Perhaps the best of the series, God's Not Dead: A Light in Darkness is a religious drama that tackles provocative and controversial social issues.  When a university uses an arson attack on a historic church as an excuse to remove it from the campus they set off a legal battle about religious liberty that ignites the passions of the community.  Unlike the other two films in the series (which have an ensemble style), the plot focuses on one central story.  Yet it still manages to address many of the issues that the Church and Christians are dealing with in an increasingly hostile culture.  Also, David A.R. White proves to be a pretty good actor and capable of being the lead; which is a considerable step-up from his supporting roles in the previous films.  God's Not Dead: A Light in Darkness is a nice capstone on the trilogy that's spiritually moving and compelling.",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "The film is very dramatic and I love that and, in my opinion, it surpasses its predecessors because here you feel something like the protagonist.",
            "review_date": "2018-12-08",
            "source": "rt"
        },
        {
            "content": "Really impressed, actually.  I was not expecting the third film in the God's Not Dead trilogy to be any good.  I honestly could not think of another unique story line, however, the film surprised me pleasantly.\n\nIt's really disappointing to see so many negative reviews here.  Do people really expect to go and see a Christian film without a Christian message?  I mean, most of the negative reviews here are more like copy and past \"if another God's Not Dead film comes out we'll post this on Rotten Tomatoes\" type comments.  They show a complete ignorance of the story line, the themes and the message.  \n\nThe acting was brilliant (it's great to see so many high profile actors/actresses willing to act in a faith-based movie) and the general quality of the film was great.  I found that it included many of the same dry humour elements that were included in the first two films (I love dry humour).  The script was also done very well.  The characters were REALLY genuine and I like how the Christians are not perfect and need to work through their own struggles just like anyone else.\n\nI'm also glad that there was not a third newsboys concert.  Not because I dislike newsboys, but because it would have begun to seem non-genuine and more like a popularity stunt by the third film.\n\nFinally, the message of unity and civil discussion (instead of a dogmatic \"us vs them\" mentality) was really relevant and refreshing.\n\nI could go on, however, I think you should just go ahead and watch the film to draw your own opinions.",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "The BEST movie about struggling with forgiveness.  When Pastor Dave's world was turned upside down he had to somehow use what he had preached for years and it was HARD to do. This movie is true to life of how faith in God gets you through, but you have to let go of bitterness and your rights and respond in love and forgiveness no matter what has been done to you. The portrayal is REAL and the process can be long. On a lighter note, the estranged brothers that live and work together is very funny and the actors play off of each other well like true brothers would. This is a must see movie!",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "I'm legitimately in shock. If you don't know, I absolutely hated the first two movies. All they did was make anybody who's not a Christian look like the most horrible people who ever lived. Those two movies relied on stereotypes and guilt-tripping to get their agenda across.\n\nGod's Not Dead: A Light in Darkness takes all of that, and throws it straight out the window. In fact, this movie is so different in quality and philosophically, that it actually feels like a reboot.\n\nEvery character in this movie is given depth, relatable dilemmas, and even natural human flaws. Even the Christians aren't perfect human beings! In the first two movies, every Christian was made to be flawless, perfect people with no flaws whatsoever. In God's Not Dead 3, they will make mistakes. They can get angry, they can do harsh things, but it's not done to a cartoony level. Instead, we actually see and understand why they did that, even if it was wrong of them to do that.\n\nAnd even most of the non-believers in this movie aren't evil! The movie even sorta encourages self-doubts, saying that God loves questions that need answering!\n\nI don't know what made Pure Flix change its direction and morals with this franchise, but I'm glad they did. What was once an excuse to hate on atheists is now promoting just the basics of kindness to everyone, regardless of faith.\n\n\nI NEVER EVER thought I'd be saying this, but go watch God's Not Dead 3. It's not only a pretty good Christian movie, but it's still shocking seeing as how it completely disregards the harmful messages of the first two films.\n\n7/10",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "This is way better then the other movies in the series. The message is powerful and shows how no person is perfect. It literally shows Christians struggling just like non Christians. Everyone messes up at some point in there life. I loved all of the lines/quotes in the movie. The movie deals with struggles of people often face today. The movie makes you think about how you are acting and treating those around you.I liked the direction they went with this movie and how they showed what true forgiveness looks like. This is a good movie and probably one of the best christian movies.",
            "review_date": "2018-09-23",
            "source": "rt"
        },
        {
            "content": "Great faith based movie. It is not the best one of God's Not Dead franchise (the 1st one is even better), but it is worthy to watch. Great actors and story. It is a great opportunity to share the Gospel worldwide.",
            "review_date": "2018-09-14",
            "source": "rt"
        },
        {
            "content": "Based in an alternate reality where Christianity is under attack by the non religious. Accompanied by poor acting and baseless arguments.",
            "review_date": "2018-09-06",
            "source": "rt"
        },
        {
            "content": "It shows the reality if how the Government and religion are constantly spreading apart on thier views. Yet, demonstrates that religion is about the Love of our Savior and that is not something we should forget, in all we do.",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "It gets interesting only when the two brothers interact, that's the most genuine part of the film. Found it somewhat weak, the main intention was to preach... in a manner that was relatively superficial. First Reformed, a recent film, also portraying the life of a priest is much more honest and influential.",
            "review_date": "2018-09-02",
            "source": "rt"
        },
        {
            "content": "The producer said they planned to make three of them and they did. maybe that is why this one feels like they work to hard just to made it done.\nIt's more artificial comparing to previous ones.",
            "review_date": "2018-09-02",
            "source": "rt"
        },
        {
            "content": "This movie is incredible, I think it may be the best one of the trilogy. It have amazing scenes, and the end is the best part. You must watch it, I think you won't regret.",
            "review_date": "2018-09-01",
            "source": "rt"
        },
        {
            "content": "nice clean movie with a positive message",
            "review_date": "2018-08-23",
            "source": "rt"
        },
        {
            "content": "There is this idea that movies have to be entertaining, fun, and Academy Award level or they get dismissed (e.g., The 15:17 to Paris). This movie along with the others in the series, in my opinion,  is not  meant to be those things but meant to inspire discussion on truth, morality, government, religion through stories that are based on real events and current events.  Spiritual ·Family Movie ·Inspiring ·Uplifting ·Great Ending ·Thought Provoking",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "Just watched this. It moves very slow but it's more of a thinking movie. Not an action.  Two brothers on opposite sides who come together for what they think is right.",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "The gap between the \"critics\"  and the audience soars when God is in the movie title. How about some value diversity RT?",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "It shows massive insecurity in the film's theme of steadfast faith when you have to reinforce its preachy dogma over the span of three movies when the point can be conveyed with a sentence (aka the movie title) .  Much like any profuse propaganda the zealots who peddle this kirk cameron-esque would be guilt trip are simply preaching to the choir as opposed to making a compelling duality for all viewers.  Having seen the first two eye rolling snore fests purely for irony's sake I can say they've reached new levels of passive aggressive narrative with this one.  Trying to make an argument that need not be made anywhere in a logical context much less in film, this movie struggles to find it's own voice within the fulminating lectures which is the rock the movie was built on wink wink. The pious incoherence does not merely stop at the heavy handed high horse morals; the technical aspects also suffer because of the obvious delusional state among cast and crew that god and his hoard of money waving evangelists will surely stifle skeptics and critics alike, making this nearly unbearable to watch.  I do not believe in god but if i did (as a believer in film) i would say this movie would make him die of embarrassment proving its own antithesis.  In summation god's not dead 3 is just god awful.",
            "review_date": "2018-08-20",
            "source": "rt"
        },
        {
            "content": "If it was called Allah's not dead then the critics would love it.  Libs hate Christians but love Muslims for some odd reason.  Considering Islam kills gays and make women second class citizens it makes no sense.  But, being a Christian movie I am shocked even 13 percent liked it.  Lib critics have zero objectivity when it comes to Christianity.  If you're a Christian go enjoy the movie.  IF you're a lib go sulk and watch your commie News Network.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "This is an insulting piece of trash, and I'm Christian. Every one of these movies shows Christians as the only good people in the movie. And, not to mention, it is painfully bad. Don't let the people defending this movie anywhere near young minds: as their blind following of anything that paints non-Christians in a negative light genuinely scares me. In fact, don't let children watch this at all. In fact, just don't watch this weird, religious, and painful movie.",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "Very related to these days problem. Having a good moral story. Even though rushed at few parts but still good at the end",
            "review_date": "2018-08-12",
            "source": "rt"
        },
        {
            "content": "stop lgbt society\nthis movie is amazing \nyou guys must see this!!!!\ndon't believe the score it just they did who don't like Christian movie.\njust watch it! and think...",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "Movie was not bad at all. Luv the ending, and U guys have more atheist fans than U know. Glad this one did not end with a long list of lawsuits - those kinda make me uncomfortable.",
            "review_date": "2018-06-22",
            "source": "rt"
        },
        {
            "content": "My sister told me this movie was a definite \"must see\", but it was very hard to \"must see\" it, when it only lasted in my state for 2 weeks total!!! I live in the state of California, and I am serious: it was GONE, after only 2 weeks of playing! The first week, I was busy with Easter plans. The second week, I was recovering from a severe sinus infection. I did not want to make everyone in the theater sick, like me, but after that 2nd week; Poof!!! It was gone!!! I think it got displaced by Isle of Dogs and Sherlock Gnomes! I am serious!!! So anyway, 2 months later, it finally resurfaces at the nearby discount theater, and I went to see it. WOW!!!! What a fantastic movie! This movie was wonderful!! How can anyone give it a tomato splat? I was crying, and so was everyone who actually, factually saw it. It speaks equally to Christians and atheists, and all other faiths, and gives equal air-time and footing. My background includes Christian-to-atheist-to-agnostic/deist-to-Christian again. When I was an atheist, I was pretty hardened against the Christian church, and it took me many years to recognize it was certain people, who claimed this faith as their own, who turned me away from God. Back then, I saw atheists and Christians as being \"at war\" over the future of this country, but I no longer see it that way, after living on both \"sides\" of this \"war\". We are ALL going to go through moments of doubt, we are ALL going to go through heightened moments of faith, in our lives. There is no need to go to war with other humans over our speculations and anticipation of the afterlife. Only with the help of others can we become enlightened in a journey every human takes, asking questions every human asks. I am happy to be able to raise my family in the same religion I was raised, only without those factors which caused me to doubt, in the first place. This movie had an excellent message which should be heeded: to let our kids question our beliefs and explore other faiths, and not shun them for it. To be open to new ideas, and to live out the humble life of forgiveness, gratitude, and faith that we want to see in others. Christians are to live like Christ, and the more we can do that, the stronger the Christian church will be, because others will see what it is which is the draw of the Christian faith. It is how this faith has survived for the last 2000 years. We have to be the light which shines, in the world. We have to be the light, in the darkness.",
            "review_date": "2018-05-14",
            "source": "rt"
        },
        {
            "content": "great movie! looking forward to purchasing when it comes out on DVD. ",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "should we be surprised  that non-Christians hate this film? They don't realize that word of mouth from the Christian community is what has moved this film.  Their \"Lip Service\" only serves to prove what they are - not what the film is.",
            "review_date": "2018-05-04",
            "source": "rt"
        },
        {
            "content": "Nonsensical propaganda that attempts to push the made up farce that there is a \"war on Christianity.\"  I am all for being proud of your religion; but, this movie serves only as an propaganda; and, an attempt to further divide this country along religious lines.  I can see this being a feel good moment for hardcore Christians; but, even as a Christian myself, this movie is just too much.  Don't waste your time with this nonsense.",
            "review_date": "2018-04-28",
            "source": "rt"
        },
        {
            "content": "amazing movie. Made me cry and a beautiful way to continue spreading the word of Jesus Christ and his teachings.",
            "review_date": "2018-04-27",
            "source": "rt"
        },
        {
            "content": "Cute movie!!! The story was pretty good and inspirational!!!",
            "review_date": "2018-04-25",
            "source": "rt"
        },
        {
            "content": "I thought it was well put together and had some Christian humor in there. Would definitely recommend and take family with.",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "the plot was interesting. the performances were outstanding, and the message was very powerful and biblical",
            "review_date": "2018-04-18",
            "source": "rt"
        },
        {
            "content": "Honestly the people who give a bad rating have no idea of what they’re watching, so it’s hard for the to value something hard to understand. Overall great movie, message is clear and powerful to make you think and change your heart! ",
            "review_date": "2018-04-17",
            "source": "rt"
        },
        {
            "content": "Loved the first 2 and am looking forward to seeing the third. I'd like to commend all the Christians who left respectful comments in regards to the obviously hate filled reviews. For people that claim to be so tolerant it amazes me how mean and disrespectful they can be to those with different beliefs. ",
            "review_date": "2018-04-16",
            "source": "rt"
        },
        {
            "content": "Well made movie reflecting the issues of faith, religion and secularism of our times. ",
            "review_date": "2018-04-15",
            "source": "rt"
        },
        {
            "content": "Better than it's predecessors but still not that good.",
            "review_date": "2018-04-14",
            "source": "rt"
        },
        {
            "content": "I saw the first of this series which for me marked the return of faith based movies to mainstream cinema. I didn't care for Pastor Dave then and he still seems to rub me the wrong way. After the monumental success of the first, Pure Flix has given us many very good movies which Pastor Dave (David A. R. White) has been responsible for. I still think he needs that one real star to hitch his wagon to.\n?He has the chops just not the draw.\nIf given a real Hollywood budget, I think Pure Flix can change the world.",
            "review_date": "2018-04-14",
            "source": "rt"
        },
        {
            "content": "Why the movie does have its problems, it has an excellent message and honestly I think we need more like it, It's not a Christian Persecution Fantasy, and it is generally emotional at times.",
            "review_date": "2018-04-13",
            "source": "rt"
        },
        {
            "content": "I was genuinely surprised that the third one was the best out of the series even though that’s not saying much",
            "review_date": "2018-04-13",
            "source": "rt"
        },
        {
            "content": "Nothing like the first movie. I was so bored, I walked out half-way through.",
            "review_date": "2018-04-12",
            "source": "rt"
        },
        {
            "content": "Awful movie waste of time. The people who made this and the people who love this movie are clearly brain washed. #Sad",
            "review_date": "2018-04-11",
            "source": "rt"
        },
        {
            "content": "Great Story, Great Acting, Great Cinematography! God's Not Dead: A Light in Darkness is amazing from the very first scene to the very last scene!",
            "review_date": "2018-04-10",
            "source": "rt"
        },
        {
            "content": "Awesome faith inspiring film!!!🙏🏿🙏🏿🙏🏿",
            "review_date": "2018-04-10",
            "source": "rt"
        },
        {
            "content": "I saw GOD'S Not Dead: A Light In Darkness!  This movie drives home the message in a very meaningful real way.  A Pastor's dilemma with understanding his true role and path, a young woman's search in a time of confusion, and a young man comes to terms with his a decision he made.  See this movie!",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "Good movie!! I think the first one is still my favorite because it's the most clear. I didnt really care too much for the second one but this third installment is very enjoyable! It had a good balance to it. A little slow but it had good acting, it was funny, had action, and was emotional! Good messages about forgiveness and faith! I really enjoyed this movie and I'd watch it again. These Christian movies are great because they're more than entertainment. They're inspiring and helpful...without the language and crude humor. ",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "Great Movie. My family and I loved this movie. ",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "This was a very encouraging movie for those who may be on the verge of giving up hope or thinking that God doesn’t hear or care. He does care and is ALWAYS listening. The way God actually works and the way ‘we’ think He should work with our finite minds is totally different. This movie depicts that well, as well as how forgiveness and ‘listening’ to one another can move God to act on our behave. Wonderfully inspiring! ",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Another religious propaganda film. On top of that, it’s just awful. Complete garbage. ",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Just went to see God's not dead at the AMC theater in Yulee . It was wonderful better than the other two, also one was really good .",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Great movie! And we know that God causes all things to work together for good to those who love God, to those who are called according to His purpose.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Greatly enjoyed this movie, thought provoking, tackling very real and painful issues that are relevant to any generation. Well worth the time to see it.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "God's not dead.  It's the brains of the people who made this move that are dead.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "Another religious propaganda movie trying to sway sheep back to the flock. As the world becomes less superstitious and more educated religion is dying. ",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "Could have been worse.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "The best of the series, completely believable.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "Good movie. Great en d ing.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "First ten minutes it is a little confusing to understand the plot and who are the main characters but after it get's going its an awesome movie about grace and justice and forgiveness!",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "I read the critics reviews and I see there's more  of an \"offensive\" side to their reviews; when simply they don't need to shut down such a great movie. The logic and plot is so real in today's world that people are so fast to be offended than to open their eyes and see what's happeing in front of them. Christ followers are always being humiliated and attempted to be shut down. All of these worldly things will pass away and no one who fought/fights for Christ will ever regret it. Hollywood doesn't see it that way therefore the reviews will never favor Christ based movies or logic. Definitely a great movie for anyone to see!",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "These movies have no continued story other than to share, God’s not Dead through situational story telling. Totally relevant and fun. Worth watching, but not quite big enough for the big screen audience. I’m not a deeply religious person and was invited to see this movie. It was enjoyable. This simple concept that , God’s not Dead can be continued with new stories over and over again and hopefully connects some people with the idea that god Is more than what one perceives. Just keep calling the films God’s not Dead and no need to numerate them since each story is unique. Sadly the struggle of this film in these times when people need a good message is that God is in the title and some people make up their own pre conceived ideas or prejudices. But what do I know, it’s just my opinion.",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "every testable claim on the existence of god can be shown false, likewise, this movie.",
            "review_date": "2018-04-06",
            "source": "rt"
        },
        {
            "content": "The series finally got it right.  It isn't us vs them, but it is about God's forgiveness, grace and love and how we need to that light in the darkness spreading God's love.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Great movie that shows our plans are not always God's plan. God didn't call  his church to fight but to love, that's how nonbelievers really know that God is not dead.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Had to take my children to this, Shows challenges that face Christians and how people make judgments before knowing the facts.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Great movie, very emotional and reflects todays times.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Thought this was the best of the three, with acting not as wooden as the previous two.  If you are going to see this one, you know what you are basically getting.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Really good move and message. The message of this movie, we are so rapped up in who is right and wrong. When we should be showing Gods love to one another. ",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "If people would open not only their ears and eyes but their souls to the Gospel, you would see this movie in a different light. God bless to ALL. ",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Not as good as the first one but better than the second one. That being said. This was still a good movie. So relevant in today’s world how Christians are being hated for what they believe. We need to stand up for what believe and now t let colleges or universities take away our church home because they don’t think it serves a purpose anymore. ",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "This is a moving and thoughtful movie. It deals with current issues Christians are facing today. So grateful these kinds of movies are being made. Thank you!",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "Very good. Highly recommend. By far best of the 3 movies in this series.",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "not as good as the first two, but still good!",
            "review_date": "2018-04-04",
            "source": "rt"
        },
        {
            "content": "Predictable, but good movie that isn't trashy to watch. Truly shows how God can work in your life even through the bad times.",
            "review_date": "2018-04-03",
            "source": "rt"
        },
        {
            "content": "God is not dead! Despite those in Hollywood who want to poke fun at believers , or call them crazy. God is still performing miracles in peoples lives and he needs to be brought back into schools. Kids being raised without God is one of the biggest calamities of the 21 st century. And it is quite evident in some of the tragedies occurring in our schools today. There are some hurting children out there who are acting out in some horrific ways. Some schools are pushing to have the 10 commandments back in the schools. Thank God for movies like this!",
            "review_date": "2018-04-03",
            "source": "rt"
        },
        {
            "content": "Anyone who likes it is biased. Period.",
            "review_date": "2018-04-03",
            "source": "rt"
        },
        {
            "content": "I dont care what the critics say. There not directing the movies to white christians and all the other bull. Its like they all missed the moral of the story which is that belielf in god is your choice and no one should have a say in your belief. No matter your Race! The Movies point out that god (any god you belive in cause even people who aren't Christian or Catholic can relate to the hate and hurt shown in this movie) will give you a life full of challenges but u hold to strength belief and hope you can overcome anything but if its your tine to go then go in peace with whatever you hold dear. Change the word god to any other belief and these critics will have the same ideal. But if you change the word god to what you believe in and what the christian god has done for his followers to what your belief does for your followers then is the movie not sending the same message. LOVE- HOPE- BELIEF",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "Powerful message!!!!",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "Awful! Very preachy, waste of time. Do not see.",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "It was a great movie. I personally like it better than the other 2",
            "review_date": "2018-04-02",
            "source": "rt"
        },
        {
            "content": "Loved this movie!! Real life issues - good acting - so much better than so many main stream movies today which are violent, hopeless, and denigrating to society.",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Gods not dead 3? R u kidding me? We get it. God is alive so why not just call it gods alive. But what I want to know is is it appropriate for man to probe himself with bible? It’s literally inserting the holy word of god into an area of pleasure so what’s wrong with it? ",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "One of God’s greatest gifts is a free will. It can also be the most dangerous. This movie shows both sides of forgiveness. A great movie. ",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "An interesting plot, good actors, but there were some obvious mistakes in emotional responses of characters and plot logic. However, the plot kept me interested enough to get an emotional payoff in the end. Strangely enough, I think this film could be made better just by recutting some scenes so they made more emotional sense.",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "\"God's Not Dead: A Light in Darkness\" (PG, 2:00), also referred to as \"God's Not Dead 3\", is the third movie in the GND franchise, but the series is... evolving. 2014's \"God's Not Dead\" was mainly about attempting to prove God's existence academically (in a series of debates between a college student and his atheist professor). 2016's \"God's Not Dead 2\" tried to prove it in a courtroom, within the context of a plot that was more involved (but ridiculously unrealistic). This third GND film goes even further into concentrating on story development and abandons any attempt to prove God's existence through facts and logic. In this one, the director and writer of the first two are replaced by writer-director Michael Mason. It's Mason's first feature in any capacity, but his efforts give us the best executed GND yet.\n\nThe film picks up immediately following the post-credits scene in \"2\" in which Reverend David Hill (David A.R. White) is arrested for refusing a court order to turn over transcripts of his sermons. David's brief incarceration is fodder for news and talk shows, carrying forward the GND narrative that Christianity is under siege in modern America. David's church has become a source of political and social division in this small-town Arkansas community - and for the (fictional) college on whose land the church stands.\n\nWhen a female coed named Keaton (Samantha Boscarino) breaks up with her boyfriend, Adam (Mike C. Manning), over religious differences, Adam takes out his frustrations by throwing a brick through a window of David's church. That single impulsive act has unintended but serious consequences which give the college an excuse to offer David a check to buy the building - and to use an eminent domain claim to try to force him to accept. This sets up a battle royale (legal and otherwise) between the pastor and one of his best friends, Hadleigh University chancellor Thomas Ellsworth (Ted McGinley). David gets his estranged brother, Pearce (John Corbett), to take a reluctant break from his Chicago law practice and come down to Arkansas to help. But in spite of all the help David gets from his irreligious brother, and the support he gets from his new girlfriend (Jennifer Taylor), he wonders why he hasn't heard from God.\n\n\"God's Not Dead: A Light in Darkness\" is more enjoyable, more relatable and more relevant than the previous GND movies. This one isn't nearly as preachy as the others (not even allowing anyone a comforting \"He's with Jesus now\" when a main character dies), settling for trying to prove God's not dead by showing how alive he is in the lives of his followers. In doing so, Mason puts forth a story that is dramatic and accessible enough for a broader audience to appreciate - including well-written dialog and excellent acting. In the end, the film's point of view is very clear, along with an even more wide-ranging message about the need for listening over talking, unity over divisiveness and love over hate. \"B+\"",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Great movie and very entertaining!",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "A really good movie. I'd almost bet that most of the negative reviews are from non-believers that haven't seen the movie. ",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "I thought this was the best entry to the series. It shows a man of God as a human as he deals with the circumstances that tests his faith. Loved this film and will go see it again.",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Amazing how powerful the message of forgiveness is! Loved the movie, well acted, well made. The world needs to hear this message",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Really good message especially for these divided times! Great Easter flick!",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "The movie was well done, but the ponit of the movie really had the exact same meaning of the other two. ",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "I was pleasantly surprised after the rather mediocre victim mentality focus of God's Not Dead 2. I think they redeemed themselves with this story and the focus on love and unity after Jesus Christ's teaching. It touched on the devisions of the world between beleivers and nonbelievers and perspectives from both that showed we as humans are deeply flawed and our understanding or ignorance comes more from the core sensibilities of our heart and soul rather that the religion we ascribe to. Overall I liked this God's Not Dead 3 movie the best, the first one was pretty good as Well and if you have interest in the speculative questions between faith in God or beleif in happenstance it broached these questions sensibly.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "I've not seen the other two movies in the franchise, but I loved this movie when I wasn't expecting to like it. Downside was chewing my nails down to nothing when it was stressful. The movie shows Christians living life, making mistakes and finding a way to live their faith in a very real way.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "This movie far exceeded my expectations!! It was more raw, more real, more exciting than I expected- As a writer myself I tend to pick apart story lines and plot twists...this movie is gripping and intense, yet with humor well paced the viewer is drawn in to the story. As a Christian I can say this movie has me rethinking some of my responses. Run-don't walk to see this one!!",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "needs to be more evenly paced the movie drags too many family conflicts going on should have stuck with one main story and two subplots I wish I had a fast-forward button. this would be a perfectly fine Redbox or on demand rental",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "This was a well done movie, with a surprise and tastefully done, needed ending.  Bring friends and family to this...and stay through the credits for a bonus clip!  *****",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Amazing movie! A must see for anyone!",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Another paranoid movie for right wing crybabies. ‘Everybody is out to get you!’ Is the theme. The college is out to get them here - which is retarded since EVERY college in America has a chaplain & a church. Funny how ‘christians’ are the ones supporting child molesters like Roy Moore and rapists like trump but they feel the need to judge others. Too bad nobody does come for the right wing fascists, it would MAGA to flush them from society.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "God's not dead part 3 a lightin the darkness was a great film! Don't listen to this review - go see for yourself! We",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "The best of the three Films in the God's Not Dead Films series. A perfect film about forgiveness and the times we currently live in. A must see film over the Easter holiday. It's not surprising that many \"critics\" don't like the film, guess there is not enough nudity, swearing or other non essential things for them. Don't listen to the professional critics, they were never going to like the film anyway!",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Not surprised the liberal critics didn't like it.  It's another good one for the series.  It didn't go in the direction I had hoped it would and got a little PC-ish but I'm still looking forward to the next one that the critics will pan and the audience will like.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Three is a charm!  John Corbett was fantastic.  I also found the movie kept me wondering how the struggle would finish to the very end.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "God Is Not Dead 3 - Quick Review:  HIGHLY RECOMMEND! Don't believe the negative critics who pre-judge MOVIES based on a pro-Christian subject. Frankly I could not stop watching any part of this movie...it drew me in! This movie is poignant, uplifting and funny and very well done! David AR White (Pure Flix) takes the lead role of the pastor DAVE HILL who is hit with how to deal with his university-based church being burned down in an act of anger.  The university decides to go legal to shut down DAVE's church after the burning to \"create less stress for students\"...sound familiar, church?  Pastor DAVE is conflicted with how to solve it. He wants to do the right thing but has to deal with some doubts and head one spiritual attacks. How it resolves is Biblical and full of wisdom from the Holy Spirit. John Corbett (My Big Fat Greek Wedding) plays PEARCE his very funny older brother/lawyer who lends a hand but gets drawn back to faith in God (slowly).  From the time it started until the last scene, I loved EVERY part of it and wished it would have been longer.  The script in this movie must have taken a long time to create...and it was done with skill. It's packed with unexpected twists, tight subplots and plenty of humor to balance out this serious subject (especially PEARCE's character).   There are no inappropriate parts at all.  Teen reaction: I saw this movie with my teens.  They both loved this movie!  https://godsnotdead.pureflix.com",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Good solid movie about difficult themes. This is an interesting treatment Christian movie, in that everything doesn't end in a perfect little bow, just because we pray. Real problems, portrayed well, with good acting, by good actors. Less crusade than the first two GND movies, more story. Good choice!",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Even though it wasn’t a very good production, the movie was a good reminder of what authentic Christianity is all about - reaching out to hurting people in forgiveness and love. It’s not about always being right or always winning. After all, Jesus didn’t stand up for Himself or call a legion of angels to His aid. Instead, He laid down His life willingly for the sake of the people who drove the nails in His hands. This movie tries to portray that kind of an attitude. Unfortunately there is an art to creating poignant moments on the big screen. This movie encompasses many such moments, but they fell short. Good story, but another mediocre production. ",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Poor screenplay, less than mediocre acting, and film style was like a drama cable TV show, similar to ones on the Hallmark Channel. I am a Catholic so I am basing my review on expectations of a big movie release rather than on my political and religious views. This movie would probably have been better off being released straight to cable TV. Not recommended for the avid theatrical movie fan.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "God is alive! Negative comments are openings for discussions and not a sign of an ending. Just remember, they spent the same money as I did to seek answers to their questions. This movie was a first of this trilogy for me and it shared with me both heartache and wisdom. No one pushed a belief one way or the other on me but allowed me to share how people felt and how they got there. The rest was up to me. A great way to spend time with my daughter on Good Friday during hours while Jesus historically reported to be on the cross. Please ignore rating and make your own decisions. It was not boring or a waste of money but it allowed my daughter and I to open our own discussion. Giving it the four star was more of a comment on the trilogy and would have like a small history of previous disputes but that’s me not the movie missing the point. ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Loved the film. One of the best ones that God’s Not Dead has produced. Lots of emotion and messages! ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Good message about forgiveness but I liked \"I can only Imagine\" better. John Corbett was superb as Pearce.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "God Made Me Vote 5 Stars!",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Great movie, very much touches how people react to religion but does  not go as far as it could. There is a lot of hate targeted at Christians, as can be seen and witnessed by some  of the reviews posted here that are purely in the interest of hurting this film because it is Christian . Thank you",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Yet another garbage jesus movie, for his human-garbage sheep. I they had minds, then they'd have hearts unfortunately they have neither.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "\"Jesus was the ultimate social justice warrior\"\n\nlol get outta here with that garbage.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "If you’re looking for 105 minutes of religious pandering, and a bad movie, you’re in the right place ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "It was a good movie.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Not the best in the “God’s Not Dead” trilogy, but still a good movie and deserves better ratings. Shows that even our religious leaders are still human and prone to human emotions and misunderstandings. Addresses current hate in this world. Only 4 stars due to being quite political.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Definitely worth seeing. It shows the importance and power of God's love and grace. Does a good job illustrating the struggles that Christians are going up against in today's world and how God is able to guide us and bring us together through it all.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Great movie, and please ignore all the atheist giving this movie a bad rating because they’re angry at the world. To all those atheist posting on here. Jesus will love you when you’re ready for his Love. ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "I always laugh at the critics. They so predictably hate Christian movies.\nWe LOVED this movie. It's well written, well acted, and it's challenging as a Christian.  If you're not a believer I still really recohmmend it because it shows our himan side and how just because were Christian's doesn't mean we don't have questions or that we don't struggle to act like Jesus when things get hard.\n\nIt's a great movie.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Powerful and relevant in an unprecedented time of division. Loved this movie. ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "It's just a feel-good Christian film, but I'll admit that it's better than the previous two.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Embarrassed of Christians who will like this. Pastors shouldn't make movies. Do yourself a favor and pretend it doesn't exist",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Religious propaganda for those who feel their religion is being attacked. Thankfully less and less people are falling for these large, corrupt, deceptive, and incredibly harmful religions. Just be yourself, dont hurt others, be kind, take care of each other. I dont need a funny hat and robes while I sit on a throne of gold to tell you whats right and wrong, good or bad. ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Not near as good as original. Original was debate between prof & student over existence of God. This one gets into geo-political conflict over a church on college campus & whether it can be removed legally or strong-armed.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "if you thought the first movie was offensive, this one almost feels like apology. story of finding a middle ground and loving like Jesus.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Excellent, in a time of regressive left wing agendas and immorality its good to see a movie with truths.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Finally a well told story that makes you laugh and entices you into a engaging story. For the first time in a long time I was surprised I couldn't guess what would happen next.  Its 100% different than the previous 2 versions and well worth it.",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "I feel the message was lost in this film, also I wasn't to happy with the fact to make believers in the young adults pastor dave gives into their wishes so they would believe",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Imaginary God that no one can see or here? pathetic grownups with imaginary god friend. God is a Mental illness that can be cure with Facts over beliefs. ",
            "review_date": "2018-03-30",
            "source": "rt"
        },
        {
            "content": "Most of the rating the movie haven't even seen it. You hate movies about God then yea you probably won't like it. It is well made and worth seeing.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "god might as well be dead after seeing this loser flick.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "Keep trying to push this story. LOL",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "It’s amusing how many atheists love to make their opinion known about Christian movies even though they haven’t seen them and won’t go see them. I can’t wait to see this – so happy movies are finally being made that we can take our whole family to see and don’t have to worry about what’s going to be said or shown. I Can Only Imagine was a fantastic movie whether you are a believer or not. If you don’t believe please be respectful of others’ beliefs. Why are you fighting against something you say doesn’t exist? Thou doth protest too much!",
            "review_date": "2018-03-28",
            "source": "rt"
        },
        {
            "content": "Great movie for the family!!! Following along with the previous ones!!",
            "review_date": "2018-03-28",
            "source": "rt"
        },
        {
            "content": "How many of these dumb movies are they gonna make?",
            "review_date": "2018-03-28",
            "source": "rt"
        },
        {
            "content": "Great movie... low rating is not true to the movie!! Read comments and you’ll see why!",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "adequate, positive presentation. light on spirituality. humanist maybe?",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "Let me summarize this movie and save you some time:\n\n\"If you're pro-choice you're a BABY KILLER! Arrest somebody!\"\n\"Gays and Lesbians are UNNATURAL ABOMINATIONS! Stop them from getting married!\"\n\"Atheists are amoral agents of Satan! Put GOD in the schools and courts! Show them we're a CHRISTIAN nation!\"\n\"Somebody BAN this Obscene 'art exhibit!'\"\n\n(Us) \"If you want to believe in God and teach your kids about Christianity, that's your right. Please just let the rest of us make our own choices too.\"\n\n\"STOP PERSECUTING me! STOP DISRESPECTING MY BELIEFS! WHY are you WAGING A WAR AGAINST CHRISTIANITY!?\"",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "Stupid brainwash propaganda. ",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "If Gawd's not dead yet, she's probably rolling her eyes at this faux-persecution melodrama. ",
            "review_date": "2018-03-27",
            "source": "rt"
        },
        {
            "content": "I don't understand the low rating on this movie. It was very well-acted it had a powerful message about forgiving those that hurt us. I would highly encourage people to go and see it is very much for seeing and as good as the first two in the series.",
            "review_date": "2018-03-26",
            "source": "rt"
        },
        {
            "content": "The fact that this movie franchise is still around proves, that in fact, God is quite dead.",
            "review_date": "2018-03-26",
            "source": "rt"
        },
        {
            "content": "if God is dead then God was once alive if God was once alive he is still alive because God is Almighty",
            "review_date": "2018-03-26",
            "source": "rt"
        },
        {
            "content": "You’re right, “god’s” not dead, because “it” was never alive, or real for that matter. Let’s keep “god” and religion out of the movies, just like facts and logic are kept out of religion.",
            "review_date": "2018-03-23",
            "source": "rt"
        },
        {
            "content": "Amazing to me how the low score reviews out there are so negative and heated. Why so angry? Does this movie hit a nerve? It’s like any other movie. It tells a story. If you have such distaste for this genre why have you seen all three?! GND3 is a great movie and you don’t have to worry about watching in mixed company or being made uncomfortable because of its content. A lot of hard work, blood, sweat and tears went into the filming of this movie. Also a lot of love. It’s easy to sit behind a phone or computer and bad mouth something you don’t like or that makes you uncomfortable. Those reviews are not honest reviews. You are rating a movie on your distaste for religious reasons or personal past experiences. We want a review on the movie. Good story line...YES——-it also has some excitement and some life/death situations. It’s s great movie and has a good message. ",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "I enjoyed the film. It was a good reminder that it's more important for Christians to let people know what they are for, not just what they're against.",
            "review_date": "2018-03-19",
            "source": "rt"
        },
        {
            "content": "This kind of self victimization is why white Christians think they are being prosecuted. It’s hard to look like a victim when you are constantly trying to step on my neck. ",
            "review_date": "2018-03-16",
            "source": "rt"
        },
        {
            "content": "The film focuses alittle too much on comedy but still is focused on major issues that gotta be dug into to prove God.",
            "review_date": "2018-03-14",
            "source": "rt"
        },
        {
            "content": "Personally, it is my favorite God's Not Dead movie. It is relevant, it deals with real flawed people, and finding our faith through it all. The characters are all relatable and I can see myself in them. Go give it a watch!",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "The whole series of God’s NOT dead movies have been an eye opening experience for people of all walks of life.. not just Christians.. the Bible prophecy of the last days are being fulfilled right before our eyes today .. people need to wake up and I pray the lost will realize Jesus is the only way to external life!! ",
            "review_date": "2018-03-10",
            "source": "rt"
        },
        {
            "content": "Movies such as these that ultimately have a better showing than those that push what hollywood frantically wants to believe we want to see, is what sets the realist from those with their heads in the sand.",
            "review_date": "2018-03-05",
            "source": "rt"
        },
        {
            "content": "I think overall this film was horribly thought out and planned,it was horrible i'll give it 3 stars because of the hope and grace put all twords Jesus Christ.",
            "review_date": "2018-03-05",
            "source": "rt"
        },
        {
            "content": "God's Not Dead 3 is good but wants one and two first",
            "review_date": "2018-03-01",
            "source": "rt"
        },
        {
            "content": "I love these movies because they are true to life movies. They deal with daily problems. there may not be gunplay or exploding cars. these movies are about life emotional and spiritual dilemmas that every person faces some point in their life. ",
            "review_date": "2018-02-24",
            "source": "rt"
        },
        {
            "content": "Great at dealing with legit struggles of overcoming difficult situations during times of divisiveness and hypocrisy, while being more introspective than the rest of GND movies. Ultimately a powerful story of hope and forgiveness.",
            "review_date": "2018-02-24",
            "source": "rt"
        },
        {
            "content": "Not as good as the first one. ",
            "review_date": "2018-02-20",
            "source": "rt"
        },
        {
            "content": "Better than the first two.",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "Main message is to remove The Church from our education / kids and the movie actually makes that conclusion, that’s the compromise it makes... Really! We give up on our kids to show compassion and to stop arguing? That’s the solution? :(",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "In order for god to be dead he’d have to exist in the first place. Peoples beliefs in fairy tales within the age of science never fails to boggle the mind. Ignorance is strong with this film, may I recommend the science channel instead. ",
            "review_date": "2018-02-16",
            "source": "rt"
        },
        {
            "content": "well I see most are bashing the movie or really not paid attention to the last 2 parts of the film. this movie is more like a show that leaves you hanging, especially when in part 2 the pastor was arrested. this keeps you going and wondering what will happen? but then again no one ever question Spiderman, Avengers, etc. they make more killing in box office, why not Christian industry. ",
            "review_date": "2018-02-15",
            "source": "rt"
        },
        {
            "content": "Another one? As a Christian I have to say that these films are some of the most stereotypical and crappy films of this generation. Just stop. This isn’t helping people see God. If anything, this makes Christians look like evil people who hate anyone who doesn’t have the same beliefs. I’m done with these “film” (calling these things Films is an insult to the term, sorry)",
            "review_date": "2018-01-20",
            "source": "rt"
        },
        {
            "content": "God's Not Dead: A Light in Darkness completes its trilogy with more faith-based earnestness but squanders its empowering moments with a bad script, sub-par acting, and rehashed ideas.",
            "review_date": "2018-01-18",
            "source": "rt"
        },
        {
            "content": "Once more the morons need to attack higher learning, just like the first one.  Stupid question: what do they hope to accomplish with yet another unnecessary sequel?",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Another pure Christian propaganda film.I can't wait to the Bible Reloaded and atheist community on youtube rip a new asshole in Pure Flix.  #God is not real",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "I'm a huge fan of the 'God's Not Dead' movies and have really enjoyed all of them, but I have to say I felt this one was the worst out of the lot and quite lack luster. Such a shame.",
            "review_date": "2016-11-26",
            "source": "rt"
        }
    ]
}