{
    "rating": 9.3,
    "release_date": "2018-12-14",
    "num_reviews": 730,
    "genres": [
        "Kids&family",
        "Action",
        "Adventure",
        "Comedy",
        "Fantasy",
        "Animation"
    ],
    "summary": "Bitten by a radioactive spider in the subway, Brooklyn teenager Miles Morales suddenly develops mysterious powers that transform him into the one and only Spider-Man. When he meets Peter Parker, he soon realizes that there are many others who share his special, high-flying talents. Miles must now use his newfound skills to battle the evil Kingpin, a hulking madman who can open portals to other universes and pull different versions of Spider-Man into our world.",
    "reviews": [
        {
            "content": "One of the top animated movies of all time. Action packed amazing story just everything you want from an animated action movie!",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "really liked the movie",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "a super movie 10/10 :D",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "Very messy, lame, used same backstory for every spider character.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "The animation was amazing. The plot and plot twists were crazy as well. Definitely a must watch for anyone",
            "review_date": "2023-04-21",
            "source": "rt"
        },
        {
            "content": "An energetic and fast-paced action movie full of wit and style. It's easy to see how this movie inspired many animated films to come with its impressive and highly stylized visuals. The story is also well written and the characters are full of personality. If you want an exciting show, this is highly recommended for all ages.",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "The soundtrack was great, and the animations were fresh. The plot was exciting. All round a great Spider-Man movie.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Este filme é brilho para os meus olhos. \nQue animação fantastica meus senhores. Sinceramente só por conta da arte feita na animação e a trilha sonora, já são dignas de falar que o filme é sensacional.\nA história é boa, mas a arte do filme que surpreendeu demais.\nEu assisti este filme 2x no cinema, de tão legal que ele é.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Action-packed and beautifully animated- a must watch.",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "Good movie just not the biggest fan of marvel cartoons/anime",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "Best animated movie I've ever seen. A revolutionary take on a story that's been told plenty of times; it stands out in the Spider-Man franchise.",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "one of the GOATS of all movies!",
            "review_date": "2023-04-10",
            "source": "rt"
        },
        {
            "content": "This movie is just great cant wait for across the spider verse.",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "Never understood the obsession with this movie. Found it quite boring and the animation gave me a headache. My son asked to leave halfway through. Couldn't be bothered to finish it. I love Spider-Man but this did not live up to the hype at all.",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "This film takes animation to new heights with it's comic book style and gives a heartfelt, compelling story at the same time, making for an epic combination for Spider-Man as a whole.\n\nRating: 97%",
            "review_date": "2023-04-08",
            "source": "rt"
        },
        {
            "content": "so amazing, it's my comfort movie. I always go to it when I'm sad. likeable characters, and the ARTSTYLE?? so cool?! hello?! they made this movie look so cool and I enjoyed it alot",
            "review_date": "2023-04-08",
            "source": "rt"
        },
        {
            "content": "The best movie of superheroes",
            "review_date": "2023-04-07",
            "source": "rt"
        },
        {
            "content": "This movie is a masterpiece the animation and story really make it perfect! Excited for the second movie coming out this year",
            "review_date": "2023-04-07",
            "source": "rt"
        },
        {
            "content": "One of the best super hero movies ever made!",
            "review_date": "2023-04-07",
            "source": "rt"
        },
        {
            "content": "It's a movie that exceeds your expectations by 100x it's a really great movie well written, the animation, colors, soundtrack, characters, and comedy no flaws in my opinion.",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "An otherwise perfect movie. The best Spider-Man movie to date. What more is there to say?",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "This movie is a revolución of animation the animation is unique the story everything i love it masterpiece",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "Vaguely psychedelic.  i think spooder man bit ashton's uncle",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "Outstanding Story Telling with an insanely creative mix of comic book animation. I went in with no expectations and was genuinely floored by this movie. 100% on my scale.",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "Perfect movie if you don't think it's amazing you're mentally insane",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "Horrible. Generic story, horrible animation style and hardly focused on Peter Parker's Spider-Man.",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "The perfect movie. Full stop",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time.",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "Not as good as puss in boots the last wish but still good.",
            "review_date": "2023-03-27",
            "source": "rt"
        },
        {
            "content": "sin dudas la mejor película animada de spiderman\n( aunque eso no es muy difícil),sin dudas esta en el podía de mejor película de spidy en general y fácilmente de las mejores películas animadas en todos los tiempos ,revoluciono la animación con su increíble animación bueno en realidad sus excelentes tipos de animación ,la historia típica en spiderman entretenida y motivadora que deja un buen mensaje ,fresca ? por supuesto de las producciones mas frescas que e visto ya sea animado , live action ,película o serie.",
            "review_date": "2023-03-26",
            "source": "rt"
        },
        {
            "content": "leap of fate just tell you everything",
            "review_date": "2023-03-23",
            "source": "rt"
        },
        {
            "content": "four years later, this movie is still great, and at this point, I can confirm that it has started a new era for animation movies with puss in boots, Mitchell vs machines, and bad guys all following it with unique animation styles",
            "review_date": "2023-03-21",
            "source": "rt"
        },
        {
            "content": "Best animated movie of all time!",
            "review_date": "2023-03-19",
            "source": "rt"
        },
        {
            "content": "Amazing. Spectacular. Sensational. Superior. These words have all been used to describe the character of Spider-Man. They can all ALSO be used to describe ‘Spider-Man: Into the Spider-Verse'. The film follows young Miles Morales who, after being bitten by a radioactive spider (sound familiar?), starts on his thrilling journey to becoming the new Spider-Man! Along the way he encounters several alternate, dimension-displaced versions of Spidey. These Spider-People include an older, jaded Peter Parker, Spider-Gwen, Spider-Man Noir, Spider-Ham (Yes, he's a pig), and Peni Parker (along with her biomechanical suit called SP//dr). The story is uplifting, inspiring, and hilarious, with the message that \"Anyone can wear the mask\". The animation style is unlike anything I've ever seen before. The film looks like a comic book come to life, and it was captivating and mesmerizing to watch. It really is a \"comic book movie\"! I left the theater feeling like I had just witnessed something truly special. The cast and characters were all FANTASTIC, but my favorites were Spider-Ham and Spider-Gwen. The villains were all menacing and intimidating, which I feel is rare in an animated film. The music was also incredible and complimented the film PERFECTLY. In conclusion, ‘Into the Spider-Verse' is an emotional story about believing in yourself and becoming who you were meant to be, regardless of any obstacles that may be in your way. It doesn't matter who you are or where you come from...you can be a hero. YOU could wear the mask. It is not only the best Spider-Man movie thus far, it's my new favorite animated film and one of the greatest comic book movies of all-time.",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "Into the Spider-Verse\" is an outstanding animated film that breaks new ground in the superhero genre. Its animation style is a unique blend of 2D and computer-generated animation with a comic book aesthetic that makes the visuals dynamic and vibrant. \n\nThe story is both emotional and action-packed, following the journey of Miles Morales, a young boy who gains spider-like abilities and becomes Spider-Man. When a group of villains threatens the fabric of reality, Miles teams up with other versions of Spider-Man from different dimensions to save the day. \n\nThe characters are well-developed and have their own distinct personalities and backstories that make the story even more compelling. \n\nOverall, \"Into the Spider-Verse\" is a must-see movie for superhero fans and anyone who appreciates exceptional animation and storytelling.",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "Beautiful animation and an amazing story. I loved it",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "Visualmente asombrosa y surrealista, esta película es una obra de arte por su combinación de animación tradicional y CGI. Aunque esta película fue realizada por Sony, no hay duda de que esta es la que da inicio al concepto del multiverso en la filmografía de Marvel, que luego comenzaría a ser aplicado en el MCU relacionándola con la trilogía de Spiderman de Sam Raimi, la saga de The Amazing Spiderman, la saga de X-Men y el SSU. Claro que el multiverso empezó a usarse en los cómics y ahora se usa en las películas, expandiendo la filmografía de Marvel de una manera alocada y excitante. Además esta película aclara una incógnita sobre que pasaría si Peter Parker en algún momento se iría y quien lo reemplazaría. La respuesta aquí es Miles Morales, quien también recibe los poderes de casualidad. Incluso también nos presenta otro Peter cuya historia sirve para responder que sucedió después de la saga de The Amazing Spider-Man luego de que Gwen muere, y también una historia alterna sobre si, en vez de Peter, hubiese sido Gwen quien recibiera los poderes, al igual que Peggy Carter en What If?. Otros puntos más a mencionar son la escena post créditos que conecta con la serie animada de los años 60 y la enemistad entre Wilson Fisk y Spider-Man que recuerda a la serie animada de los 90. Esta película y su secuela dejan abierta la puerta de que todo es posible en el multiverso sin excepción alguna, tal como se ve en el MCU lo cual tiene una enorme importancia en la filmografía de Marvel. Spider-Man: Into The Spiderverse es sin duda la película ideal para comenzar a conocer el multiverso una vez ya visto las películas y series que Marvel hizo anteriormente y comenzar este viaje multiversal que para alguien que le gusta Marvel es un hermoso sueño húmedo. Mi calificación para esta película es un 9/10.",
            "review_date": "2023-03-11",
            "source": "rt"
        },
        {
            "content": "Do I even need to explain? It's spider verse everybody loves spider verse and if you don't you're mentally deranged",
            "review_date": "2023-03-11",
            "source": "rt"
        },
        {
            "content": "This was literally the greatest movie I have ever seen. Everything about it was perfect, and although I already loved spider-man, this movie cemented him and specifically Miles Morales into my heart. An absolute must-see, I recommend this movie to anybody and everybody. You will not regret seeing this",
            "review_date": "2023-03-10",
            "source": "rt"
        },
        {
            "content": "This was such a great story and take on the Spider-Man character. The main character of Miles had a lot of growth and a really good origin story. I loved the animations and how they benefited the movie and the story.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "Best Spider-Man movie ever made. The animation is great, the writing is amazing, the story is fun and there is more multiverse madness in this than in Doctor Strange 2.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "Spider-man: Into the Spiderverse is an absolutely incredible film; iconic and influential for any animated film going forward. I highly recommend watching this movie if you're a film connoiseur of any kind.",
            "review_date": "2023-03-08",
            "source": "rt"
        },
        {
            "content": "9.6/10\n……………………………..",
            "review_date": "2023-03-08",
            "source": "rt"
        },
        {
            "content": "This was really good!! One of the best animated movies that I've seen in a long time. It was so brilliantly done visually. You can tell that they were attempting to make the movie look like a comic book. They made it work, and the result was amazing. Visually stunning.",
            "review_date": "2023-03-03",
            "source": "rt"
        },
        {
            "content": "This is one of the bast animated films of all time. It never gets old even after the many many times I've watched it. It a family favorite the way the art and character development is portrayed is awesome.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "This is one of if not the greatest movie I have ever seen, the animation was ahead of its time, the humor and plot where at and almost perfect balance. Rewatching this recently has brought back the chills from seeing the movie the first time.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "The animation is a total game changer, filled with so much style and personality, but you already got yourself characters with a level of depth to them. It's funny, smart, emotional, love it!",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into The Spider-Verse is a fun and heartbreaking movie with the best animation I've ever seen in a animated movie ever!",
            "review_date": "2023-02-25",
            "source": "rt"
        },
        {
            "content": "Amazing animation. Interesting idea with the multi-verse. The multi-verse is overplayed nowadays but it was pretty fun here.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "Sony's Spider-Man: Into the Spider-Verse is the definition of the perfect movie. It may not be my favorite but it's hidden with lots of details. From the animation frames to the story and character development it's perfect.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "The fusion of comic style and 3D animation created a fresh feeling and was very good👍\n It is a work that makes you feel new by including the way of shooting nowadays.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "When talking about into the spider verse, i could say everything that makes it so spectacular, amazing, astonishing, but why bother. You know what makes this movie so great. The animation. HOLY CRAP, the animation!! The color, the harmony between 2D and 3D animation, as well as the other small details. You can watch this movie 20 times and you will still notice new details. I have watched it almost 10 times now and i still noticed new details, and the thing is that there is a lot more that is great about it. The story is well told, the characters are well fleshed out and everything else is so fantastic. If you haven't watched it, what the hell are you waiting for? Watch it!!",
            "review_date": "2023-02-11",
            "source": "rt"
        },
        {
            "content": "The best animated movie I ever saw. With a heart melting story of the kid that becomes a hero that still resonates with me after all this years. An amazing soundtrack and a visual style that set a change in the whole industry is a must watch for everyone!",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "This is a great spider-man film.The animation and frame rate is so unique and honestly is impressive.Miles gets so much good character development both in the movie and in the real world.The spider-verse is so awesome and the cool different  Spider-people is awesome.The finale is great and this movie is also really funny.Can't wait for the 2 upcoming Spider-verse movies. -10/10",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "This is one of the best Spider-Man movies ever made, will watch it anytime im bored, an absolute must watch",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "Phenomenal animation style. The story plot is actually decent. Some characters are underdeveloped like Pork Parker, but the delivery of the story plot is amazing. If the animation wasn't this mesmerizing, I'd give this movie a 3/5. In some ways, this movie brought an impactful phenomenon to the animation industry.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "It's such a good movie! Funny, heartfelt and action packed.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "igual de buena que el puss in boots",
            "review_date": "2023-01-29",
            "source": "rt"
        },
        {
            "content": "One of the best animated movies of all time. Although the characters and the story aren't that fresh or interesting, the animation makes the movie worth watching.",
            "review_date": "2023-01-27",
            "source": "rt"
        },
        {
            "content": "Offered a great story with a twist on today's animation style. While many animated movies try and recreate real-life objects, Into the Spider-Verse stuck with the iconic comic book style.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "Mid, just watch Morbius.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider Verse was an incredible movie in every way. The visuals and animation in particular were so original and interesting, making the movie feel like a comic book while still capturing movement in a realistic way. The plot and storyline was also amazing and I loved seeing Miles grow into his role as Spider-Man. Lastly, I loved the character design and the unique colors and personalities that came with each new Spider-Person. Overall an excellent movie!",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "Great animation, good plot, what more could you ask for in a movie about spider people.",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "It was a good movie, it kept me on my toes trying to figure out the relationship between all the characters. It also had some humor in it which kept the movie \"fresh\" there were no boring parts to this movie.",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "My favourite movie in 2018! Love spidy forever🥺",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "This might be better than \"No Way Home\" and definitely served as a prototype for that live action movie.  Who knew an action sci-fi cartoon could be better than it's live action counter-part?!  But the script here is so strong.  It takes you by surprise with it's inventiveness.  Plot wise this mixes together as aspects of the standard Superhero origin story; which is expected.  But then it brings in It's a Wonderful Life and Christmas Carol; where the ghosts of Christmas past so to speak; (in this case other versions of the hero himself; from different dimensions) coach the hero and train him, a la Obi Wan Kenobi, to rise to the occasion of his super hero calling.  It's a wonderful plot; building on the whole idea of past franchise cast members joining the movie as characters from a different universe; or dimension; a conceit cleverly started by Jeremy Abrahams' Star Trek years ago.  A wonderful story and a wonderful cast; wonderfully inventive; great chemistry between the actors; the story consistently surprises you; and you leave the theater definitely hungry for a second course!  I can't wait to see the next installment in June!  Highly recommend!",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "In my opinion the best films are those which no matter how many times you watch it, every time you find something new and unique, I've watched this movie like 10 times and I always find some cool detail I haven't seen before. This is just the epitome of the perfect spider-man movie. Everything of it is so epic, I love every single character, the dialogue is cleverly done and the fight scenes are well choreographed, Not to mention the feels. what else do you want me to say? 10/10 movie.",
            "review_date": "2023-01-25",
            "source": "rt"
        },
        {
            "content": "Great animation, Great Cast of characters, Great music, Great Story, and a Great Movie",
            "review_date": "2023-01-20",
            "source": "rt"
        },
        {
            "content": "- Great visulas (with a new style at the time) \n- Great scenario where each scene and character add something valuable \n- Great music",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "As an adult, I have to say, I really enjoyed this movie and all the different Spider-Man's that were involved making this movie.  Thus my *4 & 1/2* star rating!!!!",
            "review_date": "2023-01-16",
            "source": "rt"
        },
        {
            "content": "My favorite movie and has been since 2018. Some of the best animation I've seen in a long time plus and amazing story and great new characters!",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "Good movie but slightly overrated, great visuals, story and everything else, but still not as good as the original trilogy movies, it's good but not a \"masterpiece\" like everyone claims it is",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie in my opinion. Good music and amazing animation. One of the best-animated movies I've ever seen. So unique. The story is interesting and fun. Miles is such a great character, really relatable. I don't even know what to say, watch this movie if you haven't already.",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "What a way to end 2022! I watched this film when it came out in 2018 and hadn't revisited it. Let me tell you that my opinion has changed a lot since then. I truly believe that \"Spider-Man: Into the Spider-Verse\" is the best Spider-Man movie ever released. \n\nI love everything about this movie. The animation (though it took a minute to adjust to) is gorgeous and unique. The cinematography is breathtaking. There is emotional complexity to this movie and an incredible depth to each character (especially Miles). The \"all is lost\" moment is masterclass storytelling and creates a near-perfect finale.\n\n\"Spider-Man: Into the Spider-Verse\" showcases why film is my favorite medium for storytelling. \n\nBest Character: Miles (honorable mention to Peter B. Parker)\nBest Scene: Leap of Faith (Top 10 all time)\nBest Quote: \"Anyone can wear the mask. You could wear the mask.\"\nBest Song: \"What's up Danger\"\n\nNote: Stan Lee's cameo is this movie is an all-timer.",
            "review_date": "2023-01-10",
            "source": "rt"
        },
        {
            "content": "Such a unique new take on Spider-Man that is just flawlessly executed. From the subtle details to the music, art style, and new characters, it all just keeps you hooked and has this perfect flow to it. This is an absolute masterclass in pacing - was engaged throughout the whole film and still stuck thinking about it after it finished. The \"what's up danger\" scene is easily up there with \"I am iron man\" for my all time favourite marvel moment, and I'm a die-hard Iron Man fan. Didn't expect to like this film so much but have just been totally blown away.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "It's a masterpiece movie I love that there's all the different spider-man's in this movie and I love the song sunflower. Overall 10/10 masterpiece and one of my favorite movies.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "One word. Beautiful.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "9/10. Great representation of Spider-man.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Awesome, inspiring, well-written and a Diamond-crafted movie. No more words to say.",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "a fun, kid-friendly movie; engaging plot and voice acting. definitely recommended.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "A few plot holes plus the main villain being defeated in a very cheesy way stop this from being an absolutely perfect movie in my opinion, but among every animated movie I've seen this easily comes the closest to perfection. It's also the best Spider-Man movie to date, live-action or otherwise.",
            "review_date": "2022-12-27",
            "source": "rt"
        },
        {
            "content": "Best animated movie in my opinion. Anyone who gives this movie a bad rating is just a jealous DC fan. Can't wait for the sequels, has potential to be one of the if not the greatest Trilogy of all time.",
            "review_date": "2022-12-26",
            "source": "rt"
        },
        {
            "content": "Very intriguing. This film as a brilliant style to it and some storytelling not seen in much contemporary story telling this day and age.",
            "review_date": "2022-12-23",
            "source": "rt"
        },
        {
            "content": "The greatest animated movie ever made. The animation style is so good. It flows so smoothly and the charachters get so much personality with the style of animation\n\nThe soundtrack is amazing all the songs and themes work just right. The pacing is great the jokes are all well delivered and clever. The charachters are interesting and cleverly made. Even the plot twist came out of nowhere and no one saw it coming. \n\nEverything about this movie just works. I had to check twice that it really was sony that made this masterpiece. But I must admit sony has really done a very good job with this movie and thats why it is the greatest animated movie ever made",
            "review_date": "2022-12-22",
            "source": "rt"
        },
        {
            "content": "A Must-See modern marvel (No pun intended). Awesome casting, visuals, and story.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "Your review helps others find great movies and shows to watch. Please share your honest experience on what you liked or disliked.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "Essa animação é MUITO BOA, recomendo muito o filme, porém, vamos a de convir...\nÉ pra criança, ok, ok , eu cresci com o primeiro homem aranha dos cinemas e cheguei a ler alguns quadrinhos que já não faziam parte da minha geração, a minha sensação com essa animação é a mesma que eu sentia pelos quadrinhos, diferentemente dos filmes. Outra comparação é como se eu estivesse na tv globinho assistindo um espetacular homem aranha desenho só que dez mil vezes mais caprichado e inclusivo.",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider-Verse was such a cinematic masterpiece. This was Sony's big comeback after the cinematic disaster that was The Emoji Movie.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "Normally I would prefer live action over animations, but there's no denying that it is because of animations which allows 'Into the Spider-Verse' to venture into places that live action counterparts can't.",
            "review_date": "2022-12-16",
            "source": "rt"
        },
        {
            "content": "This movie is the master of \"show, don't tell.\" You learn so much about the main character, Miles, with just the first few minutes of seeing him. The visuals are creative and beautiful, along with the sound track. It is an excellent story and respects the source materials/canon of the characters. This movie demonstrates how to make a diverse cast in a movie perfectly. Other show creators should learn from this movie.\n\nThis is one of my all time favorite movies and I highly recommend you see it.",
            "review_date": "2022-12-16",
            "source": "rt"
        },
        {
            "content": "Brace yourself for a 2 hour movie featuring Jake Johnson's grating voice",
            "review_date": "2022-12-16",
            "source": "rt"
        },
        {
            "content": "My favourite animated movie so far, truly ground-breaking.",
            "review_date": "2022-12-13",
            "source": "rt"
        },
        {
            "content": "Amazing movie and one of the best super hero movies even though it’s animated",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "In my opinion I think it is hands down the best spider-man yet it looks so comic book like it makes it amazing",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "An animation marvel (excuse the pun). Saw it in theatres and it was the greatest movie watching experience of my life, the opening scenes made me feel like I was coming up over the hill of a rollercoaster. One of my fondest memories",
            "review_date": "2022-12-10",
            "source": "rt"
        },
        {
            "content": "Animation level is over 9000 ^^",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "Best Spider-Man movie hands down. I am stoked for the sequel!",
            "review_date": "2022-11-30",
            "source": "rt"
        },
        {
            "content": "I never thought I could love an animated movie this much. Into The Spiderverse blew me away. I had middling expectations because anime isn't really my thing and animating a major Marvel motion picture wasn't something I thought would work. I was wrong. This is a standout entry into the Marvel universe and a must-watch.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "the best animation movie",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "The best movie ever animated! With the best voice-over performance from Shameik Moore! And the best movie title sequence ever made: its opening, actually!",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "What can I say other than amazing visuals, story, dialogue, ending, characters, music, and overall the best look a Miles Moralis Spiderman we have had.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Best superhero movie I've ever seen, period.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Excellent animation and a compelling story",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "Watch it now or i will find you.",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "Ya'll, this just might be my favorite animated movie or even my favorite movie of all time. Please watch it dude, it's crazy.",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": "BEST. MOVIE. OF. ALL. TIME",
            "review_date": "2022-11-20",
            "source": "rt"
        },
        {
            "content": "The story, the visuals, the music. It's incredible. I was skeptical going into it but this quickly became my favorite movie. Anyone who's at all into superhero's or comics will love this movie.",
            "review_date": "2022-11-20",
            "source": "rt"
        },
        {
            "content": "one of the best movies I've ever seen. Miles' whole story is so relatable.",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "One of the biggest surprises at the time in which Spider-Man into the Spider-Verse delivered excellent storytelling and stellar animated sequences.",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "Mind blowing, worth seeing",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "One the the best Animated Spider-Man movies ever! Absolute must see!",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "honestly top 3 best animated movies and is insanely entertaining.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "Although advertised towards kids, Spider-Man: Into the Spider-Verse can appeal to anyone who enjoys a fun, animated, superhero flick.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "Quite literally, a comic book put into film media.",
            "review_date": "2022-11-15",
            "source": "rt"
        },
        {
            "content": "This is my favorite spider movie",
            "review_date": "2022-11-13",
            "source": "rt"
        },
        {
            "content": "this is a very cool and very fun spiderman film",
            "review_date": "2022-11-10",
            "source": "rt"
        },
        {
            "content": "Such an amazing film and that free fall scene gives me chills no matter how many times I watch it",
            "review_date": "2022-11-10",
            "source": "rt"
        },
        {
            "content": "This film animation is incredible, the characters are amazing, the world building is really nice towards all the other universes. 10/10",
            "review_date": "2022-11-07",
            "source": "rt"
        },
        {
            "content": "Still the best Spider-Man film to date, by a wide margin!\nThe storytelling is phenomenal. The numerous styles of animation in the film make for very interesting visuals. Each different spider-person is a fleshed out character & is hilarious in their own way. The jokes are non-stop & keep you entertained for multiple viewings.\nCheck out this great Spider-Man film!",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "This movie is so good, the scene where Miles masters his power is incredible, Peter Porker is my favorite character.\nAnimation: 10\nCharacters: 10\nComedy: 9\nStory: 9\nOverall: 9.5\nHighly recommend to  everyone.",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning animation, with amazing story and great characters. All the scenes are incredibly well made, with fantastic shots and action. Never saw 3D animation like this, it's incredible to watch and every shot is made to make it look like a comicbook.\nThe characters have amazing designs, there are good dialogues, everything in this movie is perfect.\nOne of those that you'll watch again and again. Enjoyed it, you need to see it.",
            "review_date": "2022-11-05",
            "source": "rt"
        },
        {
            "content": "With a touching story, interesting characters, and beautifully stylized animation, Spiderman: Into the Spiderverse breaks down the set expectations of an animated movie, creating an equally enthralling and gorgeous two hours.",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "Spider-man: Into the spider-verse is an animated and science-fiction movie that was released in 2018 by Sony Pictures Animation, Marvel Entertainment and Columbia Pictures. The movie takes place in Brooklyn, New York and it's about a guy who is called Miles Morales and takes the role as Spider-man after he was bitten by a spider (the classic story of Peter Parker). Nicolas Cage is the voice of one of the cartoon characters. I just loved this movie, the special effects, the characters and the story are amazing.",
            "review_date": "2022-10-28",
            "source": "rt"
        },
        {
            "content": "This movie is amazing. The characters and the world are so well animated and also so beautifull because of it's art style. Even the story of this movie is an A+ . Necesary to mention is the soundtrack which is an absolute bommer. All in all one of the best movies I ever saw ( the best super hero movie made to this point in my opinion). I can only recommend this movie to anyone.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "I was absolutely floored on how brilliant Spider-Man: Into the Spider-verse was. The depiction of a kid hesitant to take up the mantle that he may not be ready for or he doesn't even know he's capable of handling, was a brilliant direction to go with this movie. This is an essential comic book movie that I believe everyone must watch.",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "AMAZING MOVIE. The animation is amazing and the characters are so relatable and you feel for them. The perfect balance of emotion and awesome superhero stuff",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "The unique art style is very cool. This is a great movie and I definitely recommend it.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "I thoroughly enjoyed the storyline and animation style, as-well as the soundtrack. Passed the time well and would be great for almost all ages.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Perfection. This is how you do a Spider-Man movie!",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Everyone is so right, it is a masterpiece",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "Those who don't like it are blinded by superficial discrimination that makes them ignorant to the fact that it is one of the most revutionary and well-done animated movies EVER.",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "Oh yeah baby now THIS is the good stuff! It's perfect, it improved Miles' character a lot from the comics, making him more relatable, understandable and overall a better character, i love the other spider-people, i love the beautifiull animation, i can't wait for acroos and beyond the spider-verse, Peter B Parker is a very interesting version of Peter and we love him, basically if you want to watch an spidey film, but only one, this is it, unforgettable experience.",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "This movie is bomb explosive awesomeness",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "Spide-man: into the spider-verse\n\n    This movie is about a teen tha descovered he had a power similar to Peter Parker, the story was too fun it has a perfect script that glues you in thhe front of the scream, one of the best films that i've seen.\n     Have a perfect animation, the voice of characters is so good, this movie is perfect",
            "review_date": "2022-10-21",
            "source": "rt"
        },
        {
            "content": "Previous Tom Holland Spider-Man movie storylines were better and more interesting in my opinion. Did enjoy the scenes with previous Spider-Man actors but felt a little cheesy at times. Still a good one though - not sure Tom Holland can make a bad movie.",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "no explanation. 11/10.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "Greatest movie of all time.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "Good marvel animated movie ever, can't wait for a sequels!",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "The art style,plot,Character,everything is great about this movie.The comic book style with the box to show Miles's thoughts all so good. I cant point out a part of the movie I disliked. The scene when Miles is falling but the Animator make it look like he is rising. I love this Movie so much.",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "What can I say about this movie that hasn't been said before? It's beautiful, like a comic book on the screen. A must-see for any fan of animation or spiderman. It's such an unforgettable event that you'll be very excited about the upcoming sequel.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "This movie is a revolution in Western animation.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "One of the best Spider-Man movies I have ever seen. Everything about this is great. The animation is incredible and the writing is fantastic and heartfelt. It hits all the right spots.",
            "review_date": "2022-10-06",
            "source": "rt"
        },
        {
            "content": "Gud movie. Very gud movie",
            "review_date": "2022-10-03",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9.5/10) ; Cinematography (9.5/10) ; Plot (8.5/10) ; Acting (9/10) ; Pacing (10/10) = 93%}\"",
            "review_date": "2022-09-27",
            "source": "rt"
        },
        {
            "content": "Spiderverse is a triumph in animation. It manages to be an un-selfserious adventure romp with smirky dialogue and absurdist silliness, while deploying some of the most creative cinematography I've seen in any film - superhero or no. It seemlessly blends trendy modern styles and music with a vividly 'on the page' comic-book aesthetic. It is just as contrived as the next comic book movie, and even more lighthearted. Yet somehow it feels so much more grounded in the lives and emotions of actual people. The now souless and repetitive comic book movie landscape is here completely disrupted with something altogether more ambitious, artistic and - genuinely - funny.\n\nAll in all, this film does everything that animation should give you the freedom to do. Go big, go crazy,  go creative.",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "Fantastic animation with an amazing soundtrack. The story is good, with amazing characters. Can't wait for the sequel.",
            "review_date": "2022-09-18",
            "source": "rt"
        },
        {
            "content": "The all time best Spider-Man movie sorry Spider-Man 2 you have finally been dethroned, if you love the character whether it be from the Comics, Movies, Cartoons, etc you will love this movie. The villain of this movie King Pin had a justified motive, The cast is great seeing a lazy Peter from another universe, Gwen Stacy, Spider-Man Noir, etc but the most well written character here is obviously Miles Morales which makes me so glad since he is a really good character in the comics but people outside of comics just saw him as \"Black Peter Parker\" or \"Spider-Man jr\" instead of his own person he isn't a nerd or a genius he is a teenager who is really creative & does things his own way like Peter B Parker told him \"Don't do it like me do it like you\" which is a great message the movie gives to the viewer anyone can be under the mask it doesn't matter what race you are or how smart you are anyone can be Spider-Man. Somehow every time I rewatch this movie I love it more & more I can watch it over & over again & never get tired of it.",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "Loved it ! It had absolutely everything a Marvel fan needs!",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "Easily the best spiderman movie to this day, better than spiderman 2 and no way home. Animation is near perfect and faithful to the character, great interpretation of kingpin and this movie made miles morales 10x better of a character. Best thing sony has done since the raimi trilogy.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "I found this film enjoyable, but that's because I liked the older Peter Parker being in the film. Nothing wrong with Miles story at all, but I'm a Peter Parker Spider-Man fan. Well worth the watch though.",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "Best Spider-Man movie to date? Might just be. I am not really fimiliar with the Miles comics as much as I am with Peter Parker, but this movie definitely made me interested in Miles. The art style of the movie is top notch, and I am certainly hyped for Across the Spider-Verse!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "The best animated movie I've seen",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "As an avid fan of Spider-Man, I love this movie. The plot, the animation, the voice acting, everything. This movie knows how to reel you in. Another Grand Slam by Sony.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "By far one of the best Spider-Man movies!",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "This is a fast paced, high action CGI superhero universe film that I very much enjoyed. I loved that there was an anime character and other decent female characters and the CGI was pretty impressive. I particularly liked the times when speech from the comic book that the film seems to be set in, appears on screen - this doesn't happen all the time but from time to time and its quite amusing and visually appealing. I suppose its a little bit like the old Batman live action show, with one or two times where noises made appear on screen, like 'bonk' etc.\n\nThis film should appeal to action film fans - although it is CGI, its very fast paced and engrossing and I wouldn't say its entirely meant for young children - it can be enjoyed by an older audience too but would certainly entertain youngish people as well, so its a bit of an all rounder.I very much enjoyed this - I think it's a film that's probably worth a re-watch or two because there's so much going on that it'd be easy to miss little clues and details while watching the main action on your first view. I'll watch it again at some point and see if I'm right about that or not but otherwise, yes, I'd certainly recommend this film as a decent, solid bit of action packed entertainment. I wouldn't necessarily say it's a film with a lot of thought provoking aspects as such but for what it is, it's a very good film regardless.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Fantastic Voice Acting, Amazingly Gorgeous Animation and a hugely memorable soundtrack. The plot is sophisticated and engaging as well with a simple and heartfelt message that never feels cliché. The action scenes are amazing to watch also along with witty and clever dialogue. The only marginal problem is there are some characters in the 2nd half that feel underdeveloped and contrast to the rich and developed ones we had from the first.  But the charm and memorable design make this a mute point overall. Easily not just a classic super hero or animated movie but this is A All Time Classic in General.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "The best animated movie I have ever seen",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Spider Man: Into the Spider-Verse is the best movie ever it has good comic book effects with lots of dots and 2 frame slow movements of those movements and man.. the guys worked well on it\nSpider Man: Into the Spider-Verse is the best movie ever it has good comic book effects with lots of dots and 2 frame slow movements of those movements and man.. the guys worked well on it",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "3 years ago- Absolute visual dynamite in a film filled with action, humor, and heart, filled with a plethora of inside jokes for comic fans and an unbelievably strong voice cast for all to enjoy.",
            "review_date": "2022-08-25",
            "source": "rt"
        },
        {
            "content": "This movie was insane. My friend sam was in it. He played as kingpin",
            "review_date": "2022-08-23",
            "source": "rt"
        },
        {
            "content": "Stunning film. From start to finish every scene was gorgeous. 10/10. I need them to rerelease this at the cinema so I can watch it in its full beauty.",
            "review_date": "2022-08-23",
            "source": "rt"
        },
        {
            "content": "Best animated superhero movie yet",
            "review_date": "2022-08-23",
            "source": "rt"
        },
        {
            "content": "This movie is very great :)",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Tremenda obra maestra 20/10 y God",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Best movie of the year",
            "review_date": "2022-08-12",
            "source": "rt"
        },
        {
            "content": "For me it's an 10/10 movie I believe that Spider-Man No way home inspired this movie because this movie's plot was absolutely crazy dude",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "Very good, great fun at introducing the multiverse.",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "I was expecting more. :(",
            "review_date": "2022-07-29",
            "source": "rt"
        },
        {
            "content": "Best animated movie by far",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "Peak film. Literally the most beautiful thing to ever come to cinema. All the characters were so perfect and all of the Spider-Man variations were so cool and unique. This show perfectly let's each moment with the characters shine to make the audience connect to them even more. This film was amazing. Nothing else to say. No clue what they are doing with across the spiderverse but I genuinely couldn't care less cause I'm already hooked on this series.",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "The Animation is outstanding and it just adds to he amazing script and writing, that is also toped with great acting. This movie also delivers with amazing characters and great emotion.",
            "review_date": "2022-07-23",
            "source": "rt"
        },
        {
            "content": "My favorite superhero movie ever i think? Animation is 10/10, plot and characters are 10/10, and music is 10/10. All around, a fantastic movie.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "best spider-man\nmiles have veri nice jordans :))",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "A literal perfect movie. A perfect Spider-Man movie, a perfect animated movie, a perfect comic book movie, and a perfect superhero movie.\n\nThe visuals though really stand out here. You can pause almost any frame of this movie and it'll be amazing. \n\nThe voice acting is fantastic, the story is compelling, the action is super fun, and it can be funny as hell, but knows when to put comedy aside and have an emotional moment. \n\n10/10.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "This movie is great. the animation style is beautiful and the story is amazing. It starts out slow, mainley to get introduced to the characters. And then it just tackes off. there is a lot in this movie and yet they balance everything perfectly. I have a lot off friend how didn't want to watch this movie because it was a animated movie but honestly, if it wasn't animated it would lose a lot of what makes it great. So just go watch it.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "Easily the best Spider-Man movie ever. It's my second favorite animated movie. It does everything I would want in a Spider-Man film, and to be quite frank, it does everything I would want in any film.",
            "review_date": "2022-07-12",
            "source": "rt"
        },
        {
            "content": "Yeah, this is better than CATS.",
            "review_date": "2022-07-09",
            "source": "rt"
        },
        {
            "content": "A visual masterwork of storytelling, held back only by slight pacing issues in certain parts that shows on repeat viewings. Definitely a recommended watch, and rewatch if you are so inclined.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "This movie is fine. Nothing special happened or of note.",
            "review_date": "2022-07-04",
            "source": "rt"
        },
        {
            "content": "Best animated movie I ever watched, the animation was Just WOW, the cast did an amazing job and the story was emotional and super interesting.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "Fantastic movie! This is what happens when you combine superb animation and a well-structured story. Very entertaining and brings the audience in for a crazy ride!",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "The greatest 01 hour: and 57 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-07-01",
            "source": "rt"
        },
        {
            "content": "Really original animation, It's like watching a comics. I really appreciate all easter-eggs to other spider-man movies. It was ride from the beginning to the end and I am curious what will be next for Miles Morales and others.",
            "review_date": "2022-06-24",
            "source": "rt"
        },
        {
            "content": "This is one of the best superhero movies ever made. You feel like you are watching a living comic book with every frame of this movie. It has a very likeable and relatable protagonist. The climax is very refreshing and a satifisfying end to this movie. There is so many more reasons why this is easily the best Spiderman movie ever made. 11/10 and would definetly recommend to any superhero fan.",
            "review_date": "2022-06-22",
            "source": "rt"
        },
        {
            "content": "no , just no - you are ruining Spiderman as it was intended , stop this nonsense",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "why the frick this movie isn't 100%/100%?",
            "review_date": "2022-06-17",
            "source": "rt"
        },
        {
            "content": "This movie gave me chills just watching. Great effects and I mean GREAT. Had great character development, and was hilarious. Music was a 10, voice acting was a 10, and story was a 15. I left the theater in awe and watched again. I really think you should watch the movie.",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "soooooooo fresh can't get over this. absolute a must see and definately can't wait for part 2",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "this is my favorite movie of all time...",
            "review_date": "2022-06-07",
            "source": "rt"
        },
        {
            "content": "best marvel movie I've ever seen",
            "review_date": "2022-06-03",
            "source": "rt"
        },
        {
            "content": "I can't explain my love for this film! It's fun, fast-paced, and an awesome watch! It's epic final battle scene REALLY wraps things up, and Miles' origin story has awesome animation, mixing 2D and CGI! Overall I give it a 9.5 out of 10!",
            "review_date": "2022-05-31",
            "source": "rt"
        },
        {
            "content": "divertido, pra passar o tempo.\no desenho é bonito com bastante cores e musicas, e o humor é aceitável",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "Warning: Spoilers\n\"Spider-Man: Into the Spider-Verse\" is a fantastic film but might be a bit overwhelming for some viewers. It's filled with blaring hip-hop music and the animation is beyond splashy...it's competely intense! Now these are NOT criticisms...more a warning if you hate these sorts of things or if you or someone you loves has challenges, such as Autism....as the film might really be overwhelming. Still, I'm nearly 55 and loved the picture...and I think most will if they have an open mind and want something different. That DOES strongly apply to me, as I've gotten sick of superhero movies because there have been so many recently and there's a certain sameness about them...but not this Spider-Man film!\n\nThe story is told with breathtaking CGI--with a look that is nothing like any other film I've ever seen. In this world is a young man who sees Spider-Man killed and is also bitten by a spider and becomes the next incarnation of Spider-Man. But instead of taking the time to enjoy and learn about his new powers, this young man finds himself in the middle of a weird apocalyptic occurance---and all the various incarnations from the various universes come together to save the day.\n\nOverall, amazingly creative...there's nothing else like it. This is more than reason enough to see it. Sadly, however, the film loses a bit on home TVs...even big ones as the scale and size of the film needs the big screen.",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "This is a film that not only has stellar animation but a heartfelt story as well. The pacing is wonderful as is the music. I have not seen this much heart put into a Spider-man film since Sam Raimi's Spider-man 2.",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "Introducing Miles Morales, main character of the best Spider-Man movie of all time.",
            "review_date": "2022-05-29",
            "source": "rt"
        },
        {
            "content": "Beautiful, interesting, and exciting! Must watch!",
            "review_date": "2022-05-26",
            "source": "rt"
        },
        {
            "content": "A fabulous animation, perfectly elaborated, with an unbeatable soundtrack, and first-class graphic and visual effects. An animation masterpiece",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "5 stars not because it was the best movie I've ever watching but because it was something way different that we have ever seen before and it was so good! 9.25/10!",
            "review_date": "2022-05-20",
            "source": "rt"
        },
        {
            "content": "An incredible movie, and possibly the best Spiderman movie to date. The animation is gorgeous, but it may take a bit to get used to if you aren't familiar with it, but the way it captures what it's like to read a comic book/graphic novel is insane. One of my favourite movies of all time and a must watch in my opinion.",
            "review_date": "2022-05-17",
            "source": "rt"
        },
        {
            "content": "This movie did diversity right before the futile nonsense woke mania trend started. Instead of reinforcing barriers and mutual resentment, it bridges the gap and celebrates the values of everyone without favoritism. \n\nIt's actually a good movie, with a good story, great animation, good characters and the animation style and quality transports us inside a comic book. \n\nIt's not preachy nor using diversity as a smokescreen for inferior quality. It earns respect rather than demanding it. Furthermore, it's not patronizing nor belittling. \n\nAn animation masterpiece that anyone can enjoy.",
            "review_date": "2022-05-17",
            "source": "rt"
        },
        {
            "content": "Splendid graphics! Although I feel a little bit bored at some parts of the movie.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "A masterpiece. The most beautiful spider-man movie.",
            "review_date": "2022-05-14",
            "source": "rt"
        },
        {
            "content": "The best animated Spider-Man Film!",
            "review_date": "2022-05-13",
            "source": "rt"
        },
        {
            "content": "Spiderman Into the Spiderverse was very beautiful. The animation is spectacular throughout the entire movie. The switch between animation and a comic background made the movie very good and distinct. The soundtrack is very good and matches the movie well. The characters are well developed and work well together. The cinematography in the dramatic scenes was beautiful especially when the main character is learning how to control his ability by leaping off of buildings.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "I loved it, and not only the movie but also the animation and the multiverse theme.",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "编剧讲故事讲的很精彩，电影制作的技术水平很高，电影拍得也非常有动漫感，像是3D的赛博纸质漫画。",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning visual and music with a good enough story to enjoy",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "An absolutely great watch. Fantastic voice work, Incredible animation, and a stellar story. This is one of the best comic movies ever made, and it truly shows the passion the team had for the characters, and the story they could tell.",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie of all time (and arguably the best comic book movie of all time)",
            "review_date": "2022-05-08",
            "source": "rt"
        },
        {
            "content": "Great characters, incredible animation by Sony, amazing voice acting, and a great story make this superhero movie impactful, intense, relatable, and by far the best animated film ever created.\n\nWhile it can be generic, a film like many others (mainly similar to other Spider-Man movies/other superhero movies in general) but is delivered in such a refreshing, emotional way that you hardly notice.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into The Spider Verse is a dedicated film that touches the core themes of the superhero, such as family. Miles Morales is an inspiring character that kids can and will look up to. The animation is at its peak to where we feel like we are witnessing a comic book given life in front of our eyes. Stan Lees presence is everywhere in this movie and boils the movie down into one simple statement about this film: anyone could where the mask.",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "THE BEST! The artstyle is so good with lovable characters. Miles truly captures the exaggerated swagger of a black teen",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Sonic lord lord king king lord king",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "I don't want to say it was better than Raimi movies but it was better than Raimi movies",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "It is one of the best Spider-Man movies and the best animated movie I've ever watched. The animation style of it is very packed and it captures the sensation of getting absorbed in a comic book.",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Must see! the music animation is breathtaking absolutely must watch",
            "review_date": "2022-04-25",
            "source": "rt"
        },
        {
            "content": "Spider-Man - Into the Spider-Verse:\n9 / 10",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "The best spider-man film. No contest. Laugh out loud funny with superb industry pushing animation and a heart felt story. Can't wait for the next one.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "This movie has already changed the face of animation since it came out with its stylish synthesis of 2D/3D/indie/anime styles, strong story grounded by a caring interracial family, and great soundtrack. The fight scenes get a bit too chaotic, especially in the last act, but Miles is the Spider-Man kids today deserve.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "It is a bit overrated in my opinion.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Masterpice, its so beautiful, plot is ordinal but still good. This movie shows that everyone can be Spiderman and these is a reason why I love it",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Incredible art style, incredible characters, incredible storyline. This movie is one of the best comic accurate movies ever made",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Esse filme não possui defeitos, em cada aspecto de seu ser ele é perfeito.\nNota: 100% 🍅",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "This is the most unique spider-man and most unique animated movie I have seen in a while. The art and animation of this movie are some of the best in the industry. The soundtrack is great. Marshall Ali did a great job playing Uncle Aaron. This is a one-of-a-kind movie. It's easily the best Sony animated film and one of the best, animated superhero movies.",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "Not only did this movie shift the entire animation scene to show experimental style can sell tickets, but it did that while balancing a great story, great characters, and great humor. \nCouldn't have asked for a better taste of what the 2020s have to offer.",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "Hands down the best animated movie i have watched. Everything works together beautifully",
            "review_date": "2022-04-05",
            "source": "rt"
        },
        {
            "content": "A visual Marvel, great story telling, great pacing, and great characters.",
            "review_date": "2022-04-04",
            "source": "rt"
        },
        {
            "content": "It had humor and was pretty perfect, but was a little to retro-y",
            "review_date": "2022-04-04",
            "source": "rt"
        },
        {
            "content": "This movie is as beautiful as a sunflower.",
            "review_date": "2022-04-03",
            "source": "rt"
        },
        {
            "content": "One of, if not the best movie of 2021 which plays hard on nostalgia, but exactly how a movie should.",
            "review_date": "2022-04-03",
            "source": "rt"
        },
        {
            "content": "There is only 2 5/5 Spider-Man movies and this is one of them",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "The first superhero film I've ever seen in theaters. It's nostalgic, filled with easter eggs, funny, and just overall good.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "This movie is so beautiful and has such a good storyline, I love it and I always will",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "INCRIVEL MARAVILHOSO, OBRA DE ARTE",
            "review_date": "2022-03-30",
            "source": "rt"
        },
        {
            "content": "Honestly, this is better than no way home.\nNot that NWH bad, but it's just a masterpiece.\n\nCan't wait to see Spiderverse 2",
            "review_date": "2022-03-30",
            "source": "rt"
        },
        {
            "content": "I love this movie and all the life lessons it brings you. Miles' overcoming and acceptance is touching, brilliantly animated and beautifully done; it's great the way they interacted with the webheads. It is a work that makes me think: \"We are much more than we think, we are much more than we imagine.\" and yes we are, Miles shows us this with simple lines and scenes.",
            "review_date": "2022-03-26",
            "source": "rt"
        },
        {
            "content": "the secend best spider man movie",
            "review_date": "2022-03-25",
            "source": "rt"
        },
        {
            "content": "By far the best Spiderman movie you will ever watch",
            "review_date": "2022-03-22",
            "source": "rt"
        },
        {
            "content": "Amazing visuals, amazing soundtrack and a amazing movie overall.",
            "review_date": "2022-03-17",
            "source": "rt"
        },
        {
            "content": "Though it's a story we're familiar with (if you're a Marvel fan), this movies animation style, soundtrack, characters and story-telling is just SO unique and wonderful.  I personally am not even a big even Marvel nerd to know all the details on the Spider-verse and all it has to offer and this movie was still super enjoyable.",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Dude I loveeeee this movie. Such a great art style, touching story, and fun characters (that do get a little too goofy sometimes, but I mean it's the multiverse)",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "The best spider-man movie of all time",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Esse e um filme que todos devem assistir perfeito tanto na narrativa quando na animação que e de cair o queixo simplesmente incrível !",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie ever after the first two Sam Raimi movies and No Way Home and the best animated movie after WALL-E and Batman: Mask of the Phantasm. The ground-breaking 3D-2D comic book CGI animation is so unique it looks like the evolution of visual art and it reminds me of the art style from the Ultimate Spider-Man and Spider-Man Shattered Dimensions game. This movie is about representation, inspiration, interacting in your revolutionary-looking world, and becoming your own icon. Miles Morales is the second best coming-of-age character to be Spider-Man.",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "Being Spiderman in movies isn't easy. We always have high expectations for this iconic hero. And you know what? This movie reaches and passes them easily. Everything here is perfect. You can just be watching a well-done action scene, enjoying a beautiful and accurate soundtrack, having fun with perfectly timed jokes (it's serious or fun when it has to be) or maybe crying because something heartbreaking happened. Also, there are spidermen for everyone. Are you a young teenager? No problem, you will identify with Miles leading with all the changes he's going through. If you are a late teenager, you will understand the reason for all Spidergwen's actions. Besides, for old people, there will be Peter B. Parker being everything you expected from someone who's in his 30's or 40's and has to face the world.",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "This movie has no flaws. It gets everything right and has an evident care for our beloved web head. This movie is a testament to Spiderman and all the fans who have stuck with him for the past sixty years, young and old. The animation is beyond perfect and the tiny details, the creativity, and the genius of this movie never fail to amaze me. The voice actors are perfect for their respected roles and every line is delivered with such wit. The story is flawless and neatly paced with witty humor, drama, and creative action scenes all in one. But what I love most about this movie is it's unique understanding of our friendly neighborhood Spiderman. It understands what it's like to be the underdog, fighting a battle when you don't know how to fight, constantly failing yet refusing to fall. Into the Spider-verse has such a clear comprehension on what it means to be Spiderman. Anyone can wear the mask because all it takes is the courage to get back up after getting beat down, which I find is Spider-man's most important trait. Spider-man always gets the worst luck and yet continues to fight on because it's his responsibility. No matter what happens, he finds a way to perservere because it's the right thing to do. It was an interesting choice using Miles Morales as the protagonist and I think it made the movie all the more special, telling the story of Spiderman from a different, refreshing perspective while maintaining the heart of its origins with Peter Parker. There is so much right with this movie.",
            "review_date": "2022-03-13",
            "source": "rt"
        },
        {
            "content": "Story is great. Visuals are fantastic. Everything about this movie is perfect can't wait for the second one.",
            "review_date": "2022-03-13",
            "source": "rt"
        },
        {
            "content": "For Spider-Man's first ever animated movie, it was SPECTACULAR. I can't wait for a sequel, and I loved every moment of this movie. It was a leap in movie-making for Sony Pictures Animation, and the animation was incredible. The story was great, and the voice acting was well-done.",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "I almost fell asleep twice watching this movie, and I wasn't even tired. This movie only had action for around 3 seconds. An excuse of \"Keeping Me On My Toes.\"",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "its a very great movie man this has a great stuff in it know lets does.\nfirst the Animation is looks very good with the comic book animation that looks so fire probably one of the best animation i have sense it looks so good.miles is a very great character the two peter Parkers are fun peter b is my fav so funny with a very great voice i love all the spider characters my fav is noir he is so funny i wish every make a movie about him.robot girl is fun,pig is fun,gwen is great,and yeah.the action is great with a great deep story uncle dies that was deep and yeah.the final battle is deep and strong and great,epic all of it.all the fight scenes are so fun man just a deep,epic,great movie but has problems.during those sad scenes they play some really bad music during those scenes and peter b is annoying sometimes and i only have two problmes. its a very smart movie with a lot of great things happening its 9/10 i love.",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "simply beautiful, charming and super fun, spider man in the spider verse is a dazzle seen by our eyes",
            "review_date": "2022-03-12",
            "source": "rt"
        },
        {
            "content": "Absolute must-see. With extremely good looking and unique visuals and amazing action scenes, this movie definitely stands apart. It's a perfect take at a Spider-Man animated film.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "One of the best (if not the best) animated movie of all time, it just isn't perfect.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "The worst movie ever",
            "review_date": "2022-03-06",
            "source": "rt"
        },
        {
            "content": "top 2 spider-man movie",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "O melhor filme do homem aranha que já vi, a trilha sonora e animação são impecáveis",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "One of the best if not the best animated movie. The animation the writing. All the voice actors really suited the characters. The only thing I would say is there was not really a reason to bring a lot of more spider men because they didn’t really get explored or had a lot of screen time.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "Yo creo que la mejor del personaje sin lugar a dudas, cada momento es especial, cambia el corazón del espectador además, y llena de la escencia carismática del personaje",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Maravilhosa animação. roteiro bem fechadinho tbm. Lindo.",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "Perfect!! Sony did a exceptional work on animations, and director and others, made a amazing work on screenplay!!!",
            "review_date": "2022-03-02",
            "source": "rt"
        },
        {
            "content": "The animation, the soundtrack and the plot are wonderful.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "I think I had more expectation which was not met.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "La mejor película de Spiderman hasta la fecha 😁",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "Inspiring in every way, Into the Spider-Verse makes up for the nightmare movies Sony Animation has previously given us (The Emoji Movie).",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "This is truly a great movie and it has many reasons as to why it's a good movie. This movie has great characters. Funny moments, relaxing vibes, and great music choices. This movie truly is entertaining to watch and I recommend it. This movie has special moments that truly show that it's great. And the animation is absolutely stunning. I think Sony did a great job with this movie and it is absolutely amazing.",
            "review_date": "2022-02-27",
            "source": "rt"
        },
        {
            "content": "it is a good movie but overrated and kinda wish it was longer but still a fun movie",
            "review_date": "2022-02-26",
            "source": "rt"
        },
        {
            "content": "Love this movie!\nOne of the best animation movies of all time.",
            "review_date": "2022-02-21",
            "source": "rt"
        },
        {
            "content": "Perfect, just perfect.",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "Excelente película, una de las mejores películas de superhéroes y del personaje. Lo que mas se destaca a simple vista es la animación, es increíble lo bien hecha que esta toda la película, con esta animación llena de luces, colores y detalles muy bien cuidados. La banda sonora es perfecta y queda muy bien con el personaje de Miles. La trama es super entretenida y divertida, y aunque parezca que es la misma historia de siempre, tiene algunos giros y sorpresas muy interesantes. El personaje de Miles cae muy bien, ya que siendo un personaje \"nuevo\" para la mayoría del publico, logra que cuando termina el film te den ganas de ver mas de la historia de él. El villano principal también es muy bueno, con una historia y una motivación muy bien contada. Los otros tipos de Spider-man llegan a ser muy carismáticos todos y con un estilo diferente cada uno, pero sin dudas se destaca el Spider-man de Peter B. Parker, quien tiene una gran historia detrás. La cinta además tiene escenas icónicas, como por ejemplo la del salto de fe de Miles, la cual por su significado se vuelve muy memorable. En conclusión, una de las mejores películas de Spider-man, logrando un mejor desarrollo de personajes que las dos primeras películas del UCM de Spider-man y contando con una animación brutal, que la llevo a ganar el Oscar. Muy recomendada.",
            "review_date": "2022-02-16",
            "source": "rt"
        },
        {
            "content": "A fun, distinct addition to Spider-Man lore, punctuated by the wonderful animation, pounding soundtrack, excellent voice work and flawlessly crafted comic-book aesthetics. The visual mastery alone is enough reason to watch this, yet some of the character work is pretty potent too. There are also several exciting, hilarious and touching moments, and even a few quirky ones - and more of the latter would have been great, as the movie tends to stick to genre conventions quite a bit towards the end.",
            "review_date": "2022-02-06",
            "source": "rt"
        },
        {
            "content": "Didn't know about this Spiderman till this movie!!!! It was Great!",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "Best movie of all time, like Jesus Christ watch it",
            "review_date": "2022-01-30",
            "source": "rt"
        },
        {
            "content": "i never got into it.",
            "review_date": "2022-01-24",
            "source": "rt"
        },
        {
            "content": "HOO - BOY DID I SEE INTO THE SPIDER VERSE AND IT WAS FREAKING AWESOMZINGLYDOPETASTIC MOVIE. THE AMOUNT OF EFORT THEY PUT IN THIS MOVIE WAS JUST MIND BLOWING! DID YOU KNOW IT TOOK THEM 1 YEAR TO GET 10 SECONDS DOWN!",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "One of the best Marvel Movies ever made",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "wow this movie is amazing",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "que filminho sapeca! me arrepio-me só de lembrar-me xD",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "Why did it take me so long to see this? A wonderfully imaginative and creative blast that harnasses the unique possibilities of animation and the best of the superhero genre with wit and intelligence to produce something new and different. Unlike many new and different pieces of art, however, it's also warm and inviting. Brilliantly animated, acted, and directed, it has uplifting ideas about diversity and inspiration without being too sentimental or 'life lesson' of the worse type. Possibly a shade too long - or that may be a tired, Covid recovering viewer speaking - but all in all it's a brilliant acheivement.",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "It's refreshing to see an animated Spider-Man sequel for  a change. Spider-Man: Into the Spider-Verse is groundbreaking in many ways. Its unique style of animation would make you feel like you're watching a comic book come to life. It's almost like a full-length motion comic movie. The sound editing and musical score also helped create the different moods. Although there were times when it was too loud and a bit overdone. The addition of comics-style narration and comic book sound effects was a great idea. The story itself was alright. The movie is full of action, chases, twist & turns and character interaction. A little bit fast-paced, but it's a very entertaining audio-visual treat!",
            "review_date": "2022-01-17",
            "source": "rt"
        },
        {
            "content": "Kingpin's motivation is one of the best villain motivations in any movie. I like the stuff with Miles Morales and his family, but overall this is undercut by the fact that the movie has a lot going on and it feels quite rushed. For example, we see Miles kind of getting along with the other Spider people but they still have their differences, then very quickly without much change, he says goodbye to all of them as if he has connected with them on a deeper level. The explanation for why Gwen shows up a week earlier than the others is just breezed past. Anyway, not a bad movie, but it has flaws.",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "this movie showed the way how future films would/should be like.",
            "review_date": "2022-01-16",
            "source": "rt"
        },
        {
            "content": "This was such a good movie. The plot and characters I didn't really think had a lot of problems. But what really made this movie for me was the animation. There is an INSANE amount of detail in the animation of this movie, and it had some good music too. (Watch this video if you're curious to see exactly HOW MUCH detail they put into the movie: https://m.youtube.com/watch?v=fTBsdqfd788)",
            "review_date": "2022-01-15",
            "source": "rt"
        },
        {
            "content": "This is a real live action.",
            "review_date": "2022-01-14",
            "source": "rt"
        },
        {
            "content": "Animation is beautiful ",
            "review_date": "2022-01-13",
            "source": "rt"
        },
        {
            "content": "great film add him to the avengers. ",
            "review_date": "2022-01-12",
            "source": "rt"
        },
        {
            "content": "Just feels like you are watching a comic book! Wonderful editing without any flaws, this combined with perfectly fitting music makes it a great watch!",
            "review_date": "2022-01-11",
            "source": "rt"
        },
        {
            "content": "Into the Spider-Verse was a truly great film. With an incredible visual style that combined a number of  different styles, from comic book to cutting edge 3D, it could not help but impress. And with a charming and fairly unique story that's suitable for most ages, it's a joy to watch. \n99/100",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "Quite possibly the most overrated spider man movie. Still worth watching though",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "Great movie. The best part of it is absolutely the animation, that sticks to comics animation style and looks so great and innovative.",
            "review_date": "2022-01-08",
            "source": "rt"
        },
        {
            "content": "The best super-hero film ever!",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "if you love spider man and animation this is the movie for  you",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION LIVE ACTION",
            "review_date": "2022-01-05",
            "source": "rt"
        },
        {
            "content": "Worlds best Spiderman Movie, enough said",
            "review_date": "2022-01-05",
            "source": "rt"
        },
        {
            "content": "Cleverly done. I like the way they incorporated each of the different animation styles together. Very clever.",
            "review_date": "2022-01-03",
            "source": "rt"
        },
        {
            "content": "Audiences may have supposedly panned it slightly, but Into the Spider-verse feels less like Spider-Man, more philosophical text on the very nature of the superhero genre in the zeitgeist. Drawing further from a wide array of concepts and multiverses to tell the highly personal story of Miles Morales really drives home the importance of both heroes and the people that support them and draw power from them. Did so good that the MCU decided to copy it entirely for its entire Phase Four designs.",
            "review_date": "2022-01-01",
            "source": "rt"
        },
        {
            "content": "Divertido, atrapalhado, viajado e engraçado. Miles tem seu carisma, e essa animação tem seu charme no conjunto dos personagens. Músicas insanas e que elenco viu!? Parabéns a equipe que fez esse filme totalmente para os fãs. Vale a pena.",
            "review_date": "2022-01-01",
            "source": "rt"
        },
        {
            "content": "The animation features a new and revolutionary style: mixing 2D and 3D, with comic book strokes. This makes the movie very good, but of course the story, the main character development is impressive, albeit simple.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "The movie for life, love him!",
            "review_date": "2021-12-30",
            "source": "rt"
        },
        {
            "content": "EVERYTHING! AND I MEAN EVERYTHING ABOUT THIS MOVIE IS PERFECTION!!!!",
            "review_date": "2021-12-30",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie. Miles Morales is an undeniable legend. The cinematography, beautiful. I also loved how Sunflower comforted him.",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "Good movie to watch.....",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "easily the best spider man movie released. Miles makes an amazing and charismatic protagonist which audiences can't help to love. The plot is consistent and compelling and makes us laugh, cry and scream with excitement. The animation is breathtaking and is like eye candy. Fantastic movie absolutely recommend.",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "Visually spectacular with a unique style and charm. The story is well written and even though the cast is quite large it all fits together splendidly. The pacing is also very good as is the soundtrack, the movie really has few shortcomings.",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "Melhor filme de animação do ano melhor homem aranha melhor gráficos melhor música melhor personagens e melhor final",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "BY FAR the best-animated movie I've ever seen PERIOD.",
            "review_date": "2021-12-28",
            "source": "rt"
        },
        {
            "content": "Good across the board, but not a standout. The Animation style is unique and flavourful and the script and voice case do great. As the first big screen outing for the larger Spider-man pantheon, it did ok.",
            "review_date": "2021-12-27",
            "source": "rt"
        },
        {
            "content": "Great movie just like you are watching a comic book being read. The editing is wonderful without any flaws, this combined with the music makes it super!",
            "review_date": "2021-12-26",
            "source": "rt"
        },
        {
            "content": "This is one of the best Spider-Man and animated movies I've ever seen. The movie brings the amazing story of Spider-Man's Multiverse with an extremely beautiful animation style that I've never seen before.",
            "review_date": "2021-12-26",
            "source": "rt"
        },
        {
            "content": "A pretty good movie that captures the visual awe of the comic books the film is based on, very good story as well as characters particularly Jake Johnston as Peter B Parker making him a contender for one of the best Portrayals of Spider-Man in any form of media",
            "review_date": "2021-12-25",
            "source": "rt"
        },
        {
            "content": "Great! Pretty movie, innovative, characters insertion on a justificate mode, inmersive trama that give a lot of talk about and a lot of movies to future. if there are political manifestation, not noticeable.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "This is my second favourite Spider-Man film. I love the animation style, I love the story. It takes everything that I love about the comic books and puts it on screen this is a comic book come to life, and I love it.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "Everything is just brilliantly made, highly recommend",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "One of the most overrated superhero films of all time. Seeing Miles Morales on the big screen for the first time was great and I can’t wait to see him in the MCU. Unfortunately, Kingpin was massively overpowered. Also the comedy of Nick Cage and Spiderpig got annoying very quickly. The movie was no better than any other big budget cartoon superhero movie. ",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "A great Spiderman film and unique animation. A good plot but not enough to push it into the top tier superhero of all time category.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "Rating: 9/10. 92/100",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "I know I said I prefer Tobey's Spider-Man, but Miles Morales has made his appearance and this is hands down the best Spider-Man movie that Sony has created. And that is probably an understatement!",
            "review_date": "2021-12-22",
            "source": "rt"
        },
        {
            "content": "great movie possibly the best spider-man movie ever",
            "review_date": "2021-12-22",
            "source": "rt"
        },
        {
            "content": "So f*cking incredible. every time I see it, it becames better. Every time I think of it, it gets better. Woah",
            "review_date": "2021-12-21",
            "source": "rt"
        },
        {
            "content": "the movie script is boring and too predictable.",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "This movie is incredible. A true masterpiece of animation and storytelling. The designs are absolutely beautiful. The sheer potential this movie has and capitalizes on is jaw dropping. I think this movie is a must see for everyone.",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "Esse filme nos faz sentir saudade de ver animações, muito bem feito, se respeita muito e é muito bem resolvido em si mesmo. Roteiro não muito inovador, porém este não é o foco.",
            "review_date": "2021-12-20",
            "source": "rt"
        },
        {
            "content": "The best superhero movie of all time 🙌",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "SPEECHLESS. WHAT A BIG STORY OF EVERY SPIDER IN EVERY UNIVERSE. THIS MOVIE IS BRILLIANT!",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "the worst spiderman movie",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "One of the best things to come from Spiderman and one of my favourite movies. There's very little I can complain about. Parts of this movie look like they would've simply been better looking if they weren't animated on two's. And I wasn't the biggest fan of Spider-ham or Penni Parker. Aside from that, everything was fantastic.\n\nVisually this movie looks great, especially with its creative use of camera angles. The action was great to look at, a lot of the comedy landed perfectly, and when it got serious it did that very well. This was the first time I had ever seen Miles Morales and he was a joy to watch, he's written excellently. I had previously seen Gwen and of course Peter, and they were great in this movie as secondary main characters. The other three members of the team didn't get much time to shine, but I think it was better to focus on the main three rather than sacrifice some of the time they got or make the movie much longer to flesh out six different protagonists.",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "this movie is one of the best animated/spider man movie ever made! what I like about this movie is that the animation was new/fresh, the characters were so intriguing, the voice acting was perfect, they balanced all the characters perfectly, every bit of the movie is beautiful, the story was intriguing, miles was a perfect character, his growth was perfect, so many cool references, Gwen and miles relationship was perfect, the music was perfect, the villains where perfect, all of miles relationships where perfect and I love the father-son relationship with peter and miles. basically what I'm trying to say is that this movie is perfect. the only thing I wish they did was to give more time with spider noir, peter porker and peni parker but that's a nitpick.",
            "review_date": "2021-12-18",
            "source": "rt"
        },
        {
            "content": "melhor animação do homem-aranha,a historia do Miles não é tão fiel aos quadrinhos mais sem duvida é muito",
            "review_date": "2021-12-18",
            "source": "rt"
        },
        {
            "content": "(No Spoiler Review!)\n\nThis is, in my opinion, the best movie adaptation of a superhero comic that has ever been produced. All the characters are interesting and memorable, and, while there are many characters in the film, it doesn't lose sight of the fact that it is a Miles Morales origin story. The animation is outstanding, and mixed with the superb voice talents, great soundtrack, and interesting story, it makes for a great time! On a side note that is more opinion than fact, if you have never read a Miles Morales or Spiderverse comic, I recommend NOT reading any before watching this film, to prevent any surprises from being ruined! I hadn't read any before watching Into the Spiderverse, and I wouldn't change that even if I could.",
            "review_date": "2021-12-18",
            "source": "rt"
        },
        {
            "content": "omg this is one of those afternoon session type stories there are a lot of different people fighting to save the world but this is 1000 on the note",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "Worst movie of all time",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "I loved that there were multiple spidermans!",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "Made me fall asleep the worst spiderman movie ever",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "Imo the best animated movie out there",
            "review_date": "2021-12-16",
            "source": "rt"
        },
        {
            "content": "Different Spider men coming together in an Animated movie? Say less.",
            "review_date": "2021-12-15",
            "source": "rt"
        },
        {
            "content": "It was so boring  the story is just bad",
            "review_date": "2021-12-15",
            "source": "rt"
        },
        {
            "content": "Flawless. Just when you thought that Hollywood was done producing original works here comes Into The Spiderverse with its amazing comic book style and heartfelt story. 5/5",
            "review_date": "2021-12-15",
            "source": "rt"
        },
        {
            "content": "Fantastic animation, exceptional storytelling, and a tremendous cast make this a terrific Spider-Man movie.",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie, and not because there's anything particularly amazing about it but because there's not really anything bad.",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "Stop trying to change the identity of a superhero to pander to wokeists",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "I can't tell what is and isn't reality anymore! This was story driving, character forming, humor filled, movie of the century! Thank you Sony for agreeing to make a sequel!",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "In my opinion, even though animated, this is the best Spider-man movie of all time. 10/10",
            "review_date": "2021-12-09",
            "source": "rt"
        },
        {
            "content": "A new version of the beloved web-slinger leads to the best Spider-Man film ever made.\n\nRead the full review at: https://neoncamerareviews.blogspot.com/2021/12/spider-man-into-spider-verse-2018.html?m=1",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "Incredible movie. A bit late for this review, as the movie came out 3 years ago, but to this day it remains my favourite movie. The animation is so smooth, and there are so many details going on. The rewatchability of this movie is incredible. The soundtracks really compliment to the mood, and are incredible on their own. The messages and ending keeps you on the edge of your seat, with the gripping last fight scene keeping you extremely invested in the movie. You can feel yourself relate and root for Miles, and you can really see his emotions alongside him. Absolute hands down an incredible movie, and my favourite ever. It doesn't delve into the typical gore genre of superhero movies to keep the viewers invested, and can be watched by all ages. Best to watch at home though for a few people, as the effects in the theaters may be a bit too much (especially older citizens). The movie also has some very funny moments that are perfect for each situation, unlike other movies that use jokes halfway through the climax. Would definitely recommend to anyone who enjoys films in general. 10/10. The animation is smoother than water, the acting is just perfect, the jokes land right on target, and the movie in general keeps you glued to the story. Hyped up for the sequel coming out next year. Definitely recommend, 10/10.",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "2nd best Spiderman movie thus far 11/10",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "La película es buena y mala",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "Holy cow absolutely amazing. Love the art style! Almost cried at the end!",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "Rushed as hell. Characters poorly characterized, story never really explaining what is going on, third act absolutely emotion-free. It wanted to be \"fresh\" but it looks more like a Spider-Man's parody movie. Exactly everything I don't want to see in a cinecomic, in that it reminds me of that awful Thor Ragnarok. The worst Spider-Man movie I have ever seen.",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "truly incredible, left me speechless!",
            "review_date": "2021-12-05",
            "source": "rt"
        },
        {
            "content": "I've never seen an animated movie like this one. It feels like you stepped inside of a comic book. Well done Lord & Miller.",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "Una obra maestra de la animación, desde la animación hasta la historia son geniales, muy divertida, memorable y buenos personajes, muy basada la película",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "I love everything about it… the Animation is supercool, the music is great, we got so many different Spider-Man's, the multiverse is real! I mean helloooo",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "Muy recomendable , es muy divertida me gusta spider man muy memorable y es una de las mejores peliculas animadas de los ultimos años",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "One of the best animated movies I have ever seen. The comic book visual style was so fun to watch from the beginning to the end. Miles is an amazing character and the movie overall had a great message. Two big thumbs up",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "Possibly the best Spider-Man movie and in general an awesome movie with fairly unique and cool looking design, interesting characters and just really a fun must see experience that can rival any of the best superhero movie",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "The movie was hilarious and poignant.  It is both the nerdiest and most inviting superhero film I've seen.  It had a dreamlike quality about it and the visual style which unites the upcoming mixed universe in Phase 4, used animation that looks both computer driven and hand drawn.  It captures the interconnectivity of the comic books the way no other superhero film has done to date.",
            "review_date": "2021-11-29",
            "source": "rt"
        },
        {
            "content": "Into The Spiderverse is a refreshing take on the iconic Spider-Man superhero. The introduction of a younger superhero poses fascinating new challenges and is supplemented nicely by more experienced characters. Father-son, mentor-student, and friend-friend relationships are all touched upon in this movie, and are explored with plenty of well-placed humor and relatable situations that elevate the movie into its own success and unique style. Plus, the soundtrack is superb.",
            "review_date": "2021-11-29",
            "source": "rt"
        },
        {
            "content": "This movie is perfect. 'Nuff said.",
            "review_date": "2021-11-28",
            "source": "rt"
        },
        {
            "content": "yes, yes and yes, i loved this",
            "review_date": "2021-11-28",
            "source": "rt"
        },
        {
            "content": "melhor filme do miranha ixxqueci",
            "review_date": "2021-11-26",
            "source": "rt"
        },
        {
            "content": "Straight out of a comic book, one of the best super-hero movies of all time!",
            "review_date": "2021-11-23",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider-Verse Ok this film is one of those movies at first was not excited for mainly because I was not a fan of the animation and now picking this movie up and watching it I was totally wrong about this movie is Flawless I love when all the villains are on screen with all of the Spiderman's also but the Origin was better than Peter Parker's Origin and this movie was sad also mainly when Peter Parker died at the beginning of the movie really hit me I like mainly Prowler looks really good and it being Aaron Davis I was just shocked and the whole ending to this movie is amazing where we have everybody go back to the universes and Miles defeats Kingpin but this was a flawless movie one of the best-animated movie of all time and one of the best spiderman Movies so I give Spider-Man: Into the Spider-Verse an A",
            "review_date": "2021-11-23",
            "source": "rt"
        },
        {
            "content": "An incredible piece of art. There is passion and creativity in every frame, from the opening credits to the last note. Everything is thought out and serves the purpose of telling the narrative. There is something wonderful when artistic passion, strong characters, and good storytelling mix, and this is one of those rare instances. Watch this movie!",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "Best Movie in my opinion. Animation are really good and maybe the best Spider-Man movie ever.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "The best spiderman film so far - no arguments.",
            "review_date": "2021-11-19",
            "source": "rt"
        },
        {
            "content": "Meh. Not great. Dragged on a bit, not funny.",
            "review_date": "2021-11-17",
            "source": "rt"
        },
        {
            "content": "The best animated movie of all time.\n\nThat should suffice as a review.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "The perfect Spiderman movie and one of the most perfect animated movies to debut. \"Spiderman: Into the Spider-Verse\" tells an incredibly moving story that has powerful messages throughout. The animation is phenomenal, and is done in a way to make it seem like an actual comic book is coming to life in front of your eyes. This is easily the most comical of the Spiderman films, even bringing in several references to the comic books themselves. The humor is handled very well, and the banter between Miles and Peter, Miles and Gwen, and Miles and his dad, Jefferson, is extremely entertaining to watch. The villain is also one of the best to ever hit the screen, being a villain that you feel sorry for and even begin understanding his motivations for what he does and why he does it. However, I think where this film really shines is in its action, which is done so well and is so fun to watch. The cast is absolutely perfect, and the ending will leave fans dying to see the sequel.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "Wonderful. I see no flaws. I've watched this time and time again and I still see new things every time. Purely Poetic.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "This film is amazing! It contains many references of comics, movies, etc. Lots of action, wonderful songs, unedited characters and many other things. In short, this film is a work of art!",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "una historia muy original y fresca de nuestros spider amigos...es como una obra maestra esta nueva historia aracnida y con un estilo muy juvenil",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time. everytime you watch you can notice even more clever tricks by the animators and it is a super fun film. It's my go to whenever I don't know what to watch and it never gets old!",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "When I first saw the trailer a year prior I wasn't feeling the animation, I was wrong. The animation worked perfect for telling an awesome and compelling story.",
            "review_date": "2021-11-12",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece. The animation is on point and the music is amazing. The movie is full of humor, but also with a lot of emotions. The story is great and it gives the characters enough time for their development. What also makes it interessting to watch is the villain Prowler. He was great and it was heart breaking to see that its Miles Uncle. It was very fun to watch, and it was also emotional. Cant wait for the sequel!\n10/10",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "it is amazing but i wish they would have used ultimit peter for the one who died",
            "review_date": "2021-11-09",
            "source": "rt"
        },
        {
            "content": "I really loved this film. It was a lot of fun to watch. The characters, specifically the villain, were great. I also found the performances to be good as well. The music in the film is also something that should be mentioned positively too. I can't wait for the sequel.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man film ever made",
            "review_date": "2021-11-07",
            "source": "rt"
        },
        {
            "content": "A fantastic animated film! Much better then I expected!",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "A vibrant and authentic Spider-man story.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "SONY demostró que si pueden hacer una película de Spiderman sin depender del dinero en la taquilla. Sino más bien de la dedicación de los animadores y guionistas. Lo meujor que he visto de Spiderman en mi vida.",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "This movie is just amazing: \n1. The animation is insanely unique and the perfect style for this world: so vibrant and colorful with striking and memorable imagery in almost any scene.\n2. The story balances multiple characters but gives each of them great moments and development. Miles is a perfect protagonist for this story, the slight subversion on the older Spider-Man fits, Kingpin is given enough backstory to understand, and the Prowler twist is handled so well. Amazing voice acting for each of these characters as well.\n3. The plot should be all over the place, but the writing and directing smoothly moves you through this movie like you're turning the pages of a comic book.\n4. I really felt the weight of this world and the characters: when Spider-Man is killed, I am reacting in the same way as Miles- watching a seemingly invincible icon and personal hero get beaten by the bad guy. I felt Miles struggles with his dad and the expectations on him. When Miles finally gets in touch with his abilities and accepts that this is who he is, I truly felt for him. Hell, the Stan Lee cameo is even one of the most emotional scenes in the movie: my sister and I were both crying when we watched this in theaters the first time after his death. \nUltimately, this movie is just a Spider-Man fans perfect movie, and this movie is an experience that I will always enjoy and remember fondly, and I regard it as one of if not the best animated/superhero movies of all time.",
            "review_date": "2021-11-04",
            "source": "rt"
        },
        {
            "content": "A must watch before you leave this planet film where it test the possibilities of what animation can advance to and maybe one day be in the rankings to aim for Best Picture with the right script and direction with the likes of the minds of three directors - Peter Ramsey, Rodney Rothman and Bob Persichetti, and the duo of Phil Lord and Chris Miller. Absolutely mind-blowing stylized animation that viewers will never have expected from the trailers. Sony really found its mark and style in the animation sector and hopes to bring the same quality in future installments and original IPs. A very diverse cast and who knew an African-American Hispanic Spider-man could be the new inspiration for the next generation of animators and story-tellers. Can't wait for the follow up sequel to this universe.",
            "review_date": "2021-11-04",
            "source": "rt"
        },
        {
            "content": "A true work of art. Aside from Spider-Man PS4, which I have yet to play, this would probably be the greatest form of media based on the character. I can't think of a single flaw in this movie. Masterpiece.",
            "review_date": "2021-11-03",
            "source": "rt"
        },
        {
            "content": "Com certeza a melhor animação de filme que eu já vi, o roteiro é bem desenvolvido, tudo é muito bom sério meus parabéns pelos criadores e foi o dinheiro mais bem gasto em um filme do cinema",
            "review_date": "2021-11-03",
            "source": "rt"
        },
        {
            "content": "Don't get the hype at all",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "Great story and a fantastic art style.  In my opinion, parallel universes are usually gimmicky, but it's actually pulled off well here.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "My all time favorite movie! Can't wait for the sequel! I hope I get to see more Peter B. Parker aka Nick Miller.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "The best animation movie ever created",
            "review_date": "2021-10-20",
            "source": "rt"
        },
        {
            "content": "SO GOOD WATCH NOW you have to watch this perfect story and animation",
            "review_date": "2021-10-19",
            "source": "rt"
        },
        {
            "content": "Spiderverse features one-of-a-kind animation without diminishing its characters and plot. The character growth, flashy fight scenes, and flexible soundtrack add up to one of the most enjoyable and rewatchable superhero movies of the last ten years.",
            "review_date": "2021-10-09",
            "source": "rt"
        },
        {
            "content": "With stunning visuals and a great story, this is my favorite movie of all time.  It expands from the stereotypical spiderman story and makes it 3,000,000 times better.  It is inspiring and is a must see.  Go watch it right now.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "This movie is my all time favorite. The animation, the music, the attention to detail throughout the entirety of the film, and the plot in general all compliment each other so well. Spider-Man: Into the Spider-Verse is truly a cinematic masterpiece.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "Absolutely loved this film. Never been a fan of animated movies/shows but this one blew me away. All the characters are captivating, and the story is enthralling and deeply touching. Its an extremely fun, joyful movie and a must watch.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "Consider this review less of a review and more of a public gush about its uter awesomeness in a way amost everyone and their dog has done before but who cares. The moment i started watching this movie i wanted to start it again and watch it forever because seriously? This film is more of an experience than it is a film when in the cinema because of it's stunning colours, style, textures, speeds and everything inbetween. But not only is this beautiful and adventurous to look at but the story and writing is great as well. Every character in this rich cast has a part to play in defeating the brilliantly designed villains and helping each character reach their carefully planned out goals and the moment they do this it makes me feel good in my soul. On top of this, this movie smushes together comedy and wit to an astonishing extent making every line re playable and analysable. It's also, fast paced and has really well done exposition and has comic relief and the right amount of fan service and great representation and amazing, really well fitting voice actors and i could gush about how close to perfect it is until i die and i probably will. But in my head. For now i will just have to get used to watching it on repeat and wondering why i never get bored. What an artistic but fun revolutionary masterpiece.",
            "review_date": "2021-10-06",
            "source": "rt"
        },
        {
            "content": "Sony pictures animation by far greatest achievement they have for now is masterful every way the animation is epic the story charathers world building villians also the ending and the brilliant final scene music score even halorious post credit scene and credits",
            "review_date": "2021-10-06",
            "source": "rt"
        },
        {
            "content": "Una de las mejores películas de Spider-Man.",
            "review_date": "2021-10-04",
            "source": "rt"
        },
        {
            "content": "Visual and audibly stunning. Brilliant story telling.",
            "review_date": "2021-10-04",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man movie ever made so far ",
            "review_date": "2021-09-29",
            "source": "rt"
        },
        {
            "content": "Prowler was a good character",
            "review_date": "2021-09-27",
            "source": "rt"
        },
        {
            "content": "“Spider-Man: Into the Spider-Verse” is astonishing and groundbreaking! Best film of 2018!",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "Super fun alternative look at the world of Spider-Man through a tale of the multiverse.  Many interesting and funny characters and many famous actors providing the voices.  The visuals are stunning.  Beautiful artwork. The soundtrack is terrific.  The script and dialogue are very engaging.   I am not a superhero Geek and don't know too much about the storylines, but this is great fun.  John Mulaney as Spider-Ham is great comic relief.  This is good for adults and kids.",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "An excellent 3D action but you can also enjoy this movie on a Regular TV.  Highly Recommended, its Hilarious!!!!",
            "review_date": "2021-09-26",
            "source": "rt"
        },
        {
            "content": "Loved this one! So grateful for the fresh take!",
            "review_date": "2021-09-24",
            "source": "rt"
        },
        {
            "content": "The best Spider-Man film put to screen, Into The Spiderverse is a deep, introspective look at what it means to wear the webs, brought to life with a great script and the best animation I've seen in a long time.",
            "review_date": "2021-09-22",
            "source": "rt"
        },
        {
            "content": "This animated Spiderman movie was great. Shameik Moore, Hailee Steinfeld, Jake Johnson, Mahershala Ali, and the rest of the cast did a great job on this movie. The plot of the movie was entertaining and dramatic. It's a great movie for an entire family. If you haven't seen this movie yet, check it out sometime. You'll enjoy it.",
            "review_date": "2021-09-19",
            "source": "rt"
        },
        {
            "content": "I've never seen a bad Spider-Man movie, you'd be pretty hard pressed to do so. Still haven't now but I'd say that it'd also be hard pressed to top this diamond of a movie because this has cemented it's place as my All-Time favorite Spider-Man movie. No disrespect intended to Peter Parker (The OG) but I've come to like Miles Morales' origin story better. Also add the other alternate universes of Spider-Men (and Spider-Women when you add Gwen Stacy and Peni Parker to the equation) and you're in one heck of a ride. You also get to see a various amount of villains such as Green Goblin, a lady Doc Oct, Scorpion, Tombstone, Kingpin and my new favorite, the Prowler (I REALLY loved his design in this movie). Small negative would be the omission of Venom & Carnage to add into this already crazy melee of characters but the movie still did it's thing without them. There is but so much you can pack in a 2 hour movie but I expect none less from Marvel. I'm also grateful Sony had their hands on this one letting the story and narrative of the plot be great, while this probably still would be decent under Disney's supervision, it would've been watered down to make this movie a 4 Star at best.",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "I watched the reviews which said this was great, but, like, really? its CGI, whats the point? we have live-action spiderman? meh, its not for me.\nBUT, heck, its great, REALLY great. Way better than it should be. \n\nAwesome. Loved it.",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "Ew.. Watch the Marvel version.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "Phenomenal. The most visually stunning movie I've ever seen. The animation is 2nd to non. Sound track is amazing. Story is a amazing. Characters are amazing. Can't express how spectacular the artwork is. This is the best animated movie ever in my opinion. Masterpiece!!! 100/100",
            "review_date": "2021-09-05",
            "source": "rt"
        },
        {
            "content": "Unique comic book-like style, great storytelling, and amazing use of a great number of superheroes and villains. Gets slow and then becomes absurd until the end, but breathtaking overall.",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "This one is by far! The best Spiderman movie ever made!",
            "review_date": "2021-08-29",
            "source": "rt"
        },
        {
            "content": "Normally whenever there is an introduction to a new alter-ego for a superhero we all know and love, it is often met with backlash. No one can accept Dick Grayson as Batman, Calvin Ellis as Superman,  Carol Danvers as Captain Marvel, Wally West as The Flash - the list goes on. And Spider-Man is one of, if not the most popular and likeable superheroes out there. So in such a condition replacing our beloved Peter Parker with some new random guy could have been a disastrous idea. But not only did this movie take the risk, we're glad it did.\nSpider-Man: Into the Spider-Verse is the kind of a superhero animated movie I wanted to see - one with traditional animation done in the style of stereoscopic 3D, with continuous symbols of glitches. Personally I consider watching two superhero movies to be the most connected with watching a comic - Zack Snyder's Justice League and this. And out of the two ZSJL feels more like some painting more than an actual comic, so this one takes the cake for it. The speech bubbles, the panel swipes, the colour splashes; everything make this movie look like watching a Spider-Man comic come to life.\nPersonally I'm all in for the diversity in the characters. Normally I am annoyed when diversity is their only trait. When such a character is added just for the sake of existing, it just makes it look like a wasted effort, and what makes worse is that we can't even point it out without upsetting some people. Miles Morales, however, absolutely does not feel the same. The kind of a person he is, the way he turns into Spider-Man and meets the other heroes to learn more about who and what he is, everything seems to come out naturally.\nThe story is very well thought out, which is also another reason why it feels so natural. If I were given to introduce a character and bid farewell to the renowned one, I could have never done it as well as this did. It introduced many different types of Spideys, made us feel emotions for all of them, had us sympathise with the bad guys all the while making us laugh and cheer at the fights. See this is exactly what I'd want from a comic book movie, especially a superhero one. It should not just be, but actually feel like we are immersed into the environment, even though it is an animated movie.\nMy favourite character in this movie was Spider-Noir. He was hilarious as a detective, always talking about everything like it is supposed to be a mystery. He also looked cool, so there's also a plus to that. Then I also liked Miles Morales himself. Whatever the movie was wanting me to feel for him, I did so. As he builds his character development from being a clumsy teenager to the most powerful Spidey, it was a spectacle to watch.\nI really wish to see more of these. Miles Morales is already one of my favourite characters now, so even if in future he slowly replaces Peter Parker as the face of Spider-Man, I won't feel bad about it. The recent PS5 game, if I hadn't watched the movie, wouldn't have received my interest no matter however good it was, since I would never accept anyone else as my Spider-Man. It really seems to be a great time to be a Spidey-fan. I hope it lasts long.",
            "review_date": "2021-08-28",
            "source": "rt"
        },
        {
            "content": "This movie is an absolute joy for comic book fans from start to finish. The animation is stellar, The story is amazing, and the humor is on point! Miles Morales is a very compelling version of Spider Man that is very relatable. This movie is an easy 10/10!",
            "review_date": "2021-08-27",
            "source": "rt"
        },
        {
            "content": "Without a doubt my favorite superhero movie of all time.",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "5.0/5.0 Masterpiece ",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "Esto es una belleza, quieras o no, la mejor pelicula de spiderman",
            "review_date": "2021-08-24",
            "source": "rt"
        },
        {
            "content": "A completely immersive cartoon that gives everything that it has to the audience while making it all seem effortless. So much fun to watch!",
            "review_date": "2021-08-24",
            "source": "rt"
        },
        {
            "content": "It was to short. After the end I was like \"Can I have more please?\" I guess I will have because a sequel is going to be done in 2022. The only thing with this is that the first movie set the bar so high that I fear to be dissatisfied. It was such a great adventure. It was surprisingly funny. I wasn't ready for a great comedic level. I also adore the animation. It is so original and beautiful. The sort of comic book format was so pleasing to watch by the numerous colors and the round patterns. At some moments it seemed really real and at other it felt so animated and that's what makes it nice and enjoyable. The fights in that sort of animation was delicious! The only issue here is the music choice, for me. I agree that it goes with Miles' character and the town, the time it is happening but, for me, rap music doesn't attract me so it was not what I preferred. To continue the great points enumeration, the story was perfect. Multi-universe managed perfectly with sense and real consequences that we see on screen. And the fact that there is a lot of different Spider-person makes it even better. Remember, anyone can be spider-man and the directors of this film are genius.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "Es una experiencia sublime; la animación es sorprendentemente espectacular y la trama es muy entretenida; es la mejor película de Sony Pictures Animation. ¡TOTALMENTE RECOMENDABLE!",
            "review_date": "2021-08-18",
            "source": "rt"
        },
        {
            "content": "Great movie with a good story and characters.",
            "review_date": "2021-08-17",
            "source": "rt"
        },
        {
            "content": "The best Spiderman movie ever and is a perfect adaptation of Miles.",
            "review_date": "2021-08-12",
            "source": "rt"
        },
        {
            "content": "A lovely take on the multiverse. This was a visually stunning and surprisingly accurate account of the spiderverse. Character portrayals were on point. While some awkward transitions occurred I greatly enjoyed this film.",
            "review_date": "2021-08-11",
            "source": "rt"
        },
        {
            "content": "literally. pure. perfection. I've watched this film 6 times can't wait for spiderverse 2 :)",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "Who could have thought that Sony Animation, the minds behind such catastrophic films such as The Smurfs and the Emoji Movie, could not only make one of the best animated movies, but also one of the best super-hero movies in the world. This movie, from it's dazzling animation to it's story is brilliant and memorable, and the best Spider-Man movie out there without a doubt. If only Sony could ever make something like it again. 10/10",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "An interesting dabble into Spidey's animated alternates.",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "OMG, the BEST movie, one of my favorites of all time. Right there with Spider-Man 1 & 2 for me (Tobey Maguire of course).\n\nTruly a fun, engaging and thrillingly great experience!",
            "review_date": "2021-08-03",
            "source": "rt"
        },
        {
            "content": "Literally everything in this movie was perfect. Even the little things like the colors and background music were top notch.",
            "review_date": "2021-08-02",
            "source": "rt"
        },
        {
            "content": "Amazing film. Every character is amazing. The animation is fantastic. Entertaining from start to finish ",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "It's literally the most beautiful animated movie I have ever seen. Just great movie for any age I recommend this 100%",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "One of the best, if not THE best spider-man film. Has humor, heart, and a great message. The animation is breathtaking, and the acting stands out. A must-see for anyone into superhero fliks.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "One of the best movies in cinema history! Even people claiming that the superhero genre isn't true cinema have to admit that this is a work of art. With arguably the best animation in cinema, a magnificent character arc for our main lead, a bunch of jokes that make you laugh out loud, a cast that put their souls into their work and a plot that acknowledges how plain dumb it truly is. This flick is like a rollercoaster, never stopping and giving you the time of your life! With a sequel on the way, this is one movie you want to catch in your web.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "Animation is insanely good!  So original.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "I AM SPIDER-MAN, BUT NOT THE ONLY ONE.",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "Damn this movie has very good animation and a pretty good story!!",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "Perhaps the best Spider-Man movie as of its release. Fantastic writing, funny jokes and a great reworking of Miles' story.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "THIS IS MY MOST FAVORITE MOVIE OF ALL TIME",
            "review_date": "2021-07-17",
            "source": "rt"
        },
        {
            "content": "It was great to watch,I think this movie is an apology for TASM series",
            "review_date": "2021-07-14",
            "source": "rt"
        },
        {
            "content": "This is an absolute must see movie!",
            "review_date": "2021-07-12",
            "source": "rt"
        },
        {
            "content": "me encanto una obra maestra sin duda",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "My favorite movie, without a doubt. Who knows what might happen in the future, but for now? Definitely my favorite.",
            "review_date": "2021-07-11",
            "source": "rt"
        },
        {
            "content": "The movie has a terrible message implying that everyone is special. The problem we as a society are starting to realize that when you tell everybody they are special then nobody is special. There is only one Spiderman and this movie killed him. ✌🏾✌🏾",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "An amazing animation delivers an amazing movie. This is an absolute must-see for all the Spidey fans",
            "review_date": "2021-07-08",
            "source": "rt"
        },
        {
            "content": "This by far is the best Spider-Man movie to come out to date it is both original well animated is a strong story and great character development. And this in this movie is quite literally a work of art we can pause the film and frame it as a poster.",
            "review_date": "2021-07-03",
            "source": "rt"
        },
        {
            "content": "Another flawless film coming out of Sony Pictures, Spider-Man: Into the Spider-Verse is a movie for all spidey-fans, young and old. Into the Spider-Verse blends perfect animation with the classic comic book style of drawing combining to make one of the most beautiful pieces of animation in the 21st century. Into the Spider-Verse has an intense and exciting story filled with character development and emotions. 5/5 stars.",
            "review_date": "2021-07-03",
            "source": "rt"
        },
        {
            "content": "The most visually mind-blowing movie I have ever seen.",
            "review_date": "2021-07-02",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider Verse is one of the best animated movies I’ve seen in a while. It brung comic book characters to the big screen, giving them an even bigger name. Miles Morales Spider-Man was heavily underrated, and after the movie it is now known as many people’s favourite superhero. It brung villains from the comics as well, and it had a good representation of the multiverse for new comic book fans.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "A masterclass in film making and a must see of the comic book genre. The animation is inventive, stunning and clever and the characters and story are amazing. It's just incredible. And this makes crap that came from the same studio *ahem emoji movie* look even more insanely awful by comparison. If you haven't seen it yet, what are you still doing here, go and watch it now!",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "Expected more from a spider-verse movie considering spider-verse is one of my favourite comics ever.  I was super excited to find out they were gonna make a spider verse movie so I went and saw it and at first I didn't like it but I like it now.  Excited for spider-verse 2 hopefully spider-man 2099 will be there more I have only watched the movie once though.",
            "review_date": "2021-06-24",
            "source": "rt"
        },
        {
            "content": "Artwork S tier. \nCharacter Interactions S tier.\nSoundtrack S Tier.\nCan't wait for the sequel",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "⭐️⭐️⭐️⭐️⭐️! Best animated movie ever.",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "I, a not superhero fan, this is a glorious movie, with amazing characters",
            "review_date": "2021-06-13",
            "source": "rt"
        },
        {
            "content": "Magnificent! So looking forward to the sequel in 2022!",
            "review_date": "2021-06-13",
            "source": "rt"
        },
        {
            "content": "I watched this on a weekend because I was bored and I was happily surprised how good this movie is with the freeze frame comic book images to the great plot. It makes me wish I saw it in cinemas.",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "Literally a masterpiece.",
            "review_date": "2021-06-12",
            "source": "rt"
        },
        {
            "content": "Probably my least favorite version of spidey so far but the animation was awesome",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Unpopular opinion, but I was not the biggest fan. I've never liked Miles, and they made Spider-Man into a kids movie. But I love the visuals, the animation is beautiful. ",
            "review_date": "2021-06-08",
            "source": "rt"
        },
        {
            "content": "Rich visual. Gret character and a good storyline.",
            "review_date": "2021-06-08",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest Spiderman stories I have seen. I don't think the original origin story of Peter is surpassed but absolutely is enhanced with the addition of miles and various others that add a multiverse twist. I think artwork is courageously outstanding, every frame of this movie could probably be a poster. Eye popping eye candy it is. I also can't believe the first time I watched it I was genuinely scared by a cartoon character (the prowler) I think it was the siren sound that got me scared for miles. If you love great stories, superheros and animation. This is your ticket to paradise.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "INCREDIBLE ! I'm a big fan of Spider Man, I've seen it film by film, but this one is without a doubt the best, it has references to the Sam Raimi trilogy, the Marc Weeb films, and the animated series. An incredible origin story. It features a new cartoon formula with a lot happening on screen at the same time but we can keep up with it all because the direction of the movie is amazing.It's amazing how they introduce a lot of characters but we managed to care about them, maybe because they are so striking ? For me and for many critics this is the best animated film ever, in my opinion it will be hard to beat. (10/10)",
            "review_date": "2021-06-05",
            "source": "rt"
        },
        {
            "content": "story wasn't awesome but the animation was godly",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "Es una de las mejores películas de superhéroes en general que eh visto con una gran trama y moraleja y personajes entrañables y bien construidos , no puedo esperar por ver la secuela .",
            "review_date": "2021-06-02",
            "source": "rt"
        },
        {
            "content": "This is one of the best films ever made. A true staple of animation and media as a whole.",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "This is where animated film peaks. An original, hilarious, heartwarming story of finding the self, and a smart remastering of the Spider-Man story. It can't get better than this",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "Melhor filme de animação já feito",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "I didn't like how much of an embarrassment this was to watch. Like Miles is weird around Gwen and I didn't like that, also he like freaks out or whatever and it's just embarrassing to watch. And Spider-Gwen felt like a show off for a while. I just never got into it.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "Great film to bring miles morales spider-man to life, love the idea of multiple different spider-men teaching him how to be spider-man. introduces many villians that either have never been seen on screen or haven't been seen often as well as a fun twist with doc ock making the character a female. really highlights morales's differences as spider-man compared to peter parkers spider-man while at the same time not making the character over use his powers. for first time fans of spider-man and who want to understand miles more, this is a perfect way to start.",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "a great execution a worthwhile watch",
            "review_date": "2021-05-25",
            "source": "rt"
        },
        {
            "content": "This was one of the best executed animated movies I've ever seen, with a fantastic score. I highly recommend this movie!",
            "review_date": "2021-05-23",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into The Spider-Verse is a fun irreverent take on the beloved superhero that is made only for true comic book fans.",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "I'm not gonna lie the animation wasn't the best just to me but other than that the action sweet especially the dope sequence at the end and a good soundtrack and an unexpected one from Juice Wrld and was pretty sweet and had good laughter.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Anyone can be a hero",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "Amazing visuals and you can really feel the characters emotions. Great plot also and is interesting the whole entire time. One of my favorite movies if not my favorite movie of all time. You like this movie more and more every time you watch it. Would recommend and if I could give it a 11/10 I would",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "Let me explain. Spider Man: Into The Spider Verse has excellent character moments, hilarious humour and mostly satisfying payoffs to plot points that were set up earlier in the film. However, its plot is riddled with holes and conveniences and most of the villains get very little development, making them very forgettable.",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "It's a great movie. It introduces us to the multiverse of the friendliest superhero, that's right, Spider-Man This movie shows how an inexperienced little boy with fears takes on the mantle of Spider-Man after seeing the masked hero of New York die in front of his eyes. Along with other versions of Spiderman, this boy discovers what he is capable of doing and what it really means to be Spiderman.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Beautiful animation, story, and characters!",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "This ís the best superhero movie ever!",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "Beautiful film, hands down one my favorites always and forever.",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "The best realised comic book on screen since American Splendour and best full animation since Team America. Into The Spider-Verse achieves the remarkable feat of having multiple spidermans (spidermen?) brought from different dimensions fighting an oversized baddy with a hadron collider who just wants his family back seem, err, believable. It does this with great cut aways, a great deal of humour - combining the lessons learned from Deadpool and Detective Picachu with a reverence for the subject matter and a string of insider nods. Classic storytelling in the believe in yourself plot line, totally relatable, totally excellent.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "One of the best comics I ever seen!! ",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "This is just fucking AWESOME",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "The best animated movie ever made, hands down. Its colorful, well drawn, and styleish. Tied for best Spider-Man movie ever made. It makes me care about Miles, a charcter I new of, but didn't go out of my way to learn. Besides all of the Spider-People, I also loved the side characters, especially Uncle Aaron/Prowler and Jeff Davis (Miles' Dad). The soundtrack was great. I'm not generally one for rap , and there was a whole lot in this movie, but it fit in with the tone of the movie, both rythmiclly and lyriclly. The plot was kinda generic, but the movie isn't plot driven, its character driven, and the characters are incredible, so I have no complaints. The only issue I had with the movie was how Miles' storyline with his dad was kinda left hanging. His dad tried to confront him through the door, and that led Miles to hug his dad at the end of the movie, but he didn't know it was Miles, so that didn't really give Jeff the closure he needed for his arc with Miles, but maybe thats me digging to far into the movie. Over all, 9.5/10.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "Amazing art style. Great story. Great music. Great action. Great film!",
            "review_date": "2021-04-29",
            "source": "rt"
        },
        {
            "content": "An absolute Pariah In cinematography and animation. Unlike any other movie Spider-Man: into the spider verse manages to sustain both the comic-like structure of the world around miles as well as the story telling of said world. The movie is so perfect that it's rewatch ability is endless. 10/5",
            "review_date": "2021-04-27",
            "source": "rt"
        },
        {
            "content": "The movie is good not great. The plot is interesting but gets a bit clustered. The animation was interesting however did not add much to the movie.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "Pretty Dang Good, But it's praised a lot these days",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "I really liked the animation quality. It's like a comic book been animated.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "Best Spider-Man movie made yet!  Story, Visuals, Soundtrack....everything was top notch!",
            "review_date": "2021-04-16",
            "source": "rt"
        },
        {
            "content": "The greatest Spider-Man movie of all time. Hilarious, beautifully animated, and containing enough grand action scenes to ensure a truly great cinematic experience.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "A complete surprise both in animation and in history, despite the already several films about this superhero, this one will manage to stand out perhaps as the best of the character.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "I love this film. AMC  has played it three times in the past month and I've attended each showing.",
            "review_date": "2021-04-15",
            "source": "rt"
        },
        {
            "content": "Absolutely LOVE this film and so does my son. Watches it constantly and if it comes up on the tv we have to put it on. Love imagery and really captures the classic comic book style. The storyline is good and flows through out. \nDefinitely recommend a watch for any Marvel fans, this is the one",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "Amazing - absolutely AMAZING!!!",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "A triumph.\nI would go as far as to say 'Spider-Man: Into the Spiderverse' is the most visually stunning film I've seen; with a truly unique and revolutionary comic-book-esque animation style, every frame is poster worthy. Its achievements are far from lying only in the aesthetic department, another standout feature for me being the the soundtrack. 'What's Up Danger' couldn't have been a more fitting superhero theme to match its urban hip-hop context, and other tracks such as Daniel Pemberton's 'The Prowler' will surely give you goose bumps.\nThankfully this film doesn't suffer from the ailment of previous Spidey films, either. We're introduced to an intricate web of wacky characters (looking at you, Peter Porker) without the plot being over muddled.\nCongratulations to everyone involved in this clever modern classic that exploits the medium of animation to a new potential and shows us just how much more there is to discover in this realm of filmmaking.",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "The best animated movie I've ever seen.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "Extremely well done animated film, with humour all around and a very interesting multiverse theory spin on Spider Man. Shows that not all superhero movies have to be live action.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "Now let me just start by saying this movie should be called spiderboi because that's what it's really about. I don't normally give out one stars very often, but i gotta whip one out for this bugged out movie. First of all it doesn't even make sense, I went to my local Walmart and got in my mobility scooter, I placed my hand on some woman's shoulder and said \"hey\" just like the movie told me! Next thing I knew I was being wheeled out of the store for just listening to Spider-Man. 1 out of 5 stars because I had to get my pizza bagels from target next door.",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "I cannot remember having this much fun with a movie, or having something raved about and still being way above anything I could have expected. This is what movies should be just fucking fun.",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "really a top spider-man movie despite being mostly animated",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "Um filme muito bom que merecia ser pelo menos indicado ao Oscar melhor filme de 2019 uma animação muito boa que ganhou o Oscar de melhor animação!",
            "review_date": "2021-04-01",
            "source": "rt"
        },
        {
            "content": "Wow, what an outstanding movie with extremely detailed and great visuals. I loved how each character was so special and unique and how the character development was so well written and natural. This movie also had lots of small, creative details that add on to how amazing this movie truly is. One of the best movies I've ever watched.",
            "review_date": "2021-03-30",
            "source": "rt"
        },
        {
            "content": "This film is incredible.\n\nThis movie is great, especially the visuals, the color, the style of the characters and everything around them, even the framerate at which miles moves all come together to make this film beautiful. I don't know much about sound design but what I do know is, 'music good, voice good, movie good'. The music is great, from the chill rap to sharkboys 'lullaby' (more like epic music). The main villain makes you feel scared. 'Electric' (gives me chills down my spine every time I hear his name) He is SharkBoy and LavaGirl's arch-nemesis, Minus's former henchman, and the former electrician of Planet Drool. If you pay close attention, you can find out that Linus (Satan) ruining Mile's dream journal, When Sharkboy, Miles, and Lavagirl  reach planet drool, you feel amazing and might have you ç̶̦̯̲̫͖̼͐̈̾̓̿̏͊́̆͛̏̚ȗ̶͓͈̳̱̦̣́̎̈́͑̿͘m̶̢̖̤͍̱̪̺͐́̆̆̂̆̈́̊̐̚͜͝m̸̟̝̖͇̄̀́̐̉̎̑͂̃͌̋́͘i̷̗̰̒̊͐n̶̨̡͍͎̞̫͙̜͕͎͐̑̆͝͠g̶̡͔̽̾̍̈́͜...\n\n\n\n\n\nᶦ̴̛̥̟́̃̈́̎̀̆̽̉͠͝ᵗ̸̨̧̯̪͚̳̜̖̺̻̻̟̰̾̑̾̋͂̿̋͆͝ˢ̴̬͖̰̯̔̈ ̶̢̧̨̧͈͙͔̯̻̮̮́̔̑̏́͊̋̓̈́̕ⁿ̸̨̢̢̛̮̰͖̙͇͍̦͈̙̮͒͛̄̾̒͌̾͑̌̑̇̚͘ͅᵒ̷̡̱̺̩͖̹̫̿͑̈́͒̒̀̽̿̚͜͠ᵗ̸͚̓̈́̉͐ ̶̨̣̾̌̐͗̓̓͌̾̕͝͝͠͝ʸ̶̣̀͐͊͐͆͗̎̾̏̋͒̇̚͠ᵒ̵̨̖͉̹̝͚͙͈̈̇̾̆͜͝ᵘ̶̧̨̟̠̺̺̈́͑̈̈̿͛ͅʳ̸̛̙͍̮̙̣̑͌͋͐̒̉̚ ̵͕͚͔̙͈̗̹̥̫̾̀̀̇̑͌͊̓͌͛̚̕͘͠ͅᶠ̴̛̜̼̜̻̳̞̱̆̏̈́̇̀͑̔̈́͘͜͝ᵃ̸̡̨͔̫͕̞̅͒͐͋̎́̓ᵘ̸͇̯̊̐̈́́̓̇̏̿̈̉͜͠ˡ̶̡̠̖̗̟͎͇͓͓̞̊̄̓̽̄̿̎͑̕͘͝ᵗ̵̢̖̪͉̗͚͉̲̑͂͂̋̈́̊͘͠\n\n\n\nᶦ ʰᴬᵛᵉ ᴱᵛᴼˡᵛᵉᵈ\n\n\n\n.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ.̶̞̩̳̼͊̏,̸̲̫͈̑̉̋̚.̵̨̛̪̮͓̪̬̱̼̖͓͉̝͖̜͚̅̉͂̆̈͊̍̒́̏͛̍̂̏,̷̬͍̻͖̦̲̮͍͈̠̠̬̂̈́̇.̸̧͉͍͐̒̀̀́̊̔,̵̛̜̲̳̋͋͒̎̔.̶͇̪͎̤̞̰̟̜̥̱̯̓.̷̺̩̿.̵̢̨̛̦̻̥̼̗̲͋̍̒͜.̸̢̡̳̯̩͓͈͙͎͉͖͚̬̘̂́̔̾͋͛͛͝͠.̸̨̢̡̣̤̗̝̘͎̫͔̊͋̿͗͗̿͐́̚͝͠͝.̴̛̠̪̺͓̫͕͖͈̭͖͋̉̄̃̾̕͘͜͝.̸̢͔͙̟̲̰̮̒̊̈́̃̃͋̏͂̒̐̑̓̚.̷̜̰̟̣̰͉͈̺̾.̴̠̳̗̱͖̻̦͎̪̓.̷̧̰̰͔̱͉̩̠̘̌͋̈́̓̇͂͗͊̀̊̅̋͗̕͜͝ͅ'̸̢͓̼̠̰̤̦͓̭̞͔̬͋̐̿̔͜,̶̛̮͖̳̪̤̪̙̤̙͉̼͎̃̄̈̽/̸̫͓͉̯̪̥͇̺̪̿́͊͂̽͊̔̒̈̀͛̓̂͠.̴̨̡̦̟̩̞̬̪̺̝̺̑̈̔;̷̺̰̤̲̝͇̘͙̙̄́̂̚͘̚͜͠,̸̨̠̹̞̹̰̳̔͐̇̉͛̎͋͑̿̾͘̕/̵̧̱̭͖͉̺̜̺͙͇̲͓̻̂̈́͌̐̈̚.̸̢̬̼̩̠̭̅̀̀̆͝ͅ[̸͚͈̩̩̭͓̼͕̫͙̞̪̹̯̅͆̍̀́̅̇͊̆̑̚̚͜͝,̶̺̫̘̠͉̫͖̠̗͖̋͂̈́̊̕͘ͅ,̶̠͚̳̫̉̽͗̆̿͋̚,̷̨̧̳̪͙̹͓̝͓̖̯̔̑͑̓͋̂̀͐̕,̶̢̡͓̠͙̟̱̤̠̻̊̓̍̊͠ͅ,̵̧̛͕̝̞̲̉̿̏̔̽͊̀̌̾̆̕,̷̛̛͕͈̱̻͈̱̠͉̰̙͇̼͕̻̘̋̈́̈̐͂̎̑̕,̵̦̩͕̼̯̺̇̽̒̋͂̒̀̓͛̕͜͜,̷̡̳̪̼̥͚̻̆,̵̨̛̠͉̹͚̜̱̣̩̜̱̈́̂̑̀̾́̌̅͌͊̌̚͝,̶̌͒̍̀̈́͑̆̈́̊̒̓͘͘͜͠,̶̠͉̺̼̪͚͚͓̀͌̈͋͋̕,̷̺̭̹̼̟͎̭̯̖̩̤̈́͂̐̍͌̅,̸͕̯̱̼͖̜̲͙͚̲̹͚̾̓̎̇͋̈̂̄̔̓͛̽ͅ.̵̧͍͈̝̱͉̠͎̇̀͗̃̓.̸̨̠͉̝̰̩̘̪̦̤̞̠́̐̅̀̍̀͒̑́͝.̸͔̳͉̓̑̄̓͌̌̈̆͊͐̕̕͝͠.̵̘̯̜̾͆̐̍͑̇̽́̅̚̕.̶̛͖͔̎̔̈́̄͐͝.̷̧̰̻͎̩̮͔̥̥͕̰̩̣̜̎̏̉̀̽̏̈̽́̀́̀̎̽̕.̴̛͍̳͍̰͍̼̱̰͚̑͋͒̈̍́̿̍͒̉̿̈́͝ͅ.̶̢̢̫͋̊̽̎̿͗̃́̎̕]̷͖̜̦̝͇̪̲̗͉̭̟̫̱̀̅̍͒̄̄̐̎̏̿͐̌̈́͜͝[̸̬̘̖̗̭̝͍̥̝͌̽́̃̔̾̋̍̓̅̓̒̕͜,̴̜͖̣̝̳̙͔̰̞͗̉̏̒̐͐̿̅̕͝.̴̧̛̱̮̆͌͊́̈́̈́̎̇̍́͒̕[̸̛̭͎̱̘͙̰̩̣̍̀̌̄͊̉͒̍̉̒͗̒͘͝ͅ.̷̙̃̐̅̈́͑̅̎̅̆̆̈́͘͝͝'̶̢̛̞̯̥͎̰͕͖̳͇̾͆̓̂̈͐̀͒̔͆̈́̀̚͘͜,̷̙͎͈̙͙͖̭̺̘͙̩̦͊̾̎̓̃̊̑̚'̴̛̱̉̅̇̌̀́̎̚͝'̴͓̘̮̜̜̈́͆͆͌̈̊̐͝.̷̛̞͙͎̼͎̝̰̲̩̙̥̓̅̂̈́͑̇́͝͝ͅ'̵̧̼̠̙̿́̊̀̐̌́́̓̾̍̉͆͘,̸̡͍̜͖̦͕̟̦͎͕̈́̂̈́̄̽́̔̾̐̍̕ͅ\n\n\n\n\nThe 'Phone Guy' really sell the idea that the gang of animatronics are haunted, well still being 'vauge' and sounds like hes keeping things from you during the calls.\n\nMy movies are not movies, they are real life, not fiction joker is real, he is real life, I am joker. -Samuel Jackson",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "The blend of different animation styles is like nothing I've ever seen, very impressive.",
            "review_date": "2021-03-28",
            "source": "rt"
        },
        {
            "content": "No lo recomiendo, porque No fue Fiel al Comic del SpiderVerse del 2014, como debió suceder, debiendo ser Peter Parker el Protagonista y No otro personaje que le quite el merito, ya que en los Comics todavía le representa que el es el más Grande de Todos \nlos Spiders en el Multiverso, cosa que así debió de haber sido, Pero no, mas la película parece drama o comedia, que Acción.",
            "review_date": "2021-03-28",
            "source": "rt"
        },
        {
            "content": "You can only love this movie. A milestone in animation. Emotional stories for every age and taste. I'm getting goosebumps just thinking about it. You can only love it!",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "There is a lot of visual beauty and good character development in this animated superhero movie that manages to position itself among the best comic book based movies.",
            "review_date": "2021-03-24",
            "source": "rt"
        },
        {
            "content": "Didnt like it at all, not recommended",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "just dope...music,story,animation all r remarkable",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "How could an animated Spider-Man film be this extraordinary?! I Literally don't know but it obviously proved that it could. I need moreeee plssssss",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "this is one of the best animated films of all-time. the animation is the best-looking I've ever seen, it contains some emotional moments and I can't wait for the Sequel.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "Animated Spiderman deserves it's recognition and acclaim.",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "All I've got to say is \"thats a copy!\" 🤣",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "Me encantó, no esperaba mucho pero terminé fascinada con esta película.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "Different and creative. Loved it!",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "I can see why this is highly regarded, especially if you have a connection as a comic reader. Alas, I do not, but I still had a good time watching this.\n\nIt was cool seeing every department of the story come together, while the animation is definitely one of its big plus points - I enjoyed seeing it. The voice cast all do respectable jobs too. I have no issues with this film, to be honest. I just guess there isn't anything I love about it either.\n\nShameik Moore is good in the lead, while Jake Johnson supports competently in his role. Hailee Steinfeld, Nicolas Cage and Kathryn Hahn, as well as a few others, stick out too. Away from the already mentioned, I also like the music - having already known about \"Sunflower\".\n\nEvidently it didn't connect to me, someone who has zero attachment to the source material, massively. That doesn't, though, change the fact that I did find enjoyment with 'Spider-Man: Into the Spider-Verse' and I would certainly recommend it.",
            "review_date": "2021-03-09",
            "source": "rt"
        },
        {
            "content": "O filme é otimo, desde trama aos personagens e a forma como são apresentados durante o longa. As emoções e sentimentos dos personagens nos envolve, nos faz querer acompanhar cada segundo e quando acaba você fica querendo mais,",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "Legitimately this movie is a benchmark for what animation is capable of. When you match the tone and story of your movie with the right kind of animation you can make something so unique and beautiful that it just blows people away. So much of animation is cookie-cutter these days that this movie was such a breath of fresh air visually. Additionally, this movie is everything the superhero genre wishes it could be. With the oversaturation of the MCU cluttering the genre to the point that nothing feels new or fun anymore, this movie proves there are still good stories to be told with superheroes.",
            "review_date": "2021-03-02",
            "source": "rt"
        },
        {
            "content": "How could an animated Spider-Man film be this extraordinary?! I Literally don't know but it obviously proved that it could.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "It's the best Spider-Man movie since the first two Sam Rami films.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "I love this story and these characters, but not the blurriness of the animation at times, even if I can respect what look they were going for.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "By far the best Spiderman film ever made. The humor is witty, the voice performances are great, and the animation style captures the comic book characters perfectly. This is a must watch film and one of the best animated films in recent years.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "O filme tem uma ótima forma de trabalhar o conteúdo original e ao mesmo tempo dar um toque de originalidade própria , além de trabalhar muito bem ressaltando a arte e o estilo de vida urbano e contemporâneo, no qual o personagem se encaixa.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "Amazing movie with great voice acting and animation, not to mention the story is good too. 10/10 a film both adults and children can enjoy.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "A visual and sound slap. Different movie from the other Spider Man but still refreshing.",
            "review_date": "2021-02-25",
            "source": "rt"
        },
        {
            "content": "An amazing piece of art.  Even with the pig, this movies gets a 5.",
            "review_date": "2021-02-25",
            "source": "rt"
        },
        {
            "content": "Overrated but very good movie that mostly lives up to the hype.  Definitely worth watching for its unique animation style and touching story.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "Incredible movie I don't even have to explain why",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "Best animated movie in 2018.",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "The greatest Marvel cartoon for all ages!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "I can't say enough good about this film. Just watch it",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider-Verse is the most amazing animated superhero feature-length film Marvel fans must see.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "Hermosa visualmente hablando realmente espectacular técnica de animacion, y espectacular concepto abordado de forma correcta personajes muy carismáticos divertida y cargada de acción de las mejores de spider man.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "La mejor película de superhéroes, una de las mejores películas animadas, y una genialidad total en todos los aspectos, no hay una sola queja que tenga sobre esta película",
            "review_date": "2021-02-14",
            "source": "rt"
        },
        {
            "content": "KILLER animation + soundtrack, great characters and decent antagonist",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "So many films have tried to emulate a comic book, and failed. This film, however, nails it, and runs absolutely wild with it. Those not well versed in spiderman lore can still enjoy this film, with good jokes, heartfelt moments, and clever nods to other spiderman material. Sure, the Sony product placement can hurt, but this film rocks no matter what it's flaws are!",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "A boring and uninterested film. Terrible story and terrible character Miles Morales.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Not only the slickest, coolest animation I've ever seen, but its also one of the best superhero movies ever made and FAR deserving of its Oscar win for Best Animated Picture. Another movie I could watch any day of the week.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "I couldn't get enough of this movie a beautiful movie not just visually but the story itself nothing ever feels lackluster quite the opposite",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "A great story with some of the most gorgeous animation ever put to screen.",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "Unique and amazing art style, diverse characters and an exiting and heartwarming story - one of my absolutely favourite movies!",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "I mean, if you watch it you get it! It is so Spider Man and Myles Morales is an actually interesting and awesome character and not simply a product of \"inclusion\" culture. The story is interesting the characters are believable and it is downright hilarious and fun throughout. Great animation... You really cant say enough about how good this movie was.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "It was a great mix of a comic book with modern culture. Super great for kids and adults!",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Into the Spiderverse has the most jaw dropping implementation of animation I've ever seen. The low framerate/near stop motion movement mixed with the busyness of the color palette is just downright cool, and when I think of a Miles Morales story, my first thought is that it has to be \"cool.\" This does not disappoint. The narrative is fun and at least in part novel. It's obvious bringing a bunch of super characters together is a winning formula, but I'm not sure we've seen a bunch of the same super character brought together in a blockbuster superhero movie before. The conflict doesn't necessarily rise above its peers in the superhero genre, but it really doesn't need to. When the set dressing is this great, I'm here for it.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "I thought this movie was excellent. I thought the plot occasionally was too out there, but they were being bold, which is to be applauded.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "One of the greatest movie of all time. The soundtrack, the colour, the animations, the storyline, all of it is dope.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. Action, comedy, the animation is great. Overall AMAZING movie!",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "There is a lot of competition these days for \"best Spider-Man story put to film;\" I'm torn between this, Sam Raimi's Spider-Man 2, and the PS4 game. Spider-Verse is the most rewatchable of the three.",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "It's hard not to see why most people see this as the best Spider-Man movie, introducing something brand new that no other films in the franchise have tried before. It's a funny, action packed and emotional thrill ride with a story and script so good you'd swear it came from Pixar.",
            "review_date": "2021-01-24",
            "source": "rt"
        },
        {
            "content": "A good movie with great animation.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "Best animated superhero film that I've ever watched and ever to be made.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "The best superhero movie of the millenium to date.",
            "review_date": "2021-01-20",
            "source": "rt"
        },
        {
            "content": "Story/Screenplay: (4/5) A fascinating alternative to the conventional superhero film.  Completely original.\n\nDuration/Tempo: (3.5/5) At 1 hour and 57 minutes, it's a long movie that felt average in length.  Nice pacing.\n\nCast & Crew: (3.5/5) Fine performances across the board.  Solid cast.\n\nSummary: (3.5/5) The cast was good, the story was very good, and the film didn't feel long.  A thumbs up.",
            "review_date": "2021-01-20",
            "source": "rt"
        },
        {
            "content": "I was torn between 3.5* and 4* for this but the higher won out due to just how spectacular it looks. However, this movie isn't as good as everyone makes it out to be. While it is a good movie, it is not nearly 'the best superhero movie ever' as I have seen some tout. There are some glaring plot issues (understandable with a multi-dimensional plotline) and a lot of the characters don't have anywhere near enough screentime or interaction with Myles to get the emotional sendoff the movie tries to shove down our throats. However, it is still a damn entertaining movie that got some genuine chuckles out of me at times. And Myles himself is a good character, as is fake Peter. It was just everyone else around them that felt a little flat, which again is understandable when introducing so many new characters into one movie. It was overall good, but not excellent like some suggest.",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "Waited to see Sony mess it up they hit it out of the park it was amazing story and even better animation",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "A masterpiece. Great story of family and the bond of a father and a son. An all time favorite for my son and I. ",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "Amazing on all fronts. Brilliant and dazzling colors, strong storyline, and awesome soundtrack.",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "Sony finally figured out how to make a good interesting cartoon, and use Spiderman comics in a film.",
            "review_date": "2021-01-13",
            "source": "rt"
        },
        {
            "content": "The story centers around a young man by the name of Miles Morales and he like any other teenager is struggling to find his place and where exactly he belongs in this life. Due to the curious nature of the boy, he stumbles upon an abandoned NYC subway tunnel which will prove to change Miles forever. Miles was bitten by a radioactive spider not unlike the same spider whose given Spider-Man his power. Naturally Miles turns to the only person he knows could help, the actual Spider-Man. Now caught in a fight against Wilson Fisk turns into this inter-dimensional clash, one the proved to be too much to handle for only two super-powered Spider-Men. Once messing with dimensions, Miles meets and recruits 5 other super-powered Spider-Men and women from their respective dimensions in this battle over time and space. Will Miles be able to take a leap of faith and finally let go for the sake of the universes?\n\nI must say the animated visuals seen in this movie are pretty groundbreaking thought you either love it or hate it, i personally loved the comic book feel to the movie, a real strength of the picture. Also a pretty stacked cast here and they all operate magically together. Very excited to finally see the freshest take on Spider-Man we've seen for a very long time, truly innovative.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "Decent... I'd recommend watching it... but it's definitely not the best they could have done. First, the things I absolutely love: the animation and music is some of the best I've ever seen. I love the comic book feel the movie creates. But, alas... the lesser great things in this movie: the characters are, for the most part, underdeveloped and most of the characters are shallow; some of the spider-person characters were just there to make a joke or two. Kingpin's backstory could have been fleshed out more to create a deeper antagonist, but we're just given one bit of backstory and that's that. And that's more I can say for the rest of the villains, or, Kingpin's villainous henchmen. But the biggest mistake in this movie is the main protagonist's father. Miles forges a kind of bond with his father by the end, through both himself (being the son) and on the other hand, Spiderman , and some character development took place, but I would have loved to see a lot more. Their relationship is still not where it should be, and the characters have a lot more development to undertake before I can picture their father-son relationship realistically.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "I watched it when it rolled out in the theaters the first time around, in 2018. And I watched it again last week. It's an emotional roller-coaster of a movie, and really ties into a bunch of things metaphorically. Like when a certain someone says, \"It always fits, eventually.\" I won't go into more to avoid spoilers. But this is a movie at the peak of peaks, and it might edge ahead of any other Marvel movie out there as well. Just my opinion. Leap of faith. You know? :)",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "Not only is Spider-Man: Into the Spider-Verse, the best Spider-Man movie, but it's also the best Marvel Comics-based film overall.",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "A great film with amazing art, throughly enjoyed this one and even bought it on DVD as it was so good.",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "WHAT ELSE YOU CAN ASK? THIS MOVIE HAS EVERYTHING YOU WANT FOR A SPIDER-MAN... WELL SPIDER-MEN MOVIE, and so much more, believe me. Great animation, great story, great soundtrack... This movie is perfect.",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "this is a perfect and original film. the way that it was animated and directed is amazing. The animators used new techniques that made the movie more comic like and thats great for comic lovers like me. And it has the best ending of all time if you oay attension to the details.",
            "review_date": "2021-01-04",
            "source": "rt"
        },
        {
            "content": "One of the BEST Spider-Man adaptations EVER!!!! Hands Down!!",
            "review_date": "2021-01-03",
            "source": "rt"
        },
        {
            "content": "Nothing better than decent in my opinion, very mediocre. Cry marvel fan boys.",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "If I had to describe this movie in one word, it would be unique. Everything about this movie just felt fresh and new to a genre that has been very saturated over the past few years. The entire film felt like it was told through this ADHD style lens that made each scene feel like you were right along side Miles. The action was fast paced and exciting, and it never failed to put a smile on my face. The movie also showed how well it is at balancing tones. One scene would make you cry, while the next made you laugh out loud, and the next would give you a sense of empowerment. The animation style was also pretty remarkable. It truly felt like a comic book brought to life. Every frame felt vibrant and lively, and you could really tell that the animators poured their heart and soul into. Overall, this movie was pretty damn amazing. ",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Great story.  I liked it a l lot,",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "This was the best theater experience I have ever had. The comic color off-registration style and ever-changing pacing were overwhelming in a good way that held my attention through the entire film. The story was solid, and I also appreciated the lack of frivolous elements that are becoming more frequent in other animated films.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Great story. Good characters and development. Good animation.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Best Standalone movie that year in my opinion........... Into the spider-verse is a must-see.  The movie actually improves the character from the comics and makes audiences connect with young Miles Morales.  The movie also introduces other spider-people; all of which are fun and really make the experience more wonderful.  The villain(s) in this movie are actually scary, while simultaneously being different from the source material.   Definitely fun for the whole family.  If more Miles Morales movies were made to this quality; I could see this character replacing Peter for the title of \"The\" Friendly Neighborhood Spider-Man.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "Bad script bad acting. Stick it into a dark corner",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "Spider-Man: Into the Spider-Verse proves that comic book movies still have a bright future, despite coming out in droves since the turn of the century.  A unique style of animation paired with a proper understanding of the character's significance and a fantastic balance of humour and emotion.  Spider-Verse is a huge win.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "This film is just AMAZING. It's not only visually astonishing but the story is an incredible journey that shows us that everyone can be a hero in its own way. As a HUGE Spider-Man fan, I was blown away by all the action and emotion this movie provides, it's definitely a love letter to marvel fans. Hailee Steinfeld, Shameik Moore and Jake Johnson make an spectacular job portraying Gwen Stacy, Miles Morales, and Peter B. Parker respectively. For me \"Spider-Man Into the Spiderverse\" is just the best Spider-Man movie ever.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "filme homem aranha no aranhaverso foda historia maneiro legal açao",
            "review_date": "2020-12-23",
            "source": "rt"
        },
        {
            "content": "An original story told in a novel way. Must see!",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "The music is superb, with every chilling beat with the Prowler's theme, with the animation, it's lively and beautiful, as a Spider-Man fan, I liked this movie.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Spider-Man Into the Spiderverse provides a great coming of age story and a new spin on the story of the character of Spider-Man. It features the same aspects of the character such as family, friends, and responsibility in a new and bold way. The use of Miles Morales instead of Peter Parker as the main protagonist provides new angles and story telling devices. The use of the Kingpin as the main antagonist instead of other Spidey villains also helps to tie in the plot with the character, as the motives of Kingpin's plans look and seem justified while also reminding us about the true antagonist of the story. Overall, the plot, characters, and graphics all serve to create a dynamic movie never before seen in the big screen",
            "review_date": "2020-12-20",
            "source": "rt"
        },
        {
            "content": "They literally dragged the real Spiderman through the mud and made him a lame bum. Miles morales is not Spiderman. This movie is trash",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "Brilliant movie! Love that they were able to add so many different characters into the main plot without making it too overwhelming or confusing! Great story line and I loved that they were able to stick so closely with the original comics!",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "This movie is great in any multiverse! Replay value; extremely high, for all ages, it is a masterpiece that will stand the test of time.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "Everything about this movie is fantastic. Lovable characters, the writing of the movie, the voice acting, the storyline. That's just the surface, the real kicker in this movie is the art which is obvious. The animation in this movie is perfect. Every little detail is incredible and you could make a poster out of any moment you pause on. Miles Morales is such a lovable character and you could not have written him better. There is one noticeable plot hole, and only a handful of jokes that miss, but other than that, this movie is perfection. Grade 98% (A+)",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "The first time juice came out of my nose from laughing was in this movie. The film is extremely fun, humorous and features comic book mechanics within the film.",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "A dynamic fast paced neon bright take on Spiderman.",
            "review_date": "2020-12-16",
            "source": "rt"
        },
        {
            "content": "Must watch. Cult movie.",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "Fantastic animation, crazy plot twists, and out-of-this-world hilarious.  This is, no doubt about it, one of the best Spiderman movies in existence.  And when people said this was THE #1 animated movie of 2018, I can definitely see why after watching it",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "Relentless, hyperkinetic fun. Spiderman the way it was always meant to be.\nThank the Gods for including all the best Spider-People in this film, especially Miles Morales and of course, a favorite from my childhood...SpiderHam!\nInimitable.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "Seeing this film was an absolute phenomenal experience I will not forget. I had no reoubme picking out my seat for the showtime and was able to enjoy my viewing with the comfortable chairs and food that exceeded my tastebuds' satisfaction.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "Spiderman into the Spider verse is almost a masterpiece of animation and great storytelling.  It brings spider man for the first time as an animated feature length film outside of the tv cartoons. The film features astounding and incredible visuals with bright beautiful colors. We see brief references to pop culture combined with hip hop music and the film is a great tribute to black and Spanish culture. Miles Morales is a great character that's charming, relatable, and connects in an emotional level. The story is well written and serves as a great tribute to spider man lore. The humor is hilarious and the film has a huge heart with strong flesh out characters. One of the best animated films in recent years.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "If they made all superhero movies like this, I'd be onboard with this particular genre 100%!",
            "review_date": "2020-12-07",
            "source": "rt"
        },
        {
            "content": "I mean this is the best motion picture of the decade. Its really getting it all from animation and script is actually good. \n\nAnimation is awesome. Characters are awesome. Humor is good. Drama is nice. Everything is just right. Creators did exceptionally good work here.\n\n5/5",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "I've watched this film around when it came out but decided to rewatch it again recently just because of the new Spider-Man: Miles Morales game. The premise of the movie is simply \"Bitten by a radioactive spider in the subway, Brooklyn teenager Miles Morales suddenly develops mysterious powers that transform him into the one and only Spider-Man. When he meets Peter Parker, he soon realizes that many others share his special, high-flying talents. Miles must now use his newfound skills to battle the evil Kingpin, a hulking madman who can open portals to other universes and pull different versions of Spider-Man into our world\". I absolutely adored it when it came out but do I still feel that way after rewatching it?\n\nFirstly, the animation style and 3D models are absolutely amazing! While I do love the Pixar style of animation, this comic book style of animation was such a breath of fresh air in the animated film department. I also appreciate a lot of the aesthetic choices such as having this shaky movement instead of fluid which further makes it feel like a comic book come to life. The action scenes are also animated really well and are an absolute blast to watch as well. Clearly, a lot of thought went into this and it clearly shows in the movie. \n\nMiles Morales (Shameik Moore) is a great main lead. He isn't perfect and is actually very flawed with them making a fair amount of what would be frustrating mistakes. However, the directors succeed in still making us root for him as we can see how much he really wants to pull through for the team. Peter B. Parker (Jake Johnson) is another great Spiderman in this movie who is a mentor figure for Miles. He is a person who has been doing this spiderman business for over 20 years and has a lot of problems with his Peter Parker life such as his divorce with Mary Jane. Due to this, he is quite neglectful of Miles but he goes through his own character arc that is done very well. His chemistry with Miles is one of the things that really shine in this movie. Gwen Stacy/Spider-Woman (Hailee Steinfeld) is the third Spider character that appears in the movie and is mostly there to be the competent and supportive one in the group for Miles. The other three Spider characters Spider-Man Noir (Nicolas Cage),  Peni Parker (Kimiko Glenn) and Peter Porker (John Mulaney) are also all very distinct and different in personality which is perfectly converted despite small screentime. \n\nThe cast is also phenomenal, everyone does a great job, especially Shameik Moore and Jake Johnson. There is also some other stellar casting like Brian Tyree Henry as Mile's dad, Mahershala Ali as Mile's Uncle Aaron, Chris Pine as Peter Parker of Mile's universe, Zoë Kravitz as Mary Jane, Kathryn Hahn as Doc Octopus, Liev Schreiber as Kingpin and even Oscar Issac for a mysterious role that I won't spoil. It's an all-star cast and even though some have small roles, Sony still went through with casting big known actors. They all do a great job. The excellent soundtrack further elevates this movie. Every time the Prowler is in the movie there is this horn in the soundtrack that makes him seem more threatening. Additionally, there are some pop, R&B, rap songs within the movie that all fit really well and gives more identity to the movie and characters. \n\nThe story is simple yet intriguing enough to keep the audience engaged. It introduced the complex multiverse idea but doesn't overcomplicate it to make it distracting. There are multiple villains but the director makes sure the main focus of villains is Kingpin which is a good idea as multiple focus villains will make the plot feel convoluted. There is also excellent dialogue which is thanks to Phil Lord and Rodney Rothman. The jokes all land and the serious moments are heart-warming and the banter enjoyable. It's good dialogue and none feel wasted. \n\nIf I have to give the movie a flaw then I would say it is kind of the Spiderman group dynamic. Spider-Man Noir, Peni Parker and Peter Porker don't interact much with Miles apart from being extremely harsh on him. It makes the last moments with these Spider characters not as strong. Miles also just become an extremely adept Spiderman because the plot needs him to be. It doesn't completely feel justified since it doesn't feel like he was provided with enough training to be that good. However, it doesn't break the movie and the sacrifices are understandable to keep this origin story in just under 2 hours.\n\nOverall, Spider-Man into the Spider-verse is still one of the best-animated movies to come out in a long time. I still loved it after rewatching it. It's a fresh take on Spider-Man that we haven't seen before in a movie. If you haven't watched this movie yet then you must absolutely watch this movie. I can't wait for the sequel!",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "This is such a great animated film.  Now in my top 5.  Do yourself a favour, watch this movie. You wont be sorry.\n\nGreat visuals, amazing soundtrack and a great story.  What more could you ask for.",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "5/5 stars!! Spider-Man Into The Spider-Verse is the best animated superhero movie since The Incredibles. This is one movie i found very interesting and really fun, and i still find it that way. There's no way i could possibly get bored of this :D",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "It's the Wizard of Oz of superhero movies, because it's NOT a superhero movie.If OZ were a Marvel movie, then this is it. It's a movie that has a wonderfully original script that hasn't been recycled a million times. I can't remember many movies that have so many interesting or loveable characters, like this one does. Not to mention, the music is stunning. This movie proved hand-drawn cartoons are much better than computer.",
            "review_date": "2020-12-03",
            "source": "rt"
        },
        {
            "content": "This is one of my all time favourite movies.",
            "review_date": "2020-12-03",
            "source": "rt"
        },
        {
            "content": "It may be the best animated movie to come out of the 2010s and maybe even just in general. Technically sound, visually stunning, an uplifting message, and an inclusive cast. Truly great.",
            "review_date": "2020-12-02",
            "source": "rt"
        },
        {
            "content": "The best animated movie I've seen in a long, long time. The visuals are stunning, the feels hit, and most of all, the music is AMAZING. Top 5 movies of all time for me. 10/10",
            "review_date": "2020-12-01",
            "source": "rt"
        },
        {
            "content": "Awesome movie .This is everything you could possibly want from a Spider man movie.",
            "review_date": "2020-11-30",
            "source": "rt"
        },
        {
            "content": "This is an example of a  perfect animation movie. It has a strong story, lovely characters with their own unique personality and most of all, it has a gorgeous drawing style. YOU'VE GOTTA WATCH THIS ONE!!!! 🕷🕸",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "Great animation great fast scenes funny moments and enjoyable",
            "review_date": "2020-11-27",
            "source": "rt"
        },
        {
            "content": "besttt soundtrack!!!!!!!!!!!!!!!!!!! whats up dangeeerrrr",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "i honestly don't get the scores/rankings on this site\nthis movie was utter trash\nit was insultingly stupid and boorish\neven if there were any redeeming qualities they are covered in the excrement of the rest of the film\nhorrible acting\nhorrible plot\nhorrible script\njust horrible\nand as an old school Spider-Man fan... ?  what the... ?\ni honestly feel pity for the kids these days, growing up with trash like this\n.\noops, wrong movie, sry; thought it was that one with the fish bowl on his head\nso i gave it a 3 because i really haven't seen it, not even the trailer\ni don't see how to delete it",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "This is the greatest animated movie ever",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "This movie is an amazing mix of action, comedy, beautiful animation, and great characters. With an amazing voice cast to boot, this is easily one of the best movies I've seen in a long time.",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "Beautiful animation, Funny, Tons of fun, The best spider-man movie ever",
            "review_date": "2020-11-24",
            "source": "rt"
        },
        {
            "content": "This is the first movie that I just had to watch multiple times in one week, great story, fantastic characters and absolutely hilarious.",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "First Half, Great Intro to A new Spiderman.\nSecond half, good enough to pass the time :D",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "This movie is the sunflower 🌻. It presents a character most of us can relate to, and shows how he struggles with everyone. The visuals are stellar, and of course the songs are great. I recommend this movie highly, and hope this will be remembered.",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "Visually stunning with amazing characters and plot. A must watch for anyone",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "This movie impressed me so damn much. That's really it. Everything about it was so fantastic!",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "Was the moment you hear Swae Lee and Post Malones Sunflower, you instantly fall in love with this film. Its a technical marvel, maybe not since Akira have we seen a game changer animation like this. Miles Morales is such a loveable and relatable lead and and relationship he has with Peter and Gwen is so heartfelt and believable. Its just brilliant from start to finish.",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "Pleasantly surprised",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "I think that is the best animation i have ever saw, and the best animated spider man movie",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "I love the comic book style of the movie and can't wait for the sequel",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "A comic book put together beautifully.",
            "review_date": "2020-11-16",
            "source": "rt"
        },
        {
            "content": "Most definitely the best Spider-Man movie, animated movie, and possibly one of the best movies of all time.",
            "review_date": "2020-11-16",
            "source": "rt"
        },
        {
            "content": "This is the best Spider-Man movie since Sam Raimi's Spider-Man 2!!!",
            "review_date": "2020-11-15",
            "source": "rt"
        },
        {
            "content": "Everything about this movie is perfect. The visuals are beautiful, the story is beautiful, the metaphors are beautiful. Just.... Beautiful. I cannot recommend this film enough.",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "masterpiece! absolute must see!",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Great movie. The best-animated movie I have seen in a while its the best",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "This movie is a favorite for me these people mixed story telling and animation so well that I've seen it like 5 times and still haven't found all the hidden details.",
            "review_date": "2020-11-11",
            "source": "rt"
        },
        {
            "content": "One of the greatest Spider-Man movies of all time. It introduces interesting new characters as well as giving us unique spins on old ones. I found myself liking the new characters and loving the old ones even more.",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "Spiderman is overrated in my opinion. Forgive me for not being invested in a character who either is learning a shallow lesson about responsibility or is only a hero in an attempt to prove himself to far more interesting characters. But thankfully, every problem Spiderman has in all his previous and subsequent films are not present here. Only the thrills of watching a compelling story about a kid creating his identity using gorgeous animation to tell it.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "Amazing graphics, brilliant sequences, humorous. Really great movie",
            "review_date": "2020-11-08",
            "source": "rt"
        },
        {
            "content": "For some reason it didn't result memorable for me.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "The best animated movie of all time by far. This movie leaves me speechless every time I watch it. It's a true piece of art.",
            "review_date": "2020-10-30",
            "source": "rt"
        },
        {
            "content": "The best Spider-man movie ever made. Period.",
            "review_date": "2020-10-29",
            "source": "rt"
        },
        {
            "content": "Its a great movie all-around, it is a must watch and, honestly, great in all aspects. Stan Lee and Steve Ditko would definetely be proud to see Spidey being brought so faithfully and beautifully to the screens.",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "One of the best Spider-Man installments in existence, leaning towards THE best. Original animation style, a complex storyline mixed with a mostly basic one to even it out, great voice acting, and hilarious jokes and lines, equal a typically great film from Phil Lord (LEGO Movie, Cloudy with a Chance of Meatballs). I loved this movie far more than I expected to. It shocked me highly, in the best ways.",
            "review_date": "2020-10-28",
            "source": "rt"
        },
        {
            "content": "A very good animated movie but I don't think it lives up to the hype",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Miles Morales is going to be a great Super-Hero one day.\nI kind of want to see how he turns out ... or turns into.",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "Good story, great visuals, bloated unfleshed out cast. Peter, Miles & Gwen have a great dynamic.",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "Immediately one of my favorite movies ever. This was extremely well done and I highly encourage everyone to watch this movie. There was not a moment I didn't love. 10 out of 10!!!",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "This movie has everything. Incredible humor, a great cast, a wonderful story (that leaves you wanting more), and the crown jewel: it has the most unbelievable animation that I have ever seen. Absolute masterpiece.",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "When I first heard about this movie I honestly had little to no interest in seeing it. My younger brother found it and decided to put it on and honestly it might just be the best animated movie ever made.",
            "review_date": "2020-10-20",
            "source": "rt"
        },
        {
            "content": "Who would think an animated Spiderman could outshine it's bigger budgeted counterparts.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "This is one of the best animated films of recent memory. The animation is unique and done so well. The soundtrack and acting is also done very well. This is one of the most unique and fun films I've seen in a while and its 100 percent worth a watch.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "The movie was absolutely stunning, it made other animated films quiver in comparison. Not only was it beautiful visually but it had a very intriguing and hart warming plot.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "it was good but i havent seen in a long time so my rating is lower than it probably should be",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "This is a very good film, with a great animations. It almost has a cartoony vibe to it. This is an absolute must see in my opinion🙂",
            "review_date": "2020-10-16",
            "source": "rt"
        },
        {
            "content": "Spider Man Into the Spiderverse is beautiful animated and has a Strong Voice Cast. It has as well great Storytelling and you are being reminded why Spidey is your Favourite Superhero, at least in my Case.\nRATING: 4,8",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "The greatest movie of all time! Stop what you are doing and watch this right now... I don't care if you've already seen it.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "Astounding soundtrack, visuals- you know what screw it; this film did everything perfectly and will be one you remember for a long time. I’ve never written a review in caps before but it’s the best I can do to get the point across that this is the greatest movie of all time without you watching it. THIS HAS YOU ON THE EDGE OF YOUR SEAT WITH GRIPPING ACTION AND IT WILL GIVE YOU ACTUAL GOOSEBUMPS! FIRST MOVIE IVE PHYSICALLY CHEERED FOR!",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "I don't think it's possible to do such a majestic piece of genius with words, and frankly I've been really trying!",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "I think this is a perfect movie. From the visuals to the soundtrack to the characters to the voice actors. I have a 3 year old that wants to watch this everyday and I don’t mind. It’s an amazing movie. ",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "Maaan, this was so dope. I'm not even a cartoon fan but this was just so next level. Loved it!",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "It's the greatest animated movie of all time. The art style, characters, the music, the story... everything is just perfect.",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "this film is a work of art, it can take many characters and develop all of them in a spectacular way, it has a very authentic aesthetic because its comic-style animation has never been done before, the entire soundtrack is also good because it connects with the character of Miles, a wonderful film that should be valued even more by anyone who loves cinema and comics",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite animated movies of all time and it's from Sony, the same company that made the Emoji Movie and a year later, they create this masterpiece. The animation is so creative, unique and fresh, the action is fast-paced, creative and generally easy to follow, the soundtrack is killer, the emotional beats land perfectly and this movie is really funny (especially the school scenes where Miles discovers his powers) and they balance each other perfectly. The characters are mostly great with clear personality, goals, motivations, strengths, weaknesses and I love their dynamics. I kind of wish Peni Parker and Spider Noir got developed more and I absolutely hate Kingpin's design (although I do think he is a really well-written villain) and the movie loses its central plot at times but who cares? Just a masterpiece of a movie.",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "Best movie of 2018.\nThe animation is brilliant, ground breaking. The music I still listen to today, almost 2 years after watching it. The story, fresh AF for the Spider-man series. Must watch.",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "Мультик сам класс. Саунтрек и ваще бомба(надо было и за это Оскар дать)",
            "review_date": "2020-09-30",
            "source": "rt"
        },
        {
            "content": "The animation is fabulous, it has great humor and heart, Incredibly fresh!",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "A fresh spin on an old classic. And wow the animation is masterful! So fun to look at!",
            "review_date": "2020-09-26",
            "source": "rt"
        },
        {
            "content": "Best animation ever!!!",
            "review_date": "2020-09-25",
            "source": "rt"
        },
        {
            "content": "Awesome and entertaining ",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "As good the 20th time as it was the first.",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "Absolute Colorful Delight",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "The animation was really good and the idea of creating several universes just to create awesome characters (?) with the same concept that was good. However I could only rate 3 stars because: low interpolation, too much screen effects, spider pig? yikes! and I didn't appreciate the fighting as much as you could picture from imagination by reading the comics... The same boss mob(s) to defeat as well.\nThe voice acting, the sounds and practically everything else was really good.",
            "review_date": "2020-09-16",
            "source": "rt"
        },
        {
            "content": "Before I explain what I think of this movie, i want to explain what I think of superhero movies as a whole;\n\nSuperhero movies typically get around 3-4 stars.  They're solid, they are entertaining, but they lack rewatchability and most of the visual effects look the same.  I even think some of the plots mesh together.  The only real reason people come to watch those films is for, let's face it, the action.  That's what a superhero film is about.  There are some exceptions, like the Dark Knight, but for the most part, superhero movies take themselves a little too seriously. \n\nThe reason I bring that up is because SpiderVerse separates itself from the pack.  It does have action, but it also has some very likeable characters and some great dialogue.  There are even some emotional moments; depending on who you are, there are some scenes in the film that will make you cry.  Everything about this story works perfectly.\n\nOf course, the biggest thing that separates this movie from animated films and superhero movies is the style.  Every frame of this movie is a comic book panel.  It's obvious that this was the intent, there are even onomatopoeia bubbles and dialogue boxes in some frames, but the aesthetic and framing of the movie also capture that.  This part stuck out to me because I LOVE comic books and graphic novels.\n\nBut, let's say you're not a fan of comic books or superhero movies [yes, those people exist].  If you are indifferent to that kind of thing, there is still an engaging, unique story, with engaging and unique characters.  The movie also has a great sense of humor, the type of humor that makes anybody laugh and smile.  \n\nIn short, the movie separates itself from the pack with clever writing, but what ultimately makes it a must-see is the stylistic presentation.  This movie is as beautiful on the outside as it is on the inside.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "With comic book inspired art style, upbeat music and DYNAMIC fight scenes full of striking visuals and color, Into the Spiderverse is everything an animated action film should be.",
            "review_date": "2020-09-04",
            "source": "rt"
        },
        {
            "content": "This movie is great. I would say this film is just as awesome as \"Spider-Man 2\". It has fantastic animation, and is definitely my favorite film of 2018.",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 2,0",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "BEST ANIMATED MOVIE OF ALL TIME ",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "Still a masterpiece. Amazing writing and integration of different animation styles. Original whilst integrating, paying tribute to and making fun of the character's history. Cool music.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "happy that this is on Netflix. finally watched this. really terrific.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "The animation is just breathtaking and the story-telling is superb! For me this one's better than the other adaptations.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "What did I think of Spider-Man: Into the Spider-Verse? Check out my full review below:\nhttps://open.spotify.com/episode/39rVC5IVUs05beTSo3NTIs?si=3caQRm1fT4ityrZ0Mq8AWw",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "Great fantastic phenomenal animated marvel movie starring some great actors who I should know of , nic cage, and the one and only Haliee steinfield. This movie has everything that I wanted in this and much much more. This movie had all the emotion I wanted, the origin story I wanted from everyone. The jokes are funny and never fall flat and that Stan Lee cameo just hit me right in the heart. This movie handles all those spiderpeople very well and they have equal screen time except miles because he's miles morales , the heart and soul of this movie. The animation is phenomenal and feels like I'm watching a live comic book and that I'm in that comic book. Miles Morales is the best Spider-Man I've seen in any marvel movie and if you disagree , how can you, this Spiderman is emotional, funny and you really want to root for him. I don't know how Sony can top this movie in the sequel. But I'm curious to see what happens next with miles morales and the spider gang.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "One of the greatest animated films of all time, flawless creativity, incredible soundtrack, memorable characters. All while staying true to the spiderman universe in a story complicated yet easy to follow.",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "Not only has this film snatched the crown of best superhero film of 2018 from ‘Infinity War' at the last second, but the harsh reality for me was also that it surpassed Spider-Man 2 as the best Spider-Man film to date. It really is a combination of excellent filmmaking, respect for the source material and a fantastic voice cast. Into the Spider-Verse manages to dazzle with unique and kinetic visuals and a fresh exciting soundtrack with exciting fight scenes but genuinely touching moments.",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "As so many reviewers have stated, this movie is truly an amazing experience, no pun intended. The way the directors were able to combine smooth animation with a hint of comic book magic made this movie fun to watch for not only a younger generation but also those who grew up reading the comics. The movie has the right amount of humor, composition and heart-tearing moments, combine all of that by the up-beat hip-hop soundtrack and yet strict loyalty to the comics makes this a great film for all superhero fans.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "I was surprised by how much I liked this movie. It's really fun, but also has some very well done emotional scenes and good action throughout the movie. Somehow they managed to make a movie that both adults and kids will love (for different reasons most likely). Overall, really fun and really good.",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "Miles Morales was played pretty well, liked how Kingpin had some valid motivations for his \"evil\" actions. All the spider-'men' worked really well together imo and the whole multiverse story was quite nice. This whole movie was VERY refreshing to see compared to the overdone Peter Parker story and the score was brilliant. Jeez, that music was so good.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Visually stunning! Great story telling!",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "I have missed animated movies that are not just low effort, dumb, kids' movies with celebrity voice actors and pop culture references sprinkled in to prevent parents from dying of boredom and this movie is exactly what I've been missing. It's not perfect story wise, but not calling it a masterpiece would be wrong.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "Amazing animation and this Spiderman story was cool to follow as it seemed to pick-up after Homecoming.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This movie was the best, I can't say anything bad.\nCharacters were a good option, villains were perfect (especially kingpin).\nFun and emotion at the same time, Miles is a relatable teenager, which makes him a good character.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "The best Spiderman movie yet. Beautiful visuals and fun soundtrack to top it all off! I couldn't recommend this more (especially for Black viewers), even if you're someone who is iffy about animated films.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "It was so cold I saw other Spiderman ",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "This movie is wonderful! A fantastic plot with several characters explaining their origins and motivations involving the hero's \"multiverse\", which appeared in the comics and adapted for the cinemas now in an incredible and memorable way. Showing all the aura behind the title character that is loved by fans and viewers to this day, who will be thrilled to see another character masterpiece!",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "Love the animation love the action its all amazing",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "The best animated movie of superheroes ever",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Let's see... Greatest Spider-man movie ever made.  The voices were PERFECTLY cast, the animation is unbelievable and the music, oh the amazing perfect incredible music and score takes it from a 5 star to a six.  So many memorable moments and so much emotion.  Just. Wow.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "I am just the biggest fan of the Ultimate Spider Man comics that Miles Morales is the spider man in, I have read all the ultimate collections and have a bobble head of Miles so you could imagine why I might have some concerns going into a movie that I have wanted for 3 years. Those concerns were not justified. It was really great, I think that they adapted it to the cinematic form just enough to make it work better as a movie but not too much that it doesn't feel like the character of Miles Morales. There are so many references to the comic books too, including one sad one. But that is just me as an absolute fanboy. I have a friend that also loves movie as much as I do so I know this is not me just being blind to it's faults.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Spiderman Into the spider-verse is a great movie and the best animated movie 🎥 🍿 of the decade. Its about All the different spidermans like peter porker. 10/10 great movie watch it on Netflix",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "The best animated Marvel movie of all time!",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "one of the most beautiful movies i've ever seen",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "At first I thought that the Spider-Man Animated movie wouldn't be able to make it because of the directors from the Lego Movie. However I must say that I liked it after seeing the movie myself. Even the diversity in animated styles greatly reflect the different dimensions among the \"spider-verse.\" I also liked it how the movie still used the Spider-Man Moral with Great Power comes great responsibility. On top of that has a way expressing the Kingpin as a tragic villain sort. Miles, despite the rough and clumsy start, shows he's really striding to take on the Spider-Man mantle. Nice Debut for Miles.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "It was a good refresh and I thought it pulled the various Spider-Man reboots together well, while also standing out as a strong Spider Man movie in its own right.  Great animation and music too.",
            "review_date": "2020-08-03",
            "source": "rt"
        },
        {
            "content": "A fun little comic book movie that has more heart than you’d expect. I loved the combination of Spider-Mans to relate to each generation. I know the movie was going for inclusion, which it does better than most movies out there. It wasn’t in your face, but instead helped you care about the characters rather than subjecting you to a forced message of tolerance. It earned it. And for that, Into the Spider Verse gets a solid pass from me",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "Animation doesn’t get much better than this. An amazing movie to add to the SH universe.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "One of the best Spider-Man movies out there!",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "Its a visually impactful spider man movie, but will its story hold up? Yes it will. Is this possibly the best spider man movie? Absolutely.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Best. Spiderman. Ever.",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "One of the most visually striking films I've ever seen. Spider-Man: Into the Spider-Verse is also one of the best animated films to come around in years.",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "Best Spidey movie ever!",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "isn't me at all so many better spider man movies so cartoon to me see ya",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "Witty, funny, and unpretentious, yet full of complex and well-developed characters. A wholesome 2 hours of animation for the entire family.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Expanding on the universe of Spider-Man, this is a fantastic addition to the lore of our friendly neighborhood web crawler. Introducing us to the latest Spider-Man Miles Morales and other web crawlers from other dimension such as Spidey Gwen and Spider-Man Noir among others. This movie has it all, Great Story, Eye Popping Animation and wonderful characters. Simply Fantastic.",
            "review_date": "2020-07-14",
            "source": "rt"
        },
        {
            "content": "Even though this is animated, it is still absolute great Spider-Man quality. This movie is hilarious and enjoyable for all ages, and it even has great action and a lot of emotion.",
            "review_date": "2020-07-14",
            "source": "rt"
        },
        {
            "content": "Best Spiderman movie of all time hands down. The story is fully self-aware of what it is and the animation style is gorgeous once it grows on you",
            "review_date": "2020-07-11",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant writing from beginning to end. Tremendous voice over acting. Incredibly stylized animation. Awesome story. It's very close to a perfect movie.  Love all the call backs they make throughout. Great music.  Uhh so awesome.",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "Funny, visually breathtaking, entertaining to the core.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "Easily the best Spider-Man to date.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Una animación impecable que te hace disfrutar cada fotograma, buena banda sonora que encaja con las escenas y representa al personaje principal, personajes de cómics muy bien adaptados con un desarrollo bien ejecutado, cabe destacar que ningún personaje es mal trabajado, cada uno tiene su momento de brillar en la pelicula.",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "One of the best, if not THE best of Marvel movies.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "I'm not much for superhero movies but my kid kept saying I got to see this one. He was so right.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "This is so over produced that the story and characters are almost secondary.\n\nThe bonus is that the production becomes an extension of the characters down to the frames per second in which characters are animated.\n\nI love stories where a character actually is killed off to make way for the next (makes for a much better world, see GOT and Walking Dead). I honestly could have done without the multiverse, but they did a great job with it.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "One of the best animated movies ever with great action, voice acting, story, and some of the best animation styles ever.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "This film is the type of Spider-man movie we've needed for along time. It's not only progressive with Miles Morales as the main character,but it's realistic in its portrayal. For the longest time, black main characters were regulated to stereotypes of absentee fathers and gang life. This film does an excellent job showing the humanity we all have, and I'm glad it does so in a simple yet productive style. The multiverse shenanigans and the physical and mental process Miles goes through help connect with the audience.This is a piece of cinema that tackles struggles but pushes unity and togetherness,and it's a film I'd love to see again.",
            "review_date": "2020-06-25",
            "source": "rt"
        },
        {
            "content": "really love the aesthetics and plots and lines",
            "review_date": "2020-06-24",
            "source": "rt"
        },
        {
            "content": "I love all the superhero action and the 3D comic book animation in this movie",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "This movie is great! I would say this film is just as awesome as \"Spider-Man 2\". It has fantastic animation in this film. Definitely my favorite film of 2018.",
            "review_date": "2020-06-22",
            "source": "rt"
        },
        {
            "content": "Stuttered sometimes, but my fanboy came through. Even the ridiculous worked, which gives me hope for an animated Howard the Duck.",
            "review_date": "2020-06-20",
            "source": "rt"
        },
        {
            "content": "Flawless, stunning and new. Loved this whole movie felt eh animation to sound track. An absolute joy ",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "The absolute best animated movie of all time. Without a doubt.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "One of the best films of 2018!",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "Jeff Barnes \n5/5/20 \n\n\nSpiderman Into the Spiderverse Review \n\tSpiderman Into the Spiderverse is an animated film adaptation of the iconic superhero Spiderman. In into the Spiderverse a gifted teenager named Miles Morales becomes the one and, only Spiderman or so he thinks in his universe, and ends up teaming up with other Spiderpeople from other universes to stop a threat to all of their realities. Spider into the Spiderverse is a brilliant animated masterpiece, not only with mixing in traditional animation with computer animation, but with having many other typical elements that go along with animation such as humor and colorful characters. \n\tSpiderman Into the Spiderverse pays tribute, not only to Spiderman, but to the animation genre in general. It pays tribute to traditional animation by showing traditional animation in the form of a comic book when one of the spidermen in the film whose name is Peter B Parker explains a plan he has to hack a computer. It also gives acknowledgment to classic animation simply by having a classical animated Spiderman in the form of a pig. It shows respect to anime by having an anime spiderwoman and to more modern animation by being mainly in the form of CGI. It gives nods to the original Tobey Maguire Spiderman films by showing some of the scenes from them over again in animation. It also plays the original main Spiderman theme song and features the old Spiderman cartoon that came out in the 60s. \n\tThe film has a fair amount of humor which is also admiring since animation traditionally and perhaps usually is associated with humor. If you notice during the opening scenes of the film when Mary Jane is kissing Spiderman it's Mary Jane hilariously hanging upside down instead of Spiderman. Peter B Parker sees a different version of himself which is not only a blond version of himself but a much nicer looking version of himself if you notice which is also amusing. There's also an inside joke when one of the spiderpeople asks if the spiderpig known as spiderham is legally allowed to say \"that's all folks\" after spiderham says, \"that's all folks.\"\n\tSpiderman Into the Spiderverse creates plenty of diversity with its gaudy characters not only by having spiderpeople that are completely different from each other, but also by having a biracial person play Spiderman, and diversity adds tons of color. Spiderman into the Spiderverse is very different from the previous Spiderman films by being animated and this alone is very gaudy. I would love to see each spiderperson in the film of their own.   Particularly, Spidermannoir because seeing a film of his would be an authentically different Spiderman film. It would not only be animated but also in black and white, and I just may get my wish with there being talk and planning of a spinoff film. \n\tSpiderman Into the Spiderverse is an animated masterpiece that is not only worth seeing, but also worth seeing more than once. I give Spiderman into the Spiderverse a 10 out of 10.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "Both animation and screenwriting at its finest, period.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "AMAZING, AMAZING, AMAZING, a Spider-man comic book coming to life",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "It gets a pass because of the brilliant animated graphics. That aside it becomes a bit drab and predictable when all the fighting really gets going. Too many unnecessary characters join the show too.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "I never thought I was going to see such a great superhero movie with such different and distinct elements, and being made in animation makes it even better",
            "review_date": "2020-06-08",
            "source": "rt"
        },
        {
            "content": "There is no other way to cut it - the animation in this is incredible. A movie that truly breaks the mold and hopefully sets the stage for a new paradigm of awe-inspiring animated films.",
            "review_date": "2020-06-08",
            "source": "rt"
        },
        {
            "content": "Really unexpected for me to love it this much",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "This very much the best superhero movie ever. It is anything but pretentious. It makes you feel that animation is where the superhero verse belongs. More importantly it does not just present any animation. It presents a brilliant diverse mix of different animation style that makes you wonder what it will present mix. Incredible risk and experiment from Sony that reflects on the multi-verse comic very much.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "absolutely f*cking beacutiful",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "Overhyped trash.  The animation was choppy and not pleasing to the eye and the liberties they took with the characters and their designs are so hilariously off from the source material any true fan of Spiderman and the character of Peter Parker should find this movie offensive despite its pandering attempts at fanservice.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "Clever use of a multiverse of Spiderman and a fun enough story. The animation style was distracting and many of the characters could have been more developed.",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "This is a movie made for serious fans of both Spider-man and great animation. It alludes to past Spider-man's of Macguire and Garfield, and has a little bit of something for everyone. The most comic book looking movie I've ever seen about a comic book character. Every frame felt like a work of art",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "This movie was a fresh and fun adventure with the best animation i have seen in any animated film. The story was pretty good, but the characters and their designs were what made this movie great. Miles learns so much about himself during this movie. This is the best work the animation studio of sony put out. Wonderful.",
            "review_date": "2020-06-03",
            "source": "rt"
        }
    ]
}