{
    "rating": 4.6,
    "release_date": "2018-11-08",
    "num_reviews": 77,
    "genres": [
        "Hindi"
    ],
    "summary": "East Indian freedom fighters unite to battle British soldiers in 1795.",
    "reviews": [
        {
            "content": "This is a definition of a rotten tomato. I don't know what the makers were thinking in this movie.",
            "review_date": "2022-10-20",
            "source": "rt"
        },
        {
            "content": "Total flop. Boring. Fell asleep.",
            "review_date": "2022-09-20",
            "source": "rt"
        },
        {
            "content": "Entertaining,good movie. I liked it.",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "This movie is so underrated  ,, I don't understand why the bad reviews and why it was a flop !!! great entertainment and wonderful cast (except for Katrina.. I'm not a fan :-)) ,, it has some directorial flaws but it can pass. highly recommend.",
            "review_date": "2020-11-21",
            "source": "rt"
        },
        {
            "content": "The movie is highly entertaining.\nIt is an entertaining family movie with a nice plot and a lot of action. Aamir was on point as always and I loved his character. Mr. Bachchan is a legend and he's in that stage of his career by my opinion , in which it is enough for him just to be in the movie. Fatima was a delight to watch. Someone I really liked is the girl playing young Zafira (Deshna Dugad). She's done pretty well for the small role she had and for her young age.\n\n\nPROS: Aamir Khan, Amitabh Bachchan, and Fatima Sana Shaikh. While Amitabh and Fatima did not have much material, every time they were on screen, they were extremely impressive with the stunts in their fight sequences. The two of them also have a nice character arc that I wont spoil. And Aamir Khan is always the best. Just because he acts cheerful and full of energy, doesn't mean he is Jack Sparrow as some people believe. The fight sequences are really, really well-done, especially for a Bollywood movie with amazing fight choreography, realistic looking ships and outstanding visual effects. The VFX were nowhere near as bad as some people have so harshly dismissed. The background score is great. Its generally a feel-good film. This is the perfect popcorn entertainer that will make you laugh and keep your spirits high with terrific action sequences and good acting.\n\nCONS: The story could have been a little more complex. Some of the editing in the fight sequences, at times was a little choppy, although  were great!  The movie could have been a little shorter.\n\nAll in all, it is a simple, straightforward story that feels like a summer blockbuster entertainer. So , in conclusion, if you are in a mood for an entertaining action , the movie will leave you with a good feeling. Give it a try..",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "So truly bizarre a film that in half a generation it will have a cult following, much as Plan 9 From Outer Space does. ",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "Needs bit more graphics",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Aamir Khan's films have become high quality recently, making us enthusiastic about this film. The first half was good at presenting the story and characters, along with comedy, adventure and fun, but the other half of the film was frustrating and tragic,\nEvents have become illogical\nAnd empty of anything,\nExaggerated events .. an epic review exaggerated .. and a story is not free\nThe film is suitable for entertainment only, and is frustrating for the awaited viewer",
            "review_date": "2019-02-07",
            "source": "rt"
        },
        {
            "content": "Worst movie I ever seen it",
            "review_date": "2019-01-19",
            "source": "rt"
        },
        {
            "content": "Amazing and very emotionally moving film. Amitabh Bachan does it again!!",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "I have no clue why people didn't like it, very nice movie. Watch at least once.",
            "review_date": "2019-01-12",
            "source": "rt"
        },
        {
            "content": "Loved the story,  cinematic,  and plot, there is a need to make such more movies,  thumbs up.",
            "review_date": "2019-01-07",
            "source": "rt"
        },
        {
            "content": "Terrible, boring, just a few words to describe this awful movie, they did have an idea, to make a movie on a double-crossing scoundrel, an Indian Jack Sparrow only with nationalism throw in, the problem is this mixture along with the execution just doesn't work. The script is nonexistence, we just jump from one high budget action sequence to another with little substance in between, add to it the terrible pacing and the length of the movie at 2 hr 45 min, it's just a torture ride.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "One of the worst movie of the year",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "Gone with expectations........ Returned with disappointment",
            "review_date": "2018-12-16",
            "source": "rt"
        },
        {
            "content": "Really good movie ...watch it",
            "review_date": "2018-11-29",
            "source": "rt"
        },
        {
            "content": "5 Star 10-10\nexcellency at its peak at every aspects of the movie. How the movie is made is just beyond perfectionist that it almost feels like you are watching a Hollywood movie.  The story, direction, acting, songs, comedy yet thriller, everything is beyond excellence. I enjoyed EVERY SINGLE BIT of the movie.\n\nHowever, i am at utter shocked by the rubbish review. anybody who did not like the movie obviously had no brain or perhaps are audience who like watching non-sense. Or i am 100% sure this is just a marking propaganda to rate down Amir Khan movie. for full review http://mahwaqib.com/thugs-of-hindostan/",
            "review_date": "2018-11-25",
            "source": "rt"
        },
        {
            "content": "Its not that bad like Tiger zinda hai or Other remake movies of salman.",
            "review_date": "2018-11-23",
            "source": "rt"
        },
        {
            "content": "People are saying it was a bad movie, and while I agree that the direction and dialogues were not I mpressive, the acting, the cinematography, the action, the effort put into the CGI was fantastic. It was still an entertaining film! Do not let other people think for you, watch it and think for yourself",
            "review_date": "2018-11-23",
            "source": "rt"
        },
        {
            "content": "Worst movie ever that's all I can say ï¿ 1/2",
            "review_date": "2018-11-22",
            "source": "rt"
        },
        {
            "content": "Decent movie, unfortunate smear campaign. If you are interested in a Lagaan type of movie, the movie delivers and more. The story moves at a decent pace, the actors do justice to their roles and the cinematography is brilliant. If you go with an open mind and not already influenced by the negative reviews that now follow every Aamir Khan movie, I think you will not be disappointed.",
            "review_date": "2018-11-18",
            "source": "rt"
        },
        {
            "content": "Very surprised to see Aamir and Amitabh even accept such a movie. Poor direction and cinematography. Terrible music and choreography.  Only 1 song was good although. Brainless story and bad script writing! Dialogues were cliche. Katrina was horrible to the other extent! I'm sorry but totally disappointed. I had great hopes!! As I don't miss movies with such star cast.",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "A very entertaining movie that was fun to watch with the family. Amir khan was on point with his comic timing while Big B brought back the magic from Shahansha times. Special effects were almost flawless. Apart from the ever soaring eagle behind Amitabh Bachchan the movie gave me plenty of entertainment.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "A fun movie to watch. Aamir Khan puts on a good show. On the downside, it doesn't form an emotional connection and the production is far off from the magic of the Pirates stories.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "Making it the worst movie of Aamir Khan.\nSound tracks,plot,planning every thing sucks.",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "I LOVED IT!!!!!!! I watched it and its completely different than what people say, I loved it so much, You should not listen to people and watch it yourself!",
            "review_date": "2018-11-15",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing movie!!! ??",
            "review_date": "2018-11-15",
            "source": "rt"
        },
        {
            "content": "Once again Amir Khan proved that he is the best in Bollywood. This is a good 5 star movie from scene 1 to the last scene. Full of entertainment and set looked so great. A possible 400 crore movie. A well written script and well directed.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Awesome and fun movie.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Absolute garbage! I felt pathetic after watching it.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Greatest Film Ever Made!\nHollywood: Eat your heart out! The Godfather, Citizen Kane, Schindler's List, etc. can't compete with Thugs of Hindostan!",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Great movie over the Firingi with Marvaleous cinegraphy. The movie tells us if we are united then it's quite difficult to defeat the brave indian. Nice choreography with a great story. Superb action by Big B. The great warrior role by Amitabh. Also good action by Amir , Fatima and Katrina.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Great movie all the bad reviews fake propaganda please go watch this movie ",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "Copy cat... Please try to avoid watching this movie by spending your hard earned money... Such a waste..",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "worst vfx and story line",
            "review_date": "2018-11-13",
            "source": "rt"
        },
        {
            "content": "Movie was entertaining. Amazing visuals!",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "This movie wasn’t as bad as a lot have been saying. The scenes were amazing. The acting was great and the story wasn’t all that bad either. It’s a film meant purely for entertainment which it definitely delivered. I would recommend watching this in IMAX. ",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "I loved the movie as most of my friends did. A really good movie, a must watch. Critics reaction, not understandable from any angle.",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "Ok after concederastion of bad reviews from critics, first thing first great performances for Amitabh Bachchan and Aamir Khan but the whole entire film concept has made into Pirates of the Caribbean concept and the whole storyline has added into it so the storyline which was perfect but it did some dull moments through the second half so good movie and it is worth a watch. So 4/5* for this movie ",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "This movie is just worrh watching amazing movie some people are blaming the movie just bcoz of -ve fake reviews and rumours everything jn movie is so awesomely done especially aamir khan acting is just fabulous his character is mind blowing amitabh bachan's sir is just wonderful and I have been a fan of Fatima after watching her acting skills & katrina's hotness is overloaded epic movie just watch it don't save ur money for zero or 2.0",
            "review_date": "2018-11-12",
            "source": "rt"
        },
        {
            "content": "Still better then Shahrukh Khans Zero film. Ooo wait it's not out yet... ??",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "I couldn’t figure out one thing that was done right in this movie except getting Aamir and Amitabh sharing the screen. ",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Worst of it's kind",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "This movie is pure garbage...dont watch it even on gunpointï¿ 1/2~,ï¿ 1/2~,",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "This Director is worst director i have ever seen",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "The movie is not as bad as the critics review suggest.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Worst movie of the year.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "A good one time watch. Big star cast, which forces you to book the ticket. Good different locations, a Theme based movie with connected songs, nothing out of the box. Even the acting was so connected, no one got extras to play. few twist and turns by Amir, as per the story. Actions were not at all fake, unlike so many other hit movies. Not bad at all, at the end, Don't go by the reviews %, read the reviews, you may find 9 haters and 1 lover. Your call at the end of the day.",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "Not bad but nobody highlights I would say could be better if script and timing little short",
            "review_date": "2018-11-11",
            "source": "rt"
        },
        {
            "content": "The movie's script is just bad and incomplete . The character development is pathetic. Amit sir don't even speak until the first hour. amir khan's character \"Firangi Mallah\" is a complete copy of johnny depp's jack sparrow. Katrina Kaif is just there to add glamour and has only 6 lines in the entire movie . It is full of plotholes.The direction  is pathetic , the songs r pathetic. Its one of the worst films of the century",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "A very good movie. A movie with a very good storyline and everybody's performance is amazing. A must watch movie. You should not miss watching the movie.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Most pathetic Aamir khan film.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "\"Late Thug all Hindustan\"by VKA\nThis was worst than Race 3 \nO after rating",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Listen.... Thugs of Hindostan is not a bad movie; a good one, as a matter of fact. My rating a 3.5/5, is supreme. Thugs of Hindostan is a fresh 'light bulb' and theme in Bollywood cinema, consisted of great acting throughout, how the story unfolded was also appreciated, as it was very enjoyable and 'you' might be surprised note this but the story was good. However, before delving into the perks of the story, Amitabh Bachchan and Aamir Khan are in pivotal roles, but as to the story, Fatima Sana Shaikh is more at centre than you think. \n\nWith a very simple story; two thugs want to overthrow 'Clive' and his group. Since they can't because 'Clive's' army is very strong, 'Clive' hires another thug to simply brush them off. After the thug realises that one cannot just simply brush off Amitabh and Fatima (because of their relationship and strength). As a solution he decided to first falsely join forces with them and later overthrow them as an infiltrator. Continuing on with the solution the thug decided to actually join forces with Amitabh and Fatima to overthrow the 'Clive' together. \n\nAlthough each character had thier motivation, the direction should have emerged that stronger.  Duration is a big part of a movie, especially Hindi cinema, this movie was prolonged for a bit too much.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Excellent must watch",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Pathetic acting by Amir and pathetic movie in all",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Not a typical lame indian movie. It is definitely a must watch and decide for yourself. Aamir khanï¿ 1/2(TM)s acting is the best! And Amitabh too..",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "As a compensation to the society for making this bad bad movie YRF should start a  writing institute with best writers as professors and catching the best writing talent from the country and nurture them so that talent less people like Vijay are left to do what they are good at. Very disappointed with Aamir khan who disrespected audiancecant believe u made peepli live and then acted in ToH. Shame on u all.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Why amir choose this ghatiya acharya why God why ?",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Pathetic Movie. These kind of movies deserve to be panned by the audience. Better go and watch Badhai Ho instead.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "Before I watched this movie, all I heard and saw were negative reviews - which made it hard to sit on the padded sea of the cinema without prejudice for an apparently bad movie.\n\nBut, I kept waiting for the movie to get slow/ stale/ boring - but it never happened!!! Thugs of Hindostan is a fantastic action flick with a production and direction team that has not been scared to take bold steps to direct the Bollywood industry to a newer, more conceptual artform.\n\nTo make it really simple, I will summarize this movie in a series of highlights (pros) and dampeners (cons):\n\nHighlights:\n\nNote: First things first - this movie is nothing like Pirates of Carribean and follows it's own original theme and storyline, So, I encourage all those thinking this is a remake of Pirate of the Carrieban to please go to the cinema and o be proven wrong.\n\n1. Amitabh Bachchan has outdone himself in this role. His character is strong, uncompromising and very convincing. His acting has matured majestically with age. His role was very reminiscent of Optimus Prime in this movie in all the good ways.\n\n2. Aamir Khan always exceeds expectations in any role he is given - so much so that if a film fails, it as never because of him, but due to other factors surrounding the movie. It is hard to imagine anyone else doing this role with the ease and charisma that Aamir has done it. His coyness and personality is the base for all suspense of this movie an he portrays his uncharacteristic nature of being unpredictable beautifully in this movie.\n\n3. Background Score - The movie's background score is a perfect complement to the vibe and look of the movie. It is a sort of a beautiful amalgamation of SHerlock Holmes meets POTC meets Lagaan. It is melodic, it is engrossing and it is perfect.\n\nDampeners (cons):\n\n1. Katrina Kaif - I feel bad that a wonderful actress who has done her part beautifully in the movie was let down by the nubile character of her role that just seems to exist to be an item number in the movie and pave the way for some racy songs.\n\nThat being said, her dance was mind blowing where she was able to exhibit the levels of which he had trained for the movie. She handled some particularly daring steps an techniques with such grace and ease. But - though it was impressive, it wasn't mind blowing as it was supposed to be. It has nothing to do with Katrina's dancing or acting - but poor costume choice/ choreography that just seemed to distance itself from the music and to exhibit more skin. The songs she was in felt like such a deviation from the rest of the movie.\n\n2. Stunts involving high/ long leaps : Bollywood has reached a level of amazing graphical capabilities and this movie is one of the testaments to it. The sea, sailing, ships and action sequences were believable and did not seem too artificial like the usual Bollywood norm. But =, the industry still seems lacking to manage long and high leaps of the actors and the editing shifting into multiple shots from the time a person starts the jump to when he lands and gets up seems artificial and interfered with the flow of an otherwise good action sequence throughout the movie.\n\nSummary: ToH is a movie that is designed to entertain all the emotional aspects of the spectrum and not to be taken too seriously. It is fun for all ages and has a little bit of everything. It is a movie that will give you goosebumps at the right moments and actually manages some decent laughs due to it's sense of humor that is carried around Aamir's character.\n\nGo without expectations to the cinema and wear a sweater (as it is around 3 hours long) and you will come out with that good feeling you get when you do only one of 3 things - watching a good movie/ after having a good meal/ after emptying a full bladder.\n\nCHeers.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "The movie is too good. It is a must watch film",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "'Thugs of Hindostan' is a disappointing and uninspiring action adventure which despite its excellent cast and mammoth budget ends up being just loud, lousy and formulaic.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "This is a review of a Bollywood movie that all Indians were excited to see, because it stars two of Bollywood's biggest and best actors, together. Imagine, HEAT with Al Pacino and Robert Dinero, and that was a classic masterpiece. This movie gets a ZERO out of 5 stars. I went to see this with so much excitement, and it was just a giant waste of time. This is 100% the director's fault. The director, Vijay Krishna Acharya is so bad, I can't believe it. I can't believe this is the same guy that directed DHOOM !! This guy should never be allowed to direct another movie again. You have two of the BEST ACTORS to ever come out of India, and you turn one into a clown, and another ...the legendary Amitabh Bachchan was shown in slow motion over and over, with no substance or great dialogue, nothing. I mean come on man!! We all wanted to see him act...not move in slow motion. What is wrong with India's director's and their obsession with slow motion, in repeat?? Who told you this is cool?? The plot is horrible...and at one point, I felt like I was watching a movie from the 80's. Katrina Kaif pretty much wears skimpy outfits, shows off her well-defined body, in vulgar dance movies which take away from the movie. The trailer makes it look like she is a lead actress, but she is basically an item number girl with two songs and very skimpy clothes with nothing of substance. I mean I could go on and on, but DON'T WASTE YOUR TIME PAYING TO WATCH THIS CRAP. Very soon this will be on TV for Free, trust me. I am sure after watching himself on screen, Amitabh Bachchan is regretting doing this movie. What a waste of a huge opportunity...two icons on India cinema on screen...and ZERO memorable scenes or dialogues. This director should never direct again. INDIAN DIRECTORS; PLEASE STOP Showing every freaken shot in slow motion....it's outdated, and not cool. TV serials all over again!!! Ok,...rant over. Go watch A STAR IS BORN or BOHEMIAN RHAPSODY Instead...you will love it. Vijay Krishna Acharya...I normally never do this, but man you wasted an opportunity of a lifetime. I guess that is what I am upset about most. AB and AK together....could have been such a huge movie!!!",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "I don't know what movie the others saw, but I thought  this movie was amazing!  For diehard Bachchan fans it's a must see!!!",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "It's A Well-Versed Film With Graphics So Good.",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "‪PSA: FEAR THIS MOVIE LIKE THE EAST INDIA COMPANY USED TO FEAR THE PIRATES OF THE CARIBBEAN !!!!! 💀 🏴‍☠️ AVOID.AT.ALL.COST. ",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "Not a gokd movie waste of time simply given more money I wasted 500 rs for this movie i wish I'd gone to an other movie worst movie only mattered was Amitabh bachan's acting which is excellent but Direction is worst i hate Vijay Krishna Acharya's every movie even Dhoom 3 he spoiled the trilogy I wish other installment of the movie will be directed by Aditya Chopra(for Dhoom 4) i tell u the movie is total waste of time don't give ur 3 hour of ur life to them",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "Tooooooo looooooonnnnnnnngggggggggggggg",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "Nice Movie good action by Amitabh Bachchan ji and good acting of Amir Khan...keep it up????????",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "Thug ne Thug liya. I am a big fan of Amitav and Aamir. That is why I booked first day first show. But what exactly it was. Niether this movie was able to create patriotic feelings nor a melodrama nor action movie nor an epic one....  One time watching movie.  No doubt super artists are there. Okay type of movie.",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "Its entertaining movie, this is for Amir khan's fan. \nKatrina is stunning and AB is as unseal amazing. Don't take Firangi Malla so serious, just enjoy his punches and comedy.",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "Outstanding acting by Aamir khan, just loved it",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "Worst movie of Aamir career such a blunder",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "2.5 average movie Full Movie click here : https://bit.ly/2DnKM4c",
            "review_date": "2018-11-08",
            "source": "rt"
        },
        {
            "content": "Although I wound up liking this movie better than I thought I would, it's certainly not without  its serious and many flaws. It was entertaining and had some fun scenes but at the  same time the movie was a clear knock off of Pirates of the Caribbean with a little Bahubali thrown in instead of being original in any way. I went to see this movie because of the cast, especially Amitabh Bachchan , Aamir Khan and Fatima Shaikh but wish they had better material to work with. Also wondering why Katrina Kaif was in this,  she didn't really add enough to the movie to justify her role.",
            "review_date": "2018-10-31",
            "source": "rt"
        },
        {
            "content": "\"Thugs of Hindostan\" isn't quite as unwatchably bad as you may have heard, but I wouldn't call it a good movie either. I feel the movie has a few decent action scenes but the character development is very one dimensional. The movie comes off as a disappointment because it showcases two great actors, Aamir Khan, and Amitabh Bachchan. In their defense, I think their performances are probably the best part of this movie but it's not enough to save a messily paced story. It's far from the worst movie of 2018 but it is also far from the best, and its definitely one of the biggest let downs in recent Bollywood.",
            "review_date": "2018-10-24",
            "source": "rt"
        }
    ]
}