{
    "rating": 9.4,
    "release_date": "1972-07-12",
    "num_reviews": 90,
    "genres": [
        "Crime",
        "Drama"
    ],
    "summary": "Hit man Jef Costello (Alain Delon) goes through an elaborate set of rituals before carrying out a hit on a nightclub owner. Always thorough and cool in his job, Costello is disconcerted to discover a witness to the killing, the club's female piano player. But before he can act, the police arrest him in a sweep of suspects. Released when the main witness does not come forward, Costello goes from being the hunter to the hunted, trailed by the determined police as well as his crime bosses.",
    "reviews": [
        {
            "content": "amazing movie. great acting performance by Alain Delon,\nthis movie made drive and taxi driver possible!",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing.  After the film when you are asking yourself WHY it is best to remember the name of the film.  This might offer some answers.",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "Was really hoping to enjoy this one, but unfortunately it did not click. I love classic films and age, for the most part, is not an issue, but this one felt dated. Alain Delon doesn't execute the \"coolness\" that Melville is trying to go for. The cinematography and tone of the movie is bland. I feel like there were good ideas here, but it didn't mesh into something that could've been great. Sadly, It was quite boring. There are other films that have done this story better, but I do respect this film for its influence.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "A cool and stylish Melville film with Delon in his best performance about the professional loner.",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "No idea what the fuss is about with this film, nor what all these reviews are going on about. \"Complex plot\", \"richly drawn character portrait\", \"beautiful to look at\", even plenty of people saying the main character hardly has any dialogue when he has plenty. It's a pretty drab-looking film (I understand it has a grey and blue thing going on) with a now-standard \"hitman gets double-crossed\" plot where the main character is just your standard stoic dead-eye who isn't even a very good hitman. If you're into french films or just checking out \"classic\" cinema, you might like it. Otherwise, it doesn't hold up.",
            "review_date": "2023-01-12",
            "source": "rt"
        },
        {
            "content": "Impassive hitman Jef Costello (lain Delon) lives in a single-room Paris apartment whose spartan furnishings include a small bird in a cage. Costello's methodical modus operandi involves creating airtight alibis, including ones provided by his lover, Jane. After carrying out a contract killing on a nightclub owner, Jef is seen leaving the scene by the club's piano player Valérie and several witnesses, but their testimonies are contradictory. After rounding up numerous suspects, including Jef, the police superintendent firmly believes Costello is the culprit. Costello loses a police tail and goes to collect his fee from an intermediary sent by his employers. When the man shoots and wounds Costello, Jef realizes that the police investigation has compromised him with his employers. After treating his wound, Costello returns to the nightclub and meets Valérie, who takes him to her home. Though he is grateful, he wonders why she lied to the police when she clearly saw him after the murder. Meanwhile, police officers bug his room, agitating the bird in its cage. Upon returning, Costello notices some loose feathers scattered around the cage and the bird acting strangely. Suspecting an intrusion, he searches his room, finds the bug and deactivates it. The police search Jane's apartment and offer her a deal: withdraw her dubious alibi for Costello and they will leave her alone. She rejects the offer. Back in his apartment, Costello is ambushed by the intermediary, who pays him off and offers him another contract. Costello overpowers him and forces him to disclose the identity of his boss, Olivier Rey...\n\nRotten Tomatoes critical consensus states, \"Le Samouraï makes the most of its spare aesthetic, using stylish – and influential – direction, solid performances, and thick atmosphere to weave an absorbing story.\" Writing of the Delons' performances in Le Figaro, Bertrand Guyard notes husband and wife are both nearly silent but \"their gazes, fraught with meaning, are enough to thrill the camera\" with the director drawing from their portrayals \"a mythical couple in the seventh art.\" Variety, reviewing the original release, called it \"a curious hybrid\" that \"appears a bit too solemn to inject all the suspense, action and characterization [Melville] seeks\", and \"almost seems to be an American film dubbed into French\" that \"could be cut a bit\". New York Times critic Vincent Canby called the original film \"immaculate\", but criticized the dubbing in the 1972 version released in the U.S. (as The Godson) as \"disorienting\" and \"dreadful\". Roger Ebert gave the film four out of four in his review, writing: \"Like a painter or a musician, a filmmaker can suggest complete mastery with just a few strokes. Jean-Pierre Melville involves us in the spell of Le Samourai (1967) before a word is spoken. He does it with light: a cold light, like dawn on an ugly day. And color: grays and blues. And actions that speak in place of words\", with Ebert including the film in his collection of \"Great Movies\" essays.\n\nJean-Pierre Melville´s 1967 neo-noir crime film which he wrote and directed is slowpaced, stylistic, colourless and short of dialogue. The film received positive reviews praising Melville's screenwriting and atmospheric direction and Delon's performance. Alain Delon´s loner assassin Jef Costello is methodical, lethal and yet not lacking of emotions. I like that Melville has kept the dialogue minimalistic, as it add to the atmosphere of the film. Delon is great as the stonefaced Jef and I liked his cat and mouse game with the police that ends up in a conclusion Jef is all aware about. And it´s nice to see Paris in 1967 which adds also so much to the film when watching it in 2022.",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "Jef you cool devil you. Some great backdrops to this searingly suave hitman film courtesy of Melville. There's a touch of dark grubbiness and a nice bit of 70s glamour that comes together effortlessly and remains a taut thriller. A good un worth watching.",
            "review_date": "2021-08-21",
            "source": "rt"
        },
        {
            "content": "An absolute classic!",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "A classic French film with a subtly surrealist style, The Godson (Le Samouraï, to use its original title) was marketed in the US as a clone of The Godfather, but it is far more than a clone of an American classic. Le Samouraï is a much different film from Coppola's masterpiece, but one which deserves equal recognition, with a gorgeous minimalist aesthetic and fascinating idiosyncratic soundtrack. It is also an extremely important film in cinematic history, with John Woo, among many others, citing the film as one of his major influences.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "It's really isn't easy to enjoy this movie in our age of constant noise, movement etc. This movie is the complete opposite of it, there are barely any dialogs from the hero (only the policemen do the talk most of the time). I think this movie has something in common with Jarhead- both show the other side of the professional hero (here it's an assassin, in Jarhead- the marine). Camera work is superb in making this movie as strict as is wants to be",
            "review_date": "2021-03-08",
            "source": "rt"
        },
        {
            "content": "Samourai (aka The Godson in the US) tells the story of Alain Delon as a professional killer.  That is a richly drawn character portrait, and the film has a complex plot, but it is all done in a style that is spare, austere, and minimalist.  That style seemed exaggerated at times, as if it were the point of the whole movie and a badge of honor for its director, Melville.  But Melville balanced that austerity with very realistic sets and decor, and especially with the voluble and communicative police inspector.  In the final seen we have a quiet but very big payoff, namely proof that Delon's character did indeed live by the Samurai code of honor.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "A minimalistic film, full of surprises. It is imaginable for me such a brilliant movie can influence lots of other movies, and maybe has resulted in lots of developments that seem normal to us nowadays.",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Le Samourai imparts the minimalism and restraint of an arthouse film to a gangster film framework that Golden Age Hollywood couldn't match for intensity or sophistication. Delon provides an effortless calm and cool nature to a character that could easily have descended into pretentiousness, becoming not so much an individual as a relentless manifestation of his mercenary nature. While some of the editing work leaves something to be desired, the nuanced performances and the intensity of the atmosphere more than compensate in this internationally influential crime classic. (4.5/5)",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "An amazing classic of French cinema! Everyone needs to see it!",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "The lighting and cinematography make the movie look like it came out decades after the 60's.  So beautiful to look at.  It oozes with sophistication but it's just not my kind of film.  Check it out if you're into slow art-house films.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "Jean-Pierre Melville's neo-noir film is clever, suave and tense. Alain Delon oozes coolness throughout the film, as hitman Jef Costello. Camera swipes, smart lighting, on location shooting and conservative use of the instrumental score act as subtly effective nods to iconic films such as The Third Man, and even the works of Kurosawa. From the time of the first shown hit, it's obvious that the careful Jef is running out of luck. There were witnesses, and the police remain hot on Jef's tail throughout the film. The varying tension goes from subtle to intense, relying on direction, performances and fantastic editing. Jef himself proves to be a formidable target, almost impossible to keep a track of by the ruthless Le Comissaire. Though the lighting is mostly natural, shadows are effectively drawn and, likewise, colors are used for great symbolism. Poetic and quiet, this film provides a great study of the thriller genre while providing a lead character that should be seen as iconic.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "A methodical and riveting paranoia thriller!\n\nJean-Pierre Melville's paranoia thriller Le Samourai (1967) is a fascinating take on crime thrillers and underground mob assassination plots. Melville's direction befits a classic noir with his slick and patient style. Le Samourai is like The Conversation meets The French Connection with a bit of John Wick on the side. His drama ranges from planning out an assassination hit to the police trailing the hitman around Paris. Melville's writing is intricate with a methodical attention to realistic detail. \n\nFurthermore, Melville's long panning shots and far wide shots of long hallways are really cool to watch. Henri Decae's cinematography is gorgeous and creatively shot. His close-ups are angled in an interesting fashion as well. Fashionable Parisian backdrops are lovely to behold thanks to Francois de Lamothe's art deco designs. Especially when all this crime is being carried out while being scored by Francois de Roubaix. The haunting jazz music is ethereal and beautiful creating an uneasy atmosphere for Le Samourai.\n\nMonique Bonnot and Yolande Maurette's editing is professional and tight, making Le Samourai's 105 minutes pass by quickly. I love all the tan trench coats, black suits, neat fedoras, and black pistols. Everything in Le Samourai is neat and tidy like the mob cleaned off all the evidence already.\n\nAlain Delon is enthralling as the quiet, samurai inspired assassin Jef Costello. His subtle performance is full of staring eyes, quick looks, and fast movements. He's a compelling lead in Le Samourai. Natalie Delon is stunningly gorgeous as Alain's girlfriend and alibi Jane Lagrange. Her tragic loneliness and desperate desire for Alain's character's love and warmth is genuinely sad. Natalie was Alain's real wife at the time too, so it's neat to see them on screen together. Cathy Rosier is intriguing as the pianist and witness. Lastly, Francois Perier is excellent as the persistent superintendent.\n\nIn short, I really loved Le Samourai.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "TV, 2019/12/14\nWhat did you think of the movie?",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "\"There is no greater solitude than that of the samurai unless perhaps that of the tiger in the jungle.\"\n\nSomething is wrong with Jef Costello (Alain Delon), and it's not the fact that he is a contract killer who gets caught in a crossfire between the police and his clients.\n\nFrench director Jean-Pierre Melville opens his masterpiece from 1967 with the fictive quotation from above, allocating it to the ‘Book of Bushido'. It is layed upon the first image of his masterly painted grey cinematography with sparse strokes of blue and green monochrome: Costello is smoking in his bed, almost completely merging with his room that with its moss green walls indeed reminds you of a jungle. He is barely visible- it is only the smoke that hints at him. This opening scene's long shot has a slight vertigo effect that is not due to some shaking of the cameraman's hands, but tells us that something is not quite right.\n\nIn the next setting Costello is shown through the rainy windows of the car that he is stealing. He looks straight ahead, not even looking away as he selects between numerous keys on the passenger seat to start the car. Costello looks at the world as through a veil, ignoring the flirty smile of a by-driving beauty as well. This beautiful killer is not emotional or hedonistic, but disciplined, strict and seemingly asexual. There is no hint of any tension or panic, no cold sweat and as the film moves on, the inner world of Costello can only be guessed by the reactions and mirroring of the\npeople who encounter him on his way.\n\nIt's these little hints that tell us that ‘Le Samourai' is not only a cool neo-noir thriller, a masterpiece between Nouvelle Vague and Film-Noir, but Melville's Costello suffers from schizoid personality disorders. The director dealt extensively with the disorder in the preparation of ‘Le Samourai' and cast the perfect actor for its portrayal without psychologizing.\n\nAlain Delon. Does he have a pulse? An ice-cold destructive angel who often seems to be in a dreamlike, somnambul state that makes his beauty blur, making it tolerable. Gracing the screen with glacious eyes and seemingly untouched by it all, but moved by an anonymous compassion. Delon achieves maximum effect with minimal theatralics and dialogue. Singularly handsome and disarmingly serious, Delon agreed for his first project with Melville after the director read the screenplay to him, left intrigued by the fact that there was no dialogue within the first 10 minutes.\n\nOn the surface a thriller, ‘Le Samourai' is not borne by the usual effects, but by a strict code of conduct, an elegant and cool masterpiece. Delon's congenial performance takes the suspense out of almost anything in this movie, in the true sense of epic drama that is not about the whodunnit or effects, but provides an introspective layer for a deeper understanding. In this case this layer is the cold shiver on your spine, constantly just a few degrees below your feel-good temperature. And this subtle shiver reverberates long after Costello says goodbye to life and the screen with a stoic look. No catharsis here.\n\n‘Le Samourai‘ also marks the peak of the holy trinitiy of French cinema: Jean Pierre Melville, Alain Delon, and Francois de Roubaix with his congenial score and electronic theme. Roubaix was a brilliant autodidact and electronic innovator to whom many French artists like Daft Punk or Air refer to as huge inspiration. He died way too young with 36, condemned to be a briefly shining meteor in music history, while his themes and scores for films such as ‘Le Samourai', ‘Commisaire Moulin', and ‘Dernier Domicile Connu‘ remain appealing to this day and are well worth exploring.\n\nListen to The Samourai‘s theme, it is one of those rare cases in which the film music is a crucial factor for the analysis of the film. It is the heartbeat of Delon's Costello, a warped cardiogram that was painted with ink on blotting paper. It sets off with fright and then wavers between incomprehensibly tender moments, an inescapable coldness, fatigue, and a distant and confused sense of sadness.\n\nJef Costello. Ice-cold, but an angel.\n\nhttps://vinylwriters.com/le-samourai-1967/",
            "review_date": "2019-12-11",
            "source": "rt"
        },
        {
            "content": "This film is perfect. A stripped down, sparse, stylish thriller about a paid assassin, Alain Delon almost wordlessly creates an unforgettable hitman with a heart of gold. Scenes of Paris, subways, nightclubs, and apartments situate the film in a kind of timeless portrait of Paris. The chase on the Metro is an incredible piece of filmmaking which ratchets up the tension. The film is beautiful to look at but it also has a soul in the mysterious behaviour of the title character. Through his actions, he achieves immortality among murderers.",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "The performances are good, I like the protagonist (even though he has minimal dialogue), and it has pretty stylish direction for its time, though the movie can be a little slow. While I don't think it's a masterpiece, I respect it for influencing some of the great crime-thrillers of the future.",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "I liked it very much, I felt that the movie just kind of pulled me in  and after it was over it took me a moment to relaize i was just intialy planning to watch it as more something in the back ground.   I would say any one interested in a story   about a hitman , a  determined cop, an d a guild of assasins , should give this one a chance.",
            "review_date": "2019-03-17",
            "source": "rt"
        },
        {
            "content": "This is one of the most influential films of history. Martin Scorsese, Quentin Tarantino, Francis Ford Coppola, Jim Jarmusch, John Woo, Johnnie To, David Fincher, Bernardo Bertolucci, Aki KaurismÃ¤ki, Takeshi Kitano, Micheal Mann, Georges Lautner, Nicolas Winding Refn, Luc Besson, Joel Coen, Ethan Coen and others have all made films strongly inspired by it.",
            "review_date": "2019-03-12",
            "source": "rt"
        },
        {
            "content": "Probably one of the most influential films made.",
            "review_date": "2019-02-10",
            "source": "rt"
        },
        {
            "content": "A terribly overrated melancholic thriller. Above all nothin adds up as the plot is so surreal.",
            "review_date": "2019-01-23",
            "source": "rt"
        },
        {
            "content": "I'm giving this an extra star because of its influence, but this isn't a great film.  Viewers today may find themselves distracted by elements like absurd plot elements and weird police procedures.  Still, the 'modern' aesthetic wears mostly as well as Delon's trenchcoat, but, like the car chase in Bullitt--innovative for its time--the subject and execution have advanced considerably.",
            "review_date": "2018-12-05",
            "source": "rt"
        },
        {
            "content": "This neo-noir crime film reeks of atmosphere. Directed by the legendary Frenchman Jean Pierre Melville and starring the French heartthrob Alain Delon as the main character Le Samourai is a great classic of world cinema. Delon is an contractual assassin and his latest hit gets him in some soup. The style is minimalist and the cinematography is bleak on purpose. Though there are some plot holes which can be found if studied deeply I feel that the film is meant to be a stylish take on a philosophy and in that capacity it works perfectly. If you wish to get into French films than this is a straightforward flick full of fedora wearing assassins and nightclub singers that can be helpful.",
            "review_date": "2018-11-29",
            "source": "rt"
        },
        {
            "content": "One of the finest films ever made for me. This is an incredibly moody drama by French master Jean Pierre Melville. It is a crime film on the surface about an assassin who lives according to a certain code. Alain Delon is magnetic as the main character Jeff Costello. This film has inspired many modern great filmmakers and it is easy to see why. Fantastic tracking shots, great angles and an emphasis on mood. It is a work of art. If you get an opportunity do see this film. One of the best examples of the French new wave.",
            "review_date": "2018-10-24",
            "source": "rt"
        },
        {
            "content": "One of the finest films ever made for me. This is an incredibly moody drama by French master Jean Pierre Melville. It is a crime film on the surface about an assassin who lives according to a certain code. Alain Delon is magnetic as the main character Jeff Costello. This film has inspired many modern great filmmakers and it is easy to see why. Fantastic tracking shots, great angles and an emphasis on mood. It is a work of art. If you get an opportunity do see this film. One of the best examples of the French new wave.",
            "review_date": "2018-09-05",
            "source": "rt"
        },
        {
            "content": "This neo-noir crime film reeks of atmosphere. Directed by the legendary Frenchman Jean Pierre Melville and starring the French heartthrob Alain Delon as the main character Le Samourai is a great classic of world cinema. Delon is an contractual assassin and his latest hit gets him in some soup. The style is minimalist and the cinematography is bleak on purpose. Though there are some plot holes which can be found if studied deeply I feel that the film is meant to be a stylish take on a philosophy and in that capacity it works perfectly. If you wish to get into French films than this is a straightforward flick full of fedora wearing assassins and nightclub singers that can be helpful. (A haunting neo-noir by the great Melville).",
            "review_date": "2018-08-29",
            "source": "rt"
        },
        {
            "content": "Le Samouraï is the story of a hitman who has something go wrong when killing someone, and is at risk of being discovered by the police. I loved all the visual story-telling in this film. There wasn’t a lot of dialogue until we get to the police investigation. In fact, I think it was completely silent until the 10 minute mark. There was a neat contrast between the world of the hitman where silence and stealth is what fills most of his scenes, and then the police station where lots of noise and openness are used to work through the case. When the two worlds collide it is this battle to see who will win, and I liked the tension of not knowing if our protagonist would get away with his crime or not. It’s great to both know everything that is happening on each side of the case, and simultaneously not know which way the investigation will pan out. My favorite part of the film was watching the detailed procedure that this hitman goes through in order to avoid detection and manufacture an alibi. There were moments where I was wondering what he was doing and then the pieces would all fall into place later, and I realized he was genius and thought of everything. This also was a nice framework to show us the meticulous nature of Jeff Costello, so we would understand what he was doing later in the film when he’s working on another job. There’s almost a layer of OCD in his regimented routine, which makes it more convincing that he could detect when things were not quite right around him. A lot of credit needs to be given to Alain Delon for his acting in this role, because it is a largely silent performance of a stoic character, but he still managed to make it endearing. That might be the most interesting part of Le Samouraï, the fact that they managed to get me on the side of a hitman without much work. There are no signs that he is a heroic figure of any kind, and yet I was nervous for him, and hoping he could evade detection. Ironically, the commissioner of the police was not that bad of a guy, either. He had his own sixth sense and was following a gut instinct that we know was accurate, so by all rights I should be on his side. But I couldn’t help rooting against him. Any movie that can manipulate my loyalties in that fashion (when I can’t even detect how they are doing it) is a marvel to me. Le Samouraï is a film that I want to watch again in order to explore it more because it impacted me a lot, and told a great story at the same time. Also I want an opportunity to figure out exactly what happens at the end.",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "One of the finest films ever made for me. This is an incredibly moody drama by French master Jean Pierre Melville. It is a crime film on the surface about an assassin who lives according to a certain code. Alain Delon is magnetic as the main character Jeff Costello. This film has inspired many modern great filmmakers and it is easy to see why. Fantastic tracking shots, great angles and an emphasis on mood. It is a work of art. If you get an opportunity do see this film. One of the best examples of the French new wave. (Melville's Le Samourai is a haunting masterpiece)",
            "review_date": "2018-08-18",
            "source": "rt"
        },
        {
            "content": "This neo-noir crime film reeks of atmosphere. Directed by the legendary Frenchman Jean Pierre Melville and starring the French heartthrob Alain Delon as the main character Le Samourai is a great classic of world cinema. Delon is an contractual assassin and his latest hit gets him in some soup. The style is minimalist and the cinematography is bleak on purpose. Though there are some plot holes which can be found if studied deeply I feel that the film is meant to be a stylish take on a philosophy and in that capacity it works perfectly. If you wish to get into French films than this is a straightforward flick full of fedora wearing assassins and nightclub singers that can be helpful. (A masterpiece of atmosphere and Delon in top form).",
            "review_date": "2018-08-13",
            "source": "rt"
        },
        {
            "content": "This neo-noir crime film reeks of atmosphere. Directed by the legendary Frenchman Jean Pierre Melville and starring the French heartthrob Alain Delon as the main character Le Samourai is a great classic of world cinema. Delon is an contractual assassin and his latest hit gets him in some soup. The style is minimalist and the cinematography is bleak on purpose. Though there are some plot holes which can be found if studied deeply I feel that the film is meant to be a stylish take on a philosophy and in that capacity it works perfectly. If you wish to get into French films than this is a straightforward flick full of fedora wearing assassins and nightclub singers that can be helpful.",
            "review_date": "2018-07-23",
            "source": "rt"
        },
        {
            "content": "There are snippets where the movie begins to explore its potential, but a staggeringly dull main character and pace cloud the vision.",
            "review_date": "2018-05-31",
            "source": "rt"
        },
        {
            "content": "The Godson is a film-noir of style thanks to Alain Deleon’s performance of a silent, on-the-move “Samurai” and the boosting soundtrack to layer the film editing",
            "review_date": "2018-02-17",
            "source": "rt"
        },
        {
            "content": "Effective French crime movie about a lone wolf, \"samourai\", wih icy performance from Alain Delon. Memorable ambient jazzy soundtrack creates a bleak and solemn atmosphere. Actually this movie is perfect: it's pacing is just right, it doesn't hurry and it doesn't drag; constructed perfectly. Melville as a director prefers faces to words: facial expressions tell way more than hundreds of words, and so in this movie you can tell a lot about characters' inner worlds just watching their countenances.",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "1001 movies to see before you die.  A Unique French assassin movie.",
            "review_date": "2017-08-30",
            "source": "rt"
        },
        {
            "content": "Le Samourai is a mesmerizing crime film. Melville's attention to procedural detail builds suspense, not boredom, and keeps you holding your breath until the brief outbursts of action. One of the greatest films ever made.",
            "review_date": "2017-07-14",
            "source": "rt"
        },
        {
            "content": "Jean-Pierre Melville's over-analyzed, highly suspenseful crime film landmark Le Samouraï contains one cool moment after another, with Alain Delon playing a criminal that you both cheer for and despise.",
            "review_date": "2017-06-15",
            "source": "rt"
        },
        {
            "content": "Bleak, well paced, minimal dialogue.  Noir.",
            "review_date": "2017-06-10",
            "source": "rt"
        },
        {
            "content": "Beautifully shot, spare, and oh, so cool. Too cool, in fact, as its detachment mostly ices the suspense. Hugely influential; I bet De Niro, Mann, and Frankenheimer watched it a few dozen times before making Heat or Ronin.",
            "review_date": "2017-04-29",
            "source": "rt"
        },
        {
            "content": "It's a very grey movie. Like literally, the color grey fills the screen in this movie. I wish it didn't look so depressing and dreary but nonetheless it was a great French noir film. I loved the chase scene at the end and how suspenseful parts of the movie felt.\n\nI'd probably need to watch it again to get the full affect, but for now, great movie.",
            "review_date": "2017-04-12",
            "source": "rt"
        },
        {
            "content": "One of the greatest.",
            "review_date": "2017-02-06",
            "source": "rt"
        },
        {
            "content": "A superb action thriller. Set in an urban landscape. Alain Delon as Jef plays a perfect samurai warrior with a gun instead of a sword. And the police that chase after Jef Costello are ruthless to get the job done. It's a very well balanced thriller that engages you more and more as it goes along. Starting out rather slow and some might even say \"boring,\" but like it's lead samurai, the movie is always one step ahead of you. Often surprising you when you least expect it to. it has a slow burn aspect that I really fell in love with during it's final act. I would watch it again in a heartbeat. As the movie is shown to be more charming than I might initially have thought. All in all, the movie is a fantastic work and does a great job world building to immerse you in something that fells very dangerous. 5 out of 5",
            "review_date": "2017-01-11",
            "source": "rt"
        },
        {
            "content": "Classic. Quintessential movie of it's genre. The Driver (1978), The Professional (1994), Ghost dog (1999), Drive (2011) - all of these movies came from this particular Mellvile's Masterpiece. Silent and speechless Delon is the archetype for many essential Hollywood characters.",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "This film would equate being a paid assassin with a Samurai, but the latter would never do the deed strictly for remuneration. That said, this was a good period film. France looked pretty rough in 1967, from the looks of this, but you can see the construction of what France looks like today. A bit of a time traveling journey, and we've seen Delon in this character before. 3 Stars - one of the 1001 Movies",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "Looking back, basically every Alain Delon's film looks just the same.",
            "review_date": "2016-04-23",
            "source": "rt"
        },
        {
            "content": "A mesmerazing film from the first shot, The use of lighting in this film it's like seeing a painter brush in motion, the pace is perfect, the tension gripping,. Melville proofs beyond all doubts that he was one of the greatest european directors of all times, altough his influence is seldom mentioned nowadays. This is one of the best examples of modern Film Noir, and Alain Delon shines (along with a very consistent cast) as one of the most cold blooded, unapologetic and smooth killers ever put to screen. Definitively a must see for any movie lover.",
            "review_date": "2016-01-27",
            "source": "rt"
        },
        {
            "content": "Very cool and very calculated. A riveting experience held up by Alain Delon's performance and Melville's attention to detail. A masterclass in noir-espionage film canon.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "Boring movie. I like the tense feeling the film creates, but there wasn't much dialogue and the characters weren't deep. It was definitely not a memorable movie.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "Le Samouraï is not a masterpiece because of its no-nonsense, economical, and stylish construction, all traits that can ultimately be found in any dimestore noir; it's a masterpiece because of its underlying sadness, its portrayal of quiet pain, and its commitment to calculated anxiety.\n\nAlain Delon is perfect for this role, beautiful and mysterious and capable of communicating silent desperation with just intense stares and moments of silence, an unknowable and yet entirely universal embodiment of a human being cut off from human emotion. The bird in Jef's apartment serves as a security measure, but it also keeps him from killing himself, a physical presence that upsets his meticulous routines. Like the world of the film itself, he is not passionate, cool and calculating out of necessity but hopeless and depressed and without purpose beyond duty. When the world turns against him, he gives in without hesitation, and the tragedy of his ultimate demise is remarkable, succinct, and poignant in a way that makes Le Samouraï one of the absolutely best of its genre and of its medium as a whole.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "yes!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "Hard to believe a film like this made traction in the revolutionary world of cinema circa-1967...but, yet here it is in all of it's minimalist glory. Jean-Pierre Melville \"Father of the French New Wave\" and director of 1967's Le Samourai wrote and directed this film, which stars Alain Delon as a hit man with the soul of a Ronin, Francois Perier as the lead detective, Nathalie Delon (wife of the actor) as an prostitute alibi, and model-turned-actress Caty Rosier as a reluctant witness. Melville, a true cineophile, crafted, what is arguably called his masterpiece, Le Samourai from the Hollywood film noir of the 1940s and 1950s. Future audiences of Le Samourai are strongly encouraged to view the Criterion version as it includes very useful extras, such as video interviews with Rui Nogueira, author of Melville on Melville, and Ginette Vincendeau, author of Jean-Pierre Melville: An American in Paris; and archival interviews with Melville and actors Alain Delon, François Périer, Nathalie Delon, and Cathy Rosier. The gangster story presented in the film is a potent vehicle for Melville to tell his story of lone-wolf masculinity clashing with a modern society who doesn't know how to handle it. Also, watch for the very thin strands of black humor throughout. Delon plays the title role ritualistic and stoic and fits Melville's style perfectly making Le Samourai the actor's crown jewel in a lifetime of film. At 105 minutes, the film feels longer, not because it is dull, but that it is so light on dialogue it feels like the end may come at any time; this deliberate minimalist approach may prove frustrating to some viewers. Recommended for students and lovers of 1960s in film, French New Wave, and foreign cinema in general.",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "As hitmen go, this one is clearly not very good as you'll see, although I think that we are still meant to think that he's a super-cool pro. Yes the film looks good and isn't boring but the ending still has me scratching my head now.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "Alain Delon has had it.  It's 1967, he's sitting on the hot seat of France's famed movie series, Monsieur Cinéma, and he's promoting Le Samouraï.  \"We have the great pleasure of welcoming Alain Delon to our show,\" the host says, looking in his guest's direction.  \"Alain Delon is in the spotlight because 'Le Samouraï' is opening this week.\" But the ambiance doesn't feel like a respected Inside the Actors Studio precursor; it feels more like a talk show, and Delon isn't in a good mood.  He's been better known for his looks than his talents for his entire career.  He's proud of the work he has done in acclaimed works like Purple Noon and The Leopard, but he finds himself taken less seriously than he'd like to be simply because he resembles a suave Dolce & Gabbana model.  The Male Bardot, they call him.  \n But he's 32.  He doesn't want to be labeled as a pretty boy who somehow gets enviable parts any longer.  So instead of saying thank you to his host's polite but slightly condescending introduction, he elaborates on the date of the film's opening. \"It's this Wednesday.\" he smirks.  Aware of his guest's snarky mood, the host tries to pick himself back up.  \"The posters are all over Paris, and they're very striking.  'Le Samouraï', in big, black letters.\"\n \"Red.\" Delon interrupts before his interviewer can even say \"letters.\" He's seen it all before: the host who actually knows nothing about the film but pretends to love it, the host who puts on a grin in order to appease disinterested viewers.  Maybe he would have let this fly in the past, but Le Samouraï is far too important to him.  He believes it to be a turning point in his undermined career.  This isn't just some fluffy movie audiences hear about on a television program like it's Dean Martin's newest vehicle; this is \"a work of art,\" he puts it.  \"A true auteur film in every aspect.\"\n He goes on to discuss the ins-and-outs of the film with the watchful eye of an obsessed movie buff, and it's unlike anything we've seen Delon do before, personally or professionally.  He's always been the confident kid that whisks by with a hint of danger, an exotic woman by his side.  This image, along with the entire introduction of this review, may or may not be dramatized speculation on my part, but when I picture Delon, I picture him as the guy from L'Eclisse, fiendishly charismatic but in a tug-of-war between boyhood and the idea of an adulthood in which being taken seriously is everything.\n Jean-Pierre Melville uses Delon in a way most directors would be afraid to attempt. Before, Delon's charm was his selling point, but in Le Samouraï, his allure is snatched from him.  Melville takes away any ounce of precious dialogue in favor of a more nuanced approach, forcing Delon to embody a particularly cryptic character mostly through body language.  In the past, actors in gangster films have been able to mangle the script and somehow spike their delivery to sound more menacing than usual.  But Delon has to do something even harder, having to exude invincibility all the while keeping an icy exterior.  People turn towards scenery-chewing performances when thinking about characterizations that \"moved\" them; in contrast Delon has done something masterful with subtlety, undoubtedly more impressive than the booming Shakespearian actors that began to creep out during the 1960s.\n He portrays Jef Costello, a hitman who secludes himself in stark landscapes in order to wash away any hint of an emotion.  Famously, the film opens in a darkly lit apartment, completely silent except for a bird chirping every few seconds.  Cigarette smoke dangles in the atmosphere while Costello liess on his bed, looking out his window with reflection.  As Melville holds this shot for several uncomfortable minutes, the character is developed before we are even given the chance to hear his name. Whether he's a comedian or a Liza Minnelli impersonator or an assassin, we're witnessing an individual so drenched in solitude that the idea of loneliness may not even occur to them.\n We see Costello go through his daily rituals, putting on his trench coat and fedora with strange precision, keying a car to get some extra loot, later pulling a job at a nightclub.  Throughout the film, he doesn't show the slightest smidgen of a feeling.  Is he numb? In denial? Truthfully, it doesn't matter.  Though the storyline sees his normally smooth routine being interrupted by an investigation, he doesn't seem worried about the government closing in on his every move.  He is so far into a life of crime that dying for his cause doesn't seem all that bad.\n This is probably why the film is called Le Samouraï, as the samurais in all those Asian epics were more than willing to lose their lives in order to appease their reputations and their peers.  Unlike Melville's earlier projects, Le Samouraï doesn't have the same blatant criminal romanticism.  It's slick and crystalline, yes, but every frame carries enough tension to suggest that Dolph Lundgren might come out of the shadows and Machine Gun Kelly everyone to death. A tragic ending is a given.  Silence is cherished in the film; along with Delon's moodless characterization, the facsimile of scenic solitude is furthered.  The greyed-out style, Melville's intricate direction, and, of course, Delon's performance, work together with astonishing virtuosity.\n         The only complaint I ever find myself having with Melville films is how untouchable they are.  They feel miles apart from us, detached, so stylish that we grow to be more appreciative than adoring.  But there is no denying how great a filmmaker Melville is. \"He's the greatest director I've had the good fortune, pleasure, and honor to work with up to this point.\" Delon dryly gushes later on in the Monsieur Cinéma interview. It sounds dramatic, but sometimes, melodrama can be true.  Melville is not just a guy with a dream; he's a visionary, a poet of style.",
            "review_date": "2015-03-26",
            "source": "rt"
        },
        {
            "content": "A man so cool he can't be bothered to finish spelling his own name, (or even speak in the first 10 minutes of the movie),  hit man Jef Costello is hunted by enemies and friends alike, and he doesn't have any friends. Le Samourai is the figurehead of Melville's career, the story a lone assassin whose rigid code is undone by the unforeseen arrival of love. It's a stalwart theme now, but no film has done it so sparely and tragically. Costello lives by the strict code of the Bushido, thinks deeply, chain-smokes cigarettes and wears a hat indoors. He is, in short, le samourai, the ultimate antihero in Jean-Pierre Melville's existential crime thriller. Thanks to Alain Delon's career-best turn and Melville's noose-tight plotting, he's a true icon of cinema. John Woo owes his career to this.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "?????? ???? ?? ????? ??? ??? ?? ?????",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "a masterpiece, a very iconic role indeed for Alain Delon",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "A flawless stroke of filmmaking, Le Samourai is a superbly crafted picture that is captivating from the first frame, and doesn't let up. What stand out about the film are the terrific and superb performances, its striking visual appeal, which enhances the film's melancholic mood and of course the effective direction from filmmaker Jean-Pierre Melville, who crafts something that is quite unique. I heavily recommend the film to any fan of fine cinema, and Le Samourai is such a film, a picture that both brutal and exquisite. The film has film noir styling's which enhances the film significantly. The cast doe a fine job in their respective roles, and the film's story is simple, yet effective enough to keep you involved from start to finish. This is a well crafted picture and one that stands as a classic of cinema. Simple to the point storytelling with a fine cast of talented actors elevate the film significantly, and in turn Le Samourai succeeds at grabbing your attention from start to finish. The film is steadily paced to build up the tension, and it adds much more anxiety in the viewer, therefore you simply cannot tear yourself away because you want to see what will happen next. I heavily recommend the film, and as a fine piece of cinema, Actor Alain Delon brings a cold charisma in the lead performance that resonates throughout the film, and he is perfect for the role he plays. Le Samourai has had a significant impact on other pictures, and it's easy to understand why. The simple story of a hitman who poorly thought out his hit is interesting and there are many other ways to make another film around that idea. This film can easily be summarized as a slow burning dramatic thriller, as every scene increases the tension, and that's what makes this film truly standout, along with brilliant performances and skilled direction from a director who managed to create something so good with a simple concept.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "A lackluster ending, but it seems to fit with a film that is all style and no substance.",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "Jean-Pierre Melville's stylish french film noir exudes atmosphere and a whole lotta attitude!",
            "review_date": "2014-06-10",
            "source": "rt"
        },
        {
            "content": "Gripping tale. Jeff's economy of words and sense of style is charming. Every scene/sequence is detailed and easy-paced. Great direction. Must see film.",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "Beloved of \"serious\" film (as opposed to movie) lovers, Le Samourai fails to reward viewers on an emotional or dramatic level. The major interest here is in the cinematography, style, and imagery, while the main character is without much development and cannot really hold our interest. Alain Delon here is reduced to looking beautiful, wearing a trenchcoat, walking up and down stairs, getting in and out of cars, and smoking. No words are spoken until the first 9 minutes of footage have expired. \n\nI'd have to call this overrated and rather pretentious.",
            "review_date": "2014-03-18",
            "source": "rt"
        },
        {
            "content": "Só um realizador com a classe de Jean-Pierre Melville conseguiria transformar um noir francês num filme tão magnificamente nobre como o Samurai do título. Melville nunca precisa de gastar muitas balas para ser um grande senhor dos filmes de acção.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "Excellent film. Just like with Melville's \"Le Cercle Rouge,\" there is a minimal amount of dialogue.  A major influence on John Woo, particularly \"The Killer.\"",
            "review_date": "2014-01-08",
            "source": "rt"
        },
        {
            "content": "When a film is revered as a classic of world cinema by viewers and critics alike, it's only so long before you have to check it out for yourself. In the case of Jean-Pierre Melville's \"Le SamouraÃ¯\", I did just that, and I didn't regret it for minute. It's entirely understandable why this features on my people's lists of favourites.\n\nJef Costello (Alain Delon), is a  hitman who lives alone and has very little human interaction or real relationships. It's the code he lives by in order to remain professional. After completing his contract killing of a nightclub owner, Costello lets his guard down and is witnessed by one of the club's singers. Before he knows it, he's brought in by the police who suspect he's guilty but don't have the evidence to prove it. He's released, but the police are on his trail and so are his employers who now see him as a liability.\n\nAs the film opens we linger on a shot of a small desolate room containing only a birdcage and a bed. At first site, it appears the room is empty until you notice a man lying on the bed, smoking a cigarette and saying nothing. This opening shot alone, sets the tone for what is to come in Jean-Pierre Melville's fastidious and incisive  near masterpiece. Melville wastes no time on backstory or over explaining the plot. He also has an aversion to dialogue but a very high inclination on style and content. What dialogue there is, is short and to the point. Things are as they are, and that's it. Although, this might sound like there's very little substance to be had here, that couldn't be farther from the truth. Despite, Melville's minimalist approach, the film is awash with symbolism and a deep existential core. This is a director that paved the way for French New Wave cinema, but when you look at his work here, you realise he wasn't as flashy as, say, Jean Luc Goddard or as disjunctive as Francois Truffaut. Melville opts more for restraint and meticulous detail. It's here that he's served perfectly in his leading man Alain Delon. Very rarely have I seen an actor do (and say) practically nothing yet remain so magnetic. Delon is absolutely superb and one of cinema's quintessential and most compelling anti-hero's.\n\nDespite the obvious restraint from cast and crew, though, the film's not without it's moments of masterfully crafted tension. An exchange with the police as they try to identify Costello in a line-up is drawn out and quietly suspenseful and a brilliantly constructed chase on the French metro - which has influenced such directors as William Friedkin in \"The French Connection\" or Brian De Palma in \"Carlito's Way\". But again, Melville or Delon never overplay it. The tension is purely built on a sense of realism and grows from their reservation and seemingly stoic approach. When you break \"Le Samourai\" down a little, you'll see the inspiration that it's had on many films since; directors Jim Jarmusch and John Woo have openly declared the effect it had on them and their films \"Ghost Dog: Way of the Samurai\" and \"The Killer\", respectively. Even Quentin Tarantino has claimed it to be his favourite gangster film.\n\nIt's easy to see why this postmodern, art-house, thriller has appealed and influenced so many filmmakers, as Melville manages to seamlessly blend Western crime folklore with the traditions and warrior codes of the East. He gives it that classic noir look and feel that was so prevalent in the American movies of the 30's and 40's and his vision of Paris' underworld (in desaturated colour) echoes that of American noir in his use of nightclubs, enigmatic jazz singers and dark streets and alleyways that reflect an almost war ravaged city.\n\nTarantino himself, is guilty of moulding a generation of crime loving cinema goers who expect gratuitous violence and have a propensity for fast talking mobsters. However, when you look back at the stylish and meditative work of Melville, you realise that in order to capture an audience's attention, you don't have to have Mexican standoff's or be talking about Big Kahuna burgers or getting medieval on people's asses with a pair of pliers and a blowtorch. Simplicity can be just as effective.\n\nMark Walker",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "It ranks up with Melville's best films.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "One lonely handsome hitman who has a lonely bird like him in a cage kept in his shabby apartment",
            "review_date": "2013-12-04",
            "source": "rt"
        },
        {
            "content": "European Neo Noir at it's finest",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "QUE ESTUPENDA PELICULA FRANCESA Y UN GRAN ACTOR ALAIN DELON",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "great film..the potential of this film lies in its simplicity..it shows passion of a man for his profession..the respect for his principles(which he says it as his 'habits') ..and a man who is so detached  from sentiments that he doesn't even give a smile through the whole movie..the only moment we feel he has sentiment's is when he gives a good bye hug to his lover..the movie is completely dependent on the director and his capability and the characters in the film..it does not relay on dialogues...it show how detached this character is from sentiments..he is calm collective and keep's all his thoughts to him self..melville directs the film with such class that it show his control over what he is doing..the 1st long shot of the film is brilliant..its shows the solitude of this character (jeff costello)..he can understand subtle changes in his pet bird , this shows how lonely a man he is..alain delon(jeff) shows his potential  as an actor with his masterful control over his emotions..the narrative is well written..the two women in this movie add to the fact of jeff's detachment from his emotion...this movie is a must watch..",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Ein Abstecher nach Mel-Ville!\n\nMein erster Eindruck von Melville ist ein guter - so viel sei gesagt.\n\nUnd das ist, gelinde gesagt, noch eine Untertreibung. In den Fingerspitzen juckt es mich schon, mehr von diesem tollen französischen Filmemacher zu sehen.\n\nSein Le Samourai ist eine Art Thriller oder auch Gangsterkrimi über einen stillen Attentäter, einen Meister seines Fachs, der eines Nachts nicht hundertprozentig Heil davonkommt, und schlussendlich seine Konsequenzen daraus zieht.\n\nAlain Delon ist Jef Costello, der zum Vorbild für so viele Silent Heroes\" des (amerikanischen) Kinos geworden ist. Wenn immer ein Ryan Gosling als The Driver Fluchtautos fährt ist Delons Geist aus Le Samourai anwesend.\n\nGanz passend zum Protagonisten, vertraut Melville auf die Magie langer Takes und heruntergeschraubter Action innerhalb des Bildkaders. Es geht um Stimmungsaufbau und Komposition, was zu wunderschönen Kamerafahrten und Tracking Shots führt.\n\nUnd umso stiller der Film wird, umso spannender wird es dann auch. Die Showdowns werden durch Melvilles spartanischen Stil nur umso intensiver, und somit gehört Le Samourai zu den fesselndsten Filmen der Filmgeschichte (das äußerte sich auch darin, dass ich obwohl ich todmüde war, einfach nicht fähig und willig war, den Fernseher abzudrehen).\n\nEs sind altbekannte Motive und Formeln, die uns Melville hier auftischt. Alles haben wir schon durch die Mühle des amerikanischen Films gehen sehen. Melville wendete hier eine effektive Entschlackungstherapie an, und präsentiert uns einen schönen und erfolgreichen Film.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Trying to revisit some of Jean-Pierre Melville noir films, yeah I still have a hangover from the \"Le Cercle Rouge\". It's got an odd title but at the end of the film, it does make sense. Now I understand more of noir, it's not just the theme and cinematography, it's also about the loneliness behind all the deviant story. Le Samorai is such a tragedy and proves to be an excellent example of that idea. In terms of story telling, it's all visual, it's very rare than the characters spoke a line and that's what I love about Jean-Pierre Melville. Though some of the scenes are longer than it should be, he could have make it shorter.",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "A stylish, powerful film noir that stands with the best of the American genre. Sparse in its use of dialogue, it follows an assassin setting up an alibi, planning and performing the hit before being betrayed himself. Chases on the Paris Metro, complex police schemes to trap the villain, and above all Delon looking as cool as he ever did.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "\"Fedoras and trench coats. Film noir in cool blues and greens. Le Samourai is the real deal.\" Rui Nogueira feels this is Melville's \"most perfect, purest and noblest film\". If by pure he means minimalist, that's true. This movie is \"haunting and elegantly spare, just right for the kind of hitman who lives in silence, in bare and colorless surroundings, with a lonely caged bird.\"",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "Impecável, e com um fim filho da puta.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Usual Suspects borrowed a few pointers from this one.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "Le Samourai is nothing short of a masterpiece. I can't believe that it took me this long to actually get around seeing this movie- and when it began, I couldn't take my eyes off of it. This is certainly one of the coolest movies I've ever seen. The director, Jean-Pierre Melville, executes every little detail perfectly and so intricately that it hurts. Every little frame adds up to something significant in the movie, and without the intricate framing, the movie wouldn't have quite nearly the same atmosphere. Everything is so perfectly executed, that it demands several viewings, and even then, Melville's amazing direction would still be able to sustain suspense, even though you would know how everything would play out. I wouldn't be surprised if this was an inspiration (in fact, I'm almost certain it is) to many future noir films, with its cold, mostly silent main character, its intricate, cool atmosphere and visuals, and its thoughtful, tense plot. One thing's for sure, however, that this movie is a lot better than many of the noir films of our time. \n\nLe Samourai has an interesting concept. It's about a professional assassin named Jef Costello (Alain Delon) who's hired to kill a nightclub owner by the orders of his boss. As Jef carries out the killing of the nightclub owner successfully, the police begin to investigate the case and rounds up suspects to figure out who the killer was, with Jef being one of them. That's the basic premise, and that's all I'll say because this is a film that's better not knowing much about to enjoy it. The strongest aspect behind the magic of this film is Alain Delon's character as Jef Costello, and he is incredibly cool. Jef is a lone wolf, and is a man of few words. He takes his job professionally and seriously, constantly attempting to conceal himself from the public, and using meticulous methods to carry out his job. He's expressionless and lonely, and always wears a fedora and a coat around. Alain Delon portrays him beautifully and perfectly, and he is a man of solitude here. Although some of his motivations are not revealed to the audience, as well as other plot elements, it's really up to the audience to figure out a few things and tie a few ends. Perhaps he chooses to be alone, or his nature leads to his loneliness- it's unclear, but we know that he's a self-sufficient man that knows how to almost never get caught. Alain Delon is probably the most important part of this film, and without his screen presence, the film would be nowhere near as remarkable, even with all the superb technical aspects and extraordinary narrative. \n\nBeyond Alain Delon, Le Samourai still has tons of depth. The story is very thoughtful and extremely tense and suspenseful, making full use of its concept. Some parts of it are rather ambiguous, which was something I wasn't quite expecting, but I was fine with. In fact, I thought it made the film a little more interesting and showed that the audience doesn't need every detail to have a reasoning behind it. When it comes to the detailing of the film, it is perfect. There are lots of quiet scenes with perfect framing, such as smoke blowing out of a cigarette or Jef Costello slightly turning his hat as he leaves his apartment, and it results in odd, yet incredible interest in the film. There are even some subtle details that don't really add up to anything, but they're fascinating to notice and show Melville's attention to detail clearly. There's minimal dialogue, and it's only spoken when it's necessary, adding an interesting sense of melancholy. The atmosphere is perfect, and it's so good that it's hard to explain it. Aside from the atmosphere and detailing, the supporting cast is great, and two people that come to mind are Cathy Rosier and Francois Perier. I found the relationship between Cathy's character, Valerie, and Jeff Costello to be an interesting and mysterious one, and Francois's role as a police inspector added lots of tensity to the film. I can't forget the soundtrack by Francois de Roubaix either, and it's very memorable, especially the title theme. \n\nLe Samourai is simply an experience that must be seen to be believed. It's an extraordinary film that I probably won't see anything similar to for a while. Everything is so perfectly executed that it hurts. Despite its incredible style and atmosphere that drags you into the film and doesn't let go, Le Samourai manages to go beyond the fedoras and coats and manages to create a thoughtful, very suspenseful story. It's odd to think that Alain Delon's role as a heartless assassin is awesome to watch, but he was such a fascinating character with such style that it's hard not to think he is. I loved every second of this movie, whether it's the opening that sets up the somber tone of the film from the beginning, or if it's the perfect framing of subtle details. Le Samourai is a brilliant noir that begs to be seen again, and I surely will, because personally, I think this is one of those rare films that is so different and brilliant from lots of the others of its genre, that it deserves a lot more attention. Le Samourai is so perfectly made that it's hard not to appreciate it.",
            "review_date": "2013-06-01",
            "source": "rt"
        },
        {
            "content": "Can you describe your impression to this film?\n\nYes,but I dunno how to describe it.It's, pure Masterpiece,Le Samouraï,I must said.We are having 105 minutes suspends journey with the cold and lonely man,Jeff Costello.A gorgeous direction in every minutes of the sequence and one of the best opening scene.Plus,some delicious appetizer like Costume,dialogs and acting.I will forever pinned those to my mind.\n\nLooking for some good foreign films?Check-this out,it's a \"MUST\".Hope you don't say 'No' like Jan Lagrange.\n\n\"Thank You\"",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "Le Samourai is one of the most engaging films that I have seen in a long time. Alain Delon plays his character beautifully, the scenery is beautiful the story is thrilling. What can is say? It is a must see!",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "One of the very best films I've seen. There is no lonelier existence than that of the samurai. Minimalist masterpiece.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Jean-Pierre Melville's 1967 film LE SAMOURAÏ is the story of a hired assassin who slips up on a hit and his race against time to set things right. Jef Costello (Alain Delon) is given a contract to kill a nightclub owner, but on the way out he is seen by the club's pianist (Cathy Rosier) and then gets himself picked up in a police sweep. He finds himself pursued by both a cunning detective (François Périer) and by his disappointed employers. As the film progresses, Costello manages to elude both threats while remaining true to his bushido-like code of honour.\n\nThe strongest aspect of LE SAMOURAÏ, I feel, is Alain Delon's performance. Beginning with an utterly stoic mien and confidence, Costello gradually loses his cool over the course of the film, and Delon skillfully depicts this subtle collapse. Melville's direction is remarkable for its ability to sustain suspense (even across multiple viewings, when one already knows how it will go down), and it's curious how the audience is led to sympathy for this man who is basically a cold-blooded murderer. We are even denied a back story that might serve as an apology for his profession. Instead, Costello is just a robotic killing machine, but the film makes us feel concern for him nonetheless. There is also memorable soundtrack by François de Roubaix, an early example of electronic music.\n\nSome aspects of the policework are presented in a clunky or unbelievable fashion (the detective has memorized every building in Paris, seriously?), so I cannot rate this as a flawless masterpiece. But still, it's a good film, and part of the basic education of a cinephile: LE SAMOURAÏ has proved vastly influential in the decades since its release, and those who have seen more recent films like Jim Jarmusch's GHOST DOG or Michael Mann's COLLATERAL will recognize various aspects of those to be hommages to Melville's classic. LE SAMOURAÏ, in turn, looks back like many French films of this time to American film noir, as well as to the then-recent French New Wave which Melville was a seminal figure in.",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "Thoughtful and tense, with a wonderfully cold and calculated performance from Alain Delon, 'Le Samourai' is another Melville classic.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Excellent movie. I loved it. I can't believe it took me so long to watch this movie. Anyone who loves noir should definitely check this out. Le Samourai has an awesome soundtrack. Has some excellent writing. (Few words as possible) Great tension. I loved the bird in the cage while the cops were bugging his place. I loved how the shoot outs played out. Just with a slight trick of the camera you always made the wrong assumption on who is getting shot. Great stuff. Really fun. Also great soundtrack. Great concept. Great execution.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "A monotone, humorless, but thoroughly gripping crime thriller, Le Samourai is an ambitious, European crime thriller about a hitman getting away with murder.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Euro-noir at it's finest?",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "If you want to study the works of master director Jean Pierre Mellville,then this is his crowning glory a European noir with an icy spare quality which lingers long after you view the film.\nAlain Delon is superb as Jef Costello a Burberry mac and Fedora waering hitman who lives in a bare apartment with just a bird for company and packs of Gauloises and bottles of Mineral water on top of his empty wardrobe.\nCostello is a contract killer who has no friends and keeps everything at arms length until his latest contract goes awry when a beautiful female pianist,see's him leave the secne of his latest crime.\nThe police are convinced they have the right man but the girl refuses to identify him leading to police resorting to desperate maesures to track down Costello.\nOn top of the police Costello has to content with his employers who want him dead for fouling up and will use any methods to track him down.\n\nThe film works because Melville takes the classic Film Noir cliches and distills them down to there bare bones allowing image rather than reams of dialogue tell the story.\nIts easy to see why directors have paid tribute to Mellville including Walter Hill with his 1978 classic The Driver and John Woo with his demented homage The Killer.\nThe film is astounding and if you want to know why Mellville still matters then catch this classic .",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "I have been waiting a while to see this movie and I don't think it disappointed me. Alain Delon was really just so damn cool in this movie. The soundtrack, lighting and plot are all very similar to that of an old Hollywood film noir, but with just more cool layered on top of it. Might be too slow for some people but I thought it was an enjoyable stylistic ride.",
            "review_date": "2012-12-17",
            "source": "rt"
        }
    ]
}