{
    "title": "Ed Wood",
    "rating": 7.2,
    "release_date": "1994-09-28",
    "genre": [
        "Biography",
        "Drama",
        "Comedy"
    ],
    "summary": "Portrait of a young man (Depp) trying to claw his way up into Hollywood from the bottom.",
    "critic_reviews": [
        "A comedy of the ridiculous in which the ridiculous turns unexpectedly sublime.",
        "What Burton has made is a film which celebrates Wood more than it mocks him, and which celebrates, too, the zany spirit of 1950s exploitation films - in which a great title, a has-been star and a lurid ad campaign were enough to get bookings for some of the oddest films ever made.",
        "Making a movie about the life of Ed Wood certainly qualifies as an impossible dream, but Burton has pulled it off with wit, imagination and something amazingly close to grace.",
        "The strangest biographical film ever made is also one of the most charming, melancholy and quirkily humorous films of the year.",
        "Always engaging to watch and often dazzling in its imagination and technique, picture is also a bit distended, and lacking in weight at its center.",
        "Delightful, off-the-wall, and ultimately moving.",
        "The most interesting personality in Ed Wood is not the title character, but Bela Lugosi. So covered up with makeup that he's barely recognizable, Martin Landau gives a deeply-felt performance -- a eerie and stunning recreation of a man haunted by lost fame.",
        "Burton has evoked the surface of Ed Wood's life, but in a story about a man who loves angora and frilly panties, he has barely unbuttoned Wood's uniform.",
        "If, like the filmmakers, you're willing to settle for a myth that flatters your sensibilities and shortchanges the past, you're likely to find some agreeable kicks here.",
        "A cinematic homage as flawed as its subject. Flawed, yet with a peculiar fascination of its own -- what we have is a genuine artist paying sincere tribute to an unapologetic mediocrity, and stooping awkwardly to the task."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Amazing film! The real-life story of cult director Ed Wood will make you laugh,cry and entertain you in the best way possible. Definitely, Tim Burton's best movie ever.",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Burton at his best, not surprise that almost 20 years after the release, he hasn't topped this. Perfect portrayal of Wood's not so desired turn of events during his career, to accomplish that without feeling sorry for the character, butBurton at his best, not surprise that almost 20 years after the release, he hasn't topped this. Perfect portrayal of Wood's not so desired turn of events during his career, to accomplish that without feeling sorry for the character, but rather to find certain motivations to believe in and defend one's passions, both entertains and leaves an extra of moral conclusions for the watchers.",
            "review_date": "2012-04-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tim Burton's best film, without the slightest hint of doubt. Every performance, every joke, every set; just about everything in this movie was perfect. It's so good, that I consider it one of my personal favorites.",
            "review_date": "2011-01-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow, I just watched this again after several years (2007). The first time I just smiled or chuckled, this time I was ROTFLMAO. I rented Plan 9 as well and watched it *before* watching Ed Wood - it made all the difference in the world! The Wow, I just watched this again after several years (2007). The first time I just smiled or chuckled, this time I was ROTFLMAO. I rented Plan 9 as well and watched it *before* watching Ed Wood - it made all the difference in the world! The one thing I had to keep saying to myself while watching Plan 9 was, \"This guy was dead serious! This isn't a movie parody!\" Watching Ed Wood gave me a psuedo-peek behind the camera so to speak. I recommend it to anyone; it is a very entertaining film, but greatly enhanced if you watch Wood's film(s) beforehand. I can't wait to get my hand's on Glen or Glenda and Bride of the Monster. \"Pull the string! Pull the string!\"",
            "review_date": "2007-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Tim Burton's film on the worst filmmaker Ed Wood is brilliant as well as Johnny Depp's performance is energetic, charming along with a script that's funny, ambitious and damn smart. Depp couldn't be perfect for the role. This film is aTim Burton's film on the worst filmmaker Ed Wood is brilliant as well as Johnny Depp's performance is energetic, charming along with a script that's funny, ambitious and damn smart. Depp couldn't be perfect for the role. This film is a masterpiece, so let's talk about this movie. Johnny Depp plays filmmaker Ed Wood who's known as the worst director, it's set in his best-known period in 50's when he made 'Glenn or Glenda' (1953), Bride of The Monster (1959) it also focuses on his transvestism and friendship with the great yet aging and unemployed star Bella Lugosi (played by Martin Landau). 5 out of 5 stars",
            "review_date": "2016-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ed Wood is a strangely uncharismatic bio-pic from Burton and Depp. It has some nice photography, some decent performances and great period design but I felt myself drift off into boredom during the final third.",
            "review_date": "2012-10-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic movie. Never bores you. And the best performances are given by Martin landau as Lugosi and Johnny Depp as Wood. Also Bill Murray is hilarious. This film should have been a hit. But it is sad. You feel pity for the characters in Fantastic movie. Never bores you. And the best performances are given by Martin landau as Lugosi and Johnny Depp as Wood. Also Bill Murray is hilarious. This film should have been a hit. But it is sad. You feel pity for the characters in this movie--mainly for Lugosi as Landau performs him fantastically.",
            "review_date": "2006-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Johnny Depp shines in his role as the infamous quirky film director trying to hit it big with grade-Z movies. As absurd as it is brilliant, this definitely ranks as one of Tim Burton's finer films.",
            "review_date": "2010-08-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Funny, entertaining and not your typical Tim Burton movie. It follows Ed Wood, Hollywood's most famous (or maybe infamous) director for making terrible movies such as Plan 9 From Outer Space. It's a quirky film and in a way it immortalizes EdFunny, entertaining and not your typical Tim Burton movie. It follows Ed Wood, Hollywood's most famous (or maybe infamous) director for making terrible movies such as Plan 9 From Outer Space. It's a quirky film and in a way it immortalizes Ed Wood in endearing way. All and all it's a pretty great film and certainly worth a watch.",
            "review_date": "2013-12-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ed Wood is a Tim Burton film, through and through. Odd, unique, and truly off-the-wall, Ed Wood is a sympathetic, funny, and depressing biopic on the delusional and deeply troubled director of the same name. An at times tragic picture, TimEd Wood is a Tim Burton film, through and through. Odd, unique, and truly off-the-wall, Ed Wood is a sympathetic, funny, and depressing biopic on the delusional and deeply troubled director of the same name. An at times tragic picture, Tim Burton lovingly crafts this biopic that shows influence from Wood's odd and indiosyncratic \"style\". The film is just as odd and truly all over the place as I imagine his films were and it just feels right. The film can feel a bit distant, but that said, it does paint a good picture of Wood and is incredibly sympathetic towards his delusion and while it is a comedy at times, the film can be pure drama and tragedy as you watch him fail. Ed Wood is a very funny film at times with some seriously laugh out loud moments and the film does a good job balancing this with drama and Wood's story. Johnny Depp also just happens to be brilliant as Wood, both in light and dark moments. Overall, Tim Burton's weirdo biopic on this weirdo man is a gem.",
            "review_date": "2016-07-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The one he'll be remembered for. Excellent!!! Dramatic, romantic, funny, exciting!!!! Watch this movie!!! The best movie of Tim and one of the best of Depp!!",
            "review_date": "2013-11-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Johnny Depp gives a great characterization of Ed Wood as this cheerful, upbeat, persevering guy that you root for more than you laugh (or cringe) at. The filmmaking and storytelling are well-done, but make no particular impression. Watch EdJohnny Depp gives a great characterization of Ed Wood as this cheerful, upbeat, persevering guy that you root for more than you laugh (or cringe) at. The filmmaking and storytelling are well-done, but make no particular impression. Watch Ed Wood mainly for the acting of Johnny Depp and Martin Landau.",
            "review_date": "2015-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of the best films from the 90's and one of my absolute favourites, Tim Burton's simultaneous loving and mocking tribute to the infamous ‘worst director of all time', Edward D. Wood Jr. (nicknamed Ed Wood), is chock full ofOne of the best films from the 90's and one of my absolute favourites, Tim Burton's simultaneous loving and mocking tribute to the infamous ‘worst director of all time', Edward D. Wood Jr. (nicknamed Ed Wood), is chock full of ticklish/ghoulish visuals, marvellous acting (with Johnny Depp and especially Martin Landau as the two leads), and some of Danny Elfman's best composition work.",
            "review_date": "2021-08-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Both the best Tim Burton and Johnny Depp movies of all time. It's in my top 20, undoubtably.",
            "review_date": "2005-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Quite simply, one of the great movies of our generation. Rife with great humor and idiosyncrasy, Ed wood is the perfect homage to the eponymous director and anyone whoever chased a dream.",
            "review_date": "2020-07-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ed Wood is clearly a very personal film for Tim Burton. He's obviously got great affection for the director widely dubbed \"the worst of all time\", and through this affection, Burton promotes sympathy in us as well. Johnny Depp is a compellingEd Wood is clearly a very personal film for Tim Burton. He's obviously got great affection for the director widely dubbed \"the worst of all time\", and through this affection, Burton promotes sympathy in us as well. Johnny Depp is a compelling protagonist, making Wood's personality quirks amusing, but never to the point of parody. We are rooting for this Tinseltown underdog throughout the film, and desperately want him to succeed. Bill Murray is also good cast completely against type, as Wood's flamboyantly gay friend Bunny Breckinridge, who is seeking sex reassingnment. The real highlight of the film though is Martin Landau, who is simply perfect as a bitter, sweary, drug-addicted elderly Bela Lugosi. Less impressive is Sarah Jessica Parker playing Ed's girlfriend Dolores Fuller. I've never really seen the appeal of SJP, and her performance as Dolores does nothing to convert me - she over-acts at times, and is wooden at others, in short, she's extremely inconsistent. While Edward D. Wood, Jr.'s story is a relatively engaging and lively ride (helped a great deal by Scott Alexander and Larry Karaszewski's entertaining script), I can't help but feel that a story more geared towards the elderly Bela Lugosi character would have made for a far more interesting film. Once you've gotten beyond Wood's ineptitude as a filmmaker, his used-car-salesman-style dialogues with prospective film backers and his tendency to walk on set in a skirt and high-heels, his potential as a dramatically  resonating main character is limited. The scenes dealing with Lugosi and his tragic later years are the best in the film, and could have been expanded to a full-length human tragedy. That said, Ed Wood is never dull, on the contrary, Tim Burton's love-letter to the critically-despised, yet cult favourite director of Plan 9 from Outer Space is, for the most part, well-acted, well-written, funny and engaging. It's an exceedingly worthy biopic of a rather fascinating little man.",
            "review_date": "2012-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This has to be one of Tim Burton's best. This whole film was very well produced. Tim Burton's dark humor keeps me laughing and a little disturbed at times. Getting to the actual review, this is a biopic about a real life film director thatThis has to be one of Tim Burton's best. This whole film was very well produced. Tim Burton's dark humor keeps me laughing and a little disturbed at times. Getting to the actual review, this is a biopic about a real life film director that has been named the worst director in cinematic history. His name is Ed Wood.(that's why they called the film Ed Wood). Although this was filmed in 1994 it's in black and white. But the color isn't what makes a film good and anyone that saids otherwise needs help. This film features a much younger Johnny Depp so I would recommend this to mostly females. The acting was very good. The writing was also good especially the one liners. There where so many funny one liners that if you talked you missed them. Although being a comedy this film is also quite serious. Especially the relationship between Ed Wood and Bela Lugosi. Towards the end it was very touching and depressing. If you like this movie then you might also want to check out Ed Wood movies like Plan 9 from Outer Space and The Bride of the Monster.",
            "review_date": "2011-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Entertaining, well written,and excellently directed and performed! Overall a good movie. It is not the best movie film out there but in its genre I would say it is a solid 8!  This film shows that complexity is not a pre-requisite to have aEntertaining, well written,and excellently directed and performed! Overall a good movie. It is not the best movie film out there but in its genre I would say it is a solid 8!  This film shows that complexity is not a pre-requisite to have a great movie, great movies can be simple too :)",
            "review_date": "2014-09-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Let's just get something straight, this is not a biopic. This is a comedy first and foremost. This film chronicles the first few years of the film making career of Edward D. Wood Jr albeit quite loosely. It is very well acted, and very funny.Let's just get something straight, this is not a biopic. This is a comedy first and foremost. This film chronicles the first few years of the film making career of Edward D. Wood Jr albeit quite loosely. It is very well acted, and very funny. Johnny Depp does a fantastic job at playing Ed in that he sympathetic, but we can still laugh at him. I really loved the music in the film too, it was very unique and fit the mood of the film very well. What I really liked was how if you knew anything about Ed Wood, or had seen some of of his films, you'd catch little jokes that people who didn't know about Ed Wood wouldn't. Great film, and one of my all time favorites.",
            "review_date": "2012-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ed Wood impresses with a good cast (though it can get confusing with the many speaking parts it exhibits) but is a film that leads into nowhere. Obviously, Burton reveres Wood in some strange way, but he can't (or just doesn't) stop thisEd Wood impresses with a good cast (though it can get confusing with the many speaking parts it exhibits) but is a film that leads into nowhere. Obviously, Burton reveres Wood in some strange way, but he can't (or just doesn't) stop this biography of drifting off into a boring tale of a strange transvestite. A 80 minute flick would've told everything that needed to be told. But besides the protrecting, Ed Wood is an interesting as well as odd story and you can have a nice time with it.",
            "review_date": "2013-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ed Wood jr is my Tommy Wiseau and Plan 9 is my The Room. This brilliant well made movie that both respects and makes fun of him who makes movies that nobody would do.",
            "review_date": "2018-07-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis movie may be one of those gems that are usually buried beneath other gems; gems that everyone are already accustomed to, but ever so rarely look for variety. You don't need me to tell you that this film is an homage to the now deceased Edward D. Wood Jr, and also that this isn't based off entirely true facts. Such things like Bela Logosi never swore so much, and other tiny details. With that said, I Don't entirely care if they don't get some facts right; unless of course they're drastic, but I say that what they didn't put in or whatever made this movie purely magnificent. By far one of the greatest tellings of a filmmaker ever. Never before have I felt so much sympathy for an actual bad director, mostly I would despise them. Here though you get an amazing performance by Johnny Depp playing Ed Wood. He's so energetic, such a swell guy making awful pieces of crap. You just ask yourself: How can I hate a person when they're such a nice and likeable? This movie is just a joy to watch, I was just so enthralled with every minute of the film. It's almost perfect; almost, the actors are good, the story is very interesting, and it can really get to sometimes. Like I said in how it gets to you I mean that it's not only funny, but actually very touching. Scenes of what we don't see in real life finally on the big screen, really makes one think of what do actors go through when in the film business. My ending statement: This movie is a excellent picture that should be viewed by everyone.",
            "review_date": "2013-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow! Tim Burton made a movie that is actually somewhat normal and does not feature Helena Bonham Carter! (Although it does feature his partner at the time, Lisa Marie, but who's counting). Ed Wood is a funny, outstanding achievement. This isWow! Tim Burton made a movie that is actually somewhat normal and does not feature Helena Bonham Carter! (Although it does feature his partner at the time, Lisa Marie, but who's counting). Ed Wood is a funny, outstanding achievement. This is Depp and Burton at both their bests. Johnny portrays infamously bad director Ed Wood almost perfect here, but it is Martin Landau as Bela Lugosi that stands out. He's got the man down, accent and everything, to a tee. Additionally, the set pieces, seemingly random storylines, and excellent casting make for a guilty pleasure movie that is many notches above any Edward D. Wood, Jr. picture.",
            "review_date": "2014-12-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nLeave it to Tim Burton to make a tribute to the art of filmmaking through a biopic on a person who is generally considered one of the worst directors to ever make films, Ed Wood. The fifties sci-fi and horror film director who basically have been called everything from the most incompetent filmmaker of all time to an oblivious avant-gardist and misunderstood poet. The story starts with Edward D. Wood Jr as a struggling young screenwriter and director who is having trouble to find a studio willing to finance his first picture, when a film about the controversial topic of sex change comes to his attention. Ed desperately tries to convince the producer that he is the best man for the job on the grounds that he's a cross-dresser, but is rejected. Later that same day Ed has a run in and forms a friendship with the out of work acting legend, Bela Lugosi, a former horror-star with a severe morphine addiction. He returns to the studio and offers to get them Lugosi for their sex change film if he's allowed to direct and filming of the first, Edward Wood Jr, film Glen or Glenda begins.\r Ed Wood is a very rare film in many ways and not the average type of character study. It only depicts the rise, if you might call it that and not really any fall or many downs. Ed wood as a character is dealt with in a very comedic and lighthearted fashion making it the ultimate feel-good film. The fascinating friendship between Ed and Lugosi take as big a part of the story as the career of Ed and the two characters are brought to life through incredible performances from Johnny Depp and Martin Landau. The supporting cast is a solid bunch consisting of Sarah Jessica Parker, Patricia Arquette, Jeffrey Jones, George Steele, Max Casella, Brent Hinkley and Bill Murray. Costuming and makeup are both perfectly done to resemble the fifties and the film is shot in very atmospheric black and white intended to mirror Ed Wood's own films. Tim Burton probably decided to direct this film out of true admiration for the cult-filmmakers passion and loyalty to his vision, which really sets the tone for the entire film and sends the message that even the most popular filmmakers today have something to learn from this small time director of cheap b-movies.",
            "review_date": "2014-09-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This biopic on \"the worst director of all time\" Ed Wood Jnr is utterly brilliant from start to finish. From its exhilarating beginning, helped by Howard Shore's brilliant score and Jeffrey Jones's delightful turn as Criswell, it completelyThis biopic on \"the worst director of all time\" Ed Wood Jnr is utterly brilliant from start to finish. From its exhilarating beginning, helped by Howard Shore's brilliant score and Jeffrey Jones's delightful turn as Criswell, it completely gripped me. For me it isn't only one of Burton's better movies, but also one of the better movies of 1994. Tim Burton's works are admittedly strange and offbeat, and while people mayn't like that, I do. And that is why I loved this film, it was funny, it was touching, it was strange(well sort of) and it was offbeat. It is gorgeously shot, with black and white photography that is really a marvel to the eyes, and Burton lovingly directs. The script is funny and poignant, and the restoration of Wood's productions are astonishing. It was even nice to see Plan 9 From Outer Space, I know that critics cite it as the worst movie ever made, but there are other people who consider it as a \"so bad it's good\" movie, the way I have heard people talk about the film, whether they love or hate it, is quite fascinating. And the performances are brilliant; Johnny Depp is amazing as Ed Wood, portraying him as an optimist and an \"anguished cross-dresser\", and Martin Landau is absolutely superb as Bela Lugosi. Sarah Jessica Parker and Patricia Arquette are alluring and convincing as Delores and Kathy, and as Bunny Bill Murray does well even if Bunny could've been developed a little more. Overall, gripping, funny, touching and brilliant. 10/10 Bethany Cox",
            "review_date": "2022-03-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "put a wig on him..Ed Wood\n\nThere are few laughs here and there drawn out from witty lines and amusing characters despite of resonating a lot to the practicality of the nature. A smart adaptation by Scott and Larry from Rudolph Grey's bookput a wig on him..Ed WoodThere are few laughs here and there drawn out from witty lines and amusing characters despite of resonating a lot to the practicality of the nature. A smart adaptation by Scott and Larry from Rudolph Grey's book is not only funny but edited perfectly too. Tim Burton as always excels in execution but this one was quite exciting to encounter since this wasn't one of his sketchy created world that he normally walks on. Ed Wood works great on terms of craft that one can explore into but it also offers the audience very little to hold onto on terms of entertainment.",
            "review_date": "2018-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "wonderful! i didnt expect the relationship between ed wood and bela lugosi to be so touching. a perfect contrast to the more uplifting and comedic scenes. so many memorable lines and great actors. it makes you want to watch the whole ed woodwonderful! i didnt expect the relationship between ed wood and bela lugosi to be so touching. a perfect contrast to the more uplifting and comedic scenes. so many memorable lines and great actors. it makes you want to watch the whole ed wood catalog! a fine homage to filmmaking and a different era.",
            "review_date": "2021-03-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film is a satisfying and fascinating film ... ed wood, who was often known as the worst director, in this film, in a simple and entertaining way, the story of her life is shown.",
            "review_date": "2022-03-10",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 39
}