{
    "rating": 8.8,
    "release_date": "1973-12-05",
    "num_reviews": 210,
    "genres": [
        "Crime",
        "Drama",
        "Biography"
    ],
    "summary": "Frank Serpico (Al Pacino) is an idealistic New York City cop who refuses to take bribes, unlike the rest of the force. His actions get Frank shunned by the other officers, and often placed in dangerous situations by his partners. When his superiors ignore Frank's accusations of corruption, he decides to go public with the allegations. Although this causes the Knapp Commission to investigate his claims, Frank has also placed a target on himself. The film is based on a true story.",
    "reviews": [
        {
            "content": "Classic Pacino. Direction is great too. I just noticed that this cop changes his outfit all the time and a bit overly bohemian look, though I don't know if this is also based on true story.",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an interesting story (a true story at that), an insightful film about a sombre issue - police corruption. Pacino gives a great performance as the titular character. He's quite a quirky character, somewhat outspoken and dramatic at times but not always. There are some lower key scenes but that helps to build the overall picture I guess - it's not a constant action film, though certainly some scenes are somewhat reminiscent of the 'Dirty Harry' films, so I thought. A decent film, I'd recommend this, yes.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm watching it again , for the umpteenth time, because it's cinematic gold. Why can't the movie houses do this anymore ?",
            "review_date": "2022-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is pretty classic Sidney Lumet. The guy knew how to do drama; from the use of tone and building tension, to when and how to break up that tension with quieter, more subtle moments that both recreates the ebb and flow of real daily life and allows for the building of relationships and character development.\nSerpico is a great character. This is a man who truly stands out among the generic meatheads and your typical conservative cop. There is no by-the-book appearance or standard interests with this guy. Reading about (and seeing) ballet, listening to opera, dressing in village attire; all this and more make up a man who also is defiantly unbudging in his insistence of being a 'clean cop' in a city rampant with dirty ones. \nI liked both actors who played his love interests in the film, Sharpe and Eda-Young. Roberts give his usual good performance. We also see some long time character actors like John Randolph, Biff McGwire, Allan Rich, and even a came by the great M. Emmett Walsh.\nThe film did drag at times with me. I felt there were a couple of scenes that were redundant as the point was made already about the pervasiveness of the corruption as well as how extremely difficult it would be to prove. But it's a solid fact-based drama about a man of unquestionable integrity, courage, and unique personality who would not be moved. 3.8 stars",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino is Frank Serpico, New York cop who is seemingly the only cop in the city who isn't on the take which immediately makes him a little untrustworthy among his peers. When he finally decides to do something about it, his life will never be the same again.  Based on the true story, this is a pretty riveting story with a star making performance from Pacino.  Directed by Sidney Lumet.",
            "review_date": "2022-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time I heard a Serpico reference was probably during Knocked Up and in relation to Martin Starr's beard, a reference that turned out to be not too far off. In all seriousness, while this was a well made film with a story definitely worth telling, but it sadly never felt as interesting from a narrative standpoint in 2022 as I would suspect it did in 1973.\n\nI really dig Sidney Lumet's style from what I have seen so far and in Serpico he creates a grimy, raw, and stripped back feel that works perfectly in a film portraying the seedier aspects of 1970s NYC.\n\nAl Pacino plays the titular role so intensely, bringing a level of manic energy that was definitely able to create some anxiety in me too. I would have actually liked to have seen more of Frank Serpico before and after the events of this film and even after spending over two hours with him, still felt like he was somewhat underdeveloped. 7.5/10\n\nNYT 1000: #264",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Conspicuous narration, rigorous acting especially by Al Pacino, punctilious character development, and tremendous directing by Sidney Lumet.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never saw this old movie until just now.  Especially since it's based on a true story, this flick is pretty amazing.  Sadly, cops continue to be looking out for one another, rather than doing the right thing.",
            "review_date": "2021-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent script, decent atmosphere. This is a beautiful example of the \"New Hollywood\" cinema. The acting is amazing and the visuals are splendid.",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NYPD Officer Frank Serpico graduates from the police academy, and he becomes frustrated with his fellow officers' laxness. On patrol, he confronts three men raping a woman and apprehends one of the assailants. When the suspect is beaten during interrogation, Serpico declines to participate. He later persuades the suspect to give up the others. Serpico breaks protocol to arrest the suspect himself, but is coerced not to take credit. He is then assigned to the Bureau of Criminal Investigation. He moves to Greenwich Village and begins dating Leslie, a woman in his Spanish class. For his appearance, interests and a misunderstanding in the men's bathroom, he is accused of being homosexual. Serpico clarifies the situation to Captain McLain, and he requests a transfer. At his new precinct, Serpico works in plain clothes. While chasing a burglar, he is nearly shot when other officers fail to recognize him. Serpico later befriends Bob Blair, who has been assigned to the Mayor's Office of Investigations. Meanwhile, Leslie leaves Serpico to marry another man in Texas. Serpico is offered a bribe and informs Blair, who arranges a meeting with a high-ranking investigator. He is told that he must either testify or \"forget it\". He turns the bribe over to his sergeant. Serpico then requests a transfer, and begins recording his phone calls. At the time, he begins a romance with his neighbor, Laurie. He is reassigned to the 7th Division, but he immediately discovers corruption. Forced to accompany fellow plainclothes officers as they perpetrate violence, extortion, and collect payoffs, he refuses to accept his share of the money. He informs McLain, who assures him that the police commissioner wants him to continue gathering evidence, and that he will be contacted by the chief's office. Serpico becomes impatient waiting for the promised contact, fearing for his life. Serpico and Blair go to the mayor's assistant, who promises a real investigation and support. Their efforts are stymied by political pressure, and Serpico dismisses Blair's suggestion to go to other officials or the press...\n\nThe New York Times felt that the film was \"galvanizing\" for Pacino's performance, and by the \"tremendous intensity\" of Lumet's direction. The publication considered the film at the same time \"disquieting\" for its use of fictional names, as the reviewer felt that it diminished the role of Durk. Meanwhile, it called Theodorakis' soundtrack \"redundant and dumb\". The New York Daily News delivered a favorable review of the film. It rated it four stars out of five, and called it \"a triumph of intelligence, compassion and style\". A follow-up critic by the publication deemed Pacino's acting a \"masterful performance\", as the reviewer remarked \"he walks like a cop. He talks like a cop. He even seems to think as a cop\". The review also praised Lumet and his \"talent for achieving social realism\". The Record considered it \"one of the finest films of the year\". While it felt that the portrayal of Serpico was \"too righteous and obsessive\", the review favored Pacino, but felt that his performance was \"sometimes a little too intense\". It praised the photography of New York City as authentic, and credited Ornitz and Allen's work for it. The Village Voice wrote a mixed review. It criticized the focus of the film on Serpico, and the minor role the screenplay writers gave to the character that represented Durk. The reviewer considered that Serpico was \"worth seeing\" for Pacino's performance. Variety deemed Pacino's acting \"outstanding\", and Lumet's a combination of \"gritty action and thought-provoking comment\". For Newhouse News Services it was an \"exciting movie\", but the review remarked that it was \"weakened\" by its focus on Serpico. The news agency attributed the minimization of the other characters to avoid \"possible lawsuits\". The Los Angeles Times acclaimed Serpico. Charles Champlin called Pacino \"one of the handful of genuine star actors in American films\". Salt and Wexler's screenplay was hailed as \"almost documentary reality\", and its treatment of the main character \"a complex and evolving portrait\". The reviewer also remarked that the romances and break-ups were presented with \"unhackneyed honesty\". The contributions of the supporting cast were well noted. Champlin felt that Allen's work was considered to be \"high on the list\" for an Academy Award nomination and deemed Theodorakis' music \"effective\"\n\nGreat performance from Al Pacino in this Sydney Lumet film based on a true story with the focus on police corruption in the NYPD. It´s a gritty and a not too beautiful look upon the NYPD in the early 70s. I personally think that Al Pacino´s role interpretation of the character overshadows the rest of the film and with the slowpaced storyline that creates an unbalance in the film. The backdrop of New York in the 70s is however a great framing for \"Serpico\". Upon its release, Serpico became a critical and commercial success. At the same time, the film drew criticism from police officers. It received nominations for the Academy Awards and BAFTA Awards. Pacino earned the Golden Globe Award for Best Actor – Motion Picture Drama, while Salt and Wexler received the Writers Guild of America Award for Best Adapted Screenplay.",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "arguably Pacino's best work. they don't make em like they used to.",
            "review_date": "2021-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great to see Al Pacino delivering a wonderful performance in a well-built police movie.",
            "review_date": "2021-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Al Pacino's greatest; also ten times as good as Dog Day Afternoon",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gives a very unstereotypical view of a cop-he's a loner at odds with the force, disrespecting the thin blue line, kind of hippie-ish at times. The movie illustrates the costs of going so far against the grain.",
            "review_date": "2021-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a 1973 biographical-crime film directed by Sidney Lumet 👮‍♀️ \n\nMeh, it passed the time. \nJust. 😐\n👍🏼👎🏼\n\nMANY OF HIS FELLOW OFFICERS CONSIDERED HIM THE MOST DANGEROUS MAN ALIVE –\n AN HONEST COP.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico has been on my to watch list since forever and I finally made the time to check it out. Al Pacino was at the height of his career when he was teaming with Lumet and Serpico is probably one of my favourite for Pacino. The film rests on his shoulders and he has to carry most of the movie without any heavy support. Serpico mightn't be the grand film about corrupt policemen but it's a tense couple of hours and Lumet ensures there's no shortage of character development. I'm a little annoyed I never watched more of Sidney Lumet growing up as he is kind of the guy behind these police corruption drama films. I can't recommend this film enough. 13/12/2020",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's shows us that every one is the criminal, but anybody has he's own gauge!",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney Lumet's Serpico stars Al Pacino as a New York City cop trying to rid the department of widespread bribery, an accepted practice within the force.  The film may be a bit heavy-handed in the early stages as Lumet's portrayal of corruption and bad cops is laid on pretty thick.  Upon joining the force, Serpico is almost immediately exposed to free lunches, a partner ignoring a rape call, and the severe beating of a suspect.  Once the corruption is established, however, the film slips into a nice groove and is propelled by yet another electric performance from Pacino.  The film is gritty and honest and captures the New York vibe as only Lumet can.",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-made corruption film that benefits greatly from its production being so near to the events in question, and consistently taking advantage of the grimy urban sprawl of New York to reinforce the atmosphere. Despite including many individual scenes indicating the danger that Serpico faces by doggedly pursuing his moral crusade, the film never really establishes the 'danger around every corner' air that could have elevated the film even further, despite the titular character fluttering between increasingly dangerous assignments (American Gangster comes to mind). A solid early Pacino performance, even if the romantic elements designed to flesh out the narrative feel a bit out of place and not really justified. (4/5)",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino's performance is the movie.  Unfortunately, that is all there is to the movie.  First, it is way too long, which leads to a stumbling, disjointed sequence of quick events jammed in without regard for pacing or fluidity.  It's as if there was a checklist of events that \"had\" to be depicted, so they are sprinkled in among long scenes of Pacino sitting alone, standing alone, walking alone and relationship problems.  The movie suffers from a severe lack of focus that is a detriment to any social commentary the movie may have been desiring to achieve.",
            "review_date": "2020-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong cop film with a great central performance.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is in the same vein of Touch of Evil or The French Connection.\n\nSidney Lumet's crime drama Serpico (1973) is a profoundly relevant film about real life police officer Frank Serpico's crusade to end police corruption and systematic bribery by the disgustingly lazy NYPD. Serpico is a hero to truth, justice, and decency, who fought for us all and he got nothing for it. Police are still taking bribes, breaking the law, covering up each other's corruption, and silencing any brave officers willing to speak out to the public and proper authorities. \n\nFurthermore, the vile police forces in America work for themselves to protect themselves and line their own pockets and Lumet's visionary direction demonstrates exactly how the police commit these heinous crimes and get away with them with help from every department of law enforcement in every city. Lumet goes full neo-noir where death is around every corner and hateful eyes pry into Serpico's work everyday. Serpico is a must watch cop drama that feels more important than ever with the police roaming the streets to silence and brutalize protestors of their illegal police brutality.\n\nPeter Maas' incredible novel details how Serpico conducted his investigation into police corruption in New York from within the NYPD's departments at great risk to his own life, career, and reputation. Waldo Salt and Norman Wexler's script bring his struggle to life with sympathetic perspective and realistic dialogue that vents his frustrations and fears in gripping honesty. Serpico is so sincere in its viewpoint that you cannot help but root for this lone courageous voice wielding nothing but badge.\n\nDede Allen's editing is slick with hard cuts in and around Serpico's life for a riveting and engaging 130 minute epic of investigative detective work. Arthur J. Ornitz' cinematography has classic 1970's wide shots of New York's garbage riddled streets, but it's his striking close-ups that hit the hardest in Serpico. Mikis Theodorakis' score is full of beautiful Italian and Greek themes that enshroud Serpico in a protective grace to cover all the ugly crimes committed by cops and lowlifes around him. Anna Hill Johnstone's clever costumes are the secondary star of Serpico as Al Pacino has a new getup in every scene. It's fun watching Pacino dress up as a hippie or a rabbi.\n\nAl Pacino is the real draw here as the fiery and persistent Officer Frank Serpico. Pacino portrays him as just and steadfast with an understandable temper at the frustrating lack of help or cooperation from local authorities. Pacino depicts a hero cop just trying to do the right thing in a wrong system. Everyone protects the bad cops instead of turning them in because all cops are bad. Pacino demonstrates how Serpico is the lone dissenter to endless slews of police corruption.\n\nI like the supporting cast in Serpico too. There is a wonderful bounty of excellent supporting actors and actresses. Biff McGuire is great as the Captain Inspector McClain who is hellbent on slowing down Serpico's investigation through the guise of an ally. M. Emmet Walsh cameos as the corrupt city official Gallagher. F. Murray Abraham cameos as Detective Partner that allows Serpico to go in alone during a drug raid in a chilling sequence.\n\nIn short, Serpico is one of those landmark pictures of total directorial control from Sidney Lumet with a compelling character of Frank Serpico and a commanding lead actor in Al Pacino.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The more things change, the more they stay the same . . . . \ni've seen cops in North Carolina do some \nof what we've seen here; \npoliticians pretend the PRoblems are just \nsomewhere else and \nslander & threaten witnesses. \nGood cops are still afraid of bad cops, \nand the PRoblems still Lie \nin top management . . .",
            "review_date": "2020-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Indisputably one of the best Al Pacino performances, giving a real joy through the entire film.",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is so inspiring to see a film about a police officer who fights against the corruption in the system without getting his own hands dirty. I’ve seen films and TV shows about undercover officers who want to bring down the bad cops, but they always have to become one to make that happen. Invariably this makes the character less likable to me, and inevitably part of the plot revolves around them sinking too far and being tempted by the money or drugs that come with being dirty. Then along comes Frank Serpico who puts his life on the line every single day because he makes it clear that he won’t play their game. It makes for an amazing underdog story, as it seems virtually every cop is against him, and spends their time trying to invent ways to get him fired or killed. When I saw in the closing credits that this was based on a real man, I instantly wanted to know more because I loved the character of Serpico so much. While others relish watching more films about gangsters, I can’t get enough of the stories about the “boy scouts” who want to bring down a crooked system. This might be my favorite performance from Al Pacino, because he has that toughness that this man needed in order to survive, but added something more to it. He plays those moments when people are asking him to break the law with the perfect indignant looks. He makes it clear that, not only is he not going to do it, but he can’t even comprehend why someone would think of doing such a thing. All of the supporting cast is brilliant, and it was fun spotting all the familiar faces of these dedicated character actors who would continue to pop up in movies for years to come. If there was any one aspect of Serpico that didn’t work for me it would be the romantic relationship stuff. I understand that this is useful for building up the main character, and it’s also the only way they were able to get some females into this film, but it didn’t add enough to the story for me. Aside from giving Frank someone to vent to without threat of retaliation, it was a handful of unnecessary scenes. But that was such a small complaint in what was otherwise an amazing film. I’m a sucker for any David & Goliath story, and Serpico’s story is so engaging that I want to research it further (and watch this movie again.)",
            "review_date": "2020-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino is awesome as usual. Solid film through and through.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid crime drama thanks to superb performances and gritty direction, but suffers when you do further research on the real life story.  Al Pacino gives one of his best performances as Frank Serpico, an NYPD cop who tries to be honest in a corrupt system, despite his own eccentric behavior that makes him stick out.  He does an excellent job showing Serpico had his own problems, from womanizer to refusing to take proper action in some cases when corruption appeared (more than once, he turns a blind eye to it).  Sydney Lumet gives some excellent direction, with his gritty style perfect for this true story.  The one downside is the film doesn't emphasize the number of cops that were on Serpico's side and how some of his superiors did back him (it's telling many characters had their name changed so the movie studio to avoid lawsuits).  Nevertheless, this is still an solid true crime drama on how corruption erupts in police departments, not so much from the corrupt cops themselves but the superior officers who turn a blind eye.  Still worth watching, despite its flaws.",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico's biggest flaw is that we never get to truly understand WHY Serpico is the way he is, WHY he chooses to dismantle police corruption instead of partake in it, and WHY he feels the need to put his life on the line to do so?",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino portrayal of the lone honest cop in the NYPD is one that haunts you, since sadly this is no fairy tale, but the crude embodiment of police corruption in the 70's. Not a few rotten apples, but the norm.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable biopic drama with classic Al Pacino performance",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chameleonic interpretation of Al Pacino is worthy of this true corruption story. A man against the system: if we don't have enough of this stories is because we don't have enough of this people! ",
            "review_date": "2019-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To look at how young Al Pacino is, this is the one I have in mind. Serpico is about an NYPD officer Frank Serpico played by the really young Al Pacino, who went undercover to expose corruption in the police force. It's based on an actual person, Frank Serpico and it's based on an biographical book by Peter Maas. Al Pacino did a really good job portraying Frank Serpico, even the story is faithful to the original material. I would say more about Serpico but I just can't because there's really nothing more to talk about it. It's a brilliant good old biographical crime film.",
            "review_date": "2019-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thrilling and inspiring movie ever made! With the best movie character ever portrayed: Al Pacino as Frank Serpico!",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino looks good with the beard and it certainly evokes a time and place realistically but drags on and often feels aimless, especially concerning his boring love affairs. Does convey Serpico's frustration at trying to find someone to back him and there is some tension later on. A shame none of the other characters are really fleshed out. This is Pacino's show.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a solid movie which features a very important real-life story of an inspirational titular figure well acted by Al Pacino. It's also well shot and with memorable atmosphere to it. But the pacing is so slow and the runtime is too long that the movie ended up being quite uneven and never achieving the much needed immediacy in its tone.",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Off the back of watching the truly excellent Dog Day Afternoon I finally got round to watching a true cinema classic.  What a huge disappointment.  Pacino is solid but overall its a sprawling mess of a story that leaps to many times from year to year. \n\nIt has not stood the test of time very well.",
            "review_date": "2018-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Pacino best preformances",
            "review_date": "2018-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "C-. This movie was slow and desperately needed to be trimmed down. A lot of these scenes were unnecessary or dragged on. What made it worse was how very important facts & details to the movie's plot were left unsaid, maybe only implied, or skipped over too quickly to understand/absorb. You can't do that in a crime movie. What a horribly paced movie.",
            "review_date": "2018-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it just gets dirtier..\n\nSerpico\n\nFocusing the whole feature i.e. of more than 2 hours only on a single character needs content and enough material to feed the audience which they easily provide with gripping screenplay to not let them wander off the screen even for a frame. Sidney Lemut still needs some better work on his execution and editing but that barely factors in here as the adaptation is way too smart and ahead of its time. Al Pacino is literally the heart of it; he beats fast and hard that helps it pumping and keeping the viewers alive for this glorious experience. Serpico breeds power, corruption, rage and politics on screen and successfully delivers it to the audience communicating through stellar performances like never before.",
            "review_date": "2018-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniable classic that surely inspired just about every detective film that followed, Serpico succeeds on masterful direction (it's Lumet, so no surprise there) and a great performance from Pacino; his annoying voice aside. What drags it down, in my opinion, is the length and the unlikability of the protagonist. I don't really understand why he treats the women in his life the way he does, and while the movie doesnt really excuse him for it, it still asks us to root for him.",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can al pacino play a bad role??",
            "review_date": "2017-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way to start out a movie with a bang. Right off the bat it's pretty intense. This is a raw movie. Sidney Lumet is brilliant when it comes to writing. And directing of course. Already from the start, you're interested. You're wanting to know more. What happened? Why did they shoot him? Who shot him? \n\nThe music is great. It really paints a picture and compliments whatever is on screen. Here's someone who is out to actually do good and not be a useless piece of shit like some cops. It's cool to see how he's unraveling how the police department actually works. Here's a cop who's understandable and has his head on right. \n\nFucking phenomenal acting, even from the smaller parts like the girl was getting raped. Good humor and a good amount of New York wit. \n\nThis movie rolls along so smoothly, that it's extremely easy to watch. That's supreme writing right there. I'm really digging Al Pacino's style in this movie, it's groovy. It must be hard trying to do good and be a humane person when your surrounded by schmucks and people who play dirty and do things for money, but Serpico, that's another story. He's got his head on right. It's pretty insane to see the situation he puts himself in. \n\nIt's amazing how the use of different camera angles can define a certain scene. A camera over the shoulder looking down, the camera obscurely showing something. Fucking fantastic movie! He chose Switzerland as the country to get away. No better country.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With an incredible central performance by Al Pacino as Serpico, this crime drama is elevated above what would of been a solid film to a great one. It is also has an enthralling plot filled with tension and paranoia, a well written script, great score and it looks great in the grimey and gritty New York that we have seen before in many a film from this period.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Legendary director Sidney Lumet pairing up with legendary actor Al Pacino automatically establishes grand expectations for the movie Serpico.  Both manage to carry their weight in this true story about one man's crusade to expose widespread corruption within the NYPD, and yet in many ways the film lacks the sort of visceral impact that their future collaboration delivers in Dog Day Afternoon.\n\nParts of the movie feel campy, while the portrayal of corrupt cops could have been written with an emphasis towards subtly and nuance.  \n\nPerhaps this is just being nitpicky.  But at a time when these two gentlemen were making other films such as The Godfather, Network, and the aforementioned Dog Day Afternoon, all of a sudden Serpico feels a bit more second-rate.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film about the paranoia involved in doing the right thing",
            "review_date": "2016-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I totally agree with what a friend of mine wrote: more interesting for understanding the historical period than for the film in itself. And I also haven't appreciated that much.",
            "review_date": "2016-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very good, but he needs to intervene more deeply in the main character so be aware of where you came all this courage and the Secretariat in this work next to the neglect of some of the roles of assistance is received and used to appear sporadically could benefit from dramatically .., Overall directed by Sidney Lumet it was distinctive and Pacino's performance was fantastic where he was able embodiment role was superbly deserve the Oscar nomination",
            "review_date": "2016-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a very well made Sidney Lumet film, which brings the best out of Pacino and Lumet partnership. This one and Dogs Day Out are my favorite Al Pacino film (post Godfather) which you will recognize him as one of the best gems Hollywood can offer. He's really my favorite actor of all time no doubt about it. And Serpico proves he's the one. For a true story this is a very well made film with a very good writing. I felt bad for the guy being surrounded by narco politics, cops and their selfish agendas driven with corruption, it's just disgusting. This guy has a high morale standard for a supposed to be gold plated policeman. And yet all the gambles he does comes out for nothing. Sad story is, we still live by it. Corrupt officials every single day. Great character driven story. I felt bad for the character and I care, which is what I'm looking for a film. A great classic definitely a must have. Al Pacino's performance is outmatch in the 70s.",
            "review_date": "2016-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One scene shows a large dilapidated block in Brooklyn overlooking the twin towers. .. Epic.",
            "review_date": "2016-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Struggle against corruption might be real yet in Serpico the struggle and frustration never feels real.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney Lumet crafts an enthralling depiction of police corruption in the 70's that is highly elevated by a powerhouse performance from Al Pacino.",
            "review_date": "2016-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "impressive performance by Al Pacino!",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A career defining performance from Al Pacino that although Godfather made him known it was Serpico that cemented him as a star.\n\nPacino plays Frank Serpico an unusual honest cop in a sea of corruption in the NYPD. It chronicles his intense battle against despite the rising tension from other police officers.\n\nPacino was truly electrifying & owned the screen & truly one of our greatest screen actors. This film is gritty, truthful & honest....a fantastic real life crime thriller, Sidney Lumet directed a wonderful film.",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever!",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1970's NYC,  Cops collecting money on the side and one scruffy looking man breaking the system. The best part? Serpico's ever changing hats! Brilliant!",
            "review_date": "2016-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This true story about an honest New York police officer burdened by the corruption around him is gritty and inspiring and boasts an excellent performance from Al Pacino.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Raw and Real. Thank you Frank Serpico",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Pacino's best...Serpico was a stand up cop",
            "review_date": "2015-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino plays real-life New York policeman Frank Serpico, who exposed the corruption in the NYPD, only to have his fellow cops turn on him.  A tour-de-force performance by the great Pacino, who certainly should have won an oscar for this movie.  With Tony Roberts.",
            "review_date": "2015-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was sick! slow, sometimes, but worth it. a true tragedy and sad and dark. Frank is a cop who goes alone against corruption. really raw. nothing special by way of cinematography or style.",
            "review_date": "2015-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Addressing corruption in NYC nypd. 1001 movies to see before you die.",
            "review_date": "2015-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe it's taken me 42 years to watch this film for the first time. Just brilliant.",
            "review_date": "2015-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It probably was edgy back in the day and the fact that is a \"true story\" makes it more interesting. I got into it and Pacino is very good, you can see his same moves and mannerisms coming through though, which is fun to try and spot when he slips into that cartoon of himself he has become, or always was I think. Lots of people pop up that are still around today acting, also fun to try and spot. I liked it.",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Giving us one of Al Pacino's best performances, Serpico brims with the frustration and anger of its protagonist, ripping open NYPD corruption like a bag of chips. Most of the characters in the movie don't matter; they are meshed together into one big, sleazy, corrupt, blob. This was Lumet's intention, as only Serpico, his friend Blair, and his colleague Green are given individual attention. No matter what he does, Serpico seems to find more corruption, and he increasingly becomes angrier until he finally snaps. The pivotal scene after getting back from the mayor's office is the best and most important part of the movie by far, where Pacino really shows his true colors as an actor, and Serpico shows his true anger. A classic like this will remain timeless, especially with all the symbolism and raw emotion it possesses.",
            "review_date": "2015-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dreary, depressing, cynical",
            "review_date": "2015-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "-IGNORE THIS \"OUT OF FIVE\" RATING\n4/4\nPhenomenal film about a good hearted cop trying to go straight while everyone else around him is crooked. Al Pacino's performance is a tour de force, as is Sidney Lumet's direction, capturing the perfect amount of tension when it seems the most logical. Not a false note in characterization or dialogue.",
            "review_date": "2015-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "82%\nSaw this on 28/7/15\nAl Pacino gives a stellar and committed performance in yet another film that is an immediate adaptation of real life story in 1973, which like the many other films of it's kind like All the President's Men lack a punch because of mainly flaws in screenplay and not being able to shed enough light into the fascinating events. Serpico has a lot of gripping scenes, much thanks to Pacino and Sidney Lumet, but on the whole it fails to deliver at points that are quintessential.",
            "review_date": "2015-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a decent film. It is about an honest New York cop who blew the whistle on rampant corruption in the force only to have his comrades turn against him. Al Pacino and John Randolph give good performances. The screenplay is a little slow in places. Sidney Lumet did an alright job directing this movie. I liked this motion picture because of the drama and mystery.",
            "review_date": "2015-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty but a bit slow-moving with Al Pacino in one of his best roles. Good 70s film despite a lack of significantly developed secondary characters.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling police drama, based on the memoirs of the titular retired cop, chronicling an honest and brave law enforcer's long and lonely mission to bring down corruption in the force. It also features a feisty performance by a very young Al Pacino in his first star vehicle.",
            "review_date": "2015-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decently long drama, a biopic on NYPD cop Frank Serpico before the formation of Internal Affairs divisions in police departments. \n\nAs always Pacino does a splendid job selling his character, and presents a believable presentation of the real life man to the screen. Pacino plays him clear and concise, in dealing with the rediculing and real threat of his peers.\n\nThis along with Dirty Harry are police drama classics, although this movie has a bit longer running time. The pacing is a bit slower than modern day crime thrillers. \n\nNever the less, I feel that this film is still applicable to today's standards, and presents a good portrayal of what it was like before there was any committee to investigate police above them.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haven't seen this movie in soooo long,  still a great movie",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie might as well be called Pacino, because that is all the viewer sees for the better part of 2 hours.  Al Pacino is captivating in his performance as the title character and displays the embodiment of a man's inner struggle for doing what's right when everything around him wants him to be wrong.  While the supporting cast leaves much to be desired (a dynamic that actually hurts the importance of the main conflict of the film) this film is an easy watch and certainly does not feel it's 129 minutes in length.  A good film, not a great film, but a good, entertaining film that is straightforward, and pulls no punches.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love watching Pacino play explosive roles. This one is up there with Scarface and Dog Day Afternoon. His performance turns this average story about a good cop being pressured by corruption into a 5 star classic.",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot of Serpico is based around a true story dealing with corruption, bribes and kick-backs within the NYPD which far from being a few isolated instances seems to have been the norm at least in the 70's. The whole sleazy structure is threatened by Frank Serpico who as an uncorrupted cop finds himself shunned by his venal colleagues and marginalized by the very organization he works for for threatening their nefarious activities and illicit cash flows.\n\nSerpico takes a bullet during a drugs bust which almost finishes him, but rather than assist a fellow officer his colleagues leave him to die a slow painful death yet miraculously for him he survives, much to the undoubted chagrin of the department. In breaking the unwritten code of silence and complicity in their corrupt activities Serpico made himself a target, a figure of derision even outright hostility, one they would have preferred to quietly disappear.  \n\nIt ably makes the point that unaccountable authority corrupts absolutely, blurring the distinction between criminal and law enforcement, the so called good guys turning out to be equally rotten as those they're supposed to be investigating. Themes that still resonate today. Pacino gives one of his finest stand-out performances here and literally carries this film single-handed, quite an achievement. A certified classic of 70's cinema.",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected more. Left me pretty unsatisfied",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boo-ya! This man's life is about making the right decision!",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Pacino film but not great. I know Serpico is regarded as one of the all time best movies of Al Pacino's career, but I could never really get into it as much as his other movies like The Godfather Part 1&2 or Heat, but for Pacino fans this is a definite must see as Pacino really gives a solid performance as the real life New York cop Frank Serpico who wouldn't take money no matter what.",
            "review_date": "2015-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty look at 60s early 70s NYPD and the corruption run rampant.....Pacino at the top of his game.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a good movie but not a great movie. It well made and interesting but its also a bit slow at times and very long at that. It was like a made for TV Al Pacino movie. Its not a patch on the Godfather, Dog Day Afternoon anyway but its well worth watching but I wouldnt ever watch it again.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story, really worth telling on a movie. Al Pacino is perfect, and the movie has good rhythm.",
            "review_date": "2014-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Collection of vignettes on the life of an actual NYC cop covering about 6 years of his career. Many of the supporting cast's characters are never really developed. Still, it is quite engrossing.",
            "review_date": "2014-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We wash our own laundry around here.\n\nSerpico was a police officer who wanted nothing more than to be an honest detective for the people: unfortunately, every branch on the New York City police department seemed to have corrupt operations from the top down.  There didn't seem to be any place in New York for an honest cop.  Serpico becomes obsessed with stopping crime...by bring down the police force.\n\n\"You look like an asshole with dentures.\"\n\nSidney Lumet, director of 12 Angry Men, The Wiz, Dog Day Afternoon, Before the Devil Knows Your Dead, Network, The Verdict, Power, and All the King's Men, delivers Serpico.  The storyline for this film was very well done and a fantastic character piece.  The script was so well written and the film contains numerous twists and turns.  The acting was also first rate and the cast include Al Pacino, Tony Roberts, John Randle, Allan Rich, and Cornelia Sharpe. \n\n\"Do you like cops?\"\n\"You're the first one.\"\n\nSerpico was a movie I have wanted to see forever and was excited to find it on Netflix (to be honest, I thought I had already seen it).  This quickly jumped up there with Scarface as amongst my favorite Pacino movies (I'm honestly not sure which one I like better).  I thought this film was absolutely awesome and perfectly delivered.  This movie definitely has some great action but the acting is over-the-top good.  I strongly recommend seeing this picture and it is worth adding to your DVD collection.\n\n\"Drop your cocks and grab your socks!\"\n\nGrade: A+",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Call me crazy by this film didn't do it for me. Pacino is decent but his character never has rhyme or reason the film itself has zero tone and the pace is gruelingly slow.",
            "review_date": "2014-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great lead up, but the resolution is a bit like falling off a cliff.",
            "review_date": "2014-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story of an innocent cop benefits from Sidney Lumet's excellent direction and Al Pacino's powerful performance.",
            "review_date": "2014-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 1973, in his post-Godfather movie, Al Pacino carries a badge as police detective Frank Serpico, of the New York Police Department. The story centres around the life of Serpico from his time in the police department, in the B.C.I to his much larger and active involvement in the Seventh Division. It also focuses heavily on how affected he is by police corruption and the strain it puts on him and his relationship with his girlfriend. \nPacino delivers a splendid performance as always, and his portrayal of Serpico arouses a lot of questions as he is a unique and strange character, rarely seen in anything else. \nDespite an undoubtedly good performance from Pacino, 'Serpico' goes down the road of clichés when there's hardly any interesting characters to approve of, due to an excessive lacking of character development. Most of the characters are just there to act hostile towards Serpico himself, whom is a very strange cop, who acts against police corruption and the assaulting of criminals within the department. I guess that's a decent way to put it (who would disagree?), but it becomes clichéd and boring, and the only real attention is the fine peformance of Pacino - and even the story becomes a bit confusing to follow, due to all of this, but it's a fact-based movie about 'A man's story within the New York Police Department.' It's not the worst, but near enough one of the best.",
            "review_date": "2014-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a solid detective story based on a true story about corruption within a New York police department, and the only moral officer that had the courage to expose it.  There's no doubt that Al Pacino carried this entire movie with his believable and convincing lead, but in my opinion that made everything around him, characters and even story, pale in comparison.  A few scenes felt irrelevant to the story and the pace slowed down a little too much for my taste at times, but Serpico is nonetheless worth seeing for Pacino's performance alone.",
            "review_date": "2014-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still relevant and engaging fourty years later.",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From what I have seen of Pacino. It's one of his hard hitting characters and probably the most fashionable one as well. Have to re-watch Scarface now. \nSerpico is a pure Classic.",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"There was a king, In his kingdom there was a well. One day an witch poisoned the well. The next day everyone in the kingdom drank water from the well except the king. All got mad. All gathered and said the king is insane and that they should overthrow the king. The next day the king drank the water. The people got happy seeing that the king is sane too.\"\n\nA wonderful movie.",
            "review_date": "2014-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film has enough talent to tell the story, but it lacks passion or concern about the issues at hand.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first fifty minutes drags on for quite a while, seemingly directionless. Though after that mark once that plot swings into motion, Serpico becomes a very engaging film featuring one of Al Pacino's best performances.",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent cop drama and an amazing display of acting by Al Pacino; this film is a must watch for any fan of Cop Dramas just don't expect the same kind of cinematography used in today's blockbusters !!!",
            "review_date": "2014-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic performance from Pacino,and brilliant direction are the I ingredients of this 70's classic. A story if one man's struggle against corruption, and the chaos he caused. A genuine classic.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before The Godfather it was serpico which changed Al pacino's carrier. Top notch performance by him. Storyline was sublime, it is among my favorite cop movies.",
            "review_date": "2014-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still Powerful but showing it's age",
            "review_date": "2014-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With their second collaboration in 1974, Al Pacino and Sidney Lumet delivered one of the very best films of the decade with \"Dog Day Afternoon\". It was a taut and captivating true-life story of a bank robber that gets way in over his head. Two years previously, though, they worked on another true-life story from the opposite side of the law. This time it was NYPD officer Frank Serpico and how he got way in over his head with police corruption rife all around him.\n\n1960's New York: Frank Serpico is a cop who refuses to extort the local criminals and take pay-off's even though all his colleagues seem to be in on it. As a result, nobody trusts or wants to work him and Serpico begins to realise that his life is in danger by the very people who have sworn to protect and serve. Time and time again, he refuses to go on the take, hoping that an investigation will be launched into the conduct of his numerous partners but knows that it will take his own involvement or testimony to make a difference.\n\nAfter a frantic opening where Serpico is rushed to hospital bleeding from a gunshot wound to the face, Lumet slows events down and goes back to where it all began. We witness his recruitment to the police department and his ideological approach to the job. It's slow to start and spends a bit too much time on Sepico's home life when really all you want is for the police corruption angle to move along. That being said, when things do start to get going, the film improves as it progresses. \n\nRevered as one the finest films of the 70's and for it's time, that's completely understandable as police corruption drama's were not as commonplace as they are now. However, it now looks dated and time hasn't been all that kind to it. Arthur J. Ornitz's cinematography is observant enough to utilise the New York locations to excellent effect which lend the film a suitably grim and realistic tone but some scenes are far too dark to fully make out what's actually going on. For the most part, Lumet's handling of the material is strong and he's in no rush to relate this biopic. Although this is commendable, his pacing is slightly misjudged leaving you with feelings of lethargy and an overlong running time. Added to which - with the obvious exception of Serpico - there really isn't any other character that gets attention in Waldo Salt and Norman Wexler's screenplay. The support are all two-dimensional and some of the acting on show is very questionable, indeed. It even wastes the talents of great character actors like M. Emmett Walsh and F. Murray Abraham in thankless bit-parts. The most glaring flaw, however, is Greek composer Mikis Theodakaris' ridiculously overused and misplaced music score. It's feels random, tonally different and bears heavily on particular scenes that it brings nothing of value to. It even plays over the dialogue which can be difficult to hear and results in the film feeling cheap.\n\nNow, this sounds like a lot of flaws for a film that's held in such high regard but they do happen to be there and wouldn't be looked upon kindly by a contemporary audience. That aside, though, there is still much to recommend the film. It builds tension with ease and has numerous standalone scenes that are of a very high quality and the denouement is, simply, a work of genius. \n\nUltimately, it's a vehicle for Pacino and, unsurprisingly, he delivers an explosive central performance. It's one of his most iconic and his commitment to the role actually raises the film beyond a particular standard. \"The Godfather\" may have been the film that made his name but it's his performance here that cemented it. He not only echoes the reservation of Michael Corleone but also displays moments of frustration and rage that allow him to grandstand in the way that only Al knows how.\n\nMuch like the refusal of Frank Serpico to go on the take, I refuse to fall into line with the particular posse of critics who see no fault in this film.\nI honestly thought I'd be handing out top marks for a film I was very fond of in the past but I wouldn't be being honest if I did. That's not to say that it doesn't have quality in there too, though. Age may not have been kind but you can't put a time on a top class performance.\n\nMark Walker",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico doesn't quite hit the mark Dog Day afternoon had, Lumet is much less stylistic and visually intriguing here and the script spends much time showing corruption but failing to expose it or cause any real peak of dramatic intensity. The film is a roller coaster ride, serving up many sharp turns and small hills, but the big thrill just never quite hapens.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 70's period when Pacino was in his prime time of making his classic films.\nSerpico shows distinctively how corrupt the New York city cops are.\nI'm not talking about the shitty cop movies showing vague blurs of corruptions happening without any proper explanations. Serpico is a real life drama devoting a good 2 hours to showing the insides of corruption filled police departments .Serpico is the life of an honest cop and shows how much one has to give up to stay on as an honest cop.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino is fantastic as a corruption-attacking police officer.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully gritty film with a surprising amount of relevance to today's moral dilemmas, unafraid of showing the consequences of doing the right thing.",
            "review_date": "2014-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this 1973 film in 2014 made it a great period piece of the city I grew up in.  It starts at Greenpoint Hospital, which is the hospital I was born in in 1973.  That made it personally interesting for me, especially since that hospital no longer exists.  \n\nIt was a great story of an honest man in a dishonest system wanting to right the many wrongs all around him while being persecuted by those he is supposed to be able to trust.  It would take a highly individualistic person with a warrior spirit willing to sacrifice a great deal, which is exactly what the character study portrays.  He goes through an ordeal by taking a stand and loses much in this battle against a system that is supposed to have his back.  \n\nReally well done!",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico adds to the legend of Al Pacino by giving him a meaty early role as the offbeat cop who exposes corruption within the system. It is a wonderful character and a wonderful portrayal.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though this movie is old, it still packs a punch.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't find it all that wonderfull",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling action drama by the great Sidney Lumet that features Pacino in one of his trademark roles. He plays the real life cop Frank Serpico who only wishes to be a good cop but comes up against terrible police corruption in the NYPD.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very good film held on the shoulders of Al Pacino who finds here an incredible material to display his extraordinary capacity to enter the skin of his character and become a complete different person, both physically and mentally. Shot by master director Sydney Lumet, this film follows the real life story and career of undercover detective  Paco Serpico as he investigates in the police department for corruption. Pacino delivers one of his finest portrayal and confirms how talented and driven he is. Great film. Excellent story and great performances from the cast.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "unauthodox cop is fed up with corrupt colleagues and is continually foiled in attempts to combat it. suffers alot of boring dialogue which doesnt push story quickky enough",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long-winded and short on solid details.",
            "review_date": "2013-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a young man who sees his dream come true when he became a cop. However, after he finds out and is disgusted by police corruption his practically single handed rise up against him wins him the hate and hostility of his similar. This is the story of a man and his rise against institutions. Another great collaboration between Lumet and Pacino, and once again a great and gripping one that moves at a fast and exciting pace with a gritty feel that gives it depth of realism and an approach that doesn't spare us of the darkest sides of the affair. Pacino's performance is amazing. A tough part to play, he carries a heavy load on his shoulder in playing the story, which is based on true events and a real man, whi great class, intensity and respect. Some may find its fast pace gets a little overwhelming occasionally, yet there is a lot to admire in the film that doesn't sugarcoat its subject and doesn't present in it a patriotic or patriarchal way - which is where an incredible amount of similar American films pitfall.",
            "review_date": "2013-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This and the departed are the best under cover cop movies ever",
            "review_date": "2013-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film by Sidney Lumet. Great action scenes, drama and a stunning performance by Al Pacino. Fans of the genre will enjoy it!",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino in his younger years.  Loved it. Classic movie you must see.  Hate I waited as long but I was three when this came out.",
            "review_date": "2013-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One good cop vs a corrupt police force is the story in this riveting yet slowly-paced gritty crime drama. Pacino is top notch here in the 70s heyday. I prefer that other Lumet staple with Al, but maybe i just can't wrap my head around Pacino as a hero.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely. Everybody should watch this just for Al Pacino's performance alone. Another Oscar nominated, passionate and all round fantastic leading man performance from one of my favourite actors of all time.\n\nSerpico begins with the film's protagonist being escorted to hospital with a gunshot wound to the face and as the police chiefs begin to discuss the ramifications of it being Serpico that was shot and not any other police officer, the audience begins to understand that Serpico isn't just the average cop. It was a brave decision to start the film on this note but it works brilliantly as the audience is aware for the whole film of where Serpico's actions are leading him towards and it makes for gripping viewing as even being at work places his life at risk from those whose motto is to protect and serve.\n\nThe film does look dated, the blood in the first few scenes leaves you in no date as to the film's age, but as a character study and crime drama, Serpico really is a great film that I now consider to be a classic.",
            "review_date": "2013-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty and realistic, anyone with decency can relate to Serpico's plight, and his battle against a corrupt system.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of the moment in 1973, and now looks like a time capsule. Love movies that illuminate a past that I knew nothing about. Pacino is great - and different from other things I've seen him in, especially early career. Engrossing was a pretty good word.",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this movie is graphic in its violence, language and skin, it is still a masterpiece of cinema. Sidney Lumet is a fantastic director who always makes movies of the troubles of society. This movie deals with police brutality and the innocence that is lost in the process. Al Pacino serves a quiet but powerful performance as a cop who believed in the true meaning of law enforcement: honesty. As he watches his co-workers deal unforgiving blows to their victims and deals with the wrath of his bosses, he slowly spirals down into fear of what he is living. A true masterpiece of Lumet.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is based on a true story and stars Al Pacino as real-life New York cop Frank Serpico who lives his life trying to be an honest police policeman but when he is pushed beyond police corruption with life-threatening situations and harassments, he tries to stay away as far away as possible whilst doing his job. When he gets shot in the face with a small bullet and has his face disabled, Frank resigns from his job after being awarded the medal of honor and moves to Switzerland. The film has an old-fashioned, gritty documentary look while the story is told in a biopic crime drama. Now I don't know anything about Frank Serpico's history but based on this, I can tell you that this is historically accurate. This is a movie that deserves to be watched and not missed by any stretch. Serpico gets a 9.7/10.",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino is one of my favourite actors, yet it occurs to me I have seen him in few roles where he is not a villain, such as 88 Minutes, Sea of Love and his magnificent performance in Scent of a Woman. Mostly, he's about being a villain of various proportions from being a mafia boss in The Godfather to being a cartoonish thug in Dick Tracy. But the great thing about Serpico is that Al Pacino portrays a humane character, one who blends in with a crowd as a regular human being. And that may sound easy, but when you're as skilled a man at acting as Al Pacino with such a legacy, it's a difficult thing to achieve, yet he does it though one simple action. There is a scene where Frank Serpico is ordering a sandwich like an ordinary man, and he smiles. He doesn't smile because he knows he's manipulated someone, he smiles because he's happy merely about getting his lunch. Al Pacino transitions into playing a heroic role with gusto by acting humane, and it gets better at a particular scene later on where he moves into a new apartment and purchases a local puppy dog to help out some locals and we learn that he's a character who can make a connection easily. Al Pacino gives an excellent performance in Serpico, and makes it thoroughly compelling.\n\nSerpico is a powerful crime drama and strong biopic since it touches on the complicated and controversial topic of police corruption without resorting to characterising him as a maniacal action hero by having him portrayed on screen through dynamics in which Frank Serpico remains stoic yet threatening merely because of his lack of interest in bending the law for personal gain. It's his disdain for corruption that builds as the character develops through the progressing story which comes from his enemies feeling threatened, which displays a theme of fear from the antagonist at the protagonist in a complicated and conflicting story which is conveyed strongly and directed finely by Sidney Lumet in a collaboration with Al Pacino before the creation of the film deemed his masterpiece, Dog Day Afternoon. \nSerpico is also strongly scripted and features a well crafted musical score, so it's truly a great film despite being inconsistent in its pacing and not taking full advantage of its music to strengthen the atmosphere, as well as being uncertain in answering its questions at times due to the fact that Frank Serpico does not always have the answers. But it doesn't detract much from the fact that Serpico is a strong crime biopic about a real hero with an iconic look which Al Pacino matches well and gives a strong performance to.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie though tried tell the crux of the police corruption saga, does it have the expected entertainment - hope not !",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and true story of a New York cop exposing the corruption in the police department",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every performance like this from Pacino's heyday only highlights to me what a slump he has been on since \"Heat\" (with the exception of \"Angels in America\" and one I feel like I'm forgetting).  He's absolutely magnetic here and his Frank Serpico is such a well-written and likeable character that he easily carries the film.  Some negative reviews have focused on how he never feels like a fully realized cop in the movie, but I think that's kind of the point.  He feels like the odd man out.  He feels like the rookie who went out on his own.  He's the outsider and that's what makes him easy to root for.  Other reviews felt that the movie doesn't go far enough with its central theme, which I find fairly ridiculous (and I also think that time has already been the judge on that).  \"Serpico\" continues to be one of the foremost movies that gets into the psyche and price of what it means to be \"a good cop\" and it's no wonder that Pacino made his name on roles like this one.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino is just brilliant in this film...I could watch it again and again",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The tale of a cop who won't be bribed, we start with the news that Serpico has been shot, and we roll back in time in order to lead up to that dramatic opening scene. For me it was more entertaining to watch Al Pacino gradually morph from a clean shaven new cop to a big hairy gypsy type.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directed by Sidney Lumet (Murder on the Orient Express (1974) Dog Day Afternoon (1975) Network (1976)), this is a true life police drama based on the biography of Frank Serpico written in 1972 by Peter Maas. It's a very gritty and bloody drama, which shows the dark side of police investigations. But it does show nearly every borough of New York City, in all their grimness, but it has a brilliant lead performance. In 1960, Frank Serpico (Al Pacino) joins the New York Police Department, and he showing tenacity as a uniformed policeman on the street, he's promoted being a plainclothes policeman, and it's here that he discovers the dark side of undercover police work, and he see's first hand police corruption going on around the city. From excessive violence being used, to police officers taking drugs and accepting cash bribes. After 10 years on the force, Serpico decides that enough is enough, and that he's going to expose the corruption going on in the New York Police once and for all, but he's threatened by his peers and an attempt is made on his life as well. It's a very good and very gritty film, with Pacino putting in a brilliant lead performance, and his Serpico is a hero you can identify with. Lumet does well with a very small budget, and the result is one of the toughest and rawest films of the 1970's.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "★★★1/2 (out of four)\r\n\r\nAl Pacino plays real life cop Frank Serpico.  He patrols the counterculture lifestyle of Greenwich Village in Manhattan.  He is good at his job, but tries to be an honest cop which sets him apart from his colleagues who outwardly collects bribes and payments for looking the other way.\r\n\r\nHe becomes alienated and harassed when he decides to stand up and blow the whistle on the police corruption in his station.  His rebellion turns very nasty as the other cops target him.\r\n\r\nDirector Sidney Lumet brings a great sense of authenticity to the film and Al Pacino offers a powerhouse of acting.  The story, based on true events, is a great underdog standing up for what is right.\r\n\r\nIt isn't Pacino's greatest work, but it is certainly worth seeing.\r\n\r\n[IMG]http://img.photobucket.com/albums/v48/Zeppo1/Serpico_zpsb61b60bd.jpg[/IMG]",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good. But not Pacino's best.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic, original Pacino,.. before he started just playing, well, Pacino.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a bad film, but it can be boring. Pacino is great and I love how as the more he hates being a cop, the worst of he looks. He starts off clean cut and by the end...well, look at the poster.\n\nIt was kind of lame that it seemed like everyone was on the take. Were the Police every really this bad? I could relate though, as even if every single co-worker is horrible or useless, I too would never fall to the dark side...like Serpico.\n\nI also wish they would've expanded on his love life more. You really don't get to see much more than they left cause he was always this screaming guy about how tainted his force was. I wanted to see more of what happened with them both.\n\nDon't expect a lot of action, as this is really pure drama. But Pacino is so darn good here.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story and performance by Al Pacino...one of his best. Less said, the better as this is a timeless classic and a great watch.",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful biopic that would stand alone perfectly well as just an action drama. It doesn't meet conventions and it's honest and provoking approach makes it a memorable piece. On top of this, Pacino gives a strong and uncompromising performance and Lumet's direction adds a style and warmth within the gritty bravado of NYC.\n\nWhile it's direct approach on the man himself as opposed to an overall view of the issues discussed may seem like a weakness, Pacino's dedication to the role manages to make it a strength. It's from a different time and place but it brings you in to that perfectly and before long it's your world as much as it's Serpico's.\n\nThere is the niggling issue that this film just doesn't go far enough, the tension that is built up so superbly throughout just splashes away in the end as opposed to leaving a bruise but that could have compromised the sense of reality in this film so it's an understandable approach. \n\nCertainly a defining film in the cop-drama genre and a memorable biopic too.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely pointless. It had one thing to say and it took them over two very slow hours to say it.",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting is over-the-top and the story is just okay; I'm rating this film \"four stars\" because Lumet's direction is superb, the cinematography is gorgeous, and I have a fanatical pro-1970s-film bias.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting film, great acting by Pacino, based on a novel, which in turn was based on a true story.",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real Frank Serpico said it all when he claimed that Al Pacino played Serpico better than he did  himself. This is one of the ultimate Pacino movies, one of the ultimate police/crime movies...one of the ultimate movie movies!",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino is incredibly intense in this classic thriller",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of the 70's, one of Al Pacino's greatest performances.  A classic in every sense of the word.",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I walked into this film expecting the end-all be-all of cop movies, and didn't leave satisfied at all (I suppose it was built up quite a bit too much for me).  This is solid film with a very decent story, but it's far from Pacino's best or even the top ten of cop flicks.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an oddly warm and electrifying Pacino character piece with nothing wrong with it apart from the fact that it barely has an ending.",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino fully inhabits the cop trying to blow the lid off the whole corrupt system, and Lumet's gritty style captures the atmosphere of New York in the disillusioned, decaying '70s, but the slow pacing and a muddled, unfocused script short-changes SERPICO's potential.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good police drama. Not anywhere near as a good as Pacino's films with De Palma though.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "own it the real Serpico came to my High School oh so many years ago actually met the real Serpico for about 60 seconds",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think this movie holds up very well. I could see how it would have been a big deal in the 70's. Al Pacino (who is very good as usual) plays a hippie cop who's against corruption and \"the man\". Unfortunately nothing really happens in the movie. Besides constant conflict and Pacino yelling about this and that before the movie ends on kind of a flat note. Really cool depiction of the 1970's in new york but feature a lot of weird sound editing and some \"hip\" film techniques that never really caught on. Al as the main character isn't really all that likable either. I wish we had some basis on why he is so against corruption. But we really don't. I enjoyed the first half hour of the film immensely but after that. Blah",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first hour I found hard to sit through, but second hour stars getting good.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kudos to someone who stands his ground for what is right! Pacino is great as the lead character role!",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent early Pacino flick.  Totally entertaining",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captures a man's struggle to maintain honor in the midst of corruption.",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boosted by Al Pacino's wonderful performance as one of the only cop in town who isn't corrupt, Serpico is a fine lesson on discipline directed by Sidney Lumet.",
            "review_date": "2012-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino's finest performance and an unforgettable film.",
            "review_date": "2012-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino is really great in this movie, and he brings the role to life with his engrossing performance.",
            "review_date": "2012-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't remember much about this movie. very forgettable",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it to bits albeit being too jumpy.",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sidney Lumet's Serpico is a brilliant piece of drama that has a stellar cast and terrific story. This is among the greatest dramas ever put on celluloid. Lumet understands how to craft a solid picture, and he takes his time to craft a film that tells an engaging story with phenomenal characters. This film tells the real life story of Frank Serpico, an honest cop working in a corrupt environment. Brilliantly acted by Al Pacino, the lead character is a powerful tour de force performance that ranks among the actors greatest works. This is a brilliant film that delivers a great story, and you sympathize with the lead character because Al Pacino has so much screen presence that you simply cannot tear yourself away from the screen. Very well crafted, directed and paced, Serpico is yet another flawless masterwork by director Sidney Lumet who can always craft a thought provoking work of cinema. I thoroughly enjoyed the film, and I was mesmerized by Pacino who is absolutely terrific here. This was made during his peak years, and he was on a roll with making great films. This is a fine crime drama that should appeal to viewers of the genre, and if you love true life picture, then Serpico is definitely not a film to pass up on. Lumet's flair for what makes an effective story is apparent throughout, and he is able to get the most out of his actors because he always seems to have great stories to tell, and this is such an example of a film that needed to be told because true stories are simply compelling and engaging and Lumet definitely captures the feel and essence of its key elements. Frank Serpico's determination of uncovering the corruption in the NYPD is terrific and his inner conflict and subsequent struggle to do what's right is what keeps you hooked from start to finish. An unforgettable drama definitely worth your time.",
            "review_date": "2012-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino, is the mine! and he delivers again in this fine film. Definitely worth a viewing.",
            "review_date": "2012-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done script, loaded with quotes. Al is a bad arse here.",
            "review_date": "2012-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this one.  Honest plain-clothes cop comes under fire from peers for refusing bribes and posing a threat to their lucrative side business.  The cops seem dirtier than most criminals and probably some truth to it.  Pacino in top form once again.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor Paco. Sucks to be him.\r\n\r\n2008 Movies: 94",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AN EXAMPLE OF SO QUALIFITED OFFICER DEAR FRANKY SERPICO FIDELITY,LOYALTY LIVING LEGEND RETIRED COP TO HIS COUNTRY LIKE AN ITALIAN AMERICAN CITIZENSHIP FIGHTING CRIME IN THE DANGEROUS STREETS FROM NYC! A TRULY HISTORIC HEROE.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie, sadly didn't do much for me. Nothing stayed with me past the ending and I am baffled as to how this has received so much acclaim. It's a decent movie, but feels as though it was only Pacino who put his heart into it.",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow paced without being boring, based on a true life story, one man takes on police corruption.",
            "review_date": "2012-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is probably a little overated.  Great performance by Pachino, but slow paced and long.",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can wait for this one to come out as a \"Cine de Gala\" on Telemundo!",
            "review_date": "2012-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino never better, nor better looking than in Serpico\nGood movie too!",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow starting film, that's made out to question everything you thought you knew was right and wrong.\nDirector and Actor extrodinaire Al Pacino praises a police officer who chose to blow the whisel on his own kind (NYPD).\nAt first glance you'd think that Serpico was a traitor or worse... but as you follow the storyline you'll find yourself immersed in a tangled debockle. The film questions your morals and beliefs. Like: is being to honest always good for you?",
            "review_date": "2012-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply put, this is one of the most badass cop movies ever made.  This is Pacino at his finest.  An American classic that blends societal change and police corruption as if they were pancakes and maple syrup.  A must-see.",
            "review_date": "2012-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'ma grow my beard like Frank Serpico",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started going to movies at this time great start for me.",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remarkable record of one man's rebellion against the sort of sleaziness and second-rateness that has affected so much American life, from the ingredients of its hamburgers to the ethics of its civil servants and politicians.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I appreciate Lumet's dedication to the facts of the story (minus some minor changes for ease of storytelling) and the lack of melodrama or sensationalism. Pacino carries the film effectively and gives a supremely memorable performance. I would like to watch this again.",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another good al pacino movie",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An honest New York cop (Al Pacino) tries to stand up against corruption in the police force in Sidney Lumet's drama, Serpico, which is supposedly based on a true story. Let's not beat it around the bush, there are too many films about cops or detectives and I am frankly getting very tired of them. The fact is that criminals and \"ordinary\" people are more fascinating characters than cops since their theories are more interesting. Since Serpico does very little with its story and characters to keep us watching what's on screen, that must mean that it's just another dull, stale cop drama.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid, if not classic, film portraying the real life story of Frank Serpico.  Fighting corruption at every turn, Pacino is predictably excellent.  Every other character though is shallow and poorly developed, especially the female roles.",
            "review_date": "2012-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wait, a crime film directed by Sidney Lumet and starring Al Pacino as a guy named Frank? Is anyone else noticing that Al Pacino seems to really dig the name Frank? Seriously, I knew that it wasn't \"that\" kind of a romantic comedy (You get what I'm saying, fans of \"I Love You Phillip Morris\"?), but I was having a hard time figuring out whether Pacino was Frankie or Johnny (Johnny could be the girl's name, you never know how cruel someone's parents can be), yet with this film, there was only one lead, his name was Frank, and you better believe that it was the first of... well, only three Franks (I like to exaggerate when people do something more than once or twice) to be played by Pacino, because this film is nothing if it's not without aspects that you remember from other Pacino films, and certainly other Sidney Lumet films. Well, to be fair, this crime film is a little bit different from Lumet's usual work, because this time, it's about the cops... conducting criminal activity. Still, outside of this film, about the furthest Lumet went from the crime genre was \"The Wiz\", and even then, I can think of plenty of people who would consider \"The Wiz\" some kind of crime, and plus, it was the usual 130-something-minute runtime that Lumet seemed to loved hitting. I don't know how you make a Motwon twist on \"The Wizard of Oz\" over 130 minutes, but boy, did Lumet go for it, because he seemed to love a good challenge, and the 130-something-minute region on a film runtime clock seems to be one of those in-between regions that's hard to hit. I know that sounds weird, but hey, just look at this film, because it seemed to be having trouble making it between 120 and 140, for although it's quite the decent watch, it goes held back quite a bit by its needing some serious tightening.\r\n\r\nThe film has plenty of looseness, going padded out by overdrawn material or material that is simply expendable, with even rather large chunks of the film warranting complete omission. The film will hit the occasional subplot or simply a lengthy point of nothing that's really relevant to the central story, and segments like those slow plot down, sometimes even to a halt, as they have little, if any considerable value in the film and simply leave the final product to suffer from uneven focus. All of this excessive padding certainly exacerbates the film's fair bit of slowness. With the help of the aforementioned dragging, the film often finds itself falling limp, with quiet dryness or nothingness also really slowing, if not all-out dulling things down, perhaps even more, as the dryer spots in the film will even work their way into the more relatively tight and focused segments, and after a while, for a lengthy lapse of time within this film, you lose a bit of engagement value and investment. Sure, the larger chunks of the film that actually play up the central focus pull you back in, yet they still go kept from really hitting all that deep all that often, and not just because the film is otherwise quite messy, but because there are plenty of dramatic touches whose effectiveness goes diluted by a bit of manipulativeness that will sometimes descend as low as overwhelming sentimentality. The film has its high points, but for far too long, it is borderline aimless, yet quite decidedly consistent in its slowness, and by the time things really do pick up, the film has lost so much steam that the kick of the thrills go pulled back to the point of being rendered incapable of raising the final product past underwhelming. Still, make no mistake, this film has high points, and just enough for it to stand as generally worth your time, while certain consistent aspects keep you engaged throughout, or at least your eyes engaged.\r\n\r\nArthur J. Ornitz's isn't used to the fullest terribly often, and sometimes, things are just too blasted dark, yet regardless of these factors against the photography, the film is consistently rather handsome in an admittedly dated fashion, but one that still works a fair bit, both as something pretty to look at and as a supplement to the film's tone. Again, the film will get to be too blasted dark for its own good, but more often than not, when the photography turns dark, the film's tone turns dark with it and recieves an extra kick of effectiveness through the cinematography's grit, which really captures the harsh griminess of the situation, and certainly more than Waldo Salt's and Norman Wexler's actually kind of cruddy score does. Still, it's not just Ornitz's photography direction that gives the periodic grit some life, as it's Sidney Lumet general film direction that empowers this film's intrigue... as much as it cripples it. As I said, for most of the film, nothing happens and Sidney Lumet's limp storytelling doesn't help in the least, yet he does give the film a certain consistent charm to keep you going until the film comes to its higher moments, at which point, Lumet wakes up and delivers on engrossing intrigue, if not a bit of genuine tension at points, and it all comes down to dramatic depths that may go hurt Lumet's fairly intense manipulativeness, yet still pull through enough to give the film additional weight in order to make its final messages all the more provocative. Yes, the strengths of the film, like the whole final product itself, are consistently imperfect or even downright flawed, yet they do hit enough of their fair share of high points that ultimately make it worth the sit. However, there is an aspects that never faults, and that is, of course, Al Pacino's performance, which is thoroughly charismatic, as well as effortlessly faithful to the traits and characteristics of Frank Serpico, so much so that Pacino comes close to becoming lost in the role, yet not at the expense of his almost trademark charm. However, when things go down, Pacino is yet another supplement to the compellingness, as he really puts in a lot of subtle depth and layers, as well as intense emotion that gives us genuine insight into the honesty, anguish and overall being of our lead, thus solidifying Pacino as not simply a powerful lead, but one of, if not the greatest aspect to this film's ultimately emerging a watchable film, however flawed it may be.\r\n\r\nWhen it's all said and done, the film is rendered underwhelming by its consistent slowness that borders on, if not collapses into dull, a situation exacerbated by the excessive looseness of the film that leaves many a scene to drag and many a subplot or segment of nothingness to slow the momentum of the film until, after a while, it goes limp, yet not to where it's rendered dismissable, let alone medicore, keeping your eyes caught with Arthur J. Ornitz's imperfect, yet generally handsome and occasionally even resonance-supplementing cinematography, as well as Sidney Lumet's also imperfect, but consistently charming and, eventually, powerfully intriguing storytelling, with Al Pacino being unflinching in his thoroughly charismatic, layered, emotional and all around transformative performance as the honest cop who famously made a stand for proper justice, thus leaving \"Serpico\" to ultimately stand as a thoroughly watchable, periodically gripping and ultimately provocative drama, heavily flawed though, it may be.\r\n\r\n2.5/5 - Fair",
            "review_date": "2012-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacino in his prime. When all he could make was really great movies.",
            "review_date": "2012-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it for the first time. It was alright. Pacino had some interesting outfits!",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent vehicle for Al Pacino and his beard.",
            "review_date": "2012-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like Martin Scorsese and Robert De Niro's brilliant pairing in Mean Streets, Serpico is yet another perfect pairing between Sidney Lumet and Al Pacino, in a gritty, dirty cop drama, with a bar-setting performance from Pacino, himself. With no wasted scenes, precise dialogue, and an image of New York that still holds up to this day, Serpico makes a run at being a perfect classic film.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the first movie I ever saw Pacino in and I was truly impressed with his performance and have never been disappointed with one since.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino puts on an acting workshop although I'm only moderately keen on the rest of the film.  Not one of my favorites from Sidney Lumet.",
            "review_date": "2012-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the first movie I ever saw Pacino in and I was truly impressed with his performance and have never been disappointed with one since.",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best cop films you'll find. It's right up there with LA Confidential in my opinion.\nDon't get me wrong, it has its flaws, like the fact that the Jesus look-alike title character becomes a bit one-dimensional as the movie progresses, but it's still a darn good yarn, and a true one at that.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So slow I lost interest.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serpico is a classic movie about police corruption in New York City. The story was interesting, but I times I felt bored watching the movie and the plot was a bit confusing and hard to follow at times. However, the entire movie is lifted by Al Pacino's stellar performance. This famous performance is known as the first of numerous powerhouse performances by Pacino. Because of Pacino, the movie works very well and it kept my attention throughout the most of movie. At times, Serpico was even though-provoking and gripping. I would strongly recommend this movie to fans of classic movies and to Al Pacino fans.",
            "review_date": "2012-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. When they say they don't make films like THAT anymore, this is what they're referring to. No CGI special effects, teriffic acting, directing, and a superb adapted screenplay make this one of the iconic American movies of the 70's.  Based on a true story of a NYPD idealistic policeman and his encounter with inside corruption of the force. Should be considered a bookend to \"The Godfather\" in that the two encapulated organizations (NYPD and the Mafia) operate with their own sense of morality, intersecting at the common interface of money.",
            "review_date": "2012-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Lumet's weaker efforts.",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Al Pacino at his best",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Serpico\" is indeed a great and engrossing crime film. Al Pacino's standout performance as the titular character is mainly what to watch for, but there are other great aspects as well, such as the gritty urban locations and fine cinematography. The script has its share of problems and a lot of relationships amongst characters are undercooked, and the score often doesn't mix well with the action, but I had a great time watching \"Serpico.\" Great work from Lumet.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        }
    ]
}